[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Blessed is he.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Last words to Daniel. He shall rest in the grave, and stand up in his own lot at the end of the days.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:5-13 One of the angels asking how long it should be to the end of these wonders, a solemn reply is made, that it would be for a time, times, and a half, the period mentioned ch. 7:25, and in the Revelation. It signifies 1260 prophetic days or years, beginning from the time when the power of the holy people should be scattered. The imposture of Mohammed, and the papal usurpation, began about the same time; and these were a twofold attack upon the church of God. But all will end well at last. All opposing rule, principality, and power, shall be put down, and holiness and love will triumph, and be in honour, to eternity. The end, this end, shall come. What an amazing prophecy is this, of so many varied events, and extending through so many successive ages, even to the general resurrection! Daniel must comfort himself with the pleasing prospect of his own happiness in death, in judgment, and to eternity. It is good for us all to think much of going away from this world. That must be our way; but it is our comfort that we shall not go till God calls us to another world, and till he has done with us in this world; till he says, Go thou thy way, thou hast done thy work, therefore now, go thy way, and leave it to others to take thy place. It was a comfort to Daniel, and is a comfort to all the saints, that whatever their lot is in the days of their lives, they shall have a happy lot in the end of the days. And it ought to be the great care and concern of every one of us to secure this. Then we may well be content with our present lot, and welcome the will of God. Believers are happy at all times; they rest in God by faith now, and a rest is reserved for them in heaven at last.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blessed is he that waiteth - This indicates a patient expectation of an event that was to occur, and the happy state of him who would reach it. The angel refers to another period different from the \"time, and times, and an half,\" and different also from the twelve hundred and ninety days. He speaks of this as the consummation - as the desirable time; and pronounces him blessed who shall be permitted to see it. The idea here is, that of one looking out for this as a happy period, and that he would be regarded as a happy man who should live in that age.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And cometh to - literally, \"touches.\" That is, whose life would reach to that time; or who would not be cut off before that period.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The thousand three hundred and five and thirty days - The article is not used in the original, and its insertion here seems to make the period more distinct and definite than it is necessarily in the Hebrew. There is much apparent abruptness in all these expressions; and what the angel says in these closing and additional communications has much the appearance of a fragmentary character - of hints, or detached and unexplained thoughts thrown out on which he was not disposed to enlarge, and which, for some reason, he was not inclined to explain. In respect to this period of 1335 days, it seems to stand by itself. Nothing is said of the time when it would occur; no intimation is given of its commencement, as in the former cases - the terminus a quo; and nothing is said of its characteristics further than that he would be blessed who should be permitted to see it - implying that it would be, on some accounts, a happy period. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The thousand three hundred and five and thirty days - The article is not used in the original, and its insertion here seems to make the period more distinct and definite than it is necessarily in the Hebrew. There is much apparent abruptness in all these expressions; and what the angel says in these closing and additional communications has much the appearance of a fragmentary character - of hints, or detached and unexplained thoughts thrown out on which he was not disposed to enlarge, and which, for some reason, he was not inclined to explain. In respect to this period of 1335 days, it seems to stand by itself. Nothing is said of the time when it would occur; no intimation is given of its commencement, as in the former cases - the terminus a quo; and nothing is said of its characteristics further than that he would be blessed who should be permitted to see it - implying that it would be, on some accounts, a happy period. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. from … sacrifice … taken way … abomination—(Da 11:31). As to this epoch, which probably is prophetically germinant and manifold; the profanation of the temple by Antiochus (in the month Ijar of the year 145 B.C., till the restoration of the worship by Judas Maccabeus on the twenty-fifth day of the ninth month [Chisleu] of 148 B.C., according to the Seleucid era, 1290 days; forty-five days more elapsed before Antiochus' death in the month Shebat of 148 B.C., so ending the Jews' calamities [Maurer]); by pagan Rome, after Christ's death; by Mohammed; by Antichrist, the culmination of apostate Rome. The \"abomination\" must reach its climax (see Auberlen's translation, \"summit,\" Da 9:27), and the measure of iniquity be full, before Messiah comes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thousand two hundred and ninety days—a month beyond the \"time, times, and a half\" (Da 12:7). In Da 12:12, forty-five days more are added, in all 1335 days. Tregelles thinks Jesus at His coming will deliver the Jews. An interval elapses, during which their consciences are awakened to repentance and faith in Him. A second interval elapses in which Israel's outcasts are gathered, and then the united blessing takes place. These stages are marked by the 1260, 1290, and 1335 days. Cumming thinks the 1260 years begin when Justinian in A. D. 533 subjected the Eastern churches to John II, bishop of Rome; ending in 1792, when the Code Napoleon was established and the Pope was dishonored. 1290 reach to 1822, about the time of the waning of the Turkish power, the successor to Greece in the empire of the East. Forty-five years more end in 1867, the end of \"the times of the Gentiles.\" See Le 26:24, \"seven times,\" that is, 7 X 360, or 2520 years: 652 B.C. is the date of Judah's captivity, beginning under Manasseh; 2520 from this date end in 1868, thus nearly harmonizing with the previous date, 1867. See on [1114]Da 8:14. The seventh millenary of the world [Clinton] begins in 1862. Seven years to 1869 (the date of the second advent) constitute the reign of the personal Antichrist; in the last three and a half, the period of final tribulation, Enoch (or else Moses) and Elijah, the two witnesses, prophesy in sackcloth. This theory is very dubious (compare Mt 24:36; Ac 1:7; 1Th 5:2; 2Pe 3:10); still the event alone can tell whether the chronological coincidences of such theories are fortuitous, or solid data on which to fix the future times. Hales makes the periods 1260, 1290, 1335, begin with the Roman destruction of Jerusalem and end with the precursory dawn of the Reformation, the preaching of Wycliffe and Huss.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " These days are either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Natural days, and properly so called, and so the times of Antiochus are hereby noted. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Prophetical days, a day for a year, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 4:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and thus one thousand two hundred and ninety days is forty-two months, which if we multiply at thirty days the month make the sum one thousand two hundred and ninety. Here many learned expositors fall in together to that opinion of calculating these years by days, beginning the one thousand two hundred and ninety days from the profaning of the temple to the letter of king Antiochus to the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "/APC 2Ma 11:27",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "/APC ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Ma 11:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so make them to end exactly then: and concerning the abomination of desolation, whereof see what is said ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 7:25 8:14 9:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 8:14 9:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", being the epoch from Apollonius’s coming, who was called the prince of abominations, or from the worship of God forbidden by Antiochus, and at last restored by Judas Maccabeus, and confirmed by Antiochus, from thence to the death of Antiochus are fortyfive days, which added to one thousand two hundred and ninety make one thousand three hundred and thirty-five; but this is a false account, and contrary to the scope of this place, and to history and chronology, which the learned Joseph Mede hath proved at large, Lib. Oper. III. p. 882. The Jews make these days, i.e. years, to end at the coming of Christ, but uncertainly when to begin their reckoning, but have been often and grossly deceived. Sound Christians refer it to the second coming of Christ. Mr. Mede makes the chief revelation of antichrist to be in 1123. The latter number of one thousand three hundred and thirty-five ends in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "anno Christi",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1168; and so the type of antichrist, which is Antiochus Epiphanes, leads us by the hand to the revelation of antichrist, which fell out ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "anno 1106 to anno 1120",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; between which time the papal power was highly mounted, the church greatly persecuted, after that great numbers of them had separated from the abominations of Rome, openly declaring it to be antichristian. Therefore the angel saith, the saints by their trials ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shall be purified and made white, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, by those cruel persecutions which befell them, from their ignorant and enraged enemies, who went on to do wickedly and did not understand. How this is further cleared, and why the angel makes use of the Roman supputation in this case, namely, by indictions, and how it answers and resolves the case, see in the forecited author. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blessed is he that waiteth, and cometh to the one thousand three hundred five and thirty days. Which is an addition of forty five days or years more, beginning at the end of one thousand two hundred and ninety, and make up this sum; during which time the vials will be poured out upon all the antichristian states, and the Turkish empire be destroyed, and all the enemies of Christ and his church removed, and clear way made for the setting up of his kingdom in the world in a more visible and glorious manner; and therefore happy is the man that will be found waiting for these times, and live to enjoy them. There are various ways taken in the computation and application of these one thousand three hundred and thirty five days by Jews and Christians. Lipman (p) the Jew makes them to be the same with \"time\", and \"times\", and \"half a time\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"time\" he supposes, designs the space of four hundred and eighty years, from the Israelites going out of Egypt to the building of the first temple; times the space of four hundred and ten years which is as long as that temple stood; and \"half a time\" half of these two spaces, that is, four hundred and forty five years; all which make up one thousand three hundred and thirty five; but strange it is that time should signify a larger space than \"times\". Much more ingenious is the computation of Jacchiades on the text, who makes the account to describe the space of time from the days of Daniel to the end of the world. He supposes there were three thousand three hundred and ninety one years, from the beginning of the world to Daniel; he then takes and joins the one thousand two hundred and ninety days in the preceding verse, which he understands of years with the one thousand three hundred and thirty five days or years in this, which make together two thousand six hundred and twenty five; and, added to the above, the whole is six thousand and sixteen years; which agrees with the opinion of Elias, in the Talmud (q), that the world shall stand six thousand years. Many Christian interpreters (r) apply it to the times of Antiochus; and reckon them thus, understanding them of days; and not years; from the time of his taking away the daily sacrifice, to the restoration of it by Judas Maccabaeus, were three years and a half and some days, in all one thousand two hundred and ninety, as in the preceding verse; during which time the temple was profaned by idolatrous worship, the altar demolished, and the daily sacrifice ceased, and was a time of great distress with the Jews; and which, though greatly alleviated by the success of Judas, yet their calamities were not over until the death of Antiochus, which happened forty five days after; and these, added to the above number, make one thousand three hundred and thirty five days; at the close of which it was happy times with them, being delivered from so cruel and powerful an enemy; and therefore blessed were they that waited and came to this time. This passage Mr. Brightman applies to the Turkish empire; and thinks that time, and times, and half a time; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", measure the space of the power of that empire; \"time\" signifying one hundred years; \"times\" two hundred years; \"half a time\", fifty years; in all three hundred and fifty years; which added to one thousand three hundred, when that empire began, the date ends in one thousand six hundred and fifty, when he supposes, it would begin to decline; to which, if you add forty five days or years, as here, it will bring it down to one thousand six hundred and ninety five, when he thought it would be utterly extinct; but time has shown this to be a mistake. Mr. Mede (s) thinks these numbers are to be reckoned from the profanation of the temple by Antiochus; and that the first number, one thousand two hundred and ninety, ended in the year of Christ one thousand one hundred and twenty three, when antichrist was come to his height, and was discerned by many to be the person that was prophesied of as such; and the latter number, one thousand three hundred and thirty five ended in the year of Christ one thousand one hundred and sixty eight, when the Waldenses, Albigenses, and others separated from the church of Rome as antichristian, upon which violent persecutions were raised upon them: but then not happy, but miserable times, followed on these; unless this blessedness spoken of is to be applied to the martyrs that died for the sake of Christ, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Another learned man (t) was of opinion that these numbers are to be counted from the destruction of Jerusalem by Titus Vespasian, A.D. 71, from whence the first number fell on the year 1361, at which time the school at Prague was founded by Charles king of Bohemia, and the errors and tyranny of antichrist began to be openly opposed by the same; and the second number ended in the year 1406, when the light of the Gospel broke out more clearly; so that the angel here pronounces those blessed who overlived these first seeds of the Gospel being brought to light; but something of great importance and cause of more joy, is here intended. Wherefore, upon the whole, it seems best to interpret these numbers as at first, of the date of the reign of antichrist, and as showing the full and certain end of it; when there will be blessed times, halcyon days indeed! ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Nizzachon, No. 332. (q) T. Bab. Sanhedrin, fol. 97. 1.((r) Broughton in loc. L'Empereur, Not. in Jacchiad. in loc. Huls. Theolog. Jud. par. 1. p. 77, 78. (s) Works, B. 3. p. 720. (t) Henr. Wolphius lib. de tempore apud Brightman in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) Nizzachon, No. 332. (q) T. Bab. Sanhedrin, fol. 97. 1.((r) Broughton in loc. L'Empereur, Not. in Jacchiad. in loc. Huls. Theolog. Jud. par. 1. p. 77, 78. (s) Works, B. 3. p. 720. (t) Henr. Wolphius lib. de tempore apud Brightman in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Blessed is he that waiteth, and cometh to the thousand three hundred and {n} five and thirty days.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Blessed ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he that waiteth, and cometh to the thousand three hundred and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " five and thirty days.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) In this number he adds a month and a half to the former number, signifying that it is not in man to appoint the time of Christ's coming, but that they are blessed that patiently wait for his appearing.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " Happy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he that waiteth, and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "attaineth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thousand three hundred",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "five and thirty days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Happy is he who waits (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘happy are all they that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wait",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for him,’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 64:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), not giving up his trust in Jehovah, for 45 days (= 1½ month) beyond the 1290 days mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 12:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Why this further limit is assigned, it is impossible to say with any certainty. All that can be said is that the turning-point (whatever it may have been), marked by the close of the 1290 days, was not pictured by the author as introducing at once the period of complete blessedness—this he did not conceive as beginning for 45 days afterwards. What he imagined as the cause of the postponement must remain matter of speculation: if the 1290 days are rightly interpreted as ending with the death of Antiochus, he may have thought, for instance, that its full effects would not appear at once, and that true rest would not begin for the Jews till after a short interval more.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Blessed is he that waiteth, and cometh to the thousand three hundred and five and thirty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " None of the versions occasion any remark. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Blessed is he that waiteth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It might be rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Oh the blessed-nesses of him that waiteth!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This implies that forty-five days or years after the unknown event that terminates the twelve hundred and ninety days, another event of yet more surpassing interest, and fraught with yet greater benefit, shall occur. It seems most natural to regard this period as including in it that which precedes, though there is no grammatical reason why this period should not commence at the expiry of the twelve hundred and ninety days. In the latter case we are fully more at sea than before. Daniel 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The angel gives to the prophet yet one revelation more regarding the duration of the time of tribulation and its end, which should help him to understand the earlier answer. The words, \"from the time that the daily sacrifice shall be taken away, and the abomination of the desolation,\" so distinctly point back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that they must here be referred, as there, to the wickedness of Antiochus in his desecrating the sanctuary of the Lord. The circumstance that the שׁקּוּץ (abomination) is here described as שׁמם and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as משׁמם, indicates no material distinction. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the subject spoken of is the proceedings of the enemy of God causing desolation, the abomination is viewed as משׁמם, bringing desolation; here, with reference to the end of those proceedings, as שׁמם, brought to desolation; cf. under ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All interpreters therefore have found in these two verses statements regarding the duration of the persecutions carried on by Antiochus Epiphanes, and have sought to compare them with the period of 2300 evening-mornings mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in order thus to reckon the duration of the time during which this enemy of God shall prosecute his wicked designs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But as the opinion is regarding the reckoning of the 2300 evening-mornings in Daniel 8:14 are very diverse from each other, so also are they here. First the interpretation of ולתת (and set up) is disputed. Wieseler is decidedly wrong in thinking that it designates the terminsu ad quem to הוּסר מעת (from the time shall be removed), as is generally acknowledged. Hitzig thinks that with ולתת the foregoing infin. הוּסר is continued, as Ecclesiastes 9:1; Jeremiah 17:10; Jeremiah 19:12, and therewith a second terminus a quo supposed. This, however, is only admissible if this second terminus stands in union with the first, and a second terminus ad quem also stands over against it as the parallel to the later terminus ad quem. Both here denote: the daily sacrifice shall be taken away forty-five days before the setting up of the βδέλυγμα ἐρημώσεως, and by so much the date in Daniel 12:12 comes below that of Daniel 12:11. According to this, both verses are to be understood thus: from the time of the taking away of the daily sacrifice as 1290 days, and from the time of the setting up of the abomination of desolation are 1335 days. But this interpretation is utterly destitute of support. In the first place, Hitzig has laid its foundation, that the setting up of the idol-abomination is separated from the cessation of the worship of Jehovah by forty-five days, only by a process of reasoning in a circle. In the second place, the המחכּה אשׁרי (blessed is he that waiteth), Daniel 12:12, decidedly opposes the combining of the 1335 days with the setting up of the idol-abomination; and further, the grammatical interpretation of ולתת is not justified. The passages quoted in its favour are all of a different character; there a clause with definite time always goes before, on which the infinitive clause depends. Kranichfeld seeks therefore to take הוּסר also not as an infinitive, but as a relative asyndetical connection of the praeter. proph. to עת, by which, however, no better result is gained. For with the relative interpretation of הוּסר: the time, since it is taken away ...  ולתת cannot so connect itself that this infinitive yet depends on עת. The clause beginning with ולתת cannot be otherwise interpreted than as a final clause dependent on וגו הוּסר מעת; thus here and in Daniel 2:16, as in the passages quoted by Hitzig, in the sense: to set (to set up) the abomination, so that the placing of the abomination of desolation is viewed as the object of the taking away of the תּמיד (daily sacrifice). From this grammatically correct interpretation of the two clauses it does not, however, follow that the setting up of the idol-abomination first followed later than the removal of the daily sacrifice, so that ולתת signified \"to set up afterwards,\" as Kliefoth seeks to interpret it for the purpose of facilitating the reckoning of the 1290 days. Both can be done at the same time, the one immediately after the other.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But as the opinion is regarding the reckoning of the 2300 evening-mornings in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are very diverse from each other, so also are they here. First the interpretation of ולתת (and set up) is disputed. Wieseler is decidedly wrong in thinking that it designates the terminsu ad quem to הוּסר מעת (from the time shall be removed), as is generally acknowledged. Hitzig thinks that with ולתת the foregoing infin. הוּסר is continued, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 9:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and therewith a second terminus a quo supposed. This, however, is only admissible if this second terminus stands in union with the first, and a second terminus ad quem also stands over against it as the parallel to the later terminus ad quem. Both here denote: the daily sacrifice shall be taken away forty-five days before the setting up of the βδέλυγμα ἐρημώσεως, and by so much the date in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " comes below that of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". According to this, both verses are to be understood thus: from the time of the taking away of the daily sacrifice as 1290 days, and from the time of the setting up of the abomination of desolation are 1335 days. But this interpretation is utterly destitute of support. In the first place, Hitzig has laid its foundation, that the setting up of the idol-abomination is separated from the cessation of the worship of Jehovah by forty-five days, only by a process of reasoning in a circle. In the second place, the המחכּה אשׁרי (blessed is he that waiteth), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", decidedly opposes the combining of the 1335 days with the setting up of the idol-abomination; and further, the grammatical interpretation of ולתת is not justified. The passages quoted in its favour are all of a different character; there a clause with definite time always goes before, on which the infinitive clause depends. Kranichfeld seeks therefore to take הוּסר also not as an infinitive, but as a relative asyndetical connection of the praeter. proph. to עת, by which, however, no better result is gained. For with the relative interpretation of הוּסר: the time, since it is taken away ...  ולתת cannot so connect itself that this infinitive yet depends on עת. The clause beginning with ולתת cannot be otherwise interpreted than as a final clause dependent on וגו הוּסר מעת; thus here and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as in the passages quoted by Hitzig, in the sense: to set (to set up) the abomination, so that the placing of the abomination of desolation is viewed as the object of the taking away of the תּמיד (daily sacrifice). From this grammatically correct interpretation of the two clauses it does not, however, follow that the setting up of the idol-abomination first followed later than the removal of the daily sacrifice, so that ולתת signified \"to set up afterwards,\" as Kliefoth seeks to interpret it for the purpose of facilitating the reckoning of the 1290 days. Both can be done at the same time, the one immediately after the other.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A terminus ad quem is not named in both of the definitions. This appears from the words \"blessed is he that waiteth ... .\" By this it is said that after the 1335 days the time of tribulation shall be past. Since all interpreters rightly understand that the 1290 and the 1335 days have the same terminus a quo, and thus that the 1290 days are comprehended in the 1335, the latter period extending beyond the former by only forty-five days; then the oppression cannot properly last longer than 1290 days, if he who reaches to the 1335 days is to be regarded as blessed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With regard to the reckoning of these two periods of time, we have already shown that neither the one nor the other accords with the 2300 evening-mornings, and that there is no ground for reckoning those 2300 evening-mornings for the sake of these verses before us as 1150 days. Moreover, we have there already shown how the diversity of the two statements is explained from this, that in Daniel 8:14 a different terminus a quo is named from that in Daniel 12:11.; and besides have remarked, that according to 1 Macc. 1:54, 59, cf. with 4:52, the cessation of the Mosaic order of worship by sacrifice lasted for a period of only three years and ten days. Now if these three years and ten days are reckoned according to the sun-year at 365 days, or according to the moon-year at 354 days with the addition of an intercalary month, they amount to 1105 or 1102 days. The majority of modern interpreters identify, it is true, the 1290 days with the 3 1/2 times ( equals  years), and these two statements agree so far, since 3 1/2 years make either 1279 or 1285 days. But the identifying of the two is not justified. In Daniel 12:11 the subject plainly is the taking away of the worship of Jehovah and the setting up of the worship of idols in its stead, for which the Maccabean times furnish an historical fulfilment; in Daniel 12:7,however, the angel speaks of a tribulation which extends so far that the strength of the holy people is altogether broken, which cannot be said of the oppression of Israel by Antiochus, since a stop was put to the conduct of this enemy by the courageous revolt of the Maccabees, and the power of valiant men put an end to the abomination of the desolation of the sanctuary. The oppression mentioned in Daniel 12:7 corresponds not only in fact, but also with respect to its duration, with the tribulation which the hostile king of the time of the end, who shall arise from the fourth world-kingdom, shall bring upon the holy people, since, as already remarked, the 3 1/2 times literally correspond with Daniel 7:25. But Daniel 12:11 and Daniel 12:12 treat of a different, namely, an earlier, period of oppression than Daniel 12:7, so the 1290 and the 1335 days are not reckoned after the 3 1/2 times (Daniel 12:11 and Daniel 7:35); and for the Maccabean period of tribulation there remain only the 2300 evening-mornings (Daniel 8:14) for comparison, if we count the evening-mornings, contrary to the usage of the words, as half-days, and so reduce them to 1150 days. But if herewith we take into consideration the historical evidence of the duration of the oppression under Antiochus, the 1290 days would agree with it only if we either fix the taking away of the legal worship from 185 to 188 days, i.e., six months and five or eight days, before the setting up of the idol-altar on Jehovah's altar of burnt-offering, or, if these two facta occurred simultaneously, extend the terminus ad quem by six months and five or eight days beyond the day of the re-consecration of the altar. For both suppositions historical evidence is wanting. The former is perhaps probable from 1 Macc. 4:45, cf. with v. 54; but, on the contrary, for the second, history furnishes no epoch-making event of such significance as that the cessation of the oppression could be defined by it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With regard to the reckoning of these two periods of time, we have already shown that neither the one nor the other accords with the 2300 evening-mornings, and that there is no ground for reckoning those 2300 evening-mornings for the sake of these verses before us as 1150 days. Moreover, we have there already shown how the diversity of the two statements is explained from this, that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a different terminus a quo is named from that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".; and besides have remarked, that according to 1 Macc. 1:54, 59, cf. with 4:52, the cessation of the Mosaic order of worship by sacrifice lasted for a period of only three years and ten days. Now if these three years and ten days are reckoned according to the sun-year at 365 days, or according to the moon-year at 354 days with the addition of an intercalary month, they amount to 1105 or 1102 days. The majority of modern interpreters identify, it is true, the 1290 days with the 3 1/2 times ( equals  years), and these two statements agree so far, since 3 1/2 years make either 1279 or 1285 days. But the identifying of the two is not justified. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the subject plainly is the taking away of the worship of Jehovah and the setting up of the worship of idols in its stead, for which the Maccabean times furnish an historical fulfilment; in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",however, the angel speaks of a tribulation which extends so far that the strength of the holy people is altogether broken, which cannot be said of the oppression of Israel by Antiochus, since a stop was put to the conduct of this enemy by the courageous revolt of the Maccabees, and the power of valiant men put an end to the abomination of the desolation of the sanctuary. The oppression mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " corresponds not only in fact, but also with respect to its duration, with the tribulation which the hostile king of the time of the end, who shall arise from the fourth world-kingdom, shall bring upon the holy people, since, as already remarked, the 3 1/2 times literally correspond with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " treat of a different, namely, an earlier, period of oppression than ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so the 1290 and the 1335 days are not reckoned after the 3 1/2 times (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and for the Maccabean period of tribulation there remain only the 2300 evening-mornings (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") for comparison, if we count the evening-mornings, contrary to the usage of the words, as half-days, and so reduce them to 1150 days. But if herewith we take into consideration the historical evidence of the duration of the oppression under Antiochus, the 1290 days would agree with it only if we either fix the taking away of the legal worship from 185 to 188 days, i.e., six months and five or eight days, before the setting up of the idol-altar on Jehovah's altar of burnt-offering, or, if these two facta occurred simultaneously, extend the terminus ad quem by six months and five or eight days beyond the day of the re-consecration of the altar. For both suppositions historical evidence is wanting. The former is perhaps probable from 1 Macc. 4:45, cf. with v. 54; but, on the contrary, for the second, history furnishes no epoch-making event of such significance as that the cessation of the oppression could be defined by it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The majority of modern interpreters, in the reckoning of the 1290 and the 1335 days, proceed from Daniel 8:14, and with them Kliefoth holds, firstly, that the 2300 evening-mornings are 1150 days, the termination of which constitutes the epoch of the re-consecration of the temple, on the 25th of the month Kisleu of the year 148 of the Seleucidan aera (i.e., 164 b.c.); and secondly, he supposes that the terminus a quo of the 2300 evening-mornings (Daniel 8:14 and of the 1290 or 1335 days is the same, namely, the taking of Jerusalem by Apollonius (1 Macc. 1:29ff.), and the setting aside of the תּמיד which followed immediately after it was taken, about 140 days earlier than the setting up of the idol-altar. As the terminus ad quem of the 2300 evening-mornings the re-consecration of the temple is taken, with which the power of Antiochus over Israel was broken, and the beginning of the restoration made. No terminus ad quem is named in this passage before us, but perhaps it lies in the greater number of the days, as well as in this, that this passage speaks regarding the entire setting aside of the power of Antiochus-an evidence and a clear argument for this, that in Daniel 12:11, Daniel 12:12 a further terminus ad quem, reaching beyond the purification of the temple, is to be supposed. This terminus is the death of Antiochus. \"It is true,\" Kliefoth further argues, \"we cannot establish it to a day and an hour, that between the putting away of the daily sacrifice and the death of Antiochus 1290 days intervened, since of both facta we do not know the date of the day. But this we know from the book of the Maccabees, that the consecration of the temple took place on the 25th day of the month Kisleu in the 148th year of the Seleucidan aera, and that Antiochus died in the 149th year; and if we now add the 140 days, the excess of 2300 above 1290 after the consecration of the temple, we certainly come into the year 149. The circumstance also, that in the whole connection of this chapter the tendency is constantly toward the end of Antiochus, the Antichrist, induces us to place the death of that persecutor as the terminus ad quem of the 1290 days. Consequently we shall not err if, with Bleek, Kirmss, Hitzig, Delitzsch, Hofmann, Auberlen, Zndel, we suppose, that as the purifying of the temple is the end of the 2300 evening-mornings, so the death of Antiochus is the end of the 1290 days. The end of the 1335 days, Daniel 12:12, must then be an event which lies forty-five days beyond the death of Antiochus, and which certainly attests the termination of the persecution under Antiochus and the commencement of better days, and which at least bears clear evidence of the introduction of a better time, and of a settled and secure state of things. We are not able to adduce proof of such a definite event which took place exactly fort-five days after the death of Antiochus, simply because we do not know the date of the death of Antiochus. The circumstances, however, of the times after the death of Antiochus furnish the possibility of such an event. The successor of Antiochus Epiphanes, Antiochus Eupator, certainly wrote to the Jews, after they had vanquished his host under Lysias, asking from them a peace; but the alienation between them continued nevertheless, and did not absolutely end till the victory over Nicanor, 2 Macc. 11-15. Hence there was opportunity enough for an event of the kind spoken of, though we may not be able, from the scantiness and the chronological uncertainty of the records of these times, to prove it positively.\" Hereupon Kliefoth enters upon the conjectures advanced by Hitzig regarding the unknown joyful event, and finds that nothing important can be brought forward in opposition to this especially, that the termination of the 1335 days may be the point of time when the tidings of the death of Antiochus, who died in Babylonia, reached the Jews in Palestine, and occasioned their rejoicing, since it might easily require forty-five days to carry the tidings of that even to Jerusalem; and finally he throws out the question, whether on the whole the more extended period of 1335 days must have its termination in a single definite event, whether by the extension of the 1290 days by fort-five days the meaning may not be, that whoever lives beyond this period of 1290 days, i.e., the death of Antiochus, in patience and in fidelity to the truth, is to be esteemed blessed. \"The forty-five days were then only added to express the living beyond that time, and the form of this expression was chosen for the purpose of continuing that contained in Daniel 12:11.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The majority of modern interpreters, in the reckoning of the 1290 and the 1335 days, proceed from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and with them Kliefoth holds, firstly, that the 2300 evening-mornings are 1150 days, the termination of which constitutes the epoch of the re-consecration of the temple, on the 25th of the month Kisleu of the year 148 of the Seleucidan aera (i.e., 164 b.c.); and secondly, he supposes that the terminus a quo of the 2300 evening-mornings (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and of the 1290 or 1335 days is the same, namely, the taking of Jerusalem by Apollonius (1 Macc. 1:29ff.), and the setting aside of the תּמיד which followed immediately after it was taken, about 140 days earlier than the setting up of the idol-altar. As the terminus ad quem of the 2300 evening-mornings the re-consecration of the temple is taken, with which the power of Antiochus over Israel was broken, and the beginning of the restoration made. No terminus ad quem is named in this passage before us, but perhaps it lies in the greater number of the days, as well as in this, that this passage speaks regarding the entire setting aside of the power of Antiochus-an evidence and a clear argument for this, that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a further terminus ad quem, reaching beyond the purification of the temple, is to be supposed. This terminus is the death of Antiochus. \"It is true,\" Kliefoth further argues, \"we cannot establish it to a day and an hour, that between the putting away of the daily sacrifice and the death of Antiochus 1290 days intervened, since of both facta we do not know the date of the day. But this we know from the book of the Maccabees, that the consecration of the temple took place on the 25th day of the month Kisleu in the 148th year of the Seleucidan aera, and that Antiochus died in the 149th year; and if we now add the 140 days, the excess of 2300 above 1290 after the consecration of the temple, we certainly come into the year 149. The circumstance also, that in the whole connection of this chapter the tendency is constantly toward the end of Antiochus, the Antichrist, induces us to place the death of that persecutor as the terminus ad quem of the 1290 days. Consequently we shall not err if, with Bleek, Kirmss, Hitzig, Delitzsch, Hofmann, Auberlen, Zndel, we suppose, that as the purifying of the temple is the end of the 2300 evening-mornings, so the death of Antiochus is the end of the 1290 days. The end of the 1335 days, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", must then be an event which lies forty-five days beyond the death of Antiochus, and which certainly attests the termination of the persecution under Antiochus and the commencement of better days, and which at least bears clear evidence of the introduction of a better time, and of a settled and secure state of things. We are not able to adduce proof of such a definite event which took place exactly fort-five days after the death of Antiochus, simply because we do not know the date of the death of Antiochus. The circumstances, however, of the times after the death of Antiochus furnish the possibility of such an event. The successor of Antiochus Epiphanes, Antiochus Eupator, certainly wrote to the Jews, after they had vanquished his host under Lysias, asking from them a peace; but the alienation between them continued nevertheless, and did not absolutely end till the victory over Nicanor, 2 Macc. 11-15. Hence there was opportunity enough for an event of the kind spoken of, though we may not be able, from the scantiness and the chronological uncertainty of the records of these times, to prove it positively.\" Hereupon Kliefoth enters upon the conjectures advanced by Hitzig regarding the unknown joyful event, and finds that nothing important can be brought forward in opposition to this especially, that the termination of the 1335 days may be the point of time when the tidings of the death of Antiochus, who died in Babylonia, reached the Jews in Palestine, and occasioned their rejoicing, since it might easily require forty-five days to carry the tidings of that even to Jerusalem; and finally he throws out the question, whether on the whole the more extended period of 1335 days must have its termination in a single definite event, whether by the extension of the 1290 days by fort-five days the meaning may not be, that whoever lives beyond this period of 1290 days, i.e., the death of Antiochus, in patience and in fidelity to the truth, is to be esteemed blessed. \"The forty-five days were then only added to express the living beyond that time, and the form of this expression was chosen for the purpose of continuing that contained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "We cannot, however, concur in this view, because not only is its principal position without foundation, but also its contents are irreconcilable with historical facts. To change the 2300 evening-mornings into 1150 days cannot be exegetically justified, because according to the Hebrew mode of computation evening and morning do not constitute a half but a whole day. But if the 2300 evening-mornings are to be reckoned as so many days, then neither their terminus a quo nor their terminus ad quem stands in a definite relation to the 1290 days, from which a conclusion may be drawn regarding the terminus ad quem of the latter. Then the death of Antiochus Epiphanes does not furnish a turning-point for the commencement of a better time. According to 1 Macc. 6:18-54, the war against the Jews was carried on by his successor Eupator more violently than before. And on the news that Philippus, returning from Persia, sought to deprive him of the government, Lysias advised the king to make peace with the Jews, and to promise to them that they would be permitted to live according to their own laws. On this the Jews opened the citadel of Zion; but the king, after he had entered into it, violated his oath, and ordered its walls to be demolished. It was not till two years after the death of Antiochus Epiphanes that Judas gained a decisive victory over Nicanor, which was celebrated by the Jews by a joyful festival, which they resolved to keep every year in memory of that victory (1 Macc. 7:26-50). In these circumstances it is wholly impossible to suppose an event forty-five days after the death of Antiochus which could clearly be regarded as the beginning of a better time, and of a settled and secure state of things, or to regard the reception in Palestine of the news of the death of Antiochus as an event so joyful, that they were to be esteemed as blessed who should live to hear the tidings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "After all, we must oppose the opinion that the 1290 and the 1335 days are to be regarded as historical and to be reckoned chronologically, ad we are decidedly of opinion that these numbers are to be interpreted symbolically, notwithstanding that days as a measure of time are named. This much seems to be certain, that the 1290 days denote in general the period of Israel's sorest affliction on the part of Antiochus Epiphanes by the taking away of the Mosaic ordinance of worship and the setting up of the worship of idols, but without giving a statement of the duration of this oppression which can be chronologically reckoned. By the naming of \"days\" instead of \"times\" the idea of an immeasurable duration of the tribulation is set aside, and the time of it is limited to a period of moderate duration which is exactly measured out by God. But this is more strictly represented by the second definition, by which it is increased by 45 days: 1335 days, with the expiry of which the oppression shall so wholly cease, that every one shall be blessed who lives till these days come. For 45 days have the same relation to 1290 that 1 1/2 have to 43, and thus designate a proportionally very brief time. But as to this relation, the two numbers themselves show nothing. If we reduce them to the measure of time usual for the definition of longer periods, the 1290 days amount to 54 months, or 3 years and 7 months, and the 1335 days to 44 1/2 months, or 3 years and 8 1/2 months, since generally, and still more in symbolical definitions of time, the year is wont to be reckoned at 12 months, and the months at 30 days. Each of the two periods of time thus amounts to a little more than 3 1/2 years; the first exceeds by 1 month and the second by 2 1/2 months, only a little more than the half of 7 years - a period occurring several times in the O.T. as the period of divine judgments. By the reduction of the days to years and parts of a year the two expressions are placed in a distinct relation to the 3 1/2 times, which already appears natural by the connection of the two questions in Daniel 12:6, Daniel 12:8. On the one hand, by the circumstance that the 1290 days amount to somewhat more than 3 1/2 years, the idea that \"times\" stands for years is set aside; but on the other hand, by the use of \"days\" as a measure of time, the obscurity of the idea: time, times, and half a time, is lessened, and Daniel's inquiry as to the end of the terrible things is answered in a way which might help him to the understanding of the first answer, which was to him wholly unintelligible.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "After all, we must oppose the opinion that the 1290 and the 1335 days are to be regarded as historical and to be reckoned chronologically, ad we are decidedly of opinion that these numbers are to be interpreted symbolically, notwithstanding that days as a measure of time are named. This much seems to be certain, that the 1290 days denote in general the period of Israel's sorest affliction on the part of Antiochus Epiphanes by the taking away of the Mosaic ordinance of worship and the setting up of the worship of idols, but without giving a statement of the duration of this oppression which can be chronologically reckoned. By the naming of \"days\" instead of \"times\" the idea of an immeasurable duration of the tribulation is set aside, and the time of it is limited to a period of moderate duration which is exactly measured out by God. But this is more strictly represented by the second definition, by which it is increased by 45 days: 1335 days, with the expiry of which the oppression shall so wholly cease, that every one shall be blessed who lives till these days come. For 45 days have the same relation to 1290 that 1 1/2 have to 43, and thus designate a proportionally very brief time. But as to this relation, the two numbers themselves show nothing. If we reduce them to the measure of time usual for the definition of longer periods, the 1290 days amount to 54 months, or 3 years and 7 months, and the 1335 days to 44 1/2 months, or 3 years and 8 1/2 months, since generally, and still more in symbolical definitions of time, the year is wont to be reckoned at 12 months, and the months at 30 days. Each of the two periods of time thus amounts to a little more than 3 1/2 years; the first exceeds by 1 month and the second by 2 1/2 months, only a little more than the half of 7 years - a period occurring several times in the O.T. as the period of divine judgments. By the reduction of the days to years and parts of a year the two expressions are placed in a distinct relation to the 3 1/2 times, which already appears natural by the connection of the two questions in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". On the one hand, by the circumstance that the 1290 days amount to somewhat more than 3 1/2 years, the idea that \"times\" stands for years is set aside; but on the other hand, by the use of \"days\" as a measure of time, the obscurity of the idea: time, times, and half a time, is lessened, and Daniel's inquiry as to the end of the terrible things is answered in a way which might help him to the understanding of the first answer, which was to him wholly unintelligible.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Such an answer contains the two definitions of the time under the supposition that the hostile undertakings of Antiochus against Judaism, in their progress and their issue, form a type of the persecution of the last enemy Antichrist against the church of the Lord, or that the taking away of the daily sacrifice and the setting up of the idol-abomination by Antiochus Epiphanes shows in a figure how the Antichrist at the time of the end shall take away the worship of the true God, renounce the God of his fathers, and make war his god, and thereby bring affliction upon the church of God, of which the oppression which Antiochus brought upon the theocracy furnished a historical pattern. But this typical relation of the two periods of oppression is clearly set forth in Daniel 11:21-12:3, since in the conduct and proceedings of the hostile king two stadia are distinguished, which so correspond to each other in all essential points that the first, Daniel 11:21-35, is related to the second, Daniel 11:35-12:3, as the beginning and the first attempt is related to the complete accomplishment. This also appears in the wars of this king against the king of the south (Daniel 11:25-29, cf. with Daniel 11:40-43), and in the consequences which this war had for his relation to the people of God. On his return from the first victorious war against the south, he lifted up his heart against the holy covenant (Daniel 11:28), and being irritated by the failure of the renewed war against the south and against the holy covenant, he desolated the sanctuary (vv. 30, 31); finally, in the war at the time of the end, when Egypt and the lands fell wholly under his power, and when, alarmed by tidings from the east and the north, he thought to destroy many, he erected his palace - tent in the Holy Land, so that he might here aim a destructive blow against all his enemies - in this last assault he came to his end (Daniel 11:40-45).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Such an answer contains the two definitions of the time under the supposition that the hostile undertakings of Antiochus against Judaism, in their progress and their issue, form a type of the persecution of the last enemy Antichrist against the church of the Lord, or that the taking away of the daily sacrifice and the setting up of the idol-abomination by Antiochus Epiphanes shows in a figure how the Antichrist at the time of the end shall take away the worship of the true God, renounce the God of his fathers, and make war his god, and thereby bring affliction upon the church of God, of which the oppression which Antiochus brought upon the theocracy furnished a historical pattern. But this typical relation of the two periods of oppression is clearly set forth in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:21-12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", since in the conduct and proceedings of the hostile king two stadia are distinguished, which so correspond to each other in all essential points that the first, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:21-35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is related to the second, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:35-12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as the beginning and the first attempt is related to the complete accomplishment. This also appears in the wars of this king against the king of the south (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:25-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:40-43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and in the consequences which this war had for his relation to the people of God. On his return from the first victorious war against the south, he lifted up his heart against the holy covenant (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and being irritated by the failure of the renewed war against the south and against the holy covenant, he desolated the sanctuary (vv. 30, 31); finally, in the war at the time of the end, when Egypt and the lands fell wholly under his power, and when, alarmed by tidings from the east and the north, he thought to destroy many, he erected his palace - tent in the Holy Land, so that he might here aim a destructive blow against all his enemies - in this last assault he came to his end (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:40-45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet more distinctly the typical relation shows itself in the description of the undertakings of the enemy of God against the holy covenant, and their consequences for the members of the covenant nation. In this respect the first stadium of his enmity against the God of Israel culminates in the taking away of His worship, and in the setting up of the abomination of desolation, i.e., the worship of idols, in the sanctuary of the Lord. Against this abomination the wise of the people of God raise themselves up, and they bring by their rising up \"a little help,\" and accomplish a purification of the people (Daniel 11:31-35). In the second stadium, i.e., at the time of the end, the hostile king raises himself against the God of gods, and above every god (Daniel 11:37), and brings upon the people of God an oppression such as has never been from the beginning of the world till now; but this oppression ends, by virtue of the help of the archangel Michael, with the deliverance of the people of God and the consummation by the resurrection of the dead, of some to everlasting life, and of some to everlasting shame (Daniel 12:1-3).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yet more distinctly the typical relation shows itself in the description of the undertakings of the enemy of God against the holy covenant, and their consequences for the members of the covenant nation. In this respect the first stadium of his enmity against the God of Israel culminates in the taking away of His worship, and in the setting up of the abomination of desolation, i.e., the worship of idols, in the sanctuary of the Lord. Against this abomination the wise of the people of God raise themselves up, and they bring by their rising up \"a little help,\" and accomplish a purification of the people (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:31-35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In the second stadium, i.e., at the time of the end, the hostile king raises himself against the God of gods, and above every god (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and brings upon the people of God an oppression such as has never been from the beginning of the world till now; but this oppression ends, by virtue of the help of the archangel Michael, with the deliverance of the people of God and the consummation by the resurrection of the dead, of some to everlasting life, and of some to everlasting shame (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "If thus the angel of the Lord, after he said to Daniel that he might rest as to the non-understanding of his communication regarding the end of the wonderful things (Daniel 12:7), because the prophecy shall at the time of the end give to the wise knowledge for the purifying of many through the tribulation, so answers the question of Daniel as to the אלּה אחרית that he defines in symbolically significant numbers the duration of the sufferings from the removal of the worship of Jehovah to the commencement of better times, with which all oppression shall cease, then he gave therewith a measure of time, according to which all those who have understanding, who have lived through this time of oppression, or who have learned regarding it from history, may be able to measure the duration of the last tribulation and its end so far beforehand, as, according to the fatherly and wise counsel of God, it is permitted to us to know the times of the end and of our consummation. For, from the comparison of this passage with that in Daniel 8:14 regarding the duration of the crushing under feet of the holy people by the enemy rising from the Javanic world-kingdom, it is clear that as the 2300 evening-mornings do not contain a complete heptad of years, so the 1290 days contain only a little more than half a heptad. In this lies the comfort, that the severest time of oppression shall not endure much longer than half the time of the whole period of oppression. And if we compare with this the testimony of history regarding the persecution of the Old Covenant people under Antiochus, in consequence of which God permitted the suppression of His worship, and the substitution of idol-worship in its stead, for not fully 3 1/2 years, but only for 3 years and 10 days, then we are able to gather the assurance that He shall also shorten, for the sake of His elect, the 3 1/2 times of the last tribulation. We should rest here, that His grace is sufficient for us (2 Corinthians 12:9). For as God revealed to the prophets, who prophesied of the grace that should come unto us, the sufferings of Christ and the glory that should follow, that they might search and inquire what and what manner of time the Spirit of Christ who was in them did signify; so in the times of the accomplishment, we who are living are not exempted from searching and inquiring, but are led by the prophetic word to consider the signs of the times in the light of this word, and from that which is already fulfilled, as well as from the nature and manner of the fulfilment, to confirm our faith, for the endurance amid the tribulations which prophecy has made known to us, that God, according to His eternal gracious counsel, has measured them according to their beginning, middle, and end, that thereby we shall be purified and guarded for the eternal life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If thus the angel of the Lord, after he said to Daniel that he might rest as to the non-understanding of his communication regarding the end of the wonderful things (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), because the prophecy shall at the time of the end give to the wise knowledge for the purifying of many through the tribulation, so answers the question of Daniel as to the אלּה אחרית that he defines in symbolically significant numbers the duration of the sufferings from the removal of the worship of Jehovah to the commencement of better times, with which all oppression shall cease, then he gave therewith a measure of time, according to which all those who have understanding, who have lived through this time of oppression, or who have learned regarding it from history, may be able to measure the duration of the last tribulation and its end so far beforehand, as, according to the fatherly and wise counsel of God, it is permitted to us to know the times of the end and of our consummation. For, from the comparison of this passage with that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " regarding the duration of the crushing under feet of the holy people by the enemy rising from the Javanic world-kingdom, it is clear that as the 2300 evening-mornings do not contain a complete heptad of years, so the 1290 days contain only a little more than half a heptad. In this lies the comfort, that the severest time of oppression shall not endure much longer than half the time of the whole period of oppression. And if we compare with this the testimony of history regarding the persecution of the Old Covenant people under Antiochus, in consequence of which God permitted the suppression of His worship, and the substitution of idol-worship in its stead, for not fully 3 1/2 years, but only for 3 years and 10 days, then we are able to gather the assurance that He shall also shorten, for the sake of His elect, the 3 1/2 times of the last tribulation. We should rest here, that His grace is sufficient for us (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 12:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). For as God revealed to the prophets, who prophesied of the grace that should come unto us, the sufferings of Christ and the glory that should follow, that they might search and inquire what and what manner of time the Spirit of Christ who was in them did signify; so in the times of the accomplishment, we who are living are not exempted from searching and inquiring, but are led by the prophetic word to consider the signs of the times in the light of this word, and from that which is already fulfilled, as well as from the nature and manner of the fulfilment, to confirm our faith, for the endurance amid the tribulations which prophecy has made known to us, that God, according to His eternal gracious counsel, has measured them according to their beginning, middle, and end, that thereby we shall be purified and guarded for the eternal life. ",
            "children": []
          }
        ]
      }
    ]
  }
]