[{"header":"King Hezekiah of Judah"},{"num":29,"verse":"Hezekiah was twenty-five years old when he became king of Judah, and he ruled twenty-nine years from Jerusalem. His mother was Abijah daughter of Zechariah. "},{"num":2,"verse":"Hezekiah obeyed the Lord by doing right, just as his ancestor David had done."},{"header":"The Temple Is Purified"},{"num":3,"verse":"In the first month of the first year of Hezekiah’s rule, he unlocked the doors to the Lord’s temple and had them repaired. "},{"num":4,"verse":"Then he called the priests and Levites to the east courtyard of the temple "},{"num":5,"verse":"and said:"},{"num":12,"verse":"When Hezekiah finished talking, the following Levite leaders went to work:"},{"num":15,"verse":"These leaders gathered together the rest of the Levites, and they all went through the ceremony to make themselves clean. Then they began to purify the temple according to the Law of the Lord, just as Hezekiah had commanded."},{"num":16,"verse":"The priests went into the temple and carried out everything that was unclean. They put these things in the courtyard, and from there, the Levites carried them outside the city to Kidron Valley."},{"num":17,"verse":"The priests and Levites began their work on the first day of the first month. It took them one week to purify the courtyards of the temple and another week to purify the temple. So on the sixteenth day of that same month "},{"num":18,"verse":"they went back to Hezekiah and said:"},{"header":"Worship in the Temple"},{"num":20,"verse":"Right away, Hezekiah called together the officials of Jerusalem, and they went to the temple. "},{"num":21,"verse":"They brought with them seven bulls, seven rams, seven lambs, and seven goats as sacrifices to take away the sins of Hezekiah’s family and of the people of Judah, as well as to purify the temple. Hezekiah told the priests, who were descendants of Aaron, to sacrifice these animals on the altar."},{"num":22,"verse":"The priests killed the bulls, the rams, and the lambs, then splattered the blood on the altar. "},{"num":23,"verse":"They took the goats to Hezekiah and the worshipers, and they laid their hands on the animals. "},{"num":24,"verse":"The priests then killed the goats and splattered the blood on the altar as a sacrifice to take away the sins of everyone in Israel, because Hezekiah had commanded that these sacrifices be made for all the people of Israel."},{"num":25,"verse":"Next, Hezekiah assigned the Levites to their places in the temple. He gave them cymbals, harps, and other stringed instruments, according to the instructions that the Lord had given King David and the two prophets, Gad and Nathan. "},{"num":26,"verse":"The Levites were ready to play the instruments that had belonged to David; the priests were ready to blow the trumpets."},{"num":27,"verse":"As soon as Hezekiah gave the signal for the sacrifices to be burned on the altar, the musicians began singing praises to the Lord and playing their instruments, "},{"num":28,"verse":"and everyone worshiped the Lord. This continued until the last animal was sacrificed."},{"num":29,"verse":"After that, Hezekiah and the crowd of worshipers knelt down and worshiped the Lord. "},{"num":30,"verse":"Then Hezekiah and his officials ordered the Levites to sing the songs of praise that David and Asaph the prophet had written. And so they bowed down and joyfully sang praises to the Lord."},{"num":31,"verse":"Hezekiah said to the crowd, “Now that you are once again acceptable to the Lord, bring sacrifices and offerings to give him thanks.”"},{"num":32,"verse":"Seventy bulls, one hundred rams, and two hundred lambs were brought as sacrifices to please the Lord; "},{"num":33,"verse":"six hundred bulls and three thousand sheep were brought as sacrifices to ask the Lord’s blessing. "},{"num":34,"verse":"There were not enough priests to skin all these animals, because many of the priests had not taken the time to go through the ceremony to make themselves clean. However, since all the Levites had made themselves clean, they helped the priests until the last animal was skinned. "},{"num":35,"verse":"Besides all the sacrifices that were burned on the altar, the fat from the other animal sacrifices was burned, and the offerings of wine were poured over the altar."},{"num":36,"verse":"Hezekiah and the people of Judah celebrated, because God had helped them make this happen so quickly."}]