[{"num":29,"verse":"Chizkiyahu began to reign when he was 25 years old, and he reigned 29 years in Yerushalayim. And the shem immo was Aviyah bat Zecharyahu."},{"num":2,"verse":"And he did that which was yashar in the eyes of Hashem, according to all that Dovid Aviv had done."},{"num":3,"verse":"He in the first year of his reign, in the chodesh harishon, opened the daletot Beis Hashem, and repaired them."},{"num":4,"verse":"And he brought in the Kohanim and the Levi’im, and gathered them together into the rechov hamizrach (eastern plaza),"},{"num":5,"verse":"And said unto them, Hear me, ye Levi’im, set yourselves apart as kodesh now and consecrate the Beis Hashem Elohei Avoteichem, and remove the niddah (contamination) from HaKodesh."},{"num":6,"verse":"For Avoteinu have been unfaithful, and have done that which is rah in the eyes of Hashem Eloheinu, have forsaken Him, have turned away their faces from the Mishkan Hashem, and to it they have turned their backs."},{"num":7,"verse":"Also they have shut the daletot of the Ulam, and put out the nerot, and have not burned ketoret nor offered olah in HaKodesh unto Elohei Yisroel."},{"num":8,"verse":"Therefore the wrath of Hashem was upon Yehudah and Yerushalayim, and he hath caused them to be a horror and an object of scorn and hissing, as ye see with your eyes."},{"num":9,"verse":"For, hinei, Avoteinu have fallen by the cherev, our banim, our banot, our nashim are in captivity for this."},{"num":10,"verse":"Now it is in mine lev to make a Brit with Hashem Elohei Yisroel, that His fierce wrath may turn away from us."},{"num":11,"verse":"My banim, be not now negligent, for Hashem hath chosen you to stand before Him, to serve Him, and that ye should minister unto Him, and burn ketoret."},{"num":12,"verse":"Then the Levi’im arose: Machat ben Amasai, and Yoel ben Azaryahu, of the Bnei HaKehati; and of the Bnei Merari, Kish ben Avdi, Azaryahu ben Yehallelel; and, of the Gershoni, Yoach ben Zimmah, and Eden ben Yoach;"},{"num":13,"verse":"And of the Bnei Elitzaphan, Shimri, and Ye’i’el; and of the Bnei Asaph; Zecharyahu, and Matanyahu;"},{"num":14,"verse":"And of the Bnei Heman, Yechiel, and Shimei; and of the Bnei Yedutun, Shemayah, and Uzziel."},{"num":15,"verse":"And they gathered their achim, and set themselves apart as kodesh, and went in, according to the mitzvat HaMelech, by the words of Hashem, to make tahor the Beis Hashem."},{"num":16,"verse":"And the Kohanim went into the penimah (inner part) Beis Hashem, to make it tahor, and brought out all tumah that they found in the Heikhal Hashem into the khatzer (courtyard) of the Beis Hashem. And the Levi’im took it, to carry it outside into the Wadi Kidron."},{"num":17,"verse":"Now they began on the first day of the chodesh harishon to set apart as kodesh, and on the eighth day of the month they came to the Ulam Hashem; so they set apart as kodesh the Beis Hashem in eight days; and in the sixteenth day of the first month they finished."},{"num":18,"verse":"Then they went penimah to Chizkiyah HaMelech, and said, We have made tahor all the Beis Hashem, and the Mizbe’ach HaOlah, with all the vessels thereof, and the Shulchan HaMa’arechet (Table of the Stacks of Showbread), with all the vessels thereof."},{"num":19,"verse":"Moreover all the kelim (vessels), which HaMelech Achaz in his reign did remove in his unfaithfulness, have we prepared and set apart as kodesh, and, hinei, they are before the Mizbe’ach Hashem."},{"num":20,"verse":"Then Chizkiyah HaMelech got up, and gathered the sarim of HaIr, and went up to the Beis Hashem."},{"num":21,"verse":"And they brought seven bulls, and seven rams, and seven lambs, and seven male goats, for a chattat (sin offering) for the Mamlachah (Kingdom), and for the Mikdash, and for Yehudah. And he commanded the Bnei Aharon HaKohanim to offer them on the Mizbe’ach Hashem."},{"num":22,"verse":"So they slaughtered the bulls, and the kohanim received the dahm, and sprinkled it on the Mizbe’ach; likewise, when they had slaughtered the rams, they sprinkled the dahm upon the Mizbe’ach; they slaughtered also the lambs, and they sprinkled the dahm upon the Mizbe’ach."},{"num":23,"verse":"And they brought forth the male goats for the chattat before HaMelech and HaKahal; and they laid their hands upon them,"},{"num":24,"verse":"And the Kohanim slaughtered them, and they made a sin offering with their dahm upon the Mizbe’ach, to make kapporah for kol Yisroel; for HaMelech commanded that the olah (burnt offering) and the (chattat) should be made for kol Yisroel."},{"num":25,"verse":"And he stationed the Levi’im in the Beis Hashem with cymbals, with nevalim, and with kinnorot, according to the mitzvat Dovid, and of Gad the Chozeh HaMelech and Natan HaNavi; for so was the commandment of Hashem by His Nevi’im."},{"num":26,"verse":"And the Levi’im stood with the instruments of Dovid, and the Kohanim with the trumpets."},{"num":27,"verse":"And Chizkiyah commanded to offer the olah (burnt offering) upon the Mizbe’ach. And when the olah (burnt offering) began, the Shir Hashem began also with the trumpets, and with the instruments ordained by Dovid Melech Yisroel."},{"num":28,"verse":"And Kol HaKahal worshiped, and the Shir was being sung, and sounded, and all this continued until the olah was completed."},{"num":29,"verse":"And when it had made an end of being offered up, HaMelech and all that were present with him bowed themselves, and worshiped."},{"num":30,"verse":"Moreover Chizkiyah HaMelech and the sarim commanded the Levi’im to praise Hashem with the words of Dovid, and of Asaph the Chozeh (seer). And they sang praises with simchah, and they bowed their heads and worshiped."},{"num":31,"verse":"Then Chizkiyah answered and said, Now ye have consecrated yourselves unto Hashem, come near and bring zevakhim and todot into the Beis Hashem. And the Kahal brought in zevakhim and todot; and, as many as were of a willing heart, olot (burnt offerings)."},{"num":32,"verse":"And the number of the olah, which the Kahal brought, was threescore and ten bulls, a hundred rams, and two hundred lambs; all these were for an olah (burnt offering) to Hashem."},{"num":33,"verse":"And the kadashim were six hundred bulls and three thousand sheep."},{"num":34,"verse":"But the Kohanim were too few, so that they could not skin all the olot; therefore their achim the Levi’im did help them, until the work was completed, and until the other Kohanim had set them apart as kodesh for the Levi’im were more yashar in lev to set themselves apart as kodesh than the Kohanim."},{"num":35,"verse":"And also the olah were in abundance, with the fat of the shelamim, and the nesakhim for every olah. So the Avodas Beis Hashem was set in order."},{"num":36,"verse":"And Chizkiyah rejoiced, and kol HaAm, that HaElohim had prepared the people, for the matter was done suddenly."}]