[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(26) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Bound about my hill",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—“My hill” is Zion. (Comp. the similar figurative language in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 31:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The centre of the old theocracy is always spoken of in Scripture as also the centre from which goes forth the new covenant of salvation, and this was historically fulfilled in the coming of Christ and the cradling of His Church in the Jewish Church. The continuity of the Church was preserved quite as fully through the Christian era as through the Babylonian captivity, quite as large a number of the Jews having embraced Christianity as ever returned from the exile in Chaldea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 34:26-28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:26-28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will make them and the places round about my hill a blessing — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I will there give remarkable instances of my favour, and of the happiness which flows from it. God’s hill is the same with his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy mountain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where see the note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There shall be showers of blessings — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Blessings in great abundance, and of all sorts, temporal and spiritual, earthly and heavenly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The tree of the field shall yield her fruit — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "There shall be great fertility and plenty in every part of the land. The spiritual blessings of the gospel are often described under the emblems of fruitfulness and abundance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they shall be safe in their land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — In no danger of being invaded and enslaved, though their great plenty might be supposed to be a temptation to their neighbours to desire their land. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they shall know that I am the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They shall indeed know that I, and I only, am the living and true God, and their God and Saviour; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when I have broken the bands of their yoke — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Those bands by which they had been brought down, and long held under oppression; had been made slaves, and used as such. The same expression is used of the deliverance of Israel out of Egypt, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) their final restoration being represented as the greater deliverance of the two. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And none shall make them afraid — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The experience of my particular care over them, shall inspire them with that confidence in me which shall preserve them from all disquieting fears and anxieties.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34:17-31 The whole nation seemed to be the Lord's flock, yet they were very different characters; but he knew how to distinguish between them. By good pastures and deep waters, are meant the pure word of God and the dispensing of justice. The latter verses, 23-31, prophesy of Christ, and of the most glorious times of his church on earth. Under Him, as the good Shepherd, the church would be a blessing to all around. Christ, though excellent in himself, was as a tender plant out of a dry ground. Being the Tree of life, bearing all the fruits of salvation, he yields spiritual food to the souls of his people. Our constant desire and prayer should be, that there may be showers of blessings in every place where the truth of Christ is preached; and that all who profess the gospel may be filled with fruits of righteousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The blessings here foretold are especially those of the old covenant. The wilderness (or, pasture-country) and the woods, the places most exposed to beasts and birds of prey, become places of security. Under the new covenant Sion and the hills around are representative of God's Church; and temporal blessings are typical of the blessings showered down upon Christ's Church by Him who has vanquished the powers of evil.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26. them and the places round about my hill—The Jews, and Zion, God's hill (Ps 2:6), are to be sources of blessing, not merely to themselves, but to the surrounding heathen (Isa 19:24; 56:6, 7; 60:3; Mic 5:7; Zec 8:13). The literal fulfilment is, however, the primary one, though the spiritual also is designed. In correspondence with the settled reign of righteousness internally, all is to be prosperity externally, fertilizing showers (according to the promise of the ancient covenant, Le 26:4; Ps 68:9; Mal 3:10), and productive trees and lands (Eze 34:27). Thus shall they realize the image of Eze 34:14; namely, a flock richly pastured by God Himself.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will make them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " my returned captives, who were looked upon as cursed, reproached, and hated. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The places round about; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all the country. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My hill; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jerusalem, or the temple, Zion, which is called holy hill, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 2:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 2:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A blessing; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " very prosperous, that men shall report them to be in a blessed condition, or a blessing to others among whom they dwell, or a pattern of blessing others, whom we shall wish like to them, whom we wish greatest good to. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will cause the shower to come down in his season; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their land shall be most fruitful in the products of it, corn, wine, oil, &c., and all these blessed to them; whereas formerly their blessings were so cursed that they were no blessings, now they shall be blessed, and so be double blessings to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will make them, and the places round about my hill, a blessing,.... Alluding either to the city of Jerusalem, and the places adjacent; or to the temple, and the houses about it. So the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I will cause them to dwell round about the house of my sanctuary;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and so Kimchi interprets it of the temple. Some Christian interpreters, by the \"hill\" or mountain, understand Christ; and not amiss; who may be compared to one for height; he being higher than the kings of the earth, or than the heavens and angels there, as man and Mediator; as well as is God over all, blessed for ever; and for fruitfulness, from whom the saints have all theirs, either in grace or good works; and for shade, he being the shadow of a great rock in a weary land; which yields delight and refreshment, and is a protection from the heat of a fiery law, flaming justice, the wrath of God and man, and the fiery darts of Satan; and for shelter and security, there being salvation in him, when none in other hills and mountains; and for duration and immovableness, being the same today, yesterday, and for ever: and now the persons about him are such who are made nigh by his blood; brought to him by his powerful and efficacious grace; are worshippers about the throne where he sits; such as cleave to him, and follow him wherever he goes, and shall be with him to all eternity; these he makes a blessing, or most blessed. So the Targum renders it, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and they shall be blessed;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they are blessed in Christ their head; they are blessed through him as their Redeemer and Saviour, who was made a curse for them; they are blessed through being in him, and by the imputation of blessings to them from him, and through the application of them by his Spirit; their persons are blessed, and so are the places or habitations where they dwell: or rather this may be understood of the church of God, often compared to a hill for its height and eminence; for its fertility and fruitfulness; for its stability and firmness; and in allusion to the hill of Zion for its holiness, and being the place of the divine residence; see Psalm 15:1 now, the persons about this hill are those who are come to Mount Zion the church of God; being brought there by the Lord himself, and who take up their abode there; who lie about this hill, as flocks of sheep, in their several folds or congregated churches; see Jeremiah 23:3 and these the Lord makes a blessing to one another, by their spiritual conversation, prayers, and services of love; and to the world, to kingdoms and states, to cities, towns, and neighbourhoods, and to particular families, where they are placed; and even to the world in general; for they are the light, stay, and stability of it; and without which it would be in darkness, corrupt and putrefy, and not continue long: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they are blessed in Christ their head; they are blessed through him as their Redeemer and Saviour, who was made a curse for them; they are blessed through being in him, and by the imputation of blessings to them from him, and through the application of them by his Spirit; their persons are blessed, and so are the places or habitations where they dwell: or rather this may be understood of the church of God, often compared to a hill for its height and eminence; for its fertility and fruitfulness; for its stability and firmness; and in allusion to the hill of Zion for its holiness, and being the place of the divine residence; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 15:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " now, the persons about this hill are those who are come to Mount Zion the church of God; being brought there by the Lord himself, and who take up their abode there; who lie about this hill, as flocks of sheep, in their several folds or congregated churches; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and these the Lord makes a blessing to one another, by their spiritual conversation, prayers, and services of love; and to the world, to kingdoms and states, to cities, towns, and neighbourhoods, and to particular families, where they are placed; and even to the world in general; for they are the light, stay, and stability of it; and without which it would be in darkness, corrupt and putrefy, and not continue long: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will cause the shower to come down in his season; which, in the spiritual sense, may design the Gospel; which, like a shower of rain, comes from God; descends from heaven; is a gift of God; which falls according to divine direction; refreshes, revives, and makes fruitful; brings a plenty of divine blessings with it; and comes in season, at its proper time; and is a word in season to weary souls: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "there shall be showers of blessings; which the Gospel brings with it; spiritual blessings, blessings of grace; such as peace, pardon, righteousness, and eternal life: these, like showers, come from God; are free grace gifts of his, of which there is a large abundance; and which descend on Mount Zion the church of God; which is another Gerizim, on which the blessings are pronounced, Psalm 133:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "there shall be showers of blessings; which the Gospel brings with it; spiritual blessings, blessings of grace; such as peace, pardon, righteousness, and eternal life: these, like showers, come from God; are free grace gifts of his, of which there is a large abundance; and which descend on Mount Zion the church of God; which is another Gerizim, on which the blessings are pronounced, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 133:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I will make them and the places round about my hill a blessing; and I will cause the shower to come down in his season; there shall be showers of blessing.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "make them … a blessing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. altogether blessed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 19:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the last words of the verse imply. Cf. construction ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 27:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 28:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The language of the clause is not very natural; LXX. reads: and I will set them round about my hill (the word “blessing” wanting).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "showers of blessing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. bringing blessing, not, composed of blessing, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 34:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:23-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 26.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Round about my hill",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Ezekiel's thoughts, like those of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cluster round the hill of Zion, the mountain of Jehovah, as the center of the restored Israel. In that land, as the prophet saw it here, and still more in the closing vision of his book (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 47:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), there were, outwardly as well as spiritually, to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "showers of blessing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the phrase is peculiar to Ezekiel), and the land should yield its fruits. Ezekiel 34:26",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Appointment of David as Shepherd, and Blessing of the People",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 34:23. And I will raise up one shepherd over them, who shall feed them, my servant David; he will feed them, and he will be to them a shepherd. Ezekiel 34:24. And I, Jehovah, will be God to them, and my servant David prince in the midst of them: I, Jehovah, have spoken it. Ezekiel 34:25. And I will make a covenant of peace with them, and destroy the evil beasts out of the land, so that they will dwell safely in the desert and sleep in the forests. Ezekiel 34:26. And I will make them and the places round my hill a blessing, and cause the rain to fall in its season: showers of blessing shall there be. Ezekiel 34:27. The tree of the field will give its fruit, and the land will give its produce, and they will be safe in their land, and will know that I am Jehovah, when I break their yoke-bars in pieces, and deliver them out of the hand of those who made them servants. Ezekiel 34:28. They will be no more a prey to the nations, and the wild beasts will not devour them; but they will dwell safely, and no one will terrify them. Ezekiel 34:29. And I will raise up for them a plantation for a name, so that they will no more be swept away by famine in the land, and shall no longer bear the disgrace of the heathen nations. Ezekiel 34:30. And they shall know that I, Jehovah, their God, am with them, and they are my people, the house of Israel, is the saying of the Lord Jehovah. Ezekiel 34:31. And ye are my sheep, the flock of my pasture; ye are men, I am your God, is the saying of the Lord Jehovah. - God will cause to stand up, raise up, one single shepherd over His flock. הקים, the standing expression for the rising up of a person in history through the interposition of God (cf. Deuteronomy 18:15; 2 Samuel 7:12, and other passages). רעה, not unicus, singularis, a shepherd unique in his kind, but one shepherd, in contrast not only with the many bad shepherds, but with the former division of the people into two kingdoms, each with its own separate king. Compare Ezekiel 37:24 with Jeremiah 28:6, where it is expressly said that the David to be raised up is to feed Israel and Judah, the two peoples that had been divided before. \"My servant David:\" Jehovah calls him עבדּי, not merely with reference to the obedience rendered (Hvernick), but also with regard to his election (Isaiah 42:1; Hengstenberg). There is no necessity to refute the assertion of Hitzig, David Strauss, and others, that Ezekiel expected the former King David to be raised from the dead. The reference is to the sprout of David (Jeremiah 23:5), already called simply David in Hosea 3:5 and Jeremiah 30:9. In Ezekiel 34:24 the relation of Jehovah to this David is more precisely defined: Jehovah will then be God to His people, and David be prince in the midst of them. The last words point back to 2 Samuel 7:8. Through the government of David, Jehovah will become in truth God of His people Israel; for David will feed the people in perfect unity with Jehovah, - will merely carry out the will of Jehovah, and not place himself in opposition to God, like the bad shepherds, because, as is therewith presupposed, he is connected with God by unity of nature.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I will raise up one shepherd over them, who shall feed them, my servant David; he will feed them, and he will be to them a shepherd. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I, Jehovah, will be God to them, and my servant David prince in the midst of them: I, Jehovah, have spoken it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I will make a covenant of peace with them, and destroy the evil beasts out of the land, so that they will dwell safely in the desert and sleep in the forests. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I will make them and the places round my hill a blessing, and cause the rain to fall in its season: showers of blessing shall there be. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The tree of the field will give its fruit, and the land will give its produce, and they will be safe in their land, and will know that I am Jehovah, when I break their yoke-bars in pieces, and deliver them out of the hand of those who made them servants. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They will be no more a prey to the nations, and the wild beasts will not devour them; but they will dwell safely, and no one will terrify them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I will raise up for them a plantation for a name, so that they will no more be swept away by famine in the land, and shall no longer bear the disgrace of the heathen nations. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And they shall know that I, Jehovah, their God, am with them, and they are my people, the house of Israel, is the saying of the Lord Jehovah. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And ye are my sheep, the flock of my pasture; ye are men, I am your God, is the saying of the Lord Jehovah. - God will cause to stand up, raise up, one single shepherd over His flock. הקים, the standing expression for the rising up of a person in history through the interposition of God (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 18:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and other passages). רעה, not unicus, singularis, a shepherd unique in his kind, but one shepherd, in contrast not only with the many bad shepherds, but with the former division of the people into two kingdoms, each with its own separate king. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 37:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 28:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is expressly said that the David to be raised up is to feed Israel and Judah, the two peoples that had been divided before. \"My servant David:\" Jehovah calls him עבדּי, not merely with reference to the obedience rendered (Hvernick), but also with regard to his election (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Hengstenberg). There is no necessity to refute the assertion of Hitzig, David Strauss, and others, that Ezekiel expected the former King David to be raised from the dead. The reference is to the sprout of David (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), already called simply David in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 30:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the relation of Jehovah to this David is more precisely defined: Jehovah will then be God to His people, and David be prince in the midst of them. The last words point back to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Through the government of David, Jehovah will become in truth God of His people Israel; for David will feed the people in perfect unity with Jehovah, - will merely carry out the will of Jehovah, and not place himself in opposition to God, like the bad shepherds, because, as is therewith presupposed, he is connected with God by unity of nature.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Ezekiel 34:25. the thought is carried out still further, - how God will become God to His people, and prove Himself to be its covenant God through the pastoral fidelity of the future David. God will fully accomplish the covenant mercies promised to Israel. The making of the covenant of peace need not be restricted, in accordance with Hosea 2:20 (18), to a covenant which God would make with the beasts in favour of His people. The thought is a more comprehensive one here, and, according to Leviticus 26:4-6, the passage which Ezekiel had in his mind involves all the salvation which God had included in His promises to His people: viz., (1) the extermination of everything that could injure Israel, of all the wild beasts, so that they would be able to sleep securely in the deserts and the forests (Ezekiel 34:25, compare Leviticus 26:6); (2) the pouring out of an abundant rain, so that the field and land would yield rich produce (Ezekiel 34:26, Ezekiel 34:27; cf. Leviticus 26:4-5). \"I make them, the Israelites, and the surroundings of my hill, a blessing.\" גּבעתי, the hill of Jehovah, is, according to Isaiah 31:4, Mount Zion, the temple-mountains, including the city of Jerusalem. The surroundings of this hill are the land of Israel, that lay around it. But Zion, with the land around, is not mentioned in the place of the inhabitants; and still less are we to understand by the surroundings of the hill the heathen nations, as Hengstenberg does, in opposition both to the context and the usage of the language. The thought is simply that the Lord will make both the people and the land a blessing (Hvernick, Kliefoth). בּרכה, a blessing, is stronger than \"blessed\" (cf. Genesis 12:2). The blessing is brought by the rain in its season, which fertilizes the earth. This will take place when the Lord breaks the yokes laid upon His people. These words are from Leviticus 26:13, where they refer to the deliverance of Israel from the bondage of Egypt; and they are transferred by Ezekiel to the future redemption of Israel from the bondage of the heathen. For עבדים , compare Exodus 1:14. This thought is carried out still further in Ezekiel 34:28; and then, in Ezekiel 34:29, all that has been said is summed up in the thoughts, \"I raise up for them a plantation for a name,\" etc. מטּע, a plantation, as in Ezekiel 17:7; not a land for planting (Hitzig). לשׁם, for a name, i.e., not for the glory of God (De Wette); but the plantation, which the Lord will cause to grow by pouring down showers of blessing (Ezekiel 34:26), is to bring renown to the Israelites, namely, among the heathen, who will see from this that Israel is a people blessed by its God. This explanation of the words is supplied by the following clause: they shall no more be swept away by famine in the land, and no more bear the disgrace of the heathen, i.e., the disgrace which the heathen heaped upon Israel when in distress (compare Zephaniah 3:19; Jeremiah 13:11; and the primary passage, Deuteronomy 26:29). From this blessing they will learn that Jehovah their God is with them, and Israel is His people. The promise concludes in Ezekiel 34:31 with these words, which set a seal upon the whole: \"Ye are my flock, the flock of my pasture (lit., my pasture-flock; צאן , Jeremiah 23:1, the flock fed by God Himself); men are ye, I am your God.\" That these last words to not serve merely as an explanation of the figurative expression \"flock,\" is a fact of which no proof is needed. The figure of a flock was intelligible to every one. The words \"call attention to the depth and greatness of the divine condescension, and meet the objection of men of weak faith, that man, who is taken from the earth האדמה, and returns to it again, is incapable of so intimate a connection with God\" (Hengstenberg).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". the thought is carried out still further, - how God will become God to His people, and prove Himself to be its covenant God through the pastoral fidelity of the future David. God will fully accomplish the covenant mercies promised to Israel. The making of the covenant of peace need not be restricted, in accordance with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (18), to a covenant which God would make with the beasts in favour of His people. The thought is a more comprehensive one here, and, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the passage which Ezekiel had in his mind involves all the salvation which God had included in His promises to His people: viz., (1) the extermination of everything that could injure Israel, of all the wild beasts, so that they would be able to sleep securely in the deserts and the forests (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); (2) the pouring out of an abundant rain, so that the field and land would yield rich produce (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). \"I make them, the Israelites, and the surroundings of my hill, a blessing.\" גּבעתי, the hill of Jehovah, is, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 31:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Mount Zion, the temple-mountains, including the city of Jerusalem. The surroundings of this hill are the land of Israel, that lay around it. But Zion, with the land around, is not mentioned in the place of the inhabitants; and still less are we to understand by the surroundings of the hill the heathen nations, as Hengstenberg does, in opposition both to the context and the usage of the language. The thought is simply that the Lord will make both the people and the land a blessing (Hvernick, Kliefoth). בּרכה, a blessing, is stronger than \"blessed\" (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The blessing is brought by the rain in its season, which fertilizes the earth. This will take place when the Lord breaks the yokes laid upon His people. These words are from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where they refer to the deliverance of Israel from the bondage of Egypt; and they are transferred by Ezekiel to the future redemption of Israel from the bondage of the heathen. For עבדים , compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This thought is carried out still further in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and then, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", all that has been said is summed up in the thoughts, \"I raise up for them a plantation for a name,\" etc. מטּע, a plantation, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 17:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; not a land for planting (Hitzig). לשׁם, for a name, i.e., not for the glory of God (De Wette); but the plantation, which the Lord will cause to grow by pouring down showers of blessing (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is to bring renown to the Israelites, namely, among the heathen, who will see from this that Israel is a people blessed by its God. This explanation of the words is supplied by the following clause: they shall no more be swept away by famine in the land, and no more bear the disgrace of the heathen, i.e., the disgrace which the heathen heaped upon Israel when in distress (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 3:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 13:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the primary passage, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 26:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). From this blessing they will learn that Jehovah their God is with them, and Israel is His people. The promise concludes in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with these words, which set a seal upon the whole: \"Ye are my flock, the flock of my pasture (lit., my pasture-flock; צאן , ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the flock fed by God Himself); men are ye, I am your God.\" That these last words to not serve merely as an explanation of the figurative expression \"flock,\" is a fact of which no proof is needed. The figure of a flock was intelligible to every one. The words \"call attention to the depth and greatness of the divine condescension, and meet the objection of men of weak faith, that man, who is taken from the earth האדמה, and returns to it again, is incapable of so intimate a connection with God\" (Hengstenberg).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "If we take another survey, in conclusion, of the contents of our prophecy, the following are the three features of the salvation promised to the people of Israel: - (1) The Lord will liberate His people from the hand of the bad shepherds, and He Himself will feed it as His flock; (2) He will gather it together from its dispersion, bring it back to the land of Israel and feed it there, will take charge of the sheep in need of help, and destroy the fat and strong sheep by which the weak ones are oppressed; (3) He will raise up the future David for a shepherd, and under his care He will bestow upon His people the promised covenant blessings in richest measure. These saving acts of God for His people, however, are not depicted according to their several details and historical peculiarities, as Kliefoth has correctly observed, nor are they narrated in the chronological order in which they would follow one another in history; but they are grouped together according to their general design and character, and their essential features. If, then, we seek for the fulfilment, the Lord raised up His servant David as a shepherd to Israel, by sending Jesus Christ, who came to seek and to save that which was lost (Luke 19:10; Matthew 18:11), and who calls Himself the Good Shepherd with obvious reference to this and other prophetic declarations of a similar kind (John 10:11.). But the sending of Christ was preceded by the gathering of Israel out of the Babylonian exile, by which God had already taken charge of His flock, Yet, inasmuch as only a small portion of Israel received the Messiah, who appeared in Jesus, as its shepherd, there fell upon the unbelieving Israel a new judgment of dispersion among all nations, which continues still, so that a gathering together still awaits the people of Israel at some future time. No distinction is made in the prophecy before us between these two judgments of dispersion, which are associated with the twofold gathering of Israel; but they are grouped together as one, so that although their fulfilment commenced with the deliverance of Israel from the Babylonian captivity and the coming of Jesus Christ as the Good Shepherd of the family of David, it was only realized in that portion of Israel, numerically the smallest portion, which was willing to be gathered and fed by Jesus Christ, and the full realization will only be effected when that conversion of Israel shall take place, which the Apostle Paul foretells in Romans 11:25. - For further remarks on the ultimate fulfilment, we refer the reader to a later page. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If we take another survey, in conclusion, of the contents of our prophecy, the following are the three features of the salvation promised to the people of Israel: - (1) The Lord will liberate His people from the hand of the bad shepherds, and He Himself will feed it as His flock; (2) He will gather it together from its dispersion, bring it back to the land of Israel and feed it there, will take charge of the sheep in need of help, and destroy the fat and strong sheep by which the weak ones are oppressed; (3) He will raise up the future David for a shepherd, and under his care He will bestow upon His people the promised covenant blessings in richest measure. These saving acts of God for His people, however, are not depicted according to their several details and historical peculiarities, as Kliefoth has correctly observed, nor are they narrated in the chronological order in which they would follow one another in history; but they are grouped together according to their general design and character, and their essential features. If, then, we seek for the fulfilment, the Lord raised up His servant David as a shepherd to Israel, by sending Jesus Christ, who came to seek and to save that which was lost (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 19:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 18:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and who calls Himself the Good Shepherd with obvious reference to this and other prophetic declarations of a similar kind (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). But the sending of Christ was preceded by the gathering of Israel out of the Babylonian exile, by which God had already taken charge of His flock, Yet, inasmuch as only a small portion of Israel received the Messiah, who appeared in Jesus, as its shepherd, there fell upon the unbelieving Israel a new judgment of dispersion among all nations, which continues still, so that a gathering together still awaits the people of Israel at some future time. No distinction is made in the prophecy before us between these two judgments of dispersion, which are associated with the twofold gathering of Israel; but they are grouped together as one, so that although their fulfilment commenced with the deliverance of Israel from the Babylonian captivity and the coming of Jesus Christ as the Good Shepherd of the family of David, it was only realized in that portion of Israel, numerically the smallest portion, which was willing to be gathered and fed by Jesus Christ, and the full realization will only be effected when that conversion of Israel shall take place, which the Apostle Paul foretells in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - For further remarks on the ultimate fulfilment, we refer the reader to a later page. ",
            "children": []
          }
        ]
      }
    ]
  }
]