[{"num":1,"verse":"2 Isaiah reproveth the Jews of their ingratitude and stubbornness, that neither for benefits nor punishments would amend. 11 He showed why their sacrifices are rejected, and wherein God’s true service standeth. 24 He prophesieth of the destruction of Jerusalem, 25 and of the restitution thereof."},{"num":1,"verse":"A vision of Isaiah, the son of Amoz, which he saw concerning Judah and Jerusalem, in the days of Uzziah, Jotham, Ahaz, and Hezekiah Kings of Judah."},{"num":2,"verse":"Hear, O heavens, and hearken, O earth: for the Lord hath said, I have nourished and brought up children, but they have rebelled against me."},{"num":3,"verse":"The ox knoweth his owner, and the ass his master’s crib: but Israel hath not known: my people hath not understood."},{"num":4,"verse":"Ah, sinful nation, a people laden with iniquity: a seed of the wicked, corrupt children: they have forsaken the Lord: they have provoked the Holy one of Israel to anger: they are gone backward."},{"num":5,"verse":"Wherefore should ye be smitten anymore? for ye fall away more and more: the whole head is sick, and the whole heart is heavy."},{"num":6,"verse":"From the sole of the foot unto the head, there is nothing whole therein, but wounds and swelling, and sores full of corruption: they have not been wrapped, nor bound up nor mollified with oil."},{"num":7,"verse":"Your land is waste: your cities are burnt with fire: strangers devour your land in your presence, and it is desolate like the overthrow of strangers."},{"num":8,"verse":"And the daughter of Zion shall remain like a cottage in a vineyard, like a lodge in a garden of cucumbers, and like a besieged city."},{"num":9,"verse":"Except the Lord of hosts had reserved unto us even a small remnant, we should have been as Sodom, and should have been like unto Gomorrah."},{"num":10,"verse":"Hear the word of the Lord, O princes of Sodom: hearken unto the Law of our God, O people of Gomorrah."},{"num":11,"verse":"What have I to do with the multitude of your sacrifices, saith the Lord? I am full of the burnt offerings of rams, and of the fat of fed beasts: and I desire not the blood of bullocks, nor of lambs, nor of goats."},{"num":12,"verse":"When ye come to appear before me, who required this of your hands to tread in my courts?"},{"num":13,"verse":"Bring no more oblations, in vain: incense is an abomination unto me: I cannot suffer your new moons, nor Sabbath, nor solemn days (it is iniquity) nor solemn assemblies."},{"num":14,"verse":"My soul hateth your new moons and your appointed feasts: they are a burden unto me: I am weary to bear them."},{"num":15,"verse":"And when you shall stretch out your hands, I will hide mine eyes from you: and though ye make many prayers, I will not hear: for your hands are full of blood."},{"num":16,"verse":"Wash you, make you clean, take away the evil of your works from before mine eyes: cease to do evil."},{"num":17,"verse":"Learn to do well: seek judgment, relieve the oppressed: judge the fatherless, and defend the widow."},{"num":18,"verse":"Come now, and let us reason together, saith the Lord: though your sins were as crimson, they shall be made white as snow: though they were red like scarlet, they shall be as wool,"},{"num":19,"verse":"If ye consent and obey, ye shall eat the good things of the land."},{"num":20,"verse":"But if ye refuse and be rebellious, ye shall be devoured with the sword: for the mouth of the Lord hath spoken it."},{"num":21,"verse":"How is the faithful city become an harlot? it was full of judgment, and justice lodged therein, but now they are murderers."},{"num":22,"verse":"Thy silver is become dross: thy wine is mixed with water."},{"num":23,"verse":"Thy princes are rebellious, and companions of thieves: every one loveth gifts, and followeth after rewards: they judge not the fatherless, neither doth the widow’s cause come before them."},{"num":24,"verse":"Therefore saith the Lord God of hosts, the Mighty one of Israel, Ah, I will ease me of mine adversaries, and avenge me of mine enemies."},{"num":25,"verse":"Then I will turn mine hand upon thee, and burn out thy dross, till it be pure, and take away all thy tin."},{"num":26,"verse":"And I will restore thy Judges as at the first, and thy counselors as at the beginning: afterward shalt thou be called a city of righteousness, and a faithful city."},{"num":27,"verse":"Zion shall be redeemed in judgment, and they that return in her, in justice."},{"num":28,"verse":"And the destruction of the transgressors and of the sinners shall be together: and they that forsake the Lord, shall be consumed."},{"num":29,"verse":"For they shall be confounded for the oaks, which ye have desired, and ye shall be ashamed of the gardens that ye have chosen,"},{"num":30,"verse":"For ye shall be as an oak, whose leaf fadeth: and as a garden that hath no water."},{"num":31,"verse":"And the strong shall be as tow, and the maker thereof as a spark: and they shall both burn together, and none shall quench them."}]