[{"header":"The Sinful Nation of Judah"},{"num":1,"verse":"This is the special dream of Isaiah the son of Amoz, about Judah and Jerusalem, which he saw during the rule of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah."},{"num":2,"verse":"Listen, O heavens, and hear, O earth, for the Lord has spoken: “I have brought up and have taken care of sons, but they have turned against Me. "},{"num":3,"verse":"An ox knows its owner. A donkey knows where to find the food its owner gives it. But Israel does not know. My people do not understand.” "},{"num":4,"verse":"O sinful nation, people weighed down with sin, children of those who do wrong, sons who act in a sinful way! They have left the Lord. They have hated the Holy One of Israel. They have turned away from Him."},{"num":5,"verse":"Where will you be punished again, since you still fight against the Lord? Your whole head is sick, and your whole heart is weak. "},{"num":6,"verse":"From the bottom of the foot even to the head, there is no good part. There are only sores from beatings and open sores. They are not taken care of or covered or made soft with oil."},{"num":7,"verse":"Your land lies waste. Your cities are burned with fire. Strangers are eating the food of your fields in front of you. It lies waste, as destroyed by strangers. "},{"num":8,"verse":"The people of Zion are left like a tent in a grape-field, like a watchman’s house in a vegetable field, like a city closed in by armies. "},{"num":9,"verse":"If the Lord of All had not left some people, we would have all been destroyed like those who lived in the cities of Sodom and Gomorrah."},{"num":10,"verse":"Hear the Word of the Lord, you rulers of Sodom. Listen to the teaching of our God, you people of Gomorrah. "},{"num":11,"verse":"“What are your many gifts given in worship to Me?” says the Lord. “I have had enough burnt gifts of rams and the fat of cattle. And I am not pleased with the blood of bulls, lambs, or goats. "},{"num":12,"verse":"When you come to show yourselves before Me, who says you must walk and walk around My open spaces? "},{"num":13,"verse":"Do not bring your gifts of no worth any more. Your special perfume is a hated thing to Me. The new moon and Day of Rest, this calling together of the people, I cannot put up with. I cannot put up with your sin and your meetings of worship. "},{"num":14,"verse":"I hate your new moons and your special suppers. They have become heavy upon Me. I am tired of carrying them. "},{"num":15,"verse":"So when you spread out your hands in prayer, I will hide My eyes from you. Even if you pray many times, I will not listen. Your hands are full of blood."},{"num":16,"verse":"“Wash yourselves. Make yourselves clean. Take your sinful actions from My eyes. Stop doing sinful things. "},{"num":17,"verse":"Learn to do good. Look for what is right and fair. Speak strong words to those who make it hard for people. Stand up for the rights of those who have no parents. Help the woman whose husband has died. "},{"num":18,"verse":"“Come now, let us think about this together,” says the Lord. “Even though your sins are bright red, they will be as white as snow. Even though they are dark red, they will be like wool. "},{"num":19,"verse":"If you are willing and obey, you will eat the best of the land. "},{"num":20,"verse":"But if you are not willing and turn against Me, you will be destroyed by the sword.” For the mouth of the Lord has spoken."},{"header":"The Sinful City"},{"num":21,"verse":"The faithful city has become like a woman who sells the use of her body. At one time she was full of what was right and fair! Those who are right and good lived in her, but now those who kill. "},{"num":22,"verse":"Your silver has lost its worth. Your wine is mixed with water. "},{"num":23,"verse":"Your rulers have turned against what is right. They are the friends of robbers. Every one loves to get pay in secret for wrong-doing, and they run after gifts. They do not stand for the rights of those who have no parents. And they never hear the cry for help of the woman whose husband has died."},{"num":24,"verse":"So the Lord God of All, the Powerful One of Israel, says, “I will put an end to those who fight against Me. I will punish those who hate Me. "},{"num":25,"verse":"I will turn My hand against you and burn what is of no worth in you. And I will take away from you all that is not pure. "},{"num":26,"verse":"Then I will give you judges as at the first, and your wise men as at the beginning. After that you will be called the city that is right and good, a faithful city.”"},{"num":27,"verse":"Zion will be saved by being fair. Those who are sorry for their sins and turn from them will be saved by being right and good. "},{"num":28,"verse":"But wrong-doers and sinners will be crushed together. Those who turn away from the Lord will come to an end. "},{"num":29,"verse":"For you will be ashamed of the oaks where you worshiped. You will be ashamed of the gardens you have chosen. "},{"num":30,"verse":"For you will be like an oak tree whose leaf dries up, or like a garden that has no water. "},{"num":31,"verse":"The strong man will become easy to burn, and his work also a fire. They will burn together, and there will be no one to put the fire out."}]