[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:26-36 The most mighty and magnificent kingdoms and states, sooner or later, come down. Those who make creatures their confidence, and rest their hopes upon them, will fall with them: happy are those who have the God of Jacob for their Help, and whose hope is in the Lord their God, who lives for ever. Those who engage in trade should learn to conduct their business according to God's word. Those who possess wealth should remember they are the Lord's stewards, and should use his goods in doing good to all. Let us seek first the kingdom of God and his righteousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Utterly bald - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31. utterly bald—literally, \"bald with baldness.\" The Phœnician custom in mourning; which, as being connected with heathenish superstitions, was forbidden to Israel (De 14:1).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " It was the custom of the heathen, to either pull off with their hands, or cut off, the hair of their heads in great mournings, which God forbade to his people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 21:5 Deu 14:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 21:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 14:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus do Tyre’s mourners in baldness express their sorrow and despair. Gird them with sackcloth; another usual ceremony of mourners, well known to all. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With bitterness of heart; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it shall be a hearty mourning, not a counterfeit one; this referring to the inward grief, the next bitter wailing refers to the outward expressing it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall make themselves utterly bald for thee,.... Either by shaving their heads, or tearing off their hair, as mourners in distress have been used to do: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and gird them with sackcloth; about their loins, as was very customary in such distressed cases: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall weep for thee with bitterness of heart and bitter wailing; not in show only, but in reality; not like the \"preficae\" or mourning women, though the allusion may be to them, who only mourned outwardly; but these from the very heart, and in great bitterness of spirit this is expressive of the inward grief of their minds on this melancholy occasion, as what follows declares the lamentation they expressed vocally; see Revelation 18:19. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they shall weep for thee with bitterness of heart and bitter wailing; not in show only, but in reality; not like the \"preficae\" or mourning women, though the allusion may be to them, who only mourned outwardly; but these from the very heart, and in great bitterness of spirit this is expressive of the inward grief of their minds on this melancholy occasion, as what follows declares the lamentation they expressed vocally; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they shall make themselves utterly bald for thee, and gird them with sackcloth, and they shall weep for thee with bitterness of heart and bitter wailing.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For these signs of grief cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 15:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 47:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ezekiel 27:31",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Destruction of Tyre",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 27:26. Thy rowers brought thee into great waters: the east wind broke thee up in the heart of the seas. Ezekiel 27:27. Thy riches and thy sales, thy bartering wares, thy seamen and thy sailors, the repairers of thy leaks and the treaders in thy wares, and all thy fighting men in thee, together with all the multitude of people in thee, fell into the heart of the seas in the day of thy fall. Ezekiel 27:28. At the noise of the cry of thy sailors the places tremble. Ezekiel 27:29. And out of their ships come all the oarsmen, seamen, all the sailors of the sea; they come upon the land, Ezekiel 27:20. And make their voice heard over thee, and cry bitterly, and put dust upon their heads, and cover themselves with ashes; Ezekiel 27:31. And shave themselves bald on thy account, and gird on sackcloth, and weep for thee in anguish of soul a bitter wailing. Ezekiel 27:32. They raise over thee in their grief a lamentation, and lament over thee: Who is like Tyre! like the destroyed one in the midst of the sea!. Ezekiel 27:33. When thy sales came forth out of the seas, thou didst satisfy many nations; with the abundance of thy goods and thy wares thou didst enrich kings of the earth. Ezekiel 27:34. Now that thou art wrecked away from the seas in the depths of the water, thy wares and all thy company are fallen in thee. Ezekiel 27:35. All the inhabitants of the islands are amazed at thee, and their kings shudder greatly; their faces quiver. Ezekiel 27:36. The traders among the nations hiss over thee; thou hast become a terror, and art gone for ever. - The allusion to the ships of Tarshish, to which Tyre was indebted for its glory, serves as an introduction to a renewal in Ezekiel 27:26 of the allegory of Ezekiel 27:5-9; Tyre is a ship, which is wrecked by the east wind (cf. Psalm 48:8). In Palestine (Arabia and Syria) the east wind is characterized by continued gusts; and if it rises into a tempest, it generally causes great damage on account of the violence of the gusts (see Wetzstein in Delitzsch's commentary on Job 27:1). Like a ship broken in pieces by the storm, Tyre with all its glory sinks into the depths of the sea. The repetition of בּלב in Ezekiel 27:26 and Ezekiel 27:27 forms an effective contrast to Ezekiel 27:25; just as the enumeration of all the possessions of Tyre, which fall with the ship into the heart of the sea, does to the wealth and glory in Ezekiel 27:25. They who manned the ship also perish with the cargo, - \"the seamen,\" i.e., sailors, rowers, repairers of leaks (calkers), also the merchants on board, and the fighting men who defended the ship and its goods against pirates, - the whole qâhâl, or gathering of people, in the ship. The difficult expression בּכל־קהלך can only be taken as an explanatory apposition to אשׁר בּך: all the men who are in thee, namely, in the multitude of people in thee. Ezekiel 27:28. When the vessel is wrecked, the managers of the ship raise such a cry that the migreshōth tremble. מגרשׁ is used in Numbers 35:2 for the precincts around the Levitical cities, which were set apart as pasture ground for the flocks; and in Ezekiel 45:2; Ezekiel 48:17, for the ground surrounding the holy city. Consequently מגרשׁות cannot mean the suburbs of Tyre in the passage before us, but must signify the open places on the mainland belonging to Tyre, i.e., the whole of its territory, with the fields and villages contained therein. The rendering \"fleet,\" which Ewald follows the Vulgate in adopting, has nothing to support it.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thy rowers brought thee into great waters: the east wind broke thee up in the heart of the seas. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thy riches and thy sales, thy bartering wares, thy seamen and thy sailors, the repairers of thy leaks and the treaders in thy wares, and all thy fighting men in thee, together with all the multitude of people in thee, fell into the heart of the seas in the day of thy fall. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". At the noise of the cry of thy sailors the places tremble. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And out of their ships come all the oarsmen, seamen, all the sailors of the sea; they come upon the land, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And make their voice heard over thee, and cry bitterly, and put dust upon their heads, and cover themselves with ashes; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And shave themselves bald on thy account, and gird on sackcloth, and weep for thee in anguish of soul a bitter wailing. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They raise over thee in their grief a lamentation, and lament over thee: Who is like Tyre! like the destroyed one in the midst of the sea!. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". When thy sales came forth out of the seas, thou didst satisfy many nations; with the abundance of thy goods and thy wares thou didst enrich kings of the earth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Now that thou art wrecked away from the seas in the depths of the water, thy wares and all thy company are fallen in thee. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". All the inhabitants of the islands are amazed at thee, and their kings shudder greatly; their faces quiver. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The traders among the nations hiss over thee; thou hast become a terror, and art gone for ever. - The allusion to the ships of Tarshish, to which Tyre was indebted for its glory, serves as an introduction to a renewal in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the allegory of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:5-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Tyre is a ship, which is wrecked by the east wind (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In Palestine (Arabia and Syria) the east wind is characterized by continued gusts; and if it rises into a tempest, it generally causes great damage on account of the violence of the gusts (see Wetzstein in Delitzsch's commentary on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Like a ship broken in pieces by the storm, Tyre with all its glory sinks into the depths of the sea. The repetition of בּלב in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " forms an effective contrast to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; just as the enumeration of all the possessions of Tyre, which fall with the ship into the heart of the sea, does to the wealth and glory in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They who manned the ship also perish with the cargo, - \"the seamen,\" i.e., sailors, rowers, repairers of leaks (calkers), also the merchants on board, and the fighting men who defended the ship and its goods against pirates, - the whole qâhâl, or gathering of people, in the ship. The difficult expression בּכל־קהלך can only be taken as an explanatory apposition to אשׁר בּך: all the men who are in thee, namely, in the multitude of people in thee. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". When the vessel is wrecked, the managers of the ship raise such a cry that the migreshōth tremble. מגרשׁ is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for the precincts around the Levitical cities, which were set apart as pasture ground for the flocks; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 45:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 48:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for the ground surrounding the holy city. Consequently מגרשׁות cannot mean the suburbs of Tyre in the passage before us, but must signify the open places on the mainland belonging to Tyre, i.e., the whole of its territory, with the fields and villages contained therein. The rendering \"fleet,\" which Ewald follows the Vulgate in adopting, has nothing to support it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 27:29. The ruin of this wealthy and powerful metropolis of the commerce of the world produces the greatest consternation among all who sail upon the sea, so that they forsake their ships, as if they were no longer safe in them, and leaving them for the land, bewail the fall of Tyre with deepest lamentation. השׁמיע with בּקול, as in Psalm 26:7; 1 Chronicles 15:19, etc. For the purpose of depicting the lamentation as great and bitter in the extreme, Ezekiel groups together all the things that were generally done under such circumstances, viz., covering the head with dust (cf. Joshua 7:6; 1 Samuel 4:12; and Job 2:12) and ashes (התפּלּשׁ, to strew, or cover oneself, not to roll oneself: see the comm. on Micah 1:10); shaving a bald place (see Ezekiel 7:18 and the comm. on Micah 1:16); putting on sackcloth; loud, bitter weeping (בּמר, as in Job 7:11 and Job 10:1); and singing an mournful dirge (Ezekiel 27:32.). בּניהם, in lamento eorum; ני contracted from נהי (Jeremiah 9:17-18; cf. הי, Ezekiel 2:10). The reading adopted by the lxx, Theodot., Syr., and eleven Codd. (בּניהם) is unsuitable, as there is no allusion to sons, but the seamen themselves raise the lamentation. The correction proposed by Hitzig, בּפיהם, is altogether inappropriate. The exclamation, Who is like Tyre! is more precisely defined by כּדמּה, like the destroyed one in the midst of the sea. דּמּה, participle Pual, with the מ dropt, as in 2 Kings 2:10, etc. (vid., Ges. 52. 2, Anm. 6). It is quite superfluous to assume that there was a noun דּמּה signifying destruction. 'בּצאת עזב has been aptly explained by Hitzig; \"inasmuch as thy wares sprang out of the sea, like the plants and field-fruits out of the soil\" (the selection of the word השׂבּעתּ also suggested this simile); \"not as being manufactured at Tyre, and therefore in the sea, but because the sea floated the goods to land for the people in the ships, and they satisfied the desire of the purchasers.\" Tyre satisfied peoples and enriched kings with its wares, not only by purchasing from them and paying for their productions with money or barter, but also by the fact that the Tyrians gave a still higher value to the raw material by the labour which they bestowed upon them. הוניך in the plural is only met with here. - Ezekiel 27:34. But now Tyre with its treasures and its inhabitants has sunk in the depths of the sea. The antithesis in which Ezekiel 27:34 really stands to Ezekiel 27:33 does not warrant our altering עת into עתּ נשׁבּרתּ, as Ewald and Hitzig propose, or adopting a different division of the second hemistich. עת is an adverbial accusative, as in Ezekiel 16:57 : \"at the time of the broken one away from the seas into the depth of the waters, thy wares and thy people have fallen, i.e., perished.\" עת נשׁבּרת, tempore quo fracta es. נשׁבּרת מימּים is intentionally selected as an antithesis to נושׁבת מימּים in Ezekiel 26:17. - Ezekiel 27:35. All the inhabitants of the islands and their kings, i.e., the inhabitants of the (coast of the) Mediterranean and its islands, will be thrown into consternation at the fall of Tyre; and (Ezekiel 27:36) the merchants among the nations, i.e., the foreign nations, the rivals of Tyre in trade, will hiss thereat; in other words, give utterance to malicious joy. שׁמם, to be laid waste, or thrown into perturbation with terror and amazement. רעם פנים .tnemezama dna, to tremble or quiver in the face, i.e., to tremble so much that the terror shows itself in the countenance. - In Ezekiel 27:36 Ezekiel brings the lamentation to a close in a similar manner to the threat contained in Ezekiel 26 (vid., Ezekiel 26:21). ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The ruin of this wealthy and powerful metropolis of the commerce of the world produces the greatest consternation among all who sail upon the sea, so that they forsake their ships, as if they were no longer safe in them, and leaving them for the land, bewail the fall of Tyre with deepest lamentation. השׁמיע with בּקול, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 26:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. For the purpose of depicting the lamentation as great and bitter in the extreme, Ezekiel groups together all the things that were generally done under such circumstances, viz., covering the head with dust (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 7:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and ashes (התפּלּשׁ, to strew, or cover oneself, not to roll oneself: see the comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); shaving a bald place (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 7:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and the comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); putting on sackcloth; loud, bitter weeping (בּמר, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and singing an mournful dirge (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). בּניהם, in lamento eorum; ני contracted from נהי (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 9:17-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf. הי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The reading adopted by the lxx, Theodot., Syr., and eleven Codd. (בּניהם) is unsuitable, as there is no allusion to sons, but the seamen themselves raise the lamentation. The correction proposed by Hitzig, בּפיהם, is altogether inappropriate. The exclamation, Who is like Tyre! is more precisely defined by כּדמּה, like the destroyed one in the midst of the sea. דּמּה, participle Pual, with the מ dropt, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. (vid., Ges. 52. 2, Anm. 6). It is quite superfluous to assume that there was a noun דּמּה signifying destruction. 'בּצאת עזב has been aptly explained by Hitzig; \"inasmuch as thy wares sprang out of the sea, like the plants and field-fruits out of the soil\" (the selection of the word השׂבּעתּ also suggested this simile); \"not as being manufactured at Tyre, and therefore in the sea, but because the sea floated the goods to land for the people in the ships, and they satisfied the desire of the purchasers.\" Tyre satisfied peoples and enriched kings with its wares, not only by purchasing from them and paying for their productions with money or barter, but also by the fact that the Tyrians gave a still higher value to the raw material by the labour which they bestowed upon them. הוניך in the plural is only met with here. - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But now Tyre with its treasures and its inhabitants has sunk in the depths of the sea. The antithesis in which ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " really stands to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " does not warrant our altering עת into עתּ נשׁבּרתּ, as Ewald and Hitzig propose, or adopting a different division of the second hemistich. עת is an adverbial accusative, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:57",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"at the time of the broken one away from the seas into the depth of the waters, thy wares and thy people have fallen, i.e., perished.\" עת נשׁבּרת, tempore quo fracta es. נשׁבּרת מימּים is intentionally selected as an antithesis to נושׁבת מימּים in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 26:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". All the inhabitants of the islands and their kings, i.e., the inhabitants of the (coast of the) Mediterranean and its islands, will be thrown into consternation at the fall of Tyre; and (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the merchants among the nations, i.e., the foreign nations, the rivals of Tyre in trade, will hiss thereat; in other words, give utterance to malicious joy. שׁמם, to be laid waste, or thrown into perturbation with terror and amazement. רעם פנים .tnemezama dna, to tremble or quiver in the face, i.e., to tremble so much that the terror shows itself in the countenance. - In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Ezekiel brings the lamentation to a close in a similar manner to the threat contained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 26:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]