[{"num":52,"verse":"To victory, the psalm of David, when Doeg (the) Idumaean came, and told to Saul, and said to him, David came into the house of Ahimelech. What hast thou glory in malice; which art mighty in wickedness? (To victory, the song of David, when Doeg the Edomite came, and told Saul, and said to him, David went into the house of Ahimelech. Why hast thou glory in evil, or in wickedness, mighty man? but the goodness of God endureth forever.)"},{"num":2,"verse":"All day thy tongue thought unrightfulness; as a sharp razor thou hast done guile. (Thy tongue speaketh unrighteousness, sharp like a razor; yea, thou hast been deceitful.)"},{"num":3,"verse":"Thou lovedest malice more than benignity; and wickedness more than to speak equity. (Thou lovedest evil more than good; and lying more than telling the truth.)"},{"num":4,"verse":"Thou lovedest all words of casting down; with a guileful tongue. (Thou with a deceitful, or a lying, tongue.)"},{"num":5,"verse":"Therefore God shall destroy thee into the end, he shall draw thee out by the root, and he shall make thee to pass away from thy tabernacle; and thy root from the land of living men. (And so God shall destroy thee, or ruin thee, forever, yea, he shall draw thee out, and he shall make thee go far away from thy home; he shall root thee out from the land of the living.)"},{"num":6,"verse":"Just men shall see, and shall dread; and they shall laugh on him, (The righteous shall see it, and shall have fear; and then they shall laugh at him,)"},{"num":7,"verse":"and they shall say, Lo! the man that setted not God his helper. But he hoped in the multitude of his riches; and had mastery in his vanity. (and they shall say, Lo! the man who did not want God to be his helper. But he trusted in the multitude of his riches; and had the mastery through his wickedness.)"},{"num":8,"verse":"Forsooth I, as a fruitful olive tree in the house of God; hoped in the mercy of God [into] without end, and into the world of world. (But I am like a fruitful olive tree in the House of God; I trust in God’s love, forever and ever.)"},{"num":9,"verse":"I shall acknowledge to thee into the world, for thou hast done mercy to me; and I shall abide thy name, for it is good in the sight of thy saints. (O God, I shall praise thee forever, for thou hast done mercy to me; and I shall wait on thy name, for it is good in the sight of thy saints.)"}]