[{"num":1,"verse":"Can’t you hear the voice of wisdom? She is standing at the city gates and at every fork in the road, and at the door of every house. Listen to what she says: "},{"num":4,"verse":"“Listen, men!” she calls. “How foolish and naive you are! Let me give you understanding. O foolish ones, let me show you common sense! "},{"num":6,"verse":"Listen to me! For I have important information for you. Everything I say is right and true, for I hate lies and every kind of deception. "},{"num":8,"verse":"My advice is wholesome and good. There is nothing of evil in it. "},{"num":9,"verse":"My words are plain and clear to anyone with half a mind—if it is only open! "},{"num":10,"verse":"My instruction is far more valuable than silver or gold.”"},{"num":11,"verse":"For the value of wisdom is far above rubies; nothing can be compared with it. "},{"num":12,"verse":"Wisdom and good judgment live together, for wisdom knows where to discover knowledge and understanding. "},{"num":13,"verse":"If anyone respects and fears God, he will hate evil. For wisdom hates pride, arrogance, corruption, and deceit of every kind."},{"num":14,"verse":"“I, Wisdom, give good advice and common sense. Because of my strength, kings reign in power, and rulers make just laws. "},{"num":17,"verse":"I love all who love me. Those who search for me shall surely find me. "},{"num":18,"verse":"Unending riches, honor, justice, and righteousness are mine to distribute. "},{"num":19,"verse":"My gifts are better than the purest gold or sterling silver! "},{"num":20,"verse":"My paths are those of justice and right. "},{"num":21,"verse":"Those who love and follow me are indeed wealthy. I fill their treasuries. "},{"num":22,"verse":"The Lord formed me in the beginning, before he created anything else. "},{"num":23,"verse":"From ages past, I am. I existed before the earth began. "},{"num":24,"verse":"I lived before the oceans were created, before the springs bubbled forth their waters onto the earth, "},{"num":25,"verse":"before the mountains and the hills were made. "},{"num":26,"verse":"Yes, I was born before God made the earth and fields and the first handfuls of soil."},{"num":27,"verse":"“I was there when he established the heavens and formed the great springs in the depths of the oceans. I was there when he set the limits of the seas and gave them his instructions not to spread beyond their boundaries. I was there when he made the blueprint for the earth and oceans. "},{"num":30,"verse":"I was the craftsman at his side. I was his constant delight, rejoicing always in his presence. "},{"num":31,"verse":"And how happy I was with what he created—his wide world and all his family of mankind! "},{"num":32,"verse":"And so, young men, listen to me, for how happy are all who follow my instructions."},{"num":33,"verse":"“Listen to my counsel—oh, don’t refuse it—and be wise. "},{"num":34,"verse":"Happy is the man who is so anxious to be with me that he watches for me daily at my gates, or waits for me outside my home! "},{"num":35,"verse":"For whoever finds me finds life and wins approval from the Lord. "},{"num":36,"verse":"But the one who misses me has injured himself irreparably. Those who refuse me show that they love death.”"}]