[{"header":"The Priestly Garments"},{"num":39,"verse":"From the blue, purple, and scarlet material they made finely woven garments for ministering in the Holy Place, and they made the holy garments for Aaron, just as the Lord commanded Moses."},{"header":"The Ephod"},{"num":2,"verse":"He made the ephod out of gold, blue, purple, and scarlet material and fine woven linen. "},{"num":3,"verse":"They hammered out gold sheets and cut off threads to work into the blue, purple, and scarlet material and into the fine linen, a work of skillful design. "},{"num":4,"verse":"They made connecting shoulder pieces for the ephod and attached them to its two edges. "},{"num":5,"verse":"The skillfully woven band that was on it was made like it, of one piece with it: of gold, blue, purple, and scarlet material and fine woven linen, just as the Lord commanded Moses. "},{"num":6,"verse":"They prepared the onyx stones, engraved with the names of the sons of Israel like the engraving on a signet, and mounted them in settings of gold filigree. "},{"num":7,"verse":"He put them on the shoulder pieces of the ephod as stones of remembrance for the sons of Israel, just as the Lord commanded Moses."},{"header":"The Breast Piece"},{"num":8,"verse":"He made a breast piece, skillfully worked, like the work of the ephod: of gold, blue, purple, and scarlet material and fine woven linen. "},{"num":9,"verse":"They made the breast piece square when folded double: one span in length and one span in width when folded double. "},{"num":10,"verse":"They mounted on it four rows of stones. The first row was a row of carnelian, topaz, and emerald; "},{"num":11,"verse":"the second row ruby, sapphire, and crystal; "},{"num":12,"verse":"the third row jacinth, agate, and amethyst; "},{"num":13,"verse":"and the fourth row beryl, onyx, and jasper. They were set in gold filigree when they were mounted. "},{"num":14,"verse":"The stones corresponded to the names of the sons of Israel, twelve stones corresponding to their names, with the engraving of a signet, each with the name of one of the twelve tribes."},{"num":15,"verse":"They made chains of pure gold twisted like cords for the breast piece. "},{"num":16,"verse":"They made two settings of gold filigree and two gold rings, and they put the two rings on the two edges of the breast piece. "},{"num":17,"verse":"They put the two gold cords on the two gold rings at the edges of the breast piece, "},{"num":18,"verse":"and they attached the other two ends of the two cords to the filigree settings, and then attached them to the shoulder pieces of the ephod in front. "},{"num":19,"verse":"They made two gold rings and attached them to the two edges of the breast piece, on the side of it which is toward the inner side of the ephod. "},{"num":20,"verse":"They made two gold rings and attached them in front, on the lower part of the two shoulder pieces of the ephod, close to the place where it’s joined, above the skillfully woven band of the ephod. "},{"num":21,"verse":"They tied the breast piece by its rings to the rings of the ephod with a blue cord so it would rest on the skillfully woven band of the ephod and so the breast piece would not come loose from the ephod."},{"header":"The Robe of the Ephod"},{"num":22,"verse":"He made the robe of the ephod of woven work, entirely of blue. "},{"num":23,"verse":"The opening of the robe was in the middle, like the opening of a coat of mail, with a binding around the opening so it would not be torn. "},{"num":24,"verse":"On the hem of the robe, they placed pomegranates made of blue, purple, and scarlet material and woven linen. "},{"num":25,"verse":"They made bells of pure gold, and put the bells between the pomegranates, on the hem of the robe, all around between the pomegranates. "},{"num":26,"verse":"There was a bell and a pomegranate, then a bell and a pomegranate, all around the hem of the robe for when the High Priest ministered, just as the Lord commanded Moses."},{"header":"The Other Priestly Garments"},{"num":27,"verse":"They made tunics for Aaron and his sons, woven from fine linen, "},{"num":28,"verse":"the turban of fine linen, decorated head coverings of fine linen, linen undergarments of fine woven linen, "},{"num":29,"verse":"and the sash of fine woven linen, woven of blue, purple, and scarlet material, just as the Lord had commanded Moses. "},{"num":30,"verse":"They made the medallion for the holy crown of pure gold, and they wrote on it an inscription like the engraving on a seal: “Holy to the Lord.” "},{"num":31,"verse":"They fastened a blue cord to it in order to fasten it on the turban above, as the Lord had commanded Moses."},{"header":"Moses Inspects the Completed Work"},{"num":32,"verse":"All the work on the Tent of Meeting was completed, and the Israelis had crafted it according to everything that the Lord had commanded Moses, as they should have. "},{"num":33,"verse":"They brought to Moses the tent, all its furnishings, its clasps, its boards, its bars, its pillars, its sockets, "},{"num":34,"verse":"the covering of ram skins dyed red, the covering of dolphin skins, the curtain, "},{"num":35,"verse":"the Ark of the Testimony and its poles, the Mercy Seat, "},{"num":36,"verse":"the table and all its utensils, the bread of the presence, "},{"num":37,"verse":"the lamp stand of pure gold, its lamps (with the lamps in order), its furnishings, its oil for lighting, "},{"num":38,"verse":"the altar of gold, anointing oil, aromatic incense, the screen for the doorway to the tent, "},{"num":39,"verse":"the bronze altar and the bronze lattice for it, its poles, all its furnishings, the basin and its base, "},{"num":40,"verse":"the hangings for the court, its pillars, its sockets, the screen for the gate of the court, its cords, its pegs, all the furnishings for the service of the tent, for the Tent of Meeting, "},{"num":41,"verse":"the woven garments for Aaron the priest for ministering in the Holy Place, and the garments for his sons for serving as priests. "},{"num":42,"verse":"The Israelis had done all the work according to all that the Lord had commanded Moses. "},{"num":43,"verse":"Moses blessed them when he saw all the work and that they had completed it. They had done it just as the Lord had commanded."}]