[{"num":39,"verse":"¶ And of the blue and purple and scarlet, they made the clothing of the ministry, to minister in the sanctuary, and in the same manner they made the holy garments for Aaron; as the LORD had commanded Moses."},{"num":2,"verse":"He also made the ephod of gold, blue, purple, scarlet, and fine twined linen."},{"num":3,"verse":"And they beat the gold into thin plates and cut it into wires to work it in the blue and in the purple and in the scarlet and in the fine linen, with cunning work."},{"num":4,"verse":"They made the shoulder pieces for it to couple it together; by the two edges was it coupled together."},{"num":5,"verse":"And the special girdle of his ephod, that was over it, was of the same, according to the work thereof: of gold, blue, purple, scarlet, and fine twined linen as the LORD had commanded Moses."},{"num":6,"verse":"And they wrought onyx stones inclosed in settings of gold, graven, as seals are graven, with the names of the sons of Israel."},{"num":7,"verse":"And he put them on the shoulders of the ephod that they should be stones for a memorial to the sons of Israel, as the LORD had commanded Moses."},{"num":8,"verse":"He also made the pectoral of cunning work, like the work of the ephod of gold, blue, purple, scarlet, and fine twined linen."},{"num":9,"verse":"It was square; they made the pectoral double; a span was the length thereof and a span the breadth thereof, being doubled."},{"num":10,"verse":"And they set in it four orders of stones. The order was a ruby, an emerald, and a chrysolite: this was the first order."},{"num":11,"verse":"The second order, a carbuncle, a sapphire, and a diamond."},{"num":12,"verse":"The third order, a topaz, a turquoise, and an amethyst."},{"num":13,"verse":"And the fourth order, a tarshish (or beryl), an onyx, and a jasper; they were set and inclosed in their settings of gold."},{"num":14,"verse":"The stones were in agreement with the names of the sons of Israel, twelve, in agreement with their names, like the engravings of a seal, each one in agreement with his name, according to the twelve tribes."},{"num":15,"verse":"They also made the small chains upon the pectoral of wreathen work of pure gold."},{"num":16,"verse":"In the same manner they made two settings of gold and two gold rings and put the two rings in the two ends of the pectoral."},{"num":17,"verse":"And they put the two wreathen chains of gold in those two rings on the ends of the pectoral."},{"num":18,"verse":"And the two ends of the two wreathen chains they fastened in the two settings, which they put on the shoulder pieces of the ephod, on the front part of it."},{"num":19,"verse":"And they made two rings of gold and put them on the two ends of the pectoral upon the border of it, which was on the lower side of the ephod."},{"num":20,"verse":"And they made two other golden rings and put them on the two sides of the ephod underneath toward the front part of it, in the front of its coupling, above the special girdle of the ephod."},{"num":21,"verse":"And they bound the pectoral by its rings to the rings of the ephod with a blue lace, that it might be above the special girdle of the ephod and that the pectoral might not be loosed from the ephod, as the LORD had commanded Moses."},{"num":22,"verse":"And he made the robe of the ephod of woven work, all of blue,"},{"num":23,"verse":"with its collar in the midst of the robe, as the collar of a habergeon, with a band round about the collar that it should not rend."},{"num":24,"verse":"And they made upon the hems of the robe pomegranates of blue, purple, scarlet, and twined linen."},{"num":25,"verse":"They also made the bells of pure gold and put the bells between the pomegranates upon the hem of the robe, round about between the pomegranates;"},{"num":26,"verse":"A bell and a pomegranate, a bell and a pomegranate, round about the hem of the robe to minister in, as the LORD commanded Moses."},{"num":27,"verse":"And they made the coats of fine linen of woven work for Aaron and for his sons,"},{"num":28,"verse":"likewise the mitre of fine linen and the decorations of the tiaras of fine linen and the linen underwear of fine twined linen,"},{"num":29,"verse":"also the girdle of fine twined linen and blue and purple and scarlet of needlework, as the LORD commanded Moses."},{"num":30,"verse":"And they made the open flower, the crown of holiness, of pure gold and wrote upon it a writing, like to the engravings of a seal, HOLINESS UNTO THE LORD."},{"num":31,"verse":"And they tied unto it a lace of blue to fasten it over the mitre, as the LORD had commanded Moses."},{"num":32,"verse":"¶ Thus was all the work of the tabernacle, the tabernacle of the testimony finished, and the sons of Israel did according to all that the LORD had commanded Moses, so did they."},{"num":33,"verse":"And they brought the tabernacle unto Moses, the tabernacle and all its furniture, its hooks, its boards, its bars and its pillars and its sockets,"},{"num":34,"verse":"and the covering of rams’ skins dyed red and the covering of badgers’ skins and the veil of the curtain,"},{"num":35,"verse":"the ark of the testimony and its staves, and the seat of reconciliation,"},{"num":36,"verse":"the table and all its vessels, and the showbread,"},{"num":37,"verse":"the pure lampstand with its lamps, even with the lamps to be set in order, and all its vessels and the oil for light,"},{"num":38,"verse":"the golden altar and the anointing oil and the aromatic incense and the hanging for the tabernacle door."},{"num":39,"verse":"The brasen altar with its grate of brass, its staves, and all its vessels, and the laver and its base."},{"num":40,"verse":"The hangings of the court, its pillars and its sockets, and the hanging for the court gate, its cords and its stakes, and all the vessels of the service of the tabernacle, for the tabernacle of the testimony,"},{"num":41,"verse":"the clothing of service for ministry in the sanctuary, and the holy garments for Aaron the priest and his sons’ garments, to minister in the priesthood."},{"num":42,"verse":"According to all that the LORD had commanded Moses, so the sons of Israel made all the work."},{"num":43,"verse":"And Moses looked upon all the work, and, behold, they had done it as the LORD had commanded, even so had they done it; and Moses blessed them."}]