[[],[{"type":"header","content":"The Priestly Garments"},{"type":"prose","content":"Now from the violet, purple, and scarlet  they made finely woven garments for ministering in the Holy Place, as well as the holy garments which were for Aaron, just as the  had commanded Moses."}],[{"type":"prose","content":"He made the ephod of gold  of violet, purple, and scarlet , and fine twisted linen."}],[{"type":"prose","content":"Then they hammered out gold sheets and cut  into threads to be woven in  the violet, the purple, and the scarlet , and the fine linen, the work of a skilled embroiderer."}],[{"type":"prose","content":"They made attaching shoulder pieces for the ephod; it was attached at its two  ends."}],[{"type":"prose","content":"And the skillfully woven band of its overlay which was on it was like its workmanship, of the same material: of gold  of violet, purple, and scarlet , and fine twisted linen, just as the  had commanded Moses."}],[{"type":"prose","content":"They also made the onyx stones, set in gold filigree ; they were engraved  the engravings of a signet, according to the names of the sons of Israel."}],[{"type":"prose","content":"And he placed them on the shoulder pieces of the ephod  memorial stones for the sons of Israel, just as the  had commanded Moses."}],[{"type":"prose","content":"And he made the breastpiece, the work of a skilled embroiderer, like the workmanship of the ephod: of gold  of violet, purple, and scarlet  and fine twisted linen."}],[{"type":"prose","content":"It was square; they made the breastpiece folded double, a span long and a span wide when folded double."}],[{"type":"prose","content":"And they mounted four rows of stones on it. The first row  a row of ruby, topaz, and emerald;"}],[{"type":"prose","content":"and the second row, a turquoise, a sapphire, and a diamond;"}],[{"type":"prose","content":"and the third row, a jacinth, an agate, and an amethyst;"}],[{"type":"prose","content":"and the fourth row, a beryl, an onyx, and a jasper. They were set in gold filigree  when they were mounted."}],[{"type":"prose","content":"The stones corresponded to the names of the sons of Israel; they were twelve, corresponding to their names,  the engravings of a signet, each with its name for the twelve tribes."}],[{"type":"prose","content":"And they made for the breastpiece chains like cords, work of twisted cords of pure gold."}],[{"type":"prose","content":"They made two gold filigree  and two gold rings, and put the two rings on the two ends of the breastpiece."}],[{"type":"prose","content":"Then they put the two gold cords in the two rings at the ends of the breastpiece."}],[{"type":"prose","content":"And they put the  two ends of the two cords on the two filigree , and put them on the shoulder pieces of the ephod at the front of it."}],[{"type":"prose","content":"They made two gold rings and placed  on the two ends of the breastpiece, on its inner edge which was next to the ephod."}],[{"type":"prose","content":"Furthermore, they made two gold rings and placed them on the bottom of the two shoulder pieces of the ephod, on the front of it, close to the place where it joined, above the woven band of the ephod."}],[{"type":"prose","content":"And they bound the breastpiece by its rings to the rings of the ephod with a violet cord, so that it would be on the woven band of the ephod, and that the breastpiece would not come loose from the ephod, just as the  had commanded Moses."}],[{"type":"prose","content":"Then he made the robe of the ephod of woven work, all of violet;"}],[{"type":"prose","content":"and the opening of the robe was  in the center, as the opening of a coat of mail, with a binding all around its opening, so that it would not be torn."}],[{"type":"prose","content":"And they made pomegranates of violet, purple, and scarlet  twisted  on the hem of the robe."}],[{"type":"prose","content":"They also made bells of pure gold, and put the bells between the pomegranates all around on the hem of the robe,"}],[{"type":"prose","content":"alternating a bell and a pomegranate all around on the hem of the robe for the service, just as the  had commanded Moses."}],[{"type":"prose","content":"They also made the tunics of finely woven linen for Aaron and his sons,"}],[{"type":"prose","content":"and the turban of fine linen, and the decorated caps of fine linen, and the linen undergarments of fine twisted linen,"}],[{"type":"prose","content":"and the sash of fine twisted linen, and violet, purple, and scarlet , the work of the weaver, just as the  had commanded Moses."}],[{"type":"prose","content":"They also made the plate of the holy crown of pure gold, and inscribed it like the engravings of a signet, “Holy to the .”"}],[{"type":"prose","content":"Then they fastened a violet cord to it, to fasten it on the turban above, just as the  had commanded Moses."}],[{"type":"prose","content":"So all the work of the tabernacle of the tent of meeting was completed; and the sons of Israel did according to all that the  had commanded Moses; so they did."}],[{"type":"prose","content":"Then they brought the tabernacle to Moses, the tent and all its furnishings: its clasps, its boards, its bars, its pillars, and its bases;"}],[{"type":"prose","content":"and the covering of rams’ skins dyed red, and the covering of fine leather, and the covering curtain;"}],[{"type":"prose","content":"the ark of the testimony, its poles, and the atoning cover;"}],[{"type":"prose","content":"the table, all its utensils, and the bread of the Presence;"}],[{"type":"prose","content":"the pure  lampstand, with its arrangement of lamps and all its utensils, and the oil for the light;"}],[{"type":"prose","content":"and the gold altar, and the anointing oil and the fragrant incense, and the curtain for the doorway of the tent;"}],[{"type":"prose","content":"the bronze altar and its bronze grating, its poles and all its utensils, the basin and its stand;"}],[{"type":"prose","content":"the hangings for the courtyard, its pillars and its bases, and the curtain for the gate of the courtyard, its ropes and its pegs, and all the equipment for the service of the tabernacle, for the tent of meeting;"}],[{"type":"prose","content":"the woven garments for ministering in the Holy Place, and the holy garments for Aaron the priest and the garments of his sons, to serve as priests."}],[{"type":"prose","content":"So the sons of Israel did all the work according to everything that the  had commanded Moses."}],[{"type":"prose","content":"And Moses examined all the work, and behold, they had done it; just as the  had commanded, this they had done. So Moses blessed them."}]]