[{"header":"Chapter 39"},{"num":1,"verse":"The Priestly Vestments. With the blue, purple, and scarlet cloth were made the finely woven vestments for ministering in the sanctuary, as well as the sacred vestments for Aaron as the Lord had commanded Moses."},{"num":2,"verse":"The Ephod. He made the ephod of gold and blue, purple, and scarlet cloth and fine twisted linen."},{"num":3,"verse":"The gold was beaten into fine plates and cut into wires and was interwoven into the blue, purple, and scarlet cloth and the linen with skilled craftsmanship."},{"num":4,"verse":"Two shoulder pieces were made for the ephod that were attached to its two ends so that it might be joined together."},{"num":5,"verse":"The skillfully woven band to bind it together that was placed over it was of the same workmanship and the same materials, of gold, blue, purple, and scarlet cloth and twisted linen, as the Lord had commanded Moses."},{"num":6,"verse":"The onyx stones were prepared and set into settings of gold filigree. They were engraved with the names of the children of Israel, like an engraver engraves a signet ring."},{"num":7,"verse":"The two stones were set on the shoulder pieces of the ephod as stones of remembrance for the children of Israel, as the Lord had commanded Moses."},{"num":8,"verse":"The Breastplate. He made the breastplate like the ephod, with fine workmanship. It was made of gold, blue, purple and scarlet cloth and fine twisted linen."},{"num":9,"verse":"It was square and doubled over, a span in length and a span in width."},{"num":10,"verse":"They covered it with settings of precious stones arranged in four rows. The first row had a ruby, a topaz, and an emerald."},{"num":11,"verse":"The second row had a turquoise, a sapphire, and a diamond."},{"num":12,"verse":"The third row had a jacinth, an agate, and an amethyst."},{"num":13,"verse":"The fourth row had a beryl, an onyx, and a jasper. They were set in gold filigree settings."},{"num":14,"verse":"The stones corresponded to the names of the children of Israel. There were twelve, standing for their names. They were engraved like the engraving of a signet ring, each name corresponding to a name of one of the twelve tribes."},{"num":15,"verse":"They made chains of pure gold on the breastplate in the shape of twisted cords."},{"num":16,"verse":"They also made two filigree settings of gold and two golden rings and placed the two rings at the two edges of the breastplate."},{"num":17,"verse":"They attached the two golden chains to the two rings at the edges of the breastplate."},{"num":18,"verse":"They attached the other ends of the chains to the two filigree settings and they thus attached it to the front part of the shoulder pieces of the ephod."},{"num":19,"verse":"They made two other golden rings and placed them on the two edges of the breastplate, on its inside edge, next to the ephod."},{"num":20,"verse":"They made two other golden rings and placed them on the two shoulder pieces of the ephod, at their bottom on the front side, next to the place where it is attached to the skillfully woven band of the ephod."},{"num":21,"verse":"Other Priestly Vestments. They then tied the breastplate with its rings to the rings of the ephod with a cord of blue material so that it might lie upon the skillfully woven band of the ephod and that the breastplate might not pull away from the ephod, as the Lord had commanded Moses."},{"num":22,"verse":"The Robe. He made a robe of the ephod all in blue"},{"num":23,"verse":"with an opening in the middle and a woven border around the opening so that it might not be torn."},{"num":24,"verse":"They made a design of pomegranates on the hem of the garment with blue, purple, and scarlet cloth and fine twisted linen."},{"num":25,"verse":"They also made bells out of pure gold and placed the bells in between the pomegranates all around the hem of the robe."},{"num":26,"verse":"There was a bell and a pomegranate, a bell and a pomegranate, around the hem of the robe used for ministering, as the Lord had commanded Moses."},{"num":27,"verse":"Other Vestments. They also wove tunics from fine linen for Aaron and his sons,"},{"num":28,"verse":"a turban of fine linen, caps of fine linen, and undergarments of fine twisted linen,"},{"num":29,"verse":"and a sash of fine twisted linen, of blue, purple, and scarlet cloth, embroidered with fine needlework, as the Lord had commanded Moses."},{"num":30,"verse":"The Turban. They made the plate of the holy crown out of pure gold and they wrote on it as an engraver would engrave a signet ring, “Holy to the Lord.”"},{"num":31,"verse":"They attached it with a blue cord to the front part of the turban, as the Lord had commanded Moses."},{"num":32,"verse":"Moses Inspects the Tabernacle. Thus, all of the work of the tabernacle, of the tent of meeting, was finished. The children of Israel had done everything just as the Lord had commanded Moses."},{"num":33,"verse":"They then brought the tabernacle to Moses, the tent and all its accessories, its clasps, boards, bars, columns, and bases,"},{"num":34,"verse":"the covering of rams’ skins dyed red, the covering of sheep skins, the veil of the screen;"},{"num":35,"verse":"the Ark of Testimony with its poles, and the seat of atonement,"},{"num":36,"verse":"the table with all its accessories and the bread of the Presence,"},{"num":37,"verse":"the lampstand made of pure gold with its lamps, that is, the lamps that were to be placed on top of it, with all its accessories, the oil for light,"},{"num":38,"verse":"the altar of gold, the oil of anointing, the fragrant incense; the screen for the entrance to the tent,"},{"num":39,"verse":"the altar of bronze with its bronze grating, its poles and all its accessories, the basin and its base,"},{"num":40,"verse":"the drapes for the courtyard, their columns, their bases, and the screen for the gate to the courtyard, their cords, their pegs, and all the utensils for ministering in the tabernacle, for the meeting tent;"},{"num":41,"verse":"the finely woven vestments for ministering in the sanctuary, the holy vestments for Aaron the priest, and the vestments for his sons in their priestly ministry."},{"num":42,"verse":"Whatever the Lord had commanded Moses, this is how the children of Israel did all their work."},{"num":43,"verse":"Moses examined all the work, and behold, it was done as the Lord had commanded. So Moses blessed them."}]