[{"header":"Holy Garments for Aaron and His Sons"},{"num":39,"verse":"Next they made woven garments of blue, purple and scarlet, for ministering in the holy place. They made the holy garments for Aaron, as Adonai commanded Moses."},{"num":2,"verse":"He made the ephod of gold, blue, purple, scarlet and finely twisted linen. "},{"num":3,"verse":"They hammered the gold into thin plates, and cut it into threads, to work it in with the blue, purple and scarlet, within the fine linen, the work of a skillful craftsman. "},{"num":4,"verse":"Then they made shoulder pieces for it, joined together at the two ends. "},{"num":5,"verse":"The artfully woven band on the ephod, with which to gird it, was of the same piece and the same kind of workmanship of gold, blue, purple, scarlet and finely twisted linen, as Adonai commanded Moses."},{"num":6,"verse":"They placed the onyx stones, enclosed in settings of gold, etched with the engravings of a signet seal, according to the names of Bnei-Yisrael. "},{"num":7,"verse":"He put them on the shoulder pieces of the ephod, to be memorial stones for Bnei-Yisrael, as Adonai commanded Moses."},{"num":8,"verse":"He made the breastplate, the work of a skillful craftsman, like the work of the ephod, of gold, blue, purple, scarlet and finely twisted linen. "},{"num":9,"verse":"It was square and folded doubled, a span long and a span wide. "},{"num":10,"verse":"They mounted within it four rows of stones. A row of ruby, topaz and emerald were the first row. "},{"num":11,"verse":"In the second row were a turquoise, a sapphire and a diamond. "},{"num":12,"verse":"In the third row were a jacinth, an agate and an amethyst, "},{"num":13,"verse":"and in the fourth row were a beryl, an onyx and a jasper. They were enclosed in fittings of gold within their settings. "},{"num":14,"verse":"The stones corresponded to the names of Bnei-Yisrael, like the engravings of a signet seal, each one according to its name for the twelve tribes."},{"num":15,"verse":"They attached braided chains to the breastplate, of wreathed work from pure gold. "},{"num":16,"verse":"They made two settings of gold, and two golden rings, and set the two rings on the two ends of the breastplate. "},{"num":17,"verse":"They attached the two golden chains to the two rings at the ends of the breastplate. "},{"num":18,"verse":"The other two ends of the chains they placed on the two settings, and fastened them on the shoulder pieces of the ephod, in the front. "},{"num":19,"verse":"They also made two golden rings, and set them on the two ends of the breastplate, on the edge that was toward the side of the ephod facing inward. "},{"num":20,"verse":"They made two more rings of gold, and put them on the two shoulder pieces of the ephod underneath, in the front, enclosed by their coupling, above the artfully woven band of the ephod. "},{"num":21,"verse":"Then they bound the breastplate by the rings to the rings of the ephod with a blue thread, so that it would rest on the artfully woven band and not be loosened from the ephod, as Adonai commanded Moses."},{"num":22,"verse":"He also made the robe of the ephod from woven work, all of blue, "},{"num":23,"verse":"with a hole in the center of the robe, and a binding woven around the hole as a collar, so that it would not be torn. "},{"num":24,"verse":"They also made, on the hem of the robe, pomegranates of blue, purple, scarlet and twisted linen. "},{"num":25,"verse":"Then they made bells of pure gold and put the bells between the pomegranates on the hem of the robe all around, between the pomegranates, "},{"num":26,"verse":"a bell and a pomegranate, then another bell and a pomegranate, all around on the hem of the robe, to minister in, as Adonai commanded Moses."},{"num":27,"verse":"Then they made the sashes of fine linen, woven work for Aaron and for his sons, "},{"num":28,"verse":"the turban of fine linen, the headwear, the linen undergarments of finely twisted linen, "},{"num":29,"verse":"along with the tunic of checkered work, in blue, purple and scarlet, the work of a color weaver, as Adonai commanded Moses."},{"num":30,"verse":"Finally they made the plate of the holy coronet from pure gold, and wrote an inscription on it, like the engraving of a signet seal: HOLY TO Adonai. "},{"num":31,"verse":"They tied to it a blue thread, to fasten onto the turban above, as Adonai commanded Moses."},{"num":32,"verse":"So all the work of the Tabernacle, the Tent of Meeting, was finished. Bnei-Yisrael did everything according to what Adonai had commanded Moses—they did it just so. "},{"num":33,"verse":"Then they brought the Tabernacle to Moses, along with the tent and all of its furnishings, its clasps, its boards, its crossbars, its pillars, and its bases; "},{"num":34,"verse":"along with the covering of ram skins dyed red, and the covering of sealskins, the veil of the curtain; "},{"num":35,"verse":"as well as the Ark of the Testimony with its poles, and the atonement cover; "},{"num":36,"verse":"the table and all of its utensils, the showbread; "},{"num":37,"verse":"the pure menorah with its lamps to be set in order, along with all of its utensils, and oil for the light; "},{"num":38,"verse":"the golden altar, the anointing oil, the sweet incense, and the curtain for the entrance of the tent; "},{"num":39,"verse":"the bronze altar, its grating and its poles along with all of its utensils, and the basin and its base; "},{"num":40,"verse":"the hangings for the courtyard, with its pillars, its bases and the curtain for the gate of the courtyard, with its cords and its pegs, along with all the instruments for the service of the Tabernacle of the Tent of Meeting; "},{"num":41,"verse":"as well as the woven garments for ministering in the Sanctuary, the holy garments for Aaron the kohen and for his sons to serve as kohanim."},{"num":42,"verse":"According to everything that Adonai had commanded Moses, Bnei-Yisrael had done all the work just so. "},{"num":43,"verse":"When Moses saw the entire work, and that they had done it just as Adonai had commanded, Moses blessed them."}]