[{"num":1,"verse":"¶ O LORD, thou hast searched me and known me."},{"num":2,"verse":"Thou knowest my sitting down and my rising up, thou dost understand my thoughts from afar."},{"num":3,"verse":"Thou hast girded my walk and my rest, and hast prepared all my ways."},{"num":4,"verse":"For the word is not even upon my tongue, and, behold, O LORD, thou dost know it altogether."},{"num":5,"verse":"Thou hast formed my face and my insides and laid thine hand upon me."},{"num":6,"verse":"Thy knowledge is wonderful beyond my ability to comprehend; it is high, I cannot understand it."},{"num":7,"verse":"¶ Where shall I go from thy spirit? or where shall I flee from thy presence?"},{"num":8,"verse":"If I ascend to the heavens, thou art there: if I make my bed in Sheol, behold, thou art there."},{"num":9,"verse":"If I take the wings of the dawn and dwell in the uttermost parts of the sea,"},{"num":10,"verse":"even there shall thy hand lead me, and thy right hand shall hold me."},{"num":11,"verse":"If I say, Surely the darkness shall cover me; even the night shall shine because of me."},{"num":12,"verse":"Even the darkness does not hide from thee; but the night shines as the day; the darkness is as the light."},{"num":13,"verse":"For thou hast possessed my kidneys: thou hast covered me in my mother’s womb."},{"num":14,"verse":"I will praise thee; for I am fearfully and wonderfully made; marvellous are thy works, and that, my soul knows right well."},{"num":15,"verse":"My body was not hid from thee, even though I was made in secret and brought together in the lowest parts of the earth."},{"num":16,"verse":"Thine eyes did see my substance yet being imperfect; and in thy book all my members were written, which were then formed, without lacking one of them."},{"num":17,"verse":"¶ Therefore, how precious are thy thoughts unto me, O God! How great is the sum of them!"},{"num":18,"verse":"If I should count them, they are more in number than the sand; when I awake, I am still with thee."},{"num":19,"verse":"Surely thou wilt slay the wicked, O God; depart from me therefore, ye bloodthirsty men."},{"num":20,"verse":"For they speak against thee wickedly, and thine enemies take thy name in vain."},{"num":21,"verse":"Do I not hate all those, O LORD, that hate thee? and am not I grieved with those that rise up against thee?"},{"num":22,"verse":"I hate them with perfect hatred; I count them mine enemies."},{"num":23,"verse":"Search me, O God, and know my heart; try me and know my thoughts"},{"num":24,"verse":"and see if there be any wicked way in me, and lead me in the way eternal."}]