[{"num":139,"verse":"To the Overseer. -- A Psalm by David. Jehovah, Thou hast searched me, and knowest."},{"num":2,"verse":"Thou -- Thou hast known my sitting down, And my rising up, Thou hast attended to my thoughts from afar."},{"num":3,"verse":"My path and my couch Thou hast fanned, And [with] all my ways hast been acquainted."},{"num":4,"verse":"For there is not a word in my tongue, Lo, O Jehovah, Thou hast known it all!"},{"num":5,"verse":"Behind and before Thou hast besieged me, And Thou dost place on me Thy hand."},{"num":6,"verse":"Knowledge too wonderful for me, It hath been set on high, I am not able for it."},{"num":7,"verse":"Whither do I go from Thy Spirit? And whither from Thy face do I flee?"},{"num":8,"verse":"If I ascend the heavens -- there Thou [art], And spread out a couch in Sheol, lo, Thee!"},{"num":9,"verse":"I take the wings of morning, I dwell in the uttermost part of the sea,"},{"num":10,"verse":"Also there Thy hand doth lead me, And Thy right hand doth hold me."},{"num":11,"verse":"And I say, `Surely darkness bruiseth me, Then night [is] light to me."},{"num":12,"verse":"Also darkness hideth not from Thee, And night as day shineth, as [is] darkness so [is] light."},{"num":13,"verse":"For Thou -- Thou hast possessed my reins, Thou dost cover me in my mother's belly."},{"num":14,"verse":"I confess Thee, because that [with] wonders I have been distinguished. Wonderful [are] Thy works, And my soul is knowing [it] well."},{"num":15,"verse":"My substance was not hid from Thee, When I was made in secret, Curiously wrought in the lower part of earth."},{"num":16,"verse":"Mine unformed substance Thine eyes saw, And on Thy book all of them are written, The days they were formed -- And not one among them."},{"num":17,"verse":"And to me how precious have been Thy thoughts, O God, how great hath been their sum!"},{"num":18,"verse":"I recount them! than the sand they are more, I have waked, and I am still with Thee."},{"num":19,"verse":"Dost Thou slay, O God, the wicked? Then, men of blood, turn aside from me!"},{"num":20,"verse":"Who exchange Thee for wickedness, Lifted up to vanity [are] Thine enemies."},{"num":21,"verse":"Do not I hate, Jehovah, those hating Thee? And with Thy withstanders grieve myself?"},{"num":22,"verse":"[With] perfect hatred I have hated them, Enemies they have become to me."},{"num":23,"verse":"Search me, O God, and know my heart, Try me, and know my thoughts,"},{"num":24,"verse":"And see if a grievous way be in me, And lead me in a way age-during!"}]