[{"num":30,"verse":"“But now those younger than I deride me—young men whose fathers are less than my dogs. "},{"num":2,"verse":"Oh, they have strong backs all right, but they are useless, stupid fools. "},{"num":3,"verse":"They are gaunt with famine and have been cast out into deserts and the wastelands, desolate and gloomy. "},{"num":4,"verse":"They eat roots and leaves, "},{"num":5,"verse":"having been driven from civilization. Men shouted after them as after thieves. "},{"num":6,"verse":"So now they live in frightening ravines, and in caves, and among the rocks. "},{"num":7,"verse":"They sound like animals among the bushes, huddling together for shelter beneath the nettles. "},{"num":8,"verse":"These sons of theirs have also turned out to be fools, yes, children of no name, outcasts of civilization."},{"num":9,"verse":"“And now I have become the subject of their ribald song! I am a joke among them! "},{"num":10,"verse":"They despise me and won’t come near me, and don’t mind spitting in my face. "},{"num":11,"verse":"For God has placed my life in jeopardy. These young men, having humbled me, now cast off all restraint before me. "},{"num":12,"verse":"This rabble trips me and lays traps in my path. "},{"num":13,"verse":"They block my road and do everything they can to hasten my calamity, knowing full well that I have no one to help me. "},{"num":14,"verse":"They come at me from all directions. They rush upon me when I am down."},{"num":15,"verse":"“I live in terror now. They hold me in contempt, and my prosperity has vanished as a cloud before a strong wind. "},{"num":16,"verse":"My heart is broken. Depression haunts my days. "},{"num":17,"verse":"My weary nights are filled with pain as though something were relentlessly gnawing at my bones. "},{"num":18,"verse":"All night long I toss and turn, and my garments bind about me. "},{"num":19,"verse":"God has thrown me into the mud. I have become as dust and ashes."},{"num":20,"verse":"“I cry to you, O God, but you don’t answer me. I stand before you and you don’t bother to look. "},{"num":21,"verse":"You have become cruel toward me and persecute me with great power and effect. "},{"num":22,"verse":"You throw me into the whirlwind and dissolve me in the storm. "},{"num":23,"verse":"And I know that your purpose for me is death. "},{"num":24,"verse":"I expected my fall to be broken, just as one who falls stretches out his hand or cries for help in his calamity."},{"num":25,"verse":"“And did I not weep for those in trouble? Wasn’t I deeply grieved for the needy? "},{"num":26,"verse":"I therefore looked for good to come. Evil came instead. I waited for the light. Darkness came. "},{"num":27,"verse":"My heart is troubled and restless. Waves of affliction have come upon me. "},{"num":28,"verse":"I am black but not from sunburn. I stand up and cry to the assembly for help. But I might as well save my breath, for I am considered a brother to jackals and a companion to ostriches. "},{"num":30,"verse":"My skin is black and peeling. My bones burn with fever. "},{"num":31,"verse":"The voice of joy and gladness has turned to mourning."}]