[{"num":30,"verse":"But now younger men in time scorn me, whose fathers I deigned not to set with the dogs of my flock. (But now men younger than me scorn me, men whose fathers I would not deign to put with the dogs of my flock.)"},{"num":2,"verse":"Of which men the strength of their hands was for nought to me, and they were guessed unworthy to that life (yea, they were too weak to be of any use to me)."},{"num":3,"verse":"They were barren for neediness and hunger; they gnawed in (the) wilderness, and were (made) pale for poverty and wretchedness;"},{"num":4,"verse":"and they ate herbs, and the rinds of trees; and the root of junipers was their meat. (and they ate grass, and the bark of trees; and juniper roots were their food.)"},{"num":5,"verse":"The which men ravished these things from great valleys; and when(ever) they had found any of all these things, they ran with (a) cry to them. (They were driven out from among men, who cried after them, as if they were thieves.)"},{"num":6,"verse":"They dwelled in deserts of strands, and in caves of [the] earth, either on gravel. (They lived in dried up riverbeds, and in caves of the earth, and on rocks.)"},{"num":7,"verse":"Which were glad among such things (And they were happy there), and they areckoned (it) as delights to be under bushes."},{"num":8,"verse":"These were the sons of fools, and of unnoble men, and utterly appearing not on [the] earth. (They were the sons of fools, and of unnoble men, and were soon driven out of the land.)"},{"num":9,"verse":"But now I am turned into the song of them, and I am made a proverb to them."},{"num":10,"verse":"They hold me abominable, and they flee far from me, and dread not to spit on my face (and do not fear to spit in my face)."},{"num":11,"verse":"For God hath opened his arrow case, and he hath tormented me, and he hath put a bridle into my mouth."},{"num":12,"verse":"At the right side of the east my wretchednesses have risen up at once; they turned upside-down my feet, and they oppressed me with their paths as with floods. (On my right side they attack me in a mob; they set my feet running, and they raise against me the ways of their destruction.)"},{"num":13,"verse":"They destroyed my ways; they setted treason to me, and they had the mastery; and there was none that helped me (and there was no one who helped me)."},{"num":14,"verse":"They felled in upon me as by a broken wall, and by (a) gate opened (and by an opened gate), and (they) were stretched forth to my wretchednesses."},{"num":15,"verse":"I am driven into nought; he took away my desire as [the] wind, and mine help passed away as a cloud. (I am driven down into nothing; these torments have swept away my hope like the wind, and my help hath passed away like a cloud.)"},{"num":16,"verse":"But now my soul fadeth in myself, and [the] days of torment hold me steadfastly. (But now my life fadeth in myself, and the days of torment strongly hold me.)"},{"num":17,"verse":"In [the] night my bone is pierced with sorrows; and they, that eat me (who eat me), sleep not."},{"num":18,"verse":"In the multitude of those my cloth is wasted (In the multitude of them my cloak is destroyed), and they have girded me (about) as with the collar of a coat."},{"num":19,"verse":"I am comparisoned to clay, and I am made like to a dead spark and ashes."},{"num":20,"verse":"I shall cry to thee, and thou shalt not hear me; I stand, and thou beholdest not me. (I cry to thee, but thou hearest me not/but thou answerest me not; I stand up, but thou seest me not.)"},{"num":21,"verse":"Thou art changed into cruel to me, and in the hardness of thine hand thou art adversary to me. (Thou art cruel towards me, and with thy hard hand thou hast become an adversary to me.)"},{"num":22,"verse":"Thou hast raised me, and hast set me as on (the) wind; and hast hurtled me down strongly. (Thou hast raised me up, and set me on the wind; and then thou hast strongly hurtled me down.)"},{"num":23,"verse":"I know, that thou shalt betake me to death, where an house is ordained to each living man. (I know that thou shalt deliver me unto death, where a house is ordained for each man who liveth.)"},{"num":24,"verse":"Nevertheless thou sendest not out thine hand to the wasting of them; and if they fall down, thou shalt save them."},{"num":25,"verse":"I wept sometime on him that was tormented, and my soul had compassion on a poor man. (There were times when I wept over those who were tormented, and my soul had compassion for the poor.)"},{"num":26,"verse":"I abode goods, and evils be come to me; I abode light, and darknesses brake out. (And I waited for good things, but only evil came to me; I waited for the light, but only darkness broke out.)"},{"num":27,"verse":"Mine inner things boiled out without my rest (My innards, or my bowels, boiled without any rest); and [the] days of torment came before me."},{"num":28,"verse":"I went mourning, and I rose up without strong vengeance in the company, and I cried. (I went in mourning, and without any sunshine, or comfort; I rose up in the congregation, and I cried for help.)"},{"num":29,"verse":"I was the brother of dragons, and the fellow of ostriches."},{"num":30,"verse":"My skin was made black upon me, and my bones dried for heat (and my bones dried up from the heat)."},{"num":31,"verse":"Mine harp is turned into mourning, and mine organ into the voice of weepers. (My harp is tuned for mourning, and my organ to the voice of those who weep.)"}]