[{"header":"Hagar the Servant Girl"},{"num":16,"verse":"Sarai was Abram’s wife, but she did not have any children. She had an Egyptian slave named Hagar."},{"num":2,"verse":"Sarai told Abram, “The Lord has not allowed me to have children, so sleep with my slave. Maybe she can have a son, and I will accept him as my own.” Abram did what Sarai said."},{"num":3,"verse":"So after living ten years in the land of Canaan, Sarai gave her Egyptian slave to Abram as a second wife."},{"num":4,"verse":"Abram slept with Hagar, and she became pregnant. When Hagar realized this, she became very proud and began to feel that she was better than Sarai her owner."},{"num":5,"verse":"Then Sarai said to Abram, “My slave girl now hates me, and I blame you for this. I gave her to you, and she became pregnant. Then she began to feel that she is better than I am. I want the Lord to judge which of us is right.”"},{"num":6,"verse":"But Abram said to Sarai, “She is your slave. You can do anything you want to her.” So Sarai was cruel to Hagar, and Hagar ran away."},{"header":"Hagar’s Son Ishmael"},{"num":7,"verse":"The angel of the Lord found Hagar near a spring of water in the desert. The spring was by the road to Shur."},{"num":8,"verse":"The angel said, “Hagar, Sarai’s slave girl, why are you here? Where are you going?”"},{"num":9,"verse":"The angel of the Lord said to her, “Sarai is your owner. Go home to her and obey her.”"},{"num":10,"verse":"The angel of the Lord also said, “From you will come many people—too many people to count.”"},{"num":11,"verse":"Then the angel of the Lord said,"},{"num":13,"verse":"The Lord talked to Hagar. She began to use a new name for God. She said to him, “You are ‘God Who Sees Me.’” She said this because she thought, “I see that even in this place God sees me and cares for me!”"},{"num":14,"verse":"So the well there was called Beer Lahai Roi. It is between Kadesh and Bered."},{"num":15,"verse":"Hagar gave birth to Abram’s son, and Abram named the son Ishmael."},{"num":16,"verse":"Abram was 86 years old when Ishmael was born from Hagar."}]