[[],[],[{"type":"prose","content":"Sarai, Abram’s wife, hadn’t yet produced a child.She had an Egyptian maid named Hagar. Sarai said to Abram, “ has not seen fit to let me have a child. Sleep with my maid. Maybe I can get a family from her.” Abram agreed to do what Sarai said."}],[{"type":"prose","content":"So Sarai, Abram’s wife, took her Egyptian maid Hagar and gave her to her husband Abram as a wife. Abram had been living ten years in Canaan when this took place. He slept with Hagar and she got pregnant. When Hagar learned she was pregnant, she looked down on her mistress."}],[{"type":"prose","content":"Sarai told Abram, “It’s all your fault that I’m suffering this abuse. I put my maid in bed with you and the minute she knows she’s pregnant, she treats me like I’m nothing. May  decide which of us is right.”"}],[{"type":"prose","content":"“You decide,” said Abram. “Your maid is your business.”Sarai was abusive to Hagar and Hagar ran away."}],[{"type":"prose","content":"An angel of  found her beside a spring in the desert; it was the spring on the road to Shur. He said, “Hagar, maid of Sarai, what are you doing here?”She said, “I’m running away from Sarai my mistress.”"}],[{"type":"prose","content":"The angel of  said, “Go back to your mistress. Put up with her abuse.” He continued, “I’m going to give you a big family, children past counting."},{"type":"poetry","content":"From this pregnancy, you’ll get a son: Name him Ishmael;"},{"type":"poetry","content":"He’ll be a bucking bronco of a man,"},{"type":"poetry","content":"Always stirring up trouble,"}],[{"type":"prose","content":"She answered  by name, praying to the God who spoke to her, “You’re the God who sees me!“Yes! He saw me; and then I saw him!”"}],[{"type":"prose","content":"That’s how that desert spring got named “God-Alive-Sees-Me Spring.” That spring is still there, between Kadesh and Bered."}],[{"type":"prose","content":"Hagar gave Abram a son. Abram named him Ishmael. Abram was eighty-six years old when Hagar gave him his son, Ishmael.* * *"}]]