[{"num":16,"verse":"Now Sarai Avram’s isha bore him no children; and she had a shifchah, an Egyptian, whose shem was Hagar."},{"num":2,"verse":"And Sarai said unto Avram, Hinei now, Hashem hath restrained me from bearing; go now in unto my shifchah; it may be that I may build family by her. And Avram paid heed to the voice of Sarai."},{"num":3,"verse":"And Sarai Avram’s isha took Hagar her shifchah the Egyptian, after Avram had dwelt ten years in Eretz Kena’an, and gave her to her husband Avram to be his isha."},{"num":4,"verse":"And he went in unto Hagar, and she conceived; and when she saw that she had conceived, her gevirah was despised in her eyes."},{"num":5,"verse":"And Sarai said unto Avram, My wrong be upon thee; I have given my shifchah unto thy kheyk; and when she saw that she had conceived, I was despised in her eyes; Hashem judge between me and thee."},{"num":6,"verse":"But Avram said unto Sarai, Hinei, thy shifchah is in thy hand; do to her as it pleaseth thee. And when Sarai dealt harshly with her, she fled from her face."},{"num":7,"verse":"And the Malach Hashem found her by a spring of mayim in the midbar, near the spring on the road to Shur."},{"num":8,"verse":"And he said, Hagar, Sarai’s shifchah, from where camest thou? And where wilt thou go? And she said, I flee from the face of my gevirah Sarai."},{"num":9,"verse":"And the Malach Hashem said unto her, Return to thy gevirah, and submit thyself under her hands."},{"num":10,"verse":"And the Malach Hashem said unto her, I will multiply thy zera exceedingly, that it shall not be numbered for multitude."},{"num":11,"verse":"And the Malach Hashem said unto her, See, thou art with child and shalt bear ben, and shalt call shmo Yishmael; because Hashem shema thy oni (misery)."},{"num":12,"verse":"And he will be a pere adam; his yad will be against kol, and kol yad against him; and he shall dwell in the presence of all his brethren."},{"num":13,"verse":"And she called the Shem of Hashem Who spoke unto her, El Roi (G-d Who Sees); for she said, Have I also here seen after Him that seeth me?"},{"num":14,"verse":"Therefore the well was called Beer-lahai-roi; hinei, it is between Kadesh and Bered."},{"num":15,"verse":"And Hagar bore Avram ben; and Avram called shem bno, which Hagar bore, Yishmael (Ishmael)."},{"num":16,"verse":"And Avram was fourscore and six shanah when Hagar bore Yishmael to Avram."}]