[{"num":16,"verse":"Therefore Sarai, the wife of Abram, had not engendered [to him] free children; but she had a servantess of Egypt, Hagar by name, (And so Sarai, Abram’s wife, had not borne him any children; but she had an Egyptian slave-girl, named Hagar,)"},{"num":2,"verse":"and Sarai said to her husband, Lo! the Lord hath closed me (up), (so) that I should not bear (a) child; enter thou [in]to my servantess, if in hap I shall take children, namely of her (and so enter thou to my slave-girl, and perhaps I shall have children through her). And when he assented to her praying,"},{"num":3,"verse":"she took Hagar (the) Egyptian, her servantess, after ten years after that they began to inhabit the land of Canaan, and she gave Hagar (as) [a] wife to her husband. (she took her slave-girl, Hagar the Egyptian, and she gave her as a wife to her husband; this was ten years after that they had begun to live in the land of Canaan.)"},{"num":4,"verse":"And Abram entered [in]to Hagar; and (soon) Hagar saw that she had conceived, and (then) she despised her lady."},{"num":5,"verse":"And Sarai said to Abram, Thou doest wickedly against me; I gave my servantess into thy bosom, which seeth that she [hath] conceived, and (now she) despiseth me; the Lord deem betwixt me and thee. (And Sarai said to Abram, Thou doest wickedly against me; I gave my slave-girl into thy arms, and she seeth that she hath conceived, and now she despiseth me; the Lord judge between me and thee.)"},{"num":6,"verse":"And Abram answered and said to her, Lo! thy servantess is in thine hand; use thou her as thee liketh. Therefore for Sarai tormented her, she fled away. (And Abram answered and said to her, Lo! thy slave-girl is in thy hands; do thou with her as thou pleaseth. And so when Sarai tormented her, she fled away.)"},{"num":7,"verse":"And when the angel of the Lord had found her beside a well of water in (the) wilderness, which well is in the way of Shur in (the) desert,"},{"num":8,"verse":"he said to her, From whence comest thou Hagar, the servantess of Sarai (Sarai’s slave-girl), and whither goest thou? Which answered, I flee from the face of Sarai, my lady."},{"num":9,"verse":"And the angel of the Lord said to her, Turn thou again to thy lady (Return to thy lady), and be thou meeked under her hands."},{"num":10,"verse":"And again he said, I multiplying shall multiply thy seed, and it shall not be numbered for multitude. (And again he said, I multiplying shall multiply thy descendants, and they shall not be able to be counted for all their multitude.)"},{"num":11,"verse":"And afterward he said (And then he said), Lo! thou hast conceived, and thou shalt bear a son, and thou shalt call his name Ishmael, for the Lord hath heard thy torment;"},{"num":12,"verse":"this shall be a wild man; his hand shall be against all men, and the hands of all men shall be against him; and he shall set (his) tabernacles even against all his brethren (and he shall be at odds with all of his kinsmen)."},{"num":13,"verse":"Forsooth Hagar called the name of the Lord that spake to her, Thou God that sawest me; for she said, Forsooth here I saw the hinder things of him that saw me. (And Hagar called the name of the Lord who spoke to her, Thou God who sawest me; for she said, Here I saw him who saw me, and I still lived.)"},{"num":14,"verse":"Therefore she called that well, The well of him that liveth and seeth me (And that is why people call that well The Well of Lahairoi, or Beerlahairoi); (and) that well is betwixt Kadesh and Bered."},{"num":15,"verse":"And (so) Hagar childed a son to Abram, which called his name Ishmael (and he named him Ishmael)."},{"num":16,"verse":"Abram was eighty years and six, when Hagar childed Ishmael to him. (Abram was eighty-six years old, when Hagar bare Ishmael for him.)"}]