[{"num":1,"verse":"Paul, an apostle (special messenger) of Christ Jesus by appointment and command of God our Savior and of Christ Jesus (the Messiah), our Hope,"},{"num":2,"verse":"To Timothy, my true son in the faith: Grace (spiritual blessing and favor), mercy, and [heart] peace [be yours] from God the Father and Christ Jesus our Lord."},{"num":3,"verse":"As I urged you when I was on my way to Macedonia, stay on where you are at Ephesus in order that you may warn and admonish and charge certain individuals not to teach any different doctrine,"},{"num":4,"verse":"Nor to give importance to or occupy themselves with legends (fables, myths) and endless genealogies, which foster and promote useless speculations and questionings rather than acceptance in faith of God’s administration and the divine training that is in faith (in that leaning of the entire human personality on God in absolute trust and confidence)—"},{"num":5,"verse":"Whereas the object and purpose of our instruction and charge is love, which springs from a pure heart and a good (clear) conscience and sincere (unfeigned) faith."},{"num":6,"verse":"But certain individuals have missed the mark on this very matter [and] have wandered away into vain arguments and discussions and purposeless talk."},{"num":7,"verse":"They are ambitious to be doctors of the Law (teachers of the Mosaic ritual), but they have no understanding either of the words and terms they use or of the subjects about which they make [such] dogmatic assertions."},{"num":8,"verse":"Now we recognize and know that the Law is good if anyone uses it lawfully [for the purpose for which it was designed],"},{"num":9,"verse":"Knowing and understanding this: that the Law is not enacted for the righteous (the upright and just, who are in right standing with God), but for the lawless and unruly, for the ungodly and sinful, for the irreverent and profane, for those who strike and beat and [even] murder fathers and strike and beat and [even] murder mothers, for manslayers,"},{"num":10,"verse":"[For] impure and immoral persons, those who abuse themselves with men, kidnapers, liars, perjurers—and whatever else is opposed to wholesome teaching and sound doctrine"},{"num":11,"verse":"As laid down by the glorious Gospel of the blessed God, with which I have been entrusted."},{"num":12,"verse":"I give thanks to Him Who has granted me [the needed] strength and made me able [for this], Christ Jesus our Lord, because He has judged and counted me faithful and trustworthy, appointing me to [this stewardship of] the ministry."},{"num":13,"verse":"Though I formerly blasphemed and persecuted and was shamefully and outrageously and aggressively insulting [to Him], nevertheless, I obtained mercy because I had acted out of ignorance in unbelief."},{"num":14,"verse":"And the grace (unmerited favor and blessing) of our Lord [actually] flowed out superabundantly and beyond measure for me, accompanied by faith and love that are [to be realized] in Christ Jesus."},{"num":15,"verse":"The saying is sure and true and worthy of full and universal acceptance, that Christ Jesus (the Messiah) came into the world to save sinners, of whom I am foremost."},{"num":16,"verse":"But I obtained mercy for the reason that in me, as the foremost [of sinners], Jesus Christ might show forth and display all His perfect long-suffering and patience for an example to [encourage] those who would thereafter believe on Him for [the gaining of] eternal life."},{"num":17,"verse":"Now to the King of eternity, incorruptible and immortal, invisible, the only God, be honor and glory forever and ever (to the ages of ages). Amen (so be it)."},{"num":18,"verse":"This charge and admonition I commit in trust to you, Timothy, my son, in accordance with prophetic intimations which I formerly received concerning you, so that inspired and aided by them you may wage the good warfare,"},{"num":19,"verse":"Holding fast to faith (that leaning of the entire human personality on God in absolute trust and confidence) and having a good (clear) conscience. By rejecting and thrusting from them [their conscience], some individuals have made shipwreck of their faith."},{"num":20,"verse":"Among them are Hymenaeus and Alexander, whom I have delivered to Satan in order that they may be disciplined [by punishment and learn] not to blaspheme."}]