[{"header":"True Teaching about the Truth"},{"num":1,"verse":"Paul, an apostle of King Jesus according to the command of God our saviour and King Jesus our hope, "},{"num":2,"verse":"to Timothy, my true child in faith: grace, mercy and peace from God the father and King Jesus our Lord."},{"num":3,"verse":"This is my charge to you, just as it was when I went to Macedonia: stay in Ephesus, so that you can tell the relevant people not to teach anything different, "},{"num":4,"verse":"or to cling on to myths and endless genealogies. That sort of thing breeds disputes rather than the instruction in faith that comes from God. "},{"num":5,"verse":"The goal of such instruction is love – the love that comes from a pure heart, a good conscience and sincere faith. "},{"num":6,"verse":"Some people have wandered off from these things and turned aside to foolish talk. "},{"num":7,"verse":"They want to be teachers of the law; but they don’t understand either what they’re talking about or the things about which they pronounce so confidently."},{"header":"The Purpose of the Law"},{"num":8,"verse":"We know, after all, that the law is good – if someone uses it lawfully! "},{"num":9,"verse":"We recognize that the law is not laid down for people who are in the right, but for the lawless and disobedient, for the godless and sinners, the unholy and worldly, for people who kill their father or mother, for murderers, "},{"num":10,"verse":"fornicators, practising homosexuals, slave traders, liars, perjurers, and those who practise any other behaviour contrary to healthy teaching, "},{"num":11,"verse":"in accordance with the gospel of the glory of God the blessed one that was entrusted to me."},{"header":"Paul as an Example of God’s Saving Grace"},{"num":12,"verse":"I thank King Jesus our Lord, who gave me strength. He regarded me as trustworthy by appointing me to his service – "},{"num":13,"verse":"even though I used to say blasphemous things against him, and persecuted his people violently! But I received mercy, because in my unbelief I didn’t know what I was doing. "},{"num":14,"verse":"And the grace of our Lord was more than enough for me, with the faith and love that are in King Jesus. "},{"num":15,"verse":"Here is a word you can trust, which deserves total approval: ‘King Jesus came into the world to save sinners’ – and I’m the worst of them! "},{"num":16,"verse":"But this was why I received mercy: so that in me, precisely as the worst, King Jesus could demonstrate the full scale of his patience, and make me a pattern for those who were going to believe in him and so attain the life of the age to come. "},{"num":17,"verse":"To the King of the ages, the one and only God, immortal and invisible, be honour and glory to the ages of ages, Amen!"},{"header":"The Battle of Faith"},{"num":18,"verse":"I am giving you this command, Timothy my child, in accordance with the prophecies which were made about you before, so that, as they said, you may fight the glorious battle, "},{"num":19,"verse":"holding on to faith and a good conscience. Some have rejected conscience, and their faith has been shipwrecked. "},{"num":20,"verse":"I include Hymenaeus and Alexander in that category. Indeed, I have handed them over to the satan, so that they may be taught not to blaspheme."}]