[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Rejoice.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A common hymnic word, meaning properly to “shout,” or “sing for joy.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 33:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 33:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rejoice in the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Let his excellence, discovered in his works, be the matter of your praise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Praise is comely for the upright — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It well becomes them to be employed in this work of praising God, partly, because they are under great and singular obligations to him, and have abundant occasions to do so; and partly, they will praise him sincerely, affectionately, and with due reverence and thankfulness, as he requires and deserves to be praised; whereas ungodly men do indeed disparage and pollute the holy name of God while they pretend to praise it; and therefore God rejects their praises and prayers.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "33:1-11 Holy joy is the heart and soul of praise, and that is here pressed upon the righteous. Thankful praise is the breath and language of holy joy. Religious songs are proper expressions of thankful praise. Every endowment we possess, should be employed with all our skill and earnestness in God's service. His promises are all wise and good. His word is right, and therefore we are only in the right when we agree with it. His works are all done in truth. He is the righteous Lord, therefore loveth righteousness. What a pity it is that this earth, which is so full of the proofs and instances of God's goodness, should be so empty of his praises; and that of the multitudes who live upon his bounty, there are so few who live to his glory! What the Lord does, he does to purpose; it stands fast. He overrules all the counsels of men, and makes them serve his counsels; even that is fulfilled, which to us is most surprising, the eternal counsel of God, nor can any thing prevent its coming to pass.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Rejoice in the Lord, O ye righteous - This is the sentiment with which the preceding psalm closes. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For praise is comely for the upright - Is befitting, suitable, proper. That is, the upright - the righteous - have abundant cause for praise, and it is for them a suitable employment, or one which becomes them. A man who is upright, or who is a righteous man, has in this very fact much which lays a foundation for praise, for the fact that he has such a character is to be traced to the grace of God, and this in itself is a more valuable possession than gold or kingly crowns would he. That he is not an open violator of the law of God; that he is not intemperate; that he is not the victim of raging lusts and passions; that he is not a dishonest man; that he is not profane; that he is not an infidel or a scoffer; that he is a pious man - a redeemed man - a man of good character - an heir of heaven - is the highest blessing that could be conferred on him; and he who has been saved from outbreaking transgression and crime in a world like this, and has been enabled to live an upright life, has eminently occasion to praise and bless God. Assuredly for such a man praise is an appropriate employment, for such a man it is \"comely.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For praise is comely for the upright - Is befitting, suitable, proper. That is, the upright - the righteous - have abundant cause for praise, and it is for them a suitable employment, or one which becomes them. A man who is upright, or who is a righteous man, has in this very fact much which lays a foundation for praise, for the fact that he has such a character is to be traced to the grace of God, and this in itself is a more valuable possession than gold or kingly crowns would he. That he is not an open violator of the law of God; that he is not intemperate; that he is not the victim of raging lusts and passions; that he is not a dishonest man; that he is not profane; that he is not an infidel or a scoffer; that he is a pious man - a redeemed man - a man of good character - an heir of heaven - is the highest blessing that could be conferred on him; and he who has been saved from outbreaking transgression and crime in a world like this, and has been enabled to live an upright life, has eminently occasion to praise and bless God. Assuredly for such a man praise is an appropriate employment, for such a man it is \"comely.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 33",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 33:1-22. A call to lively and joyous praise to God for His glorious attributes and works, as displayed in creation, and His general and special providence, in view of which, the Psalmist, for all the pious, professes trust and joy and invokes God's mercy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-3. The sentiment falls in with Ps 32:11 (compare 1Co 14:15). The instruments (Ps 92:3; 144:9) do not exclude the voice.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1-3. The sentiment falls in with Ps 32:11 (compare 1Co 14:15). The instruments (Ps 92:3; 144:9) do not exclude the voice.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Rejoice in the Lord, O ye righteous: for praise is comely for the upright.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Praise the Lord with harp: sing unto him with the psaltery and an instrument of ten strings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 Sing unto him a new song; play skilfully with a loud noise.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 33:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 33:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Rejoice in the Lord.\" Joy is the soul of praise. To delight ourselves in God is most truly to extol him, even if we let no notes of song proceed from our lips. That God is, and that he is such a God, and our God, ours for ever and ever, should wake within us an unceasing and overflowing joy. To rejoice ill temporal comforts is dangerous, to rejoice in self is foolish, to rejoice in sin is fatal, but to rejoice in God is heavenly. He who would have a double heaven must begin below to rejoice like those above. \"O ye righteous.\" This is peculiarly your duty, your obligations are greater, and your spiritual nature more adapted to the work, be ye then first in the glad service. Even the righteous are not always glad, and have need to be stirred up to enjoy their privileges. \"For praise is comely for the upright.\" God has an eye to things which are becoming. When saints wear their choral robes, they look fair in the Lord's sight. A harp suits a blood-washed hand. No jewel more ornamental to a holy face than sacred praise. Praise is not comely from unpardoned professional stagers; it is like a jewel of gold in a swine's snout. Crooked hearts make crooked music, but the upright are the Lord's delight. Praise is the dress of saints in heaven, it is meet that they should fit it on below.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 33:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 33:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Praise the Lord with harp.\" Men need all the help they can get to stir them up to praise. This is the lesson to be gathered from the use of musical instruments under the old dispensation. Israel was at school, and used childish things to help her to learn; but in these days, when Jesus gives us spiritual manhood, we can make melody without strings and pipes. We who do not believe these things to be expedient in worship, lest they should mar its simplicity, do not affirm them to be unlawful, and if any George Herbert or Martin Luther can worship God better by the aid of well-tuned instruments, who shall gainsay their right? We do not need them, they would hinder than help our praise but if others are otherwise minded, are they not living in gospel liberty? \"Sing unto him.\" This is the sweetest and best of music. No instrument like the human voice. As a help to singing the instrument is alone to be tolerated, for keys and strings do not praise the Lord. \"With the psaltery and an instrument of ten strings.\" The Lord must have a full octave, for all notes are his, and all music belongs to him. Where several pieces of music are mentioned, we are taught to praise God with all the powers which we possess.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 33:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 33:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Sing unto him a new song.\" All songs of praise should be \"unto him.\" Singing for singing's sake is nothing worth; we must carry our tribute to the King, and not cast it to the winds. Do most worshippers mind this? Our faculties should be exercised when we are magnifying the Lord, so as not to run in an old groove without thought; we ought to make every hymn of praise a new song. To keep up the freshness of worship is a great thing, and in private it is indispensable. Let us not present old worn-out praise, but put life, and soul, and heart, into every song, since we have new mercies every day, and see new beauties in the work and word of our Lord. \"Play skillfully.\" It is wretched to hear God praised in a slovenly manner. He deserves the best that we have. Every Christian should endeavour to sing according to the rules of the art, so that he may keep time and tune with the congregation. The sweetest tunes and the sweetest voices, with the sweetest words, are all too little for the Lord our God; let us not offer him limping rhymes, set to harsh tunes, and growled out by discordant voices. \"With a loud noise.\" Heartiness should be conspicuous in divine worship. Well-bred whispers are disreputable here. It is not that the Lord cannot hear us, but that it is natural for great exultation to express itself in the loudest manner. Men shout at the sight of their kings: shall we offer no loud hosannahs to the Son of David? THE ARGUMENT This Psalm contains a celebration of God for his great and glorious works, both of creation and providence. God is to be praised by reason of his goodness, Psalm 33:1-5; of his power, Psalm 33:6-11; and of his providence, Psalm 33:12-15. And they that fear him shall find mercy and rejoice in him, Psalm 33:16-22.  Rejoice in the Lord;  let his excellency discovered in his works be the matter of your joy and praise. Praise is comely for the upright;  it well becomes them to exercise themselves in this work of praising and blessing of God; partly because they have such singular and abundant obligations and occasions to do so; and partly because they will praise God worthily and heartily, and with due reverence and thankfulness, as God requires, and deserves to be praised; whereas ungodly men do indeed disparage and pollute the holy name of God, while they pretend to praise it, and therefore God rejects their praises and prayers. See Psalm 50:16 119:7 Proverbs 28:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Sing unto him a new song.\" All songs of praise should be \"unto him.\" Singing for singing's sake is nothing worth; we must carry our tribute to the King, and not cast it to the winds. Do most worshippers mind this? Our faculties should be exercised when we are magnifying the Lord, so as not to run in an old groove without thought; we ought to make every hymn of praise a new song. To keep up the freshness of worship is a great thing, and in private it is indispensable. Let us not present old worn-out praise, but put life, and soul, and heart, into every song, since we have new mercies every day, and see new beauties in the work and word of our Lord. \"Play skillfully.\" It is wretched to hear God praised in a slovenly manner. He deserves the best that we have. Every Christian should endeavour to sing according to the rules of the art, so that he may keep time and tune with the congregation. The sweetest tunes and the sweetest voices, with the sweetest words, are all too little for the Lord our God; let us not offer him limping rhymes, set to harsh tunes, and growled out by discordant voices. \"With a loud noise.\" Heartiness should be conspicuous in divine worship. Well-bred whispers are disreputable here. It is not that the Lord cannot hear us, but that it is natural for great exultation to express itself in the loudest manner. Men shout at the sight of their kings: shall we offer no loud hosannahs to the Son of David? ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This Psalm contains a celebration of God for his great and glorious works, both of creation and providence. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "God is to be praised by reason of his goodness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 33:1-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; of his power, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 33:6-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and of his providence, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 33:12-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And they that fear him shall find mercy and rejoice in him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 33:16-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Rejoice in the Lord; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " let his excellency discovered in his works be the matter of your joy and praise. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Praise is comely for the upright; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it well becomes them to exercise themselves in this work of praising and blessing of God; partly because they have such singular and abundant obligations and occasions to do so; and partly because they will praise God worthily and heartily, and with due reverence and thankfulness, as God requires, and deserves to be praised; whereas ungodly men do indeed disparage and pollute the holy name of God, while they pretend to praise it, and therefore God rejects their praises and prayers. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 50:16 119:7 Proverbs 28:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Rejoice in the Lord, O ye righteous,.... See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for praise is comely for the upright; it becomes them; it is their duty; they are bound unto it by the mercies and favours they have received; should they not give praise to God, the stones of the wall would cry out, and rebuke them for their ingratitude: it is beautiful, and looks lovely in them; it is an ornament to them, and is, in the sight of God, of great esteem: it is very acceptable to him, and when grace is in exercise, and their hearts in tune, being sensibly touched and impressed with the goodness of God, it is desirable by them, and is pleasant and delightful to them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for praise is comely for the upright; it becomes them; it is their duty; they are bound unto it by the mercies and favours they have received; should they not give praise to God, the stones of the wall would cry out, and rebuke them for their ingratitude: it is beautiful, and looks lovely in them; it is an ornament to them, and is, in the sight of God, of great esteem: it is very acceptable to him, and when grace is in exercise, and their hearts in tune, being sensibly touched and impressed with the goodness of God, it is desirable by them, and is pleasant and delightful to them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Rejoice in the LORD, O ye righteous: for praise is {a} comely for the upright.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Rejoice in the LORD, O ye righteous: ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "for",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " praise is ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " comely for the upright.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) It is the duty of the godly to set forth the praises of God for his mercy and power showed to them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rejoice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Shout for joy: the same verb as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though in a different form. As in that verse, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the righteous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the upright",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the true Israelites, are addressed. Praise is their duty and their honour: in their mouths alone is it seemly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "praise &c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] Omit ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 147:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Introductory call to praise.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Rejoice in the Lord, O ye righteous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the first clause of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of which this is almost a repetition; and comp. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 97:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "praise is comely for the upright.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Prayer-book Version gives the meaning, less literally, but in more idiomatic English, \"For it becometh well the just to be thankful.\" Psalm 33:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The call contained in this hexastich is addressed to the righteous and upright, who earnestly seek to live a godly and God-pleasing life, and the sole determining rule of whose conduct is the will and good pleasure of God. These alone know God, whose true nature finds in them a clear mirror; so on their part they are joyfully to confess what they possess in Him. For it is their duty, and at the same time their honour, to praise him, and make their boast in Him. נאוה is the feminine of the adjective נאוה (formed out of נאוי), as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 147:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On כּנּור (lxx κιθάρα, κινύρα) and נבל (lxx ψαλτήριον, νάβλα, ναῦλα, etc.) vid., Introduction @a7II. נבל is the name given to the harp or lyre on account of its resemblance to a skin bottle or flash (root נב, to swell, to be distended), and נבל עשׂור, \"harp of the decade,\"' is the ten-stringed harp, which is also called absolutely עשׂור, and distinguished from the customary נבל, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 92:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". By a comparison of the asyndeton expressions in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Aben-Ezra understands by נבל עשור two instruments, contrary to the tenour of the words. Gecatilia, whom he controverts, is only so far in error as that he refers the ten to holes (נקבים) instead of to strings. The בּ is Beth instrum., just like the expression κιθαρίζειν ἐν κιθάραις, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A \"new song\" is one which, in consequence of some new mighty deeds of God, comes from a new impulse of gratitude in the heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently in the Psalms, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Judith 6:13, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In היטיבוּ the notions of scite and strenue, suaviter and naviter, blend. With בּתרוּעה, referring back to רננו, the call to praise forms, as it were, a circle as it closes. ",
        "children": []
      }
    ]
  }
]