[{"header":"Joseph Is Sold to Potiphar in Egypt"},{"num":39,"verse":"The traders who bought Joseph took him down to Egypt. They sold him to the captain of Pharaoh’s guard, Potiphar."},{"num":2,"verse":"The Lord helped Joseph become a successful man. Joseph lived in the house of his master, Potiphar the Egyptian."},{"num":3,"verse":"Potiphar saw that the Lord was with Joseph and that the Lord helped Joseph be successful in everything he did."},{"num":4,"verse":"So Potiphar was very happy with Joseph. He allowed Joseph to work for him and to help him rule the house. Joseph was the ruler over everything Potiphar owned."},{"num":5,"verse":"After Joseph was made the ruler over the house, the Lord blessed the house and everything that Potiphar owned. The Lord also blessed everything that grew in Potiphar’s fields. The Lord did this because of Joseph."},{"num":6,"verse":"So Potiphar allowed Joseph to take responsibility for everything in the house. Potiphar didn’t have to worry about anything except deciding what to eat."},{"header":"Joseph Refuses Potiphar’s Wife"},{"num":7,"verse":"After some time, the wife of Joseph’s master began to pay special attention to him. One day she said to him, “Sleep with me.”"},{"num":8,"verse":"But Joseph refused. He said, “My master trusts me with everything in his house. He has given me responsibility for everything here."},{"num":9,"verse":"My master has made me almost equal to him in his house. I cannot sleep with his wife! That is wrong! It is a sin against God.”"},{"num":10,"verse":"The woman talked with Joseph every day, but he refused to sleep with her."},{"num":11,"verse":"One day Joseph went into the house to do his work. He was the only man in the house at the time."},{"num":12,"verse":"His master’s wife grabbed his coat and said to him, “Come to bed with me.” But Joseph ran out of the house so fast that he left his coat in her hand."},{"num":13,"verse":"The woman saw that Joseph had left his coat in her hand and had run out of the house."},{"num":14,"verse":"She called to the men outside and said, “Look! This Hebrew slave was brought here to make fun of us. He came in and tried to attack me, but I screamed."},{"num":15,"verse":"My scream scared him and he ran away, but he left his coat with me.”"},{"num":16,"verse":"Then she kept his coat until her husband, Joseph’s master, came home."},{"num":17,"verse":"She told her husband the same story. She said, “This Hebrew slave you brought here tried to attack me!"},{"num":18,"verse":"But when he came near me, I screamed. He ran away, but he left his coat.”"},{"num":19,"verse":"Joseph’s master listened to what his wife said, and he became very angry."},{"num":20,"verse":"So Potiphar put Joseph into the prison where the king’s enemies were held, and that is where Joseph remained."},{"header":"Joseph in Prison"},{"num":21,"verse":"The Lord was with Joseph and continued to show his kindness to him, so the commander of the prison guards began to like Joseph."},{"num":22,"verse":"The commander of the guards put Joseph in charge of all the prisoners. Joseph was their leader, but he still did the same work they did."},{"num":23,"verse":"The commander of the guards trusted Joseph with everything that was in the prison. This happened because the Lord was with Joseph. The Lord helped Joseph be successful in everything he did."}]