[{"header":"Joseph Succeeds in Adversity"},{"num":39,"verse":"Now Joseph had been brought down to Egypt. Potiphar, an official of Pharaoh, commander of the bodyguards, bought him from the hand of the Ishmaelites, who had brought him down there. "},{"num":2,"verse":"But Adonai was with Joseph. So he became a successful man in the house of his master, the Egyptian. "},{"num":3,"verse":"His master saw that Adonai was with him and that Adonai made everything he set his hand to successful. "},{"num":4,"verse":"Joseph found favor in his eyes, so he served him as a personal servant and he made him an overseer over his household; everything that was his he entrusted into his hand. "},{"num":5,"verse":"From the time that he made him an overseer in his house and over everything that belonged to him, Adonai blessed the Egyptian’s house because of Joseph; Adonai’s blessing was on everything that belonged to him, in the house and in the field. "},{"num":6,"verse":"So he released everything he owned into Joseph’s hand. With him in charge, he did not think about anything except the food he ate."},{"num":7,"verse":"Now after these things, the master’s wife lifted up her eyes at Joseph and said, “Come, lie down with me!”"},{"num":8,"verse":"But he refused. “Look,” he said to his master’s wife, “my master doesn’t think about anything in the house with me in charge, and everything that belongs to him he’s entrusted into my hand. "},{"num":9,"verse":"No one in this house is greater than I, and he has withheld nothing from me—except you, because you are his wife. So how could I commit this great evil and sin against God?”"},{"num":10,"verse":"So whenever she spoke to Joseph, day after day, he did not listen to her invitation to lie down beside her, to be with her. "},{"num":11,"verse":"Now on one such day, he came into the house to do his work, and none of the people of the house were there in the house. "},{"num":12,"verse":"Then she grabbed him by his garment saying, “Come, lie with me!” But he left his garment in her hand, fled and went outside. "},{"num":13,"verse":"When she saw that he had left his garment in her hand and fled outside, "},{"num":14,"verse":"she screamed to the men of her house and said to them, “Look! Someone brought a Hebrew man to us to fool with us. He approached me to lie with me so I screamed out loud. "},{"num":15,"verse":"When he heard me raise my voice and scream, he left his garment with me, fled and went outside.”"},{"num":16,"verse":"Then she kept the garment with her until his master came home. "},{"num":17,"verse":"She spoke the same words to him saying, “The Hebrew slave that you brought us approached me to fool with me. "},{"num":18,"verse":"When I raised my voiced and screamed, he left his garment with me and fled outside.”"},{"num":19,"verse":"Now when his master heard the words his wife spoke to him saying, “Such are the things your slave did to me,” his anger burned. "},{"num":20,"verse":"Then Joseph’s master took him and put him in prison, the place where the king’s prisoners were confined. So there he was, in the prison."},{"num":21,"verse":"But Adonai was with Joseph and extended kindness to him and gave him favor in the eyes of the commander of the prison. "},{"num":22,"verse":"The commander of the prison entrusted into Joseph’s hand all the prisoners who were in the prison, so that everything that was done there, he was responsible for it. "},{"num":23,"verse":"The commander of the prison did not concern himself with anything at all under his care, because Adonai was with him, and Adonai made whatever he did successful."}]