[{"header":"The Man of God From Judah"},{"num":13,"verse":"A man of God came out of Judah to Bethel by the word of the Lord while Jeroboam stood by the altar to burn incense. "},{"num":2,"verse":"He cried against the altar by the word of the Lord and said, “O altar, altar, thus says the Lord: ‘A child named Josiah will be born in the house of David, and he will sacrifice upon you the priests of the high places who burn incense on you, and these men’s bones shall be burned upon you.’ ” "},{"num":3,"verse":"He gave a sign the same day, saying, “This is the sign that the Lord has spoken: ‘The altar will be torn apart, and the ashes that are upon it will be poured out.’ ”"},{"num":4,"verse":"When King Jeroboam heard the saying of the man of God who had cried against the altar in Bethel, he reached out his hand from the altar, saying, “Arrest him!” And the hand that he put forth against him dried up so that he could not pull it back in again. "},{"num":5,"verse":"The altar also was torn, and the ashes poured out from the altar, just as the man of God had said it would as a sign of the Lord."},{"num":6,"verse":"The king answered and said to the man of God, “Seek the face of the Lord your God, and pray for me, that my hand will be healed.” And the man of God interceded with the Lord, and the king’s hand was healed and became as it was before."},{"num":7,"verse":"The king said to the man of God, “Come home with me and refresh yourself, and I will give you a reward.”"},{"num":8,"verse":"The man of God said to the king, “If you were to give me half your house, I would not go with you, nor will I eat bread nor drink water in this place, "},{"num":9,"verse":"for so I was commanded by the word of the Lord, saying: You shall eat no bread, nor drink water nor return by the same way that you came.” "},{"num":10,"verse":"So he went another way and did not return by the same way he came to Bethel."},{"num":11,"verse":"Now there lived an old prophet in Bethel, and his sons came and told him all that the man of God had done that day in Bethel. They also told their father the words that he had spoken to the king. "},{"num":12,"verse":"Their father said to them, “What way did he go?” For his sons had seen the way the man of God who came from Judah had gone. "},{"num":13,"verse":"He said to his sons, “Saddle my donkey.” So they saddled the donkey for him, and he rode on it. "},{"num":14,"verse":"He went after the man of God and found him sitting under an oak, and he said to him, “Are you the man of God who came from Judah?”"},{"num":15,"verse":"Then he said to him, “Come home with me and eat bread.”"},{"num":16,"verse":"He said, “I may not return with you or go in with you, nor will I eat bread nor drink water with you in this place, "},{"num":17,"verse":"for I was commanded by the word of the Lord: You shall eat no bread and drink no water there nor return by the way you came.”"},{"num":18,"verse":"He said to him, “I am a prophet like you, and an angel spoke to me by the word of the Lord, saying, ‘Bring him back with you into your house so that he may eat bread and drink water.’ ” But he had lied to him. "},{"num":19,"verse":"So he went back with him to his house and ate bread and drank water."},{"num":20,"verse":"Then as they sat at the table, the word of the Lord came to the prophet who brought him back, "},{"num":21,"verse":"and he cried out to the man of God who came from Judah, saying, “Thus says the Lord: Since you have disobeyed the mouth of the Lord and have not kept the commandment that the Lord your God commanded you, "},{"num":22,"verse":"but instead came back and have eaten bread and drunk water in the place of which the Lord told you to eat no bread and drink no water, your carcass will not be buried in the tomb of your fathers!”"},{"num":23,"verse":"After he had eaten bread and had drunk, he saddled the donkey for the prophet whom he had brought back. "},{"num":24,"verse":"As he was going, a lion met him on the way and killed him, and his body was thrown in the road, and both the donkey and lion stood by it. "},{"num":25,"verse":"Some men passed by and saw the body thrown in the road with the lion standing by the body, and they came and told the story in the city where the old prophet lived."},{"num":26,"verse":"When the prophet who brought him back from the way heard about it, he said, “It is the man of God who was disobedient to the word of the Lord, and thus the Lord has delivered him to the lion, which has torn and slain him, according to the word of the Lord that He spoke to him.”"},{"num":27,"verse":"He said to his sons, “Saddle my donkey,” and they saddled it. "},{"num":28,"verse":"He then went and found his body thrown in the road, and the donkey and the lion were still standing by the body. The lion had not eaten the body nor attacked the donkey. "},{"num":29,"verse":"The prophet picked up the body of the man of God and laid it on his donkey and brought it back. The old prophet came to the city to mourn and to bury him. "},{"num":30,"verse":"He laid his body in his own tomb, and they mourned over him, saying, “Alas, my brother!”"},{"num":31,"verse":"And after he had buried him, he said to his sons, “When I am dead, bury me in the grave in which the man of God is buried; lay my bones beside his bones. "},{"num":32,"verse":"For the saying that he cried out by the word of the Lord against the altar in Bethel and against all the houses of the high places that are in the cities of Samaria shall surely come to pass.”"},{"num":33,"verse":"After this event Jeroboam did not turn from his evil ways, but made priests for the high places again from among all the people. Any who would, he consecrated to be priests of the high places. "},{"num":34,"verse":"This matter became sin to the house of Jeroboam, so as to cut it off and to destroy it from the face of the earth."}]