[{"header":"The Man of God from Judah"},{"num":13,"verse":"A man of God came from Judah to Bethel by the word of the Lord. Jeroboam was standing by the altar to burn special perfume. "},{"num":2,"verse":"The man cried against the altar by the word of the Lord, and said, “O altar, altar, this is what the Lord says. ‘See, a son will be born to the family of David. His name will be Josiah. On you he will burn the religious leaders of the high places who burn special perfume on you. Human bones will be burned on you.’” "},{"num":3,"verse":"He gave a special thing to be seen the same day. He said, “This is what the Lord says will be seen. ‘See, the altar will be broken in two. And the ashes on it will be poured out.’” "},{"num":4,"verse":"When King Jeroboam heard the words the man of God cried against the altar in Bethel, he put out his hand from the altar, saying, “Take hold of him!” But his hand which he put out against him dried up. So he could not pull it back to himself. "},{"num":5,"verse":"The altar was broken in two and the ashes were poured out. It was the special thing to see that happened just as the man of God said it would by the word of the Lord. "},{"num":6,"verse":"The king said to the man of God, “I beg you, ask for the favor of the Lord your God. Pray for me, that my hand may be made well again.” So the man of God asked for the Lord’s favor. And the king’s hand was made well again. It became as it was before. "},{"num":7,"verse":"Then the king said to the man of God, “Come home with me and have something to eat to make yourself strong again. And I will pay you.” "},{"num":8,"verse":"But the man of God said to the king, “I would not go with you if you were to give me half your house. I would not eat bread or drink water in this place. "},{"num":9,"verse":"For the word of the Lord said to me, ‘You must not eat bread or drink water or return by the way you came.’” "},{"num":10,"verse":"So he went another way. He did not return by the way he came to Bethel."},{"header":"The Death of the Man of God"},{"num":11,"verse":"Now an old man who spoke for God was living in Bethel. His sons came and told him all the things which the man of God had done that day in Bethel. And they told their father the words which the man had spoken to the king. "},{"num":12,"verse":"Their father said to them, “Which way did he go?” Now his sons had seen the way which the man of God who came from Judah had gone. "},{"num":13,"verse":"Then he said to his sons, “Get the donkey ready for me.” So they got the donkey ready for him, and he went away on it. "},{"num":14,"verse":"He went after the man of God and found him sitting under an oak tree. He said to him, “Are you the man of God who came from Judah?” And he said, “I am.” "},{"num":15,"verse":"Then he said to him, “Come home with me and eat bread.” "},{"num":16,"verse":"And he said, “I cannot return with you or go with you. I will not eat bread or drink water with you in this place. "},{"num":17,"verse":"For I was told by the word of the Lord, ‘Do not eat bread or drink water there. Do not return by the way you came.’” "},{"num":18,"verse":"And he said to him, “I am a man who speaks for God like you. An angel spoke to me by the word of the Lord, saying, ‘Bring him back with you to your house, that he may eat bread and drink water.’” But he lied to him. "},{"num":19,"verse":"So he returned with him, and ate bread in his house, and drank water."},{"num":20,"verse":"As they were sitting down at the table, the word of the Lord came to the man who spoke for God who had brought him back. "},{"num":21,"verse":"And he cried to the man of God who came from Judah, saying, “This is what the Lord says, ‘You have not obeyed the word of the Lord. You have not done what the Lord your God told you to do. "},{"num":22,"verse":"You have returned and eaten bread and drunk water in the place the Lord said to you, “Eat no bread and drink no water.” So now your body will not come to the grave of your fathers.’” "},{"num":23,"verse":"And after he had eaten bread and drunk, he got the donkey ready for the man of God whom he had brought back. "},{"num":24,"verse":"When he had gone, a lion met him on the way and killed him. His body was thrown on the road, with the donkey standing beside it. The lion stood beside the body also. "},{"num":25,"verse":"Then men passed by and saw the body thrown on the road, and the lion standing beside the body. So they came and told about it in the city where the old man who spoke for God lived."},{"num":26,"verse":"When the man who spoke for God who had brought him back from the way heard about it, he said, “It is the man of God. He did not obey the word of the Lord. So the Lord has given him to the lion, which has torn him and killed him. It was done as had been spoken to him by the word of the Lord.” "},{"num":27,"verse":"Then he said to his sons, “Get the donkey ready for me.” And they got it ready. "},{"num":28,"verse":"Then he went and found his body thrown on the road with the donkey and the lion standing beside it. The lion had not eaten the body or torn the donkey. "},{"num":29,"verse":"So the man who spoke for God picked up the body of the man of God and laid it on the donkey, and returned with it to the city. He had sorrow for him and buried him. "},{"num":30,"verse":"He laid his body in his own grave, and they had sorrow for him, saying, “O, my brother!” "},{"num":31,"verse":"After he had buried him, he said to his sons, “When I die, bury me in the grave where the man of God is buried. Lay my bones beside his bones. "},{"num":32,"verse":"For what he cried by the word of the Lord against the altar in Bethel and against all the houses of the high places in the cities of Samaria will happen for sure.”"},{"header":"Jeroboam’s Sinful Way"},{"num":33,"verse":"After this, Jeroboam did not return from his sinful way. Again he made religious leaders of the high places from among all the people. He set apart any of them who were willing to be religious leaders of the high places. "},{"num":34,"verse":"This became the sin of the family of Jeroboam, that caused it to be cut off and destroyed from the earth."}]