[{"num":30,"verse":"¶ And it came to pass when David and his men came to Ziklag on the third day that the Amalekites had invaded the Negev and Ziklag and had smitten Ziklag and burned it with fire."},{"num":2,"verse":"And they had taken the women captives that were therein, from the youngest to the oldest; they did not kill any but carried them away and went on their way."},{"num":3,"verse":"So David and his men came to the city, and, behold, it was burned with fire, and their wives and their sons and their daughters were taken captives."},{"num":4,"verse":"Then David and the people that were with him lifted up their voice and wept until they had no more power to weep."},{"num":5,"verse":"And David’s two wives were taken captives, Ahinoam the Jezreelitess and Abigail, who had been the wife of Nabal of Carmel."},{"num":6,"verse":"And David was greatly distressed, for the people spoke of stoning him because the soul of all the people was bitter, each one for his sons and for his daughters; but David encouraged himself in the LORD his God."},{"num":7,"verse":"¶ And David said to Abiathar, the priest, Ahimelech’s son, I pray thee, bring the ephod here to me. And Abiathar brought the ephod to David."},{"num":8,"verse":"And David enquired at the LORD, saying, Shall I pursue after this troop? Shall I overtake them? And he answered him, Pursue; for thou shalt surely overtake them and without fail recover all."},{"num":9,"verse":"So David went, he and the six hundred men that were with him, and they came to the brook Besor, where some stayed behind."},{"num":10,"verse":"But David pursued, he and four hundred men, for two hundred stayed behind, who were so faint that they could not go over the brook Besor."},{"num":11,"verse":"And they found an Egyptian in the field and brought him to David and gave him bread to eat and water to drink,"},{"num":12,"verse":"and they gave him a piece of a cake of figs and two bunches of raisins. And when he had eaten, his spirit came again to him, for he had eaten no bread, nor drunk any water, three days and three nights."},{"num":13,"verse":"And David said unto him, To whom dost thou belong and where art thou from? And the young Egyptian said, I am the slave to an Amalekite, and my master left me three days ago because I was sick."},{"num":14,"verse":"We made an invasion upon towards the Negev from the Chereth and upon Judah and towards the Negev from Caleb, and we burned Ziklag with fire."},{"num":15,"verse":"And David said to him, Wilt thou bring me down to this company? And he said, Swear unto me by God, that thou wilt neither kill me nor deliver me into the hands of my master, and I will bring thee down to this company."},{"num":16,"verse":"And so he brought him down, and behold, they were spread abroad upon all the earth, eating and drinking, and holding a feast because of all the great spoil that they had taken out of the land of the Philistines and out of the land of Judah."},{"num":17,"verse":"And David smote them from the morning twilight even unto the evening of the next day, and none of them escaped except four hundred young men who rode upon camels and fled."},{"num":18,"verse":"And David recovered all that the Amalekites had carried away, and David delivered his two wives."},{"num":19,"verse":"And there was nothing lacking to them, neither small nor great neither sons nor daughters, of the robbery and of all the things that had been taken from them; David recovered it all."},{"num":20,"verse":"And David took all the sheep and the cows, and bringing them with all the other livestock, they said, This is David’s spoil."},{"num":21,"verse":"¶ And David came to the two hundred men who were so faint that they could not follow David, whom they had made also to remain at the brook Besor, and they went forth to meet David and to meet the people that were with him, and when David came near to the people, he saluted them with peace."},{"num":22,"verse":"Then all the wicked men and men of Belial, of those that went with David, answered and said, Because they did not go with us, we will not give them of the spoil that we have recovered, except to each man his wife and his children, that they may lead them away, and depart."},{"num":23,"verse":"Then David said, Ye shall not do so, my brethren, with that which the LORD has given us, who has kept us, and delivered the company that came against us into our hand."},{"num":24,"verse":"For who will hearken unto you in this matter? For as his part is that goes down to the battle, so shall his part be that remains by the stuff; they shall part alike."},{"num":25,"verse":"And it was so from that day forward that he made it a statute and an ordinance for Israel unto this day."},{"num":26,"verse":"And when David came to Ziklag, he sent of the spoil unto the elders of Judah, his friends, saying, Behold a blessing for you of the spoil of the enemies of the LORD:"},{"num":27,"verse":"to those who were in Bethel and to those who were in Ramoth towards the Negev and to those who were in Jattir"},{"num":28,"verse":"and to those who were in Aroer and to those who were in Siphmoth and to those who were in Eshtemoa"},{"num":29,"verse":"and to those who were in Rachal and to those who were in the cities of the Jerahmeelites and to those who were in the cities of the Kenites"},{"num":30,"verse":"and to those who were in Hormah and to those who were in Chorashan and to those who were in Athach"},{"num":31,"verse":"and to those who were in Hebron and in all the places where David had been with his men."}]