[{"header":"Chapter 30"},{"num":1,"verse":"Ziklag Destroyed. Three days later David and his men arrived in Ziklag. The Amalekites had invaded the Negeb and Ziklag; Ziklag was attacked and burned down."},{"num":2,"verse":"The women who were there, young and old, were taken captive. They did not kill any of them, but they carried them off and went on their way."},{"num":3,"verse":"When David and his men arrived in Ziklag, they found it burned to the ground and their wives and their sons and their daughters had been taken captive."},{"num":4,"verse":"David and his men with him wept out loud until they had no more strength to weep."},{"num":5,"verse":"David’s two wives, Ahinoam, the Jezreelite, and Abigail, the wife of Nabal of Carmel were also taken captive."},{"num":6,"verse":"David was greatly distressed because the people were talking about stoning him. Every single one of them was embittered because of his sons and his daughters, but David found strength in the Lord, his God."},{"num":7,"verse":"David said to Abiathar the priest, the son of Ahimelech, “Bring the ephod out here.” Abiathar brought the ephod out to David."},{"num":8,"verse":"David inquired of the Lord saying, “Shall I pursue after this raiding party? Will I overtake them?” He answered him, “Pursue, for you are sure to overtake them and succeed in the rescue.”"},{"num":9,"verse":"David Pursues the Amalekites. David and the six hundred men who were with him left and arrived at the Wadi Besor where some stayed behind,"},{"num":10,"verse":"for two hundred men stayed behind who were too exhausted to continue on over the Wadi Besor. David continued the pursuit with four hundred men."},{"num":11,"verse":"They found an Egyptian in a field and they brought him to David. They gave him bread to eat and water to drink"},{"num":12,"verse":"as well as a piece of fig cake and two raisin cakes. When he had eaten, he revived, for he had not had anything to eat or any water to drink for three days and three nights."},{"num":13,"verse":"David asked him, “To whom do you belong? Where are you from?” The young man answered, “Egypt. I am a slave to an Amalekite. My master abandoned me because I became sick three days ago."},{"num":14,"verse":"We raided the south of the Cherethites, and the territory of Judah, and the south of Caleb, and we burned down Ziklag.”"},{"num":15,"verse":"David said to him, “Can you lead me to this raiding party?” He answered, “Swear to me by God that you will not kill me or hand me over to my master, and I will take you down to them.”"},{"num":16,"verse":"He took him down, and they were scattered all over the countryside, eating, drinking, and dancing to celebrate the great plunder they had taken from the land of the Philistines and the land of Judah."},{"num":17,"verse":"David fought them from dusk of that day until the next evening. None of them escaped except for four hundred young men who mounted their camels and fled away."},{"num":18,"verse":"David recovered everything that the Amalekites had carried away, and David rescued his two wives."},{"num":19,"verse":"Nothing was missing, not young nor old, not sons nor daughters, not plunder nor anything that they had taken. David recovered it all."},{"num":20,"verse":"David drove all of the flocks and herds before the livestock saying, “This is David’s plunder.”"},{"num":21,"verse":"Division of the Spoils. David came to the two hundred men who were so weary that they could not follow and whom David had left behind at the Wadi Besor. They came out to meet David and the people who were with him. As David and the people drew near, he greeted them."},{"num":22,"verse":"All of those who had gone with David but who were wicked men of Belial said, “None of them went with us, so we should not give them any of the spoil. Each of them can take his wife and children and depart.”"},{"num":23,"verse":"David replied, “No, my brothers. You must not do that with what the Lord has given us. The Lord protected us and delivered over into our hands the raiding party that came out against us."},{"num":24,"verse":"Who will listen to what you are saying? The share of the man who went down into battle will be the same as the share of the man who stayed with the supplies. They will be equal shares.”"},{"num":25,"verse":"He made this a statute and an ordinance in Israel from that day up until the present."},{"num":26,"verse":"When David arrived in Ziklag, he sent some of the spoils to the elders of Judah who were his friends saying, “Behold, this is a gift from the spoils of the enemies of the Lord.”"},{"num":27,"verse":"He sent it to those who were in Bethel, to those who were in Ramoth-negeb, to those who were in Jattir,"},{"num":28,"verse":"to those who were in Aroer, to those who were in Siphmoth, to those who were in Eshtemoa,"},{"num":29,"verse":"to those who were in Rachal, to those who were in the cities of the Jerahmeelites, to those who were in the cities of the Kenites,"},{"num":30,"verse":"to those who were in Hormah, to those who were in Borashan, to those who were in Athach,"},{"num":31,"verse":"to those who were in Hebron, and to those who were in all those places where David had roamed."}]