[{"num":30,"verse":"And when David and his men had come into Ziklag in the third day, (they learned that) men of Amalek had made assault on the south part (of Judah,) (and) in Ziklag; and (had) smitten Ziklag, and burnt it by fire. (And when David and his men had come into Ziklag on the third day, they learned that the Amalekites had made an assault on the southern part of Judah, and in Ziklag; and they had struck Ziklag, and had burned it down.)"},{"num":2,"verse":"And they led (away) the women (as) prisoners from thence, from the least unto the most; and they had not slain any, but they led them forth with them, and went in their way. (And they took away the women as prisoners from there, from the least unto the most; and they did not kill any, but they took them away with them, and went on their way.)"},{"num":3,"verse":"Therefore when David and his men had come to the city, and had found it burnt with fire, and that their wives, and their sons, and daughters were led away (as) prisoners,"},{"num":4,"verse":"then David and the people that was with him raised [up] their voices, and wailed, till the tears failed in them."},{"num":5,"verse":"And also [the] two wives of David were led away (as) prisoners, Ahinoam of Jezreel, and Abigail, the wife of Nabal of Carmel."},{"num":6,"verse":"And David was full sorry; certainly all the people would have stoned David, for the soul of each man was bitter on their sons and daughters. Forsooth David was comforted in his Lord God. (And David was in great trouble; yea, all the men would have stoned David, for all of them were bitter over losing their sons and daughters. But David was strengthened by the Lord his God.)"},{"num":7,"verse":"And he said to Abiathar, the priest, the son of Ahimelech, Bring thou [the] ephod to me. And Abiathar brought the ephod to David;"},{"num":8,"verse":"and David counselled with the Lord, and said, Shall I pursue these thieves, either no? and shall I take them? And the Lord said to him, Pursue thou; for without doubt thou shalt take them, and thou shalt take away from them their prey. (and David counselled with the Lord, and said, Shall I pursue these thieves, or not? and shall I be able to overtake them? And the Lord said to him, Pursue thou them; for without a doubt thou shalt overtake them, and thou shalt take their prey away from them.)"},{"num":9,"verse":"Therefore David went forth, he and six hundred men that were with him, and they came unto the strand of Besor; and there the weary men of the host of David abode behind. (And so David went forth, he and the six hundred men who were with him, and they came to the Besor Stream; and the weary men in David’s army stayed behind there.)"},{"num":10,"verse":"Forsooth David pursued, he and four hundred men; for two hundred abided (behind), that were weary, and might not pass [over] the strand of Besor."},{"num":11,"verse":"And they found a (young) man of Egypt in the field, and they brought him to David; and they gave him bread, that he should eat, and water to drink (and they gave him some bread to eat, and some water to drink);"},{"num":12,"verse":"but also they gave to him a gobbet of a bundle of dried figs, and two clusters of dried grapes. And when he had eaten those, his spirit turned again to him, and he was comforted; for he had not eaten bread, neither had drunk water in three days and three nights. (and they also gave him a piece of a bundle of dried figs, and two clusters of dried grapes. And when he had eaten them, his spirit returned to him, and he was strengthened; for he had not eaten any bread, or drunk any water, for three days and three nights.)"},{"num":13,"verse":"Then David said to him, Whose man art thou, either from whence and whither goest thou? And he said, I am a young man of Egypt, the servant of a man of Amalek; but my lord forsook me, for I began to be sick the third day ago."},{"num":14,"verse":"For we brake out at the south coast of (the) Cherethites, and against Judah (near Judah), and at the south of Caleb, and we burnt Ziklag with fire."},{"num":15,"verse":"And David said to him, Mayest thou lead me to this company? Which said (And the young man said), Swear thou to me by God, that thou shalt not slay me, and that thou shalt not betake me into the hands of my lord; and I shall lead thee to this company. And David swore to him."},{"num":16,"verse":"And when the young man had led him thither, lo! they sat at the meat, upon the face of all the earth, eating and drinking, and as hallowing a feast day, for all the prey and spoils which they had taken of the land of Philistines, and of the land of Judah. (And when the young man had led him there, lo! they sat spread out over all the ground, eating and drinking, as if celebrating a feast day, because of all the prey and the spoils which they had taken from the land of the Philistines, and the land of Judah.)"},{"num":17,"verse":"And David smote them from the eventide unto the eventide of the tother day, and not any of them escaped, no but four hundred young men, that went upon camels, and fled (who went upon camels, and fled)."},{"num":18,"verse":"Forsooth David delivered all things which the men of Amalek took, and he delivered his two wives; (And so David recovered all that the Amalekites had taken, and he rescued his two wives;)"},{"num":19,"verse":"neither any of them failed, from little till to great, as well of sons as of daughters, and of spoils; and whatever things they had ravished, David led again all things; (no one was lost, from the least unto the greatest, sons as well as daughters; and all the spoils, yea, whatever they had taken, David brought home again.)"},{"num":20,"verse":"and he took all the flocks and great beasts, and drove them before his face. And they said, This is the prey of David (And the men said, This should all be David’s prey)."},{"num":21,"verse":"Forsooth David came to the two hundred men, that were weary, and abided behind, and might not follow David; and he [had] commanded them to sit at the strand of Besor; which went out against David, and the people that was with him. Forsooth David nighed to the people, and he greeted it peaceably. (And David came back to the two hundred men who were weary, and had stayed behind, and did not follow David; and he had commanded them to remain there at the Besor Stream; and they went out to meet David, and the people who were with him. And David came to these men, and he greeted them warmly.)"},{"num":22,"verse":"And one man, the worst man and wicked of the men that were with David, answered, and said, For they came not with us, we shall not give to them anything of the prey, that we have ravished, but suffice it to each man his wife and his children; and when they have taken them, go they away. (But some men, the worst and the most wicked of those who went with David, said, For they did not come with us, we shall not give them any of the prey, that we have recovered, but let each man take only his wife and his children; and when they have taken them, go they away.)"},{"num":23,"verse":"And David said, My brethren, ye shall not do so, as ye speak, of these things, which the Lord hath given to us, and he hath kept us, and gave the thieves, that brake out against us, into our hands; (But David said, My brothers/My kinsmen, ye shall not do, as ye speak, with these things, which the Lord hath given us, for he hath kept us safe, and delivered the thieves, who broke out against us, into our hands;)"},{"num":24,"verse":"neither any shall hear us strive on this word. For even part shall be of him that goeth down to battle, and of him that dwelleth at the fardels; and in like manner they shall part the prey. (nor shall anyone hear us arguing over this matter. For even portion shall be for him who went down to the battle, as well as for him who stayed with the bundles, or the supplies; yea, in like manner they shall divide up the prey.)"},{"num":25,"verse":"And this was made a constitution and a doom from that day and afterward, and as a law in Israel till into this day. (And from that day forward, this was made a custom, and a judgement, and a law in Israel, until this day.)"},{"num":26,"verse":"Then David came into Ziklag, and he sent gifts of the prey to the elder men of Judah, his neighbours, and said, Take ye blessing of the prey of [the] enemies of the Lord (Have ye a gift out of the prey from the Lord’s enemies);"},{"num":27,"verse":"to them that were in Bethel, and that were in Ramoth, at the south, and that were in Jattir,"},{"num":28,"verse":"and that were in Aroer, and that were in Siphmoth, and that were in Eshtemoa,"},{"num":29,"verse":"and that were in Rachal, and that were in the cities of Jerahmeel, and that were in the cities of Kenites,"},{"num":30,"verse":"and that were in Hormah, and that were in Chorashan, and that were in Athach,"},{"num":31,"verse":"and that were in Hebron, and to other men, that were in these places, in which David dwelled and his men. (and those in Hebron, and to the other men who were in those places, where David and his men had lived.)"}]