[{"header":"Chapter 9"},{"header":"The Example of Paul’s Apostolate"},{"num":1,"verse":"A Missionary’s Rights. Am I not free? Am I not an apostle? Have I not seen Jesus our Lord? Are you not my work in the Lord?"},{"num":2,"verse":"Although others may not regard me as an apostle, at least I am to you, for you are the seal of my apostleship in the Lord."},{"num":3,"verse":"To those who seek to pass judgment on me, my defense is this."},{"num":4,"verse":"Do we not have the right to eat and drink?"},{"num":5,"verse":"Do we not have the right to be accompanied by a believing wife like the other apostles, the brethren of the Lord, and Cephas?"},{"num":6,"verse":"Are Barnabas and I the only ones who do not have the right to refrain from working?"},{"num":7,"verse":"What soldier would ever serve in the army at his own expense? Who plants a vineyard without eating its fruit? Or who tends a flock without consuming some of its milk?"},{"num":8,"verse":"I am not saying this based simply on human authority, for the Law says the very same thing."},{"num":9,"verse":"In the Law of Moses it is written, “You shall not muzzle an ox while it is treading out the grain.” Is it for oxen that God is concerned,"},{"num":10,"verse":"or does he not rather say this for our sake? Without question it was written for our sake, for whoever plows should plow in hope and whoever threshes should thresh in hope, both in expectation of a share in the crop."},{"num":11,"verse":"If we have sown a spiritual crop for you, is it unreasonable for us to expect from you a material harvest?"},{"num":12,"verse":"If others have this claim on you, do not we?"},{"num":15,"verse":"I Have Become All Things to All. However, I have never availed myself of any of these rights, and I have not written this to influence you to grant me such treatment; I would rather die first. No one shall deprive me of this boast!"},{"num":16,"verse":"If I proclaim the gospel, that is no reason for me to boast, for the obligation to do so has been given to me, and woe to me if I fail to fulfill it."},{"num":17,"verse":"If I proclaimed the gospel of my own volition, I would deserve a reward; but if I do not do so voluntarily, I am simply discharging the commission that has been given to me."},{"num":18,"verse":"What then is my reward? It is simply that in my preaching I may offer the gospel free of charge and not make use of the rights that the gospel affords me."},{"num":19,"verse":"Although I am free and belong to no man, I have made myself a slave to all so as to win over as many as possible."},{"num":20,"verse":"To the Jews, I became like a Jew in order to win the Jews. To those under the Law, I became like one under the Law—although I myself am not under the Law—in order to win over those under the Law."},{"num":21,"verse":"To those outside the Law, I became like one outside the Law—although I am not outside the Law of God but am subject to the Law of Christ—in order to win over those outside the Law."},{"num":22,"verse":"To the weak, I have become weak in order to win over the weak. I have become all things to all, so that by every possible means I might save some."},{"num":23,"verse":"I do all this for the sake of the gospel so that I might share it with you."},{"header":"Flee from Idolatry[d]"},{"num":24,"verse":"Discipline Yourself So As Not To Be Disqualified. You are well aware that while all the runners in the stadium compete in the race, only one wins the prize. Run in such a way as to win the prize."},{"num":25,"verse":"Everyone who seeks a prize submits himself to rigorous self-discipline in every respect. They do so to win a perishable crown, while we seek an imperishable one."},{"num":26,"verse":"Therefore, I do not run without purpose, nor do I fight like a man beating the air."},{"num":27,"verse":"Rather, I discipline my body and bring it under control, for fear that after preaching to others I myself may be disqualified."}]