[{"num":3,"verse":"Then we turned and went up the road to Bashan, and Og king of Bashan came out against us, he and all his people, to battle at Edrei."},{"num":2,"verse":"And the Lord said to me, Do not fear him, for I have given him and all his people and his land into your hand; and you shall do to him as you did to Sihon king of the Amorites, who lived at Heshbon."},{"num":3,"verse":"So the Lord our God also gave into our hands Og king of Bashan and all his people, and we smote him until not one was left to him."},{"num":4,"verse":"And we took all his cities at that time; there was not a city which we did not take from them, sixty cities, the whole region of Argob, the kingdom of Og in Bashan."},{"num":5,"verse":"All these cities were fortified with high and haughty walls, gates, and bars, besides a great many unwalled villages."},{"num":6,"verse":"And we utterly destroyed them, as we did to Sihon king of Heshbon, utterly destroying every city—men, women, and children."},{"num":7,"verse":"But all the cattle and the spoil of the cities we took for booty for ourselves."},{"num":8,"verse":"So we took the land at that time out of the hand of the two kings of the Amorites who were beyond the Jordan, from the Valley of the Arnon to Mount Hermon"},{"num":9,"verse":"(The Sidonians call Hermon, Sirion, and the Amorites call it Senir),"},{"num":10,"verse":"All the cities of the plain, and all Gilead, and all Bashan as far as Salecah and Edrei, cities of the kingdom of Og in Bashan."},{"num":11,"verse":"For only Og king of Bashan remained of the remnant of the [gigantic] Rephaim. Behold, his bedstead was of iron; is it not in Rabbah of the Ammonites? Nine cubits was its length and four cubits its breadth, using the cubit of a man [the forearm to the end of the middle finger]."},{"num":12,"verse":"When we took possession of this land, I gave to the Reubenites and the Gadites the territory from Aroer, which is on the edge of the Valley of the Arnon, and half the hill country of Gilead and its cities."},{"num":13,"verse":"The rest of Gilead and all of Bashan, the kingdom of Og, that is, all the region of Argob in Bashan, I gave to the half-tribe of Manasseh. It is called the land of Rephaim [of giant stature]."},{"num":14,"verse":"Jair son of Manasseh took all the region of Argob, that is, Bashan, as far as the border of the Geshurites and the Maacathites, and called it after his own name, Havvoth-jair, so called to this day."},{"num":15,"verse":"And I gave Gilead to Machir [son of Manasseh]."},{"num":16,"verse":"And to the Reubenites and Gadites I gave from Gilead even to the Valley of the Arnon, with the middle of the valley as the boundary of it, as far over as the river Jabbok, the boundary of the Ammonites,"},{"num":17,"verse":"The Arabah also, with the Jordan as its boundary, from Chinnereth as far as the Sea of the Arabah, the Salt [Dead] Sea, under the cliffs [of the headlands] of Pisgah on the east."},{"num":18,"verse":"And I commanded you at that time, saying, The Lord your God has given you this land to possess it; you [Reuben, Gad, and the half-tribe of Manasseh] shall go over [the Jordan] armed before your brethren the other Israelites, all that are able for war."},{"num":19,"verse":"But your wives and your little ones and your cattle—I know that you have many cattle—shall remain in your cities which I have given you,"},{"num":20,"verse":"Until the Lord has given rest to your brethren as to you, and until they also possess the land which the Lord your God has given them beyond the Jordan. Then shall you return every man to the possession which I have given you."},{"num":21,"verse":"And I commanded Joshua at that time, saying, Your own eyes have seen all that the Lord your God has done to these two kings [Sihon and Og]; so shall the Lord do to all the kingdoms into which you are going over [the Jordan]."},{"num":22,"verse":"You shall not fear them, for the Lord your God shall fight for you."},{"num":23,"verse":"And I besought the Lord at that time, saying,"},{"num":24,"verse":"O Lord God, You have only begun to show Your servant Your greatness and Your mighty hand; for what god is there in heaven or on earth that can do according to Your works and according to Your might?"},{"num":25,"verse":"I pray You, [will You not just] let me go over and see the good land that is beyond the Jordan, that goodly mountain country [with Hermon] and Lebanon?"},{"num":26,"verse":"But the Lord was angry with me on your account and would not listen to me; and the Lord said to me, That is enough! Say no more to Me about it."},{"num":27,"verse":"Get up to the top of Pisgah and lift up your eyes westward and northward and southward and eastward, and behold it with your eyes, for you shall not go over this Jordan."},{"num":28,"verse":"But charge Joshua, and encourage and strengthen him, for he shall go over before this people and he shall cause them to possess the land which you shall see."},{"num":29,"verse":"So we remained in the valley opposite Beth-peor."}]