[{"num":15,"verse":"But after a while, during the wheat-harvest season, Shimshon went to see his wife. He brought a young goat for her and said to her father, “I want to go to my wife in her room.” But he wouldn’t let him. "},{"num":2,"verse":"Her father said, “I really thought you hated her altogether, so I gave her to your best man. But her younger sister — isn’t she even prettier? Why not take her instead?” "},{"num":3,"verse":"Shimshon said to them, “This time I’m through with the P’lishtim! I’m going to do something terrible to them!” "},{"num":4,"verse":"So Shimshon went and caught three hundred foxes. Then he took torches, tied pairs of foxes to each other by their tails, and put a torch in the knot of every pair of tails. "},{"num":5,"verse":"Then he set the torches on fire and let the foxes loose in wheat fields of the P’lishtim. In this way he burned up the harvested wheat along with the grain waiting to be harvested, and the olive orchards as well. "},{"num":6,"verse":"The P’lishtim asked, “Who did this?” They answered, “Shimshon the son-in-law of the man from Timnah, because he took Shimshon’s wife and gave her to his best man.” Then the P’lishtim came up and burned both her and her father to death. "},{"num":7,"verse":"Shimshon said to them, “I will certainly have my revenge on you for doing such a thing; but after I do, I’ll stop.” "},{"num":8,"verse":"Infuriated, he began killing them right and left; it was a massacre. Then he went down and stayed in the cave at the ‘Eitam Rock."},{"num":9,"verse":"The P’lishtim went up, pitched camp in Y’hudah and attacked Lechi. "},{"num":10,"verse":"The men of Y’hudah said, “Why are you attacking us?” They replied, “To arrest Shimshon, that’s why — to treat him the way he treated us.” "},{"num":11,"verse":"Then 3,000 men from Y’hudah went down to the cave at the Eitam Rock and said to Shimshon, “Don’t you know that the P’lishtim are our rulers? What are you doing to us?” He answered, “I’ve only treated them the way they treated me.” "},{"num":12,"verse":"They said to him, “We’ve come down to arrest you and hand you over to the P’lishtim.” Shimshon replied, “Swear to me that you won’t fall on me yourselves.” "},{"num":13,"verse":"They said to him, “No, but we will tie you up and hand you over to them. However, we promise not to kill you.” So they tied him up with two new ropes and brought him up from the rock. "},{"num":14,"verse":"When he got to Lechi, the P’lishtim came running and shouting at him; and the Spirit of Adonai came on him powerfully. The ropes on his arms became as weak as burnt flax and fell from his arms. "},{"num":15,"verse":"He found a fresh donkey jawbone, took it in his hand, and with it he struck down a thousand men. "},{"num":16,"verse":"Shimshon said,"},{"num":17,"verse":"After he finished speaking he threw the jawbone away, and the place came to be called Ramat-Lechi [jawbone heights]."},{"num":18,"verse":"Then he felt very thirsty, so he called on Adonai, saying, “You accomplished this great rescue through your servant. But am I now to die from thirst and fall into the hands of the uncircumcised?” "},{"num":19,"verse":"Then God made a gash in the crater at Lechi, and water came out. When he had drunk, his spirit came back; and he revived. This is why the place was called ‘Ein-HaKorei [the spring of him who called], and it is there in Lechi until now. "},{"num":20,"verse":"He judged Isra’el in the period of the P’lishtim for twenty years."}]