[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "50:22-26 Joseph having honoured his father, his days were long in the land, which, for the present, God had given him. When he saw his death approaching, he comforted his brethren with the assurance of their return to Canaan in due time. We must comfort others with the same comforts with which we have been comforted of God, and encourage them to rest on the promises which are our support. For a confession of his own faith, and a confirmation of theirs, he charges them to keep his remains unburied till that glorious day, when they should be settled in the land of promise. Thus Joseph, by faith in the doctrine of the resurrection, and the promise of Canaan, gave commandment concerning his bones. This would keep up their expectation of a speedy departure from Egypt, and keep Canaan continually in their minds. This would also attach Joseph's posterity to their brethren. The death, as well as the life of this eminent saint, was truly excellent; both furnish us with strong encouragement to persevere in the service of God. How happy to set our early in the heavenly race, to continue stedfastly, and to finish the course with joy! This Joseph did, this we also may do. Even when the pains of death are upon us, if we have trusted in Him upon whom the patriarchs, prophets, and apostles depended, we need not fear to say, My flesh and my heart faileth, but God is the strength of my heart, and my portion for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The biography of Joseph is now completed. \"The children of the third generation\" - the grandsons of grandsons in the line of Ephraim. We have here an explicit proof that an interval of about twenty years between the births of the father and that of his first-born was not unusual during the lifetime of Joseph. \"And Joseph took an oath.\" He thus expressed his unwavering confidence in the return of the sons of Israel to the land of promise. \"God will surely visit.\" He was embalmed and put in a coffin, and so kept by his descendants, as was not unusual in Egypt. And on the return of the sons of Israel from Egypt they kept their oath to Joseph ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and buried his bones in Shekem ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sacred writer here takes leave of the chosen family, and closes the bible of the sons of Israel. It is truly a wonderful book. It lifts the veil of mystery that hangs over the present condition of the human race. It records the origin and fall of man, and thus explains the co-existence of moral evil and a moral sense, and the hereditary memory of God and judgment in the soul of man. It records the cause and mode of the confusion of tongues, and thus explains the concomitance of the unity of the race and the specific diversity of mode or form in human speech. It records the call of Abraham, and thus accounts for the preservation of the knowledge of God and his mercy in one section of the human race, and the corruption or loss of it in all the rest. We need scarcely remark that the six days' creation accounts for the present state of nature. It thus solves the fundamental questions of physics, ethics, philology, and theology for the race of Adam. It notes the primitive relation of man to God, and marks the three great stages of human development that came in with Adam, Noah, and Abraham. It points out the three forms of sin that usher in these stages - the fall of Adam, the intermarriage of the sons of God with the daughters of men, and the building of the tower of Babel. It gradually unfolds the purpose and method of grace to the returning penitent through a Deliverer who is successively announced as the seed of the woman, of Shem, of Abraham, Isaac, Jacob, and Judah. This is the second Adam, who, when the covenant of works was about to fall to the ground through the failure of the first Adam, undertook to uphold it by fulfilling all its conditions on behalf of those who are the objects of the divine grace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hence, the Lord establishes his covenant successively with Adam, Noah, and Abraham; with Adam after the fall tacitly, with Noah expressly, and with both generally as the representatives of the race descending from them; with Abraham especially and instrumentally as the channel through which the blessings of salvation might be at length extended to all the families of the earth. So much of this plan of mercy is revealed from time to time to the human race as comports with the progress they have made in the education of the intellectual, moral, and active faculties. This only authentic epitome of primeval history is worthy of the constant study of intelligent and responsible man.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hence, the Lord establishes his covenant successively with Adam, Noah, and Abraham; with Adam after the fall tacitly, with Noah expressly, and with both generally as the representatives of the race descending from them; with Abraham especially and instrumentally as the channel through which the blessings of salvation might be at length extended to all the families of the earth. So much of this plan of mercy is revealed from time to time to the human race as comports with the progress they have made in the education of the intellectual, moral, and active faculties. This only authentic epitome of primeval history is worthy of the constant study of intelligent and responsible man.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22, 23. Joseph dwelt in Egypt—He lived eighty years after his elevation to the chief power [see on [12]Ge 41:46] witnessing a great increase in the prosperity of the kingdom, and also of his own family and kindred—the infant Church of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1625",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Joseph dwelt in Egypt, he, and his father's house,.... Comfortably, quietly, and in great prosperity, not only he, but his brethren and their families, as long as he lived: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Joseph lived one hundred and ten years; and all but seventeen of them in Egypt, for at that age it was when he was brought thither: thirteen years he lived in Potiphar's house, and in prison, for he was thirty years of age when he was brought to Pharaoh, and stood before him, and fourscore years he lived in the greatest honour and prosperity that a man could well wish for. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Joseph lived one hundred and ten years; and all but seventeen of them in Egypt, for at that age it was when he was brought thither: thirteen years he lived in Potiphar's house, and in prison, for he was thirty years of age when he was brought to Pharaoh, and stood before him, and fourscore years he lived in the greatest honour and prosperity that a man could well wish for. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Joseph dwelt in Egypt, he, and his father's house: and Joseph lived an {g} hundred and ten years.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Joseph dwelt in Egypt, he, and his father's house: and Joseph lived an ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hundred and ten years.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Who, even though he ruled in Egypt about eighty years, yet was joined with the church of God in faith and religion.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22–26. Death of Joseph",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an hundred and ten years",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Attention has been called to passages in Egyptian records, in which this age is described as the ideal span of life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Joseph dwelt in Egypt, he, and his father's house: and Joseph lived an hundred and ten years.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Wordsworth notices that Joshua, who superintended the burial of Joseph in Shechem, also lived 110 years. Joseph's death occurred fifty-six years after that of Jacob. Genesis 50:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Death of Joseph. - Joseph lived to see the commencement of the fulfilment of his father's blessing. Having reached the age of 110, he saw Ephraim's שׁלּשׁים בּני \"sons of the third link,\" i.e., of great-grandsons, consequently great-great-grandsons. שׁלּשׁים descendants in the third generation are expressly distinguished from \"children's children\" or grandsons in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is no practical difficulty in the way of this explanation, the only one which the language will allow. As Joseph's two sons were born before he was 37 years old (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Ephraim therefore was born, at the latest, in his 36th year, and possibly in his 34th, since Joseph was married in his 31st year, he might have had grandsons by the time he was 56 or 60 years old, and great-grandsons when he was from 78 to 85, so that great-great-grandsons might have been born when he was 100 or 110 years old. To regard the \"sons of the third generation\" as children in the third generation (great-grandsons of Joseph and grandsons of Ephraim), as many commentators do, as though the construct בּני stood for the absolute, is evidently opposed to the context, since it is stated immediately afterwards, that sons of Machir, the son of Manasseh, i.e., great-grandsons, were also born upon his knees, i.e., so that he could take them also upon his knees and show them his paternal love. There is no reason for thinking of adoption in connection with these words. And if Joseph lived to see only the great-grandsons of Ephraim as well as of Manasseh, it is difficult to imagine why the same expression should not be applied to the grandchildren of Manasseh, as to the descendants of Ephraim. ",
        "children": []
      }
    ]
  }
]