[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Genesis",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A CALM EVENING, PROMISING A BRIGHT MORNING",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "JOSEPH’S FAITHGenesis 50:25",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "JOSEPH’S FAITH",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 50:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This is the one act of Joseph’s life which the author of the Epistle to the Hebrews selects as the sign that he too lived by faith. ‘By faith Joseph, when he died, made mention of the departing of the children of Israel; and gave commandment concerning his bones.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It was at once a proof of how entirely he believed God’s promise, and of how earnestly he longed for its fulfilment. It was a sign too of how little he felt himself at home in Egypt, though to outward appearance he had become completely one of its people. The ancestral spirit was in him true and strong though he was ‘separate from his brethren.’ He bore an Egyptian name, a swelling title, he married an Egyptian woman, he had an Egyptian priest for father-in-law, but he was an Israelite in heart; and in the midst of official cares and a surfeit of honours, his desires turned away from them all towards the land promised by God to his fathers.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And when he lay dying, he could not bear to think that his bones should moulder in the country where his life had been spent. ‘I know that this is not our land after all; swear to me that when the promise that has tarried so long comes at last, you will take me, all that is left of me, and carry it up, and lay it in some corner of the blessed soil, that I too may somehow share in the inheritance of His people. God shall surely visit you. Carry my bones up hence.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Perhaps there is in this wish a trace of something besides faith in God’s promises. Of course, there is a natural sentiment which no clearness of knowledge of a future state wholly dispels. We all feel as if somehow our bodies remain a part of ourselves even after death, and we have wishes where they shall lie. But perhaps Joseph had a more definite belief on the matter than that. What theory of another life does an Egyptian mummy express? Why all that sedulous care to preserve the poor relics? Was it not a consequence of the belief that somehow or other there could be no life without a body, and that in some mysterious way the preservation of that contributed to the continuance of this? And so Joseph, who was himself going to be embalmed and put into a mummy-case, may have caught something of the tone of thought prevalent around him, and have believed that to carry his bones to the land of promise was, in some obscure manner, to carry ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thither. Be that as it may, whether the wish came from a mistake about the relation of flesh and spirit, or only from the natural desire which we too possess, that our graves may not be among strangers, but beside our father’s and our mother’ s-that is not the main thing in this fact. The main thing is that this dying man believed God’s promise, and claimed his share in it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And on this the writer of the Epistle to the Hebrews, whoever he was, fastens. Neglecting the differences in knowledge between Joseph and the Christians whom he addresses, and pointing back to the strong confidence in God and longing for participation in the promises which brightened the glazing eye and gave ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘hope in his death,’ he declares that the principle of action which guided this man in the dim twilight of early revelation, is that same faith which ought to guide us who live in the full light of the unsetting sun.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Taking, then, this incident, with the New Testament commentary upon it, it leads us to a truth which we often lose sight of, but which is indispensable if we would understand the relations of the earlier and later days.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Faith is always the same, though knowledge varies.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-There is a vast difference between a man’s creed and a man’s faith. The one may vary, does vary within very wide limits; the other remains the same. The things believed have been growing from the beginning-the attitude of mind and will by which they have been grasped has been the same from the beginning, and will be the same to the end. And not only so, but it will be substantially the same in heaven as it is on earth. For there is but one bond which unites men to God; and that emotion of loving trust is one and the same in the dim twilight of the world’s morning, and amid the blaze of the noonday of heaven. The contents of faith, that on which it relies, the treasure it grasps, changes; the essence of faith, the act of reliance, the grasp which holds the treasure, does not change.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is difficult to decide how much Joseph’s gospel contained. From our point of view it was very imperfect. The spiritual life was nourished in him and in the rest of ‘the world’s grey fathers’ on what looks to us but like seven basketsful of fragments. They had promises, indeed, in which we, looking at them with the light of fulfilment blazing upon them, can see the broad outlines of the latest revelation, and can trace the future flower all folded together and pale in the swelling bud. But we shall err greatly if we suppose, as we are apt to do, that those promises were to them anything like what they are to us. It requires a very vigorous exercise of very rare gifts to throw ourselves back to their position, and to gain any vivid and approximately accurate notion of the theology of these ancient lovers of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This, at any rate, we may, perhaps, say: they had a sure and clear knowledge of the living God, who had talked with them as with a friend; they knew His inspiring, guiding presence; they knew the forgiveness of sins; they knew, though they very dimly understood, the promise, ‘In thy seed shall all the families of the earth be blessed.’ How far they looked across the gulf of death and beheld anything-even cloudland-on the other side, is a question very hard to answer, and about which confident dogmatism, either affirmative or negative, is unwarranted. But it is to be remembered that, whether they had any notion of a future state or no, they had a promise which fulfilled for them substantially the same office as that does for us. The promise of the land of Canaan gleaming before them through the mists, bare and ‘earthly’ as it seems to us when compared with our hope of an inheritance incorruptible in the heavens, is, by the author of the Epistle to the Hebrews, identified with that hope of ours, for he expressly says that, whilst they were looking for an earthly Canaan, they were ‘desiring a better country, that is an heavenly.’ So that, whether they definitely expected a life after death or not, the anticipation of the land promised to them and to their fathers held the same place in their creed, and as a moral agent in their lives, which the rest that remains for the people of God ought to do in ours.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And it is to be taken into account also that fellowship with God has in it the germ of the assurance of immortality. It seems almost impossible to suppose a state of mind in which a man living in actual communion with God shall believe that death is to end it all. Christ’s proof that immortal life was revealed in the Pentateuch, was the fact that God there called Himself the God of Abraham and of Isaac and of Jacob; by which our Lord meant us to learn that men who are brought into personal relations with God can never die, that it is impossible that a soul which has looked up to the face of the unseen Father with filial love should be left in the grave, or that those who are separated to be His, as He is theirs, should see corruption. The relation once established is eternal, and some more or less definite expectation of that eternity seems inseparable from the consciousness of the relation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But be that as it may, and even taking the widest possible view of the contents of the patriarchal creed, what a rude outline it looks beside ours! Can there be anything in common between us? Can they be in any way a pattern for us? Yes; as I said, faith is one thing, creed is another. Joseph and his ancestors were joined to God by the very same bond which unites us to Him. There has never been but one path of life: ‘They ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "trusted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God and were lightened, and their faces were not ashamed.’ In that Old Covenant the one thing needful was trust in the living Jehovah. In the New, the one thing needful is the very same emotion, directed to the very same Lord, manifested now and incarnate in the divine Son, our Saviour. In this exercise of loving confidence, in which reason and will and affection blend in the highest energy and holiest action, Joseph and we are one. Across the gulf of centuries we clasp hands; and in despite of all superficial differences of culture and civilisation, and all deeper differences in knowledge of God and His loving will, Pharaoh’s prime minister, and the English workman, and the Hindoo ryot, may be alike in what is deepest-the faith which grasps God. How all that mysterious Egyptian life fades away as we think of the fundamental identity of religious emotion then and now! It disguises our brother from us, as it did from the wandering Arabs who came to buy corn, and could not recognise in the swarthy, imperious Egyptian, with strange head-dress and unknown emblems hanging by chains of gold about his neck, the fair boy whom they had sold to the merchants. But beneath it all is the brother’s heart, fed by the same life-blood which feeds ours. He trusts in God, he expects a future because God has promised it, and, therefore, he is separated from those among whom he dwells, and knit to us in this far-off island of the sea, who so many centuries after are partakers of like precious faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And incomplete as his creed was, Joseph may have been a better Christian than some of us, and was so, if what he knew nourished his spiritual life more than what we know nourishes ours, and if his heart and will twined more tenaciously round the fragments of revelation which he possessed, and drew from them more support and strength than we do from the complete Gospel which we have.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren, what makes us Christians is not the theology we have in our heads, but the faith and love we have in our hearts. We must, indeed, have a clear statement of truth in orderly propositions-that is, a system of dogmas-to have anything to trust to at all. There can be no saving faith in an unseen Person, except through the medium of thoughts concerning Him, which thoughts put into words are a creed. The antithesis which is often eagerly urged upon us-not doctrines, but Christ-is a very incomplete and misleading one. ‘Christ’ is a mere name, empty of all significance till it is filled with definite statements of who and what Christ is. But whilst I, for my part, believe that we must have doctrines to make Christ a reality and an object of faith to grasp at all, I would urge all the more earnestly, because I thus believe, that, when we have these doctrines, it is not the creed that saves, but the faith. We are united to Christ, not by the doctrine of His nature and work, needful as that is, but by trusting in Him as that which the doctrine declares Him to be-Redeemer, Friend, Sacrifice, Divine Lover of our souls. Let us always remember that it is not the amount of religious knowledge which I have got, but the amount which I use, that determines my religious position and character. Most of us have in our creeds principles that have no influence upon our moral and active life; and, if so, it matters not one whit how pure, how accurate, how comprehensive, how consistent, how scriptural my conceptions of the Gospel may be. If they are not powers in my soul, they only increase my responsibility and my liability to condemnation. The dry light of the understanding is of no use to anybody. You must turn your creed into a faith before it has power to bless and save.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are hosts of so-called Christians who get no more good out of the most solemn articles of their orthodox belief than if they were heathens. What in the use of your saying that you believe in God the Father Almighty, when there is no child’s love and happy confidence in your heart? What the better are you for believing in Jesus Christ, His divine nature, His death and glory, when you have no reliance on Him, nor any least flutter of trembling love towards Him? Is your belief in the Holy Ghost of the smallest consequence, if you do not yield to His hallowing power? What does it matter that you believe in the forgiveness of sins, so long as you do not care a rush whether yours are pardoned or no? And is it anything to you or to God that you believe in the life everlasting, if all your work, and hopes, and longings are confined to ‘this bank and shoal of time’? Are you any more a Christian because of all that intellectual assent to these solemn verities? Is not your life like some secularised monastic chamber, with holy texts carved on the walls, and saintly images looking down from glowing windows on revellers and hucksters who defile its floor? Your faith, not your creed, determines your religion. Many a ‘true believer’ is a real ‘infidel.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thank God that the soul may be wedded to Christ, even while a very partial conception of Christ is in the understanding. The more complete and adequate the creed, indeed, the mightier and more fruitful in blessing will the faith naturally be; and every portion of the full orb of the Sun of Righteousness which is eclipsed by the shadow of our intellectual misconceptions, will diminish the light and warmth which falls upon our souls. It is no part of our duty to pronounce what is the minimum of a creed which faith needs for its object. For myself, I confess that I do not understand how the spiritual life can be sustained in its freshness and fervour, in its fulness and reality, without a belief in the divinity and saving work of Jesus Christ. But with that belief for the centre which faith grasps, the rest may vary indefinitely. All who stand around that centre, some nearer, some further off, some mazed in errors which others have cast behind them, some of them seeing and understanding more, and some less of Him and of His work-are His. He loves them, and will save them all. Knowledge varies. The faith which unites to God remains the same.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 2. We may gather from this incident another consideration, namely, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Faith has its noblest office in detaching from the present",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " All his life long, from the day of his captivity, Joseph was an Egyptian in outward seeming. He filled his place at Pharaoh’s court, but his dying words open a window into his soul, and betray how little he had felt that he belonged to the order of things in the midst of which he had been content to live. This man, too, surrounded by an ancient civilisation, and dwelling among granite temples and solid pyramids and firm-based sphinxes, the very emblems of eternity, confessed that here he had no continuing city, but sought one to come. As truly as his ancestors who dwelt in tabernacles, like Abraham journeying with his camels and herds, and pitching his tent outside the walls of Hebron, like Isaac in the grassy plains of the South country, like Jacob keeping himself apart from the families of the land, their descendant, an heir with them of the same promise, showed that he too regarded himself as a ‘stranger and a sojourner.’ Dying, he said, ‘Carry my bones up from hence. Therefore we may be sure that, living, the hope of the inheritance must have burned in his heart as a hidden light, and made him an alien everywhere but on its blessed soil.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And faith will always produce just such effects. In exact proportion to its strength, that living trust in God will direct our thoughts and desires to the ‘King in His beauty, and the land that is very far off.’ In proportion as our thoughts and desires are thus directed, they will be averted from what is round about us; and the more longingly our eyes are fixed on the furthest horizon, the less shall we see the flowers at our feet. To behold God pales the otherwise dazzling lustre of created brightness. They whose souls are fed with heavenly manna, and who have learned that it is their necessary food, will scent no dainties in the fleshpots of Egypt, for all their rank garlic and leeks. It is simply a question as to which of two classes of ideas occupies the thoughts, and which of two sets of affections engages the heart. If vulgar brawling and rude merrymakers fill the inn, there will be no room for the pilgrim thoughts which bear the Christ in their bosom, and have angels for their guard; and if these holy wayfarers enter, their serene presence will drive forth the noisy crowd, and turn the place into a temple. Nothing but Christian faith gives to the furthest future the solidity and definiteness which it must have, if it is to be a breakwater for us against the fluctuating sea of present cares and thoughts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If the unseen is ever to rule in men’s lives, it must be through their thoughts. It must become intelligible, clear, real. It must be brought out of the flickering moonlight of fancy and surmises, into the sunlight of certitude and knowledge. Dreams, and hopes, and peradventures are too unsubstantial stuff to be a bulwark against the very real, undeniable present. And such certitude is given through faith which grasps the promises of God, and twines the soul round the risen Saviour so closely that it sits with Him in heavenly places. Such certitude is given by faith alone.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If the unseen is ever to rule in men’s lives, it must become not only an object for certain knowledge, but also for ardent wishes. The vague sense of possible evils lurking in its mysteries must be taken out of the soul, and there must come somehow an assurance that all it wraps in its folds is joy and peace. It must cease to be doubtful, and must seem infinitely desirable. Does anything but Christian faith engage the heart to love, and all the longing wishes to set towards, the things that are unseen and eternal? Where besides, then, can there be found a counterpoise weighty enough to heave up the souls that are laden with the material, and cleaving to the dust? Nowhere. The only possible deliverance from the tyrannous pressure of the trifles amidst which we live is in having the thoughts familiarised with Christ in heaven, which will dwarf all that is on earth, and in having the affections fixed on Him, which will emancipate them from the pains and sorrows that ever wait upon love of the mutable and finite creatures.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us remember that such deliverance from the present is the condition of all noble, joyous, pure life. It needs Christianity to effect it indeed, but it does not need Christianity to see how desirable it is, and how closely connected with whatever is lovely and of good report is this detachment from the near and the visible. A man that is living for remote objects is, in so far, a better man than one who is living for the present. He will become thereby the subject of a mental and moral discipline that will do him good. And, on the other hand, a life which has no far-off light for its guiding star, has none of the unity, of the self-restraint, of the tension, of the conscious power which makes our days noble and strong. Whether he accomplish them or fail, whether they be high or low, the man who lets future objects rule present action is in advance of others. ‘To scorn delights and live laborious days,’ which is the prerogative of the man with a future, is always best. He is rather a beast than a man, who floats lazily on the warm, sunny wavelets as they lift him in their roll, and does not raise his head high enough above them to see and steer for the solid shore where they break. But only he has found the full, controlling, blessing, quickening power that lies in the thought of the future, and in life directed by it, to whom that future is all summed in the name of his Saviour. Whatever makes a man live in the past and in the future raises him; but high above all others stand those to whom the past is an apocalypse of God, with Calvary for its centre, and all the future is fellowship with Christ, and joy in the heavens. Having these hopes, it will be our own faults if we are not pure and gentle, calm in changes and sorrows, armed against frowning dangers, and proof against smiling temptations. They are our armour-’Put on the breastplate of faith . . .and for an helmet the hope of salvation.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " A very sharp test for us all lies in these thoughts. This change of the centre of interest from earth to heaven is the uniform effect of faith. What, then, of us? On Sundays we profess to seek for a city; but what about the week, from Monday morning to Saturday night? What difference does our faith make in the current of our lives? How far are they unlike-I do not mean externally and in occupations, but in principle-the lives of men who ‘have no hope’? Are you living for other objects than theirs? Are you nurturing other hopes in your hearts, as a man may guard a little spark of fire with both his hands, to light him amid the darkness and the howling storm? Do you care to detach yourself from the world? or are you really ‘men of this world, which have their portion in this life,’ even while Christians by profession? A question which I have no right to ask, and no power to answer but for myself; a question which it concerns your souls to ask and to answer very definitely for yourselves. There is no need to preach an exaggerated and impossible abstinence from work and enjoyment in the world where God has put us, or to set up a standard ‘too high for mortal life beneath the sky.’ Whatever call there may have sometimes been to protest against a false asceticism, and withdrawing from active life for the sake of one’s personal salvation, times are changed now. What we want to-day is: ‘Come ye out and be ye separate, and touch not the unclean thing.’ In my conscience I believe that multitudes are having the very heart of the Christian life eaten out by absorption in earthly pursuits and loves, and by the effacing of all distinction in outward life, in occupation, in recreation, in tastes and habits, between people who call themselves Christians, and people who do not care at all whether there is another world or not. There can be but little strength in our faith if it does not compel us to separation. If it has any power to do anything at all, it will certainly do that. If we are naturalised as citizens there, we cannot help being aliens here. ‘Abraham,’ says the New Testament, ‘dwelt in tabernacles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he looked for a city.’ Just so! The tent life will always be the natural one for those who feel that their mother-country is beyond the stars. We should be like the wandering Swiss, who hear in a strange land the rude, old melody that used to echo among the Alpine pastures. The sweet, sad tones kindle home-sickness that will not let them rest. No matter where they are, or what they are doing, no matter what honour they have carved out for themselves with their swords, they throw off the livery of the alien king which they have worn, and turning their backs upon pomp and courts, seek the free air of the mountains, and find home better than a place by a foreign throne. Let us esteem the reproach of Christ greater riches than the treasures of Egypt, and go forth to Him without the camp, for here have we no continuing city.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 3. Again, we have here an instance that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Faith makes men energetic in the duties of the present",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The remarks which I have been making must be completed by that consideration, or they become hurtful and one-sided. You know that common sarcasm, that Christianity degrades this present life by making it merely the portal to a better, and teaches men to think of it as only evil, to be scrambled through anyhow. I confess that I wish the sneer were a less striking contrast to what Christian people really think. But it is almost as gross a caricature of the teaching of Christianity as it is of the practice of Christians.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Take this story of Joseph as giving us a truer view of the effect on present action of faith in, and longing for, God’s future. He was, as I said, a true Hebrew all his days. But that did not make him run away from Pharaoh’s service. He lived by hope, and that made him the better worker in the passing moment, and kept him tugging away all his life at the oar, administering the affairs of a kingdom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Of course it is so. The one thing which saves this life from being contemptible is the thought of another. The more profoundly we feel the reality of the great eternity whither we are being drawn, the greater do all things here become. They are made less in their power to absorb or trouble, but they are made infinitely greater in importance as preparations for what is beyond. When they are first they are small, when they are second they are great. When the mist lifts, and shows the snowy summits of the ‘mountains of God,’ the nearer lower ranges, which we thought the highest, dwindle indeed, but gain in sublimity and meaning by the loftier peaks to which they lead up. Unless men and women live for eternity, they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘merely players,’ and all their busy days ‘like a tale told by an idiot, full of sound and fury, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "signifying nothing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ How absurd, how monotonous, how trivial it all is, all this fret and fume, all these dying joys and only less fleeting pains, all this mill-horse round of work which we pace, unless we are, mill-horse-like, driving a shaft that goes ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "through the wall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and grinds something that falls into ‘bags that wax not old’ on the other side. The true Christian faith teaches us that this world is the workshop where God makes men, and the next, the palace where He shows them. All here is apprenticeship and training. It is of no more value than the attitudes into which gymnasts throw themselves, but as a discipline most precious. The end makes the means important; and if we believe that God is preparing us for immortal life with Him by all our work, then we shall do it with a will: otherwise we may well be languid as we go on for thirty or forty years, some of us, doing the same trivial things, and getting nothing out of them but food, occupation of time, and a mechanical aptitude for doing what is not worth doing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is the horizon that gives dignity to the foreground. A picture without sky has no glory. This present, unless we see gleaming beyond it the eternal calm of the heavens, above the tossing tree-tops with withering leaves, and the smoky chimneys, is a poor thing for our eyes to gaze at, or our hearts to love, or our hands to toil on. But when we see that all paths lead to heaven, and that our eternity is affected by our acts in time, then it is blessed to gaze, it is possible to love, the earthly shadows of the uncreated beauty, it is worth while to work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Remember, too, that faith will energise us for any sort of work, seeing that it raises all to one level and brings all under one sanction, and shows all as cooperating to one end. Look at that muster-roll of heroes of faith in the Epistle to the Hebrews, and mark the variety of grades of human life represented there-statesmen, soldiers, prophets, shepherds, widow women, martyrs-all fitted for their tasks and delivered from the snare that was in their calling, by that faith which raised them above the world, and therefore fitted them to come down on the world with stronger strokes of duty. This is the secret of doing with our might whatsoever our hand finds to do-to trust Christ, to live ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the hope of the inheritance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, brethren, let us see that our clearer revelation bears fruit in a faith in the great divine promises as calm and firm as this dying patriarch had. Then the same power will work not only the same detachment and energy in life, but the same calmness and solemn light of hope in death. It is very beautiful to notice how Joseph dying almost overleaps the thought of death as a very small matter. His brethren who stood by his bedside might well fear what might be the consequences to their people when the powerful protector, the prime minister of the kingdom, was gone. But the dying man has firm hold of God’s promises, and he knows that these will be fulfilled, whether he live or no. ‘I die,’ says he, ‘but God shall surely visit you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not going to die; and though I stand no more before Pharaoh, you will be safe.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus we may contemplate our own going away, or the departure of the dearest from our homes, and of the most powerful for good in human affairs, and in the faith of God’s true promises may feel that no one is indispensable to our well-being or to the world’s good. God’s chariot is self-moving. One after another, who lays his hand upon the ropes, and hauls for a little space, drops out of the ranks. But it will go on, and in His majesty He will ride prosperously.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And for himself, too, the dying man felt that death was a very small matter. ‘Whether I live or die I shall have a share in the promise. Living, perhaps my feet would stand upon its soil; dying, my bones will rest there.’ And we, who know a resurrection, have in it that which makes Joseph’s fond fancy a reality, and reduces the importance of that last enemy to nothing. Some will be alive and remain till the coming of the Lord, some will be laid in the grave till His voice calls them forth, and carries their bones up from hence to the land of the inheritance. But whether we be of generations that fell on sleep looking for the promise of His coming, or whether of the generation that go forth to meet Him when He comes, it matters not. All who have lived by faith will then be gathered at last. The brightest hopes of the present will be forgotten. Then, when we too shall stand in the latter day, wearing the likeness of His glory, and extricated wholly from the bondage of corruption and the dust of death, we, perfected in body, soul, and spirit, shall enter the calm home, where we shall change the solitude of the desert and the transitoriness of the tent and the dangers of the journey, for the society and the stability and the security of the city which hath foundations, whose builder and maker is God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 50:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 50:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And ye shall carry up my bones from hence — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Herein he had an eye to the promise, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and in God’s name assures them of the performance of it. In Egypt they buried their great men very honourably, and with abundance of pomp; but Joseph prefers a plain burial in Canaan, and that deferred almost two hundred years, before a magnificent one in Egypt. Thus Joseph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by faith ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the doctrine of the resurrection, and the promise of Canaan, gave ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "commandment concerning his bones, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He dies in Egypt; but lays his bones at stake, that God will surely visit Israel, and bring them to Canaan.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "50:22-26 Joseph having honoured his father, his days were long in the land, which, for the present, God had given him. When he saw his death approaching, he comforted his brethren with the assurance of their return to Canaan in due time. We must comfort others with the same comforts with which we have been comforted of God, and encourage them to rest on the promises which are our support. For a confession of his own faith, and a confirmation of theirs, he charges them to keep his remains unburied till that glorious day, when they should be settled in the land of promise. Thus Joseph, by faith in the doctrine of the resurrection, and the promise of Canaan, gave commandment concerning his bones. This would keep up their expectation of a speedy departure from Egypt, and keep Canaan continually in their minds. This would also attach Joseph's posterity to their brethren. The death, as well as the life of this eminent saint, was truly excellent; both furnish us with strong encouragement to persevere in the service of God. How happy to set our early in the heavenly race, to continue stedfastly, and to finish the course with joy! This Joseph did, this we also may do. Even when the pains of death are upon us, if we have trusted in Him upon whom the patriarchs, prophets, and apostles depended, we need not fear to say, My flesh and my heart faileth, but God is the strength of my heart, and my portion for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The biography of Joseph is now completed. \"The children of the third generation\" - the grandsons of grandsons in the line of Ephraim. We have here an explicit proof that an interval of about twenty years between the births of the father and that of his first-born was not unusual during the lifetime of Joseph. \"And Joseph took an oath.\" He thus expressed his unwavering confidence in the return of the sons of Israel to the land of promise. \"God will surely visit.\" He was embalmed and put in a coffin, and so kept by his descendants, as was not unusual in Egypt. And on the return of the sons of Israel from Egypt they kept their oath to Joseph ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and buried his bones in Shekem ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sacred writer here takes leave of the chosen family, and closes the bible of the sons of Israel. It is truly a wonderful book. It lifts the veil of mystery that hangs over the present condition of the human race. It records the origin and fall of man, and thus explains the co-existence of moral evil and a moral sense, and the hereditary memory of God and judgment in the soul of man. It records the cause and mode of the confusion of tongues, and thus explains the concomitance of the unity of the race and the specific diversity of mode or form in human speech. It records the call of Abraham, and thus accounts for the preservation of the knowledge of God and his mercy in one section of the human race, and the corruption or loss of it in all the rest. We need scarcely remark that the six days' creation accounts for the present state of nature. It thus solves the fundamental questions of physics, ethics, philology, and theology for the race of Adam. It notes the primitive relation of man to God, and marks the three great stages of human development that came in with Adam, Noah, and Abraham. It points out the three forms of sin that usher in these stages - the fall of Adam, the intermarriage of the sons of God with the daughters of men, and the building of the tower of Babel. It gradually unfolds the purpose and method of grace to the returning penitent through a Deliverer who is successively announced as the seed of the woman, of Shem, of Abraham, Isaac, Jacob, and Judah. This is the second Adam, who, when the covenant of works was about to fall to the ground through the failure of the first Adam, undertook to uphold it by fulfilling all its conditions on behalf of those who are the objects of the divine grace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hence, the Lord establishes his covenant successively with Adam, Noah, and Abraham; with Adam after the fall tacitly, with Noah expressly, and with both generally as the representatives of the race descending from them; with Abraham especially and instrumentally as the channel through which the blessings of salvation might be at length extended to all the families of the earth. So much of this plan of mercy is revealed from time to time to the human race as comports with the progress they have made in the education of the intellectual, moral, and active faculties. This only authentic epitome of primeval history is worthy of the constant study of intelligent and responsible man.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hence, the Lord establishes his covenant successively with Adam, Noah, and Abraham; with Adam after the fall tacitly, with Noah expressly, and with both generally as the representatives of the race descending from them; with Abraham especially and instrumentally as the channel through which the blessings of salvation might be at length extended to all the families of the earth. So much of this plan of mercy is revealed from time to time to the human race as comports with the progress they have made in the education of the intellectual, moral, and active faculties. This only authentic epitome of primeval history is worthy of the constant study of intelligent and responsible man.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24. Joseph said unto his brethren, I die—The national feelings of the Egyptians would have been opposed to his burial in Canaan; but he gave the strongest proof of the strength of his faith and full assurance of the promises, by \"the commandment concerning his bones\" [Heb 11:22].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joseph took an oath, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the same reason which moved Jacob to require an oath from him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 47:30,31",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",31",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "of the children of Israel:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he saith not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of his brethren, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of Israel’s children; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " under which his grandchildren are comprehended, and seem principally intended here; either because his brethren were most of them dead, or rather because he knew that they were not to go out of Egypt in his brethren’s time, but in their second or third generation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My bones, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. my dead body: but he mentions only his bones, because part of his body was corrupted, and the other part, though preserved from corruption by the embalming, yet was so changed and adulterated with the spices, and other materials which they used, that it looked like another thing: only his bones remained entire and unchanged. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Quest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Why did he not desire to be presently carried thither, and buried there, as his father did? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. Lest he should disoblige the Egyptians, and provoke them against his brethren and children. The removal of his father thither was necessary, and forced from him by an oath, but the order for the removal of himself would have been voluntary and designed, and therefore could not have escaped the censure of an ungrateful contempt of the land of Egypt, which as it was thought good enough for him and his to live in, should have been judged so too for his burial. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. That by these his remains his memory might be the longer and better preserved, both with the Egyptians, who for his sake might show kindness to his near relations; and with the Israelites, to whom this was a visible pledge of their deliverance, and a help to their faith, and all obligation to them to persist in the true religion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Joseph took an oath of the children of Israel,.... Not of his brethren only, but of their posterity, as many of them as were now grown up, that so it might be communicated from one to another, and become well known to that generation which should depart out of Egypt: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, God will surely visit you; which he repeats for the certainty of it, and that it might be observed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and ye shall carry up my bones from hence; when they should go from thence to Canaan's land; he did not desire them to carry him thither when he should die, which he knew would give umbrage to the Egyptians, and they would not be so able to obtain leave to do it as he had for his father. This was accordingly done; when Israel went out of Egypt, Moses took the bones of Joseph with him, and they were buried in Shechem; see Exodus 13:19. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and ye shall carry up my bones from hence; when they should go from thence to Canaan's land; he did not desire them to carry him thither when he should die, which he knew would give umbrage to the Egyptians, and they would not be so able to obtain leave to do it as he had for his father. This was accordingly done; when Israel went out of Egypt, Moses took the bones of Joseph with him, and they were buried in Shechem; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Joseph took an oath of the children of Israel, saying, {h} God will surely visit you, and ye shall carry up my bones from hence.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Joseph took an oath of the children of Israel, saying, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " God will surely visit you, and ye shall carry up my bones from hence.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) He speaks this by the spirit of prophecy, exhorting his brethren to have full trust in God's promise for their deliverance.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joseph took an oath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The fulfilment of this oath and Joseph’s burial at Shechem, in the land of Ephraim, are duly recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For these dying words of Joseph, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “by faith Joseph, when his end was nigh, made mention of the departure of the children of Israel; and gave commandment concerning his bones.” As Jacob, his father, had done, Joseph forewarns his kindred that the day of the Exodus would come.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 50:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Joseph saw his death approaching, he expressed to his brethren his firm belief in the fulfilment of the divine promise (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), and made them take an oath, that if God should bring them into the promised land, they would carry his bones with them from Egypt. This last desire of his was carried out. When he died, they embalmed him, and laid him (ויּישׂם from ישׂם, like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the chethib) \"in the coffin,\" i.e., the ordinary coffin, constructed of sycamore-wood (see Hengstenberg, pp. 71, 72), which was then deposited in a room, according to Egyptian custom (Herod. 2, 86), and remained in Egypt for 360 years, until they carried it away with them at the time of the exodus, when it was eventually buried in Shechem, in the piece of land which had been bought by Jacob there (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 33:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus the account of the pilgrim-life of the patriarchs terminates with an act of faith on the part of the dying Joseph; and after his death, in consequence of his instructions, the coffin with his bones became a standing exhortation to Israel, to turn its eyes away from Egypt to Canaan, the land promised to its fathers, and to wait in the patience of faith for the fulfilment of the promise.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Chronological Survey of the Leading Eventsof the Patriarchal History",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Arranged according to the Hebrew Text, as a continuation of the Chronological Tables at p. 77, with an additional calculation of the year before Christ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Events Year of Migration to Egypt Year of Entrance into Canaan Year from the Creation Year Before Christ  Abram's entrance into Canaan  1 2021 2137  Birth of Ishmael  11 2032 2126  Institution of Circumcision  24 2045 2113  Birth of Isaac  25 2046 2112  Death of Sarah  62 2083 2075  Marriage of Isaac  65 2086 2072  Birth of Esau and Jacob  85 2106 2052  Death of Abraham  100 2121 2037  Marriage of Esau  125 2146 2012  Death of Ishmael  148 2169 1989  Flight of Jacob to Padan Aram  162 2183 1975  Jacob's Marriage  169 2190 1968  Birth of Joseph  176 2197 1961  Jacob's return from Padan Aram  182 2203 1951  Jacob's arrival at Shechem in Canaan  ? 187 ? 2208 ? 1950  Jacob's return home to Hebron  192 2213 1945  Sale of Joseph  193 2214 1944  Death of Isaac  205 2226 1932  Promotion of Joseph in Egypt  206 2227 1931  Removal of Israel to Egypt 1 215 2236 1922  Death of Jacob 17 232 2253 1905  Death of Joseph 71 286 2307 1851  Birth of Moses 350 565 2586 1572  Exodus of Israel from Egypt 430 645 2666 1492  ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The calculation of the years b.c. is based upon the fact, that the termination of the 70 years' captivity coincided with the first year of the sole government of Cyrus, and fell in the year 536 b.c.; consequently the captivity commenced in the year 606 B. C.",
        "children": []
      }
    ]
  }
]