[{"header":"Samson’s Marriage"},{"num":14,"verse":"A while later, Samson went down to Timnah and observed a woman in Timnah who was of Philistine origin. "},{"num":2,"verse":"Then he returned and told his father and mother, “In Timnah I saw a woman of Philistine origin.” He ordered them, “Get her for me as a wife. Now!”"},{"num":3,"verse":"His father and mother asked him, “Isn’t there a woman suitable among the daughters of your relatives or among all of our people, since you’re going to get your wife from the uncircumcised Philistines?”"},{"num":4,"verse":"Meanwhile, his father and mother did not know that she was from the Lord, because he had been seeking a favorable opportunity concerning the Philistines, since the Philistines were dominating Israel at that time."},{"num":5,"verse":"Then Samson went down in the direction of Timnah with his father and mother and arrived as far as the vineyards of Timnah. And—surprise!—a young lion came roaring at him! "},{"num":6,"verse":"The Spirit of the Lord rushed upon him, and he ripped the lion apart as one might dissect a young goat, even though he carried nothing in his hand. But he didn’t tell his father and mother what he had done. "},{"num":7,"verse":"Then he went down and talked to the woman, and she looked fine to Samson. "},{"num":8,"verse":"When he came back later to marry her, he turned aside to observe the lion’s carcass. Amazingly, there was a swarm of bees in the body of the lion, complete with honey. "},{"num":9,"verse":"So he scraped some out into his hands and went on his way, eating all the while. When he met his father and mother, he gave some to them, and they ate it, too. But he didn’t inform them that he had scraped the honey from the carcass of the lion."},{"header":"Samson’s Riddle"},{"num":10,"verse":"Later on, when his father went down to visit the woman, Samson threw a party there, since young men customarily did this. "},{"num":11,"verse":"When they saw him, they brought 30 companions to accompany him. "},{"num":12,"verse":"“Let me tell you a riddle,” Samson told them. “If you can solve it during this week-long festival, I’ll give you 30 linen garments and 30 formal garments. "},{"num":13,"verse":"But if you don’t solve it, then you’ll give me 30 linen garments and 30 formal garments.”"},{"num":14,"verse":"So he told them:"},{"num":15,"verse":"The next day, they told Samson’s wife, “Coax your husband to explain the riddle or we’ll set fire to your father’s house—with you in it! You’ve invited us here to make us paupers, haven’t you?”"},{"num":16,"verse":"So Samson’s wife cried in front of him and accused him, “You only hate me. You don’t love me. You’ve told a riddle to my relatives, but you haven’t told the solution to me.”"},{"num":17,"verse":"So she kept on crying in front of him for the entire seven days of the wedding party. On the seventh day he told the solution to her because she nagged him, and then she told the solution to the riddle to her relatives."},{"num":18,"verse":"Then the men of the city answered him just before sunset on the seventh day:"},{"num":19,"verse":"Then the Spirit of the Lord rushed upon him, and he went down to Ashkelon, killed 30 men, took their belongings, and gave the garments to those who had told him the solution to the riddle. He remained furious, left for his father’s house, "},{"num":20,"verse":"and Samson’s wife went to the best man at his wedding."}]