[{"header":"Samson’s Marriage"},{"num":14,"verse":"Then Samson went down to Timnah, and he saw a woman in Timnah, one of the daughters of the Philistines."},{"num":2,"verse":"So he came back and told his father and mother, “I saw a woman in Timnah, one of the daughters of the Philistines; so now, get her for me as a wife.”"},{"num":3,"verse":"But his father and his mother said to him, “Is there no woman among the daughters of your relatives, or among all our people, that you go to take a wife from the uncircumcised Philistines?” Yet Samson said to his father, “Get her for me, because she is right for me.”"},{"num":4,"verse":"However, his father and mother did not know that this was of the Lord, for He was seeking an occasion against the Philistines. And at that time the Philistines were ruling over Israel."},{"num":5,"verse":"Then Samson went down to Timnah with his father and mother, and came as far as the vineyards of Timnah; and behold, a young lion came roaring toward him."},{"num":6,"verse":"And the Spirit of the Lord rushed upon him, so that he tore it apart as one tears apart a young goat, though he had nothing in his hand; but he did not tell his father or mother what he had done."},{"num":7,"verse":"So he went down and talked to the woman; and she looked pleasing to Samson."},{"num":8,"verse":"When he returned later to take her, he turned aside to look at the carcass of the lion; and behold, a swarm of bees and honey were in the body of the lion."},{"num":9,"verse":"So he took out the honey on his hands and went on, eating as he went. When he came to his father and mother, he gave some to them and they ate it; but he did not tell them that he had took the honey out of the body of the lion."},{"num":10,"verse":"Then his father went down to the woman; and Samson held a feast there, for the young men customarily did this."},{"num":11,"verse":"When they saw him, they brought thirty companions to be with him."},{"header":"Samson’s Riddle"},{"num":12,"verse":"Then Samson said to them, “Let me now propose a riddle for you; if you actually tell me the answer within the seven days of the feast, and solve it, then I will give you thirty linen wraps and thirty outfits of clothes."},{"num":13,"verse":"But if you are unable to tell me, then you shall give me thirty linen wraps and thirty outfits of clothes.” And they said to him, “Propose your riddle, so that we may hear it.”"},{"num":14,"verse":"So he said to them,"},{"num":15,"verse":"Then it came about on the fourth day that they said to Samson’s wife, “Entice your husband, so that he will tell us the riddle, or we will burn you and your father’s house with fire. Have you invited us to impoverish us? Is this not so?”"},{"num":16,"verse":"So Samson’s wife wept in front of him and said, “You only hate me, and you do not love me; you have proposed a riddle to the sons of my people, and have not told it to me.” And he said to her, “Behold, I have not told it to my father or mother; so should I tell you?”"},{"num":17,"verse":"However she wept before him for seven days while their feast lasted. And on the seventh day he told her because she pressed him so hard. She then told the riddle to the sons of her people."},{"num":18,"verse":"So the men of the city said to him on the seventh day before the sun went down,"},{"num":19,"verse":"Then the Spirit of the Lord rushed upon him, and he went down to Ashkelon and killed thirty men of them and took what they were wearing and gave the outfits of clothes to those who told the riddle. And his anger burned, and he went up to his father’s house."},{"num":20,"verse":"But Samson’s wife was given to his companion who had been his friend."}]