[{"header":"Samson’s First Marriage"},{"num":14,"verse":"Samson went down to the city of Timnah where he saw a Philistine woman. "},{"num":2,"verse":"When he returned home, he said to his father and mother, “I saw a Philistine woman in Timnah. I want you to get her for me so I can marry her.”"},{"num":3,"verse":"His father and mother answered, “Surely there is a woman from Israel you can marry. Do you have to marry a woman from the Philistines, who are not circumcised?”"},{"num":4,"verse":"(Samson’s parents did not know that the Lord wanted this to happen because he was looking for a way to challenge the Philistines, who were ruling over Israel at this time.) "},{"num":5,"verse":"Samson went down with his father and mother to Timnah, as far as the vineyard near there. Suddenly, a young lion came roaring toward Samson! "},{"num":6,"verse":"The Spirit of the Lord entered Samson with great power, and he tore the lion apart with his bare hands. For him it was as easy as tearing apart a young goat. But Samson did not tell his father or mother what he had done. "},{"num":7,"verse":"Then he went down to the city and talked to the Philistine woman, and he liked her."},{"num":8,"verse":"Several days later Samson went back to marry her. On his way he went over to look at the body of the dead lion and found a swarm of bees and honey in it. "},{"num":9,"verse":"Samson got some of the honey with his hands and walked along eating it. When he came to his parents, he gave some to them. They ate it, too, but Samson did not tell them he had taken the honey from the body of the dead lion."},{"num":10,"verse":"Samson’s father went down to see the Philistine woman. And Samson gave a feast, as was the custom for the bridegroom. "},{"num":11,"verse":"When the people saw him, they sent thirty friends to be with him."},{"header":"Samson’s Riddle"},{"num":12,"verse":"Samson said to them, “Let me tell you a riddle. Try to find the answer during the seven days of the feast. If you can, I will give you thirty linen shirts and thirty changes of clothes. "},{"num":13,"verse":"But if you can’t, you must give me thirty linen shirts and thirty changes of clothes.”"},{"num":14,"verse":"Samson said,"},{"num":15,"verse":"On the fourth day they said to Samson’s wife, “Did you invite us here to make us poor? Trick your husband into telling us the answer to the riddle. If you don’t, we will burn you and everyone in your father’s house.”"},{"num":16,"verse":"So Samson’s wife went to him, crying, and said, “You hate me! You don’t really love me! You told my people a riddle, but you won’t tell me the answer.”"},{"num":17,"verse":"Samson’s wife cried for the rest of the seven days of the feast. So he finally gave her the answer on the seventh day, because she kept bothering him. Then she told her people the answer to the riddle."},{"num":18,"verse":"Before sunset on the seventh day of the feast, the Philistine men had the answer. They came to Samson and said,"},{"num":19,"verse":"Then the Spirit of the Lord entered Samson and gave him great power. Samson went down to the city of Ashkelon and killed thirty of its men and took all that they had and gave the clothes to the men who had answered his riddle. Then he went to his father’s house very angry. "},{"num":20,"verse":"And Samson’s wife was given to his best man."}]