[{"num":7,"verse":"Woe to me, for I am made as he that gathereth in harvest (the) raisins of (the) grapes; there is no cluster for to eat; my soul desired (the) figs ripe before (the) others."},{"num":2,"verse":"The holy (man) perished from [the] earth, and (a) rightful (man) is not in men; all ambush, either set treason, in blood; a man hunteth his brother to death. (The holy people have perished from the earth, and there is no one upright among the people; all ambush, or set treason, for blood; everyone hunteth his brother, or his kinsman, unto the death.)"},{"num":3,"verse":"The evil of their hands they say good; the prince asketh, and the doomsman is in yielding; and a great man spake the desire of his soul, and they troubled together it. (They say that the evil of their hands is good; the leader, or the ruler, and the judge, ask for gifts, or bribes; the great man spoke of the evil desire of his heart, and he got it; yea, they all make trouble together.)"},{"num":4,"verse":"He that is the best in them, is as a paliurus, that is, a teasel, either a sharp bush; and he that is rightful is as a thorn of hedge. The day of thy beholding, thy visiting cometh, now shall be destroying of them. (He who is the best in them, is like a paliurus, that is, a teasel, or a sharp bush; and he who is upright is like a thorn on a hedge. The day of thy beholding, and of thy punishment, cometh, yea, now shall be their destruction.)"},{"num":5,"verse":"Do not ye believe to a friend, and do not ye trust in a duke; from her that sleepeth in thy bosom, keep thou the closings of thy mouth. (Do not ye believe a friend, and do not ye trust in a leader; and keep thou the private, or the secret, words of thy mouth, from her who sleepeth in thy bosom.)"},{"num":6,"verse":"For the son doeth wrong to the father, and the daughter shall rise (up) against her mother, and the wife of the son against the mother of her husband; the enemies of a man be the (ones) at home, either the household members, of him (a man’s enemies be those who be at home with him, or the members of his own household)."},{"num":7,"verse":"Forsooth I shall behold to the Lord, I shall abide God my saviour; the Lord my God shall hear me. (But I shall look to the Lord, I shall wait for God my Saviour; and the Lord my God shall hear me.)"},{"num":8,"verse":"Thou, mine enemy, be not glad on me (do not be happy over me), for I fell down, (for) I shall rise (up again); (and) when I sit in darknesses, the Lord is my light."},{"num":9,"verse":"I shall bear wrath of the Lord, for I have sinned to him, till he deem my cause, and make my doom; he shall lead out me into light, I shall see [the] rightwiseness of him. (I shall bear the anger of the Lord, for I have sinned against him, until he judge my case, and declare my sentence; and then he shall lead me out into the light, and I shall see his righteousness.)"},{"num":10,"verse":"And mine enemy shall behold me, and she shall be covered with confusion, which saith to me, Where is thy Lord God? Mine eyes shall see her, now she shall be into defouling, as clay, either fen, of streets. (And then my enemies shall see me, and shall be covered with shame, they who say to me, Where is the Lord thy God? My eyes shall see them, and they shall be defiled, like the clay, or the mud, in the streets.)"},{"num":11,"verse":"Day shall come, that thy walls be builded; in that day law shall be made afar. (The day shall come, when thy walls shall be rebuilt; on that day, thy borders shall be enlarged.)"},{"num":12,"verse":"In that day, and Assur shall come till to thee, and till to strong cities, and from strong cities till to [the] flood; and to sea from sea, and to hill from hill. (On that day, they shall come to thee from Assyria, and from the fortified cities, yea, from the fortified cities unto the Euphrates River; and from every sea, and from every hill, or from every mountain.)"},{"num":13,"verse":"And [the] earth shall be into desolation for her dwellers, and for fruit of the thoughts of them. (And the earth shall be made into desolation, or into a wasteland, because of what her inhabitants did; yea, this shall be the fruit of their deeds.)"},{"num":14,"verse":"Feed thou thy people in thy rod, the flock of thine heritage, that dwell alone in [the] wild wood; in the middle of Carmel they shall be fed of Bashan and of Gilead, (as) by eld days, (Feed thou thy people with thy rod, yea, the flock of thy inheritance, who live alone in the wild wood, and in the midst of the fertile land; they shall be fed in Bashan and in Gilead, like in the old days.)"},{"num":15,"verse":"by days of thy going out of the land of Egypt. I shall show to him wonderful things; (Make thou for us miracles, or wonders, like in the days of our going out of the land of Egypt;/I shall show thee miracles, or wonders, like in the days of thy going out of the land of Egypt;)"},{"num":16,"verse":"heathen men shall see, and they shall be confounded on all their strength; they shall put hands on their mouth, the ears of them shall be deaf; (the heathen shall see, and they shall be confounded in spite of all their strength; they shall put their hands upon their mouths, and their ears shall be deaf;)"},{"num":17,"verse":"they shall lick dust as a serpent; as creeping things of [the] earth they shall be disturbed, or troubled, (out) of their houses; they shall not desire our Lord God, and they shall dread thee. (they shall lick the dust like serpents, or snakes, yea, like creeping things upon the earth; they shall be distressed, and shall come out of their strongholds; and they shall come to thee, O Lord our God, and they shall fear thee.)"},{"num":18,"verse":"God, who is like thee, that doest away wickedness, and bearest over the sin of the remnants of thine heritage? He shall no more send in his strong vengeance, for he is willing mercy; (God, who is like thee, who doest away wickedness, and passest over the sins of the remnants of thy inheritance? He shall no more send in his strong vengeance, for he delighteth in mercy;)"},{"num":19,"verse":"he shall turn again, and have mercy on us. He shall put down our wickednesses, and shall cast far into deepness of the sea all our sins. (he shall return, and have mercy upon us. He shall put down our wickednesses, and shall throw down all our sins into the depths of the sea.)"},{"num":20,"verse":"Thou shalt give truth to Jacob, mercy to Abraham, which thou sworest to our fathers from eld days. (Thou shalt give truth to Jacob, and mercy, or love, to Abraham, as thou sworest to our forefathers in the old days.)"}]