[{"header":"The Birth of Samson"},{"num":13,"verse":"Again the children of Israel did evil in the sight of the Lord, so the Lord gave them into the hands of the Philistines for forty years."},{"num":2,"verse":"There was a certain man from Zorah, from the tribe of Dan. His name was Manoah. His wife was infertile and had borne no children. "},{"num":3,"verse":"The angel of the Lord appeared to the woman and said to her, “Indeed, you are infertile and have borne no children, yet you will conceive and bear a son. "},{"num":4,"verse":"Now be careful, I pray, that you drink no wine or strong drink and that you do not eat anything ritually unclean. "},{"num":5,"verse":"For you will conceive and bear a son. No razor may touch his head, for the boy will be a Nazirite to God from the womb. He will begin to save Israel from the hand of the Philistines.”"},{"num":6,"verse":"Then the woman went to her husband and said, “A man of God came to me. He looked like a very fearsome angel of God. I did not ask him where he was from, and he did not tell me his name. "},{"num":7,"verse":"He said to me, ‘You will conceive and bear a son. So now, do not drink wine or strong drink, and do not eat anything ritually unclean, for the boy will be a Nazirite to God from the womb until the day he dies.’ ”"},{"num":8,"verse":"Then Manoah prayed to the Lord, “O my Lord, let the man of God whom You sent come again to us, so that he can teach us what we should do for the boy who will be born.”"},{"num":9,"verse":"God listened to the voice of Manoah, and the angel of God came again to the woman. She was sitting in the field; but her husband Manoah was not with her. "},{"num":10,"verse":"The woman hurried and ran to tell her husband, “The man who came to me the other day has appeared to me.”"},{"num":11,"verse":"So Manoah got up and went after his wife. He came to the man and said to him, “Are you the man who spoke to my wife?”"},{"num":12,"verse":"Then Manoah said, “Now may your words come true! What will be the boy’s way of life and his work?”"},{"num":13,"verse":"The angel of the Lord said to Manoah, “Your wife must observe everything that I said to her. "},{"num":14,"verse":"She must not consume anything that grows on the vine. She must not drink wine or strong drink, and she must not eat anything ritually unclean. She must observe everything that I commanded her.”"},{"num":15,"verse":"Manoah said to the angel of the Lord, “Please let us detain you, and let us prepare a young goat for you.”"},{"num":16,"verse":"The angel of the Lord said to Manoah, “If I stay, I will not eat your food, but if you want to make an offering to the Lord, you should offer it.” (For Manoah did not know that he was an angel of the Lord.)"},{"num":17,"verse":"Manoah said to the angel of the Lord, “What is your name, so that we can honor you when your words come true?”"},{"num":18,"verse":"The angel of the Lord said to him, “Why do you ask my name? It is too wonderful.” "},{"num":19,"verse":"Manoah took the young goat and the grain offering and offered them to the Lord upon a rock. Then he did a wondrous thing while Manoah and his wife watched. "},{"num":20,"verse":"When the flame went up from the altar toward the heavens, the angel of the Lord went up in the flames from the altar. Seeing this, Manoah and his wife fell face down on the ground. "},{"num":21,"verse":"The angel of the Lord did not appear again to Manoah and his wife. Then Manoah knew that he was an angel of the Lord."},{"num":22,"verse":"Manoah said to his wife, “We are certainly going to die, for we have seen God.”"},{"num":23,"verse":"Yet his wife said to him, “If the Lord wanted to kill us, He would not have taken the burnt offering and grain offering from us. He would not have shown us these things, nor let us hear things such as these at this time.”"},{"num":24,"verse":"So the woman bore a son, and she called him Samson. The boy grew, and the Lord blessed him. "},{"num":25,"verse":"The Spirit of the Lord began to move upon him at Mahaneh Dan, between Zorah and Eshtaol."}]