[{"header":"Hoshea Son of Elah, the Last King of Israel"},{"num":17,"verse":"In the twelfth year of Ahaz king of Judah, Hoshea son of Elah became king over Israel in Samaria and ruled for nine years. "},{"num":2,"verse":"He did evil in the eyes of the Lord, but not like the kings of Israel who came before him."},{"num":3,"verse":"Shalmaneser king of Assyria went up against him, and Hoshea became his vassal and paid tribute to him. "},{"num":4,"verse":"But the king of Assyria caught Hoshea in a conspiracy. He had sent messengers to So king of Egypt, and he did not send tribute to the king of Assyria as he had done in previous years. That is why the king of Assyria arrested him and confined him in prison."},{"num":5,"verse":"Then the king of Assyria invaded the whole land. He went up against Samaria and laid siege to it for three years. "},{"num":6,"verse":"In Hoshea’s ninth year, the king of Assyria captured Samaria and exiled Israel to Assyria. He made them live in Halah and along the Habur River, which is the river of Gozan, and in the cities of the Medes."},{"num":7,"verse":"This happened because the people of Israel sinned against the Lord their God, who had brought them up from the land of Egypt, from under the hand of Pharaoh king of Egypt, and they feared other gods. "},{"num":8,"verse":"They walked in the practices of the nations, whom the Lord had driven out before the people of Israel, and the practices which the kings of Israel had introduced. "},{"num":9,"verse":"The people of Israel did secret things against the Lord their God, which were not right. They also built high places for themselves in all their cities, from watchtower to fortified city. "},{"num":10,"verse":"They set up sacred memorial stones and Asherah poles for themselves upon every high hill and under every leafy tree. "},{"num":11,"verse":"They offered sacrifices at all the high places, like the nations that God drove out before them. They did evil things, provoking the Lord to anger. "},{"num":12,"verse":"They served filthy idols even though the Lord had said to them, “You must not do this.”"},{"num":13,"verse":"The Lord had warned Israel and Judah through all his prophets and seers, saying, “Turn back from your evil ways and keep my commands and my regulations, according to the entire law which I commanded your fathers and which I sent to you through my servants the prophets.” "},{"num":14,"verse":"But they did not listen. They made their necks just as stiff as their fathers, who did not trust in the Lord their God."},{"num":15,"verse":"They rejected his regulations and the covenant which he made with their fathers and the testimony with which he warned them. They followed useless idols, and they became useless themselves. They followed the other nations around them, about whom the Lord had commanded them, “Do not do as they do.” "},{"num":16,"verse":"They deserted all the commands of the Lord their God, and they made for themselves cast metal images, two calves. They made Asherah poles, and they bowed down to the whole army of the heavens, and they served Baal. "},{"num":17,"verse":"They made their sons and daughters pass through the fire. They engaged in divination and sought omens and sold themselves to do evil in the eyes of the Lord, provoking him to anger. "},{"num":18,"verse":"So the Lord was furious with Israel, and he removed them from his presence. None was left—only the tribe of Judah."},{"num":19,"verse":"Even Judah did not keep the commands of the Lord their God. They walked in the practices which Israel introduced. "},{"num":20,"verse":"So the Lord rejected all the seed of Israel, and he afflicted them. He gave them into the hand of plunderers until he cast them out of his presence."},{"num":21,"verse":"When the Lord tore Israel away from the house of David, they made Jeroboam son of Nebat king. But Jeroboam drove Israel away from following the Lord. He caused them to commit a great sin. "},{"num":22,"verse":"The people of Israel walked in all the sins which Jeroboam did. They did not turn from them "},{"num":23,"verse":"until the Lord removed Israel from his presence, just as he had said through all his servants the prophets. So Israel went to Assyria, into exile from her homeland to this day."},{"header":"New Settlers in Israel"},{"num":24,"verse":"The king of Assyria brought people from Babylon, Kuthah, Avva, Hamath, and Sepharvaim, and he settled them in the cities of Samaria in the place of the people of Israel. They took possession of Samaria and lived in its cities. "},{"num":25,"verse":"When they began to settle there, they did not fear the Lord, so the Lord sent lions among them. The lions were killing people, "},{"num":26,"verse":"so they said to the king of Assyria, “The peoples whom you deported and settled in the cities of Samaria do not know the customs of the god of the land. That is why he has sent lions among them, and the lions are killing people, because there aren’t any people left who know the customs of the god of the land.”"},{"num":27,"verse":"So the king of Assyria commanded, “Get one of the priests who was exiled from there. He will go and live there and teach the customs of the god of the land.” "},{"num":28,"verse":"So one of the priests who had been exiled from Samaria came and lived in Bethel. He was teaching them how they should fear the Lord."},{"num":29,"verse":"But each nation was still making its own gods and setting them in the shrines of the high places which the Samaritans had made, each nation in their cities where they were dwelling. "},{"num":30,"verse":"The people from Babylon made Sukkoth Benoth. The people from Kuth made Nergal. The people from Hamath made Ashima. "},{"num":31,"verse":"The people from Avvah made Nibhaz and Tartak. The people from Sepharvaim were burning their sons in the fire to Adrammelek and Anammelek, the gods of Sepharvaim. "},{"num":32,"verse":"They were fearing the Lord, but they were making priests for their high places from all kinds of people, who were serving them in the shrines on the high places. "},{"num":33,"verse":"They were fearing the Lord, but they were also serving their gods according to the customs of the nations from which they had been deported."},{"num":34,"verse":"To this day they are acting according to their former customs. There are none of them who fear the Lord, and there is no one who acts according to the regulations, ordinances, law, and commands which the Lord had commanded the children of Jacob, to whom he gave the name Israel. "},{"num":35,"verse":"The Lord had made a covenant with them and commanded them, “Do not fear other gods. Do not bow down to them. Do not serve them. Do not sacrifice to them. "},{"num":36,"verse":"Rather fear the Lord, who brought you up out of the land of Egypt with great power and an outstretched arm. Fear him and bow down to him and offer sacrifices to him. "},{"num":37,"verse":"Keep the regulations, ordinances, law, and commands, which he wrote for you, and do not fear other gods. "},{"num":38,"verse":"Do not forget the covenant I made with you, and do not fear other gods. "},{"num":39,"verse":"Fear only the Lord your God. He is the one who will save you from the hand of all your enemies.”"},{"num":40,"verse":"But these nations did not listen. Instead, they acted according to their former customs. "},{"num":41,"verse":"These nations were fearing the Lord, and they were serving their idols. Their children and their grandchildren did just as their fathers had done. They are doing this up to this day."}]