[{"header":"Hoshea, Last King of Israel"},{"num":17,"verse":"Hoshea son of Elah became king over Israel during Ahaz’s twelfth year as king of Judah. Hoshea ruled in Samaria nine years. "},{"num":2,"verse":"He did what the Lord said was wrong, but he was not as bad as the kings of Israel who had ruled before him."},{"num":3,"verse":"Shalmaneser king of Assyria came to attack Hoshea. Hoshea had been Shalmaneser’s servant and had made the payments to Shalmaneser that he had demanded. "},{"num":4,"verse":"But the king of Assyria found out that Hoshea had made plans against him by sending messengers to So, the king of Egypt. Hoshea had also stopped giving Shalmaneser the payments, which he had paid every year in the past. For that, the king put Hoshea in prison. "},{"num":5,"verse":"Then the king of Assyria came and attacked all the land of Israel. He surrounded Samaria and attacked it for three years. "},{"num":6,"verse":"He defeated Samaria in the ninth year Hoshea was king, and he took the Israelites away to Assyria. He settled them in Halah, in Gozan on the Habor River, and in the cities of the Medes."},{"header":"Israelites Punished for Sin"},{"num":7,"verse":"All these things happened because the Israelites had sinned against the Lord their God. He had brought them out of Egypt and had rescued them from the power of the king of Egypt, but the Israelites had honored other gods. "},{"num":8,"verse":"They lived like the nations the Lord had forced out of the land ahead of them. They lived as their evil kings had shown them, "},{"num":9,"verse":"secretly sinning against the Lord their God. They built places to worship gods in all their cities, from the watchtower to the strong, walled city. "},{"num":10,"verse":"They put up stone pillars to gods and Asherah idols on every high hill and under every green tree. "},{"num":11,"verse":"The Israelites burned incense everywhere gods were worshiped, just as the nations who lived there before them had done, whom the Lord had forced out of the land. The Israelites did wicked things that made the Lord angry. "},{"num":12,"verse":"They served idols when the Lord had said, “You must not do this.” "},{"num":13,"verse":"The Lord used every prophet and seer to warn Israel and Judah. He said, “Stop your evil ways and obey my commands and laws. Follow all the teachings that I commanded your ancestors, the teachings that I gave you through my servants the prophets.”"},{"num":14,"verse":"But the people would not listen. They were stubborn, just as their ancestors had been who did not believe in the Lord their God. "},{"num":15,"verse":"They rejected the Lord’s laws and the agreement he had made with their ancestors. And they refused to listen to his warnings. They worshiped useless idols and became useless themselves. They did what the nations around them did, which the Lord had warned them not to do."},{"num":16,"verse":"The people rejected all the commands of the Lord their God. They molded statues of two calves, and they made an Asherah idol. They worshiped all the stars of the sky and served Baal. "},{"num":17,"verse":"They made their sons and daughters pass through fire and tried to find out the future by magic and witchcraft. They always chose to do what the Lord said was wrong, which made him angry. "},{"num":18,"verse":"Because he was very angry with the people of Israel, he removed them from his presence. Only the tribe of Judah was left."},{"header":"Judah Is Also Guilty"},{"num":19,"verse":"But even Judah did not obey the commands of the Lord their God. They did what the Israelites had done, "},{"num":20,"verse":"so the Lord rejected all the people of Israel. He punished them and let others destroy them; he threw them out of his presence. "},{"num":21,"verse":"When the Lord separated them from the family of David, the Israelites made Jeroboam son of Nebat their king. Jeroboam led the Israelites away from the Lord and led them to sin greatly. "},{"num":22,"verse":"So they continued to do all the sins Jeroboam did. They did not stop doing these sins "},{"num":23,"verse":"until the Lord removed the Israelites from his presence, just as he had said through all his servants the prophets. So the Israelites were taken out of their land to Assyria, and they have been there to this day."},{"header":"The Beginning of the Samaritan People"},{"num":24,"verse":"The king of Assyria brought people from Babylon, Cuthah, Avva, Hamath, and Sepharvaim and put them in the cities of Samaria to replace the Israelites. These people took over Samaria and lived in the cities. "},{"num":25,"verse":"At first they did not worship the Lord, so he sent lions among them which killed some of them. "},{"num":26,"verse":"The king of Assyria was told, “You sent foreigners into the cities of Samaria who do not know the law of the god of the land. This is why he has sent lions among them. The lions are killing them because they don’t know what the god wants.”"},{"num":27,"verse":"Then the king of Assyria commanded, “Send back one of the priests you took away. Let him live there and teach the people what the god wants.” "},{"num":28,"verse":"So one of the priests who had been carried away from Samaria returned to live in Bethel. And he taught the people how to honor the Lord."},{"num":29,"verse":"But each nation made gods of its own and put them in the cities where they lived and in the temples where gods were worshiped. These temples had been built by the Samaritans. "},{"num":30,"verse":"The people from Babylon made Succoth Benoth their god. The people from Cuthah worshiped Nergal. The people of Hamath worshiped Ashima. "},{"num":31,"verse":"The Avvites worshiped Nibhaz and Tartak. The Sepharvites burned their children in the fire, sacrificing them to Adrammelech and Anammelech, the gods of Sepharvaim. "},{"num":32,"verse":"They also honored the Lord, but they chose priests for the places where gods were worshiped. The priests were chosen from among themselves, and they made sacrifices for the people. "},{"num":33,"verse":"The people honored the Lord but also served their own gods, just as the nations did from which they had been brought. "},{"num":34,"verse":"Even today they do as they did in the past. They do not worship the Lord nor obey his rules and commands. They do not obey the teachings or the commands of the Lord, which he gave to the children of Jacob, whom he had named Israel. "},{"num":35,"verse":"The Lord had made an agreement with them and had commanded them, “Do not honor other gods. Do not bow down to them or worship them or offer sacrifices to them. "},{"num":36,"verse":"Worship the Lord who brought you up out of the land of Egypt with great power and strength. Bow down to him and offer sacrifices to him. "},{"num":37,"verse":"Always obey the rules, orders, teachings, and commands he wrote for you. Do not honor other gods. "},{"num":38,"verse":"Do not forget the agreement I made with you, and do not honor other gods. "},{"num":39,"verse":"Instead worship the Lord your God, who will save you from all your enemies.”"},{"num":40,"verse":"But the Israelites did not listen. They kept on doing the same things they had done before. "},{"num":41,"verse":"So these nations honored the Lord but also worshiped their idols, and their children and grandchildren still do as their ancestors did."}]