[{"num":17,"verse":"In the twelfth year of Achaz Melech Yehudah began Hoshea Ben Elah to reign as melech in Shomron over Yisroel nine shanim."},{"num":2,"verse":"And he did that which was rah in the eyes of Hashem, but not as the malkhei Yisroel that were before him."},{"num":3,"verse":"Against him came up Shalmaneser Melech Ashur; and Hoshea became his eved (vassal) and paid him minchah (tribute)."},{"num":4,"verse":"And Melech Ashur found kesher in Hoshea; for he had sent malachim to So Melech Mitzrayim, and paid no minchah to Melech Ashur, as he had done shanah b’shanah; therefore Melech Ashur took him in custody, and bound him in the bais keleh."},{"num":5,"verse":"Then Melech Ashur came up throughout kol HaAretz, and went up to Shomron, and besieged it shalosh shanim."},{"num":6,"verse":"In the ninth year [722 B.C.E.] of Hoshea, Melech Ashur took Shomron, and carried Yisroel away to Ashur, and placed them in Chalach and in Chavor by the river Gozan, and in the cities of the Medes."},{"num":7,"verse":"For so it was, that the Bnei Yisroel had sinned against Hashem Eloheihem Who had brought them up out of Eretz Mitzrayim, from under the yad of Pharaoh Melech Mitzrayim, had feared elohim acherim,"},{"num":8,"verse":"Walked in the chukkot of the Goyim, whom Hashem cast out from before the Bnei Yisroel, and [in the chukkot] of the Malkhei Yisroel, which they had made up."},{"num":9,"verse":"And the Bnei Yisroel did secretly those things that were not right against Hashem Eloheihem, and they built for them [idolatrous] high places in all their towns, from the migdal of the notzerim (watchmen) to the fortified city."},{"num":10,"verse":"And they set up for them matzevot and Asherim on every high hill, under every lushly foliaged green tree;"},{"num":11,"verse":"And there they burned ketoret in all the high places, as did the Goyim whom Hashem drove out before them; and wrought devarim ra’im (wicked things) to provoke Hashem to anger;"},{"num":12,"verse":"For they served the gillulim (idols), whereof Hashem had said unto them, Ye shall not do this thing."},{"num":13,"verse":"Yet Hashem testified warnings against Yisroel, and against Yehudah, by all the nevi’im, and by all the khozer (seers), saying, Turn ye from your derakhim hara’im and be shomer over My mitzvot and My chukkot, according to all the torah which I commanded your Avoteichem, and which I sent to you by My avadim the Nevi’im."},{"num":14,"verse":"Notwithstanding they would not listen, but stubbornly stiffened their necks, like the neck of their avot, that did not believe in Hashem Eloheihem."},{"num":15,"verse":"And they rejected His chukkot, and His brit (covenant) that He made with their avot, and His edot (testimonies, warnings) which He testified against them; and they followed after hevel, and became hevel, and went after the Goyim that were all around them, concerning whom Hashem had charged them, that they should not do like them."},{"num":16,"verse":"And they forsook all the mitzvot of Hashem Eloheihem, and made them massekhah, even two agalim, and made Asheirah, and worshiped all the Tzava HaShomayim, and served Ba’al."},{"num":17,"verse":"And they caused their banim and their banot to pass through the eish, and practiced kesamim and practiced witchcraft, and sold themselves to do rah in the eyes of Hashem, to provoke Him to anger."},{"num":18,"verse":"Therefore Hashem was very angry with Yisroel, and removed them out of His sight; there was none left but the shevet of Yehudah only."},{"num":19,"verse":"Also Yehudah kept not the mitzvot of Hashem Eloheihem, but walked in the chukkot of Yisroel which they had made up."},{"num":20,"verse":"And Hashem rejected all the zera Yisroel, afflicted them and delivered them into the yad of plunderers, until He had cast them out of His sight."},{"num":21,"verse":"For He tore Yisroel from the Bais Dovid; and they made Yarov‘am Ben Nevat melech; and Yarov‘am drove Yisroel from following after Hashem, and caused them to commit a chata’ah gedolah."},{"num":22,"verse":"For the Bnei Yisroel walked in all the chattot Yarov‘am which he did; they departed not from them;"},{"num":23,"verse":"Until Hashem removed Yisroel out of His sight, as He had said by all His avadim the Nevi’im. So was Yisroel carried away into the Golus out of their own adamah to Ashur (Assyria) unto this day."},{"num":24,"verse":"And Melech Ashur brought men from Babylon, and from Kutah, and from Ava, and from Chamat, and from Sepharvayim, and placed them in the cities of Shomron in the place of Bnei Yisroel; and they possessed Shomron, and dwelt in the cities thereof."},{"num":25,"verse":"And so it was at the beginning of their dwelling there, that they feared not Hashem; therefore Hashem sent among them the arayot which killed some of them."},{"num":26,"verse":"Wherefore they spoke to Melech Ashur, saying, The Goyim which thou hast removed, and placed in the cities of Shomron, know not the mishpat Elohei HaAretz; therefore He hath sent the arayot among them, and, behold, they slew them, because they know not the mishpat Elohei HaAretz."},{"num":27,"verse":"Then Melech Ashur commanded, saying, Carry back there one of the kohanim whom ye brought captive from there; and let them go and dwell there, and let him teach them the mishpat Elohei HaAretz."},{"num":28,"verse":"Then one of the kohanim whom they had carried away captive from Shomron came and dwelt in Beit-El, and was moreh (teacher) to them how they should fear Hashem."},{"num":29,"verse":"Howbeit every goy (nation) made g-ds of their own, and set them up in the batim (houses) of the high places which the Shomronim had made, every goy in their towns wherein they dwelt."},{"num":30,"verse":"And the men of Babylon made [the g-d] Sukkot Benot, and the men of Kutah made Nergal, and the men of Chamat made Ashima,"},{"num":31,"verse":"And the Avim made Nivchaz and Tartak, and the Sepharvim burned their banim in eish to Adramelech and Anammelech, the g-ds of Sepharvayim."},{"num":32,"verse":"So they feared Hashem, and made for themselves of the lowest of them kohanim of the [idolatrous] high places, which were officiating for them in beis habamot."},{"num":33,"verse":"They feared Hashem, and served their own g-ds, after the mishpat (manner) of the Goyim from which places as exiles they had been carried away."},{"num":34,"verse":"Unto this day they [the Samaritans] do after the mishpatim harishonim (former practices); they fear not Hashem, neither do they after their chukkot, or after their mishpatim, or after the torah and mitzvah which Hashem commanded the Bnei Ya’akov, whom He named shmo Yisroel;"},{"num":35,"verse":"With whom Hashem had cut a Brit, and commanded them, saying, Ye shall not fear elohim acherim, nor bow yourselves to them, nor serve them, nor offer zevakhim to them;"},{"num":36,"verse":"But Hashem, Who brought you up out of Eretz Mitzrayim with koach gadol and a stretched out zero’a, Him shall ye fear, and to Him shall ye bow down in worship, and to Him shall ye offer zevakhim."},{"num":37,"verse":"And the chukkot, and the mishpatim, and the torah, and the mitzvah, which He wrote for you, ye shall be shomer over to do kol hayamim; ye shall fear no elohim acherim."},{"num":38,"verse":"And the Brit that I have made with you ye shall not forget; neither shall ye fear elohim acherim."},{"num":39,"verse":"But Hashem Eloheichem ye shall fear; and He shall deliver you out of the yad of all your oyevim."},{"num":40,"verse":"Howbeit they did not pay heed, but they did after their mishpat harishon (former custom)."},{"num":41,"verse":"So these Goyim feared Hashem, and also served their peselim, both their banim, and their bnei banim; as did their avot, so do they unto this day."}]