[{"header":"Another Promise of Hope"},{"num":33,"verse":"While I was still in prison in the courtyard, the Lord's message came to me again. "},{"num":2,"verse":"The Lord, who made the earth, who formed it and set it in place, spoke to me. He whose name is the Lord said, "},{"num":3,"verse":"“Call to me, and I will answer you; I will tell you wonderful and marvelous things that you know nothing about. "},{"num":4,"verse":"I, the Lord, the God of Israel, say that the houses of Jerusalem and the royal palace of Judah will be torn down as a result of the siege and the attack. "},{"num":5,"verse":"Some will fight against the Babylonians, who will fill the houses with the corpses of those whom I am going to strike down in my anger and fury. I have turned away from this city because of the evil things that its people have done. "},{"num":6,"verse":"But I will heal this city and its people and restore them to health. I will show them abundant peace and security. "},{"num":7,"verse":"I will make Judah and Israel prosperous, and I will rebuild them as they were before. "},{"num":8,"verse":"I will purify them from the sins that they have committed against me, and I will forgive their sins and their rebellion. "},{"num":9,"verse":"Jerusalem will be a source of joy, honor, and pride to me; and every nation in the world will fear and tremble when they hear about the good things that I do for the people of Jerusalem and about the prosperity that I bring to the city.”"},{"num":10,"verse":"The Lord said, “People are saying that this place is like a desert, that it has no people or animals living in it. And they are right; the towns of Judah and the streets of Jerusalem are empty; no people or animals live there. But in these places you will hear again "},{"num":11,"verse":"the shouts of gladness and joy and the happy sounds of wedding feasts. You will hear people sing as they bring thank offerings to my Temple; they will say,"},{"num":12,"verse":"The Lord Almighty said, “In this land that is like a desert and where no people or animals live, there will once again be pastures where shepherds can take their sheep. "},{"num":13,"verse":"In the towns in the hill country, in the foothills, and in southern Judah, in the territory of Benjamin, in the villages around Jerusalem, and in the towns of Judah, shepherds will once again count their sheep. I, the Lord, have spoken.”"},{"num":14,"verse":"The Lord said, “The time is coming when I will fulfill the promise that I made to the people of Israel and Judah. "},{"num":15,"verse":"At that time I will choose as king a righteous descendant of David. That king will do what is right and just throughout the land. "},{"num":16,"verse":"The people of Judah and of Jerusalem will be rescued and will live in safety. The city will be called ‘The Lord Our Salvation.’ "},{"num":17,"verse":"I, the Lord, promise that there will always be a descendant of David to be king of Israel "},{"num":18,"verse":"and that there will always be priests from the tribe of Levi to serve me and to offer burnt offerings, grain offerings, and sacrifices.”"},{"num":19,"verse":"The Lord said to me, "},{"num":20,"verse":"“I have made a covenant with the day and with the night, so that they always come at their proper times; and that covenant can never be broken. "},{"num":21,"verse":"In the same way I have made a covenant with my servant David that he would always have a descendant to be king, and I have made a covenant with the priests from the tribe of Levi that they would always serve me; and those covenants can never be broken. "},{"num":22,"verse":"I will increase the number of descendants of my servant David and the number of priests from the tribe of Levi, so that it will be as impossible to count them as it is to count the stars in the sky or the grains of sand on the seashore.”"},{"num":23,"verse":"The Lord said to me, "},{"num":24,"verse":"“Have you noticed how people are saying that I have rejected Israel and Judah, the two families that I chose? And so they look with contempt on my people and no longer consider them a nation. "},{"num":25,"verse":"But I, the Lord, have a covenant with day and night, and I have made the laws that control earth and sky. "},{"num":26,"verse":"And just as surely as I have done this, so I will maintain my covenant with Jacob's descendants and with my servant David. I will choose one of David's descendants to rule over the descendants of Abraham, Isaac, and Jacob. I will be merciful to my people and make them prosperous again.”"}]