[{"header":"The Lord Will Be With Israel"},{"num":9,"verse":"“Listen, you Israelites! You will go across the Jordan River today. You will go into that land to force out nations greater and stronger than you. Their cities are big and have walls as high as the sky!"},{"num":2,"verse":"The people there are tall and strong. They are the Anakites. You know about them. You heard our spies say, ‘No one can win against the Anakites.’"},{"num":3,"verse":"But you can be sure that it is the Lord your God who goes across the river before you—and God is like a fire that destroys! He will destroy those nations and make them fall before you. You will force those nations out and quickly destroy them. The Lord has promised you that this will happen."},{"num":4,"verse":"“The Lord your God will force those nations out for you. But don’t say to yourselves, ‘The Lord brought us to live in this land because we are such good people.’ No, the Lord forced those nations out because they were evil, not because you were good."},{"num":5,"verse":"You are going in to take their land, but not because you are good and live right. You are going in, and the Lord your God is forcing those people out because of the evil way they lived. And the Lord wants to keep the promise he made to your ancestors, Abraham, Isaac, and Jacob."},{"num":6,"verse":"The Lord your God is giving you that good land to live in, but you should know that it is not because you are good. The truth is that you are very stubborn people!"},{"header":"Remember the Lord’s Anger"},{"num":7,"verse":"“Remember how you made the Lord your God angry in the desert. Never forget that! From the day you left the land of Egypt to the day you came to this place, you have refused to obey the Lord."},{"num":8,"verse":"You made the Lord angry at Mount Horeb. The Lord was angry enough to destroy you!"},{"num":9,"verse":"I went up the mountain to get the stone tablets. The agreement that the Lord made with you was written on those stones. I stayed on the mountain 40 days and 40 nights. I did not eat any food or drink any water."},{"num":10,"verse":"The Lord gave me the two stone tablets. He wrote his commands on the stones with his finger. The Lord wrote everything he said to you from the fire when you were gathered together at the mountain."},{"num":11,"verse":"“So at the end of 40 days and 40 nights, the Lord gave me two stone tablets—the stones of the agreement."},{"num":12,"verse":"Then the Lord said to me, ‘Get up and quickly go down from here. The people you brought out of Egypt have ruined themselves. They stopped obeying my commands so quickly. They melted gold and made an idol for themselves.’"},{"num":13,"verse":"“The Lord also said to me, ‘I have watched these people. They are very stubborn!"},{"num":14,"verse":"Let me destroy these people completely, so no one will even remember their names. Then I will make another nation from you that is stronger and greater than these people.’"},{"header":"The Golden Calf"},{"num":15,"verse":"“Then I turned and came down from the mountain. The mountain was burning with fire. And the two stone tablets of the agreement were in my hands."},{"num":16,"verse":"I looked and I saw you had sinned against the Lord your God. I saw the calf you made from melted gold! You stopped obeying the Lord so quickly."},{"num":17,"verse":"So I took the two stone tablets and threw them down. There before your eyes I broke the stones into pieces."},{"num":18,"verse":"Then I bowed down before the Lord with my face to the ground for 40 days and 40 nights, as I did before. I did not eat any food or drink any water. I did this because you had sinned so badly. You did the thing that is evil to the Lord, and you made him angry."},{"num":19,"verse":"I was afraid of the Lord’s terrible anger. He was angry enough to destroy you, but the Lord listened to me again."},{"num":20,"verse":"The Lord was very angry with Aaron—enough to destroy him! So I also prayed for Aaron at that time."},{"num":21,"verse":"I took that terrible thing, the calf you made, and burned it in the fire. I broke it into small pieces. And I crushed the pieces until they were dust. Then I threw the dust into the river that came down from the mountain."},{"header":"Moses Asks God to Forgive Israel"},{"num":22,"verse":"“Also, at Taberah, Massah, and Kibroth Hattaavah you made the Lord angry."},{"num":23,"verse":"And you did not obey when the Lord told you to leave Kadesh Barnea. He said, ‘Go up and take the land I am giving you.’ But you refused to obey the Lord your God. You did not trust him. You did not listen to his command."},{"num":24,"verse":"All the time that I have known you, you have refused to obey the Lord."},{"num":25,"verse":"“So I bowed down before the Lord 40 days and 40 nights, because the Lord said he would destroy you."},{"num":26,"verse":"I prayed to the Lord. I said, ‘Lord God, don’t destroy your people. They belong to you. You freed them and brought them out of Egypt with your great power and strength."},{"num":27,"verse":"Remember your promise to your servants Abraham, Isaac, and Jacob. Forget how stubborn these people are. Don’t look at their evil ways or their sins."},{"num":28,"verse":"If you punish your people, the Egyptians might say, “The Lord was not able to take his people into the land he promised them. And he hated them. So he took them into the desert to kill them.”"},{"num":29,"verse":"But they are your people, Lord. They belong to you. You brought them out of Egypt with your great power and strength.’"}]