[{"num":9,"verse":"¶ Hear, O Israel: Thou art ready to pass over the Jordan this day to enter in to inherit that of Gentiles greater and mightier than thyself, cities great and fenced up to heaven,"},{"num":2,"verse":"A people, great and tall, sons of the Anakims, whom thou knowest and of whom thou hast heard say, Who can stand before the sons of Anak!"},{"num":3,"verse":"Understand, therefore, this day that the LORD thy God is he who passes before thee; as a consuming fire he shall destroy them and humble them before thee, and thou shalt drive them out and destroy them quickly, as the LORD has said unto thee."},{"num":4,"verse":"Think not in thine heart, after the LORD thy God has cast them out from before thee, saying, Because of my righteousness the LORD has brought me in to inherit this land; rather for the wickedness of these Gentiles the LORD drives them out from before thee."},{"num":5,"verse":"Not for thy righteousness or for the uprightness of thine heart, dost thou enter in to inherit their land; but for the wickedness of these Gentiles, the LORD thy God drives them out from before thee and that he may confirm the word which the LORD swore unto thy fathers, Abraham, Isaac, and Jacob."},{"num":6,"verse":"Understand, therefore, that the LORD thy God does not give thee this good land to inherit because of thy righteousness, for thou art a stiffnecked people."},{"num":7,"verse":"¶ Remember, and forget not, how thou hast provoked the LORD thy God to wrath in the wilderness; from the day that thou didst depart out of the land of Egypt until ye came unto this place, ye have been rebellious against the LORD."},{"num":8,"verse":"Also in Horeb ye provoked the LORD to wrath, so that the LORD was angry with you to have destroyed you."},{"num":9,"verse":"When I climbed up into the mount to receive the tables of stone, even the tables of the covenant which the LORD made with you, then I abode in the mount forty days and forty nights, without eating bread or drinking water;"},{"num":10,"verse":"and the LORD delivered unto me two tables of stone written with the finger of God, and on them was written according to all the words which the LORD spoke with you in the mount out of the midst of the fire in the day of the assembly."},{"num":11,"verse":"And it came to pass at the end of forty days and forty nights that the LORD gave me the two tables of stone, even the tables of the covenant."},{"num":12,"verse":"And the LORD said unto me, Arise, go down quickly from here, for thy people which thou hast brought forth out of Egypt have corrupted themselves; they are quickly turned aside out of the way which I commanded them; they have made themselves a molten image."},{"num":13,"verse":"Furthermore, the LORD spoke unto me, saying, I have seen this people, and, behold, it is a stiffnecked people."},{"num":14,"verse":"Let me alone that I may destroy them and blot out their name from under heaven; and I will make of thee a nation mightier and greater than they."},{"num":15,"verse":"So I turned and came down from the mount with the two tables of the covenant in my two hands and the mount burned with fire,"},{"num":16,"verse":"and I looked, and, behold, ye had sinned against the LORD your God and had made yourselves a molten calf; ye had turned aside quickly out of the way which the LORD had commanded you."},{"num":17,"verse":"Then I took the two tables and cast them out of my two hands and broke them before your eyes."},{"num":18,"verse":"And I fell down before the LORD, as at the first, forty days and forty nights; I neither ate bread nor drank water because of all your sins in which ye sinned in doing wickedly in the sight of the LORD, to provoke him to anger."},{"num":19,"verse":"For I was afraid of the anger and hot displeasure with which the LORD was wroth against you to destroy you. But the LORD hearkened unto me at that time also."},{"num":20,"verse":"And the LORD was very angry with Aaron to have destroyed him, and I prayed for Aaron also the same time."},{"num":21,"verse":"And I took your sin, the calf which ye had made, and burnt it with fire and stamped it and ground it very small even until it was as small as dust, and I cast the dust thereof into the brook that descended out of the mount."},{"num":22,"verse":"Also at Taberah and at Massah and at Kibrothhattaavah, ye provoked the LORD to wrath."},{"num":23,"verse":"Likewise when the LORD sent you from Kadeshbarnea, saying, Go up and inherit the land which I have given you; then ye rebelled against the commandment of the LORD your God, and ye did not believe him nor hearken to his voice."},{"num":24,"verse":"Ye have been rebels against the LORD from the day that I knew you."},{"num":25,"verse":"Thus I fell down before the LORD forty days and forty nights, as I fell down at the first, because the LORD had said he would destroy you."},{"num":26,"verse":"I prayed, therefore, unto the LORD and said, O Lord GOD, destroy not thy people and thine inheritance, which thou hast ransomed through thy greatness, which thou hast brought forth out of Egypt with a mighty hand."},{"num":27,"verse":"Remember thy slaves, Abraham, Isaac, and Jacob; look not unto the stubbornness of this people nor to their wickedness nor to their sin,"},{"num":28,"verse":"lest those of the land from which thou didst bring us out say, Because the LORD was not able to bring them into the land which he promised them or because he hated them, he has brought them out to slay them in the wilderness."},{"num":29,"verse":"Yet they are thy people and thine inheritance, which thou didst bring out by thy mighty power and by thy outstretched arm."}]