[{"header":"Canaanite King Defeated"},{"num":21,"verse":"When the Canaanite king of Arad, who lived in the Negev, heard that Israel was coming on the Atharim road, he fought against Israel and captured some prisoners. "},{"num":2,"verse":"Then Israel made a vow to the Lord, “If You will deliver this people into our hands, we will completely destroy their cities.” "},{"num":3,"verse":"The Lord listened to Israel’s request, the Canaanites were defeated, and Israel completely destroyed them and their cities. So they named the place Hormah."},{"header":"The Bronze Snake"},{"num":4,"verse":"Then they set out from Mount Hor by way of the Red Sea to bypass the land of Edom, but the people became impatient because of the journey. "},{"num":5,"verse":"The people spoke against God and Moses: “Why have you led us up from Egypt to die in the wilderness? There is no bread or water, and we detest this wretched food!” "},{"num":6,"verse":"Then the Lord sent poisonous snakes among the people, and they bit them so that many Israelites died."},{"num":7,"verse":"The people then came to Moses and said, “We have sinned by speaking against the Lord and against you. Intercede with the Lord so that He will take the snakes away from us.” And Moses interceded for the people."},{"num":8,"verse":"Then the Lord said to Moses, “Make a snake image and mount it on a pole. When anyone who is bitten looks at it, he will recover.” "},{"num":9,"verse":"So Moses made a bronze snake and mounted it on a pole. Whenever someone was bitten, and he looked at the bronze snake, he recovered."},{"header":"Journey around Moab"},{"num":10,"verse":"The Israelites set out and camped at Oboth. "},{"num":11,"verse":"They set out from Oboth and camped at Iye-abarim in the wilderness that borders Moab on the east. "},{"num":12,"verse":"From there they went and camped at Zered Valley. "},{"num":13,"verse":"They set out from there and camped on the other side of the Arnon River, in the wilderness that extends from the Amorite border, because the Arnon was the Moabite border between Moab and the Amorites. "},{"num":14,"verse":"Therefore it is stated in the Book of the Lord’s Wars:"},{"num":16,"verse":"From there they went to Beer, the well the Lord told Moses about, “Gather the people so I may give them water.” "},{"num":17,"verse":"Then Israel sang this song:"},{"num":19,"verse":"from Mattanah to Nahaliel, from Nahaliel to Bamoth, "},{"num":20,"verse":"from Bamoth to the valley in the territory of Moab near the Pisgah highlands that overlook the wasteland."},{"header":"Amorite Kings Defeated"},{"num":21,"verse":"Israel sent messengers to say to Sihon king of the Amorites: "},{"num":22,"verse":"“Let us travel through your land. We won’t go into the fields or vineyards. We won’t drink any well water. We will travel the King’s Highway until we have traveled through your territory.” "},{"num":23,"verse":"But Sihon would not let Israel travel through his territory. Instead, he gathered his whole army and went out to confront Israel in the wilderness. When he came to Jahaz, he fought against Israel. "},{"num":24,"verse":"Israel struck him with the sword and took possession of his land from the Arnon to the Jabbok, but only up to the Ammonite border, because it was fortified."},{"num":25,"verse":"Israel took all the cities and lived in all these Amorite cities, including Heshbon and all its villages. "},{"num":26,"verse":"Heshbon was the city of Sihon king of the Amorites, who had fought against the former king of Moab and had taken control of all his land as far as the Arnon. "},{"num":27,"verse":"Therefore the poets say:"},{"num":31,"verse":"So Israel lived in the Amorites’ land. "},{"num":32,"verse":"After Moses sent spies to Jazer, Israel captured its villages and drove out the Amorites who were there."},{"num":33,"verse":"Then they turned and went up the road to Bashan, and Og king of Bashan came out against them with his whole army to do battle at Edrei. "},{"num":34,"verse":"But the Lord said to Moses, “Do not fear him, for I have handed him over to you along with his whole army and his land. Do to him as you did to Sihon king of the Amorites, who lived in Heshbon.” "},{"num":35,"verse":"So they struck him, his sons, and his whole army until no one was left, and they took possession of his land."}]