[{"header":"The Bronze Serpent"},{"num":21,"verse":"When the Canaanite, the king of Arad, who lived in the Negeb, heard that Israel was coming by the way of Atharim, he fought against Israel and took some of them captive. "},{"num":2,"verse":"Then Israel made a vow to the Lord and said, ‘If you will indeed give this people into our hands, then we will utterly destroy their towns.’ "},{"num":3,"verse":"The Lord listened to the voice of Israel, and handed over the Canaanites; and they utterly destroyed them and their towns; so the place was called Hormah."},{"num":4,"verse":"From Mount Hor they set out by the way to the Red Sea, to go around the land of Edom; but the people became impatient on the way. "},{"num":5,"verse":"The people spoke against God and against Moses, ‘Why have you brought us up out of Egypt to die in the wilderness? For there is no food and no water, and we detest this miserable food.’ "},{"num":6,"verse":"Then the Lord sent poisonous serpents among the people, and they bit the people, so that many Israelites died. "},{"num":7,"verse":"The people came to Moses and said, ‘We have sinned by speaking against the Lord and against you; pray to the Lord to take away the serpents from us.’ So Moses prayed for the people. "},{"num":8,"verse":"And the Lord said to Moses, ‘Make a poisonous serpent, and set it on a pole; and everyone who is bitten shall look at it and live.’ "},{"num":9,"verse":"So Moses made a serpent of bronze, and put it upon a pole; and whenever a serpent bit someone, that person would look at the serpent of bronze and live."},{"header":"The Journey to Moab"},{"num":10,"verse":"The Israelites set out, and camped in Oboth. "},{"num":11,"verse":"They set out from Oboth, and camped at Iye-abarim, in the wilderness bordering Moab towards the sunrise. "},{"num":12,"verse":"From there they set out, and camped in the Wadi Zered. "},{"num":13,"verse":"From there they set out, and camped on the other side of the Arnon, in the wilderness that extends from the boundary of the Amorites; for the Arnon is the boundary of Moab, between Moab and the Amorites. "},{"num":14,"verse":"Wherefore it is said in the Book of the Wars of the Lord,"},{"num":16,"verse":"From there they continued to Beer; that is the well of which the Lord said to Moses, ‘Gather the people together, and I will give them water.’ "},{"num":17,"verse":"Then Israel sang this song:"},{"num":19,"verse":"from Mattanah to Nahaliel, from Nahaliel to Bamoth, "},{"num":20,"verse":"and from Bamoth to the valley lying in the region of Moab by the top of Pisgah that overlooks the waste-land."},{"header":"King Sihon Defeated"},{"num":21,"verse":"Then Israel sent messengers to King Sihon of the Amorites, saying, "},{"num":22,"verse":"‘Let me pass through your land; we will not turn aside into field or vineyard; we will not drink the water of any well; we will go by the King’s Highway until we have passed through your territory.’ "},{"num":23,"verse":"But Sihon would not allow Israel to pass through his territory. Sihon gathered all his people together, and went out against Israel to the wilderness; he came to Jahaz, and fought against Israel. "},{"num":24,"verse":"Israel put him to the sword, and took possession of his land from the Arnon to the Jabbok, as far as to the Ammonites; for the boundary of the Ammonites was strong. "},{"num":25,"verse":"Israel took all these towns, and Israel settled in all the towns of the Amorites, in Heshbon, and in all its villages. "},{"num":26,"verse":"For Heshbon was the city of King Sihon of the Amorites, who had fought against the former king of Moab and captured all his land as far as the Arnon. "},{"num":27,"verse":"Therefore the ballad-singers say,"},{"num":31,"verse":"Thus Israel settled in the land of the Amorites. "},{"num":32,"verse":"Moses sent to spy out Jazer; and they captured its villages, and dispossessed the Amorites who were there."},{"header":"King Og Defeated"},{"num":33,"verse":"Then they turned and went up the road to Bashan; and King Og of Bashan came out against them, he and all his people, to battle at Edrei. "},{"num":34,"verse":"But the Lord said to Moses, ‘Do not be afraid of him; for I have given him into your hand, with all his people, and all his land. You shall do to him as you did to King Sihon of the Amorites, who ruled in Heshbon.’ "},{"num":35,"verse":"So they killed him, his sons, and all his people, until there was no survivor left; and they took possession of his land."}]