[[],[{"type":"header","content":"A Paralytic Healed"},{"type":"prose","content":"And Jesus, getting into a boat, crossed over  and came to [Capernaum] His own city."}],[{"type":"prose","content":"They brought to Him a man who was paralyzed, lying on a stretcher. Seeing their [active] faith [springing from confidence in Him], Jesus said to the paralytic,  [the penalty is paid, the guilt removed, and you are declared to be in right standing with God].” "}],[{"type":"prose","content":"And some of the scribes said to themselves, “This  blasphemes [by claiming the rights and prerogatives of God]!” "}],[{"type":"prose","content":"But Jesus, knowing their thoughts, said,   [Both are possible for God; both are impossible for man.] —then He said to the paralytic,  "}],[{"type":"prose","content":"And he got up and went home [healed and forgiven]. "}],[{"type":"prose","content":"When the crowds saw this, they were awestruck, and glorified God  praised Him, who had given such authority  power to men."},{"type":"header","content":"Matthew Called"}],[{"type":"prose","content":"As Jesus went on from there, He saw a man named Matthew (Levi) sitting in the tax collector’s booth; and He said to him,  [as My disciple, accepting Me as your Master and Teacher and walking the same path of life that I walk].” And Matthew got up and followed Him."}],[{"type":"prose","content":"Then as Jesus was reclining  in  house, many tax collectors and sinners [including non-observant Jews] came and ate with Him and His disciples. "}],[{"type":"prose","content":"When the Pharisees saw this, they asked His disciples, “Why does your Master eat with tax collectors and sinners?” "}],[{"type":"prose","content":"But when Jesus heard , He said,  [only]   [Scripture]  [for those in distress],  [animal]  [to repentance]  [self-proclaimed]  [who see no need to change],  [those who recognize their sin and actively seek forgiveness].”"},{"type":"header","content":"The Question about Fasting"}],[{"type":"prose","content":"Then the disciples of John [the Baptist] came to Jesus, asking, “Why do we and the Pharisees often fast [as a religious exercise], but Your disciples do not fast?” "}],[{"type":"prose","content":"And Jesus replied to them,    [that have lost their elasticity];  [fermenting] "},{"type":"header","content":"Miracles of Healing"}],[{"type":"prose","content":"While He was saying these things to them, a ruler (synagogue official) entered [the house] and kneeled down  worshiped Him, saying, “My daughter has just now died; but come and lay Your hand on her, and she will live.” "}],[{"type":"prose","content":"Jesus got up and  to accompany the ruler, with His disciples."}],[{"type":"prose","content":"Then a woman who had suffered from a hemorrhage for twelve years came up behind Him and touched the [tassel] fringe of His outer robe; "}],[{"type":"prose","content":"for she had been saying to herself, “If I only touch His outer robe, I will be healed.” "}],[{"type":"prose","content":"But Jesus turning and seeing her said,  [personal trust and confident]  [in Me]  And at once the woman was [completely] healed."}],[{"type":"prose","content":"When Jesus came to the ruler’s house, and saw the flute players [who were professional, hired mourners] and the [grieving] crowd making an uproar, "}],[{"type":"prose","content":"He said,  And they laughed  jeered at Him. "}],[{"type":"prose","content":"But when the crowd had been sent outside, Jesus went in and took her by the hand, and the girl got up. "}],[{"type":"prose","content":"And the news about this spread throughout all that district."}],[{"type":"prose","content":"As Jesus went on from there, two blind men followed Him, screaming loudly, “Have mercy  compassion on us, Son of David (Messiah)!” "}],[{"type":"prose","content":"When He went into the house, the blind men came up to Him, and Jesus said to them,  [with a deep, abiding trust]  They said to Him, “Yes, Lord.” "}],[{"type":"prose","content":"Then He touched their eyes, saying,  [your trust and confidence in My power and My ability to heal]  "}],[{"type":"prose","content":"And their eyes were opened. And Jesus sternly warned them:  "}],[{"type":"prose","content":"But they went out and spread the news about Him throughout that whole district."}],[{"type":"prose","content":"While they were going away, a mute, demon-possessed man was brought to Jesus. "}],[{"type":"prose","content":"And when the demon was driven out [by Jesus], the mute man spoke; and the crowds wondered in amazement, saying, “Never before has anything like this [miracle] been seen in Israel.” "}],[{"type":"prose","content":"But the Pharisees were saying, “He casts out the demons by [the power of] the ruler of demons.”"}],[{"type":"prose","content":"Jesus went throughout all the cities and villages [in Galilee], teaching in their synagogues and proclaiming the good news (gospel) of the kingdom, and healing every kind of disease and every kind of sickness [His words and His works reflecting His Messiahship]."}],[{"type":"prose","content":"When He saw the crowds, He was moved with compassion  pity for them, because they were dispirited and distressed, like sheep without a shepherd. "}],[{"type":"prose","content":"Then He said to His disciples,  [indeed]  "}]]