[{"header":"Jesus Heals a Crippled Man"},{"num":9,"verse":"Jesus got into a boat and crossed back over to the town where he lived. "},{"num":2,"verse":"Some people soon brought to him a crippled man lying on a mat. When Jesus saw how much faith they had, he said to the crippled man, “My friend, don’t worry! Your sins are forgiven.”"},{"num":3,"verse":"Some teachers of the Law of Moses said to themselves, “Jesus must think he is God!”"},{"num":4,"verse":"But Jesus knew what was in their minds, and he said, “Why are you thinking such evil things? "},{"num":5,"verse":"Is it easier for me to tell this crippled man that his sins are forgiven or to tell him to get up and walk? "},{"num":6,"verse":"But I will show you that the Son of Man has the right to forgive sins here on earth.” So Jesus said to the man, “Get up! Pick up your mat and go on home.” "},{"num":7,"verse":"The man got up and went home. "},{"num":8,"verse":"When the crowds saw this, they were afraid and praised God for giving such authority to people."},{"header":"Jesus Chooses Matthew"},{"num":9,"verse":"As Jesus was leaving, he saw a tax collector named Matthew sitting at the place for paying taxes. Jesus said to him, “Come with me.” Matthew got up and went with him."},{"num":10,"verse":"Later, Jesus and his disciples were having dinner at Matthew’s house. Many tax collectors and other sinners were also there. "},{"num":11,"verse":"Some Pharisees asked Jesus' disciples, “Why does your teacher eat with tax collectors and other sinners?”"},{"num":12,"verse":"Jesus heard them and answered, “Healthy people don’t need a doctor, but sick people do. "},{"num":13,"verse":"Go and learn what the Scriptures mean when they say, ‘Instead of offering sacrifices to me, I want you to be merciful to others.’ I didn’t come to invite good people to be my followers. I came to invite sinners.”"},{"header":"People Ask about Going without Eating"},{"num":14,"verse":"One day some followers of John the Baptist came and asked Jesus, “Why do we and the Pharisees often go without eating, while your disciples never do?”"},{"num":15,"verse":"Jesus answered:"},{"header":"A Dying Girl and a Sick Woman"},{"num":18,"verse":"While Jesus was still speaking, an official came and knelt in front of him. The man said, “My daughter has just now died! Please come and place your hand on her. Then she will live again.”"},{"num":19,"verse":"Jesus and his disciples got up and went with the man."},{"num":20,"verse":"A woman who had been bleeding for twelve years came up behind Jesus and barely touched his clothes. "},{"num":21,"verse":"She had said to herself, “If I can just touch his clothes, I will get well.”"},{"num":22,"verse":"Jesus turned. He saw the woman and said, “Don’t worry! You are now well because of your faith.” At that moment she was healed."},{"num":23,"verse":"When Jesus went into the home of the official and saw the musicians and the crowd of mourners, "},{"num":24,"verse":"he said, “Get out of here! The little girl isn’t dead. She is just asleep.” Everyone started laughing at Jesus. "},{"num":25,"verse":"But after the crowd had been sent out of the house, Jesus went to the girl’s bedside. He took her by the hand and helped her up."},{"num":26,"verse":"News about this spread all over that part of the country."},{"header":"Jesus Heals Two Blind Men"},{"num":27,"verse":"As Jesus was walking along, two blind men began following him and shouting, “Son of David, have pity on us!”"},{"num":28,"verse":"After Jesus had gone indoors, the two blind men came up to him. He asked them, “Do you believe I can make you well?”"},{"num":29,"verse":"Jesus touched their eyes and said, “Because of your faith, you will be healed.” "},{"num":30,"verse":"They were able to see, and Jesus strictly warned them not to tell anyone about him. "},{"num":31,"verse":"But they left and talked about him to everyone in that part of the country."},{"header":"Jesus Heals a Man Who Could Not Talk"},{"num":32,"verse":"As Jesus and his disciples were on their way, some people brought to him a man who could not talk because a demon was in him. "},{"num":33,"verse":"After Jesus had forced the demon out, the man started talking. The crowds were so amazed that they began saying, “Nothing like this has ever happened in Israel!”"},{"num":34,"verse":"But the Pharisees said, “The leader of the demons gives him the power to force out demons.”"},{"header":"Jesus Has Pity on People"},{"num":35,"verse":"Jesus went to every town and village. He taught in their meeting places and preached the good news about God’s kingdom. Jesus also healed every kind of disease and sickness. "},{"num":36,"verse":"When he saw the crowds, he felt sorry for them. They were confused and helpless, like sheep without a shepherd. "},{"num":37,"verse":"He said to his disciples, “A large crop is in the fields, but there are only a few workers. "},{"num":38,"verse":"Ask the Lord in charge of the harvest to send out workers to bring it in.”"}]