[{"header":"Jesus Heals a Paralyzed Man(A)"},{"num":9,"verse":"Jesus got into the boat and went back across the lake to his own town, "},{"num":2,"verse":"where some people brought to him a paralyzed man, lying on a bed. When Jesus saw how much faith they had, he said to the paralyzed man, “Courage, my son! Your sins are forgiven.”"},{"num":3,"verse":"Then some teachers of the Law said to themselves, “This man is speaking blasphemy!”"},{"num":4,"verse":"Jesus perceived what they were thinking, and so he said, “Why are you thinking such evil things? "},{"num":5,"verse":"Is it easier to say, ‘Your sins are forgiven,’ or to say, ‘Get up and walk’? "},{"num":6,"verse":"I will prove to you, then, that the Son of Man has authority on earth to forgive sins.” So he said to the paralyzed man, “Get up, pick up your bed, and go home!”"},{"num":7,"verse":"The man got up and went home. "},{"num":8,"verse":"When the people saw it, they were afraid, and praised God for giving such authority to people."},{"header":"Jesus Calls Matthew(B)"},{"num":9,"verse":"Jesus left that place, and as he walked along, he saw a tax collector, named Matthew, sitting in his office. He said to him, “Follow me.”"},{"num":10,"verse":"While Jesus was having a meal in Matthew's house, many tax collectors and other outcasts came and joined Jesus and his disciples at the table. "},{"num":11,"verse":"Some Pharisees saw this and asked his disciples, “Why does your teacher eat with such people?”"},{"num":12,"verse":"Jesus heard them and answered, “People who are well do not need a doctor, but only those who are sick. "},{"num":13,"verse":"Go and find out what is meant by the scripture that says: ‘It is kindness that I want, not animal sacrifices.’ I have not come to call respectable people, but outcasts.”"},{"header":"The Question about Fasting(E)"},{"num":14,"verse":"Then the followers of John the Baptist came to Jesus, asking, “Why is it that we and the Pharisees fast often, but your disciples don't fast at all?”"},{"num":15,"verse":"Jesus answered, “Do you expect the guests at a wedding party to be sad as long as the bridegroom is with them? Of course not! But the day will come when the bridegroom will be taken away from them, and then they will fast."},{"num":16,"verse":"“No one patches up an old coat with a piece of new cloth, for the new patch will shrink and make an even bigger hole in the coat. "},{"num":17,"verse":"Nor does anyone pour new wine into used wineskins, for the skins will burst, the wine will pour out, and the skins will be ruined. Instead, new wine is poured into fresh wineskins, and both will keep in good condition.”"},{"header":"The Official's Daughter and the Woman Who Touched Jesus' Cloak(F)"},{"num":18,"verse":"While Jesus was saying this, a Jewish official came to him, knelt down before him, and said, “My daughter has just died; but come and place your hands on her, and she will live.”"},{"num":19,"verse":"So Jesus got up and followed him, and his disciples went along with him."},{"num":20,"verse":"A woman who had suffered from severe bleeding for twelve years came up behind Jesus and touched the edge of his cloak. "},{"num":21,"verse":"She said to herself, “If only I touch his cloak, I will get well.”"},{"num":22,"verse":"Jesus turned around and saw her, and said, “Courage, my daughter! Your faith has made you well.” At that very moment the woman became well."},{"num":23,"verse":"Then Jesus went into the official's house. When he saw the musicians for the funeral and the people all stirred up, "},{"num":24,"verse":"he said, “Get out, everybody! The little girl is not dead—she is only sleeping!” Then they all started making fun of him. "},{"num":25,"verse":"But as soon as the people had been put out, Jesus went into the girl's room and took hold of her hand, and she got up. "},{"num":26,"verse":"The news about this spread all over that part of the country."},{"header":"Jesus Heals Two Blind Men"},{"num":27,"verse":"Jesus left that place, and as he walked along, two blind men started following him. “Have mercy on us, Son of David!” they shouted."},{"num":28,"verse":"When Jesus had gone indoors, the two blind men came to him, and he asked them, “Do you believe that I can heal you?”"},{"num":29,"verse":"Then Jesus touched their eyes and said, “Let it happen, then, just as you believe!”— "},{"num":30,"verse":"and their sight was restored. Jesus spoke sternly to them, “Don't tell this to anyone!”"},{"num":31,"verse":"But they left and spread the news about Jesus all over that part of the country."},{"header":"Jesus Heals a Man Who Could Not Speak"},{"num":32,"verse":"As the men were leaving, some people brought to Jesus a man who could not talk because he had a demon. "},{"num":33,"verse":"But as soon as the demon was driven out, the man started talking, and everyone was amazed. “We have never seen anything like this in Israel!” they exclaimed."},{"num":34,"verse":"But the Pharisees said, “It is the chief of the demons who gives Jesus the power to drive out demons.”"},{"header":"Jesus Has Pity for the People"},{"num":35,"verse":"Jesus went around visiting all the towns and villages. He taught in the synagogues, preached the Good News about the Kingdom, and healed people with every kind of disease and sickness. "},{"num":36,"verse":"As he saw the crowds, his heart was filled with pity for them, because they were worried and helpless, like sheep without a shepherd. "},{"num":37,"verse":"So he said to his disciples, “The harvest is large, but there are few workers to gather it in. "},{"num":38,"verse":"Pray to the owner of the harvest that he will send out workers to gather in his harvest.”"}]