[{"header":"Chapter 9"},{"num":1,"verse":"The Healing of a Paralytic. He entered a boat, made the crossing, and came into his own town. "},{"num":2,"verse":"And there people brought to him a paralytic lying on a stretcher. When Jesus saw their faith, he said to the paralytic, “Courage, child, your sins are forgiven.” "},{"num":3,"verse":"At that, some of the scribes said to themselves, “This man is blaspheming.” "},{"num":4,"verse":"Jesus knew what they were thinking, and said, “Why do you harbor evil thoughts? "},{"num":5,"verse":"Which is easier, to say, ‘Your sins are forgiven,’ or to say, ‘Rise and walk’? "},{"num":6,"verse":"But that you may know that the Son of Man has authority on earth to forgive sins”—he then said to the paralytic, “Rise, pick up your stretcher, and go home.” "},{"num":7,"verse":"He rose and went home. "},{"num":8,"verse":"When the crowds saw this they were struck with awe and glorified God who had given such authority to human beings."},{"num":9,"verse":"As Jesus passed on from there, he saw a man named Matthew sitting at the customs post. He said to him, “Follow me.” And he got up and followed him. "},{"num":10,"verse":"While he was at table in his house, many tax collectors and sinners came and sat with Jesus and his disciples. "},{"num":11,"verse":"The Pharisees saw this and said to his disciples, “Why does your teacher eat with tax collectors and sinners?” "},{"num":12,"verse":"He heard this and said, “Those who are well do not need a physician, but the sick do. "},{"num":13,"verse":"Go and learn the meaning of the words, ‘I desire mercy, not sacrifice.’ I did not come to call the righteous but sinners.”"},{"num":14,"verse":"The Question About Fasting. Then the disciples of John approached him and said, “Why do we and the Pharisees fast [much], but your disciples do not fast?” "},{"num":15,"verse":"Jesus answered them, “Can the wedding guests mourn as long as the bridegroom is with them? The days will come when the bridegroom is taken away from them, and then they will fast. "},{"num":16,"verse":"No one patches an old cloak with a piece of unshrunken cloth, for its fullness pulls away from the cloak and the tear gets worse. "},{"num":17,"verse":"People do not put new wine into old wineskins. Otherwise the skins burst, the wine spills out, and the skins are ruined. Rather, they pour new wine into fresh wineskins, and both are preserved.”"},{"num":18,"verse":"The Official’s Daughter and the Woman with a Hemorrhage. While he was saying these things to them, an official came forward, knelt down before him, and said, “My daughter has just died. But come, lay your hand on her, and she will live.” "},{"num":19,"verse":"Jesus rose and followed him, and so did his disciples. "},{"num":20,"verse":"A woman suffering hemorrhages for twelve years came up behind him and touched the tassel on his cloak. "},{"num":21,"verse":"She said to herself, “If only I can touch his cloak, I shall be cured.” "},{"num":22,"verse":"Jesus turned around and saw her, and said, “Courage, daughter! Your faith has saved you.” And from that hour the woman was cured."},{"num":23,"verse":"When Jesus arrived at the official’s house and saw the flute players and the crowd who were making a commotion, "},{"num":24,"verse":"he said, “Go away! The girl is not dead but sleeping.” And they ridiculed him. "},{"num":25,"verse":"When the crowd was put out, he came and took her by the hand, and the little girl arose. "},{"num":26,"verse":"And news of this spread throughout all that land."},{"num":27,"verse":"And as Jesus passed on from there, two blind men followed [him], crying out, “Son of David, have pity on us!” "},{"num":28,"verse":"When he entered the house, the blind men approached him and Jesus said to them, “Do you believe that I can do this?” “Yes, Lord,” they said to him. "},{"num":29,"verse":"Then he touched their eyes and said, “Let it be done for you according to your faith.” "},{"num":30,"verse":"And their eyes were opened. Jesus warned them sternly, “See that no one knows about this.” "},{"num":31,"verse":"But they went out and spread word of him through all that land."},{"num":32,"verse":"The Healing of a Mute Person. As they were going out, a demoniac who could not speak was brought to him, "},{"num":33,"verse":"and when the demon was driven out the mute person spoke. The crowds were amazed and said, “Nothing like this has ever been seen in Israel.” "},{"num":34,"verse":"But the Pharisees said, “He drives out demons by the prince of demons.”"},{"num":35,"verse":"The Compassion of Jesus. Jesus went around to all the towns and villages, teaching in their synagogues, proclaiming the gospel of the kingdom, and curing every disease and illness. "},{"num":36,"verse":"At the sight of the crowds, his heart was moved with pity for them because they were troubled and abandoned, like sheep without a shepherd. "},{"num":37,"verse":"Then he said to his disciples, “The harvest is abundant but the laborers are few; "},{"num":38,"verse":"so ask the master of the harvest to send out laborers for his harvest.”"}]