[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That which is bruised, or crushed, or broken, or cut.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—These four terms express the four ways which the ancients used to emasculate animals.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither shall ye make any offering thereof in your land.—Better, and this shall ye not do in your land; that is, not only are animals thus mutilated prohibited as offerings for the altar, but this practice of gelding is altogether forbidden to the Israelites with regard to any animal whatsoever throughout the country. This law is binding upon the orthodox Jews to this day, and the question has recently been discussed by some of their spiritual guides, since it seriously affects those of their community who are engaged in farming land.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Neither shall ye make any offering thereof in your land.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and this shall ye not do in your land; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "that is, not only are animals thus mutilated prohibited as offerings for the altar, but this practice of gelding is altogether forbidden to the Israelites with regard to any animal whatsoever throughout the country. This law is binding upon the orthodox Jews to this day, and the question has recently been discussed by some of their spiritual guides, since it seriously affects those of their community who are engaged in farming land.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:1-33 Laws concerning the priests and sacrifices. - In this chapter we have divers laws concerning the priests and sacrifices, all for preserving the honour of the sanctuary. Let us recollect with gratitude that our great High Priest cannot be hindered by any thing from the discharge of his office. Let us also remember, that the Lord requires us to reverence his name, his truths, his ordinances, and commandments. Let us beware of hypocrisy, and examine ourselves concerning our sinful defilements, seeking to be purified from them in the blood of Christ, and by his sanctifying Spirit. Whoever attempts to expiate his own sin, or draws near in the pride of self-righteousness, puts as great an affront on Christ, as he who comes to the Lord's table from the gratification of sinful lusts. Nor can the minister who loves the souls of the people, suffer them to continue in this dangerous delusion. He must call upon them, not only to repent of their sins, and forsake them; but to put their whole trust in the atonement of Christ, by faith in his name, for pardon and acceptance with God; thus only will the Lord make them holy, as his own people.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The literal meaning of the passage in italics is, and this shall ye not do in your land. It appears to have been understood by the Jews as a prohibition of the mutilation of animals. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. that mayest thou offer, &c.—The passage should be rendered thus: \"if thou offer it either for a freewill offering, or for a vow, it shall not be accepted.\" This sacrifice being required to be \"without blemish\" [Le 22:19], symbolically implied that the people of God were to dedicate themselves wholly with sincere purposes of heart, and its being required to be \"perfect to be accepted\" [Le 22:21], led them typically to Him without whom no sacrifice could be offered acceptable to God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye shall not offer unto the Lord that which bruised, or crushed, or broken, or cut,.... The Targum of Jonathan is, whose testicles are pressed and bruised, and whose nerves are corrupted and bruised, and so most Jewish writers interpret it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither shall you make any offering thereof in your land; any offering of any sort, either burnt offering or peace offering, or any other; or ye shall not do, that is, any such thing as here suggested, not bruise, or crush, or break, or cut the testicles of any creature; so the above writers. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither shall you make any offering thereof in your land; any offering of any sort, either burnt offering or peace offering, or any other; or ye shall not do, that is, any such thing as here suggested, not bruise, or crush, or break, or cut the testicles of any creature; so the above writers. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Ye shall not offer unto the LORD that which is bruised, or crushed, or broken, or cut; neither shall ye make any offering thereof in your land.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A reference to emasculation. Animals thus treated were forbidden to be offered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Leviticus 22:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Castrated animals were not to be sacrificed, nor in fact to be kept in the land at all. מעוּך compressus, θλιβίας, an animal with the stones crushed; כּתוּת contusus, θλασίας, with them beaten to pieces; נתוּק avulsus, σπάδων, with them twisted off; כּרוּי excisus, τομίας or ἐκτομίας, with them cut off. In all these different ways was the operation performed among the ancients (cf. Aristot. hist. an. ix. 37, 3; Colum. vi. 26, vii. 11; Pallad. vi. 7). \"And in your land ye shall not make,\" sc., וגו מעוּך, i.e., castrated animals, that is to say, \"not castrate animals.\" This explanation, which is the one given by Josephus (Ant. iv. 8, 40) and all the Rabbins, is required by the expression \"in your land,\" which does not at all suit the interpretation adopted by Clericus and Knobel, who understand by עשׂה the preparation of sacrifices, for sacrifices were never prepared outside the land. The castration of animals is a mutilation of God's creation, and the prohibition of it was based upon the same principle as that of mixing heterogeneous things in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]