[{"header":"Chapter 36"},{"num":1,"verse":"Jehoahaz. The people of the land took Jehoahaz, son of Josiah, and made him king in Jerusalem to succeed his father. "},{"num":2,"verse":"Jehoahaz was twenty-three years old when he became king, and he reigned three months in Jerusalem. "},{"num":3,"verse":"The king of Egypt deposed him in Jerusalem and fined the land one hundred talents of silver and a talent of gold. "},{"num":4,"verse":"Then the king of Egypt made Eliakim, the brother of Jehoahaz, king over Judah and Jerusalem, changing his name to Jehoiakim. Neco took Jehoahaz his brother away and brought him to Egypt."},{"num":5,"verse":"Jehoiakim. Jehoiakim was twenty-five years old when he became king, and he reigned eleven years in Jerusalem. He did what was evil in the sight of the Lord, his God. "},{"num":6,"verse":"Nebuchadnezzar, king of Babylon, attacked and bound him in chains to take him to Babylon. "},{"num":7,"verse":"Nebuchadnezzar also carried away to Babylon some of the vessels of the house of the Lord and put them in his palace in Babylon. "},{"num":8,"verse":"The rest of the acts of Jehoiakim, the abominable things that he did, and what therefore happened to him, are recorded in the book of the kings of Israel and Judah. His son Jehoiachin succeeded him as king."},{"num":9,"verse":"Jehoiachin. Jehoiachin was eighteen years old when he became king, and he reigned three months and ten days in Jerusalem. He did what was evil in the Lord’s sight. "},{"num":10,"verse":"At the turn of the year, King Nebuchadnezzar sent for him and had him brought to Babylon, along with precious vessels from the house of the Lord. He made his brother Zedekiah king over Judah and Jerusalem."},{"num":11,"verse":"Zedekiah. Zedekiah was twenty-one years old when he became king, and he reigned eleven years in Jerusalem. "},{"num":12,"verse":"He did what was evil in the sight of the Lord, his God, and he did not humble himself before Jeremiah the prophet, who spoke for the Lord. "},{"num":13,"verse":"He also rebelled against King Nebuchadnezzar, who had made him swear by God. He became stiff-necked and hardened his heart rather than return to the Lord, the God of Israel. "},{"num":14,"verse":"Likewise all the princes of Judah, the priests, and the people added treachery to treachery, practicing all the abominations of the nations and defiling the Lord’s house which he had consecrated in Jerusalem."},{"num":15,"verse":"The Fall of Judah. Early and often the Lord, the God of their ancestors, sent his messengers to them, for he had compassion on his people and his dwelling place. "},{"num":16,"verse":"But they mocked God’s messengers, despised his words, and scoffed at his prophets, until the Lord’s anger against his people blazed up beyond remedy. "},{"num":17,"verse":"Then he brought up against them the king of the Chaldeans, who killed their young men with the sword in their own sanctuary, with compassion for neither young men nor young women, neither the old nor the infirm; all of them he delivered into his power. "},{"num":18,"verse":"All the utensils of the house of God, large and small, the treasures of the Lord’s house, and the treasures of the king and his princes, all these he brought to Babylon. "},{"num":19,"verse":"They burnt the house of God, tore down the walls of Jerusalem, burnt down all its palaces, and destroyed all its precious objects. "},{"num":20,"verse":"Those who escaped the sword he carried captive to Babylon, where they became servants to him and his sons until the Persian kingdom came to power. "},{"num":21,"verse":"All this was to fulfill the word of the Lord spoken by Jeremiah: Until the land has retrieved its lost sabbaths, during all the time it lies waste it shall have rest while seventy years are fulfilled."},{"num":22,"verse":"Decree of Cyrus. In the first year of Cyrus, king of Persia, in order to realize the word of the Lord spoken by Jeremiah, the Lord roused the spirit of Cyrus, King of Persia, to spread this proclamation throughout his kingdom, both by word of mouth and in writing: "},{"num":23,"verse":"“Thus says Cyrus, king of Persia: The Lord, the God of heaven, has given to me all the kingdoms of the earth. He has also charged me to build him a house in Jerusalem, which is in Judah. All among you, therefore, who belong to his people, may their God be with them; let them go up.”"}]