[{"header":"Jehoahaz Rules in Judah"},{"num":36,"verse":"Then the people of the land took Josiah’s son Jehoahaz and made him the next king in Jerusalem."},{"num":2,"verse":"Jehoahaz was twenty-three years old when he became king, and he reigned in Jerusalem three months."},{"num":3,"verse":"Then he was deposed by the king of Egypt, who demanded that Judah pay 7,500 pounds of silver and 75 pounds of gold as tribute."},{"header":"Jehoiakim Rules in Judah"},{"num":4,"verse":"The king of Egypt then installed Eliakim, the brother of Jehoahaz, as the next king of Judah and Jerusalem, and he changed Eliakim’s name to Jehoiakim. Then Neco took Jehoahaz to Egypt as a prisoner."},{"num":5,"verse":"Jehoiakim was twenty-five years old when he became king, and he reigned in Jerusalem eleven years. He did what was evil in the sight of the Lord his God."},{"num":6,"verse":"Then King Nebuchadnezzar of Babylon came to Jerusalem and captured it, and he bound Jehoiakim in bronze chains and led him away to Babylon."},{"num":7,"verse":"Nebuchadnezzar also took some of the treasures from the Temple of the Lord, and he placed them in his palace in Babylon."},{"num":8,"verse":"The rest of the events in Jehoiakim’s reign, including all the evil things he did and everything found against him, are recorded in The Book of the Kings of Israel and Judah. Then his son Jehoiachin became the next king."},{"header":"Jehoiachin Rules in Judah"},{"num":9,"verse":"Jehoiachin was eighteen years old when he became king, and he reigned in Jerusalem three months and ten days. Jehoiachin did what was evil in the Lord’s sight."},{"num":10,"verse":"In the spring of the year King Nebuchadnezzar took Jehoiachin to Babylon. Many treasures from the Temple of the Lord were also taken to Babylon at that time. And Nebuchadnezzar installed Jehoiachin’s uncle, Zedekiah, as the next king in Judah and Jerusalem."},{"header":"Zedekiah Rules in Judah"},{"num":11,"verse":"Zedekiah was twenty-one years old when he became king, and he reigned in Jerusalem eleven years."},{"num":12,"verse":"But Zedekiah did what was evil in the sight of the Lord his God, and he refused to humble himself when the prophet Jeremiah spoke to him directly from the Lord."},{"num":13,"verse":"He also rebelled against King Nebuchadnezzar, even though he had taken an oath of loyalty in God’s name. Zedekiah was a hard and stubborn man, refusing to turn to the Lord, the God of Israel."},{"num":14,"verse":"Likewise, all the leaders of the priests and the people became more and more unfaithful. They followed all the pagan practices of the surrounding nations, desecrating the Temple of the Lord that had been consecrated in Jerusalem."},{"num":15,"verse":"The Lord, the God of their ancestors, repeatedly sent his prophets to warn them, for he had compassion on his people and his Temple."},{"num":16,"verse":"But the people mocked these messengers of God and despised their words. They scoffed at the prophets until the Lord’s anger could no longer be restrained and nothing could be done."},{"header":"The Fall of Jerusalem"},{"num":17,"verse":"So the Lord brought the king of Babylon against them. The Babylonians killed Judah’s young men, even chasing after them into the Temple. They had no pity on the people, killing both young men and young women, the old and the infirm. God handed all of them over to Nebuchadnezzar."},{"num":18,"verse":"The king took home to Babylon all the articles, large and small, used in the Temple of God, and the treasures from both the Lord’s Temple and from the palace of the king and his officials."},{"num":19,"verse":"Then his army burned the Temple of God, tore down the walls of Jerusalem, burned all the palaces, and completely destroyed everything of value."},{"num":20,"verse":"The few who survived were taken as exiles to Babylon, and they became servants to the king and his sons until the kingdom of Persia came to power."},{"num":21,"verse":"So the message of the Lord spoken through Jeremiah was fulfilled. The land finally enjoyed its Sabbath rest, lying desolate until the seventy years were fulfilled, just as the prophet had said."},{"header":"Cyrus Allows the Exiles to Return"},{"num":22,"verse":"In the first year of King Cyrus of Persia, the Lord fulfilled the prophecy he had given through Jeremiah. He stirred the heart of Cyrus to put this proclamation in writing and to send it throughout his kingdom:"}]