[{"header":"Reign of Jehoahaz"},{"num":36,"verse":"The people of the land took Jeho′ahaz the son of Josi′ah and made him king in his father’s stead in Jerusalem. "},{"num":2,"verse":"Jeho′ahaz was twenty-three years old when he began to reign; and he reigned three months in Jerusalem. "},{"num":3,"verse":"Then the king of Egypt deposed him in Jerusalem and laid upon the land a tribute of a hundred talents of silver and a talent of gold. "},{"num":4,"verse":"And the king of Egypt made Eli′akim his brother king over Judah and Jerusalem, and changed his name to Jehoi′akim; but Neco took Jeho′ahaz his brother and carried him to Egypt."},{"header":"Reign and Captivity of Jehoiakim"},{"num":5,"verse":"Jehoi′akim was twenty-five years old when he began to reign, and he reigned eleven years in Jerusalem. He did what was evil in the sight of the Lord his God. "},{"num":6,"verse":"Against him came up Nebuchadnez′zar king of Babylon, and bound him in fetters to take him to Babylon. "},{"num":7,"verse":"Nebuchadnez′zar also carried part of the vessels of the house of the Lord to Babylon and put them in his palace in Babylon. "},{"num":8,"verse":"Now the rest of the acts of Jehoi′akim, and the abominations which he did, and what was found against him, behold, they are written in the Book of the Kings of Israel and Judah; and Jehoi′achin his son reigned in his stead."},{"header":"Reign and Captivity of Jehoiachin"},{"num":9,"verse":"Jehoi′achin was eight years old when he began to reign, and he reigned three months and ten days in Jerusalem. He did what was evil in the sight of the Lord. "},{"num":10,"verse":"In the spring of the year King Nebuchadnez′zar sent and brought him to Babylon, with the precious vessels of the house of the Lord, and made his brother Zedeki′ah king over Judah and Jerusalem."},{"header":"Reign of Zedekiah"},{"num":11,"verse":"Zedeki′ah was twenty-one years old when he began to reign, and he reigned eleven years in Jerusalem. "},{"num":12,"verse":"He did what was evil in the sight of the Lord his God. He did not humble himself before Jeremiah the prophet, who spoke from the mouth of the Lord. "},{"num":13,"verse":"He also rebelled against King Nebuchadnez′zar, who had made him swear by God; he stiffened his neck and hardened his heart against turning to the Lord, the God of Israel. "},{"num":14,"verse":"All the leading priests and the people likewise were exceedingly unfaithful, following all the abominations of the nations; and they polluted the house of the Lord which he had hallowed in Jerusalem."},{"header":"The Fall of Jerusalem"},{"num":15,"verse":"The Lord, the God of their fathers, sent persistently to them by his messengers, because he had compassion on his people and on his dwelling place; "},{"num":16,"verse":"but they kept mocking the messengers of God, despising his words, and scoffing at his prophets, till the wrath of the Lord rose against his people, till there was no remedy."},{"num":17,"verse":"Therefore he brought up against them the king of the Chalde′ans, who slew their young men with the sword in the house of their sanctuary, and had no compassion on young man or virgin, old man or aged; he gave them all into his hand. "},{"num":18,"verse":"And all the vessels of the house of God, great and small, and the treasures of the house of the Lord, and the treasures of the king and of his princes, all these he brought to Babylon. "},{"num":19,"verse":"And they burned the house of God, and broke down the wall of Jerusalem, and burned all its palaces with fire, and destroyed all its precious vessels. "},{"num":20,"verse":"He took into exile in Babylon those who had escaped from the sword, and they became servants to him and to his sons until the establishment of the kingdom of Persia, "},{"num":21,"verse":"to fulfil the word of the Lord by the mouth of Jeremiah, until the land had enjoyed its sabbaths. All the days that it lay desolate it kept sabbath, to fulfil seventy years."},{"header":"Cyrus Proclaims Liberty for the Exiles"},{"num":22,"verse":"Now in the first year of Cyrus king of Persia, that the word of the Lord by the mouth of Jeremiah might be accomplished, the Lord stirred up the spirit of Cyrus king of Persia so that he made a proclamation throughout all his kingdom and also put it in writing: "},{"num":23,"verse":"“Thus says Cyrus king of Persia, ‘The Lord, the God of heaven, has given me all the kingdoms of the earth, and he has charged me to build him a house at Jerusalem, which is in Judah. Whoever is among you of all his people, may the Lord his God be with him. Let him go up.’”"}]