[{"num":10,"verse":"It is bad for those who make laws that are not fair. It is bad for those who make it hard for people. "},{"num":2,"verse":"They keep what is right and fair from those in need. They take away the rights of the poor of My people. They take from wives after their husbands die, and take what belongs to those who have no parents. "},{"num":3,"verse":"Now what will you do in the day of punishment, when the destroying power comes from far away? To whom will you run for help? Where will you leave your riches? "},{"num":4,"verse":"Nothing will be left to do but to bow down among those who are being taken to prison, or fall among those who are killed. Even with all this, His anger does not turn away. His hand is still held out."},{"header":"Assyria Used to Punish Israel"},{"num":5,"verse":"It is bad for Assyria. I use Assyria like a stick to punish Israel. "},{"num":6,"verse":"I sent it against a nation without God, against the people of My anger. I sent it to take away the riches of battle, and to step hard on the people like dirt in the streets. "},{"num":7,"verse":"But this is not what is in Assyria’s mind. It does not plan this in its heart. It plans to destroy and to cut off many nations. "},{"num":8,"verse":"For it says, “Are not my princes all kings? "},{"num":9,"verse":"Is not Calno like Carchemish, or Hamath like Arpad, or Samaria like Damascus? "},{"num":10,"verse":"My hand took the nations of the false gods, whose false gods were greater than those of Jerusalem and Samaria. "},{"num":11,"verse":"Should I not do to Jerusalem and her gods just as I have done to Samaria and her gods?”"},{"num":12,"verse":"So when the Lord has completed all His work on Mount Zion and on Jerusalem, He will punish the proud heart of the king of Assyria and his proud spirit. "},{"num":13,"verse":"For the king has said, “I did this by the power of my hand and by my wisdom, for I have understanding. I moved the land-marks of the people and took their riches. Like a strong man I have brought down those who sat on thrones. "},{"num":14,"verse":"My hand has taken the riches of the people like one taken from a nest. I gathered all the earth as one gathers eggs that have been left. And there was not one that moved its wing or opened its mouth or made a sound.”"},{"num":15,"verse":"Can an ax say it is more important than the one who uses it? Is the saw more important than the one who saws with it? A stick of wood does not lift up a man. A man lifts up a stick. "},{"num":16,"verse":"So the Lord, the Lord of All, will send a wasting disease among the strong Assyrian soldiers. Under the king’s greatness a fire will be started that will burn and burn. "},{"num":17,"verse":"The light of Israel and his Holy One will become a fire. And it will burn and destroy his thorns and thistles in one day. "},{"num":18,"verse":"The Lord will destroy the greatness of the trees and the fields that give much fruit, both soul and body. It will be as when a sick man wastes away. "},{"num":19,"verse":"And the rest of his trees will be so few that a child could write them down."},{"header":"A Few of Israel Will Return"},{"num":20,"verse":"In that day those of Israel and of the family of Jacob who are still alive will never again trust in the one who destroyed them. But they will trust in the Lord, the Holy One of Israel. "},{"num":21,"verse":"Some people, those who are left of Jacob, will return to the powerful God. "},{"num":22,"verse":"Even if there are as many Jews as the sand by the sea, only a few of them will return. The plan is to destroy them and it will be right and complete. "},{"num":23,"verse":"For the Lord of All will destroy everything in the whole land and do what He planned."},{"header":"Assyria Will Be Punished"},{"num":24,"verse":"So the Lord, the Lord of All, says, “O My people who live in Zion, do not be afraid of the Assyrians when they come to fight against you as the Egyptians did. "},{"num":25,"verse":"For in a very little while My anger against you will come to an end and it will be turned to destroy them.” "},{"num":26,"verse":"The Lord of All will punish them like He punished Midian at the rock of Oreb. His special stick will be over the sea and He will lift it up the way He did in Egypt. "},{"num":27,"verse":"In that day the Assyrian’s load will be taken from your shoulders and neck, and it will be broken because you are so fat. "},{"num":28,"verse":"He has come against Aiath. He has passed through Migron. At Michmash he left his bags. "},{"num":29,"verse":"They have gone through a narrow path. They stayed in Geba during the night. Ramah is afraid, and Gibeah of Saul has run away. "},{"num":30,"verse":"Cry out with your voice, O people of Gallim! See, Laishah! Answer her, O Anathoth! "},{"num":31,"verse":"Madmenah has run away. The people of Gebim have looked for a safe place. "},{"num":32,"verse":"Yet today he will stop at Nob. He shakes his hand at the mountain of the people of Zion, the hill of Jerusalem."},{"num":33,"verse":"See, the Lord, the Lord of All, will cut off the branches with a great noise. Those who stand tall will be cut down. And those who are high will be brought low. "},{"num":34,"verse":"He will cut down the many trees with an iron ax. And Lebanon will fall by the Powerful One."}]