[{"num":10,"verse":"Woe to them that make wicked laws, and they writing have written unrightfulness, (Woe to them who make wicked laws, and they writing have written injustice,)"},{"num":2,"verse":"for to oppress poor men in doom, and to do violence to the cause of meek men of my people; that widows shall be the prey of them, and that they should ravish fatherless children. (and so they oppress the poor in judgement, and do violence to the cause of the humble among my people; and widows shall become their prey, and they shall rob fatherless children.)"},{"num":3,"verse":"What shall ye do in the day of visitation, and of wretchedness coming from [a]far? To whose help shall ye flee? and where shall ye leave your glory,"},{"num":4,"verse":"that ye be not bowed down under bond and fall not down with slain men? (so that ye be not bowed down in slavery, and fall not down with the slain?) On all these things his strong vengeance is not turned away, but yet his hand is stretched forth."},{"num":5,"verse":"Woe to Assur, he is the rod and staff of my strong vengeance; mine indignation is in the hand of them. (Woe to the Assyrian, he is the rod and the staff of my strong vengeance; yea, my anger is in his hands.)"},{"num":6,"verse":"I shall send him to a false folk, and I shall command to him against the people of my strong vengeance; that he take away the spoils, and part prey, and that he set that people into defouling, as the fen of streets. (I shall send him to a godless nation, and I shall command to him against the people for whom I have strong vengeance; yea, that he bring down that people into defiling, to be like the dirt, or the mire, in the streets.)"},{"num":7,"verse":"Forsooth he shall not deem so, and his heart shall not guess so, but his heart shall be for to all-break, and to the slaying of many folks. (But he shall not stop there, and his heart shall not be content with only them, but his heart, or his plans, shall be to altogether break, and to kill, many nations.)"},{"num":8,"verse":"For he shall say, Whether my princes be not kings (al)together? (For he shall say, Shall not all my princes, or all my leaders, be kings?)"},{"num":9,"verse":"Whether not as Carchemish, so Calno; and as Arpad, so Hamath? whether not as Damascus, so Samaria?"},{"num":10,"verse":"As mine hand found the realms of idol(s), so and the simulacra of them of Jerusalem and of Samaria. (As my hands found the kingdoms that be full of idols, so now also the idols of those who be in Jerusalem and Samaria.)"},{"num":11,"verse":"Whether not as I did to Samaria, and to the idols thereof, so I shall do to Jerusalem, and to the simulacra thereof? (Whether not as I did to Samaria, and to their idols, so now I shall also do to Jerusalem, and their idols?)"},{"num":12,"verse":"And it shall be, when the Lord hath [ful]filled all his works in the hill of Zion and in Jerusalem, I shall visit on the fruit of the great doing heart of the king of Assur, and on the glory of the highness of his eyes. (And it shall be, when the Lord hath fulfilled all his works on Mount Zion and in Jerusalem, I shall punish the king of Assyria for the fruit of the great doing of his heart, and for the glory of the highness of his eyes.)"},{"num":13,"verse":"For he said, I have done in the strength of mine hand, and I have understood in my wisdom; and I have taken away the ends of [the] peoples, and I have robbed the princes of them, and I as a mighty man have drawn down them that sat on high. (For he said, I have done by the strength of my own hand, and I have understood by my own wisdom; and I have done away the borders of the nations, and I have robbed their leaders, and I, a mighty man, have drawn down those who sat on high.)"},{"num":14,"verse":"And mine hand found the strength of peoples as a nest, and as eggs be gathered together that be forsaken, so I gathered together all [the] earth; and none there was that moved a feather, and opened the mouth, and grutched. (And my hand found the wealth of the peoples like a nest, and like eggs that be abandoned be gathered together, so I gathered together all the lands; and there was no one who moved a feather, or opened his mouth, or grumbled.)"},{"num":15,"verse":"Whether an ax shall have glory against him that cutteth with it? either a saw shall be enhanced against him of whom it is drawn? as if a rod is raised against him that raiseth it, and a staff is enhanced, which soothly is a tree. (Shall an ax have more glory than him who cutteth with it? or shall a saw be exalted, or be lifted up, over him by whom it is drawn? like if a rod is raised up against him who raiseth it up, or a staff is exalted, which truly is just a piece of wood.)"},{"num":16,"verse":"For this thing the lordly governor, Lord of hosts, shall send thinness into the fat men of him; and his glory kindled under shall burn as the burning of fire (For this thing the Lordly Governor, the Lord of hosts, shall send thinness into his fat people; and under his strength he shall kindle a burning like the burning of a fire.)"},{"num":17,"verse":"And the light of Israel shall be in fire, and the Holy of it in flame; and the thorn of him and briar shall be kindled and devoured in one day. (And the light of Israel shall be a fire, and its Holy One shall be a flame; and his thorns and briars shall be kindled and devoured in one day.)"},{"num":18,"verse":"And the glory of his forest, and of his Carmel, shall be wasted, from the soul unto [the] flesh; and he shall be fleeing away for dread. (And the glory of his forest, and of his plentiful land, shall be destroyed, from the soul unto the flesh; and he shall flee away out of fear.)"},{"num":19,"verse":"And the remnants of the tree(s) of his forest shall be numbered for (such) fewness, and a child shall write them (so that even a child could count them)."},{"num":20,"verse":"And it shall be in that day, the remnant of Israel, and they that fled of the house of Jacob, shall not add for to trust on him that smiteth them; but it shall trust on the holy Lord of Israel, in truth. (And it shall be on that day, that the remnant of Israel, yea, they of the house of Jacob who fled, shall no longer trust him who striketh them; but they shall truly trust the Holy Lord of Israel.)"},{"num":21,"verse":"The remnants, I say, the remnants of Jacob, shall be converted to the strong Lord. (The remnants, I say, the remnants of Jacob, shall turn again to the strong Lord/shall return to the strong Lord.)"},{"num":22,"verse":"For why, Israel, if thy people is as the gravel of the sea, the remnants shall be turned (again) thereof; an ending made short shall make rightfulness to be plenteous. (Because, O Israel, though thy people be as innumerable as the sand of the sea, only a remnant shall turn again to him/shall return to him; and so a shortened ending shall make justice to be plentiful.)"},{"num":23,"verse":"For why the Lord God of hosts shall make an ending and abridging, in the midst of all earth. (For the Lord God of hosts shall make an ending and a shortening, that is, destruction, over all the earth.)"},{"num":24,"verse":"For this thing the Lord God of hosts saith these things, My people, the dweller of Zion, do not thou dread of Assur, for he shall smite thee in a rod, and he shall raise [up] his staff on thee in the way of Egypt. (For this reason the Lord God of hosts saith these things, My people, the inhabitants of Zion, do not thou fear the Assyrians, though they shall strike thee with their rod, and they shall raise up their staff against thee, like the Egyptians did.)"},{"num":25,"verse":"For why yet a little, and a little, and mine indignation and my strong vengeance shall be ended on the great trespass of them."},{"num":26,"verse":"And the Lord of hosts shall raise [up] a scourge on him by the vengeance of Midian in the stone of Oreb, and by his rod on the sea; and he shall raise (up) that rod in the way of Egypt. (And the Lord of hosts shall raise up a scourge upon them like his vengeance upon Midian at the stone of Oreb, and his rod shall be upon the River, like he raised up that rod against Egypt.)"},{"num":27,"verse":"And it shall be in that day, his burden shall be taken away from thy shoulder, and his yoke from thy neck; and the yoke shall wax [all] rotten from the face of oil. (And it shall be on that day, his burden shall be taken away from thy shoulder, and his yoke from thy neck; and the yoke shall be destroyed because of the anointing.)"},{"num":28,"verse":"He shall come into Aiath, he shall pass into Migron, at Michmash he shall betake his vessels to (safe) keeping."},{"num":29,"verse":"They passed swiftly, Geba is our seat, Ramah was astonied (Ramah was astonished), Gibeah of Saul (hath) fled."},{"num":30,"verse":"Thou daughter of Gallim, wail with thy voice; thou Laish, perceive (it), thou poor Anathoth."},{"num":31,"verse":"Madmenah passed; the dwellers of Gebim fled; be ye comforted. (The people of Madmenah flew; the inhabitants of Gebim fled away; be ye strong.)"},{"num":32,"verse":"Yet it is (the) day, that men stand in Nob; he shall drive his hand on the hill of the daughter of Zion, on the little hill of Jerusalem. (Yet this is the day, when people shall stand in Nob; and he shall drive his hand against the hill of the daughter of Zion, the hill of Jerusalem.)"},{"num":33,"verse":"Lo! the Lordly Governor, the Lord of hosts, shall break a pottle in dread (shall break the boughs of the trees with frightful lightning), and high men of stature shall be cut down. And proud men shall be made low,"},{"num":34,"verse":"and the thick things of the forest shall be destroyed by iron; and the Lebanon with (its) high things shall fall down."}]