[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-13 Here is the law settled between the blood of the murdered, and the blood of the murderer; provision is made, that the cities of refuge should be a protection, so that a man should not die for that as a crime, which was not his willing act. In Christ, the Lord our Righteousness, refuge is provided for those who by faith flee unto him. But there is no refuge in Jesus Christ for presumptuous sinners, who go on still in their trespasses. Those who flee to Christ from their sins, shall be safe in him, but not those who expect to be sheltered by him in their sins.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Deuteronomy 19:8, 9Provision is here made for the anticipated enlargement of the borders of Israel to the utmost limits promised by God, from the river of Egypt to the Euphrates (Genesis 15:18, note; Exodus 23:31, note). This promise, owing to the sins of the people, did not receive its fulfillment until after David had conquered the Philistines, Syrians, etc.; and this but a transient one, for many of the conquered peoples regained independence on the dissolution of Solomon's empire. Jamieson-Fausset-Brown Bible Commentary8, 9. And if the Lord thy God enlarge thy coast—Three additional sanctuaries were to be established in the event of their territory extending over the country from Hermon and Gilead to the Euphrates (see Ge 15:18; Ex 23:31). But it was obscurely hinted that this last provision would never be carried into effect, as the Israelites would not fulfil the conditions, namely, \"that of keeping the commandments, to love the Lord, and walk ever in his ways.\" In point of fact, although that region was brought into subjection by David and Solomon, we do not find that cities of refuge were established; because those sovereigns only made the ancient inhabitants tributary, instead of sending a colony of Israelites to possess it. The privilege of sanctuary cities, however, was given only for Israelites; and besides, that conquered territory did not remain long under the power of the Hebrew kings.Matthew Poole's Commentary No text from Poole on this verse. Gill's Exposition of the Entire BibleThine eye shall not pity him,.... This is not said to the avenger of blood, who is not to be supposed to have any pity or compassion on such a person, but to the elders, judges, and civil magistrates of the city to which he belonged, who took cognizance of his case; these were to show him no favour on account of his being a citizen, a neighbour, a relation or friend, or a rich man, or on any account whatever; but without favour or affection were to judge him and put him to death as a murderer; see Numbers 35:21, but thou shall put away the guilt of innocent blood from Israel; by which they would be defiled, and be liable to punishment for it; see Numbers 35:33, the Targum of Jonathan is,\"shall put away those that shed innocent blood out of Israel;''put them away by death: that it may go well with thee; with the whole land and its inhabitants, and with the city particularly, and the magistrates, and men of it, to which the murderer condemned to death belonged, being continued in the enjoyment of all temporal blessings and mercies. Geneva Study BibleThine {g} eye shall not pity him, but thou shalt put away the guilt of innocent blood from Israel, that it may go well with thee.(g) Then whoever pardons murder, goes against the word of God.",
    "elements": []
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Only by such action on the part of the local authorities and the kinsmen of the murdered man can the guilt of the crime be removed from the whole nation. To this extent the ancient custom of the vendetta is recognised as part of the theocratic system.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou shalt put away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (6).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that it may go well with thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Another recurrent phrase; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Additional Note",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": The Vendetta, ‘the one element of jurisprudence in the wild life of the desert,’ springs from, the simple principle of blood for blood, still valid in the law of Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Its moral effects are twofold and contrary. On the one hand it is a restraint upon manslaughter, the possibilities of vengeance which it lets loose engendering reluctance to take life except in self-defence. On the other, when once a man has been slain, there is no chance of a fair trial for the slayer; though his deed may have been an accident he may have to atone for it with his life; while the excitement of whole families and tribes to avenge it is a fertile source of disorder and of war, which may last and has lasted for a century. The duty of the vendetta extends sometimes to the third sometimes to the fifth degree of kinship, but among the Sinai Arabs to the sixth from the grandfather down (Jennings Bramley, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "PEFQ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1907, 135). Hence even in the wildest parts of Arabia there arose the right of sanctuary in any tent from which it was claimed, and the respite was used for the investigation of the case, and even in cases of wilful murder for the arrangement of some compromise—financial or otherwise—between the slayer and the kinsmen of the slain. In these negotiations the tribal authorities would often intervene. But even this has been found insufficient to secure order and justice, and wherever a central authority has been established among the Arabs one of its first efforts has been to control and regulate, or even to abolish, the vendetta. For modern examples—the Wahabees, Mohammed ‘Ali, the Russians in the Caucasus and the Sublime Porte—see Von Oppenheim, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Vom Mittelmeer zum Pers. Golf",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Similarly in Israel. The earlier law (as we have seen) gave sanctuary at every altar of Jehovah. When only the One Altar remained the opportunity came to modify the whole consuetudinary law; the vendetta was not abolished but controlled by the rights of sanctuary in certain accessible cities and by the interference of the local authorities. These provisions, apparently first made by D and elaborated in P, secured a fair trial and the acquittal of the innocent slayer; but they do not allow any such compromise, financial or otherwise, as frequently takes place among the Arabs between the wilful murderer and the kinsmen of his victim. In Israel the wilful murderer must die. Such distinctions of Israel’s system from the customs of her Semitic neighbours, involving as they do both a greater humanity in one direction and a greater severity in the other, are of the highest ethical interest.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Deuteronomy 19:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But whatever care was to be taken by means of free cities to prevent the shedding of blood, the cities of refuge were not to be asyla for criminals who were deserving of death, nor to afford protection to those who had slain a neighbour out of hatred. If such murderers should flee to the free city, the elders (magistrates) of his own town were to fetch him out, and deliver him up to the avenger of blood, that he might die. The law laid down in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 35:16-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here still more minutely defined; but this does not transfer to the elders the duty of instituting a judicial inquiry, and deciding the matter, as Riehm follows Vater and De Wette in maintaining, for the purpose of proving that there is a discrepancy between Deuteronomy and the previous legislation. They are simply commanded to perform the duty devolving upon them as magistrates and administrators of local affairs. (On ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 19:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      }
    ]
  }
]