[{"num":75,"verse":"To the overcomer, lose thou not the psalm of the song of Asaph. God, we shall acknowledge to thee, we shall acknowledge; and we shall inwardly call thy name. We shall tell thy marvels; (To the overcomer, destroy thou not the psalm of the song of Asaph. God, we shall give thee thanks, we shall give thee thanks; and we shall call on thy name. We shall tell of all thy marvellous deeds.)"},{"num":2,"verse":"when I shall take (hold of the) time, I shall deem (with) rightfulnesses. (And God said, I shall take hold of the time; and I shall judge with righteousness/and I shall judge with justice.)"},{"num":3,"verse":"The earth is melted, and all that dwell therein; I confirmed the pillars thereof. (The earth was shaken, and all who live on it; but I made its pillars firm.)"},{"num":4,"verse":"I said to wicked men (I said to the wicked), Do not ye do wickedly; and to trespassers, Do not ye enhance the horn."},{"num":5,"verse":"Do not ye raise on high your horn (Do not ye raise up your horn on high); do not ye speak wickedness against God."},{"num":6,"verse":"For (promotion cometh) neither from the east, neither from the west, neither from desert hills; (For judgement cometh not from the east, nor from the west, nor from the hills in the wilderness;)"},{"num":7,"verse":"for God is the judge. He meeketh this man, and enhanceth him; (for God is the judge. He humbleth this one, and raiseth up that one;)"},{"num":8,"verse":"for a cup of clean wine, full of meddling, is in the hand of the Lord (for there is a cup of clear wine, full of mixing, or of mixture, in the Lord’s hand). And he bowed (some) of this into that; nevertheless the dregs thereof is not diminished, either made less, (for) all [the] sinners of [the] earth shall drink thereof."},{"num":9,"verse":"Forsooth I shall tell into the world; I shall sing to God of Jacob. (And I shall tell this out forever; I shall sing to the God of Jacob.)"},{"num":10,"verse":"And I shall break all the horns of sinners; and the horns of the just man shall be enhanced. (And I shall break all the horns of the sinners; but the horns of the righteous shall be raised up.)"}]