[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By reason of the words.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The noise and confusion in the banquet-hall was heard by the queen-mother in her apartments. Her respect for Daniel is evident from her language. The position which she held was one of influence, for it appears that her advice was no sooner offered than it was accepted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 5:10-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:10-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Now the queen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The king’s wives and concubines sat with him at the feast, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; therefore the person here called the queen, and said to come into the banqueting-house on this solemn occasion, must have been the queen-mother, the widow of Evil-merodach, named Nitocris, a lady, according to Herodotus, eminent for her wisdom, and who had the chief direction of public affairs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The queen said, Let not thy thoughts trouble thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Be not so distressed, nor yield to terror and despondency. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There is a man in thy kingdom — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Some persons are apt to wonder that Daniel was unknown to Belshazzar, which others have accounted for from the abandoned and indolent character of this prince; but there is a further reason: which Mr. Harmer, vol. 1. p. 166, has hinted, from Sir John Chardin, namely, that he had been ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mazouled, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as they express it in the East, that is, displaced at the death of a prior king; since, in the East, when the king dies, the physicians and astrologers are removed: the former for not having driven away death, and the latter for not having predicted it. It is probable, however, that Daniel was not totally unknown to the king; but being perhaps in no esteem, or not employed in any considerable department of the state, in the early part of his reign, he was not readily recollected. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In whom was the spirit of the holy gods — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And in the days of thy father — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of thy grandfather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Nebuchadnezzar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "light and understanding, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That is, an enlightened understanding, or supernatural illumination, as the next words show. Such an insight he had into things secret, and such a foresight of things to come, that it was evident he was divinely inspired, and possessed of extraordinary wisdom, given him from above. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Forasmuch as an excellent spirit and knowledge, &c., were found in the same Daniel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His excellent disposition, his humble, holy, heavenly spirit, was both a great ornament to his wisdom, and fitted him for the reception and increase of that extraordinary gift of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Now let Daniel be called, and he will show the interpretation — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "She speaks with confidence; for, being aged, and Nebuchadnezzar having been dead not above twenty-four years, she no doubt well remembered the extraordinary events which had occurred in the latter part of his life, and the supernatural inspiration, and extraordinary wisdom, which Daniel had manifested on these occasions. And she speaks as if she knew where to find Daniel, though Belshazzar probably did not.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:10-17 Daniel was forgotten at court; he lived privately, and was then ninety years of age. Many consult servants of God on curious questions, or to explain difficult subjects, but without asking the way of salvation, or the path of duty. Daniel slighted the offer of reward. He spoke to Belshazzar as to a condemned criminal. We should despise all the gifts and rewards this world can give, did we see, as we may by faith, its end hastening on; but let us do our duty in the world, and do it all the real service we can.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now the queen - \"Probably the queen-mother, the Nitocris of Herodotus, as the king's wives were at the entertainment.\" - Wintle. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So Prof. Stuart. The editor of the \"Pictorial Bible\" also supposes that this was the queen-mother, and thinks that this circumstance will explain her familiarity with the occurrences in the reign of Nebuchadnezzar. He says, \"We are informed above, that the 'wives and concubines' of the king were present at the banquet. It therefore seems probable that the 'queen' who now first appears was the queen-mother; and this probability is strengthened by the intimate acquaintance which she exhibits with the affairs of Nebuchadnezzars reign; at the latter end of which she, as the wife of Evil-Merodach, who was regent during his father's alienation of mind, took an active part in the internal policy of the kingdom, and in the completion of the great works which Nebuchadnezzar had begun in Babylon. This she continued during the reigns of her husband and son, the present king Belshazzar. This famous queen, Nitocris, therefore, could not but be well acquainted with the character and services of Daniel.\" On the place and influence of the queen-mother in the Oriental courts, see Taylor's Fragments to Calmet's Dictionary, No. 16. From the extracts which Taylor has collected, it would seem that she held an exalted place at court, and that it is every way probable that she would be called in or would come in, on such an occasion. See also Knolles' \"History of the Turks,\" as quoted by Taylor, \"Fragments,\" No. 50.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By reason of the words of the king and his lords - Their words of amazement and astonishment. These would doubtless be conveyed to her, as there was so much alarm in the palace, and as there was a summons to bring in the wise men of Babylon. if her residence was in some part of the palace itself, nothing would be more natural than that she should be made acquainted with the unusual occurrence; or if her residence was, as Taylor supposes, detached from the palace, it is every way probable that she would be made acquainted with the consternation that prevailed, and that, recollecting the case of Nebuchadnezzar, and the forgotten services of Daniel, she would feel that the information which was sought respecting the mysterious writing could be obtained from him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the queen spake and said, O king, live for ever - A common salutation in addressing a king, expressive of a desire of his happiness and prosperity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Let not thy thoughts trouble thee ... - That is, there is a way by which the mystery may be solved, and you need not, therefore, be alarmed. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Let not thy thoughts trouble thee ... - That is, there is a way by which the mystery may be solved, and you need not, therefore, be alarmed. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. queen—the queen mother, or grandmother, Nitocris, had not been present till now. She was wife either of Nebuchadnezzar or of Evil merodach; hence her acquaintance with the services of Daniel. She completed the great works which the former had begun. Hence Herodotus attributes them to her alone. This accounts for the deference paid to her by Belshazzar. (See on [1090]Da 4:36). Compare similar rank given to the queen mother among the Hebrews (1Ki 15:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The women in those courts had always an apartment by themselves, and this being queen mother, and aged, did not mingle herself with the king’s wives and concubines, but withdrew herself from those pleasures in banqueting, yet brake rule in coming in now upon this solemn occasion and fright. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now the queen, by reason of the words of the king and his lords, came into the banquet house,.... Not the wife of Belshazzar, as Porphyry would have it; but rather the queen mother, as Jacchiades, the widow of Evilmerodach his father, whose name was Nitocris; and is spoken of, by Herodotus (q), as a very prudent woman; and as this seems to be by her words and conduct: though Josephus (r) says it was his grandmother, she who had been the wife of Nebuchadnezzar; and of this opinion were some mentioned by Aben Ezra; whose name was Amyitis; and it appears, by what she says afterwards, that she was well acquainted with affairs in his time; and, being an ancient woman, might be the reason why she was not among the ladies at the feast in the banqueting house; but came into it, without being sent for, on hearing the consternation and distress the king and his lords were in, and the moanful despairing words they expressed on this occasion: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the queen spake and said, O king, live for ever; the usual salutation given to the kings of Babylon, and other eastern monarchs; see Daniel 2:4, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the queen spake and said, O king, live for ever; the usual salutation given to the kings of Babylon, and other eastern monarchs; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "let not thy thoughts trouble thee, nor let thy countenance be changed; at this affair, as if it could never be understood, and the true meaning of it be given; but be of good: cheer, and put on a good countenance; there is hope yet that it may be cleared up to satisfaction. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) Clio, sive l. 1. c. 185, 188. (r) Antiqu. l. 10. c. 11. sect. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) Clio, sive l. 1. c. 185, 188. (r) Antiqu. l. 10. c. 11. sect. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Now the {h} queen, by reason of the words of the king and his lords, came into the banquet house: and the queen spake and said, O king, live for ever: let not thy thoughts trouble thee, nor let thy countenance be changed:",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "Now",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " queen, by reason of the words of the king and his lords, came into the banquet house: ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the queen spake and said, O king, live for ever: let not thy thoughts trouble thee, nor let thy countenance be changed:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) That is, his grandmother, Nebuchadnezzar's wife, who because of her age was not at the feast before, but came there when she heard of this strange news.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the queen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] probably, as most commentators assume,—partly because she is distinguished from the ‘wives’ or ‘consorts’ mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 5:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", partly on account of the manner in which she speaks in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 5:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " of what had happened in the days of Nebuchadnezzar,—the queen-mother, i.e. (in the view of the writer) Nebuchadnezzar’s widow[257]. In both Israel and Judah the mother of the reigning king is mentioned as an influential person, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 24:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[257] Nabu-na’id’s actual mother died eight years previously, in his ninth year, as is expressly stated in the ‘Annalistic Tablet,’ ii. 13 (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "KB.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " iii. 2, p. 131; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "RP.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2 v. 160).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O king, live for ever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "trouble",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "alarm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 5:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 10-12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Now the queen, by reason of the words of the king and his lords, came into the banquet-house: and the queen spake and said, O king, live for ever; let not thy thoughts trouble thee, nor let thy countenance be changed: there is a man in thy kingdom in whom is the spirit of the holy gods; and in the days of thy father light and understanding and wisdom, like the wisdom of the gods, was found in him; whom the King Nebuchadnezzar thy father, the king, I say, thy father, made master of the magicians, astrologers, Chaldeans, and soothsayers; forasmuch as an excellent spirit, and knowledge, and understanding, interpreting of dreams, and showing of hard sentences, and dissolving of doubts, were found in the same Daniel, whom the king named Belteshazzar: now let Daniel be called, and he will show the interpretation.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " No one can fail to feel the presence of rhetoric here, especially in the last verse, which, we may remark, has no equivalent in the Septuagint. We see the rhetorical character of these verses more clearly when we consider the ineptitude of the special powers ascribed to Daniel to meet the present difficulty. Interpretation of dreams was a common attribute ascribed to wisdom in the East of old, as it is yet. But this was not a dream, and therefore the qualification was not to the purpose; still less to the purpose are the attributes that follow. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Showing of hard sentences.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Giving riddles that nobody could read was an evidence of wisdom all over the East (see Josephus, 8:5. 3; besides Talmudic stories of Solomon). This, however, is not a case of competition in riddles; above all, there is no opportunity of one giving riddles in return. \"Dissolving of doubts\" is the solving of these riddles. These qualities, which the queen-mother, according to the Massoretic text, ascribes to Daniel, might make him delightful as a boon companion, but were not at all to the purpose in the matter troubling the king. The version of the Septuagint is much briefer, and, it seems to us, much more satisfactory, \"Then the queen reminded him concerning Daniel, who was of the captivity of Judaea, and said to the king, The man was understanding, wise, and excelling all the wise men of Babylon, and there is a holy spirit in him, and in the days of the king thy father, he showed difficult (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὑπέρογκα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") interpretations to Nebuchadnezzar thy father.\" This has every sign of having been translated; thus the phrase, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἐμνήσθη πρὸς αὐτὸν περὶ τοῦ Δανιήλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which we have rendered, \"reminded him concerning  Daniel.\" This use of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πρὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " after ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μιμνήσκω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is unknown in classic Greek. In Homer's 'Odyssey' it is accusative of person; in Plato, 'Laches,' 200 D, it is dative of person; in 'Legg.,' 3:688, it is accusative of person. It is, however, exactly parallel with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 40:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Μνησθήσῃ περὶ ἐμοῦ πρὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Φαραὼ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Πρὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " represents ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אֶל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the Hebrew; in the Targum of Onkelos and in the Peshitta this is translated by ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "קְדָם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; in Paulus Tellensis it is rendered by ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Moreover, according to the Massoretic text, Belshazzar asks Daniel if he is\" that Daniel which art of the captivity of the children of Judah, whom the king my father brought out of Jewry?\" The queen-mother had said nothing, according to the verses before us as given in the Massoretic recension, of Daniel being a Jew. According to the Septuagint, the queen-mother tells him whence Daniel is. Theodotion agrees with the Massoretic text, save that it inserts \"watchfulness\" instead of \"light,\" and omits the repetition of \"thy father.\" The Peshitta is also substantially at one with our received text. One of the great difficulties which commentators have found in this part of the incident is how Belshazzar could be ignorant of Daniel. Various means have been adopted to get over the difficulty. One is that Daniel was away from Babylon up to this time (Jephet-ibn-Ali). Archdeacon Rose is certain he must have known about him. The explanation of this is as recumbent on the opponents of the authenticity of Daniel as on its defenders, for they - the latter - declare it the work of one author, and it has had powerful effect on people: it must be artistically written if it is not a record of facts. No artist in fictitious narrative would present to his readers so obvious a difficulty. We learn now what was the probable reason of Belshazzar's ignorance of Daniel. Nabu-nahid, a usurper, was at variance with the whole clergy, as we may call them, of Babylon, and most likely Daniel acted with the others, and possibly, as far back as the revolution in which Evil-Merodach perished, had been away from the court. It is the height of unfairness of any one to press the name here given to Nebuchadnezzar, \"my father.\" That title was very loosely used among the Babylonians and Assyrians. Jehu is called \"the son of Omri,\" although he had swept the race of Omri off the face of the earth. So Dr. hugo Winckler, in his ' Untersuchungen zur Attorientalischen Geschichte,' p. 53, note, says, \"This word 'son' after the name of a Chaldean prince, is only to be taken in the sense of belonging to the same dynasty.\" Had the phrase used been that \"Nebuchadnezzar slept with his fathers, and Belshazzar his son reigned in his stead,\" something might have been said for the view maintained by all critics, that the author thought Belshazzar the son of Nebuchadnezzar. How can the critics assert this, and yet, as does Professor Bevan, maintain this author intimate even with the minutest portions of Jeremiah, Kings, and Chronicles? If so, how is it that he did not know that both Kings and Jeremiah asserted Nebuchadnezzar to have been succeeded by Evil-Merodach? This information occupies too prominent a place in both books for him to have been ignorant of it. We can only understand his action in thus putting down Belshazzar as the son of Nebuchadnezzar by assuming his acceptance of usage. The critics cannot explain it. Those who maintain the traditional view may do so by saying that Daniel, writing at the time, knowing the real state of matters, the claim of Belshazzar to be descended from Nebuchadnezzar, the fact that Evil-Merodach had been killed, simply relates facts. Had he been inventing history, and acquainted with the holy books, and all the information they conveyed to everybody, he would of necessity have spent some pains in explaining how his history came to differ so much from what one could draw from the Books of Kings and Jeremiah. The two accounts of Saul's meeting with David are not comparable with this, as we find the reason of the contradiction in the coalescence of two different accounts. Daniel 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "By מלכּתא interpreters rightly understand the mother of the reigning king, the widow of his father Nebuchadnezzar, since according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The wives of the king were present at the festival, and the queen came before the king as only a mother could do. Among the Israelites also the mother of the reigning king was held in high respect; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 24:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". מלּין לקבל, by reason of the words, not: because of the affair, to which neither the plur. מלּי nor the gen. רברבנוהי agrees. Instead of the Kethiv עללת the Keri has עלּת, the later form. The queen-mother begins in an assuring manner, since she can give an advice which is fitted to allay the embarrassment. ",
        "children": []
      }
    ]
  }
]