[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:18-31 Daniel reads Belshazzar's doom. He had not taken warning by the judgments upon Nebuchadnezzar. And he had insulted God. Sinners are pleased with gods that neither see, nor hear, nor know; but they will be judged by One to whom all things are open. Daniel reads the sentence written on the wall. All this may well be applied to the doom of every sinner. At death, the sinner's days are numbered and finished; after death is the judgment, when he will be weighed in the balance, and found wanting; and after judgment the sinner will be cut asunder, and given as a prey to the devil and his angels. While these things were passing in the palace, it is considered that the army of Cyrus entered the city; and when Belshazzar was slain, a general submission followed. Soon will every impenitent sinner find the writing of God's word brought to pass upon him, whether he is weighed in the balance of the law as a self-righteous Pharisee, or in that of the gospel as a painted hypocrite.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Tekel - This word (תקל  teqēl) is also, according to Gesenius, a passive participle (from תקל  teqal - \"to poise, to weigh\"), and means \"weighed.\" It would be used with reference to anything placed in a balance to ascertain its weight; and hence, like the word \"measure,\" would denote that the extent, dimensions, true worth, or character of anything was ascertained. As by the use of scales the weight of anything is known, so the word is applied to any estimate of character or of actions, and a balance becomes the emblem of justice. Thus God, in his judgments of men, is represented as \"weighing\" their actions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the Lord is a God of knowledge, and by him actions are weighed.\" Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " :",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"O that my grief were thoroughly weighed,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And my calamity laid in the balances together.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And my calamity laid in the balances together.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. weighed in the balances—The Egyptians thought that Osiris weighed the actions of the dead in a literal balance. The Babylonians may have had the same notion, which would give a peculiar appropriateness to the image here used.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "found wanting—too light before God, the weigher of actions (1Sa 2:3; Ps 62:9). Like spurious gold or silver (Jer 6:30).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Thou art weighed in a hanging balance, alluding to the weighing of goods exactly in scales; and God is said to weigh the mountains in scales: it shows his just proceeding; God is not hasty in punishing, but will give just allowance in weighing, he will hold the scales, he will do it fairly before all the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Art found wanting; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thou dost not hold weight, but comest short vastly. There is no weight nor worth in thee. Thou hast made light of God in his honour, people, vessels; and the Lord makes light of thee, thou art reprobate silver, false coin; thou art of no value. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "TEKEL,.... As for the meaning of this word, and what it points at, it is this: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou art weighed in the balances: of justice and truth, in the holy righteous law of God; as gold, and jewels, and precious stones, are weighed in the scales by the goldsmith and jeweller with great exactness, to know the worth of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and art found wanting; found to be adulterated gold, reprobate silver, bad coin, a false stone; found to be a worthless man, a wicked prince, wanting the necessary qualifications of wisdom, goodness, mercy, truth, and justice. The Scriptures of truth, the word of God, contained in the books of the Old and New Testament, are the balances of the sanctuary, in which persons, principles, and practices, are to be weighed; and sad it is where they are found light and wanting: men, both of high and low degree, when put here, are lighter than vanity. The Pharisee, or self-righteous person, when weighed in the balance of God's law, which is holy, just, and good, will be found wanting of that holiness and righteousness he pretends to, and appear to be an unholy and an unrighteous man; his righteousness, neither for the matter of it, nor manner of performing it, being agreeable to that law, and so no righteousness in the sense of it, Deuteronomy 6:25, it being imperfect, and so leaves him to the curse of it, Galatians 3:10, and not being performed in a pure and spiritual manner that it requires, is rejected by it; and miserable will be the case of such a man at the day of judgment, when his works will be found wanting, and not answerable to the demands of a righteous law, and he without the wedding garment of Christ's righteousness, and so naked and speechless. The hypocrite, and formal professor, when weighed in the balance of the Scripture, will be found wanting the true grace of God; his faith will appear to be feigned, and his hope groundless, and his love to be in word and in tongue only, and not at all to answer to the description of true grace given in the word of God; and bad will it be with such persons at last, when at the bridegroom's coming they will be destitute of the oil of true and real grace; only have that which is counterfeit, and the mere lamp of an outward profession, which will then stand them in no stead, or be of any avail unto them: in the same balances are the doctrines and principles of men to be weighed; and, such as are according to them are solid and weighty, and are comparable to gold, silver, and precious stones; but such as are not are light, and like wood, hay, and stubble, which the fire of the word will reveal, try, and burn up, not being able to stand against it; and if these are weighed in the balances, they will be found wanting of real truth and goodness, and be but as chaff to wheat; and what is the one to the other? there is no comparison between them; and dreadful will be the case of false teachers, that make and teach an abomination and a lie; and of those that are given up to believe them, these will not be able to stand the trying hour of temptation, and much less the last and final judgment. Sad for preachers of the word to be found wanting in their ministry, and hearers to be wanting in their duty; not taking care neither what they hear, nor how they hear, or whether they put in practice the good they do hear. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and art found wanting; found to be adulterated gold, reprobate silver, bad coin, a false stone; found to be a worthless man, a wicked prince, wanting the necessary qualifications of wisdom, goodness, mercy, truth, and justice. The Scriptures of truth, the word of God, contained in the books of the Old and New Testament, are the balances of the sanctuary, in which persons, principles, and practices, are to be weighed; and sad it is where they are found light and wanting: men, both of high and low degree, when put here, are lighter than vanity. The Pharisee, or self-righteous person, when weighed in the balance of God's law, which is holy, just, and good, will be found wanting of that holiness and righteousness he pretends to, and appear to be an unholy and an unrighteous man; his righteousness, neither for the matter of it, nor manner of performing it, being agreeable to that law, and so no righteousness in the sense of it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 6:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it being imperfect, and so leaves him to the curse of it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and not being performed in a pure and spiritual manner that it requires, is rejected by it; and miserable will be the case of such a man at the day of judgment, when his works will be found wanting, and not answerable to the demands of a righteous law, and he without the wedding garment of Christ's righteousness, and so naked and speechless. The hypocrite, and formal professor, when weighed in the balance of the Scripture, will be found wanting the true grace of God; his faith will appear to be feigned, and his hope groundless, and his love to be in word and in tongue only, and not at all to answer to the description of true grace given in the word of God; and bad will it be with such persons at last, when at the bridegroom's coming they will be destitute of the oil of true and real grace; only have that which is counterfeit, and the mere lamp of an outward profession, which will then stand them in no stead, or be of any avail unto them: in the same balances are the doctrines and principles of men to be weighed; and, such as are according to them are solid and weighty, and are comparable to gold, silver, and precious stones; but such as are not are light, and like wood, hay, and stubble, which the fire of the word will reveal, try, and burn up, not being able to stand against it; and if these are weighed in the balances, they will be found wanting of real truth and goodness, and be but as chaff to wheat; and what is the one to the other? there is no comparison between them; and dreadful will be the case of false teachers, that make and teach an abomination and a lie; and of those that are given up to believe them, these will not be able to stand the trying hour of temptation, and much less the last and final judgment. Sad for preachers of the word to be found wanting in their ministry, and hearers to be wanting in their duty; not taking care neither what they hear, nor how they hear, or whether they put in practice the good they do hear. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "TEKEL; Thou art weighed in the balances, and art found wanting.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Daniel now read the writing (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and gave its interpretation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:26-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The writing bears the mysterious character of the oracle. פּרס, תּקל, מנא (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are partic. Piel, and the forms תּקל and פּרס, instead of תּקיל and פּריס, are chosen on account of their symphony with מנא. פּרסין is generally regarded as partic. plur., but that would be פּרסין; it much rather appears to be a noun form, and plur. of פּרס  equals  Hebr. פּרס (cf. פּרסיהן, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in the sense of broken pieces, fragments, for פרס signifies to divide, to break in pieces, not only in the Hebr. (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 58:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but also in the Chald., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 4:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Targ.), although in the Targg. The meaning to spread out prevails. In all the three words there lies a double sense, which is brought out in the interpretation. מנא, for the sake of the impression, or perhaps only of the parallelism, is twice given, so as to maintain two members of the verse, each of two words. In the numbering lies the determination and the completion, or the conclusion of a manner, a space of time. Daniel accordingly interprets מנא thus: God has numbered (מנה for מנא, perf. act.) thy kingdom, i.e., its duration or its days, והשׁלמהּ, and has finished it, i.e., its duration is so counted out that it is full, that it now comes to an end. In תּקל there lies the double sense that the word תּקל, to weigh, accords with the Niphal of קלל, to be light, to be found light (cf. תּקל, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The interpretation presents this double meaning: Thou art weighed in the balances (תּקלתּא) and art found too light (like the תּקל). חסּיר, wanting in necessary weight, i.e., deficient in moral worth. תּקלתּא, a perf. formed from the partic. Piel; cf. Winer, 13, 2. As to the figure of the balance, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (9).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For פּרסין (Daniel 5:25) Daniel uses in the interpretation the sing. פּרס, which, after the analogy of תּקל, may be regarded as partic. Piel, and he interprets it accordingly, so that he brings out, along with the meaning lying in the word, also the allusion to פּרס, Persian: thy kingdom is divided, or broken into pieces, and given to the Medes and Persians. The meaning is not that the kingdom was to be divided into two equal parts, and the one part given to the Medes and the other to the Persians; but פרס is to divide into pieces, to destroy, to dissolve the kingdom. This shall be effected by the Medes and Persians, and was so brought about when the Persian Cyrus with the united power of the Medes and Persians destroyed Babylon, and thus put an end to the Chaldean kingdom, whereby the kingdom was transferred first to the Median Darius (Daniel 6:1 [Daniel 5:31]), and after him to the Persian Cyrus. In the naming of the Median before the Persian there lies, as already remarked in the Introduction, a notable proof of the genuineness of this narrative, and with it of the whole book; for the hegemony of the Medes was of a very short duration, and after its overthrow by the Persians the form of expression used is always \"Persians and Medes,\" as is found in the book of Esther. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For פּרסין (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") Daniel uses in the interpretation the sing. פּרס, which, after the analogy of תּקל, may be regarded as partic. Piel, and he interprets it accordingly, so that he brings out, along with the meaning lying in the word, also the allusion to פּרס, Persian: thy kingdom is divided, or broken into pieces, and given to the Medes and Persians. The meaning is not that the kingdom was to be divided into two equal parts, and the one part given to the Medes and the other to the Persians; but פרס is to divide into pieces, to destroy, to dissolve the kingdom. This shall be effected by the Medes and Persians, and was so brought about when the Persian Cyrus with the united power of the Medes and Persians destroyed Babylon, and thus put an end to the Chaldean kingdom, whereby the kingdom was transferred first to the Median Darius (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " [",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "]), and after him to the Persian Cyrus. In the naming of the Median before the Persian there lies, as already remarked in the Introduction, a notable proof of the genuineness of this narrative, and with it of the whole book; for the hegemony of the Medes was of a very short duration, and after its overthrow by the Persians the form of expression used is always \"Persians and Medes,\" as is found in the book of Esther. ",
            "children": []
          }
        ]
      }
    ]
  }
]