[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the same hour—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", suddenly and unexpectedly. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Observe that it was only a portion of the hand that the king saw (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that we are not told whether the guests saw the hand or not. That the writing was visible to all is plain from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We remark here, as in other supernatural manifestations recorded in Scripture, that a portion only has been witnessed by many, while the whole has been seen only by one or by a few. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:28-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Candlestick.—This, of course, would make both the hand and the writing more distinctly visible to the king.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Candlestick.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This, of course, would make both the hand and the writing more distinctly visible to the king.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Plaister.—This was invariably used in the inner chamber of the Assyrian and Babylonian palaces. (See Layard, Nineveh and Babylon, p. 529.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Plaister.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This was invariably used in the inner chamber of the Assyrian and Babylonian palaces. (See Layard, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Nineveh and Babylon,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " p. 529.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 5:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the same hour — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "At the very time; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "came forth fingers of a man’s hand — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The likeness of a man’s hand; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and wrote over against the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "candlestick — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The angel Gabriel, say the rabbins, directing this hand, and writing by it. Belshazzar seems to have filled up the measure of his iniquity, by this act of gross impiety and dishonour done to the true God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the king saw — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It seems, first saw; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the part of the hand that wrote — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is probable this candlestick was a hanging sconce, near the king, and that the light it cast made him see the hand while it was writing, as well as the writing which remained on the wall. His seeing the hand, but not the person whose hand it was, made the thing more frightful. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then the king’s countenance was changed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — His face became pale with terror: for although he could not read the writing, and therefore did not know what was its purport, yet a sense of guilt made him forebode that the words had some dreadful meaning; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and his thoughts troubled him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His remorse of conscience respecting the past, and his fearful apprehensions with regard to the future; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so that the joints of his loins were loosed — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He discovered the disorder of his mind by the trembling which seized his whole body. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And his knees smote one against another — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So soon can the terrors of God shake the loftiest cedars, and terrify the tyrants of the earth! Thus can the Lord spoil the mad mirth of drunken atheists in a moment! “The expressions in this verse, in a collected view, contain such a description of terror as is rarely to be met with; the dead change of the countenance, the perturbation of the thoughts, the joints of the loins becoming relaxed, and the knees smiting against each other, are very strong indications of horror. Horace has, ‘Et corde et genibus tremit;’ and Virgil, ‘Tarda trementi genua labant;’ but these are far inferior to the picturesque description of Daniel.” — Wintle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-9 Belshazzar bade defiance to the judgments of God. Most historians consider that Cyrus then besieged Babylon. Security and sensuality are sad proofs of approaching ruin. That mirth is sinful indeed, which profanes sacred things; and what are many of the songs used at modern feasts better than the praises sung by the heathens to their gods! See how God struck terror upon Belshazzar and his lords. God's written word is enough to put the proudest, boldest sinner in a fright. What we see of God, the part of the hand that writes in the book of the creatures, and in the book of the Scriptures, should fill us with awful thoughts concerning that part which we do not see. If this be the finger of God, what is his arm when made bare? And what is He? The king's guilty conscience told him that he had no reason to expect any good news from heaven. God can, in a moment, make the heart of the stoutest sinner to tremble; and there needs no more than to let loose his own thoughts upon him; they will give him trouble enough. No bodily pain can equal the inward agony which sometimes seizes the sinner in the midst of mirth, carnal pleasures, and worldly pomp. Sometimes terrors cause a man to flee to Christ for pardon and peace; but many cry out for fear of wrath, who are not humbled for their sins, and who seek relief by lying vanities. The ignorance and uncertainty concerning the Holy Scriptures, shown by many who call themselves wise, only tend to drive sinners to despair, as the ignorance of these wise men did.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the same hour - On the word \"hour,\" see the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Came forth fingers of a man's hand - Not the whole hand, but only the parts usually employed in writing. Not a man writing; not even an arm, but fingers that seemed to move themselves. They appeared to come forth from the walls, and were seen before they began to write. It was this that made it so impressive and alarming. It could not be supposed that it was the work of man, or that it was devised by man for the purpose of producing consternation. It was perfectly manifest to all who were there that this was the work of some one superior to man; that it was designed as a Divine intimation of some kind in regard to the scene that was then occurring. But whether as a rebuke for the sin of revelry and dissipation, or for sacrilege in drinking out of the consecrated vessels, or whether it was an intimation of some approaching fearful calamity, would not at once be apparent. It is easy to imagine that it would produce a sudden pause in their revelry, and diffuse seriousness over their minds.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The suddenness of the appearance; the fingers, unguided by the hand of man, slowly writing in mysterious characters on the wall; the conviction which must have flashed across the mind that this must be either to rebuke them for their sin, or to announce some fearful calamity, all these things must have combined to produce an overwhelming effect on the revellers. Perhaps, from the prevalent views in the pagan world in regard to the crime of sacrilege, they may have connected this mysterious appearance with the profane act which they were then committing - that of desecrating the vessels of the temple of God. How natural would it be to suppose - recognizing as they did the gods of other nations as real, as truly as those which they worshipped - that the God of the Hebrews, seeing the vessels of his worship profaned, had come forth to express his displeasure, and to intimate that there was impending wrath for such an act.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The crime of sacrilege was regarded among the pagan as one of the most awful which could be committed, and there was no state of mind in which men would be more likely to be alarmed than when they were, even in the midst of scenes of drunken revelry, engaged in such an act. \"The pagan,\" says Grotius, \"thought it a great impiety to convert sacred things to common uses.\" Nuerous instances are on record of the sentiments entertained among the pagan on the subject of sacrilege, and of the calamities which were believed to come upon men as a punishment for it. Among them we may refer to the miserable end of the Phocians, who robbed the temple of Delphos, and whose act was the occasion of that war which was called the Holy War; the destruction of the Gauls in their attempt upon the same temple; and of Crassus, who plundered the temple of Jerusalem, and that of the Syrian goddess. - See Lowth, in loc. That a conviction of the sin of sacrilege, according to the prevalent belief on the subject, may have contributed to produce consternation when the fingers of the hand appeared at Belshazzar's feast, there is no good reason to doubt, and we may suppose that the minds of the revellers were at once turned to the insult which they had thus offered to the God of the Hebrews.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And wrote over against the candlestick - The candlestick, or lamp-bearer, perhaps, which had been taken from the temple at Jerusalem, and which was, as well as the sacred vessels, introduced into this scene of revelry. It is probable that as they brought out the vessels of the temple to drink in, they would also bring out all that had been taken from the temple in Jerusalem. Two objects may have been contemplated in the fact that the writing was \"over against the candlestick;\" one was that it might be clearly visible, the other that it might be more directly intimated that the writing was a rebuke for the act of sacrilege. On the probable situation where this miracle occurred, the reader may consult Taylor's \"Fragments to Calmet's Dictionary,\" No. 205. He supposes that it was one of the large inner courts of the palace - that part of the palace which was prohibited to persons not sent for. See the note at Daniel 5:10.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And wrote over against the candlestick - The candlestick, or lamp-bearer, perhaps, which had been taken from the temple at Jerusalem, and which was, as well as the sacred vessels, introduced into this scene of revelry. It is probable that as they brought out the vessels of the temple to drink in, they would also bring out all that had been taken from the temple in Jerusalem. Two objects may have been contemplated in the fact that the writing was \"over against the candlestick;\" one was that it might be clearly visible, the other that it might be more directly intimated that the writing was a rebuke for the act of sacrilege. On the probable situation where this miracle occurred, the reader may consult Taylor's \"Fragments to Calmet's Dictionary,\" No. 205. He supposes that it was one of the large inner courts of the palace - that part of the palace which was prohibited to persons not sent for. See the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Upon the plaster of the wall - The Chaldee word means \"lime,\" not inappropriately rendered here \"plaster.\" The \"manner\" of the writing is not specified. All that is necessary to suppose is, that the letters were traced along on the wall so as to be distinctly visible. Whether they seemed to be cut into the plaster, or to be traced in black lines, or lines of light, is not mentioned, and is immaterial. They were such as could be seen distinctly by the king and the guests. Compare, however, the remarks of Taylor in the \"Fragment\" just referred to.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the king saw the part of the hand that wrote - It is not necessary to suppose that the others did not see it also, but the king was the most important personage there, and the miracle was intended particularly for him. Perhaps his eyes were first attracted to it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the king saw the part of the hand that wrote - It is not necessary to suppose that the others did not see it also, but the king was the most important personage there, and the miracle was intended particularly for him. Perhaps his eyes were first attracted to it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. In the same hour—that the cause of God's visitation might be palpable, namely, the profanation of His vessels and His holy name.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fingers of … hand—God admonishes him, not by a dream (as Nebuchadnezzar had been warned), or by a voice, but by \"fingers coming forth,\" the invisibility of Him who moved them heightening the awful impressiveness of the scene, the hand of the Unseen One attesting his doom before the eyes of himself and his guilty fellow revellers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "against the candlestick—the candelabra; where the mystic characters would be best seen. Barnes makes it the candlestick taken from the temple of Jerusalem, the nearness of the writing to it intimating that the rebuke was directed against the sacrilege.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "upon the plaster of the wall of the king's palace—Written in cuneiform letters on slabs on the walls, and on the very bricks, are found the perpetually recurring recital of titles, victories, and exploits, to remind the spectator at every point of the regal greatness. It is significant, that on the same wall on which the king was accustomed to read the flattering legends of his own magnificence, he beholds the mysterious inscription which foretells his fall (compare Pr 16:18; Ac 12:21-23).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "part of the hand—the anterior part, namely, the fingers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the same hour:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by this it did appear what was the cause of the king’s punishment and ruin, namely, his reproaching of God and profaning the holy vessels. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Fingers of a man’s hand; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the likeness of a man’s hand, which Rabbi Solomon saith was managed by the angel Gabriel; it is clear it was immediately from God. This was a plainer testimony then that of his father’s dream, for hereof were above a thousand witnesses, besides his conscience that shook him, a thousand more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Over against the candlestick",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by this it appears how the feast continued far in the night in which Babylon was taken and Belshazzar slain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 5:30",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:30",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The king saw the part of the hand that wrote:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God intended it for him, and that he should see it with his own eyes, and it should not be brought him by report, which affords ground of doubting; but here was undeniable proof and conviction, the visible hand of God was here; and it was also for terror to him, and spoiled his draughts of wine, and was a cooler to their jollities. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the same hour came forth fingers of a man's hand, &c. From heaven, as Jarchi; or they came forth as if they came out of the wall: this was done by the power of God, though it might be by the intervention or means of an angel; so Josephus Ben Gorion (i) says, that an angel came and wrote what follows; and Saadiah says it was Gabriel, called a man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but this is conjecture; however, at the very time the king and his nobles were feasting and revelling, praising their idols, and reproaching the God of Israel, this wonderful phenomenon appeared: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and wrote over against the candlestick, upon the plaster of the wall of the king's palace; this candlestick was either upon the table, as Saadiah; or affixed to the wall, or hung as a chandelier in the midst of the hall; or, be it where it will, right over against it this hand appeared, and wrote, that, by the light of it, it might be clearly and distinctly seen: though Gussetius (k) thinks, not a candlestick, but a \"buffet\", is meant; where stood the drinking cups and vessels, and which he takes to be more agreeable to the signification of the word; and moreover observes, that it is not likely this feast should be made in the night, or at least it is not certain it was, or that it was yet night when this affair happened: however, this writing was upon the plaster of the wall, made of lime, and was white; and if the writing was with red colour, as Ben Gorion says, it was the more visible: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the king saw the part of the hand that wrote; the back part of the hand; had he only seen a writing, but no hand writing it, he might have thought it was done by some present; but seeing a hand, and only part of one, or however not any other members of the body of a man, nor a man himself, it struck him with surprise, and he concluded at once there was something extraordinary in it; whether any other saw the hand besides himself is not certain; however, he saw it for whom it was particularly designed. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Hist. l. 1. c. 5. p. 24. (k) Ebr. Comment. p. 424. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) Hist. l. 1. c. 5. p. 24. (k) Ebr. Comment. p. 424. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "In the same hour came forth fingers of a man's hand, and wrote over {e} against the candlestick upon the plaister of the wall of the king's palace: and the king saw the part of the hand that wrote.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the same hour came forth fingers of a man's hand, and wrote over ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " against the candlestick upon the plaister of the wall of the king's palace: and the king saw the part of the hand that wrote.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) That it might the better be seen.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the same hour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] in the midst of their godless revelry (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 5:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). Cf. for the expression ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "over against",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in front of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "opposite to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the candlestick",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and hence a part of the wall where the light was particularly bright.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the plaister",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the chalk",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The place was consequently white: and any dark object moving upon it would be immediately visible. In the great halls of Babylonian palaces the brick walls were probably, as in the palaces of Assyria, lined to a height of 10–12 ft. above the ground with slabs of a kind of alabaster, ornamented with elaborate bas-reliefs, and often brilliantly coloured (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 23:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): in their upper part, also, the walls seem to have been usually painted, but the plaster may sometimes have been left white. Comp. Layard, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nineveh and its Remains",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "5, i. 254–7, 262 f., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nineveh and Babylon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 651, Rawl., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Anc. Mon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".4 ii. 283.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the part",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "palm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "or",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "hollow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the word (in the fem.) is used in the Targums and in Syriac in this sense (e.g. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). “We must suppose the hand to have appeared above the place where the king was reclining” (Bevan).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the same hour oame forth fingers of a man's hand, and wrote over against the candlestick upon the plaster of the wall of the king's palace: and the king saw the part of the hand that wrote",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The two versions given in the Septuagint here do not seriously differ from each other or from the Massoretic text, only that they both omit \"the part of,\" and represent the king as seeing the hand. Theodotion has ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀστραγάλους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which maybe rendered \"finger-joints;\" otherwise this version is very like both the Massoretic and the LXX. The Peshitta presents no point of remark. The word translated \"lamp\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nebhrashta",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") became in Talmudic times the equivalent of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "menoorah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the golden candlestick.\" From this it has been supposed that \"the candlestick\" was the golden candlestick which later proved the crowining glory of Titus's triumph, and is still to be seen carved on his arch. When the other vessels of the house of the Lord were brought to deck the table of the monarch, it would not be unnatural that the golden candlestick should also be brought. In the great hall in which a thousand guests were accommodated, more lamps than one would be required. The Septuagint (text) adds, \"over against the king:\" this would individualize the lamp referred to; but there does not seem to be any support for this reading, which may be due to the desire to explain the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "satatus emphaticus.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Gesenius derives the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נֶבְרַשְׁתָּא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נור",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "light",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אש",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"flame.\" As ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a consonant was unused in Assyrian, this derivation is by no means impossible We know that the Ninevite monarchs surrounded the great halls of their palaces with ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "bas-reliefs",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of their victories. The remains of Babylon have not given us anything like  the gypsum slabs of Kouyounjik. Yet the Babylonian monarchs not unlikely followed the same praetices as those of Nineveh. The walls were built and plastered, and then the slabs were moved up to them. In the case of Belshazzar, the palace walls might well be fresh; no gypsum slabs had yet recorded his prowess. As he looks to the white plaster, the fingers of a hand come out of the darkness, and write opposite him. \"The king,\" thus it is in the Massoretic text, saw the \"part\" of the hand that wrote. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Pas",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the word. Furst renders it \"wrist;\" Gesenius, \"the extremity;\" Winer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vola manus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" the hollow of the baud;\" with this Buxtorf agrees. The balance of meanings seems to be in favour of \"hollow of the hand,\" only it is difficult to understand the position of the hand relatively to the king when he saw the hollow of the hand. The smoke from the numerous lamps would obscure the roof of the hall of the palace; however numerous the lamps, their light would be unable to pierce the darkness, so out of the darkness came the hand. Daniel 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In this verse the expression they drank wine is repeated for the purpose of making manifest the connection between the drinking and the praising of the gods. The wickedness lay in this, that they drank out of the holy vessels of the temple of the God of Israel to glorify (שׁבּח, to praise by the singing of songs) their heathen gods in songs of praise. In doing this they did not only place \"Jehovah on a perfect level with their gods\" (Hvernick), but raised them above the Lord of heaven, as Daniel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") charged the king. The carrying away of the temple vessels to Babylon and placing them in the temple of Bel was a sign of the defeat of the God to whom these vessels were consecrated (see under ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the use of these vessels in the drinking of wine at a festival, amid the singing of songs in praise of the gods, was accordingly a celebrating of these gods as victorious over the God of Israel. And it was not a spirit of hostility aroused against the Jews which gave occasion, as Kranichfeld has well remarked, to this celebration of the victory of his god; but, as the narrative informs us, it was the reckless madness of the drunken king and of his drunken guests (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") during the festival which led them to think of the God of the Jews, whom they supposed they had subdued along with His people, although He had by repeated miracles forced the heathen world-rulers to recognise His omnipotence (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ":, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "], 31 [34], 34 [37]). In the disregard of these revelations consisted, as Daniel represents to Belshazzar (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the dishonour done to the Lord of heaven, although these vessels of the sanctuary might have been profaned merely by using them as common drinking vessels, or they might have been used also in religious libations as vessels consecrated to the gods, of which the text makes no mention, although the singing of songs to the praise of the gods along with the drinking makes the offering of libations very probable. The six predicates of the gods are divided by the copula  וinto two classes: gold and silver - brass, iron, wood and stone, in order to represent before the eyes in an advancing degree the vanity of these gods. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Daniel 5:4 ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The warning signs, the astonishment of Belshazzar, the inability of the wise men to give counsel, and the advice of the queen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Daniel 5:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:4",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Unexpectedly and suddenly the wanton mad revelry of the king and his guests was brought to a close amid terror by means of a warning sign. The king saw the finger of a man's hand writing on the plaster of the wall of the festival chamber, and he was so alarmed that his whole body shook. The בּהּ־שׁעתא places the sign in immediate connection with the drinking and the praising of the gods. The translation, in the self-same hour, is already shown to be inadmissible (see under Daniel 3:6). The Kethiv נפקוּ (came forth) is not to be rejected as the indefinite determination of the subject, because the subject follows after it; the Keri נפקה is to be rejected, because, though it suits the gender, it does not in respect of number accord with the subject following. The king does not see the whole hand, but only ידא פּס, the end of the hand, that is, the fingers which write. This immediately awakened the thought that the writing was by a supernatural being, and alarmed the king out of his intoxication. The fingers wrote on the plaster of the wall over against the candlestick which stood on the table at which the king sat, and which reflected its light perceptibly on the white wall opposite, so that the fingers writing could be distinctly seen. The feast had been prolonged into the darkness of the night, and the wall of the chamber was not wainscotted, but only plastered with lime, as such chambers are found in the palaces of Nimrud and Khorsabad covered over only with mortar (cf. Layard's Nineveh and Babylon). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Unexpectedly and suddenly the wanton mad revelry of the king and his guests was brought to a close amid terror by means of a warning sign. The king saw the finger of a man's hand writing on the plaster of the wall of the festival chamber, and he was so alarmed that his whole body shook. The בּהּ־שׁעתא places the sign in immediate connection with the drinking and the praising of the gods. The translation, in the self-same hour, is already shown to be inadmissible (see under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The Kethiv נפקוּ (came forth) is not to be rejected as the indefinite determination of the subject, because the subject follows after it; the Keri נפקה is to be rejected, because, though it suits the gender, it does not in respect of number accord with the subject following. The king does not see the whole hand, but only ידא פּס, the end of the hand, that is, the fingers which write. This immediately awakened the thought that the writing was by a supernatural being, and alarmed the king out of his intoxication. The fingers wrote on the plaster of the wall over against the candlestick which stood on the table at which the king sat, and which reflected its light perceptibly on the white wall opposite, so that the fingers writing could be distinctly seen. The feast had been prolonged into the darkness of the night, and the wall of the chamber was not wainscotted, but only plastered with lime, as such chambers are found in the palaces of Nimrud and Khorsabad covered over only with mortar (cf. Layard's Nineveh and Babylon). ",
            "children": []
          }
        ]
      }
    ]
  }
]