[{"header":"Simon, James and John become Jesus’ followers"},{"num":1,"verse":"One day the people were crowding closely round Jesus to hear God’s message, as he stood on the shore of Lake Gennesaret. Jesus noticed two boats drawn up on the beach, for the fishermen had left them there while they were cleaning their nets. He went aboard one of the boats, which belonged to Simon, and asked him to push out a little from the shore. Then he sat down and continued his teaching of the crowds from the boat."},{"num":4,"verse":"When he had finished speaking, he said to Simon, “Push out now into deep water and let down your nets for a catch.”"},{"num":5,"verse":"Simon replied, “Master! We’ve worked all night and never caught a thing, but if you say so, I’ll let the nets down.”"},{"num":6,"verse":"And when they had done this, they caught an enormous shoal of fish—so big that the nets began to tear. So they signalled to their friends in the other boats to come and help them. They came and filled both the boats to sinking point. When Simon Peter saw this, he fell on his knees before Jesus and said, “Keep away from me, Lord, for I’m only a sinful man!”"},{"num":9,"verse":"For he and his companions (including Zebedee’s sons, James and John, Simon’s partners) were staggered at the haul of fish that they had made. Jesus said to Simon, “Don’t be afraid, Simon. From now on your catch will be men.”"},{"num":11,"verse":"So they brought the boats ashore, left everything and followed him."},{"header":"Jesus cures leprosy"},{"num":12,"verse":"While he was in one of the towns, Jesus came upon a man who was a mass of leprosy. When he saw Jesus, he prostrated himself before him and begged, “If you want to, Lord, you can make me clean.”"},{"num":13,"verse":"Jesus stretched out his hand, placed it on the leper, saying, “Certainly I want to. Be clean!”"},{"num":14,"verse":"Immediately the leprosy left him and Jesus warned him not to tell anybody, but to go and show himself to the priest and to make the offerings for his recovery that Moses prescribed, as evidence to the authorities."},{"num":15,"verse":"Yet the news about him spread all the more, and enormous crowds collected to hear Jesus and to be healed of their diseases. But he slipped quietly away to deserted places for prayer."},{"header":"Jesus cures a paralytic in soul and body"},{"num":17,"verse":"One day while Jesus was teaching, some Pharisees and experts in the Law were sitting near him. They had come out of every village in Galilee and Judea as well as from Jerusalem. God’s power to heal people was with him. Soon some men arrived carrying a paralytic and they kept trying to carry him in to put him down in front of Jesus. When they failed to find a way of getting him in because of the dense crowd, they went up on to the top of the house and let him down, bed and all, through the tiles, into the middle of the crowd in front of Jesus. When Jesus saw their faith, he said to the man, “My friend, your sins are forgiven.”"},{"num":21,"verse":"The scribes and the Pharisees began to argue about this, saying, “Who is this man who talks blasphemy? Who can forgive sins? Only God can do that.”"},{"num":22,"verse":"Jesus realised what was going on in their minds and spoke straight to them."},{"num":23,"verse":"“Why must you argue like this in your minds? Which do you suppose is easier—to say, ‘Your sins are forgiven’ or to say, ‘Get up and walk’? But to make you realise that the Son of Man has full authority on earth to forgive sins—I tell you,” he said to the man who was paralysed, “get up, pick up your bed and go home!”"},{"num":25,"verse":"Instantly the man sprang to his feet before their eyes, picked up the bedding on which he used to lie, and went off home, praising God. Sheer amazement gripped every man present, and they praised God and said in awed voices, “We have seen incredible things today.”"},{"header":"Jesus calls Levi to be his disciple"},{"num":27,"verse":"Later on, Jesus went out and looked straight at a tax-collector called Levi, as he sat at his office desk. “Follow me,” he said to him."},{"num":28,"verse":"And he got to his feet at once, left everything behind and followed him."},{"num":29,"verse":"Then Levi gave a big reception for Jesus in his own house, and there was a great crowd of tax-collectors and others at table with them. The Pharisees and their companions the scribes kept muttering indignantly about this to Jesus’ disciples, saying, “Why do you have your meals with tax-collectors and sinners?”"},{"num":31,"verse":"Jesus answered them, “It is not the healthy who need the doctor, but those who are ill. I have not come to invite the ‘righteous’ but the ‘sinners’—to change their ways."},{"header":"Jesus hints at who he is"},{"num":33,"verse":"Then people said to him, “Why is it that John’s disciples are always fasting and praying, just like the Pharisees’ disciples, but yours both eat and drink?”"},{"num":34,"verse":"Jesus answered, “Can you expect wedding-guests to fast while they have the bridegroom with them? The day will come when they will lose the bridegroom; that will be the time for them to fast!”"},{"num":36,"verse":"Then he gave them this illustration. “Nobody tears a piece from a new coat to patch up an old one. If he does, he ruins the new one and the new piece does not match the old."},{"num":37,"verse":"“Nobody puts new wine into old wineskins. If he does, the new wine will burst the skins—the wine will be spilt and the skins ruined. No, new wine must be put into new wineskins. Of course, nobody who has been drinking old wine will want the new at once. He is sure to say, ‘The old is a good sound wine.’”"}]