[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In a dry and thirsty ground.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Such was Babylon to Israel in its national relations, and even after the return from the exile the Jews never rose again to much importance among the nations of the earth; but meantime they were being disciplined, that at least a few of them might be prepared for the planting among them of that kingdom not of this world, spoken of at the close of Ezekiel 16, which should fill the whole earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:10-14 Jerusalem was a vine, flourishing and fruitful. This vine is now destroyed, though not plucked up by the roots. She has by wickedness made herself like tinder to the sparks of God's wrath, so that her own branches serve as fuel to burn her. Blessed be God, one Branch of the vine here alluded to, is not only become a strong rod for the sceptre of those that rule, but is Himself the true and living Vine. This shall be for a rejoicing to all the chosen people of God throughout all generations.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This is a dirge; and therefore that which is foreseen by the prophet, the capture and burning of Jerusalem, is described as already accomplished. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. planted—that is, transplanted. Though already \"dried up\" in regard to the nation generally, the vine is said to be \"transplanted\" as regards God's mercy to the remnant in Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "dry … ground—Chaldea was well-watered and fertile; but it is the condition of the captive people, not that of the land, which is referred to.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And now; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at this present time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "She is planted; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but, alas! how unlike what she was! a brand pulled out of the burnings, a few of the branches of the last pruning, or a few smaller roots taken up by the provident hand of the Lord of the vineyard, a remnant that might be a nursery, a seedplot; but the much greater part of the vine is, as said, destroyed. It is not said who planted them, but it is easy to conjecture Nebuchadnezzar planted them in policy and for his advantage, they planted themselves out of necessity, and God planted them there in just correcting mercy, and will give them root, and make them thrive, and transplant them after seventy years, and set them on the mountains of Israel again. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the wilderness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so it was to the Jews, a forlorn, dangerous, and necessitous state: though Babylon was in a very fruitful place, yet the savage cruelty and the insulting pride of the Babylonians made it to the Jews as terrible as a wilderness; besides, there were some barren places of this kingdom, to which some of the Jews might be carried and confined. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Dry:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this and the other expression are a description of the nature of a wilderness, and illustrate what the prophet had spoken, or may be paraphrased by that of David, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 63:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 63:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; it was dry and thirsty, where no one stream ran from that river which made glad the city of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 46:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And now she is planted in the wilderness,.... In the land of Babylon, which though a very fruitful country, yet, because of the hardships and miseries which the Jews were exposed unto in it, was a wilderness to them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in a dry and thirsty ground; which is a periphrasis or description of a wilderness, Psalm 63:1; and designs the same place as before; where the Jews were deprived of their liberties, and had not the opportunities of divine worship, the word and ordinances; and were destitute of the comforts both of civil and religious life. Unless this is to be understood of the land of Judea, which by the devastation made in it by the king of Babylon, and the multitudes that were carried captive by him out of it, it became like a desert, a dry and thirsty land; and so the vine planted in it signifies the remainder of the people left in it, alter this great destruction; when it looked like a vine plucked up, and thrown down, and left on the ground, dried up with the east wind, and burnt with fire; and thus it fared with the remnant in a little time after, as the next words show. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in a dry and thirsty ground; which is a periphrasis or description of a wilderness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 63:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and designs the same place as before; where the Jews were deprived of their liberties, and had not the opportunities of divine worship, the word and ordinances; and were destitute of the comforts both of civil and religious life. Unless this is to be understood of the land of Judea, which by the devastation made in it by the king of Babylon, and the multitudes that were carried captive by him out of it, it became like a desert, a dry and thirsty land; and so the vine planted in it signifies the remainder of the people left in it, alter this great destruction; when it looked like a vine plucked up, and thrown down, and left on the ground, dried up with the east wind, and burnt with fire; and thus it fared with the remnant in a little time after, as the next words show. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And now she is planted in the wilderness, in a dry and thirsty ground.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The deportation of the people from their own land into conditions where national life cannot thrive.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ezekiel 19:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Destruction of the Kingdom, and Banishment of the People",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 19:10. Thy mother was like a vine, planted by the water in thy repose; it became a fruitful and rich in tendrils from many waters. Ezekiel 19:11. And it had strong shoots for rulers' sceptres; and its growth ascended among the clouds, and was visible in its height in the multitude of its branches. Ezekiel 19:12. Then it was torn up in fury, cast to the ground, and the east wind dried up its fruit; its strong shoots were broken off, and withered; fire devoured them. Ezekiel 19:13. And now it is planted in the desert, in a dry and thirsty land. Ezekiel 19:14. There goeth out fire from the shoot of its branches, devoureth its fruit, so that there is no more a strong shoot upon it, a sceptre for ruling. - A lamentation it is, and it will be for lamentation. - From the lamentable fate of the princes transported to Egypt and Babylon, the ode passes to a description of the fate, which the lion-like rapacity of the princes is preparing for the kingdom and people. Israel resembled a vine planted by the water. The difficult word בּדמך we agree with Hvernick and Kliefoth in tracing to the verb דּמה, to rest (Jeremiah 14:17), and regard it as synonymous with בּדמי in Isaiah 38:10 : \"in thy repose,\" i.e., in the time of peaceful, undisturbed prosperity. For neither of the other renderings, \"in thy blood\" and \"in thy likeness,\" yields a suitable meaning. The latter explanation, which originated with Raschi and Kimchi, is precluded by the fact that Ezekiel always uses the word דּמוּת to express the idea of resemblance. - For the figure of the vine, compare Psalm 80:9. This vine sent out strong shoots for rulers' sceptres; that is to say, it brought forth powerful kings, and grew up to a great height, even into the clouds. עבתים signifies \"cloud,\" lit., thicket of clouds, not only here, but in Ezekiel 31:3, Ezekiel 31:10,Ezekiel 31:14. The rendering \"branches\" or \"thicket of foliage\" is not suitable in any of these passages. The form of the word is not to be taken as that of a new plural of עבות, the plural of עב, which occurs in 2 Samuel 23:4 and Psalm 77:18; but is the plural of עבות, an interlacing or thicket of foliage, and is simply transferred to the interlacing or piling up of the clouds. The clause 'ויּרא וגו, and it appeared, was seen, or became visible, simply serves to depict still further the glorious and vigorous growth, and needs no such alteration as Hitzig proposes. This picture is followed in Ezekiel 19:12., without any particle of transition, by a description of the destruction of this vine. It was torn up in fury by the wrath of God, cast down to the ground, so that its fruit withered (compare the similar figures in Ezekiel 17:10). מטּה עזּהּ is used collectively, as equivalent to מטּות עז (Ezekiel 19:11); and the suffix in אכלתהוּ is written in the singular on account of this collective use of מטּה. The uprooting ends in the transplanting of the vine into a waste, dry, unwatered land, - in other words, in the transplanting of the people, Israel, into exile. The dry land is Babylon, so described as being a barren soil in which the kingdom of God could not flourish. According to Ezekiel 19:14, this catastrophe is occasioned by the princes. The fire, which devours the fruit of the vine so that it cannot send out any more branches, emanates ממּטּה בדּיה, from the shoot of its branches, i.e., from its branches, which are so prolific in shoots. מטּה is the shoot which grew into rulers' sceptres, i.e., the royal family of the nation. The reference is to Zedekiah, whose treacherous breach of covenant (Ezekiel 17:15) led to the overthrow of the kingdom and of the earthly monarchy. The picture from Ezekiel 19:12 onwards is prophetic. The tearing up of the vine, and its transplantation into a dry land, had already commenced with the carrying away of Jeconiah; but it was not completed till the destruction of Jerusalem and the carrying away of Zedekiah, which were still in the future at the time when these words were uttered. - The clause 'קינה היא  does not contain a concluding historical notice, as Hהvernick supposes, but simply the finale of the lamentation, indicating the credibility of the prediction which it contains. ותּהי is prophetic, like the perfects from ותּתּשׁ in Ezekiel 19:12 onwards; and the meaning is this: A lamentation forms the substance of the whole chapter; and it will lead to lamentation, when it is fulfilled. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Thy mother was like a vine, planted by the water in thy repose; it became a fruitful and rich in tendrils from many waters. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And it had strong shoots for rulers' sceptres; and its growth ascended among the clouds, and was visible in its height in the multitude of its branches. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Then it was torn up in fury, cast to the ground, and the east wind dried up its fruit; its strong shoots were broken off, and withered; fire devoured them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And now it is planted in the desert, in a dry and thirsty land. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There goeth out fire from the shoot of its branches, devoureth its fruit, so that there is no more a strong shoot upon it, a sceptre for ruling. - A lamentation it is, and it will be for lamentation. - From the lamentable fate of the princes transported to Egypt and Babylon, the ode passes to a description of the fate, which the lion-like rapacity of the princes is preparing for the kingdom and people. Israel resembled a vine planted by the water. The difficult word בּדמך we agree with Hvernick and Kliefoth in tracing to the verb דּמה, to rest (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 14:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and regard it as synonymous with בּדמי in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"in thy repose,\" i.e., in the time of peaceful, undisturbed prosperity. For neither of the other renderings, \"in thy blood\" and \"in thy likeness,\" yields a suitable meaning. The latter explanation, which originated with Raschi and Kimchi, is precluded by the fact that Ezekiel always uses the word דּמוּת to express the idea of resemblance. - For the figure of the vine, compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 80:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This vine sent out strong shoots for rulers' sceptres; that is to say, it brought forth powerful kings, and grew up to a great height, even into the clouds. עבתים signifies \"cloud,\" lit., thicket of clouds, not only here, but in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 31:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 31:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 31:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The rendering \"branches\" or \"thicket of foliage\" is not suitable in any of these passages. The form of the word is not to be taken as that of a new plural of עבות, the plural of עב, which occurs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but is the plural of עבות, an interlacing or thicket of foliage, and is simply transferred to the interlacing or piling up of the clouds. The clause 'ויּרא וגו, and it appeared, was seen, or became visible, simply serves to depict still further the glorious and vigorous growth, and needs no such alteration as Hitzig proposes. This picture is followed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., without any particle of transition, by a description of the destruction of this vine. It was torn up in fury by the wrath of God, cast down to the ground, so that its fruit withered (compare the similar figures in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). מטּה עזּהּ is used collectively, as equivalent to מטּות עז (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and the suffix in אכלתהוּ is written in the singular on account of this collective use of מטּה. The uprooting ends in the transplanting of the vine into a waste, dry, unwatered land, - in other words, in the transplanting of the people, Israel, into exile. The dry land is Babylon, so described as being a barren soil in which the kingdom of God could not flourish. According to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", this catastrophe is occasioned by the princes. The fire, which devours the fruit of the vine so that it cannot send out any more branches, emanates ממּטּה בדּיה, from the shoot of its branches, i.e., from its branches, which are so prolific in shoots. מטּה is the shoot which grew into rulers' sceptres, i.e., the royal family of the nation. The reference is to Zedekiah, whose treacherous breach of covenant (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 17:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") led to the overthrow of the kingdom and of the earthly monarchy. The picture from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " onwards is prophetic. The tearing up of the vine, and its transplantation into a dry land, had already commenced with the carrying away of Jeconiah; but it was not completed till the destruction of Jerusalem and the carrying away of Zedekiah, which were still in the future at the time when these words were uttered. - The clause 'קינה היא  does not contain a concluding historical notice, as Hהvernick supposes, but simply the finale of the lamentation, indicating the credibility of the prediction which it contains. ותּהי is prophetic, like the perfects from ותּתּשׁ in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " onwards; and the meaning is this: A lamentation forms the substance of the whole chapter; and it will lead to lamentation, when it is fulfilled. ",
            "children": []
          }
        ]
      }
    ]
  }
]