[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he was accepted.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The historian here calls especial attention to the strange power David was able to acquire over the hearts of men. It was not only over Saul and his great son that he rapidly won influence, but in the case of his colleagues at the Court and in the army, all of whom he was rapidly outstripping in the race for honour and distinction, he seems to have disarmed all jealousy. His rapid rise to high position was evidently looked upon with general favour. This is still farther enlarged upon in the next and following verses.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A SOUL’S TRAGEDY1 Samuel 18:5 - 1 Samuel 18:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A SOUL’S TRAGEDY",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " anticipates ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is the last verse of a section which interrupts the even flow of the story, and which is absent from the Septuagint. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows immediately on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in that version. Taking that verse as our starting-point, we have three stages in Saul’s growing hatred and awe of the young champion, and of David’s growing influence and reputation. It is deeply tragic to watch the gradual darkening of the once bright light, side by side with the irresistible increase in brilliance of the new star. ‘He must increase, but I must decrease,’ became Saul’s bitter conviction; but instead of meekly accepting the necessity, his gloomy spirit struggled against it, like stormy waves against a breakwater, and, like them, was shivered into foam in the vain effort.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The first stage was Saul’s jealousy of David’s fame as a warrior.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The returning victorious army was met, in Oriental fashion, by a triumphal chorus of women, with their shrill songs, accompanied by the dissonant noises which do duty for music to Eastern ears. The words of their chant were startlingly and ominously plain-spoken, and became more emphatic and insulting in Saul’s ears, because they were sung by two answering bands, one of which rang out, ‘Saul hath slain his thousands,’ while the other overtopped them by pealing out still more loudly and exultantly, ‘And David his ten thousands.’ To be brought into comparison with this unknown stripling was bitter enough, but to be used as a foil to set off his superiority was too much to be borne. There are few men, holding high places in any walk of life, who could have stood such a comparison without wincing. Suppose a great soldier in our day, coming home from a successful campaign, and having his prowess dimmed in every newspaper by the praises lavished on a young lieutenant who had done some brave feat that caught the public fancy- would he be likely to be in a very amiable mood towards either the singers or the object of their triumphal songs? Do great authors rejoice in the rising of young reputations that dim theirs? or do great orators smile when some ‘boy’ takes the public ear more than they do? Poor Saul had to drink the bitter cup, which all who love the sweet draught of popular applause have sooner or later to taste; and we need not think him a monster of badness because he found it bitter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It will be more to the purpose that we take care lest we do the very same thing in our little lives and humble spheres; for envy and jealousy of those who threaten to out-shine, or in any way to out-do, us is not confined to people in high places or with great reputations. The roots of them are in us all, and the only way to keep them from growing up rank is to think less of our reputation and more of our duty, to count it a very small matter what men think of us, and the all-important matter what God thinks.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Saul was moved, too, by the consciousness that he had been really deposed by Jehovah, and was only a phantom king, and, as his angry soliloquy shows, what troubled him most in the women’s song was that it pointed to David as likely to come in and rob him, not only of glory, but of the kingdom. Ever since Samuel had pronounced his rejection, his uneasy eyes had been furtively scanning men for his possible supplanter, and no wonder that his gloomy suspicions focussed themselves on the gallant youth, who conquered men’s hearts and made women’s tongues eloquent in his praise. Stormy and dark as Saul’s nature had become, and grave as had been his failure to be worthy of the monarchy, one cannot but feel the infinite pathos and pity of his life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The second stage was the attempt on David’s life.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which record it, are not in the Septuagint, and the narrative does run more smoothly without them. But if they are retained, they show how the moody suspicion with which Saul ‘eyed David’ came to a swift, murderous climax. He stands as a terrible example of how suspicion and jealousy, working in a nature utterly without self-control, transport it into the wildest excesses. In the strange phraseology of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘an evil spirit from God’ laid hold of him, dominating his personality. The writer of this book felt that God was the ultimate cause of all things, and that all beings were under His control; and his devout recognition of that fact led him to the apparent paradox of tracing an ‘evil spirit’ to God. But we must not be so startled as to overlook the truth that Saul had prepared the fit abode for that evil spirit by his own indulgence in a whirl of sinful passions and acts, and that these were punished by their ‘natural’ consequence. Any man who lets his own baser nature have full fling invites the devil. Saul had what would now be called a paroxysm of insanity. But perhaps the modern medical phrase is not to be preferred to the old scriptural one. The former is innocent of any explanation of the fact which it designates, and it may possibly be that insanity is sometimes, even now, ‘possession.’ At all events, since science gives no explanation of it, and a great dim region of consciousness is now being recognised,-’subliminal,’ to speak in the new phraseology,-he is a bold man who ventures to deny that possibility.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But be that as it may, what a striking picture is given of Saul, worn with passion and swept away by ungovernable impulses, ‘prophesying’ or ‘raving’ with wild gestures and uttering wilder sounds; and of David, young, calm, giving forth melodies on his harp and songs from his lips, that sought to soothe the paroxysms of fury. Browning has drawn the picture in immortal words, which all who can should read. It has been suggested that Saul did not ‘cast’ his spear, but only brandished it in his fierce threat to pin David to the wall. But the youthful harper would scarcely have ‘avoided out of his presence’ for a mere threat and the flourish of a lance; and a man, raging mad and madly hostile, would not be likely to waste breath in mere threats. The attempt was more probably a serious one, and the spear, flung by an arm made stronger than ever by insane hatred, quivered in the wall very near the lithe athlete who had agilely escaped it. Envy, allowed to have its way, becomes murderous. Let us suppress its beginning. A tiger pup can be held in and its claws cut, but a full-grown tiger cannot.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The third stage is Saul’s getting rid of David.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The growing awe of him is marked in verses ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the word in the latter verse is stronger than that in the former. It is a pathetic picture of the gradual creeping over a strong man of a nameless terror. Ever-thickening folds of cold dread, like a wet mist, wrap a soul once bright and energetic. And the reason is twofold: first, that God had left that tempestuous, rebellious soul because it had left Him; and second, that, in its desolate solitude, in which there was no trace of softening or penitence, that lightning-riven soul knew that the sunshine, which it had repelled, was now pouring on David. Saul’s suspicions were hardened into certainties. He was sure now that what his jealousy had whispered, when the women chanted their chorus, was grim fact. And he could but helplessly watch his supplanter’s steady advance in favour with men and God. The two processes of growing darkness and growing light go on side by side in the two men, and each makes the other more striking by contrast. Twice is it repeated that Saul was in awe of David. Twice is it repeated that Jehovah was with David, and that he ‘behaved himself wisely,’ which last statement includes in the Hebrew word both the idea of prudence and that of success. So, on the one hand, there is a steady growth in all good, godly, and happy qualities and experiences; and on the other, a tragical increase of darkness and gloom, godlessness and despair. And yet Saul had begun so well! And Saul might have been what David was,- companioned by God, prosperous, and the idol of his people. Two souls stand side by side for a moment on the same platform, with the same divine goodness and love encircling them, and the one steadily rises, while the other steadily sinks. How awful are the endless possibilities of progress in either direction that lie open for every soul of man!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 18:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "David went out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Upon military expeditions, of which that phrase is often used. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And behaved himself wisely — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Showed as much prudence in his conduct as he did courage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saul set him over the men of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "war — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not over all, for Abner was general, as we speak, of all his forces; but he made him captain of his guard, or gave him some principal command in his army.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-5 The friendship of David and Jonathan was the effect of Divine grace, which produces in true believers one heart and one soul, and causes them to love each other. This union of souls is from partaking in the Spirit of Christ. Where God unites hearts, carnal matters are too weak to separate them. Those who love Christ as their own souls, will be willing to join themselves to him in an everlasting covenant. It was certainly a great proof of the power of God's grace in David, that he was able to bear all this respect and honour, without being lifted up above measure.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Was knit with the soul of David - The same forcible phrase occurs of Jacob's love for Benjamin (marginal reference). Jonathan's truly heroic character is shown in this generous love of David, and admiration of his great deed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Sa 18:5-9. Saul Envies His Praise.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "David went out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " upon military expeditions, of which that word is oft used. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Set him over the men of war; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gave him some considerable command in his army, though not the supreme. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And David went out whithersoever Saul sent him,.... About any business whatsoever, especially about martial affairs, for which he was abundantly qualified: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and behaved himself wisely; in the management of them, using great prudence and discretion, and so failed not of success, and of recommending himself; the Targum renders it \"prospering\"; he was prosperous and successful in whatsoever he engaged, for the Lord was with him, and blessed him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Saul set him over the men of war; that is, of some of them, gave him the command of a troop; for Abner was captain or general of the army, and continued so: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he was accepted in the sight of all the people; of all the people in the land in general, of all that knew or heard of him; being looked upon as a wise, valiant, and successful commander, and which gained him the esteem and affection of the people: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and also in the sight of Saul's servants; which was very much, and a rare thing, for servants are too apt to envy such as are rising in their credit and reputation; though this must not be understood of all, without exception; but of the generality of them; nor is the word \"all\" used of them, as is of the people; for some of them took the part of Saul afterwards against David, and were secretly his enemies, see 1 Samuel 18:22. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and also in the sight of Saul's servants; which was very much, and a rare thing, for servants are too apt to envy such as are rising in their credit and reputation; though this must not be understood of all, without exception; but of the generality of them; nor is the word \"all\" used of them, as is of the people; for some of them took the part of Saul afterwards against David, and were secretly his enemies, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And David went out whithersoever Saul sent him, and behaved himself {b} wisely: and Saul set him over the men of war, and he was accepted in the sight of all the people, and also in the sight of Saul's servants.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And David went out whithersoever Saul sent him, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " behaved himself ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wisely: and Saul set him over the men of war, and he was accepted in the sight of all the people, and also in the sight of Saul's servants.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) That is, he prospered in all his doings.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "David went out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c] David was appointed to some post of command, and “went out” upon military expeditions. In these “he behaved himself wisely”—the word combines the ideas of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prudence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and consequent ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "success:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and in spite of this sudden promotion, which might naturally have excited the jealousy of the courtiers, won their good-will. This verse anticipates, and describes summarily facts which are mentioned again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Samuel 18:13-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:13-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " in their proper place.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "David went out.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " went on military expeditions (comp. ver. 30). As the verb has thus a technical signification, it makes a complete sense, and the verse should be translated, \"And David went forth (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on warlike enterprises); whithersoever Saul sent him he prospered, and Saul set him over the men of war.\" These expeditions were not upon a very large scale; for it is not until ver. 13 that we read of David being made \"captain over a thousand.\" Still, even while only a centurion in rank, yet, as being in constant attendance upon the king, he would often temporarily have the command of larger bodies of men, or would go on campaigns as one of the king's officers. As it is mentioned that his promotion caused no envy because of his great merits, it follows that it was rapid enough to have given occasion to ill will under ordinary circumstances. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Behaved himself wisely.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is the primary meaning of the verb; but as success is the result of wise conduct, it constantly signifies ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to prosper.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This verse is a summary of events which may have occupied a very considerable space of time. It was only gradually that David's fame became so great as to rouse all the worst feelings in Saul's mind. SAUL'S HATRED OF DAVID (vers. 6-16). 1 Samuel 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And David went out, sc., to battle; whithersoever Saul sent him, he acted wisely and prosperously (ישׂכּיל, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Saul placed him above the men of war in consequence, made him one of their commanders; and he pleased all the people, and the servants of Saul also, i.e., the courtiers of the king, who are envious as a general rule. ",
        "children": []
      }
    ]
  }
]