[{"num":42,"verse":"Lo! my servant, I shall up-take him; my chosen, my soul pleased to itself in him. I gave my spirit on him, he shall bring forth doom to heathen men. (Lo! my servant, I shall uphold him; my chosen, my soul delighted itself in him. I put my Spirit in him, he shall bring forth justice, or judgement, to the heathen.)"},{"num":2,"verse":"He shall not cry (out), neither he shall take a person, neither his voice shall be heard withoutforth."},{"num":3,"verse":"He shall not break a shaken reed, and he shall not quench (the) smoking flax; he shall bring out doom in truth (but he shall bring forth justice, or judgement, and truth)."},{"num":4,"verse":"He shall not be sorrowful, neither troubled, till he set doom in [the] earth, and isles shall abide his law. (He shall not have sorrow, nor be troubled, until he hath brought forth justice, or judgement, upon the earth, and the islands shall wait for his Law.)"},{"num":5,"verse":"The Lord God saith these things, making (the) heavens of nought, and stretching forth them, making steadfast the earth, and those things that burgeon [out] of it, giving breath to the people, that is on it, and giving spirit to them that tread on it. (The Lord God saith these things, making the heavens out of nothing, and stretching them forth, making steadfast the earth, and those things that burgeon out of it, giving breath to the people who be on it, yea, giving spirit to those who tread upon it.)"},{"num":6,"verse":"I the Lord have called thee in rightfulness, and I took thine hand, and kept thee, and I gave thee into a bond of peace of the people, and into light of folks. (I the Lord have called thee in righteousness, and I took thy hand, and kept thee, and I gave thee to be a covenant for the people, and a light for the nations.)"},{"num":7,"verse":"That thou shouldest open the eyes of blind men; that thou shouldest lead out of enclosing together a bound man, (and) from the house of prison men sitting in darknesses. (So that thou shouldest open the eyes of the blind; and that thou shouldest lead out the bound, or the prisoners, from being enclosed, yea, those sitting in darkness, from out of the prison house.)"},{"num":8,"verse":"I am the Lord, this is my name; I shall not give my glory to another, and my praising to graven images. (I am the Lord, that is my name; I shall not give my glory to another, nor my praises to carved idols.)"},{"num":9,"verse":"Lo! those things that were the first, be come, and (now) I tell new things; I shall make heard to you, before that those begin to be made. (Lo! those things that were to come first, have come to pass, and now I shall tell of new things; yea, before that they begin to be made, I shall tell you of them.)"},{"num":10,"verse":"Sing ye a new song to the Lord; his praising is from the last parts of the earth; ye that go down into the sea, and the fullness thereof, isles, and the dwellers of those. (Sing ye a new song to the Lord; his praises come from the ends of the earth; ye who go down to the sea, and its fullness, the islands, and their inhabitants.)"},{"num":11,"verse":"The desert be raised [up], and the cities thereof; he shall dwell in the houses of Kedar; ye dwellers of the stone, praise ye (ye inhabitants of Sela, praise ye); they shall cry (out) from the top of hills."},{"num":12,"verse":"They shall set glory to the Lord, and they shall tell his praising in isles. (They shall give glory to the Lord, and they shall tell out his praises on the islands.)"},{"num":13,"verse":"The Lord as a strong man shall go out, as a man a warrior he shall raise fervent love; he shall speak, and shall cry; he shall be comforted on his enemies. (The Lord shall go out like a strong man, he shall stir up fervour like a man of war; he shall speak, and he shall cry out; he shall be strong against his enemies.)"},{"num":14,"verse":"I was still, ever I held [my] silence; I was patient, (but now) I shall speak as a woman travailing of child (but now I shall cry like a woman labouring with child); I shall scatter, and I shall swallow (up) (al)together."},{"num":15,"verse":"I shall make (into) desert (the) high mountains and little hills, and I shall dry up all the burgeoning of them; and I shall set floods into isles, and I shall make ponds dry."},{"num":16,"verse":"And I shall lead out blind men into the way, which they know not, and I shall make them to go in paths, which they knew not; I shall set the darknesses of them before them into light, and shrewd things into rightful things; I did these words to them, and I forsook not them. (And I shall lead out the blind by the way, which they know not, and I shall make them to go on paths, which they knew not; I shall turn their darkness into light before them, and make depraved, or crooked, ways into straight ways; I shall do these things for them, and I shall not desert them.)"},{"num":17,"verse":"(But others,) They (shall) be turned aback; (yea,) be they shamed with shame, that trust in a graven image; which say to a molten image, Ye be our gods."},{"num":18,"verse":"Ye deaf men, hear; and ye blind men, behold to see. (Ye deaf, hear; and ye blind, look and see!)"},{"num":19,"verse":"Who is blind, no but my servant? and deaf, but he to whom I sent my messengers? Who is blind, but he that is sold? and who is blind, but the servant of the Lord?"},{"num":20,"verse":"Whether thou that seest many things, shalt not keep (it in thy mind)? Whether thou that hast open ears, shalt not hear?"},{"num":21,"verse":"And the Lord would, that he should hallow it, and magnify the law, and enhance it. (And the Lord desired, that he would hallow the Law, and magnify it, and exalt it, or lift it up.)"},{"num":22,"verse":"But that people was ravished, and wasted; all they be the snare of young men, and be hid in the houses of prisons. They be made into raven, and none (there) is that delivereth; into ravishing, and none there is that saith, Yield thou. (But that people was robbed, and taken as prey; they all be ensnared, and be hid in prison houses. They be made into raven, or spoils, and there is no one who rescueth them; yea, into robbing, and there is no one who saith, Yield thou/Give thou them back!)"},{"num":23,"verse":"Who is among you, that heareth this, (that) perceiveth, and harkeneth (to) things to coming?"},{"num":24,"verse":"Who gave Jacob into ravishing, and Israel to destroyers? Whether not the Lord? He it is, against whom they sinned; and they would not go in his ways, and they heard not his law. (Who gave up Jacob for robbing, and Israel over to destroyers? Did not the Lord? It is he whom they sinned against; and they would not go in his ways, and they would not listen to his Law.)"},{"num":25,"verse":"And he shedded out on them the indignation of his strong vengeance, and strong battle; and he burnt it in compass, and it knew not; and he burnt it, and it understood not. (And so he poured out on them the anger of his strong vengeance, and the strength of battle; and he burned them all around, yet still they knew not; he burned them down, but still they did not understand.)"}]