[{"header":"Standing Before the Sanhedrin"},{"num":4,"verse":"As Peter and John were speaking to the people, the kohanim and the captain of the Temple and the Sadducees came up to them. "},{"num":2,"verse":"They were indignant because Peter and John were teaching the people and announcing in Yeshua the resurrection of the dead. "},{"num":3,"verse":"So they grabbed them and put them in jail until the next day, for it was already evening. "},{"num":4,"verse":"But many who heard the message believed, and the number of the men came to about five thousand."},{"num":5,"verse":"On the next day, the rulers and elders and Torah scholars were gathered together in Jerusalem. "},{"num":6,"verse":"Annas the kohen gadol was there, and Caiaphas and John and Alexander, and all those who were of high-priestly descent. "},{"num":7,"verse":"When they had placed Peter and John in their midst, they began to inquire, “By what power or in what name did you do this?”"},{"num":8,"verse":"Then Peter, filled with the Ruach ha-Kodesh, said to them, “Rulers and elders of the people! "},{"num":9,"verse":"If we are on trial today for a mitzvah done for a sick man, as to how this fellow was healed, "},{"num":10,"verse":"let it be known to all of you and to all the people of Israel, that by the name of Yeshua ha-Mashiach ha-Natzrati—whom you had crucified, whom God raised from the dead—this one stands before you whole. "},{"num":11,"verse":"This Yeshua is ‘the stone—rejected by you, the builders—that has become the chief cornerstone.’"},{"num":12,"verse":" There is salvation in no one else, for there is no other name under heaven given to mankind by which we must be saved!”"},{"num":13,"verse":"Now when they saw the boldness of Peter and John and figured out they were laymen without training, they were amazed. They began to realize that these men had been with Yeshua. "},{"num":14,"verse":"But seeing the healed man standing with them, they had nothing to say in response. "},{"num":15,"verse":"When they had ordered Peter and John to go out of the council chamber, they began to confer with one another, "},{"num":16,"verse":"saying, “What shall we do with these men? For indeed, it’s obvious to everyone living in Jerusalem that a remarkable miracle has happened through them, and we cannot deny it. "},{"num":17,"verse":"But so it won’t spread any further among the people, let’s warn them not to speak anymore to anyone in this name.”"},{"num":18,"verse":"So they called them in and ordered them not to speak or teach at all in the name of Yeshua. "},{"num":19,"verse":"But Peter and John replied, “Whether it is right in the sight of God to listen to you rather than to God, you decide. "},{"num":20,"verse":"For we cannot stop speaking about what we have seen and heard.”"},{"num":21,"verse":"After threatening them again, they let them go—finding no way they could punish them on account of the people, because they all were glorifying God for what had happened. "},{"num":22,"verse":"For the man in whom this miracle of healing had happened was more than forty years old."},{"header":"Prayer for Courage"},{"num":23,"verse":"As soon as they were released, Peter and John went to their own people and reported all that the ruling kohanim and elders had said to them. "},{"num":24,"verse":"When they heard it, they lifted their voices together to God and said, “O Sovereign Master, ‘You made heaven and earth and the sea, and everything in them.’"},{"num":25,"verse":" You said by the Ruach ha-Kodesh, through the mouth of our father David Your servant,"},{"num":27,"verse":"“For truly both Herod and Pontius Pilate, along with the Gentiles and the peoples of Israel, were gathered together in this city against Your holy Servant Yeshua, whom You anointed. "},{"num":28,"verse":"They did whatever Your hand and Your purpose predetermined to happen. "},{"num":29,"verse":"And now, Lord, look at their threats, and grant Your servants to speak Your word with utmost courage—"},{"num":30,"verse":"while You stretch out Your hand to heal, and signs and wonders take place through the name of Your holy Servant Yeshua.”"},{"num":31,"verse":"When they had prayed, the place where they were gathered was shaken. And they were all filled with the Ruach ha-Kodesh and began to speak the word of God with boldness."},{"header":"Ruach-Filled Community Life"},{"num":32,"verse":"Now the whole group of those who believed was one in heart and mind. No one would say anything he owned was his own, but they had everything in common. "},{"num":33,"verse":"With great power the emissaries were giving witness to the resurrection of the Lord Yeshua, and abundant favor was upon them all. "},{"num":34,"verse":"No one among them was needy, for all who were owners of lands or houses would sell them and bring the proceeds "},{"num":35,"verse":"and set them at the feet of the emissaries. And the proceeds were distributed according to the need each one had."},{"num":36,"verse":"Now Joseph, also called Barnabas by the emissaries (which is translated Son of Encouragement), was a Levite and native of Cyprus. "},{"num":37,"verse":"He sold a field that he owned and brought the money and laid it at the feet of the emissaries."}]