[{"num":9,"verse":"I speak HaEmes in Moshiach, I do not speak sheker, my matzpun (conscience) bearing me eidus (witness) in the Ruach HaKodesh,"},{"num":2,"verse":"That there is great agmat nefesh to me and unceasing anguish in my heart."},{"num":3,"verse":"For I could wish that my neshamah be put under cherem (ban of destruction), under Churban, and Onesh Gehinnom, cut off from Moshiach for the sake of my achim, my own kinsmen, my people and flesh and blood relatives,"},{"num":4,"verse":"In as much as they are Bnei Yisroel: theirs is the Mishpat HaBanim Adoption, the Ma’amad HaBanim Standing as Sons, and the Kavod (glory) and the Shechinah (glorious presence of G-d) and the Beritot (covenants), the Torah, the Avodas Kodesh (worship) and the Havtachot (promises);"},{"num":5,"verse":"Theirs are the Avot (the Patriarchs), and from them came, in so far as his humanity is concerned, Rebbe, Melech HaMoshiach, al hakol hu HaElohim mam’vorach l’Olam va’ed. Omein."},{"num":6,"verse":"But it is not as though the Dvar Hashem has failed. For not all those descended from Yisroel are truly redeemed Yisroel (of the eschatological Geulah Redemption)."},{"num":7,"verse":"Nor is it as though all the banim of K’lal Yisroel are the ZERA of Avraham Avinu, but (as it is written) BEYITZCHAK YIKARE L’CHA ZERA (\"In Yitzchak shall your seed be called, named, summoned\" BERESHIS 21:12)."},{"num":8,"verse":"That is, it is not the b’nei habasar (old humanity without hitkhadshut) who are the b’nei HaElohim (children of G-d) but the b’nei HaHavtachah (children of the promise) who are reckoned as ZERA (seed, children, including the right of the heir in relation to the father)."},{"num":9,"verse":"For this word is one of havtachah (promise): KA’ET SHOV ASHUV UL’SARAH BEN (\"About this time I will come and Sarah shall have a son\" BERESHIS 18:10,14)."},{"num":10,"verse":"Not only so, but also in the case of Rivkah (Isaac’s wife) who conceived by the one act of sexual intercourse with Yitzchak Avinu."},{"num":11,"verse":"For when they were not yet born nor had they done anything tov or rah, in order that the etzah (wisdom) of the tochnit Hashem (purposeful and willed plan of G-d Ro 8:28) should stand in terms of bechirah (divine election, selection, choosing),"},{"num":12,"verse":"Not from Ma’asim (Works) but from the One who makes the kri’ah (divine summons, call), it was said to her, RAV YA’AVOD TZA’IR (\"the elder will serve the younger\" BERESHIS 25:23),"},{"num":13,"verse":"As it is written, VA’OHAV ES YA’AKOV V’ES ESAV SANEITI (\"Ya’akov have I loved, but Esau have I hated\" MALACHI 1:2-3)."},{"num":14,"verse":"What then shall we say? There is no avla (injustice) with G-d, is there? Chas v’shalom!"},{"num":15,"verse":"For to Moshe Rabbeinu Hashem says, V’CHANNOTI ES ASHER ACHON V’RICHAMETTI ES ASHER ARACHEM (\"I will have mercy on whom I will have mercy and I will have compassion on whom I will have compassion\" SHEMOT 33:19)."},{"num":16,"verse":"So then, it is not a matter of the one who wills or the one who runs. It is a matter of the YAD HASHEM HACHANINAH (the hand of the G-d of gracious, free mercy)."},{"num":17,"verse":"For the Kitvei Hakodesh says to Pharaoh, BA’AVUR ZOT HE’EMADTICHA BA’AVUR HAROTECHA ES KOCHI ULEMA’AN SAPER SHMI BECHOL HA’ARETZ (\"For this purpose I raised you up, in order that I might demonstrate in you my power and in order that my Name might be proclaimed in all the earth\" SHEMOT 9:16)."},{"num":18,"verse":"So then, to whom Hashem wills Hashem shows chaninah (mercy, free grace), but whom Hashem wills he hardens (that is, makes unresponsive or more mired down in KESHI (stubbornness, hardness)[DEVARIM 9:27]."},{"num":19,"verse":"You will say to me, “Then why does Hashem still find fault? For who has resisted His will?\""},{"num":20,"verse":"On the contrary, who are you, a human being, to answer back to G-d? VEYETZER AMAR LEYOTZRO (\"Can the pot say to the potter\" YESHAYAH 29:16), \"Why have you made me thus?\""},{"num":21,"verse":"Or does the potter not have the right over the clay [YIRMEYAH 18:6] to make from the same lump one vessel for honorable use and another for dishonorable use?"},{"num":22,"verse":"But what if naniach (supposing) Hashem, willing to demonstrate His Charon Af Hashem (burning anger of G-d) and to make known His ko’ach (power)[1:18,16], put up with and endured with zitzfleisch (patience) vessels which are objects of G-d’s Charon Af (burning anger), objects made ready for Churban [9:3],"},{"num":23,"verse":"And in order that He might make known the wealth of His kavod (glory) on vessels which are objects of Hashem’s chaninah (mercy, free grace) which He prepared beforehand for kavod? [8:29-30]"},{"num":24,"verse":"By which I mean us, whom also He called, not only from the Yehudim but also from the non-Jews,"},{"num":25,"verse":"As it says in Hoshea, V’AMARTI L’LO AMMI AMI ATAH (\"And I will call the ‘not my people’ my people\" HOSHEA 2:25 [23]) and the ‘not loved’ loved;"},{"num":26,"verse":"\"And it shall be in the place where it was said to them, ‘You are not my people,’ there they shall be called B’NEI EL CHAI (\"sons of the living G-d—HOSHEA 2:1)\""},{"num":27,"verse":"Yeshayah proclaims concerning Yisroel, \"Even if the number of the Bnei Yisroel are as the sand of the sea, only the She’erit (Remnant) will return (be saved),"},{"num":28,"verse":"For Hashem will complete and cut short and will perform His Word on the earth YESHAYAH 10:22-23."},{"num":29,"verse":"And as Yeshayah said beforehand, \"Except Adonoi Tzvaot had left us SARID KIM’AT (\"some survivors\" (Ro 9:7), we would have become like S’dom and we would have been the same as Amora\" [YESHAYAH 1:9]."},{"num":30,"verse":"What then shall we say? That Goyim who do not pursue Tzedek (righteousness) have attained Tzedek which is Tzedek through emunah,"},{"num":31,"verse":"Whereas Yisroel pursuing a Tzedek (righteousness) based on the Torah (see Ga 3:12-13) did not arrive at that Torah?"},{"num":32,"verse":"Why so? Because it was not on the mekor (basis) of emunah but on the mekor (basis) of [zechus-earning] ma’asim (works 3:20,28; 4:2,6; 9:11-12). They have stumbled over the EVEN NEGEF (\"Stone of Stumbling\" Isa 8:14; 28:16),"},{"num":33,"verse":"As it is written \"Hinei, I place in Tziyon a stone of stumbling and a rock of offense; and he who believes in Me shall not be put to shame\" (Isa 8:14; 28:16)."}]