[{"header":"Solomon Asks God for Wisdom"},{"num":3,"verse":"Solomon and Pharaoh, the king of Egypt, agreed to help each other. So Solomon married Pharaoh’s daughter. He brought her to the City of David. She stayed there until he finished building his palace, the Lord’s temple, and the wall around Jerusalem. "},{"num":2,"verse":"But the people continued to offer sacrifices at the high places where they worshiped. That’s because a temple hadn’t been built yet where the Lord would put his Name. "},{"num":3,"verse":"Solomon showed his love for the Lord. He did it by obeying the laws his father David had taught him. But Solomon offered sacrifices at the high places. He also burned incense there."},{"num":4,"verse":"King Solomon went to the city of Gibeon to offer sacrifices. That’s where the most important high place was. There he offered 1,000 burnt offerings on the altar. "},{"num":5,"verse":"The Lord appeared to Solomon at Gibeon. He spoke to him in a dream during the night. God said, “Ask for anything you want me to give you.”"},{"num":6,"verse":"Solomon answered, “You have been very kind to my father David, your servant. That’s because he was faithful to you. He did what was right. His heart was honest. And you have continued to be very kind to him. You have given him a son to sit on his throne this day."},{"num":7,"verse":"“Lord my God, you have now made me king. You have put me in the place of my father David. But I’m only a little child. I don’t know how to carry out my duties. "},{"num":8,"verse":"I’m here among the people you have chosen. They are a great nation. They are more than anyone can count. "},{"num":9,"verse":"So give me a heart that understands. Then I can rule over your people. I can tell the difference between what is right and what is wrong. Who can possibly rule over this great nation of yours?”"},{"num":10,"verse":"The Lord was pleased that Solomon had asked for that. "},{"num":11,"verse":"So God said to him, “You have not asked to live for a long time. You have not asked to be wealthy. You have not even asked to have your enemies killed. Instead, you have asked for wisdom. You want to do what is right and fair when you judge people. Because that is what you have asked for, "},{"num":12,"verse":"I will give it to you. I will give you a wise and understanding heart. So here is what will be true of you. There has never been anyone like you. And there never will be. "},{"num":13,"verse":"And that is not all. I will give you what you have not asked for. I will give you wealth and honor. As long as you live, no other king will be as great as you are. "},{"num":14,"verse":"Live the way I want you to. Obey my laws and commands, just as your father David did. Then I will let you live for a long time.” "},{"num":15,"verse":"Solomon woke up. He realized he had been dreaming."},{"header":"A Wise Ruling"},{"num":16,"verse":"Two prostitutes came to the king. They stood in front of him. "},{"num":17,"verse":"One of them said, “Pardon me, my master, this woman and I live in the same house. I had a baby while she was there with me. "},{"num":18,"verse":"Three days after my child was born, this woman also had a baby. We were alone. There wasn’t anyone in the house but the two of us."},{"num":19,"verse":"“During the night this woman’s baby died. It happened because she was lying on top of him. "},{"num":20,"verse":"So she got up in the middle of the night. She took my son from my side while I was asleep. She put him by her breast. Then she put her dead son by my breast. "},{"num":21,"verse":"The next morning, I got up to nurse my son. But he was dead! I looked at him closely in the morning light. And I saw that it wasn’t my baby.”"},{"num":22,"verse":"The other woman said, “No! The living baby is my son. The dead one belongs to you.”"},{"num":23,"verse":"The king said, “One of you says, ‘My son is alive. Your son is dead.’ The other one says, ‘No! Your son is dead. Mine is alive.’ ”"},{"num":24,"verse":"He continued, “Bring me a sword.” So a sword was brought to him. "},{"num":25,"verse":"Then he gave an order. He said, “Cut the living child in two. Give half to one woman and half to the other.”"},{"num":26,"verse":"The woman whose son was alive was filled with deep love for her son. She said to the king, “My master, please give her the living baby! Don’t kill him!”"},{"num":27,"verse":"Then the king made his decision. He said, “Give the living baby to the first woman. Don’t kill him. She’s his mother.”"},{"num":28,"verse":"All the Israelites heard about the decision the king had given. That gave them great respect for him. They saw that God had given him wisdom. They knew that Solomon would do what was right and fair when he judged people."}]