[{"num":3,"verse":"Solomon made an alliance with Pharaoh, the king of Egypt, and married one of his daughters. He brought her to Jerusalem to live in the City of David until he could finish building his palace and the Temple and the wall around the city."},{"num":2,"verse":"At that time the people of Israel sacrificed their offerings on altars in the hills, for the Temple of the Lord hadn’t yet been built."},{"num":3,"verse":"(Solomon loved the Lord and followed all of his father David’s instructions except that he continued to sacrifice in the hills and to offer incense there.) "},{"num":4,"verse":"The most famous of the hilltop altars was at Gibeon, and now the king went there and sacrificed one thousand burnt offerings! "},{"num":5,"verse":"The Lord appeared to him in a dream that night and told him to ask for anything he wanted, and it would be given to him!"},{"num":6,"verse":"Solomon replied, “You were wonderfully kind to my father David because he was honest and true and faithful to you, and obeyed your commands. And you have continued your kindness to him by giving him a son to succeed him. "},{"num":7,"verse":"O Lord my God, now you have made me the king instead of my father David, but I am as a little child who doesn’t know his way around. "},{"num":8,"verse":"And here I am among your own chosen people, a nation so great that there are almost too many people to count! "},{"num":9,"verse":"Give me an understanding mind so that I can govern your people well and know the difference between what is right and what is wrong. For who by himself is able to carry such a heavy responsibility?”"},{"num":10,"verse":"The Lord was pleased with his reply and was glad that Solomon had asked for wisdom. "},{"num":11,"verse":"So he replied, “Because you have asked for wisdom in governing my people and haven’t asked for a long life, or riches for yourself, or the defeat of your enemies—"},{"num":12,"verse":"yes, I’ll give you what you asked for! I will give you a wiser mind than anyone else has ever had or ever will have! "},{"num":13,"verse":"And I will also give you what you didn’t ask for—riches and honor! And no one in all the world will be as rich and famous as you for the rest of your life! "},{"num":14,"verse":"And I will give you a long life if you follow me and obey my laws as your father David did.”"},{"num":15,"verse":"Then Solomon woke up and realized it had been a dream. He returned to Jerusalem and went into the Tabernacle. And as he stood before the Ark of the Covenant of the Lord, he sacrificed burnt offerings and peace offerings. Then he invited all of his officials to a great banquet."},{"num":16,"verse":"Soon afterwards two young prostitutes came to the king to have an argument settled."},{"num":17,"verse":"“Sir,” one of them began, “we live in the same house, just the two of us, and recently I had a baby. When it was three days old, this woman’s baby was born too. "},{"num":19,"verse":"But her baby died during the night when she rolled over on it in her sleep and smothered it. "},{"num":20,"verse":"Then she got up in the night and took my son from beside me while I was asleep, and laid her dead child in my arms and took mine to sleep beside her. "},{"num":21,"verse":"And in the morning when I tried to feed my baby it was dead! But when it became light outside, I saw that it wasn’t my son at all.”"},{"num":22,"verse":"Then the other woman interrupted, “It certainly was her son, and the living child is mine.”"},{"num":23,"verse":"Then the king said, “Let’s get the facts straight: both of you claim the living child, and each says that the dead child belongs to the other. "},{"num":24,"verse":"All right, bring me a sword.” So a sword was brought to the king. "},{"num":25,"verse":"Then he said, “Divide the living child in two and give half to each of these women!”"},{"num":26,"verse":"Then the woman who really was the mother of the child, and who loved him very much, cried out, “Oh no, sir! Give her the child—don’t kill him!”"},{"num":27,"verse":"Then the king said, “Give the baby to the woman who wants him to live, for she is the mother!”"},{"num":28,"verse":"Word of the king’s decision spread quickly throughout the entire nation, and all the people were awed as they realized the great wisdom God had given him."}]