[{"num":37,"verse":"To David. [The psalm of David.] Do not thou follow wicked men; neither love thou men doing wickedness. (The song of David. Do not thou follow the wicked; nor love thou those who do wickedly.)"},{"num":2,"verse":"For they shall wax dry swiftly as hay; and they shall fall down soon as the worts of herbs. (For they shall quickly grow dry like the hay, or the grass; and soon they shall fall down like the best herbs, or the plants.)"},{"num":3,"verse":"Hope thou in the Lord, and do thou goodness (Trust thou in the Lord, and do good); and inhabit thou the land, and thou shalt be fed with his riches."},{"num":4,"verse":"Delight thou in the Lord; and he shall give to thee the askings of thine heart."},{"num":5,"verse":"Show thy way to the Lord; and hope in him, and he shall do. (Give all thy ways to the Lord, and trust in him; and he shall make it happen.)"},{"num":6,"verse":"And he shall lead out thy rightfulness as light, and thy doom as midday; (And he shall lead forth thy righteousness like the light, and thy judgement like the midday sun;)"},{"num":7,"verse":"be thou subject to the Lord, and pray thou him. Do not thou follow him, that hath prosperity in his way; (nor) a man doing unrightfulness. (be thou subject to the Lord, and wait thou for him. Do not thou follow a man, simply because he hath prospered along his way; nor a man doing unrighteousness, or wickedness.)"},{"num":8,"verse":"Cease thou of ire, and forsake strong vengeance; do not thou follow, that thou do wickedly. (Cease thou from anger, and abandon taking vengeance; do not thou follow after these things, so that thou do wickedly.)"},{"num":9,"verse":"For they, that do wickedly, shall be destroyed; but they that suffer the Lord, shall inherit the land. (For they, who do wickedly, shall be destroyed; but they who hope in the Lord, shall inherit the earth.)"},{"num":10,"verse":"And yet a little, and a sinner shall not be (For after but just a little time, that sinner shall not be); and thou shalt seek his place, and thou shalt not find it."},{"num":11,"verse":"But mild men shall inherit the land (And the humble, or the meek, shall inherit the earth); and shall delight in the multitude of peace."},{"num":12,"verse":"A sinner shall ambush the rightful man; and he shall gnash with his teeth on him. (A sinner shall attack a righteous man; and he shall gnash on him with his teeth.)"},{"num":13,"verse":"But the Lord shall scorn the sinner; for he beholdeth that his day cometh."},{"num":14,"verse":"Sinners have drawn out sword; they bent their bow. To deceive a poor man and needy; to strangle rightful men of heart. (The sinners have drawn out their swords; they have bent their bows. Yea, to destroy the poor and the needy; and to kill those with an upright heart.)"},{"num":15,"verse":"Their sword enter into the heart of themselves; and their bow be broken. (But their swords shall enter into their own hearts; and their bows shall be broken.)"},{"num":16,"verse":"Better is a little thing to a just man; than many riches of sinners. (Better is the little that the righteous have; than the many riches of the sinners.)"},{"num":17,"verse":"For the arms of sinners shall be all-broken; but the Lord confirmeth just men. (For the strength of the sinners shall be all-broken; but the Lord upholdeth the righteous.)"},{"num":18,"verse":"The Lord knoweth the days of [the] unwemmed; and their heritage shall be (into) without end. (The Lord knoweth all about those without blemish, or without fault; and their inheritance shall last forever.)"},{"num":19,"verse":"They shall not be shamed in the evil time, and they shall be [ful]filled in the days of hunger;"},{"num":20,"verse":"for sinners shall perish. Forsooth anon as the enemies of the Lord be honoured, and enhanced; they failing shall fail as smoke. (but the sinners shall perish. And after the Lord’s enemies be honoured, and exalted; they shall disappear, just like smoke.)"},{"num":21,"verse":"A sinner shall borrow, and shall not pay (back); but a just man hath mercy, and shall give (but the righteous have love, and shall give to others)."},{"num":22,"verse":"For they that bless the Lord shall inherit the land; but they that curse him shall perish. (For those who be blessed by the Lord, shall inherit the earth; but they who be cursed by him, shall perish.)"},{"num":23,"verse":"The going(s) of a man shall be (ad)dressed with the Lord; and he shall delight in his way. (The goings of a man be directed by the Lord; and he guardeth him on his way.)"},{"num":24,"verse":"When he falleth, he shall not be hurtled down/he shall not be hurled down; for the Lord undersetteth his hand."},{"num":25,"verse":"I was younger, and soothly I waxed eld; and I saw not a just man forsaken, neither his seed seeking bread. (I was young, and then I grew old; and I never saw a righteous person abandoned, nor his children seeking bread.)"},{"num":26,"verse":"All day he hath mercy, and lendeth; and his seed shall be in blessing. (All day long he hath love, and lendeth to others; and his children, or his descendants, shall be blessed.)"},{"num":27,"verse":"Bow thou away from evil, and do good; and dwell thou into the world of world. (Turn thou away from evil, and do good; and thou shalt live forever.)"},{"num":28,"verse":"For the Lord loveth doom, and shall not forsake his saints; they shall be kept [into] without end. Unjust men shall be punished; and the seed of wicked men shall perish. (For the Lord loveth justice, and shall not forsake his saints; they shall be kept safe forever. The unjust, or the unrighteous, shall be punished; and the descendants of the wicked shall perish.)"},{"num":29,"verse":"But just men shall inherit the land; and shall inhabit thereon into the world of world. (But the righteous shall inherit the land; and shall inhabit it forever.)"},{"num":30,"verse":"The mouth of a just man shall bethink wisdom; and his tongue shall speak doom. (The righteous person speaketh wisdom; yea, his tongue shall speak of justice, or fairness.)"},{"num":31,"verse":"The law of his God is in his heart; and his steps shall not be deceived. (The Law of God is in his heart; and his steps shall not slip/and his feet shall not stumble.)"},{"num":32,"verse":"A sinner beholdeth a just man; and seeketh to slay him."},{"num":33,"verse":"But the Lord shall not forsake him in his hands; neither he shall condemn him, when it shall be deemed against him."},{"num":34,"verse":"Abide thou the Lord, and keep thou his way, and he shall enhance thee, that by heritage thou take the land; when sinners shall perish, thou shalt see. (Wait thou for the Lord, and keep thou to his way, and he shall raise thee up, or shall exalt thee, so that thou take the land by inheritance; and when the sinners shall perish, thou shalt see it.)"},{"num":35,"verse":"I saw the wicked man enhanced above; and raised up as the cedars of Lebanon. (Once I saw a wicked man exalted; yea, raised up as high as the cedars in Lebanon.)"},{"num":36,"verse":"And I passed (And then I passed by later), and lo! he was not (there); I sought him, and his place was not found."},{"num":37,"verse":"Keep thou innocence, and see equity; for those be relics to a peaceable man. (Mark thou the innocent, and look upon the righteous; for they be the progeny of peaceful people.)"},{"num":38,"verse":"Forsooth unjust men shall perish; the remnants/the relics of wicked men shall perish (al)together. (But the unjust, or the unrighteous, shall perish; yea, the progeny of the wicked shall altogether perish.)"},{"num":39,"verse":"But the health of just men is of the Lord; and he is their defender in the time of tribulation. (But the salvation, or the deliverance, of the righteous is from the Lord; and he is their defender in their time of trouble.)"},{"num":40,"verse":"And the Lord shall help them, and shall make them free, and he shall deliver them from sinners; and he shall save them, for they hoped in him (and he shall save them, for they trusted in him)."}]