[{"header":"Dead to Sin but Alive in Christ"},{"num":6,"verse":"So do you think that we should continue sinning so that God will give us more and more grace? "},{"num":2,"verse":"No! We died to our old sinful lives. So how can we continue living with sin? "},{"num":3,"verse":"Did you forget that all of us became part of Christ when we were baptized? We shared his death in our baptism. "},{"num":4,"verse":"So when we were baptized, we were buried with Christ and shared his death. We were buried with him so that we could live a new life, just as Christ was raised from death by the wonderful power of the Father."},{"num":5,"verse":"Christ died, and we have been joined with Christ by dying too. So we will also be joined with him by rising from death as he did. "},{"num":6,"verse":"We know that our old life died with Christ on the cross. This was so that our sinful selves would have no power over us, and we would not be slaves to sin. "},{"num":7,"verse":"Anyone who has died is made free from sin’s control."},{"num":8,"verse":"If we died with Christ, we know that we will also live with him. "},{"num":9,"verse":"Christ was raised from death. And we know that he cannot die again. Death has no power over him now. "},{"num":10,"verse":"Yes, when Christ died, he died to defeat the power of sin one time—enough for all time. He now has a new life, and his new life is with God. "},{"num":11,"verse":"In the same way, you should see yourselves as being dead to the power of sin and alive with God through Christ Jesus."},{"num":12,"verse":"So, do not let sin control you in your life here on earth. You must not be ruled by the things your sinful self makes you want to do. "},{"num":13,"verse":"Do not offer the parts of your body to serve sin. Do not use your bodies as things to do evil with, but offer yourselves to God. Be like people who have died and now live. Offer the parts of your body to God to be used for doing good. "},{"num":14,"verse":"Sin will not be your master, because you are not under law but under God’s grace."},{"header":"Slaves of Righteousness"},{"num":15,"verse":"So what should we do? Should we sin because we are under grace and not under law? No! "},{"num":16,"verse":"Surely you know that when you give yourselves like slaves to obey someone, then you are really slaves of that person. The person you obey is your master. You can follow sin, or obey God. Sin brings spiritual death. But obeying God makes you right with him. "},{"num":17,"verse":"In the past you were slaves to sin—sin controlled you. But thank God, you fully obeyed the things that were taught to you. "},{"num":18,"verse":"You were made free from sin, and now you are slaves to goodness. "},{"num":19,"verse":"I use this example because this is hard for you to understand. In the past you offered the parts of your body to be slaves to sin and evil. You lived only for evil. In the same way now you must give yourselves to be slaves of goodness. Then you will live only for God."},{"num":20,"verse":"In the past you were slaves to sin, and goodness did not control you. "},{"num":21,"verse":"You did evil things, and now you are ashamed of them. Those things only bring death. "},{"num":22,"verse":"But now you are free from sin and have become slaves of God. This brings you a life that is only for God. And this gives you life forever. "},{"num":23,"verse":"The payment for sin is death. But God gives us the free gift of life forever in Christ Jesus our Lord."}]