[{"num":6,"verse":"¶ What shall we say then? Shall we continue in sin that grace may abound?"},{"num":2,"verse":"No, in no wise. How shall we that are dead to sin live any longer therein?"},{"num":3,"verse":"Know ye not that all of us that are baptized into Jesus the Christ are baptized into his death?"},{"num":4,"verse":"For we are buried with him by baptism into death, that just as the Christ was raised up from the dead to the glory of the Father, likewise we also walk in newness of life."},{"num":5,"verse":"For if we have been planted together in him in the likeness of his death, we shall be also in the likeness of his resurrection,"},{"num":6,"verse":"knowing this: that our old man is crucified with him that the body of sin might be destroyed that we should not serve sin any longer."},{"num":7,"verse":"For he that is dead is justified from sin."},{"num":8,"verse":"Now if we die with the Christ, we believe that we shall also live with him,"},{"num":9,"verse":"knowing that the Christ, having been raised from the dead, dies no more; death has no more dominion over him."},{"num":10,"verse":"For he that is dead died unto sin once, and he that lives, lives unto God."},{"num":11,"verse":"Likewise also reckon yourselves to be truly dead unto sin, but alive unto God in Christ, Jesus, our Lord."},{"num":12,"verse":"Therefore do not let sin reign in your mortal body that ye should obey it in the lusts thereof."},{"num":13,"verse":"Neither present your members as instruments of unrighteousness unto sin, but present yourselves unto God as those that are alive from the dead and your members as instruments of righteousness unto God."},{"num":14,"verse":"So that sin shall have no dominion over you; for ye are not under the law, but under grace."},{"num":15,"verse":"What then? shall we sin because we are not under the law, but under grace? No, in no wise."},{"num":16,"verse":"Or know ye not that to whom ye present yourselves slaves to obey, his slaves ye are to whom ye obey, whether of sin unto death or of the obedience unto righteousness?"},{"num":17,"verse":"Thank God that, although ye were the slaves of sin, ye have obeyed from the heart that form of doctrine unto which ye are delivered;"},{"num":18,"verse":"and freed from sin, ye are become the slaves of righteousness."},{"num":19,"verse":"I speak a human thing because of the weakness of our flesh: that as ye presented your members to serve uncleanness and iniquity unto iniquity, likewise now present your members to serve righteousness unto holiness."},{"num":20,"verse":"For being previously the slaves of sin, now ye have been made the slaves of righteousness."},{"num":21,"verse":"What fruit had ye then in those things of which ye are now ashamed? for the end of those things is death."},{"num":22,"verse":"But now freed from sin and made slaves to God, ye have as your fruit sanctification and as the end, everlasting life."},{"num":23,"verse":"For the wages of sin is death, but the grace of God is eternal life in Christ Jesus our Lord."}]