[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 25:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 25:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Confidence in an unfaithful man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “As a broken tooth, or leg out of joint, not only fails a man when he comes to use them, but likewise puts him into pain; so doth a faithless person serve them that depend upon him, when they have the greatest need of his help; and such also is the confidence that a faithless person himself places in riches, or craft, or great friends, &c, which some time or other will disappoint him to his great grief, when he expects the most from them.” — Bishop Patrick.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:19. Confidence in an unfaithful man is painful and vexatious; when we put any stress on him, he not only fails, but makes us feel for it. 20. We take a wrong course if we think to relieve those in sorrow by endeavouring to make them merry. 21,22. The precept to love even our enemies is an Old Testament commandment. Our Saviour has shown his own great example in loving us when we were enemies. 23. Slanders would not be so readily spoken, if they were not readily heard. Sin, if it receives any check, becomes cowardly. 24. It is better to be alone, than to be joined to one who is a hinderance to the comfort of life. 25. Heaven is a country afar off; how refreshing is good news from thence, in the everlasting gospel, which signifies glad tidings, and in the witness of the Spirit with our spirits that we are God's children! 26. When the righteous are led into sin, it is as hurtful as if the public fountains were poisoned. 27. We must be, through grace, dead to the pleasures of sense, and also to the praises of men. 28. The man who has no command over his anger, is easily robbed of peace. Let us give up ourselves to the Lord, and pray him to put his Spirit within us, and cause us to walk in his statutes.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Stress is to be laid on the uselessness of the \"broken tooth\" and the \"foot out of joint,\" or tottering, rather than on the pain connected with them. The King James Version loses the emphasis and point of the Hebrew by inverting the original order, which is \"a broken ... joint is confidence\" etc. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. Treachery annoys as well as deceives.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " It is not only deceitful, but hurtful, as a broken tooth though it make show of helping, yet is not only unhelpful to a man for chewing his meat, but also troublesome and painful; and as a foot out of joint doth not help, but hinder and pain, him that attempts to walk upon it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Confidence in an unfaithful man in time of trouble,.... It is not good to put confidence in any man, not in princes, nor in the best of men; much less in an unfaithful, prevaricating, and treacherous man; and especially in a time of distress and trouble, depending on his help and assistance, which is leaning on a broken reed, and trusting to a broken staff. Or, \"the confidence of an unfaithful man in time of trouble\" (o); that which he puts confidence in; who trusts in his riches, or in his righteousness, or in his own heart, all which are vain and deceitful: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "is like a broken tooth, and a foot out of joint; which are so far from being of any use, the one in eating food, and the other in walking, that they are both an hindrance to those actions, and cause pain and uneasiness: or, \"a bad tooth\", so the Targum and Syriac version; a rotten one. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o)  \"fiducia praevaricatoris\", Pagninus, Montanus, Mercerus, Gejerus; \"fiducia perfidi\", Cocceius, Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o)  \"fiducia praevaricatoris\", Pagninus, Montanus, Mercerus, Gejerus; \"fiducia perfidi\", Cocceius, Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Confidence in an unfaithful man in time of trouble is like a broken tooth, and a foot out of joint.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Hebrew (see on Ver. 11), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A broken tooth, and a foot out of joint - confidence in an unfaithful man in time of trouble.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A faithless man is as little to be relied on in a time of need as a loose or broken tooth, and a foot unsteady or actually dislocated. You cannot bite on the one, you cannot walk on the other; so the perfidious man fails you when most wanted. Septuagint, \"The way [",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὁδὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vatican, is probably a clerical error for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὀδοὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "al",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] of the wicked, and the foot of the transgressor, shall perish in an evil day.\" A Bengal maxim runs, \"A loose tooth and a feeble friend are equally bad\" (Lane). Proverbs 25:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19 A worthless tooth and an unsteady foot - ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     Trust in a faithless man in the day of need.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The form רעה (with Mercha on the antepenult), Isaiah 29:19, takes the place of an inf. absol.; רעה here (about the tone syllable of which Dech does not decide, thus without doubt Milra) is certainly not a subst.: tooth of breaking (Gesen.); for how strange such a designation of a worthless tooth! שׁן is indeed mas. in 1 Samuel 14:5, but it can also be used as fem., as רגל, which is for the most part fem., also occurs as mas., Gttche. 650. Bttcher, in the new Aehrenlese, and in the Lehrbuch, takes רעה as fem. of an adj. רע, after the form חל; but חל is not an adj., and does not form a fem., although it means not merely profanity, but that which is profane; this is true also of the Aram. חוּל; for חוּלתּא, Esther 2:9, Targ., is a female name mistaken by Buxtorf. Are we then to read רעה, with Hitzig, after the lxx? - an unimportant change. We interpret the traditional רעה, with Fleischer, as derived from רועעה, from רועע, breaking to pieces (crumbling), in an intransitive sense. The form מוּעדת is also difficult. Bttcher regards it as also, e.g., Aben Ezra after the example of Gecatilia as part. Kal.  equals  מועדת, \"only on account of the pausal tone and the combination of the two letters מע with  instead of .\" But this vocal change, with its reasons, is merely imaginary. מוּעדת is the part. Pual, with the preformative מ struck out, Ewald 169d. The objection that the part. Pual should be ממעד, after the form מבער, does not prove anything to the contrary; for מועדת cannot be the fem. so as not to coincide with the fem. of the part. Kal, cf. besides to the long  the form without the Dagesh יוּקשׁים, Ecclesiastes 9:12  equals  מיקּשׁים (Arnheim, Gramm. p. 139). רגל מוּעדת is a leg that has become tottering, trembling. He who in a time of need makes a faithless man his ground of confidence, is like one who seeks to bite with a broken tooth, and which he finally crushes, and one who supports himself on a shaking leg, and thus stumbles and falls. The gen. connection מבטח בוגד signifies either the ground of confidence consisting in a faithless man, or the confidence placed in one who is faithless. But, after the Masora, we are to read here, as at Psalm 65:6, מבטח, which Michlol 184a also confirms, and as it is also found in the Venice 1525, Basel 1619, and in Norzi. This מבטה is constr. according to Kimchi, notwithstanding the Kametz; as also משׁקל, Ezra 8:30 (after Abulwald, Kimchi, and Norzi). In this passage before us, מבטח בוגד may signify a deceitful ground of confidence (cf. Habakkuk 2:5), but the two other passages present a genit. connection of the words. We must thus suppose that the ā of מבטח and משׁקל, in these three passages, is regarded as fixed, like the  of the form (Arab.) mif'âl.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The form רעה (with Mercha on the antepenult), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", takes the place of an inf. absol.; רעה here (about the tone syllable of which Dech does not decide, thus without doubt Milra) is certainly not a subst.: tooth of breaking (Gesen.); for how strange such a designation of a worthless tooth! שׁן is indeed mas. in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but it can also be used as fem., as רגל, which is for the most part fem., also occurs as mas., Gttche. 650. Bttcher, in the new Aehrenlese, and in the Lehrbuch, takes רעה as fem. of an adj. רע, after the form חל; but חל is not an adj., and does not form a fem., although it means not merely profanity, but that which is profane; this is true also of the Aram. חוּל; for חוּלתּא, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Targ., is a female name mistaken by Buxtorf. Are we then to read רעה, with Hitzig, after the lxx? - an unimportant change. We interpret the traditional רעה, with Fleischer, as derived from רועעה, from רועע, breaking to pieces (crumbling), in an intransitive sense. The form מוּעדת is also difficult. Bttcher regards it as also, e.g., Aben Ezra after the example of Gecatilia as part. Kal.  equals  מועדת, \"only on account of the pausal tone and the combination of the two letters מע with  instead of .\" But this vocal change, with its reasons, is merely imaginary. מוּעדת is the part. Pual, with the preformative מ struck out, Ewald 169d. The objection that the part. Pual should be ממעד, after the form מבער, does not prove anything to the contrary; for מועדת cannot be the fem. so as not to coincide with the fem. of the part. Kal, cf. besides to the long  the form without the Dagesh יוּקשׁים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 9:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "  equals  מיקּשׁים (Arnheim, Gramm. p. 139). רגל מוּעדת is a leg that has become tottering, trembling. He who in a time of need makes a faithless man his ground of confidence, is like one who seeks to bite with a broken tooth, and which he finally crushes, and one who supports himself on a shaking leg, and thus stumbles and falls. The gen. connection מבטח בוגד signifies either the ground of confidence consisting in a faithless man, or the confidence placed in one who is faithless. But, after the Masora, we are to read here, as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 65:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", מבטח, which Michlol 184a also confirms, and as it is also found in the Venice 1525, Basel 1619, and in Norzi. This מבטה is constr. according to Kimchi, notwithstanding the Kametz; as also משׁקל, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 8:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (after Abulwald, Kimchi, and Norzi). In this passage before us, מבטח בוגד may signify a deceitful ground of confidence (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but the two other passages present a genit. connection of the words. We must thus suppose that the ā of מבטח and משׁקל, in these three passages, is regarded as fixed, like the  of the form (Arab.) mif'âl.",
            "children": []
          }
        ]
      }
    ]
  }
]