[{"num":1,"verse":"This is the Word of the Lord which came to Micah of Moresheth about Samaria and Jerusalem in the days of Jotham, Ahaz, and Hezekiah, kings of Judah."},{"header":"Israel Is Judged"},{"num":2,"verse":"Hear, O people, all of you. Listen, O earth and all who are in it. The Lord God will speak against you from His holy house. "},{"num":3,"verse":"See, the Lord is coming from His place. He will come down and walk on the high places of the earth. "},{"num":4,"verse":"The mountains will melt under Him and the valleys will break open, like a candle in front of the fire, like water poured down a hill. "},{"num":5,"verse":"All this is because Jacob would not obey and because of the sins of the people of Israel. What is Jacob’s sin? Is it not Samaria? What is the high place of Judah? Is it not Jerusalem? "},{"num":6,"verse":"So I will make Samaria a waste in the open country, making it a place to plant grape-fields. I will pour her stones down into the valley, and lay open the base of the city. "},{"num":7,"verse":"All of her false gods will be broken to pieces. Everything given in the place of worship will be burned with fire. I will destroy all her objects of worship, for she gathered them from the pay of a woman who sells the use of her body. They will return to pay a woman who sells the use of her body."},{"header":"Jerusalem Will Be Taken"},{"num":8,"verse":"Because of this I must cry out in sorrow. I must go without shoes and clothing. I must cry out like the wild dogs, and cry in sorrow like the ostriches. "},{"num":9,"verse":"For her hurt cannot be cured. It has come to Judah. It has come to the gate of my people, even to Jerusalem. "},{"num":10,"verse":"Do not tell about it in Gath. Do not cry at all. Roll in the dust in Beth-leaphrah. "},{"num":11,"verse":"Go on your way, people of Shaphir, without clothing and in shame. The people of Zaanan do not come out. Cries of sorrow come from Beth-ezel. Its help is taken from you. "},{"num":12,"verse":"Those who live in Maroth become weak waiting for good, because trouble has come down from the Lord to the gate of Jerusalem. "},{"num":13,"verse":"Tie the war-wagons to the horses, you people of Lachish. You were the beginning of sin to the people of Zion, for the sins of Israel were found in you. "},{"num":14,"verse":"So give gifts to Moresheth-gath. The people of Achzib will fool the kings of Israel. "},{"num":15,"verse":"I will bring one who will beat you in battle, O people of Mareshah. The shining-greatness of Israel will come to Adullam. "},{"num":16,"verse":"Cut off all your hair in sorrow for the children you love. Let no hair be on your head like the eagle, for your children will be taken away from you."}]