[{"num":52,"verse":"¶ Awake, awake; put on thy strength, O Zion; put on thy beautiful garments, O Jerusalem, the holy city: for from now on the uncircumcised and the unclean shall no longer come into thee."},{"num":2,"verse":"Shake thyself from the dust; arise and sit down, O Jerusalem: loose thyself from the bands of thy neck, O captive daughter of Zion."},{"num":3,"verse":"For thus saith the LORD, Ye have sold yourselves for nothing; and ye shall be redeemed without money."},{"num":4,"verse":"For thus has the Lord GOD said, My people went down aforetime into Egypt to sojourn there; and the Assyrian captured them without cause."},{"num":5,"verse":"Now therefore, what have I here, saith the LORD, that my people is taken away for nothing? And those among my people that take rule over them make them to howl, saith the LORD; and my name is continually blasphemed every day."},{"num":6,"verse":"Therefore my people shall know my name for this reason in that day: for even I that speak, behold, I shall be present."},{"num":7,"verse":"¶ How beautiful upon the mountains are the feet of him that brings good tidings, that publishes peace, that brings good tidings of good, that publishes saving health, that saith unto Zion, Thy God reigns!"},{"num":8,"verse":"The voice of thy watchmen! They shall lift up the voice; together they shall rejoice: for they shall see eye to eye, how the LORD shall return to bring again Zion."},{"num":9,"verse":"Sing praises, rejoice together, ye waste places of Jerusalem: for the LORD has comforted his people, he has redeemed Jerusalem."},{"num":10,"verse":"The LORD has made bare the arm of his holiness before the eyes of all the Gentiles; and all the ends of the earth shall see the saving health of our God."},{"num":11,"verse":"Depart ye, depart ye, go ye out from there, touch no unclean thing; go ye out of the midst of her; be ye clean, that bear the vessels of the LORD."},{"num":12,"verse":"For ye shall not go out with haste, nor go by flight: for the LORD will go before you; and the God of Israel will gather you together."},{"num":13,"verse":"¶ Behold, my slave shall be prospered; he shall be exalted and extolled, and be very high."},{"num":14,"verse":"As many rejected thee, in such manner was his likeness and his beauty, disfigured from the sons of men:"},{"num":15,"verse":"But he shall sprinkle many Gentiles; the kings shall shut their mouths over him: for that which had not been told them they shall see; and that which they had not heard they shall understand."}]