[{"header":"Babylon Controls Jehoiakim"},{"num":24,"verse":"In his days, Nebuchadnezzar king of Babylon came up, and Jehoiakim became his servant for three years; then he turned and rebelled against him. "},{"num":2,"verse":"The Lord sent marauding bands of Chaldeans, Arameans (Syrians), Moabites, and Ammonites against Jehoiakim. And He sent them against Judah to destroy it, in accordance with the word of the Lord which He spoke through His servants the prophets. "},{"num":3,"verse":"Surely this came on Judah at the command of the Lord, to remove them from His sight because of the sins of [King] Manasseh, in accordance with everything that he had done, "},{"num":4,"verse":"and also for the innocent blood that he shed, for he filled Jerusalem with innocent blood; and the Lord would not pardon it. "},{"num":5,"verse":"Now the rest of the acts of Jehoiakim, and everything that he did, are they not written in the Book of the Chronicles of the Kings of Judah?"},{"header":"Jehoiachin Reigns"},{"num":6,"verse":"So Jehoiakim slept with his fathers [in death], and his son Jehoiachin became king in his place. "},{"num":7,"verse":"The king of Egypt did not come out of his land again, because the king of Babylon had taken everything that belonged to the king of Egypt, from the river of Egypt to the river Euphrates."},{"num":8,"verse":"Jehoiachin was eighteen years old when he became king, and he reigned [only] three months in Jerusalem. His mother’s name was Nehushta daughter of Elnathan of Jerusalem. "},{"num":9,"verse":"He did evil in the sight of the Lord, in accordance with everything that his father had done."},{"header":"Deportation to Babylon"},{"num":10,"verse":"At that time the servants of Nebuchadnezzar king of Babylon went up to Jerusalem, and the city came under siege. "},{"num":11,"verse":"Nebuchadnezzar king of Babylon came to the city while his servants were besieging it. "},{"num":12,"verse":"Jehoiachin king of Judah surrendered to the king of Babylon, he and his mother and his servants and his captains and his [palace] officials. So the king of Babylon took him prisoner in the eighth year of his [own] reign. "},{"num":13,"verse":"He carried out of there (Jerusalem) all the treasures of the house (temple) of the Lord, and the treasures of the house (palace) of the king, and cut in pieces all the articles of gold in the temple of the Lord, which Solomon king of Israel had made, just as the Lord had said. "},{"num":14,"verse":"He led away into exile all Jerusalem and all the captains and all the brave men, ten thousand captives, and all the craftsmen and the smiths. None remained except the poorest people of the land."},{"num":15,"verse":"Nebuchadnezzar led Jehoiachin away into exile to Babylon; also he took the king’s mother and the king’s wives and his officials and the leading men of the land [including Ezekiel] as exiles from Jerusalem to Babylon. "},{"num":16,"verse":"And the king of Babylon brought as exiles to Babylon all the brave men, seven thousand [of them], and the craftsmen and the smiths, a thousand [of them], all strong and fit for war."},{"header":"Zedekiah Made King"},{"num":17,"verse":"Then the king of Babylon made Mattaniah, Jehoiachin’s uncle, king in his place, and changed his name to Zedekiah."},{"num":18,"verse":"Zedekiah was twenty-one years old when he became king, and he reigned for eleven years in Jerusalem. His mother’s name was Hamutal daughter of Jeremiah of Libnah. "},{"num":19,"verse":"He did evil in the sight of the Lord, in accordance with everything that Jehoiakim had done. "},{"num":20,"verse":"Because of the anger of the Lord these things happened in Jerusalem and Judah, and it [finally] came to the point that He cast them from His presence. And Zedekiah rebelled against the king of Babylon."}]