[{"num":24,"verse":"In his yamim Nevuchadnetzar Melech Bavel came up, and Y’hoyakim became his eved (servant, vassal) shalosh shanim; then he turned and rebelled against him."},{"num":2,"verse":"And Hashem sent against him gedudim (soldiers of the army) of the Kasdim, and gedudim of Aram (Syria) and gedudim of Mo’av and gedudim of Bnei Ammon, and sent them against Yehudah to destroy it, according to the Devar Hashem, which He spoke by His avadim the Nevi’im."},{"num":3,"verse":"Surely at the command of Hashem came this upon Yehudah, to remove them out of His sight, for the chattot of Menasheh, according to all that he did;"},{"num":4,"verse":"And also for the dahm hanaki (innocent blood) that he shed; for he filled Yerushalayim with dahm naki; which Hashem would not pardon."},{"num":5,"verse":"Now the rest of the acts of Y’hoyakim, and all that he did, are they not written in the Sefer Divrei HaYamim of the Melachim of Yehudah?"},{"num":6,"verse":"So Y’hoyakim slept with his Avot; and Y’hoyakhin bno reigned in his place."},{"num":7,"verse":"And Melech Mitzrayim came not again any more out of his land; for Melech Bavel had taken from the Wadi Mitzrayim unto Nahar Euphrates all that belonged to Melech Mitzrayim."},{"num":8,"verse":"Y’hoyakhin was 18 years old when he began to reign, and he reigned in Yerushalayim 3 chodashim. And shem immo was Nechushta Bat Elnatan of Yerushalayim."},{"num":9,"verse":"And he did that which was rah in the eyes of Hashem, according to all that his Aviv had done."},{"num":10,"verse":"At that time the avadim of Nevuchadnetzar Melech Bavel came up against Yerushalayim, and the Ir was besieged."},{"num":11,"verse":"Nevuchadnetzar Melech Bavel came against the Ir, and his avadim did besiege it."},{"num":12,"verse":"And Y’hoyakhin Melech Yehudah went out to Melech Bavel, he, and immo, and his avadim, and his sarim, and his sarisim; and Melech Bavel took him in the 8th year of his reign."},{"num":13,"verse":"And he carried off there all the otzerot of the Beis Hashem, and the otzerot of the Bais HaMelech, and cut in pieces kol kelei hazahav which Sh’lomo Melech Yisroel had made in the Heikhal Hashem, as Hashem had said."},{"num":14,"verse":"And he carried away into the Golus all Yerushalayim, and all the sarim, and all the gibborei hachayil, even ten thousand Golus captives, and all the charash and masger (smiths, artisans); none remained, except the dalat am ha’aretz (poor people of the land)."},{"num":15,"verse":"And he carried away Y’hoyakhin to Bavel, and the Em HaMelech, and the nashim of HaMelech, and his sarisim, and the leading men of HaAretz, those he carried into the Golus from Yerushalayim to Babylon."},{"num":16,"verse":"And all the anshei hachayil, even shivat alafim, and a thousand charash and masger, all that were gibborim for making milchamah, even them Melech Bavel took into the Golus to Babylon."},{"num":17,"verse":"And Melech Bavel made Matanyah dodo (his [Y’hoyakhin’s] uncle) Melech in his place, and changed shmo to Tzidkiyahu (Zedekiah)."},{"num":18,"verse":"Tzidkiyau (Zedekiah) was twenty and one shanah when he began to reign, and he reigned eleven shanah in Yerushalayim. And shem immo was Chamutal Bat Yirmeyahu of Livnah."},{"num":19,"verse":"And he did that which was rah in the eyes of Hashem, according to all that Y’hoyakim had done."},{"num":20,"verse":"For through the anger of Hashem this came about in Yerushalayim and Yehudah, until He cast them out from His presence. And Tzidkiyahu (Zedekiah) rebelled against Melech Bavel."}]