[{"header":"The Lord Promises To Give the Land Back to His People"},{"num":1,"verse":"I was still being held prisoner in the courtyard of the palace guards when the Lord told me:"},{"num":3,"verse":"Ask me, and I will tell you things that you don’t know and can’t find out."},{"num":4,"verse":"Many of the houses in Jerusalem and some of the buildings at the royal palace have been torn down to be used in repairing the walls to keep out the Babylonian attackers. Now there are empty spaces where the buildings once stood. But I am furious, and these spaces will be filled with the bodies of the people I kill. The people of Jerusalem will cry out to me for help, but they are evil, and I will ignore their prayers."},{"num":6,"verse":"Then someday, I will heal this place and my people as well, and let them enjoy unending peace. "},{"num":7,"verse":"I will give this land to Israel and Judah once again, and I will make them as strong as they were before. "},{"num":8,"verse":"They sinned and rebelled against me, but I will forgive them and take away their guilt. "},{"num":9,"verse":"When that happens, all nations on earth will see the good things I have done for Jerusalem, and how I have given it complete peace. The nations will celebrate and praise and honor me, but they will also tremble with fear."},{"num":10,"verse":"Jeremiah, you say that this land is a desert without people or animals, and for now, you are right. The towns of Judah and the streets of Jerusalem are deserted, and people and animals are nowhere to be seen. But someday you will hear "},{"num":11,"verse":"happy voices and the sounds of parties and wedding celebrations. And when people come to my temple to offer sacrifices to thank me, you will hear them say:"},{"num":12,"verse":"Now it is empty, without people or animals. But when that time comes, shepherds will take care of their flocks in pastures near every town in the hill country, in the foothills to the west, in the Southern Desert, in the land of the Benjamin tribe, and around Jerusalem and the towns of Judah."},{"header":"The Lord’s Wonderful Promise"},{"num":14,"verse":"The Lord said:"},{"num":17,"verse":"The king of Israel will be one of David’s descendants, "},{"num":18,"verse":"and there will always be priests from the Levi tribe serving at my altar and offering sacrifices to please me and to give thanks."},{"num":19,"verse":"Then the Lord told me:"},{"num":20,"verse":"I, the Lord, have an agreement with day and night, so they always come at the right time. You can’t break the agreement I made with them, "},{"num":21,"verse":"and you can’t break the agreements I have made with David’s family and with the priests from the Levi tribe who serve at my altar. A descendant of David will always rule as king of Israel, "},{"num":22,"verse":"and there will be more descendants of David and of the priests from the Levi tribe than stars in the sky or grains of sand on the beach."},{"num":23,"verse":"The Lord also said:"},{"num":24,"verse":"You’ve heard foreigners insult my people by saying, “The Lord chose Israel and Judah, but now he has rejected them, and they are no longer a nation.”"},{"num":25,"verse":"Jeremiah, I will never break my agreement with the day and the night or let the sky and the earth stop obeying my commands. "},{"num":26,"verse":"In the same way, I will never reject the descendants of Abraham, Isaac, and Jacob or break my promise that they will always have a descendant of David as their king. I will be kind to my people Israel, and they will be successful again."}]