[[],[{"type":"header","content":"Things You Could Never Figure Out on Your Own"},{"type":"prose","content":"While Jeremiah was still locked up in jail, a second Message from  was given to him:"}],[{"type":"prose","content":"“This is ’s Message, the God who made earth, made it livable and lasting, known everywhere as  ‘Call to me and I will answer you. I’ll tell you marvelous and wondrous things that you could never figure out on your own.’"}],[{"type":"prose","content":"“This is what , the God of Israel, has to say about what’s going on in this city, about the homes of both people and kings that have been demolished, about all the ravages of war and the killing by the Chaldeans, and about the streets littered with the dead bodies of those killed because of my raging anger—about all that’s happened because the evil actions in this city have turned my stomach in disgust."}],[{"type":"prose","content":"“But now take another look. I’m going to give this city a thorough renovation, working a true healing inside and out. I’m going to show them life whole, life brimming with blessings. I’ll restore everything that was lost to Judah and Jerusalem. I’ll build everything back as good as new. I’ll scrub them clean from the dirt they’ve done against me. I’ll forgive everything they’ve done wrong, forgive all their rebellions. And Jerusalem will be a center of joy and praise and glory for all the countries on earth. They’ll get reports on all the good I’m doing for her. They’ll be in awe of the blessings I am pouring on her."}],[{"type":"prose","content":"“Yes, ’s Message: ‘You’re going to look at this place, these empty and desolate towns of Judah and streets of Jerusalem, and say, “A wasteland. Unlivable. Not even a dog could live here.” But the time is coming when you’re going to hear laughter and celebration, marriage festivities, people exclaiming, “Thank -of-the-Angel-Armies. He’s so good! His love never quits,” as they bring thank offerings into ’s Temple. I’ll restore everything that was lost in this land. I’ll make everything as good as new.’ I, , say so."}],[{"type":"prose","content":"“-of-the-Angel-Armies says: ‘This coming desolation, unfit for even a stray dog, is once again going to become a pasture for shepherds who care for their flocks. You’ll see flocks everywhere—in the mountains around the towns of the Shephelah and Negev, all over the territory of Benjamin, around Jerusalem and the towns of Judah—flocks under the care of shepherds who keep track of each sheep.’  says so."},{"type":"header","content":"A Fresh and True Shoot from the David-Tree"}],[{"type":"prose","content":"“‘Watch for this: The time is coming’—’s Decree—‘when I will keep the promise I made to the families of Israel and Judah. When that time comes, I will make a fresh and true shoot sprout from the David-Tree. He will run this country honestly and fairly. He will set things right. That’s when Judah will be secure and Jerusalem live in safety. The motto for the city will be, “ Has Set Things Right for Us.”  has made it clear that there will always be a descendant of David ruling the people of Israel and that there will always be Levitical priests on hand to offer burnt offerings, present grain offerings, and carry on the sacrificial worship in my honor.’”* * *"}],[{"type":"prose","content":"’s Message to Jeremiah: “ says, ‘If my covenant with day and my covenant with night ever fell apart so that day and night became haphazard and you never knew which was coming and when, then and only then would my covenant with my servant David fall apart and his descendants no longer rule. The same goes for the Levitical priests who serve me. Just as you can’t number the stars in the sky nor measure the sand on the seashore, neither will you be able to account for the descendants of David my servant and the Levites who serve me.’”* * *"}],[{"type":"prose","content":"’s Message to Jeremiah: “Have you heard the saying that’s making the rounds: ‘The two families  chose, Israel and Judah, he disowned’? And have you noticed that my people are treated with contempt, with rumors afoot that there’s nothing to them anymore?"}],[{"type":"prose","content":"“Well, here’s ’s response: ‘If my covenant with day and night wasn’t in working order, if sky and earth weren’t functioning the way I set them going, then, but only then, you might think I had disowned the descendants of Jacob and of my servant David, and that I wouldn’t set up any of David’s descendants over the descendants of Abraham, Isaac, and Jacob. But as it is, I will give them back everything they’ve lost. The last word is, I will have mercy on them.’”"}]]