[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Art thou also become weak as we?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The question implies, of course, an affirmative answer. The king of Babylon, the report of whose coming had roused awe and wonder, is found to be as weak as any of the other Rephaim, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eidôla, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or shadowy forms, of Homer (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Il, xxiii.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 72). With these words the vision of the spectral world ends, and the next verse takes up the taunting song of the liberated Israelites, the language of which is, however, influenced by the imagery of the vision.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-23 The whole plan of Divine Providence is arranged with a view to the good of the people of God. A settlement in the land of promise is of God's mercy. Let the church receive those whom God receives. God's people, wherever their lot is cast, should endeavour to recommend religion by a right and winning conversation. Those that would not be reconciled to them, should be humbled by them. This may be applied to the success of the gospel, when those were brought to obey it who had opposed it. God himself undertakes to work a blessed change. They shall have rest from their sorrow and fear, the sense of their present burdens, and the dread of worse. Babylon abounded in riches. The king of Babylon having the absolute command of so much wealth, by the help of it ruled the nations. This refers especially to the people of the Jews; and it filled up the measure of the king of Babylon's sins. Tyrants sacrifice their true interest to their lusts and passions. It is gracious ambition to covet to be like the Most Holy, for he has said, Be ye holy, for I am holy; but it is sinful ambition to aim to be like the Most High, for he has said, He who exalts himself shall be abased. The devil thus drew our first parents to sin. Utter ruin should be brought upon him. Those that will not cease to sin, God will make to cease. He should be slain, and go down to the grave; this is the common fate of tyrants. True glory, that is, true grace, will go up with the soul to heaven, but vain pomp will go down with the body to the grave; there is an end of it. To be denied burial, if for righteousness' sake, may be rejoiced in, Mt 5:12. But if the just punishment of sin, it denotes that impenitent sinners shall rise to everlasting shame and contempt. Many triumphs should be in his fall. God will reckon with those that disturb the peace of mankind. The receiving the king of Babylon into the regions of the dead, shows there is a world of spirits, to which the souls of men remove at death. And that souls have converse with each other, though we have none with them; and that death and hell will be death and hell indeed, to all who fall unholy, from the height of this world's pomps, and the fulness of its pleasures. Learn from all this, that the seed of evil-doers shall never be renowned. The royal city is to be ruined and forsaken. Thus the utter destruction of the New Testament Babylon is illustrated, Re 18:2. When a people will not be made clean with the besom of reformation, what can they expect but to be swept off the face of the earth with the besom of destruction?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "All they shall speak ... - Language of astonishment that one so proud, and who apparently never expected to die, should be brought down to that humiliating condition. It is a severe taunt at the great change which had taken place in a haughty monarch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. They taunt him and derive from his calamity consolation under their own (Eze 31:16).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "weak—as a shade bereft of blood and life. Rephaim, \"the dead,\" may come from a Hebrew root, meaning similarly \"feeble,\" \"powerless.\" The speech of the departed closes with Isa 14:11.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who wast king of kings, and far superior to us in power and authority, that didst neither fear God nor reverence man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that didst slay whom thou wouldst, and keep alive whom thou wouldst",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 5:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 5:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "All they shall speak, and say unto thee,.... So they would say, could they speak, and are here represented as if they did: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "art thou become also weak as we? who had been more powerful than they, had been too many for them, and had subdued them, and ruled over them, and was not only looked upon as invincible but as immortal, yea, as a deity; and yet now was become \"sick\", as the word (b) signifies, or by sickness brought to death, and by death enfeebled and rendered weak and without strength, stripped of all natural strength, as well as of all civil power and authority: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "art thou become like unto us? who thought himself, and was flattered by others, that there were none like unto him; but now as the rest of the dead, and upon a level with them. So will it be with the Romish antichrist, who now exalts himself above all that is called God, and reigns over the kings of the earth, and shows himself as if he was God, and of whom his parasites say, \"who is like unto the beast? who is able to make war with him?\" when he shall be consumed by Christ, and cast into the lake of fire with the devil and false prophet, he will be like the kings of the earth deceived by him, and the rest of the worshippers of him, and be as weak as they, 2 Thessalonians 2:4, Revelation 20:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "art thou become like unto us? who thought himself, and was flattered by others, that there were none like unto him; but now as the rest of the dead, and upon a level with them. So will it be with the Romish antichrist, who now exalts himself above all that is called God, and reigns over the kings of the earth, and shows himself as if he was God, and of whom his parasites say, \"who is like unto the beast? who is able to make war with him?\" when he shall be consumed by Christ, and cast into the lake of fire with the devil and false prophet, he will be like the kings of the earth deceived by him, and the rest of the worshippers of him, and be as weak as they, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Thessalonians 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) a \"aegrotuss fuit\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) a \"aegrotuss fuit\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "All they shall speak and say unto thee, Art thou also become weak as we? art thou become like unto us?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Art thou also become weak as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "So thou also art made weak as we!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (On the supposed weakness of the dead, see the comment on ver. 9.) Isaiah 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And how do they greet this lofty new-comer? \"They all rise up and say to thee, Art thou also made weak like us? art thou become like us?\" This is all that the shades say; what follows does not belong to them. The pual chullâh (only used here), \"to be made sickly, or powerless,\" signifies to be transposed into the condition of the latter, viz., the Repahim (a word which also occurs in the Phoenician inscriptions, from רפא  equals  רפה, to be relaxed or weary), since the life of the shades is only a shadow of life (cf., εἴδωλα ἄκικυς, and possibly also καμόντες in Homer, when used in the sense of those who are dying, exhausted and prostrate with weakness). And in Hades we could not expect anything more than this expression of extreme amazement. For why should they receive their new comrade with contempt or scorn? From ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " onwards, the singers of the mashal take up the song again. ",
        "children": []
      }
    ]
  }
]