[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He who smote . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which smote, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the whole verse being of the nature of a relative clause, with the “sceptre” for antecedent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A continual stroke.—Literally, a stroke without ceasing.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "A continual stroke.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "a stroke without ceasing.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Is persecuted, and none hindereth.—Better, completing the parallelism, with a trampling that is not stayed.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Is persecuted, and none hindereth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "completing ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the parallelism, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "with a trampling that is not stayed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 14:6-11. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 14:6-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He that ruled the nations in anger ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— With rigour, and not with clemency; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is persecuted and none hindereth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Neither the Babylonians themselves nor their confederates. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The whole earth is at rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — The subjects of that vast empire who groaned under his cruel bondage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yea, the cedars of Lebanon ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Which were felled for the service of his pride and luxury, but are now suffered to stand and flourish. It is a figure usual in sacred and profane writers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hell ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The invisible world, or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the grave, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the same word is rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in innumerable other places; to which he elegantly ascribes sense and speech, as poets and orators frequently do; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is moved to meet thee at thy coming ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— And to compliment thee on thy arrival in their dark regions. “This image of the state of the dead, or the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Infernum Poeticum ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of the Hebrews, is taken from their custom of burying, those at least of the higher rank, in large sepulchral vaults hewn in the rock. Of this kind of sepulchres there are remains at Jerusalem now extant; and some that are said to be the sepulchres of the kings of Judah: see Maundrell, p. 76. You are to form to yourself an idea of an immense subterraneous vault, a vast gloomy cavern, all round the sides of which are cells to receive the dead bodies; here the deceased monarchs lie in a distinguished sort of state, suitable to their former rank, each on his own couch, with his arms beside him, his sword at his head, and the bodies of his chiefs and companions round about him: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 32:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These illustrious shades rise at once from their couches, as from their thrones; and advance to the entrance of the cavern to meet the king of Babylon, and to receive him with insults on his fall.” — Bishop Lowth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All they shall say, Art thou become weak as we? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Thou, who wast king of kings, and far superior to us in power and authority? that didst neither fear God nor reverence man, but rather didst rank thyself among the immortals; thou, before whom all people, nations, and languages trembled and feared, art thou come to take thy fate with us poor mortal men? Where now is thy power and thy glory? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thy pomp is brought down to the grave ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Is lost and buried with thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the noise of thy viols ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— All thy musical instruments, which were much used in Babylon, and were doubtless used in Belshazzar’s solemn feasts, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) at which time the city was taken; to which possibly the prophet here alludes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The worm is spread under thee ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Instead of those stately carpets upon which thou didst frequently tread.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-23 The whole plan of Divine Providence is arranged with a view to the good of the people of God. A settlement in the land of promise is of God's mercy. Let the church receive those whom God receives. God's people, wherever their lot is cast, should endeavour to recommend religion by a right and winning conversation. Those that would not be reconciled to them, should be humbled by them. This may be applied to the success of the gospel, when those were brought to obey it who had opposed it. God himself undertakes to work a blessed change. They shall have rest from their sorrow and fear, the sense of their present burdens, and the dread of worse. Babylon abounded in riches. The king of Babylon having the absolute command of so much wealth, by the help of it ruled the nations. This refers especially to the people of the Jews; and it filled up the measure of the king of Babylon's sins. Tyrants sacrifice their true interest to their lusts and passions. It is gracious ambition to covet to be like the Most Holy, for he has said, Be ye holy, for I am holy; but it is sinful ambition to aim to be like the Most High, for he has said, He who exalts himself shall be abased. The devil thus drew our first parents to sin. Utter ruin should be brought upon him. Those that will not cease to sin, God will make to cease. He should be slain, and go down to the grave; this is the common fate of tyrants. True glory, that is, true grace, will go up with the soul to heaven, but vain pomp will go down with the body to the grave; there is an end of it. To be denied burial, if for righteousness' sake, may be rejoiced in, Mt 5:12. But if the just punishment of sin, it denotes that impenitent sinners shall rise to everlasting shame and contempt. Many triumphs should be in his fall. God will reckon with those that disturb the peace of mankind. The receiving the king of Babylon into the regions of the dead, shows there is a world of spirits, to which the souls of men remove at death. And that souls have converse with each other, though we have none with them; and that death and hell will be death and hell indeed, to all who fall unholy, from the height of this world's pomps, and the fulness of its pleasures. Learn from all this, that the seed of evil-doers shall never be renowned. The royal city is to be ruined and forsaken. Thus the utter destruction of the New Testament Babylon is illustrated, Re 18:2. When a people will not be made clean with the besom of reformation, what can they expect but to be swept off the face of the earth with the besom of destruction?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He who smote - This may either refer to the king of Babylon, or to the rod or scepter which he had used, and which was now broken. Herder refers it to the scepter, 'that which smote the nations.' (On the meaning of the word \"smote,\" see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The people - The nations that were subject to his authority.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With a continual stroke - Margin, 'A stroke without removing.' Vulgate, Plaga insanabili - 'With an incurable plague.' - Septuagint the same - Πληγῇ ἀνιάτῳ  Plēgē aniatō. The Hebrew is, as in the margin, 'A smiting without removing,' or without cessation. There was no relaxation in its oppressions, it was always engaged in acts of tyranny.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He that ruled the nations - Babylon was the capital of a vast empire, and that empire was composed of many dependent nations.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Is persecuted - By those that make war upon it. Its turn had come to be oppressed, and overthrown.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And none hindereth - No nation opposes the invader. None of the dependent kingdoms of Babylon have any real attachment to it, but all rejoice at its downfall. The most mighty kingdom of the earth is helpless and ruined. What a change was this! How sudden and striking the revolution! And what a warning to proud and guilty cities! ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And none hindereth - No nation opposes the invader. None of the dependent kingdoms of Babylon have any real attachment to it, but all rejoice at its downfall. The most mighty kingdom of the earth is helpless and ruined. What a change was this! How sudden and striking the revolution! And what a warning to proud and guilty cities! ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. people—the peoples subjected to Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "is persecuted—the Hebrew is rather, active, \"which persecuted them, without any to hinder him\" [Vulgate, Jerome, and Horsley].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In anger; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with rigour, and not with clemency, as many conquerors have done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Non hindereth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " neither the Babylonians themselves, nor their confederates, could withstand the power of the Medes and Persians. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He who smote the people in wrath with a continual stroke,.... The king of Babylon, who made war with the people and nations of the earth, and conquered them, smote them with the edge of the sword to gratify his passions, and satiate his bloodthirsty mind; and those that were spared, he ruled with rigour, and oppressed them with tribute and hard bondage; and, when he had conquered one nation, attacked another, and so went on pursuing his victories without intermission, giving no respite neither to his army, nor to the people: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he that ruled the nations in anger; not with justice and clemency, but in a tyrannical and oppressive way, even his own nation, as well as the nations whom he subdued: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "is persecuted; is, pursued by the justice of God, overtaken and seized, and brought to condign punishment; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and none hindereth; the execution of the righteous judgment upon him; none of the neighbouring kings and nations, either tributary to him, or in alliance with him, give him the least help or assistance, or attempt to ward off the blow upon him, given him, under the direction and appointment of God, by Cyrus the Persian. So the Romish antichrist, who has made war with the saints, and has smitten them with the sword, and gone on to do so without any intermission for ages together, and has tyrannised over them in a most cruel manner, he shall be persecuted, and taken, and brought to his end, and there shall be none to help him; see Revelation 13:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and none hindereth; the execution of the righteous judgment upon him; none of the neighbouring kings and nations, either tributary to him, or in alliance with him, give him the least help or assistance, or attempt to ward off the blow upon him, given him, under the direction and appointment of God, by Cyrus the Persian. So the Romish antichrist, who has made war with the saints, and has smitten them with the sword, and gone on to do so without any intermission for ages together, and has tyrannised over them in a most cruel manner, he shall be persecuted, and taken, and brought to his end, and there shall be none to help him; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He who smote the people in wrath with a continual stroke, he that ruled the nations in anger, is persecuted, and {d} none hindereth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He who smote the people in wrath with a continual stroke, he that ruled the nations in anger, is persecuted, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " none hindereth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) That is, he permitted all violence and injuries to be done.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, as R.V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the antecedent being the staff,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is persecuted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "none hindereth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. “with a persecution that none restrained.” The parallelism requires instead of “persecution” a noun cognate with the verb rendered “rule,” as in the preceding line. An easy emendation (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mirdath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "murdâph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") supplies this; and this reading is almost universally accepted. The balance of clauses is then perfect:—",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That struck the peoples in anger,—with incessant stroke",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ";",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That trod down the nations in wrath,—with unrelenting tread",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He who smote the people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "which smote the peoples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The participle translated \"he who smote\" refers to \"staff\" or \"scepter.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "With a continual stroke",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " incessantly, one war following another without pause or stop. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He that ruled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "which ruled the nations in anger with a persecution that held not back",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Isaiah 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The song of the redeemed is a song concerning the fall of the king of Babel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Instead of the hiphil hinniach (to let down) of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", we have here, as in the original passage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the form hēniach, which is commonly used in the sense of quieting, or procuring rest. עצב is trouble which plagues (as עמל is trouble which oppresses), and rōgez restlessness which wears out with anxious care (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 3:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 12:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The assimilated min before the two words is pronounced mĭ, with a weak reduplication, instead of mē, as elsewhere, before ח, ה, and even before ר    (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 23:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 18:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the relative clause עבּד־בך אשר, אשר is not the Hebrew casus adverb. answering to the Latin ablative qu servo te usi sunt; not do בך ... אשר belong to one another in the sense of quo, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", qu (vitul); but it is regarded as an acc. obj. according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", qu'on t'a fait servir, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 32:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", qu'on donne la terre (Luzzatto). When delivered from such a yoke of bondage, Israel would raise a mâshâl. According to its primary and general meaning, mâshâl signifies figurative language, and hence poetry generally, more especially that kind of proverbial poetry which loves the emblematical, and, in fact, any artistic composition that is piquant in its character; so that the idea of what is satirical or defiant may easily be associated with it, as in the passage before us.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The words are addressed to the Israel of the future in the Israel of the present, as in Isaiah 12:1. The former would then sing, and say as follows. \"How hath the oppressor ceased! The place of torture ceased! Jehovah hath broken the rod of the wicked, the ruler's staff, which cmote nations in wrath with strokes without ceasing subjugated nations wrathfully with hunting than nevers stays.\" Not one of the early translators ever thought of deriving the hap. leg. madhebâh from the Aramaean dehab (gold), as Vitringa, Aurivillius, and Rosenmller have done. The former have all translated the word as if it were marhēbâh (haughty, violent treatment), as corrected by J. D. Michaelis, Doederlein, Knobel, and others. But we may arrive at the same result without altering a single letter, if we take דּאב as equivalent to דּהב, דּוּב, to melt or pine away, whether we go back to the kal or to the hiphil of the verb, and regard the Mem as used in a material or local sense. We understand it, according to madmenah (dunghill) in Isaiah 25:10, as denoting the place where they were reduced to pining away, i.e., as applied to Babylon as the house of servitude where Israel had been wearied to death. The tyrant's sceptre, mentioned in Isaiah 14:5, is the Chaldean world-power regarded as concentrated in the king of Babel (cf., shēbet in Numbers 24:17). This tyrant's sceptre smote nations with incessant blows and hunting: maccath is construed with macceh, the derivative of the same verb; and murdâph, a hophal noun (as in Isaiah 9:1; Isaiah 29:3), with rodeh, which is kindred in meaning. Doederlein's conjecture (mirdath), which has been adopted by most modern commentators, is quite unnecessary. Unceasing continuance is expressed first of all with bilti, which is used as a preposition, and followed by sârâh, a participial noun like câlâh, and then with b'li, which is construed with the finite verb as in Genesis 31:20; Job 41:18; for b'li châsâk is an attributive clause: with a hunting which did not restrain itself, did not stop, and therefore did not spare. Nor is it only Israel and other subjugated nations that now breathe again. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The words are addressed to the Israel of the future in the Israel of the present, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The former would then sing, and say as follows. \"How hath the oppressor ceased! The place of torture ceased! Jehovah hath broken the rod of the wicked, the ruler's staff, which cmote nations in wrath with strokes without ceasing subjugated nations wrathfully with hunting than nevers stays.\" Not one of the early translators ever thought of deriving the hap. leg. madhebâh from the Aramaean dehab (gold), as Vitringa, Aurivillius, and Rosenmller have done. The former have all translated the word as if it were marhēbâh (haughty, violent treatment), as corrected by J. D. Michaelis, Doederlein, Knobel, and others. But we may arrive at the same result without altering a single letter, if we take דּאב as equivalent to דּהב, דּוּב, to melt or pine away, whether we go back to the kal or to the hiphil of the verb, and regard the Mem as used in a material or local sense. We understand it, according to madmenah (dunghill) in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 25:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as denoting the place where they were reduced to pining away, i.e., as applied to Babylon as the house of servitude where Israel had been wearied to death. The tyrant's sceptre, mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is the Chaldean world-power regarded as concentrated in the king of Babel (cf., shēbet in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 24:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This tyrant's sceptre smote nations with incessant blows and hunting: maccath is construed with macceh, the derivative of the same verb; and murdâph, a hophal noun (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), with rodeh, which is kindred in meaning. Doederlein's conjecture (mirdath), which has been adopted by most modern commentators, is quite unnecessary. Unceasing continuance is expressed first of all with bilti, which is used as a preposition, and followed by sârâh, a participial noun like câlâh, and then with b'li, which is construed with the finite verb as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 31:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 41:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for b'li châsâk is an attributive clause: with a hunting which did not restrain itself, did not stop, and therefore did not spare. Nor is it only Israel and other subjugated nations that now breathe again. ",
            "children": []
          }
        ]
      }
    ]
  }
]