[{"num":88,"verse":"1 A grievous complaint of the faithful, sore afflicted by sickness, persecutions and adversity, 7 Being as it were left of God without any consolation. 13 Yet he calleth on God by faith, and striveth against desperation. 18 Complaining himself to be forsaken of all earthly help."},{"num":1,"verse":"O Lord God of my salvation, I cry day and night before thee."},{"num":2,"verse":"Let my prayer enter into thy presence: incline thine ear unto my cry."},{"num":3,"verse":"For my soul is filled with evils, and my life draweth near to the grave."},{"num":4,"verse":"I am counted among them that go down unto the pit, and am as a man without strength,"},{"num":5,"verse":"Free among the dead, like the slain laying in the grave, when thou rememberest no more, and they are cut off from thy hand."},{"num":6,"verse":"Thou hast laid me in the lowest pit, in darkness, and in the deep."},{"num":7,"verse":"Thine indignation lieth upon me, and thou hast vexed me with all thy waves. Selah."},{"num":8,"verse":"Thou hast put away mine acquaintance far from me, and made me to be abhorred of them: I am shut up, and cannot get forth."},{"num":9,"verse":"Mine eye is sorrowful through mine affliction: Lord, I call daily upon thee: I stretch out mine hands unto thee."},{"num":10,"verse":"Wilt thou show a miracle to the dead? or shall the dead rise and praise thee? Selah."},{"num":11,"verse":"Shall thy loving kindness be declared in the grave? or thy faithfulness in destruction?"},{"num":12,"verse":"Shall thy wondrous works be known in the dark? and thy righteousness in the land of oblivion?"},{"num":13,"verse":"But unto thee, have I cried, O Lord, and early shall my prayer come before thee."},{"num":14,"verse":"Lord, why dost thou reject my soul, and hidest thy face from me?"},{"num":15,"verse":"I am afflicted and at the point of death: from my youth I suffer thy terrors, doubting of my life. "},{"num":16,"verse":"Thine indignations go over me, and thy fear hath cut me off."},{"num":17,"verse":"They came round about me daily like water, and compassed me together."},{"num":18,"verse":"My lovers and friends hast thou put away from me, and mine acquaintance hid themselves."}]