[{"header":"Jesus Is Handed Over To The Authorities"},{"num":18,"verse":"Having said these things, Jesus went-out with His disciples to the other side of the ravine of Kidron where there was a garden, into which He entered, He and His disciples. "},{"num":2,"verse":"Now Judas, the one handing Him over, also knew the place, because Jesus often was gathered there with His disciples. "},{"num":3,"verse":"So Judas— having received the [Roman] cohort, and officers from the chief priests and from the Pharisees— comes there with lanterns and torches and weapons. "},{"num":4,"verse":"Then Jesus, knowing all the things coming upon Him, went forth. And He says to them, “Whom are you seeking?” "},{"num":5,"verse":"They answered Him, “Jesus the Nazarene”. He says to them, “I am He”. Now Judas, the one handing Him over, was also standing there with them. "},{"num":6,"verse":"So when He said to them, “I am He”, they went back, and fell on the ground. "},{"num":7,"verse":"Then He again asked them, “Whom are you seeking?” And the ones said, “Jesus the Nazarene”. "},{"num":8,"verse":"Jesus responded, “I told you that I am He. If then you are seeking Me, permit these ones to go”— "},{"num":9,"verse":"in order that the word which He spoke might be fulfilled, that “The ones whom You have given Me— I did not lose any of them”. "},{"num":10,"verse":"Then Simon Peter, having a sword, drew it and hit the slave of the high priest, and cut-off his right ear. And the name for the slave was Malchus. "},{"num":11,"verse":"Then Jesus said to Peter, “Put the sword into the sheath. The cup which the Father has given Me— shall not I drink it?”"},{"header":"Jesus Stands Before Annas And Caiaphas"},{"num":12,"verse":"Then the [Roman] cohort and its commander, and the officers of the Jews, arrested Jesus, and bound Him. "},{"num":13,"verse":"And they led Him to Annas first. For he was the father-in-law of Caiaphas, who was the high priest of that year. "},{"num":14,"verse":"And Caiaphas was the one having counseled the Jews that it was better that one Man die for the people."},{"header":"Peter Denies Jesus"},{"num":15,"verse":"Now Simon Peter and another disciple were following Jesus. And that disciple was known to the high priest, and he entered with Jesus into the courtyard of the high priest. "},{"num":16,"verse":"But Peter was standing at the door outside. So the other disciple, the one known by the high priest, went out and spoke to the doorkeeper, and brought in Peter. "},{"num":17,"verse":"Then the doorkeeper servant-girl says to Peter, “You are not also one of the disciples of this man, are you?” That one says, “I am not”. "},{"num":18,"verse":"And the slaves and the officers, having made a charcoal-fire because it was cold, were standing there and warming themselves. And Peter was also with them, standing there and warming himself."},{"header":"Jesus Says To Annas, Question Those Who Heard Me. He Is Led Out to Caiaphas"},{"num":19,"verse":"So the high priest questioned Jesus about His disciples, and about His teaching. "},{"num":20,"verse":"Jesus answered him, “I have spoken in public to the world. I always taught at synagogue, and in the temple, where all the Jews come together. And I spoke nothing in secret. "},{"num":21,"verse":"Why are you questioning Me? Question the ones having heard what I spoke to them. Look, these ones know the things which I said”. "},{"num":22,"verse":"And He having said these things, one of the officers standing near gave Jesus a slap, having said, “In this manner do you answer the high priest?” "},{"num":23,"verse":"Jesus answered him, “If I spoke wrongly, testify about the thing wrong. But if I spoke rightly, why do you beat Me?” "},{"num":24,"verse":"Then Annas sent Him forth, having been bound, to Caiaphas the high priest."},{"header":"Peter Denies Jesus a Second And Third Time"},{"num":25,"verse":"And Simon Peter is standing there and warming himself. So they said to him, “You are not also one of His disciples, are you?” That one denied it and said, “I am not”. "},{"num":26,"verse":"One of the slaves of the high priest, being a relative of the one of whom Peter cut-off the ear, says, “Did I not see you in the garden with Him?” "},{"num":27,"verse":"Then again Peter denied it. And immediately a rooster crowed."},{"header":"Jesus Stands Before Pilate"},{"num":28,"verse":"Then they lead Jesus from Caiaphas to the Praetorium. And it was early-morning. And they themselves did not enter into the Praetorium in order that they might not be defiled, but might eat the Passover [Feast]."},{"header":"The Jewish Rulers Tell Pilate They Want Jesus Executed"},{"num":29,"verse":"So Pilate went outside to them. And he says, “What accusation do you bring against this man?” "},{"num":30,"verse":"They responded and said to him, “If this One were not doing wrong, we would not have handed Him over to you”. "},{"num":31,"verse":"So Pilate said to them, “You take Him and judge Him according to your Law”. The Jews said to him, “It is not lawful for us to execute anyone”— "},{"num":32,"verse":"in order that the word of Jesus might be fulfilled which He spoke signifying by what kind of death He was going to die."},{"header":"Jesus Says To Pilate, My Kingdom Is Not of This World"},{"num":33,"verse":"So Pilate entered again into the Praetorium, and called Jesus. And he said to Him, “Are You the King of the Jews?” "},{"num":34,"verse":"Jesus answered, “Are you saying this from yourself, or did others tell you about Me?” "},{"num":35,"verse":"Pilate answered, “I am not a Jew, am I? Your nation and the chief priests handed You over to me. What did You do?” "},{"num":36,"verse":"Jesus answered, “My kingdom is not of this world. If My kingdom were of this world, My servants would be fighting in order that I might not be handed-over to the Jews. But as-it-is, My kingdom is not from here”. "},{"num":37,"verse":"Therefore Pilate said to Him, “So-then You are a king?” Jesus answered, “You are saying that I am a king. I have been born for this. And I have come into the world for this: that I might testify to the truth. Everyone being of the truth hears My voice”. "},{"num":38,"verse":"Pilate says to Him, “What is truth?”"},{"header":"Pilate Finds No Charge Against Jesus, But Has Him Whipped"},{"num":39,"verse":"But it is a custom for you that I release one prisoner for you at the Passover [Feast]. So do you wish me to release the King of the Jews for you?” "},{"num":40,"verse":"Then they shouted back, saying, “Not this One, but Barabbas!” Now Barabbas was a robber. "}]