[{"header":"The Betrayal and Arrest of Jesus(A)"},{"num":18,"verse":"When Jesus had spoken these words, He went out with His disciples across the Kidron Valley. There was a garden which He and His disciples entered."},{"num":2,"verse":"Now Judas, who betrayed Him, also knew the place, for Jesus often met there with His disciples. "},{"num":3,"verse":"So Judas, having taken a detachment of soldiers and officers from the chief priests and Pharisees, came there with lanterns and torches and weapons."},{"num":4,"verse":"Jesus therefore, knowing everything that would happen to Him, went forward and said to them, “Whom do you seek?”"},{"num":5,"verse":"They answered Him, “Jesus of Nazareth.”"},{"num":6,"verse":"When He said, “I am He,” they drew back and fell to the ground."},{"num":7,"verse":"Again Jesus asked them, “Whom do you seek?”"},{"num":8,"verse":"Jesus answered, “I told you that I am He. So then let these go their way if you are looking for Me.” "},{"num":9,"verse":"This was to fulfill the word which He had spoken, “I have lost none of those whom You have given Me.”"},{"num":10,"verse":"Then Simon Peter, having a sword, drew it and struck the high priest’s servant, and cut off his right ear. The servant’s name was Malchus."},{"num":11,"verse":"Then Jesus said to Peter, “Put your sword into the sheath. Shall I not drink the cup which My Father has given Me?”"},{"header":"Jesus Before the High Priest(B)"},{"num":12,"verse":"Then the detachment of soldiers and the commander and the officers of the Jews arrested Jesus and bound Him. "},{"num":13,"verse":"First they led Him to Annas, for he was the father-in-law to Caiaphas, who was the high priest that year. "},{"num":14,"verse":"Now it was Caiaphas who advised the Jews that it was expedient that one man should die for the people."},{"header":"Peter’s Denial of Jesus(C)"},{"num":15,"verse":"Simon Peter followed Jesus, and so did another disciple. That disciple was known to the high priest and went with Jesus into the courtyard of the high priest. "},{"num":16,"verse":"But Peter stood at the door outside. Then the other disciple, who was known to the high priest, went out and spoke to the doorkeeper and brought Peter in."},{"num":17,"verse":"Then the servant girl, being the doorkeeper, said to Peter, “Are you not also one of this Man’s disciples?”"},{"num":18,"verse":"Now the servants and officers stood there and warmed themselves, having made a fire of coals, for it was cold. Peter also stood with them and warmed himself."},{"header":"The High Priest Questions Jesus(D)"},{"num":19,"verse":"The high priest then asked Jesus about His disciples and His teaching."},{"num":20,"verse":"Jesus answered him, “I spoke openly to the world. I always taught in the synagogue and in the temple, where the Jews always meet, and I said nothing in secret. "},{"num":21,"verse":"Why do you ask Me? Ask those who heard Me and what I have said to them. Certainly they know what I said.”"},{"num":22,"verse":"When He had said this, one of the officers who stood by struck Jesus with the palm of his hand, saying, “Is that how You answer the high priest?”"},{"num":23,"verse":"Jesus answered him, “If I have spoken evil, bear witness of the evil, but if well, why do you strike me?” "},{"num":24,"verse":"Then Annas sent Him bound to Caiaphas the high priest."},{"header":"Peter Denies Jesus Again(E)"},{"num":25,"verse":"Meanwhile Simon Peter was standing and warming himself. So they said to him, “Are you not also one of His disciples?”"},{"num":26,"verse":"One of the servants of the high priest, being a relative of the man whose ear Peter cut off, said, “Did I not see you in the garden with Him?” "},{"num":27,"verse":"Peter then denied it again, and immediately a rooster crowed."},{"header":"Jesus Before Pilate(F)"},{"num":28,"verse":"Then they led Jesus from Caiaphas to the Praetorium. It was early. Yet they themselves did not enter the Praetorium, so that they might not be defiled, but might eat the Passover. "},{"num":29,"verse":"Pilate then went out to them and said, “What accusation do you bring against this Man?”"},{"num":30,"verse":"They answered him, “If He were not an evildoer, we would not have handed Him over to you.”"},{"num":31,"verse":"Then Pilate said, “Take Him and judge Him according to your law.”"},{"num":32,"verse":"that the saying of Jesus might be fulfilled which He spoke, signifying what death He would die."},{"num":33,"verse":"Again Pilate entered the Praetorium, called Jesus, and said to Him, “Are You the King of the Jews?”"},{"num":34,"verse":"Jesus answered him, “Are you speaking of your own accord, or did others tell you about Me?”"},{"num":35,"verse":"Pilate answered, “Am I a Jew? Your own nation and the chief priests handed You over to me. What have You done?”"},{"num":36,"verse":"Jesus answered, “My kingdom is not of this world. If My kingdom were of this world, then My servants would fight, that I would not be handed over to the Jews. But now My kingdom is not from here.”"},{"num":37,"verse":"Therefore Pilate said to Him, “Then are You a king?”"},{"num":38,"verse":"Pilate said to Him, “What is truth?” When he had said this, he went out again to the Jews and said to them, “I find no guilt in Him at all."},{"header":"Jesus Sentenced to Die(G)"},{"num":39,"verse":"“But you have a custom, that I should release someone to you at the Passover. Do you therefore want me to release to you the King of the Jews?”"},{"num":40,"verse":"They all shouted again, “Not this Man, but Barabbas!” Now Barabbas was a robber."}]