[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 10:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou hast granted me life — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thou didst not only give me a curious body, but also a reasonable soul: thou didst at first give me life, and then maintain it in me: both when I was in the womb, (which is a marvellous work of God,) and afterward, when I was unable to do any thing to preserve my own life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And favour — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thou didst not give mere life, but many other favours, such as nourishment by the breast, education, knowledge, and instruction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thy visitation — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The care of thy providence watching over me for my good, and visiting me in mercy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "preserved my spirit — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "My life, which is liable to manifold dangers, if God did not watch over us every day and moment. Thou hast hitherto done great things for me, given me life, and the blessings of life, and daily deliverances: and wilt thou now undo all that thou hast done? And shall I, who have been such an eminent monument of thy mercy, now be a spectacle of thy vengeance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:8-13 Job seems to argue with God, as if he only formed and preserved him for misery. God made us, not we ourselves. How sad that those bodies should be instruments of unrighteousness, which are capable of being temples of the Holy Ghost! But the soul is the life, the soul is the man, and this is the gift of God. If we plead with ourselves as an inducement to duty, God made me and maintains me, we may plead as an argument for mercy, Thou hast made me, do thou new-make me; I am thine, save me.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thy visitation hath preserved my spirit - Thy constant care; thy watchful providence; thy superintendence. The word rendered visitation (פקדה  peqûddâh) means properly the mustering of an army, the care that is manifested in looking after those who are enlisted; and then denotes care, vigilance, providence, custody, watch. The idea is, that God had watched over him and preserved him, and that to his constant vigilance he owed the preservation of his life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. visitation—Thy watchful Providence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "spirit—breath.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Thou didst not only give me a curious body, but also a living and a reasonable soul: thou didst at first give me life, and then maintain it in me; both when I was in the womb, (which is a marvellous work of God,) and afterward, when I was unable to do any thing to preserve my own life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Favour, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "benignity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bounty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mercy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "kindness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which is here, as oft elsewhere, put for its fruits or effects. Thou didst not give a mere life, but many other favours necessary, or convenient, or belonging to it, such as nourishment by the breast, education, knowledge, and instruction, &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy visitation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i. e. the care of thy providence watching over me for my good, and visiting me in mercy; as God’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "visiting",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is understood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 4:31 Luke 1:78",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 4:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:78",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", though elsewhere it is an act of punishment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. my soul or life, which is liable to manifold casualties and dangers, if God did not watch over us and guard us every day and moment. Thou hast hitherto done great things for me, given me life, and the blessings of life, and daily preservations and deliverances; and wilt thou now undo all that thou hast done? and shall I, who have been such an eminent monument of thy mercy, now be made a spectacle of thy vengeance, and that without cause? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thou hast granted me life and favour,.... Or \"lives\" (q); natural life; both in the womb, where and when he was quickened, and at his birth, when he was brought into the world, and began to live in it; the rational soul may be intended, by which he lived; which, when created and infused into man, and united to his body, he becomes a living man; it is the presence of that which causes life, and the absence or removal of that which causes death; and this is a \"grant\" or gift from God, who gives to all his creatures life and breath, and all things; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 33:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and is a \"favour\" also; a mercy, the chief of mercies; it is more than meat; yea, all a man has he will give for his life: besides this, Job had a spiritual life, a principle of it implanted in him; God had quickened him when dead in trespasses and sins; the spirit of life from Christ had entered into him, and he was become a living spiritual man: this likewise was a \"grant\" from God, a free grace gift of his; it is he that gives the living water, and gives it freely, or it would not be grace; for it is a \"favour\" which flows from the free grace and good will of God; it is owing to the great love wherewith he loves men that he quickens them; his time is a time of love, and so of life; and eternal life is the consequent of this, and is inseparably connected with it; and Job had an interest in it, a right unto it, and a meetness for it; he bad knowledge of it, faith in it, and hope of enjoying it, and knew that after death he should live this life; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and this is a gift of God through Christ, owing to his good pleasure, the fruit of his favour and loving kindness: though by \"favour\" may be meant something distinct from life; either the care of him in the womb, and the taking of him out from thence, which are sometimes observed as singular mercies and favours; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or the beauty and comeliness of his body, such as was on Moses, David, and others; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 31:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or rather it intends in general all the temporal blessings of life, food and raiment, every thing necessary for the comfort and support of life; and which are all mercies and favours, and what men are undeserving of; and especially spiritual blessings, or the blessings of grace; and the word here used is often used for grace and mercy, and may signify the several graces of the Spirit bestowed in regeneration, as faith, hope, love, &c. which are all the gifts of God, and the effects of his favour and good will; as also the blessings of, justifying, pardoning, and adopting grace; all which Job was favoured with, as well as with supplies of grace from time to time, and the fresh discoveries of the favour and loving kindness of God to him, which is better than life: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and thy visitation hath preserved my spirit; kept him alive, in a natural sense, while in the womb, as Jarchi, where he was in a wonderful manner nourished; and when he came out from thence, exposed to many difficulties and dangers, and during his helpless and infant state, and amidst a variety of troubles throughout the whole of his life hitherto; and which was owing to God's visitation of him in a way of mercy every morning; and which was no other than his providence or daily care of him, and concern for him; and so Mr. Broughton renders it \"thy providence\" (r), and so some others: likewise he preserved his soul or spirit in a spiritual sense, in Christ Jesus, in whose bands he put him; he hid his life in him, and bound it up in the bundle of life with him; he kept him by his power as in a garrison, and preserved him safe to his kingdom and glory; and this is to be ascribed to his visitation of him in a way of grace, through the redemption of Christ, and the effectual calling of the blessed Spirit, and the constant supplies of grace vouchsafed from time to time: the Targum is, \"thy remembrance\": for it is owing to God's remembrance of his people that he visits them, either in providence or grace; and when he visits them with his providence, or with his gracious presence and protection, it is plain he remembers them: now since God had favoured him with such blessings of nature, providence, and grace, he reasons with him about his present circumstances; that, after all this, surely he would not destroy him and cut him off; at least he knew not how well to reconcile past favours with such hard and severe usage as he thought he met with from him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) \"vitas\", Montanus, Bolducius. (r) \"providentia tua\", Tigurine version, Munster, Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) \"vitas\", Montanus, Bolducius. (r) \"providentia tua\", Tigurine version, Munster, Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thou hast granted me life and {m} favour, and thy {n} visitation hath preserved my spirit.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thou hast granted me life and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " favour, and thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " visitation hath preserved my spirit.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) That is, reason and understanding, and many other gifts, by which man excels all earthly creatures.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) That is, the fatherly care and providence by which you preserved me, and without which I would perish immediately.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "granted me life and favour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i. e. granted me life and shewn me loving kindness. The verse speaks of God’s dealing with Job from the time he was born and became a living man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy visitation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i. e. thy providence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou hast granted me life and favour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God, besides providing Job with a body so delicately and marvellously constructed, had added the gift of \"life\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and also that of \"favour,\" or loving providential care, whereby his life was preserved from infancy to manhood, and from manhood to a ripe age, in peace and prosperity. Job has not forgotten his former state of temporal happiness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:2-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), nor ceased to feel gratitude to God for it (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And thy visitation hath preserved my spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thy providence -",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"thy continual care.\" Job 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  8  Thy hands have formed and perfected me",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Altogether round about, and Thou hast now swallowed me up!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  9  Consider now, that Thou has perfected me as clay,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And wilt Thou turn me again into dust?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10  Hast Thou not poured me out as milk,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And curdled me as curd?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11  With skin and flesh hast Thou clothed me,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And Thou hast intertwined me with bones and sinews;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "12  Life and favour Thou hast shown me,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And thy care hath guarded my breath.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The development of the embryo was regarded by the Israelitish Chokma as one of the greatest mysteries (Ecclesiastes 11:5; 2 Macc. 7:22f.). There are two poetical passages which treat explicitly of this mysterious existence: this strophe of the book of Job, and the Psalm by David, Psalm 139:13-16 (Psychol. S. 210). The assertion of Scheuchzer, Hoffmann, and Oetinger, that these passages of Scripture \"include, and indeed go beyond, all recent systemata generationis,\" attributes to Scripture a design of imparting instruction, - a purpose which is foreign to it. Scripture nowhere attempts an analysis of the workings of nature, but only traces them back to their final cause. According to the view of Scripture, a creative act similar to the creation of Adam is repeated at the origin of each individual; and the continuation of development according to natural laws is not less the working of God than the creative planting of the very beginning. Thy hands, says Job, have formed (עצּב, to cut, carve, fashion; cognate are חצב, קצב, without the accompanying notion of toil, which makes this word specially appropriate, as describing the fashioning of the complicated nature of man) and perfected me. We do not translate: made; for עשׂה stands in the same relation to ברא and יצר as perficere to creare and fingere (Genesis 2:2; Isaiah 43:7). יחד refers to the members of the body collectively, and סביב to the whole form. The perfecting as clay implies three things: the earthiness of the substance, the origin of man without his knowledge and co-operation, and the moulding of the shapeless substance by divine power and wisdom. The primal origin of man, de limo terrae (Job 33:6; Psalm 139:15), is repeated in the womb. The figures which follow (Job 10:10) describe this origin, which being obscure is all the more mysterious, and glorifies the power of God the more. The sperma is likened to milk; the חתּיך (used elsewhere of smelting), which Seb. Schmid rightly explains rem colliquatam fundere et immittere in formam aliquam, refers to the nisus formativus which dwells in it. The embryo which is formed from the sperma is likened to גּבינה, which means in all the Semitic dialects cheese (curd). \"As whey\" (Ewald, Hahn) is not suitable; whey does not curdle; in making cheese it is allowed to run off from the curdled milk. \"As cream\" (Schlottm.) is not less incorrect; cream is not lac coagulatum, which the word signifies. The embryo forming itself from the sperma is like milk which is curdled and beaten into shape.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The development of the embryo was regarded by the Israelitish Chokma as one of the greatest mysteries (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; 2 Macc. 7:22f.). There are two poetical passages which treat explicitly of this mysterious existence: this strophe of the book of Job, and the Psalm by David, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:13-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Psychol. S. 210). The assertion of Scheuchzer, Hoffmann, and Oetinger, that these passages of Scripture \"include, and indeed go beyond, all recent systemata generationis,\" attributes to Scripture a design of imparting instruction, - a purpose which is foreign to it. Scripture nowhere attempts an analysis of the workings of nature, but only traces them back to their final cause. According to the view of Scripture, a creative act similar to the creation of Adam is repeated at the origin of each individual; and the continuation of development according to natural laws is not less the working of God than the creative planting of the very beginning. Thy hands, says Job, have formed (עצּב, to cut, carve, fashion; cognate are חצב, קצב, without the accompanying notion of toil, which makes this word specially appropriate, as describing the fashioning of the complicated nature of man) and perfected me. We do not translate: made; for עשׂה stands in the same relation to ברא and יצר as perficere to creare and fingere (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). יחד refers to the members of the body collectively, and סביב to the whole form. The perfecting as clay implies three things: the earthiness of the substance, the origin of man without his knowledge and co-operation, and the moulding of the shapeless substance by divine power and wisdom. The primal origin of man, de limo terrae (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is repeated in the womb. The figures which follow (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") describe this origin, which being obscure is all the more mysterious, and glorifies the power of God the more. The sperma is likened to milk; the חתּיך (used elsewhere of smelting), which Seb. Schmid rightly explains rem colliquatam fundere et immittere in formam aliquam, refers to the nisus formativus which dwells in it. The embryo which is formed from the sperma is likened to גּבינה, which means in all the Semitic dialects cheese (curd). \"As whey\" (Ewald, Hahn) is not suitable; whey does not curdle; in making cheese it is allowed to run off from the curdled milk. \"As cream\" (Schlottm.) is not less incorrect; cream is not lac coagulatum, which the word signifies. The embryo forming itself from the sperma is like milk which is curdled and beaten into shape.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The consecutio temporum, moreover, must be observed here. It is, for example, incorrect to translate, with Ewald: Dost Thou not let me flow away like milk, etc. Job looks back to the beginning of his life; the four clauses, Job 10:10, Job 10:11, under the control of the first two verbs (Job 10:8), which influence the whole strophe, are also retrospective in meaning. The futt. are consequently like synchronous imperff.; as, then, Job 10:12 returns to perff., Job 10:11 describes the development of the embryo to the full-grown infant, on which Grotius remarks: Hic ordo est in genitura: primum pellicula fit, deinde in ea caro, duriora paulatim accedunt, and by Job 10:12, the manifestations of divine goodness, not only in the womb, but from the beginning of life and onwards, are intended. The expression \"Life and favour (this combination does not occur elsewhere) hast Thou done to me\" is zeugmatic: He has given him life, and sustained that life amidst constant proofs of favour; His care has guarded the spirit (רוּח), by which his frame becomes a living and self-conscious being. This grateful retrospect is interspersed with painful reflections, in which Job gives utterance to his feeling of the contrast between the manifestation of the divine goodness which he had hitherto experienced and his present condition. As in Job 10:8., ותּבלּעני, which Hirzel wrongly translates: and wilt now destroy me; it is rather: and hast now swallowed me up, i.e., drawn me down into destruction, as it were brought me to nought; or even, if in the fut. consec., as is frequently the case, the consecutive and not the aorist signification preponderates: and now swallowest me up; and in Job 10:9 (where, though not clear from the syntax, it is clear from the substance that תשׁיבני is not to be understood as an imperfect, like the futt. in Job 10:10.): wilt Thou cause me to become dust again? The same tone is continued in the following strophe. Thus graciously has he been brought into being, and his life sustained, in order that he may come to such a terrible end. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The consecutio temporum, moreover, must be observed here. It is, for example, incorrect to translate, with Ewald: Dost Thou not let me flow away like milk, etc. Job looks back to the beginning of his life; the four clauses, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", under the control of the first two verbs (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which influence the whole strophe, are also retrospective in meaning. The futt. are consequently like synchronous imperff.; as, then, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " returns to perff., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " describes the development of the embryo to the full-grown infant, on which Grotius remarks: Hic ordo est in genitura: primum pellicula fit, deinde in ea caro, duriora paulatim accedunt, and by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the manifestations of divine goodness, not only in the womb, but from the beginning of life and onwards, are intended. The expression \"Life and favour (this combination does not occur elsewhere) hast Thou done to me\" is zeugmatic: He has given him life, and sustained that life amidst constant proofs of favour; His care has guarded the spirit (רוּח), by which his frame becomes a living and self-conscious being. This grateful retrospect is interspersed with painful reflections, in which Job gives utterance to his feeling of the contrast between the manifestation of the divine goodness which he had hitherto experienced and his present condition. As in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ותּבלּעני, which Hirzel wrongly translates: and wilt now destroy me; it is rather: and hast now swallowed me up, i.e., drawn me down into destruction, as it were brought me to nought; or even, if in the fut. consec., as is frequently the case, the consecutive and not the aorist signification preponderates: and now swallowest me up; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (where, though not clear from the syntax, it is clear from the substance that תשׁיבני is not to be understood as an imperfect, like the futt. in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".): wilt Thou cause me to become dust again? The same tone is continued in the following strophe. Thus graciously has he been brought into being, and his life sustained, in order that he may come to such a terrible end. ",
            "children": []
          }
        ]
      }
    ]
  }
]