[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 10:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Are thy days as the days of man? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Man’s time is short and uncertain, and therefore he must improve it, and diligently search out the crimes of malefactors, lest by death he lose the opportunity of doing justice: but thou art eternal, and seest at one view all men’s hearts, and all their actions, present and to come; and therefore thou dost not need to proceed with me in this manner, by making so long a scrutiny into my heart and life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-7 Job, being weary of his life, resolves to complain, but he will not charge God with unrighteousness. Here is a prayer that he might be delivered from the sting of his afflictions, which is sin. When God afflicts us, he contends with us; when he contends with us, there is always a reason; and it is desirable to know the reason, that we may repent of and forsake the sin for which God has a controversy with us. But when, like Job, we speak in the bitterness of our souls, we increase guilt and vexation. Let us harbour no hard thoughts of God; we shall hereafter see there was no cause for them. Job is sure that God does not discover things, nor judge of them, as men do; therefore he thinks it strange that God continues him under affliction, as if he must take time to inquire into his sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Are thy days as the days of man - Does thy life pass on like that of man? Dost thou expect soon to die, that thou dost pursue me in this manner, searching out my sins, and afflicting me as if there were no time to lose? The idea is, that God seemed to press this matter as if he were soon to cease to exist, and as if there were no time to spare in accomplishing it. His strokes were unintermitted, as if it were necessary that the work should be done soon, and as if no respite could be given for a full and fair development of the real character of the sufferer. The whole passage ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 10:4-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " expresses the settled conviction of Job that God could not resemble man; Man was short lived, fickle, blind; he was incapable, from the brevity of his existence, and from his imperfections, of judging correctly of the character of others. But it could not be so with God. He was eternal. He knew the heart. He saw everything as it was. Why, then, Job asks with deep feeling, did he deal with him as if he were influenced by the methods of judgment which were inseparable from the condition of imperfect and dying man? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4-6. Dost Thou see as feebly as man? that is, with the same uncharitable eye, as, for instance, Job's friends? Is Thy time as short? Impossible! Yet one might think, from the rapid succession of Thy strokes, that Thou hadst no time to spare in overwhelming me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Man’s time is short and uncertain, and therefore he must improve his time whilst he hath it, and diligently search out the crimes of malefactors, and punish them whilst he may, lest by death he lose the opportunity of doing justice, and the criminal get out of his power. But it is not so with thee, thou art eternal and unchangeable, and seest at one view all men’s hearts, and all their actions present and to come; and therefore thou dost not need to proceed with me in this manner, by making so long and so severe a scrutiny into my heart and life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Are thy days as the days of man?.... No, they are not: not so few; the days of the years of man's life in common are threescore years and ten, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 90:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but a thousand years with the Lord are but as one day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; his days are days not of time, but of eternity: nor so mutable, or he so mutable in them; man is of one mind today, and of another tomorrow; but the Lord is in one mind one day as another; he is the Lord that changes not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; immutable in his nature, purposes, promises, and affections: but Job suggests as if his dispensations towards him showed the contrary; one day smiling upon him, and heaping his favours on him, and the next frowning on him, and stripping him of all: but this was a wrong way of judging; for, though God may change the dispensations of his providence towards men, and particularly his own people, his nature changes not, nor does he change his will, his purposes, and designs, nor his love and affection: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "are thy years as man's days? as few as they, or fail like them? no, he is the same, and his years fail not, and has the same good will to his people in adverse as well as in prosperous dispensations of his providence. Some understand all this in such sense, in connection with what follows, as if Job had observed, that since God was omniscient, and knew and saw all persons and things, his eyes not being like men's eyes, eyes of flesh; and since he was eternal, and wanted not for time, there was no need for him to take such methods as he did with him, through afflictive providences, to find out his sin; since, if he was guilty, it was at once known to him; nor need he be in such haste to do it, since his time was not short, as it is with an envious and ill natured man, who is for losing no time to find out and take an advantage of him he bears an ill will unto. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "are thy years as man's days? as few as they, or fail like them? no, he is the same, and his years fail not, and has the same good will to his people in adverse as well as in prosperous dispensations of his providence. Some understand all this in such sense, in connection with what follows, as if Job had observed, that since God was omniscient, and knew and saw all persons and things, his eyes not being like men's eyes, eyes of flesh; and since he was eternal, and wanted not for time, there was no need for him to take such methods as he did with him, through afflictive providences, to find out his sin; since, if he was guilty, it was at once known to him; nor need he be in such haste to do it, since his time was not short, as it is with an envious and ill natured man, who is for losing no time to find out and take an advantage of him he bears an ill will unto. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Are thy days as the {h} days of man? are thy years as man's days,",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "Are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thy days as the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " days of man? ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thy years as man's days,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Are you inconstant and changeable as the times, today a friend, tomorrow an enemy?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5–7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then he asks if God’s life be brief like human life, that by the inquisition of chastisements He seeks to bring Job’s sin to light, lest His victim should outlive Him, and hurries on his punishment lest some one should rescue His captive from His hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Are thy days as man's days?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In short-lived man, shortsightedness and prejudice are excusable, but not in one whose days are unlike man's days - whose \"years endure throughout all generations\" (Is. 102:24). Such a one ought to be above all human infirmity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Or thy years as man's days?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " We should have expected \"as man's ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "years.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " But it marks the disparity more strongly to say, \"Are thy years not greater in number even than man's [literally, 'a strong man's'] ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "days?\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Job 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  3  Doth it please Thee when Thou oppressest,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That Thou rejectest the work of Thy hands,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "While Thou shinest upon the counsel of the wicked?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  4  Hast Thou eyes of flesh,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or seest Thou as a mortal seeth?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  5  Are Thy days as the days of a mortal,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or Thy years as man's days,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  6  That Thou seekest after my iniquity,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And searchest after my sin?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  7  Although Thou knowest that I am not a wicked man,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And there is none that can deliver out of Thy hand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There are three questions by which Job seeks to exhaust every possible way of accounting for his sufferings as coming from God. These attempts at explanation, however, are at once destroyed, because they proceed upon conceptions which are unworthy of God, and opposed to His nature. Firstly, Whether it gives Him pleasure (טּוב, agreeable, as Job 13:9) when He oppresses, when He despises, i.e., keeps down forcibly or casts from Him as hateful (מאס, as Psalm 89:39; Isaiah 54:6) the work of His hand; while, on the contrary, He permits light to shine from above upon the design of the wicked, i.e., favours it? Man is called the יגיע of the divine hands, as though he were elaborated by them, because at his origin (Genesis 2:7), the continuation of which is the development in the womb (Psalm 139:15), he came into existence in a remarkable manner by the directly personal, careful, and, so to speak, skilful working of God. That it is the morally innocent which is here described, may be seen not only from the contrast (Job 10:3), but also from the fact that he only can be spoken of as oppressed and rejected. Moreover, \"the work of Thy hands\" involves a negative reply to the question. Such an unloving mood of self-satisfaction is contrary to the bounty and beneficence of that love to which man owes his existence. Secondly, Whether God has eyes of flesh, i.e., of sense, which regard only the outward appearance, without an insight into the inner nature, or whether He sees as mortals see, i.e., judges, κατὰ τῆν σάρκα (John 8:15)? Mercier correctly: num ex facie judicas, ut affectibus ducaris more hominum. This question also supplies its own negative; it is based upon the thought that God lookest on the heart (1 Samuel 16:7). Thirdly, Whether His life is like to the brevity of man's life, so that He is not able to wait until a man's sin manifests itself, but must institute such a painful course of investigation with him, in order to extort from him as quickly as possible a confession of it? Suffering appears here to be a means of inquisition, which is followed by the final judgment when the guilt is proved. What is added in Job 10:7 puts this supposition aside also as inconceivable. Such a mode of proceeding may be conceived of in a mortal ruler, who, on account of his short-sightedness, seeks to bring about by severe measures that which was at first only conjecture, and who, from the apprehension that he may not witness that vengeance in which he delights, hastens forward the criminal process as much as possible, in order that his victim may not escape him. God, however, to whom belongs absolute knowledge and absolute power, would act thus, although, etc. על, although, notwithstanding (proceeding from the signification, besides, insuper), as Job 17:16 (Isaiah 53:9), Job 34:6. God knows even from the first that he (Job) will not appear as a guilty person (רשׁע, as in Job 9:29); and however that may be, He is at all events sure of him, for nothing escapes the hand of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There are three questions by which Job seeks to exhaust every possible way of accounting for his sufferings as coming from God. These attempts at explanation, however, are at once destroyed, because they proceed upon conceptions which are unworthy of God, and opposed to His nature. Firstly, Whether it gives Him pleasure (טּוב, agreeable, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 13:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") when He oppresses, when He despises, i.e., keeps down forcibly or casts from Him as hateful (מאס, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 54:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the work of His hand; while, on the contrary, He permits light to shine from above upon the design of the wicked, i.e., favours it? Man is called the יגיע of the divine hands, as though he were elaborated by them, because at his origin (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the continuation of which is the development in the womb (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), he came into existence in a remarkable manner by the directly personal, careful, and, so to speak, skilful working of God. That it is the morally innocent which is here described, may be seen not only from the contrast (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but also from the fact that he only can be spoken of as oppressed and rejected. Moreover, \"the work of Thy hands\" involves a negative reply to the question. Such an unloving mood of self-satisfaction is contrary to the bounty and beneficence of that love to which man owes his existence. Secondly, Whether God has eyes of flesh, i.e., of sense, which regard only the outward appearance, without an insight into the inner nature, or whether He sees as mortals see, i.e., judges, κατὰ τῆν σάρκα (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")? Mercier correctly: num ex facie judicas, ut affectibus ducaris more hominum. This question also supplies its own negative; it is based upon the thought that God lookest on the heart (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 16:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Thirdly, Whether His life is like to the brevity of man's life, so that He is not able to wait until a man's sin manifests itself, but must institute such a painful course of investigation with him, in order to extort from him as quickly as possible a confession of it? Suffering appears here to be a means of inquisition, which is followed by the final judgment when the guilt is proved. What is added in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " puts this supposition aside also as inconceivable. Such a mode of proceeding may be conceived of in a mortal ruler, who, on account of his short-sightedness, seeks to bring about by severe measures that which was at first only conjecture, and who, from the apprehension that he may not witness that vengeance in which he delights, hastens forward the criminal process as much as possible, in order that his victim may not escape him. God, however, to whom belongs absolute knowledge and absolute power, would act thus, although, etc. על, although, notwithstanding (proceeding from the signification, besides, insuper), as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 17:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God knows even from the first that he (Job) will not appear as a guilty person (רשׁע, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and however that may be, He is at all events sure of him, for nothing escapes the hand of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "That operation of the divine love which is first echoed in \"the labour of Thy hands,\" is taken up in the following strophe, and, as Job contemplates it, his present lot seems to him quite incomprehensible. ",
        "children": []
      }
    ]
  }
]