[{"num":21,"verse":"Now Yehoshaphat slept with his avot, and was buried with his avot in Ir Dovid. And Yehoram bno reigned in his place."},{"num":2,"verse":"And he had achim, the Bnei Yehoshaphat, Azaryah, and Yechiel, and Zecharyahu, and Azaryahu, and Michael, and Shephatyahu. All these were the Bnei Yehoshaphat Melech Yisroel."},{"num":3,"verse":"And their av have given them mattanot rabbot of kesef, and of zahav, and of precious things, with fortified cities in Yehudah, but the Mamlachah (Kingdom) he gave to Yehoram; because he was the bechor."},{"num":4,"verse":"Now when Yehoram was risen up to the Mamlachah of his av, he strengthened himself, and slaughtered all his achim with the cherev, and also a number of the sarim (leading political figures) of Yisroel."},{"num":5,"verse":"Yehoram was thirty and two years old when he began to reign, and he reigned shemoneh shanim in Yerushalayim."},{"num":6,"verse":"And he walked in the derech of the melachim of Yisroel, as did the Bais Ach’av, for he had the Bat Ach’av to wife, and he wrought that which was rah in the eyes of Hashem."},{"num":7,"verse":"However, Hashem was not willing to destroy the Bais Dovid, for the sake of HaBrit that He had cut with Dovid, and since He promised to give a ner (lamp) to him and to his banim kol hayamim."},{"num":8,"verse":"In the days of Yehoram, Edom rebelled from under the yad Yehudah, and made themselves a melech."},{"num":9,"verse":"Then Yehoram went forth with his sarim (princes), and all his chariots with him, and he rose up by lailah, and struck down Edom which had surrounded him, and the commanders of the chariots."},{"num":10,"verse":"So the Edomites rebelled from under the yad Yehudah unto this day. At the same time also did Livnah rebel from under his yad, because he had forsaken Hashem Elohei Avotav."},{"num":11,"verse":"Moreover he built high places [unlawful altars] in the mountains of Yehudah and caused the inhabitants of Yerushalayim to commit fornication, and led Yehudah astray."},{"num":12,"verse":"And there came a miktav (letter) to him from Eliyahu HaNavi, saying, Thus saith Hashem Elohei Dovid Avicha, Because thou hast not walked in the darkhei Yehoshaphat Avicha, nor in the darkhei Asa Melech Yehudah,"},{"num":13,"verse":"But hast walked in the derech of the melachim of Yisroel, and hast made Yehudah and the inhabitants of Yerushalayim to go awhoring, like the whoredoms of the Bais Ach’av, and also hast murdered thy achim of Bais Avicha, which were better than thee;"},{"num":14,"verse":"Hinei, with a maggefah gedolah (great plague) will Hashem strike thy people, and thy banim, and thy nashim, and all thy possessions;"},{"num":15,"verse":"And thou shalt have cholayim rabbim with machla (disease) of thy bowels, until thy bowels come out by reason of the choli yamim al yamim."},{"num":16,"verse":"Moreover Hashem stirred up against Yehoram the ruach HaPelishtim, and of the Arabs, who lived near the Kushim;"},{"num":17,"verse":"And they came up against Yehudah, and invaded, and carried away all the possessions that were found in the Bais HaMelech, and also his banim, and his nashim; so that there was left him not a ben except Yehoachaz (Achazyahu, Ahaziah), the youngest of his banim."},{"num":18,"verse":"And after all this Hashem struck him in his bowels with a choli for which there was no marpeh."},{"num":19,"verse":"And it came to pass that in process of time, after the end of two years, his bowels protruded out by reason of his choli; so he died in great pain. And his people kindled no pyre in his honor, as they had done for his avot."},{"num":20,"verse":"Thirty and two years old was he when he began to reign, and he reigned in Yerushalayim shemoneh shanim, and departed without chemdah (desire [for him]). Howbeit they buried him in the Ir Dovid, but not in the kevarot hamelachim."}]