[{"num":21,"verse":"And Jehoshaphat slept with his fathers, and was buried with them in the city of David; and Jehoram, his son, reigned for him."},{"num":2,"verse":"And he had brethren, the sons of Jehoshaphat, Azariah, Jehiel, and Zechariah, and (another) Azariah, and Michael, and Shephatiah; all these were the sons of Jehoshaphat, king of Judah."},{"num":3,"verse":"And their father gave to them many gifts of gold and of silver, and he gave them pensions, or rents, with full strong cities in Judah; but he gave the realm to Jehoram, for he was his first begotten son. (And their father gave them many gifts of gold and of silver, and he gave them pensions, or rents, along with fortified cities in Judah; but he gave the kingdom to Jehoram, for he was his first-born son.)"},{"num":4,"verse":"And Jehoram rose up on the realm of his father; and when he had confirmed himself in the realm, he slew all his brethren by sword, and also some of the princes of Judah. (And when Jehoram had taken his father’s kingdom, and established himself on the throne, he killed all of his brothers by the sword, and also some of the leaders of Israel.)"},{"num":5,"verse":"Jehoram was of two and thirty years, when he began to reign; and he reigned eight years in Jerusalem."},{"num":6,"verse":"And he went in the ways of the kings of Israel, as the house of Ahab had done, for the daughter of Ahab was his wife; and he did evil in the sight of the Lord."},{"num":7,"verse":"But the Lord would not destroy the house of David, for the covenant which he had made with David, and for he had promised to give to him a lantern, and to his sons, in all time. (But the Lord would not destroy the house of David, because of the covenant which he had made with David, and because he had promised to give a light, or a flame, to him, and to his sons, for all time.)"},{"num":8,"verse":"In those days Edom rebelled, so that it was not subject to Judah, and it ordained a king to itself. (In those days the Edomites rebelled, so that they were not subject to Judah, and they ordained a king for themselves.)"},{"num":9,"verse":"And when Jehoram had passed forth with his princes, and all the multitude of knights, that was with him, he rose up by night, and smote Edom, that (en)compassed him, and all the dukes of his multitude of knights. (And when Jehoram had come forth with his leaders, and all the multitude of his horsemen who were with him, he rose up by night, and struck the army of Edom, who had surrounded him, and his leaders, and all his multitude of horsemen.)"},{"num":10,"verse":"Nevertheless Edom rebelled, (so) that it was not under the lordship of Judah unto this day. In that time also Libnah went away, that it was not under the hand of him (At that time Libnah also went away from Jehoram, so that they were not under his power); for he had forsaken the Lord God of his fathers."},{"num":11,"verse":"Furthermore he made high places in the cities of Judah, and made the dwellers of Jerusalem to do fornication, that is, idolatry, and Judah to break the law. (And furthermore he made hill shrines in the cities of Judah, and made the inhabitants of Jerusalem to do idolatry, and the people of Judah to break God’s Law.)"},{"num":12,"verse":"And letters were brought to him from Elijah, the prophet, in which it was written, The Lord God of David, thy father, saith these things, For that thou hast not gone in the ways of Jehoshaphat, thy father, and in the way(s) of Asa, king of Judah,"},{"num":13,"verse":"but thou hast gone by the way of the kings of Israel, and thou hast made Judah and the dwellers of Jerusalem to do fornication, and thou hast followed the fornication of the house of Ahab; furthermore and thou hast slain thy brethren in the house of thy father, that is, (the) princes of the house of thy father, which were better than thou; (but thou hast gone in the ways of the kings of Israel, and thou hast made Judah and the inhabitants of Jerusalem to do idolatry, and thou hast followed the idolatry of the house of Ahab; and furthermore thou hast killed thy brothers in the house of thy father, that is, the princes of the house of thy father, who were better than thou;)"},{"num":14,"verse":"lo! the Lord shall smite thee with a great vengeance, and thy people, and thy sons, and thy wives, and all thy chattel; (lo! the Lord shall strike thee with a great vengeance, and also thy people, and thy sons, and thy wives, and all thy substance, or thy possessions;)"},{"num":15,"verse":"and thou shalt be sick with the worst sorrow of thy womb, (or thy belly,) till that thine entrails go out little and little by each day."},{"num":16,"verse":"Therefore the Lord raised up against Jehoram the spirit of Philistines, and of Arabians, that march with Ethiopians; (And so the Lord raised up against Jehoram the spirit of the Philistines, and of the Arabs, who march with the Ethiopians;)"},{"num":17,"verse":"and these went up into the land of Judah, and they wasted it, and they took away all the substance, that was found in the house of the king, furthermore and his sons, and his wives they took away (and furthermore they took away his sons, and his wives); and no son was left to him, but Jehoahaz, that was his least son, or youngest son, in birth."},{"num":18,"verse":"And over all these things the Lord smote him with uncurable sorrow of the womb. (And after all these things the Lord struck him with an incurable disease in his bowels.)"},{"num":19,"verse":"And when day came after day, and the spaces of time were turned about, the course of two years was fulfilled; and so he was wasted by long rot, so that he casted out also his own entrails, and so he wanted sorrow and life together, and he was dead in the worst sickness. And the people did not to him [the] service of dead men by the custom of burning, as it had done to his greaters, either ancestors. (And when day came after day, and the space of time was turned about, the course of two years was fulfilled; and he was wasted by long rot, so that he cast out his own bowels, and he wanted to live and to die at the same time, and finally he died of the worst sickness. And the people did not do for him the service of the dead by the custom of honouring him with a bonfire, as they had done with his greaters, or his ancestors.)"},{"num":20,"verse":"He was of two and thirty years when he began to reign, and he reigned eight years in Jerusalem, and he went not rightfully; and they buried him in the city of David, nevertheless not in the sepulchre(s) of kings. (He was thirty-two years old when he began to reign, and he reigned eight years in Jerusalem, and at his death he was not mourned; and they buried him in the City of David, but not in the tombs of the kings.)"}]