[[],[{"type":"prose","content":"And Jehoshaphat lieth with his fathers, and is buried with his fathers in the city of David, and Jehoram his son reigneth in his stead."}],[{"type":"prose","content":"And he hath brethren, sons of Jehoshaphat, Azariah, and Jehiel, and Zechariah, and Azariah, and Michael, and Shephatiah; all these [are] sons of Jehoshaphat king of Israel,"}],[{"type":"prose","content":"and their father giveth to them many gifts of silver and of gold, and of precious things, with fenced cities in Judah, and the kingdom he hath given to Jehoram, for He [is] the first-born."}],[{"type":"prose","content":"And Jehoram riseth up over the kingdom of his father, and strengtheneth himself, and slayeth all his brethren with the sword, and also -- of the heads of Israel."}],[{"type":"prose","content":"A son of thirty and two years [is] Jehoram in his reigning, and eight years he hath reigned in Jerusalem,"}],[{"type":"prose","content":"and he walketh in the way of the kings of Israel, as did the house of Ahab, for a daughter of Ahab hath been to him for a wife, and he doth the evil thing in the eyes of Jehovah,"}],[{"type":"prose","content":"and Jehovah hath not been willing to destroy the house of David, for the sake of the covenant that He made with David, and as He had said to give to him a lamp, and to his sons -- all the days."}],[{"type":"prose","content":"In his days hath Edom revolted from under the hand of Judah, and cause a king to reign over them;"}],[{"type":"prose","content":"and Jehoram passeth over with his heads, and all the chariots with him, and it cometh to pass, he hath risen by night and smiteth the Edomites who are coming round against him, and the princes of the chariots,"}],[{"type":"prose","content":"and Edom revolteth from under the hand of Judah unto this day; then doth Libnah revolt at that time from under his hand, because he hath forsaken Jehovah, God of his fathers,"}],[{"type":"prose","content":"also, he hath made high places in the mountains of Judah, and causeth the inhabitants of Jerusalem to commit whoredom, and compelleth Judah."}],[{"type":"prose","content":"And there cometh in unto him a writing from Elijah the prophet, saying, `Thus said Jehovah, God of David thy father, Because that thou hast not walked in the ways of Jehoshaphat thy father, and in the ways of Asa king of Judah,"}],[{"type":"prose","content":"and thou dost walk in the way of the kings of Israel, and dost cause Judah and the inhabitants of Jerusalem to commit whoredom like the whoredoms of the house of Ahab, and also thy brethren, the house of thy father, who are better than thyself, thou hast slain;"}],[{"type":"prose","content":"lo, Jehovah is smiting -- a great smiting -- among thy people, and among thy sons, and among thy wives, and among all thy goods --"}],[{"type":"prose","content":"and thou, with many sicknesses, with disease of thy bowels, till thy bowels come out, by the sickness, day by day.'"}],[{"type":"prose","content":"And Jehovah waketh up against Jehoram the spirit of the Philistines, and of the Arabians, who [are] beside the Cushim,"}],[{"type":"prose","content":"and they come up into Judah, and rend it, and take captive all the substance that is found at the house of the king, and also his sons, and his wives, and there hath not been left to him a son except Jehoahaz the youngest of his sons."}],[{"type":"prose","content":"And after all this hath Jehovah plagued him in his bowels by a disease for which there is no healing,"}],[{"type":"prose","content":"and it cometh to pass, from days to days, and at the time of the going out of the end of two years, his bowels have gone out with his sickness, and he dieth of sore diseases, and his people have not made for him a burning like the burning of his fathers."}],[{"type":"prose","content":"A son of thirty and two [years] was he in his reigning, and eight years he hath reigned in Jerusalem, and he goeth without desire, and they bury him in the city of David, and not in the graves of the kings."}]]