[[],[{"type":"header","content":"Leaders of the Army"},{"type":"prose","content":"What follows is a list of Israelite family leaders and commanders of units of a thousand and a hundred, as well as their officers who served the king in various matters. Each division was assigned to serve for one month during the year; each consisted of 24,000 troops."}],[{"type":"prose","content":"Jashobeam son of Zabdiel was in charge of the first division, which was assigned the first month. His division consisted of 24,000 troops. "}],[{"type":"prose","content":"He was a descendant of Perez; he was in charge of all the army officers for the first month."}],[{"type":"prose","content":"Dodai the Ahohite was in charge of the division assigned the second month; Mikloth was the next in rank. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The third army commander, assigned the third month, was Benaiah son of Jehoiada the priest. He was the leader of his division, which consisted of 24,000 troops. "}],[{"type":"prose","content":"Benaiah was the leader of the thirty warriors and his division; his son was Ammizabad."}],[{"type":"prose","content":"The fourth, assigned the fourth month, was Asahel, brother of Joab; his son Zebadiah succeeded him. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The fifth, assigned the fifth month, was the commander Shamhuth the Izrahite. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The sixth, assigned the sixth month, was Ira son of Ikkesh the Tekoite. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The seventh, assigned the seventh month, was Helez the Pelonite, an Ephraimite. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The eighth, assigned the eighth month, was Sibbekai the Hushathite, a Zerahite. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The ninth, assigned the ninth month, was Abiezer the Anathothite, a Benjaminite. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The tenth, assigned the tenth month, was Maharai the Netophathite, a Zerahite. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The eleventh, assigned the eleventh month, was Benaiah the Pirathonite, an Ephraimite. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The twelfth, assigned the twelfth month, was Heldai the Netophathite, a descendant of Othniel. His division consisted of 24,000 troops."}],[{"type":"prose","content":"The officers of the Israelite tribes:Eliezer son of Zikri was the leader of the Reubenites,Shephatiah son of Maacah led the Simeonites,"}],[{"type":"prose","content":"Hashabiah son of Kemuel led the Levites,Zadok led the descendants of Aaron,"}],[{"type":"prose","content":"Elihu, a brother of David, led Judah,Omri son of Michael led Issachar,"}],[{"type":"prose","content":"Ishmaiah son of Obadiah led Zebulun,Jerimoth son of Azriel led Naphtali,"}],[{"type":"prose","content":"Hoshea son of Azaziah led the Ephraimites,Joel son of Pedaiah led the half-tribe of Manasseh,"}],[{"type":"prose","content":"Iddo son of Zechariah led the half-tribe of Manasseh in Gilead,Jaasiel son of Abner led Benjamin,"}],[{"type":"prose","content":"Azarel son of Jeroham led Dan.These were the commanders of the Israelite tribes."}],[{"type":"prose","content":"David did not count the males twenty years old and under, for the  had promised to make Israel as numerous as the stars in the sky. "}],[{"type":"prose","content":"Joab son of Zeruiah started to count the men but did not finish. God was angry with Israel because of this, so the number was not recorded in the scroll called The Annals of King David."},{"type":"header","content":"Royal Officials"}],[{"type":"prose","content":"Azmaveth son of Adiel was in charge of the king’s storehouses;Jonathan son of Uzziah was in charge of the storehouses in the field, in the cities, in the towns, and in the towers."}],[{"type":"prose","content":"Ezri son of Kelub was in charge of the field workers who farmed the land."}],[{"type":"prose","content":"Shimei the Ramathite was in charge of the vineyards;Zabdi the Shiphmite was in charge of the wine stored in the vineyards."}],[{"type":"prose","content":"Baal Hanan the Gederite was in charge of the olive and sycamore trees in the foothills;Joash was in charge of the storehouses of olive oil."}],[{"type":"prose","content":"Shitrai the Sharonite was in charge of the cattle grazing in Sharon;Shaphat son of Adlai was in charge of the cattle in the valleys."}],[{"type":"prose","content":"Obil the Ishmaelite was in charge of the camels;Jehdeiah the Meronothite was in charge of the donkeys."}],[{"type":"prose","content":"Jaziz the Hagrite was in charge of the sheep.All these were the officials in charge of King David’s property."}],[{"type":"prose","content":"Jonathan, David’s uncle, was a wise adviser and scribe;Jehiel son of Hacmoni cared for the king’s sons."}],[{"type":"prose","content":"Ahithophel was the king’s adviser;Hushai the Arkite was the king’s confidant."}],[{"type":"prose","content":"Ahithophel was succeeded by Jehoiada son of Benaiah and by Abiathar.Joab was the commanding general of the king’s army."}]]