[{"header":"The Military Divisions"},{"num":27,"verse":"This is the list of the people of Israel, the heads of fathers’ houses, the commanders of thousands and hundreds, and their officers who served the king in all matters concerning the divisions that came and went, month after month throughout the year, each division numbering twenty-four thousand:"},{"num":2,"verse":"Jasho′be-am the son of Zab′di-el was in charge of the first division in the first month; in his division were twenty-four thousand. "},{"num":3,"verse":"He was a descendant of Perez, and was chief of all the commanders of the army for the first month. "},{"num":4,"verse":"Dodai the Aho′hite was in charge of the division of the second month; in his division were twenty-four thousand. "},{"num":5,"verse":"The third commander, for the third month, was Benai′ah, the son of Jehoi′ada the priest, as chief; in his division were twenty-four thousand. "},{"num":6,"verse":"This is the Benai′ah who was a mighty man of the thirty and in command of the thirty; Ammiz′abad his son was in charge of his division. "},{"num":7,"verse":"As′ahel the brother of Jo′ab was fourth, for the fourth month, and his son Zebadi′ah after him; in his division were twenty-four thousand. "},{"num":8,"verse":"The fifth commander, for the fifth month, was Shamhuth, the Iz′rahite; in his division were twenty-four thousand. "},{"num":9,"verse":"Sixth, for the sixth month, was Ira, the son of Ikkesh the Teko′ite; in his division were twenty-four thousand. "},{"num":10,"verse":"Seventh, for the seventh month, was Helez the Pel′onite, of the sons of E′phraim; in his division were twenty-four thousand. "},{"num":11,"verse":"Eighth, for the eighth month, was Sib′becai the Hu′shathite, of the Ze′rahites; in his division were twenty-four thousand. "},{"num":12,"verse":"Ninth, for the ninth month, was Abi-e′zer of An′athoth, a Benjaminite; in his division were twenty-four thousand. "},{"num":13,"verse":"Tenth, for the tenth month, was Ma′harai of Netoph′ah, of the Ze′rahites; in his division were twenty-four thousand. "},{"num":14,"verse":"Eleventh, for the eleventh month, was Benai′ah of Pir′athon, of the sons of E′phraim; in his division were twenty-four thousand. "},{"num":15,"verse":"Twelfth, for the twelfth month, was Heldai the Netoph′athite, of Oth′ni-el; in his division were twenty-four thousand."},{"header":"Leaders of Tribes"},{"num":16,"verse":"Over the tribes of Israel, for the Reubenites Elie′zer the son of Zichri was chief officer; for the Simeonites, Shephati′ah the son of Ma′acah; "},{"num":17,"verse":"for Levi, Hashabi′ah the son of Kemu′el; for Aaron, Zadok; "},{"num":18,"verse":"for Judah, Eli′hu, one of David’s brothers; for Is′sachar, Omri the son of Michael; "},{"num":19,"verse":"for Zeb′ulun, Ishma′iah the son of Obadi′ah; for Naph′tali, Jer′emoth the son of Az′ri-el; "},{"num":20,"verse":"for the E′phraimites, Hoshe′a the son of Azazi′ah; for the half-tribe of Manas′seh, Jo′el the son of Peda′iah; "},{"num":21,"verse":"for the half-tribe of Manas′seh in Gilead, Iddo the son of Zechari′ah; for Benjamin, Ja-asi′el the son of Abner; "},{"num":22,"verse":"for Dan, Az′arel the son of Jero′ham. These were the leaders of the tribes of Israel. "},{"num":23,"verse":"David did not number those below twenty years of age, for the Lord had promised to make Israel as many as the stars of heaven. "},{"num":24,"verse":"Jo′ab the son of Zeru′iah began to number, but did not finish; yet wrath came upon Israel for this, and the number was not entered in the chronicles of King David."},{"header":"Other Civic Officials"},{"num":25,"verse":"Over the king’s treasuries was Az′maveth the son of Ad′i-el; and over the treasuries in the country, in the cities, in the villages and in the towers, was Jonathan the son of Uzzi′ah; "},{"num":26,"verse":"and over those who did the work of the field for tilling the soil was Ezri the son of Chelub; "},{"num":27,"verse":"and over the vineyards was Shim′e-i the Ra′mathite; and over the produce of the vineyards for the wine cellars was Zabdi the Shiphmite. "},{"num":28,"verse":"Over the olive and sycamore trees in the Shephe′lah was Ba′al-ha′nan the Gede′rite; and over the stores of oil was Jo′ash. "},{"num":29,"verse":"Over the herds that pastured in Sharon was Shitrai the Shar′onite; over the herds in the valleys was Shaphat the son of Adlai. "},{"num":30,"verse":"Over the camels was Obil the Ish′maelite; and over the she-asses was Jehde′iah the Meron′othite. Over the flocks was Jaziz the Hagrite. "},{"num":31,"verse":"All these were stewards of King David’s property."},{"num":32,"verse":"Jonathan, David’s uncle, was a counselor, being a man of understanding and a scribe; he and Jehi′el the son of Hach′moni attended the king’s sons. "},{"num":33,"verse":"Ahith′ophel was the king’s counselor, and Hushai the Archite was the king’s friend. "},{"num":34,"verse":"Ahith′ophel was succeeded by Jehoi′ada the son of Benai′ah, and Abi′athar. Jo′ab was commander of the king’s army."}]