[{"header":"The Locusts"},{"num":10,"verse":"The Lord said to Moses, “Go to the king of Egypt. I have made him and his officers stubborn so I could show them my powerful miracles. "},{"num":2,"verse":"I also did this so you could tell your children and your grandchildren how I was hard on the Egyptians. Tell them about the miracles I did among them so that all of you will know that I am the Lord.”"},{"num":3,"verse":"So Moses and Aaron went to the king and told him, “This is what the Lord, the God of the Hebrews, says: ‘How long will you refuse to be sorry for what you have done? Let my people go to worship me. "},{"num":4,"verse":"If you refuse to let my people go, tomorrow I will bring locusts into your country. "},{"num":5,"verse":"They will cover the land so that no one will be able to see the ground. They will eat anything that was left from the hailstorm and the leaves from every tree growing in the field. "},{"num":6,"verse":"They will fill your palaces and all your officers’ houses, as well as the houses of all the Egyptians. There will be more locusts than your fathers or ancestors have ever seen—more than there have been since people began living in Egypt.’” Then Moses turned and walked away from the king."},{"num":7,"verse":"The king’s officers asked him, “How long will this man make trouble for us? Let the Israelites go to worship the Lord their God. Don’t you know that Egypt is ruined?”"},{"num":8,"verse":"So Moses and Aaron were brought back to the king. He said to them, “Go and worship the Lord your God. But tell me, just who is going?”"},{"num":9,"verse":"Moses answered, “We will go with our young and old people, our sons and daughters, and our flocks and herds, because we are going to have a feast to honor the Lord.”"},{"num":10,"verse":"The king said to them, “The Lord will really have to be with you if ever I let you and all of your children leave Egypt. See, you are planning something evil! "},{"num":11,"verse":"No! Only the men may go and worship the Lord, which is what you have been asking for.” Then the king forced Moses and Aaron out of his palace."},{"num":12,"verse":"The Lord told Moses, “Raise your hand over the land of Egypt, and the locusts will come. They will spread all over the land of Egypt and will eat all the plants the hail did not destroy.”"},{"num":13,"verse":"So Moses raised his walking stick over the land of Egypt, and the Lord caused a strong wind to blow from the east. It blew across the land all that day and night, and when morning came, the east wind had brought the locusts. "},{"num":14,"verse":"Swarms of locusts covered all the land of Egypt and settled everywhere. There were more locusts than ever before or after, "},{"num":15,"verse":"and they covered the whole land so that it was black. They ate everything that was left after the hail—every plant in the field and all the fruit on the trees. Nothing green was left on any tree or plant anywhere in Egypt."},{"num":16,"verse":"The king quickly called for Moses and Aaron. He said, “I have sinned against the Lord your God and against you. "},{"num":17,"verse":"Now forgive my sin this time. Pray to the Lord your God, and ask him to stop this punishment that kills.”"},{"num":18,"verse":"Moses left the king and prayed to the Lord. "},{"num":19,"verse":"So the Lord changed the wind. He made a very strong wind blow from the west, and it blew the locusts away into the Red Sea. Not one locust was left anywhere in Egypt. "},{"num":20,"verse":"But the Lord caused the king to be stubborn again, and he did not let the Israelites go."},{"header":"The Darkness"},{"num":21,"verse":"Then the Lord told Moses, “Raise your hand toward the sky, and darkness will cover the land of Egypt. It will be so dark you will be able to feel it.” "},{"num":22,"verse":"Moses raised his hand toward the sky, and total darkness was everywhere in Egypt for three days. "},{"num":23,"verse":"No one could see anyone else, and no one could go anywhere for three days. But the Israelites had light where they lived."},{"num":24,"verse":"Again the king of Egypt called for Moses. He said, “All of you may go and worship the Lord. You may take your women and children with you, but you must leave your flocks and herds here.”"},{"num":25,"verse":"Moses said, “You must let us have animals to use as sacrifices and burnt offerings, because we have to offer them to the Lord our God. "},{"num":26,"verse":"So we must take our animals with us; not a hoof will be left behind. We have to use some of the animals to worship the Lord our God. We won’t know exactly what we will need to worship the Lord until we get there.”"},{"num":27,"verse":"But the Lord made the king stubborn again, so he refused to let them go. "},{"num":28,"verse":"Then he told Moses, “Get out of here, and don’t come again! The next time you see me, you will die.”"},{"num":29,"verse":"Then Moses told the king, “I’ll do what you say. I will not come to see you again.”"}]