[{"header":"Lot’s Guests Are Assaulted"},{"num":19,"verse":"The two angels came to Sodom in the evening as Lot was sitting in the gateway. When Lot saw them, he got up to meet them and bowed with his face touching the ground. "},{"num":2,"verse":"He said, “Please, gentlemen, why don’t you come to my home and spend the night? You can wash your feet there. Then early tomorrow morning you can continue your journey.”"},{"num":3,"verse":"But he insisted so strongly that they came with him and went into his home. He prepared a special dinner for them, baked some unleavened bread, and they ate. "},{"num":4,"verse":"Before they had gone to bed, all the young and old male citizens of Sodom surrounded the house. "},{"num":5,"verse":"They called to Lot, “Where are the men who came to stay with you tonight? Bring them out to us so that we can have sex with them.”"},{"num":6,"verse":"Then Lot went outside and shut the door behind him. "},{"num":7,"verse":"“Please, my friends, don’t be so wicked,” he said. "},{"num":8,"verse":"“Look, I have two daughters who have never had sex. Why don’t you let me bring them out to you? Do whatever you like with them. But don’t do anything to these men, since I’m responsible for them.”"},{"num":9,"verse":"But the men yelled, “Get out of the way! This man came here to stay awhile. Now he wants to be our judge! We’re going to treat you worse than those men.” They pushed hard against Lot and lunged forward to break down the door. "},{"num":10,"verse":"The men inside reached out, pulled Lot into the house with them, and shut the door. "},{"num":11,"verse":"Then they struck all the men who were in the doorway of the house, young and old alike, with blindness so that they gave up trying to find the door."},{"header":"Lot Leaves Sodom, and the Cities Are Destroyed"},{"num":12,"verse":"Then the men asked Lot, “Do you have anyone else here—any in-laws, sons, daughters, or any other relatives in the city? Get them out of here "},{"num":13,"verse":"because we’re going to destroy this place. The complaints to Yahweh against its people are so loud that Yahweh has sent us to destroy it.”"},{"num":14,"verse":"So Lot went out and spoke to the men engaged to his daughters. He said, “Hurry! Get out of this place, because Yahweh is going to destroy the city.” But they thought he was joking."},{"num":15,"verse":"As soon as it was dawn, the angels urged Lot by saying, “Quick! Take your wife and your two daughters who are here, or you’ll be swept away when the city is punished.” "},{"num":16,"verse":"When he hesitated, the men grabbed him, his wife, and his two daughters by their hands, because Yahweh wanted to spare Lot. They brought them safely outside the city. "},{"num":17,"verse":"As soon as they were outside, one of the angels said, “Run for your lives! Don’t look behind you, and don’t stop on the plain. Run for the hills, or you’ll be swept away!”"},{"num":18,"verse":"Lot answered, “Oh no! "},{"num":19,"verse":"Even though you’ve been so good to me and though you’ve been very kind to me by saving my life, I can’t run as far as the hills. This disaster will overtake me, and I’ll die. "},{"num":20,"verse":"Look, there’s a city near enough to flee to, and it’s small. Why don’t you let me run there? Isn’t it small? Then my life will be saved.”"},{"num":21,"verse":"The angel said to him, “Alright, I will grant you this request too. I will not destroy the city you’re talking about. "},{"num":22,"verse":"Run there quickly, because I can’t do anything until you get there.” (The city is named Zoar [Small].)"},{"num":23,"verse":"The sun had just risen over the land as Lot came to Zoar. "},{"num":24,"verse":"Then Yahweh made burning sulfur and fire rain out of heaven on Sodom and Gomorrah. "},{"num":25,"verse":"He destroyed those cities, the whole plain, all who lived in the cities, and whatever grew on the ground. "},{"num":26,"verse":"Lot’s wife looked back and turned into a column of salt."},{"num":27,"verse":"Early the next morning Abraham came to the place where he had stood in front of Yahweh. "},{"num":28,"verse":"When he looked toward Sodom and Gomorrah and all the land in the plain, he saw smoke rising from the land like the thick smoke of a furnace."},{"num":29,"verse":"When Elohim destroyed the cities on the plain, Elohim remembered Abraham. Lot was allowed to escape from the destruction that came to the cities where he was living."},{"header":"Lot’s Daughters Have Sons by Their Father"},{"num":30,"verse":"Lot left Zoar because he was afraid to stay there. He and his two daughters settled in the mountains where they lived in a cave. "},{"num":31,"verse":"The older daughter said to the younger one, “Our father is old. No men are here. We can’t get married as other people do. "},{"num":32,"verse":"Let’s give our father wine to drink. Then we’ll go to bed with him so that we’ll be able to preserve our family line through our father.” "},{"num":33,"verse":"That night they gave their father wine to drink. Then the older one went to bed with her father. He didn’t know when she came to bed or when she got up. "},{"num":34,"verse":"The next day the older daughter said to the younger one, “I did it! Last night I went to bed with my father. Let’s give him wine to drink again tonight. Then you go to bed with him so that we’ll be able to preserve our family line through our father.” "},{"num":35,"verse":"That night they gave their father wine to drink again. Then the younger one went to bed with him. He didn’t know when she came to bed or when she got up. "},{"num":36,"verse":"So Lot’s two daughters became pregnant by their father. "},{"num":37,"verse":"The older one gave birth to a son and named him Moab. He is the ancestor of the Moabites of today. "},{"num":38,"verse":"The younger daughter also gave birth to a son and named him Ben Ammi. He is the ancestor of the Ammonites of today."}]