[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:21-24 Enoch was the seventh from Adam. Godliness is walking with God: which shows reconciliation to God, for two cannot walk together except they be agreed, Am 3:3. It includes all the parts of a godly, righteous, and sober life. To walk with God, is to set God always before us, to act as always under his eye. It is constantly to care, in all things to please God, and in nothing to offend him. It is to be followers of him as dear children. The Holy Spirit, instead of saying, Enoch lived, says, Enoch walked with God. This was his constant care and work; while others lived to themselves and the world, he lived to God. It was the joy of his life. Enoch was removed to a better world. As he did not live like the rest of mankind, so he did not leave the world by death as they did. He was not found, because God had translated him, Heb 11:5. He had lived but 365 years, which, as men's ages were then, was but the midst of a man's days. God often takes those soonest whom he loves best; the time they lose on earth, is gained in heaven, to their unspeakable advantage. See how Enoch's removal is expressed: he was not, for God took him. He was not any longer in this world; he was changed, as the saints shall be, who are alive at Christ's second coming. Those who begin to walk with God when young, may expect to walk with him long, comfortably, and usefully. The true christian's steady walk in holiness, through many a year, till God takes him, will best recommend that religion which many oppose and many abuse. And walking with God well agrees with the cares, comforts, and duties of life.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The history of the Shethite Henok is distinguished in two respects: First, after the birth of Methushelah, \"he walked with the God.\" Here for the first time we have God אלהים  'ĕlohı̂ym with the definite article, with which it occurs more than four hundred times. By this he is emphatically distinguished as the God, now made known by his acts and manifestations, in opposition to atheism, the sole God in opposition to polytheism, and the true God in opposition to all false gods or notions of God. It is possible that in the time of Henok some had forsaken the true God, and fallen into various misconceptions concerning the Supreme Being. His walking with \"the God\" is a hint that others were walking without this God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The phrase \"walked with God\" is rendered in the Septuagint εὐηρέστησε τῷ Θεῷ  euērestēse tō Theō, \"pleased God,\" and is adduced in the Epistle to the Hebrews Gen 2:5-6 as an evidence of Henok's faith. Walking with God implies community with him in thought, word, and deed, and is opposed in Scripture to walking contrary to him. We are not at liberty to infer that Henok was the only one in this line who feared God. But we are sure that he presented an eminent example of that faith which purifies the heart and pleases God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He made a striking advance upon the attainment of the times of his ancestor Sheth. In those days they began to call upon the name of the Lord. Now the fellowship of the saints with God reaches its highest form, - that of walking with him, doing his will and enjoying his presence in all the business of life. Hence, this remarkable servant of God is accounted a prophet, and foretells the coming of the Lord to judgment Jde 1:14-15. It is further to be observed that this most eminent saint of God did not withdraw from the domestic circle, or the ordinary duties of social life. It is related of him as of the others, that during the three hundred years of his walking with God he begat sons and daughters.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Secondly, the second peculiarity of Henok was his teleportation. This is related in the simple language of the times. \"And he was not, for God took him;\" or, in the version of the Septuagint, \"and he was not found, for God translated him.\" Hence, in the New Testament it is said, Hebrews 11:5, \"By faith Enoch was translated, that he should not see death.\" This passage is important for the interpretation of the phrase ואיננוּ  ve'ēynenû καί ουχ εὑρίσκετο  kai ouch heurisketo \"and he was not (found).\" It means, we perceive, not absolutely, he was not, but relatively, he was not extant in the sphere of sense. If this phrase do not denote annihilation, much less does the phrase \"and he died.\" The one denotes absence from the world of sense, and the other indicates the ordinary way in which the soul departs from this world. Here, then, we have another hint that points plainly to the immortality of the soul (see on Genesis 3:22).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Secondly, the second peculiarity of Henok was his teleportation. This is related in the simple language of the times. \"And he was not, for God took him;\" or, in the version of the Septuagint, \"and he was not found, for God translated him.\" Hence, in the New Testament it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"By faith Enoch was translated, that he should not see death.\" This passage is important for the interpretation of the phrase ואיננוּ  ve'ēynenû καί ουχ εὑρίσκετο  kai ouch heurisketo \"and he was not (found).\" It means, we perceive, not absolutely, he was not, but relatively, he was not extant in the sphere of sense. If this phrase do not denote annihilation, much less does the phrase \"and he died.\" The one denotes absence from the world of sense, and the other indicates the ordinary way in which the soul departs from this world. Here, then, we have another hint that points plainly to the immortality of the soul (see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "This glimpse into primeval life furnishes a new lesson to the men of early times and of all succeeding generations. An atonement was shadowed forth in the offering of Habel. A voice was given to the devout feelings of the heart in the times of Sheth. And now a walk becoming one reconciled to God, calling upon his name, and animated by the spirit of adoption, is exhibited. Faith has now returned to God, confessed his name, and learned to walk with him. At this point God appears and gives to the antediluvian race a new and conclusive token of the riches and power of mercy in counteracting the effects of sin in the case of the returning penitent. Henok does not die, but lives; and not only lives, but is advanced to a new stage of life, in which all the power and pain of sin are at an end forever. This crowns and signalizes the power of grace, and represents in brief the grand finale of a life of faith. This renewed man is received up into glory without going through the intermediate steps of death and resurrection. If we omit the violent end of Habel, the only death on record that precedes the translation of Henok is that of Adam. It would have been incongruous that he who brought sin and death into the world should not have died. But a little more than half a century after his death, Henok is wafted to heaven without leaving the body. This translation took place in the presence of a sufficient number of witnesses, and furnished a manifest proof of the presence and reality of the invisible powers. Thus, were life and immortality as fully brought to light as was necessary or possible at that early stage of the world's history. Thus, was it demonstrated that the grace of God was triumphant in accomplishing the final and full salvation of all who returned to God. The process might be slow and gradual, but the end was now shown to be sure and satisfactory.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This glimpse into primeval life furnishes a new lesson to the men of early times and of all succeeding generations. An atonement was shadowed forth in the offering of Habel. A voice was given to the devout feelings of the heart in the times of Sheth. And now a walk becoming one reconciled to God, calling upon his name, and animated by the spirit of adoption, is exhibited. Faith has now returned to God, confessed his name, and learned to walk with him. At this point God appears and gives to the antediluvian race a new and conclusive token of the riches and power of mercy in counteracting the effects of sin in the case of the returning penitent. Henok does not die, but lives; and not only lives, but is advanced to a new stage of life, in which all the power and pain of sin are at an end forever. This crowns and signalizes the power of grace, and represents in brief the grand finale of a life of faith. This renewed man is received up into glory without going through the intermediate steps of death and resurrection. If we omit the violent end of Habel, the only death on record that precedes the translation of Henok is that of Adam. It would have been incongruous that he who brought sin and death into the world should not have died. But a little more than half a century after his death, Henok is wafted to heaven without leaving the body. This translation took place in the presence of a sufficient number of witnesses, and furnished a manifest proof of the presence and reality of the invisible powers. Thus, were life and immortality as fully brought to light as was necessary or possible at that early stage of the world's history. Thus, was it demonstrated that the grace of God was triumphant in accomplishing the final and full salvation of all who returned to God. The process might be slow and gradual, but the end was now shown to be sure and satisfactory.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21. Enoch … begat Methuselah—This name signifies, \"He dieth, and the sending forth,\" so that Enoch gave it as prophetical of the flood. It is computed that Methuselah died in the year of that catastrophe.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No notes from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And all the days of Enoch were three hundred and sixty five years. A year of years, living as many years as there are days in a year; not half the age of the rest of the patriarchs: our poet (t) calls him one of middle age; though his being taken away in the midst of his days was not a token of divine displeasure, but of favour, as follows; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Milton's Paradise Lost, B. 11. l. 665. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Milton's Paradise Lost, B. 11. l. 665. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And all the days of Enoch were three hundred sixty and five years:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and all the days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Concerning Enoch the following points deserve attention: (1) He is the seventh in the genealogy, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; (2) by comparison with the lives of his fathers and descendants, the length of his life is immensely curtailed; (3) the number of his years agrees with the number of days in the solar year; (4) owing to the closeness of his walk with God he was believed to have been “translated” into Heaven. With this summary must be compared the account of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seventh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " king in the antediluvian Babylonian Dynasty, Enmeduranki by name, who received revelations from the Sun-god Samas, and was the builder of the town of Sippar, which was dedicated to the Sun-god.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As Adam was created in the image of God, so did he beget \"in his own likeness, after his image;\" that is to say, he transmitted the image of God in which he was created, not in the purity in which it came direct from God, but in the form given to it by his own self-determination, modified and corrupted by sin. The begetting of the son by whom the line was perpetuated (no doubt in every case the first-born), is followed by an account of the number of years that Adam and the other fathers lived after that, by the statement that each one begat (other) sons and daughters, by the number of years that he lived altogether, and lastly, by the assertion ויּמת \"and he died.\" This apparently superfluous announcement is \"intended to indicate by its constant recurrence that death reigned from Adam downwards as an unchangeable law (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But against this background of universal death, the power of life was still more conspicuous. For the man did not die till he had propagated life, so that in the midst of the death of individuals the life of the race was preserved, and the hope of the seed sustained, by which the author of death should be overcome.\" In the case of one of the fathers indeed, viz., Enoch (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), life had not only a different issue, but also a different form. Instead of the expression \"and he lived,\" which introduces in every other instance the length of life after the birth of the first-born, we find in the case of Enoch this statement, \"he walked with God (Elohim);\" and instead of the expression \"and he died,\" the announcement, \"and he was not, for God (Elohim) took him.\" The phrase \"walked with God,\" which is only applied to Enoch and Noah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), denotes the most confidential intercourse, the closest communion with the personal God, a walking as it were by the side of God, who still continued His visible intercourse with men (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It must be distinguished from \"walking before God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), and \"walking after God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), both which phrases are used to indicate a pious, moral, blameless life under the law according to the directions of the divine commands. The only other passage in which this expression \"walk with God\" occurs is ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it denotes not the piety of the godly Israelites generally, but the conduct of the priests, who stood in a closer relation to Jehovah under the Old Testament than the rest of the faithful, being permitted to enter the Holy Place, and hold direct intercourse with Him there, which the rest of the people could not do. The article in האלהים gives prominence to the personality of Elohim, and shows that the expression cannot refer to intercourse with the spiritual world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Enoch, the seventh from Adam through Seth, godliness attained its highest point; whilst ungodliness culminated in Lamech, the seventh from Adam through Cain, who made his sword his god. Enoch, therefore, like Elijah, was taken away by God, and carried into the heavenly paradise, so that he did not see (experience) death (Hebrews 11:5); i.e., he was taken up from this temporal life and transfigured into life eternal, being exempted by God from the law of death and of return to the dust, as those of the faithful will be, who shall be alive at the coming of Christ to judgment, and who in like manner shall not taste of death and corruption, but be changed in a moment. There is no foundation for the opinion, that Enoch did not participate at his translation in the glorification which awaits the righteous at the resurrection. For, according to 1 Corinthians 15:20, 1 Corinthians 15:23, it is not in glorification, but in the resurrection, that Christ is the first-fruits. Now the latter presupposes death. Whoever, therefore, through the grace of God is exempted from death, cannot rise from the dead, but reaches ἀφθαρσία, or the glorified state of perfection, through being \"changed\" or \"clothed upon\" (2 Corinthians 5:4). This does not at all affect the truth of the statement in Romans 5:12, Romans 5:14. For the same God who has appointed death as the wages of sin, and given us, through Christ, the victory over death, possesses the power to glorify into eternal life an Enoch and an Elijah, and all who shall be alive at the coming of the Lord without chaining their glorification to death and resurrection. Enoch and Elijah were translated into eternal life with God without passing through disease, death, and corruption, for the consolation of believers, and to awaken the hope of a life after death. Enoch's translation stands about half way between Adam and the flood, in the 987th year after the creation of Adam. Seth, Enos, Cainan, Mahalaleel, and Jared were still alive. His son Methuselah and his grandson Lamech were also living, the latter being 113 years old. Noah was not yet born, and Adam was dead. His translation, in consequence of his walking with God, was \"an example of repentance to all generations,\" as the son of Sirach says (Ecclus. 44:16); and the apocryphal legend in the book of Enoch Genesis 1:9 represents him as prophesying of the coming of the Lord, to execute judgment upon the ungodly (Jde 1:14-15). In comparison with the longevity of the other fathers, Enoch was taken away young, before he had reached half the ordinary age, as a sign that whilst long life, viewed as a time for repentance and grace, is indeed a blessing from God, when the ills which have entered the world through sin are considered, it is also a burden and trouble which God shortens for His chosen. That the patriarchs of the old world felt the ills of this earthly life in all their severity, was attested by Lamech (Genesis 5:28, Genesis 5:29), when he gave his son, who was born 69 years after Enoch's translation, the name of Noah, saying, \"This same shall comfort us concerning our work and the toil of our hands, because of the ground which the Lord hath cursed.\" Noah, נוח from נוּח to rest and הניח to bring rest, is explained by נחם to comfort, in the sense of helpful and remedial consolation. Lamech not only felt the burden of his work upon the ground which God had cursed, but looked forward with a prophetic presentiment to the time when the existing misery and corruption would terminate, and a change for the better, a redemption from the curse, would come. This presentiment assumed the form of hope when his son was born; he therefore gave expression to it in his name. But his hope was not realized, at least not in the way that he desired. A change did indeed take place in the lifetime of Noah. By the judgment of the flood the corrupt race was exterminated, and in Noah, who was preserved because of his blameless walk with God, the restoration of the human race was secured; but the effects of the curse, though mitigated, were not removed; whilst a covenant sign guaranteed the preservation of the human race, and therewith, by implication, his hope of the eventual removal of the curse (Genesis 9:8-17).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In Enoch, the seventh from Adam through Seth, godliness attained its highest point; whilst ungodliness culminated in Lamech, the seventh from Adam through Cain, who made his sword his god. Enoch, therefore, like Elijah, was taken away by God, and carried into the heavenly paradise, so that he did not see (experience) death (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); i.e., he was taken up from this temporal life and transfigured into life eternal, being exempted by God from the law of death and of return to the dust, as those of the faithful will be, who shall be alive at the coming of Christ to judgment, and who in like manner shall not taste of death and corruption, but be changed in a moment. There is no foundation for the opinion, that Enoch did not participate at his translation in the glorification which awaits the righteous at the resurrection. For, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is not in glorification, but in the resurrection, that Christ is the first-fruits. Now the latter presupposes death. Whoever, therefore, through the grace of God is exempted from death, cannot rise from the dead, but reaches ἀφθαρσία, or the glorified state of perfection, through being \"changed\" or \"clothed upon\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This does not at all affect the truth of the statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For the same God who has appointed death as the wages of sin, and given us, through Christ, the victory over death, possesses the power to glorify into eternal life an Enoch and an Elijah, and all who shall be alive at the coming of the Lord without chaining their glorification to death and resurrection. Enoch and Elijah were translated into eternal life with God without passing through disease, death, and corruption, for the consolation of believers, and to awaken the hope of a life after death. Enoch's translation stands about half way between Adam and the flood, in the 987th year after the creation of Adam. Seth, Enos, Cainan, Mahalaleel, and Jared were still alive. His son Methuselah and his grandson Lamech were also living, the latter being 113 years old. Noah was not yet born, and Adam was dead. His translation, in consequence of his walking with God, was \"an example of repentance to all generations,\" as the son of Sirach says (Ecclus. 44:16); and the apocryphal legend in the book of Enoch ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " represents him as prophesying of the coming of the Lord, to execute judgment upon the ungodly (Jde 1:14-15). In comparison with the longevity of the other fathers, Enoch was taken away young, before he had reached half the ordinary age, as a sign that whilst long life, viewed as a time for repentance and grace, is indeed a blessing from God, when the ills which have entered the world through sin are considered, it is also a burden and trouble which God shortens for His chosen. That the patriarchs of the old world felt the ills of this earthly life in all their severity, was attested by Lamech (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), when he gave his son, who was born 69 years after Enoch's translation, the name of Noah, saying, \"This same shall comfort us concerning our work and the toil of our hands, because of the ground which the Lord hath cursed.\" Noah, נוח from נוּח to rest and הניח to bring rest, is explained by נחם to comfort, in the sense of helpful and remedial consolation. Lamech not only felt the burden of his work upon the ground which God had cursed, but looked forward with a prophetic presentiment to the time when the existing misery and corruption would terminate, and a change for the better, a redemption from the curse, would come. This presentiment assumed the form of hope when his son was born; he therefore gave expression to it in his name. But his hope was not realized, at least not in the way that he desired. A change did indeed take place in the lifetime of Noah. By the judgment of the flood the corrupt race was exterminated, and in Noah, who was preserved because of his blameless walk with God, the restoration of the human race was secured; but the effects of the curse, though mitigated, were not removed; whilst a covenant sign guaranteed the preservation of the human race, and therewith, by implication, his hope of the eventual removal of the curse (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:8-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The genealogical table breaks off with Noah; all that is mentioned with reference to him being the birth of his three sons, when he was 500 years old (Genesis 5:32; see Genesis 11:10), without any allusion to the remaining years of his life-an indication of a later hand. \"The mention of three sons leads to the expectation, that whereas hitherto the line has been perpetuated through one member alone, in the future each of the three sons will form a new beginning (vid., Genesis 9:18-19; Genesis 10:1).\" - M. Baumgarten. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The genealogical table breaks off with Noah; all that is mentioned with reference to him being the birth of his three sons, when he was 500 years old (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), without any allusion to the remaining years of his life-an indication of a later hand. \"The mention of three sons leads to the expectation, that whereas hitherto the line has been perpetuated through one member alone, in the future each of the three sons will form a new beginning (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:18-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").\" - M. Baumgarten. ",
            "children": []
          }
        ]
      }
    ]
  }
]