[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(32) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Noah was five hundred years old.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—No reason is given why Noah had no son until he had attained to so ripe an age, nor, in fact, does it follow that he might not have had other sons, though unworthy of sharing his deliverance. It is remarkable also that neither of the three sons who were with him in the ark had offspring until after the flood. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) From them have sprung the three great lines into which the human family is divided. Shem means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "name: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, fame, glory; and he, as the owner of the birthright, was the progenitor of our Lord. Ham, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dark-coloured, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "was the ancestor of the Egyptians, Cushites, and other black races of Arabia and Africa. Japheth, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "widener, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but according to others the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fair, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "though the youngest son, was the ancestor of most of the races of Europe, as well as of some of the chief nations of Asia.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 5:32",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:32",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Noah begat Shem, Ham, and Japheth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It should seem that Japheth was the eldest, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) but Shem is put first, because on him the covenant was entailed, as appears by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where God is called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lord God of Shem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To him, it is probable, the birthright was given, and from him it is certain both Christ the head, and the church the body, were to descend; therefore he is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which signifies a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "name, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "because in his posterity the name of God should always remain, till ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "should come out of his loins, whose name is above every name; so that in putting Shem first, Christ was in effect put first, who in all things must ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have the pre-eminence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:25-32 Methuselah signifies, 'he dies, there is a dart,' 'a sending forth,' namely, of the deluge, which came the year that Methuselah died. He lived 969 years, the longest that any man ever lived on earth; but the longest liver must die at last. Noah signifies rest; his parents gave him that name, with a prospect of his being a great blessing to his generation. Observe his father's complaint of the calamitous state of human life, by the entrance of sin, and the curse of sin. Our whole life is spent in labour, and our time filled up with continual toil. God having cursed the ground, it is as much as some can do, with the utmost care and pains, to get a hard livelihood out comfort us. It signifies not only that desire and expectation which parents generally have about their children, that they will be comforts to them and helpers, though they often prove otherwise; but it signifies also a prospect of something more. Is Christ ours? Is heaven ours? We need better comforters under our toil and sorrow, than the dearest relations and the most promising offspring; may we seek and find comforts in Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Noah was the son of five hundred years. - A man is the son of a certain year, in and up to the close of that year, but not beyond it. Thus, Noah was in his six hundredth year when he was the son of six hundred years ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and a child was circumcised on the eighth day, being then the son of eight days ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When the phrase indicates a point of time, as in Leviticus 27, it is the terminating point of the period in question. The first part only of the biography of Noah is given in this verse, and the remainder will be furnished in due time and place. Meanwhile, Noah is connected with the general history of the race, which is now to be taken up. His three sons are mentioned, because they are the ancestors of the postdiluvian race. This verse, therefore, prepares for a continuation of the narrative, and therefore implies a continuator or compiler who lived after the flood.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When the phrase indicates a point of time, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is the terminating point of the period in question. The first part only of the biography of Noah is given in this verse, and the remainder will be furnished in due time and place. Meanwhile, Noah is connected with the general history of the race, which is now to be taken up. His three sons are mentioned, because they are the ancestors of the postdiluvian race. This verse, therefore, prepares for a continuation of the narrative, and therefore implies a continuator or compiler who lived after the flood.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "From the numbers in this chapter it appears that the length of human life in the period before the deluge was ten times its present average. This has seemed incredible to some, and hence they have imagined that the years must have consisted of one month, or at least of a smaller number than twelve. But the text will not admit of such amendment or interpretation. In the account of the deluge the tenth month is mentioned, and sixty-one days are afterward indicated before the beginning of the next year, whence we infer that the primeval year consisted of twelve lunar months at least. But the seemingly incredible in this statement concerning the longevity of the people before the flood, will be turned into the credible if we reflect that man was made to be immortal. His constitution was suited for a perpetuity of life, if only supplied with the proper nutriment. This nutriment was provided in the tree of life. But man abused his liberty, and forfeited the source of perpetual life. Nevertheless, the primeval vigor of an unimpaired constitution held out for a comparatively long period. After the deluge, however, through the deterioration of the climate and the soil, and perhaps much more the degeneracy of man's moral and physical being, arising from the abuse of his natural propensities, the average length of human life gradually dwindled down to its present limits. Human physiology, founded upon the present data of man's constitution, may pronounce upon the duration of his life so long as the data are the same; but it cannot fairly affirm that the data were never different from what they are at present. Meanwhile, the Bible narrative is in perfect keeping with its own data, and is therefore not to be disturbed by those who still accept these without challenge.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The following table presents the age of each member of this genealogy, when his son and successor was born and when he himself died, as they stand in the Hebrew text, the Samaritan Pentateuch, the Septuagint, and Josephus:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Line of Noah   Hebrew Sam. Pent. Septuagint Josephus Date   Son's Birth Own Death Son's Birth Own Death Son's Birth Own Death Son's Birth Own Death Of Birth Of Death  1. Adam 130 930 130  930 230 930 230 930 0 930  2. Sheth 105 912 105 912 205 912 205 912 130 1042  3. Enosh 90 905 90 905 190 905 190 905 235 1140  4. Kenan 70 910 70 910 170 910 170 910 325 1235  5. Mahalalel 65 895 65 895 165 895 165 895 395 1290  6. Jared 162 962 62 847 162 962 162 962 460 1422  7. Henok 65 365 65 365 165 365 165 365 622 987  8. Methuselah 187 969 67 720 187 969 187 969 687 1656  9. Lamek 182 777 53 653 188 753 182 777 874 1651  10. Noah 500 950 500 950 500 950 500 950 1056 2006   100  100  100  100     Deluge 1656  1307  2262  2256     On comparing the series of numbers in the Hebrew with those in the Samaritan, the Septuagint, and Josephus, it is remarkable that we have the main body of the original figures in all. In the total ages of the first five and the seventh, and in that of Noah at the flood, they all agree. In those of the sixth and eighth, the Hebrew, Septuagint, and Josephus agree. In that of the ninth, the Hebrew and Josephus agree, while the Samaritan and Septuagint differ from them and from each other. On examining the figures of the Samaritan, it appears that the sixth, eighth, and ninth total ages would have reached beyond the flood, if the numbers found in the other authorities had been retained. And they are so shortened as to terminate all in the year of the flood. This alteration betrays design. The totals in the Hebrew, then, have by far the preponderating authority.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of the numbers before the birth of a successor, which are chiefly important for the chronology, the units agree in all but Lamek, in regard to whom the Hebrew and Josephus agree, while the Samaritan and the Septuagint differ from them and from each other. The tens agree in all but two, Methushelah and Lamek, where the Hebrew, the Septuagint, at least in the Codex Alexandrinus, and Josephus agree, while the Samaritan differs from them all. In the hundreds a systematic and designed variation occurs. Still they agree in Noah. In Jared, Methushelah, and Lamek, the Hebrew, Septuagint, and Josephus agree in a number greater by a hundred than the Samaritan. In the remaining six the Hebrew and Samaritan agree; while the Septuagint and Josephus agree in having a number greater by a hundred. On the whole, then, it is evident that the balance of probability is decidedly in favor of the Hebrew. To this advantage of concurring testimonies are to be added those of being the original, and of having been guarded with great care.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "These grounds of textual superiority may be supported by several considerations of less weight. The Samaritan and the Septuagint follow a uniform plan; the Hebrew does not, and therefore has the mark of originality. Josephus gives the sum total to the deluge as two thousand six hundred and fifty-six years, agreeing with the total of the Hebrew in three figures, with that of the Septuagint only in two, and with that of the Samaritan in none. Some MSS. even give one thousand six hundred and fifty-six, which is the exact sum of the Hebrew numbers. Both these readings, moreover, differ from the sum of his own numbers, which itself agrees with the Hebrew in two figures and with the Septuagint in the other two. This looks like a studied conformation of the figures to those of the Septuagint, in which the operator forgot to alter the sum total. We do not at present enter into the external arguments for or against the Hebrew text. Suffice it to observe, that the internal evidence is at present clearly in its favor, so far as the antediluvian figures go. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - The Growth of Sin",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. דון  dı̂yn \"be down, strive, subdue, judge.\" בשׁגם  bāshagām \"inasmuch, as also.\" The rendering \"in their error\" requires the pointing בשׁגם  beshāgām, and the plural form of the following pronoun. It is also unknown to the Septuagint.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. נפילים  nepı̂lı̂ym \"assailants, fellers, men of violence, tyrants.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Having traced the line of descent from Adam through Sheth, the seed of God, to Noah, the author proceeds to describe the general spread and growth of moral evil in the race of man, and the determination of the Lord to wipe it away from the face of the earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Having traced the line of descent from Adam through Sheth, the seed of God, to Noah, the author proceeds to describe the general spread and growth of moral evil in the race of man, and the determination of the Lord to wipe it away from the face of the earth.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32. Noah was five hundred years old: and … begat—That he and the other patriarchs were advanced in life before children were born to them is a difficulty accounted for probably from the circumstance that Moses does not here record their first-born sons, but only the succession from Adam through Seth to Abraham.   ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2448",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "i.e. He began to beget; God in mercy denying him children till that time, that he might not beget them to the destroyer, that he might have no more than should be saved in the ark; or, having before that time begotten others who were now dead, and having the approaching flood in his view, he began again to beget a seminary for the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Of these three sons here following, the eldest seems to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Japheth, Genesis 10:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Japheth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The second was ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as appears because he was but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an hundred years old two years after the flood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 11:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The youngest ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ham, Genesis 9:24",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ham, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". But ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is first named in order of dignity, as being the progenitor of the church, and of Jesus Christ; and because he and his progeny is the principal subject of this whole history. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Noah was five hundred years old,.... Or \"the son of five hundred years\" (f); he was in his five hundredth year: it can hardly be thought that he should live to this time a single life, and have no children born to him, which he might have had, but were dead; though some think it was so ordered by Providence, that he should not begin to procreate children until of this age, because it being the will of God to save him and his family from the flood, had he began at the usual age he might have had more than could conveniently be provided for in the ark; or some of them might have proved wicked, and so would deserve to perish with others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Noah begat Shem, Ham, and Japheth; not together, but one after another; and since Ham was the younger son, see Genesis 9:24 and Shem was an hundred years old two years after the flood, Genesis 11:10 he must be born in the five hundred and second year of his father's age; so that it seems most probable that Japheth was the eldest son, and born in the five hundred and first year of his age; though Shem is usually mentioned first, because of his superior dignity and excellency, God being in an eminent manner the God of Shem, Genesis 9:26 and from whom the Messiah was to spring, and in whose line the church of God was to be continued in future ages. The name of Japheth is retained in Greek and Latin authors, as Hesiod (g) Horace (h), and others (i), by whom he is called Japetos and Japetus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Noah begat Shem, Ham, and Japheth; not together, but one after another; and since Ham was the younger son, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and Shem was an hundred years old two years after the flood, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he must be born in the five hundred and second year of his father's age; so that it seems most probable that Japheth was the eldest son, and born in the five hundred and first year of his age; though Shem is usually mentioned first, because of his superior dignity and excellency, God being in an eminent manner the God of Shem, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and from whom the Messiah was to spring, and in whose line the church of God was to be continued in future ages. The name of Japheth is retained in Greek and Latin authors, as Hesiod (g) Horace (h), and others (i), by whom he is called Japetos and Japetus. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f)    \"filius quingentorum annorum\", Pagninus, Montanus, &c. (g) \"Theogonia prope principium et passim\". (h) Carmin. l. 1. Ode 3.((i) Apollodorus de Deorum Orig. l. 1. p. 2, 4. Ovid. Metamorph. l. 1. Fab. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f)    \"filius quingentorum annorum\", Pagninus, Montanus, &c. (g) \"Theogonia prope principium et passim\". (h) Carmin. l. 1. Ode 3.((i) Apollodorus de Deorum Orig. l. 1. p. 2, 4. Ovid. Metamorph. l. 1. Fab. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Noah was five hundred years old: and Noah begat Shem, Ham, and Japheth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Noah was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Noah is thus represented as much older, when he begets his children, than were the other patriarchs, when children were born to them. A hundred years is the interval of time between the birth of Noah’s sons and the Deluge (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Compare the mention of three sons born to Lamech, the last name in the Cainite genealogy (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:20-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 32.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Noah was five hundred years old",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Literally, a son of 500 years, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " going in his 500th year (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The son of a year (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") means \"strictly within the first year of the life\" (Ainsworth). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Noah begat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " began to beget (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",  - name (Gesenius), fame (Furst) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ham",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- chain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; hot (Gesenius, Murphy), dark-colored (Furst) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Japheth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - spreading (Gesenius, Murphy); beautiful, denoting the white-colored race (Furst). That the sons are mentioned in the order of their ages (Knobel, Kalisch, Keil, Colenso) may seem to be deducible ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the fact that they usually stand in this order (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the circumstance that it is commonly the eldest son's birth which is stated in the preceding list, though this is open to doubt; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which, according to Calvin, Knobel, Keil, and others, describes Shem as Japheth's elder brother; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which, according to Keil, affirms Ham to be the younger son of Noah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:2-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which the order is reversed, but not otherwise altered. But there is reason to believe that Japheth was the eldest and Ham the youngest of the patriarch's children (Michaelis, Clarke, Murphy, Wordsworth, Quarry). According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Shem was born 97 years before the Flood, while (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Noah was 600 years old at the time of the Flood. Hence, if Noah began to beget children in his 500th year, and Shem was born in Noah's 503rd year, the probability is that the firstborn son was Japheth. In accordance with this ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is understood by LXX., Vulgate, Michaelis, Lange, Quarry, and others to assert the priority in respect of age of Japheth. In the narrative ahem is placed first as being spiritually, though not physically, the firstborn. Ranke perceives in the mention of the three sons an indication that each was subsequently \"to lay the foundation of a new beginning.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "THE ANTIQUITY OF MAN. The chronology of the present chapter represents man as having been in existence at the time of the Deluge exactly 1656 years. According to the Septuagint, which Josephus follows except in one particular (the age of Lamech), and which proceeds, again with two exceptions (the age of Jared, which it leaves untouched, and that of Lamech, which it increases by six), upon the principle of adding 100 to the Hebrew numbers, the age of man at the date of that catastrophe was 2262 (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Chronological Table). The dates of the Samaritan Pentateuch, being manifestly incorrect, need not be considered. Adding to the above dates the subsequent chronological periods from the Deluge to the call of Abram (Hebrew, 367; LXX, 1017), from the call of Abram to the exodus from Egypt (430 years according to one calculation, LXX.; 730 according to another, Kalisch), from the exodus to the birth of Christ (1645, Hales; 1593, Jackson; 1491, Ussher; 1531, Petavius; 1320, Bunsen), the antiquity of man, according to the Biblical account, is not less than 5652 and not more than 7536 years. The conclusion thus reached, however, is somewhat scornfully repudiated by modern science, as affording, on either alter. native, an altogether inadequate term of existence for the human race. 1. The evidence of geology is supposed irrefragably to attest that man must have been upon the earth at least 1000 centuries, and probably ten times as long (Wallace on 'Natural Selection,' p. 303). The data for this deduction, as stated by Sir Charles Lyell, are chiefly the discovery, in recent and post Pliocene formations of alleged great antiquity, of fossil human remains and flint implements along with bones of the mammoth and other animals long since extinct ('Antiquity of Man,' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". - 19.). But ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"So far as research has been prosecuted in the different quarters of the globe, no remains of man or of his works have been discovered till we come to the lake-silts, the peat-mosses, the river-gravels, and the cave-earths of the post-tertiary period,\" which seems at least an indirect confirmation of the Biblical record. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"The tree canoes, stone hatchets, flint implements, and occasional fragments of the human skeleton,\" upon which so much is based, \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "have",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " been chiefly discovered within the limited area of Southern and Western Europe,\" while \"we have scarcely any information from the corresponding deposits of other regions;\" consequently, \"till these other regions shall have been examined - and especially Asia, where man flourished long prior to his civilization in Europe - it were premature to hazard any opinion as to man's first appearance on the globe.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"It is true that the antiquity of some of the containing deposits, especially the river drifts, is open to question, and it is also quite possible that the remains of the extinct quadrupeds may in some instances have been reasserted from older accumulations.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"Historically we have no means of arriving at the age of these deposits; geologically we can only ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "approximate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the time by comparison with existing operations; while palaeontologically - the differences between these extinct pachyderms and those still existing are not greater than that which appears between the several living species, and would therefore indicate no great palaeontological antiquity - nothing that may not have taken place within a few thousand years of the ordinarily received chronology\" (Page on 'The Philosophy of Geology,' ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". pp. 114-117). With these undesigned replies from a late eminent authority in geological science, the Bible student will do well to pause before displacing the currently-received age of man by the fabulous duration claimed for him by the first-named writers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 5:32",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As Adam was created in the image of God, so did he beget \"in his own likeness, after his image;\" that is to say, he transmitted the image of God in which he was created, not in the purity in which it came direct from God, but in the form given to it by his own self-determination, modified and corrupted by sin. The begetting of the son by whom the line was perpetuated (no doubt in every case the first-born), is followed by an account of the number of years that Adam and the other fathers lived after that, by the statement that each one begat (other) sons and daughters, by the number of years that he lived altogether, and lastly, by the assertion ויּמת \"and he died.\" This apparently superfluous announcement is \"intended to indicate by its constant recurrence that death reigned from Adam downwards as an unchangeable law (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But against this background of universal death, the power of life was still more conspicuous. For the man did not die till he had propagated life, so that in the midst of the death of individuals the life of the race was preserved, and the hope of the seed sustained, by which the author of death should be overcome.\" In the case of one of the fathers indeed, viz., Enoch (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), life had not only a different issue, but also a different form. Instead of the expression \"and he lived,\" which introduces in every other instance the length of life after the birth of the first-born, we find in the case of Enoch this statement, \"he walked with God (Elohim);\" and instead of the expression \"and he died,\" the announcement, \"and he was not, for God (Elohim) took him.\" The phrase \"walked with God,\" which is only applied to Enoch and Noah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), denotes the most confidential intercourse, the closest communion with the personal God, a walking as it were by the side of God, who still continued His visible intercourse with men (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It must be distinguished from \"walking before God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), and \"walking after God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), both which phrases are used to indicate a pious, moral, blameless life under the law according to the directions of the divine commands. The only other passage in which this expression \"walk with God\" occurs is ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it denotes not the piety of the godly Israelites generally, but the conduct of the priests, who stood in a closer relation to Jehovah under the Old Testament than the rest of the faithful, being permitted to enter the Holy Place, and hold direct intercourse with Him there, which the rest of the people could not do. The article in האלהים gives prominence to the personality of Elohim, and shows that the expression cannot refer to intercourse with the spiritual world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Enoch, the seventh from Adam through Seth, godliness attained its highest point; whilst ungodliness culminated in Lamech, the seventh from Adam through Cain, who made his sword his god. Enoch, therefore, like Elijah, was taken away by God, and carried into the heavenly paradise, so that he did not see (experience) death (Hebrews 11:5); i.e., he was taken up from this temporal life and transfigured into life eternal, being exempted by God from the law of death and of return to the dust, as those of the faithful will be, who shall be alive at the coming of Christ to judgment, and who in like manner shall not taste of death and corruption, but be changed in a moment. There is no foundation for the opinion, that Enoch did not participate at his translation in the glorification which awaits the righteous at the resurrection. For, according to 1 Corinthians 15:20, 1 Corinthians 15:23, it is not in glorification, but in the resurrection, that Christ is the first-fruits. Now the latter presupposes death. Whoever, therefore, through the grace of God is exempted from death, cannot rise from the dead, but reaches ἀφθαρσία, or the glorified state of perfection, through being \"changed\" or \"clothed upon\" (2 Corinthians 5:4). This does not at all affect the truth of the statement in Romans 5:12, Romans 5:14. For the same God who has appointed death as the wages of sin, and given us, through Christ, the victory over death, possesses the power to glorify into eternal life an Enoch and an Elijah, and all who shall be alive at the coming of the Lord without chaining their glorification to death and resurrection. Enoch and Elijah were translated into eternal life with God without passing through disease, death, and corruption, for the consolation of believers, and to awaken the hope of a life after death. Enoch's translation stands about half way between Adam and the flood, in the 987th year after the creation of Adam. Seth, Enos, Cainan, Mahalaleel, and Jared were still alive. His son Methuselah and his grandson Lamech were also living, the latter being 113 years old. Noah was not yet born, and Adam was dead. His translation, in consequence of his walking with God, was \"an example of repentance to all generations,\" as the son of Sirach says (Ecclus. 44:16); and the apocryphal legend in the book of Enoch Genesis 1:9 represents him as prophesying of the coming of the Lord, to execute judgment upon the ungodly (Jde 1:14-15). In comparison with the longevity of the other fathers, Enoch was taken away young, before he had reached half the ordinary age, as a sign that whilst long life, viewed as a time for repentance and grace, is indeed a blessing from God, when the ills which have entered the world through sin are considered, it is also a burden and trouble which God shortens for His chosen. That the patriarchs of the old world felt the ills of this earthly life in all their severity, was attested by Lamech (Genesis 5:28, Genesis 5:29), when he gave his son, who was born 69 years after Enoch's translation, the name of Noah, saying, \"This same shall comfort us concerning our work and the toil of our hands, because of the ground which the Lord hath cursed.\" Noah, נוח from נוּח to rest and הניח to bring rest, is explained by נחם to comfort, in the sense of helpful and remedial consolation. Lamech not only felt the burden of his work upon the ground which God had cursed, but looked forward with a prophetic presentiment to the time when the existing misery and corruption would terminate, and a change for the better, a redemption from the curse, would come. This presentiment assumed the form of hope when his son was born; he therefore gave expression to it in his name. But his hope was not realized, at least not in the way that he desired. A change did indeed take place in the lifetime of Noah. By the judgment of the flood the corrupt race was exterminated, and in Noah, who was preserved because of his blameless walk with God, the restoration of the human race was secured; but the effects of the curse, though mitigated, were not removed; whilst a covenant sign guaranteed the preservation of the human race, and therewith, by implication, his hope of the eventual removal of the curse (Genesis 9:8-17).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In Enoch, the seventh from Adam through Seth, godliness attained its highest point; whilst ungodliness culminated in Lamech, the seventh from Adam through Cain, who made his sword his god. Enoch, therefore, like Elijah, was taken away by God, and carried into the heavenly paradise, so that he did not see (experience) death (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); i.e., he was taken up from this temporal life and transfigured into life eternal, being exempted by God from the law of death and of return to the dust, as those of the faithful will be, who shall be alive at the coming of Christ to judgment, and who in like manner shall not taste of death and corruption, but be changed in a moment. There is no foundation for the opinion, that Enoch did not participate at his translation in the glorification which awaits the righteous at the resurrection. For, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is not in glorification, but in the resurrection, that Christ is the first-fruits. Now the latter presupposes death. Whoever, therefore, through the grace of God is exempted from death, cannot rise from the dead, but reaches ἀφθαρσία, or the glorified state of perfection, through being \"changed\" or \"clothed upon\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This does not at all affect the truth of the statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For the same God who has appointed death as the wages of sin, and given us, through Christ, the victory over death, possesses the power to glorify into eternal life an Enoch and an Elijah, and all who shall be alive at the coming of the Lord without chaining their glorification to death and resurrection. Enoch and Elijah were translated into eternal life with God without passing through disease, death, and corruption, for the consolation of believers, and to awaken the hope of a life after death. Enoch's translation stands about half way between Adam and the flood, in the 987th year after the creation of Adam. Seth, Enos, Cainan, Mahalaleel, and Jared were still alive. His son Methuselah and his grandson Lamech were also living, the latter being 113 years old. Noah was not yet born, and Adam was dead. His translation, in consequence of his walking with God, was \"an example of repentance to all generations,\" as the son of Sirach says (Ecclus. 44:16); and the apocryphal legend in the book of Enoch ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " represents him as prophesying of the coming of the Lord, to execute judgment upon the ungodly (Jde 1:14-15). In comparison with the longevity of the other fathers, Enoch was taken away young, before he had reached half the ordinary age, as a sign that whilst long life, viewed as a time for repentance and grace, is indeed a blessing from God, when the ills which have entered the world through sin are considered, it is also a burden and trouble which God shortens for His chosen. That the patriarchs of the old world felt the ills of this earthly life in all their severity, was attested by Lamech (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), when he gave his son, who was born 69 years after Enoch's translation, the name of Noah, saying, \"This same shall comfort us concerning our work and the toil of our hands, because of the ground which the Lord hath cursed.\" Noah, נוח from נוּח to rest and הניח to bring rest, is explained by נחם to comfort, in the sense of helpful and remedial consolation. Lamech not only felt the burden of his work upon the ground which God had cursed, but looked forward with a prophetic presentiment to the time when the existing misery and corruption would terminate, and a change for the better, a redemption from the curse, would come. This presentiment assumed the form of hope when his son was born; he therefore gave expression to it in his name. But his hope was not realized, at least not in the way that he desired. A change did indeed take place in the lifetime of Noah. By the judgment of the flood the corrupt race was exterminated, and in Noah, who was preserved because of his blameless walk with God, the restoration of the human race was secured; but the effects of the curse, though mitigated, were not removed; whilst a covenant sign guaranteed the preservation of the human race, and therewith, by implication, his hope of the eventual removal of the curse (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:8-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The genealogical table breaks off with Noah; all that is mentioned with reference to him being the birth of his three sons, when he was 500 years old (Genesis 5:32; see Genesis 11:10), without any allusion to the remaining years of his life-an indication of a later hand. \"The mention of three sons leads to the expectation, that whereas hitherto the line has been perpetuated through one member alone, in the future each of the three sons will form a new beginning (vid., Genesis 9:18-19; Genesis 10:1).\" - M. Baumgarten. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The genealogical table breaks off with Noah; all that is mentioned with reference to him being the birth of his three sons, when he was 500 years old (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), without any allusion to the remaining years of his life-an indication of a later hand. \"The mention of three sons leads to the expectation, that whereas hitherto the line has been perpetuated through one member alone, in the future each of the three sons will form a new beginning (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:18-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").\" - M. Baumgarten. ",
            "children": []
          }
        ]
      }
    ]
  }
]