[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The days that Adam lived were nine hundred and thirty years.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The numbers in the Bible are involved in great difficulty, owing to the Hebrew method of numeration being to attach numerical values to letters, and add them together; and as the words thus formed are unmeaning, they easily become corrupted. Hence there is a great discrepancy in the numbers as specified by the three main authorities, the Hebrew text making the length of time from the expulsion from Paradise to the flood 1656 years, the Samaritan text only 1307, and the LXX. 2262, while in almost all cases they agree in the duration of the lives of the several patriarchs. There is, however, an appearance of untrustworthiness about the calculations in the LXX., while the Samaritan transcript must rank as of almost equal authority with the Hebrew text itself. St. Jerome, however, says that the best Samaritan MSS. in his days agreed with the Hebrew, but none such have come down to us.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Not only is there no doubt that the Bible represents human life as vastly prolonged before the flood, while afterwards it grew rapidly briefer, but it teaches us that in the Messianic age life is to be prolonged again, so that a century shall be the duration of childhood, and a grown man’s ordinary age shall be as the age of a tree (Isa. Ixv. 20, 22). On the other hand, we may accept the assertion of physiologists that such as man is now, a period of from 120 to 150 years is the utmost possible duration of human life, and that no strength of constitution, nor temperance, nor vegetable diet could add many years to this limit. Hence many have supposed that in the early Biblical genealogies races or dynasties were meant, or that at a time when there were only engraved cylinders or marks scratched on stones or impressed on bricks as modes of writing, a few names only were selected, each one of whom, by the length of years assigned to him, represented an indefinitely protracted period. In proof that there was something artificial in these genealogies, they point to the fact that the tôldôth of Adam are arranged in ten generations, and that the same number of generations composes the tôldôth of Shem (Genesis 11:10-26).; while in our Lord’s genealogy names are confessedly omitted in order to produce three series, each of fourteen names. It is also undeniable that in Hebrew genealogies it was the rule to omit names. Thus the genealogy of Moses contains only four individuals: Levi, Kohath, Amram, Moses (1Chronicles 6:1-3); while for the same period there are eleven descents given in the genealogy of Jehoshuah (1Chronicles 7:23-27). All this is sufficient to convince every thoughtful person that we must not use these genealogies for chronological purposes. They were not drawn up with any such intention, but to trace the line of primogeniture, and show whose was the birthright. But the longevity of the antediluvian race does not depend upon these genealogies alone, but is part of the very substance of the narrative. It has too the evidence in its favour of all ancient tradition; but it is one of the mysteries of the Bible. We learn, however, from Genesis 6:3 that it did not prove a blessing, and we possibly are to understand that a change took place at the time of the flood in man’s physical constitution, by which the duration of his fife was gradually limited to 120 years.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Not only is there no doubt that the Bible represents human life as vastly prolonged before the flood, while afterwards it grew rapidly briefer, but it teaches us that in the Messianic age life is to be prolonged again, so that a century shall be the duration of childhood, and a grown man’s ordinary age shall be as the age of a tree (Isa. Ixv. 20, 22). On the other hand, we may accept the assertion of physiologists that such as man is now, a period of from 120 to 150 years is the utmost possible duration of human life, and that no strength of constitution, nor temperance, nor vegetable diet could add many years to this limit. Hence many have supposed that in the early Biblical genealogies races or dynasties were meant, or that at a time when there were only engraved cylinders or marks scratched on stones or impressed on bricks as modes of writing, a few names only were selected, each one of whom, by the length of years assigned to him, represented an indefinitely protracted period. In proof that there was something artificial in these genealogies, they point to the fact that the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "tôldôth ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of Adam are arranged in ten generations, and that the same number of generations composes the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "tôldôth ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of Shem (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:10-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").; while in our Lord’s genealogy names are confessedly omitted in order to produce three series, each of fourteen names. It is also undeniable that in Hebrew genealogies it was the rule to omit names. Thus the genealogy of Moses contains only four individuals: Levi, Kohath, Amram, Moses (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Chronicles 6:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); while for the same period there are eleven descents given in the genealogy of Jehoshuah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Chronicles 7:23-27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). All this is sufficient to convince every thoughtful person that we must not use these genealogies for chronological purposes. They were not drawn up with any such intention, but to trace the line of primogeniture, and show whose was the birthright. But the longevity of the antediluvian race does not depend upon these genealogies alone, but is part of the very substance of the narrative. It has too the evidence in its favour of all ancient tradition; but it is one of the mysteries of the Bible. We learn, however, from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that it did not prove a blessing, and we possibly are to understand that a change took place at the time of the flood in man’s physical constitution, by which the duration of his fife was gradually limited to 120 years.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "We ought to add that modern scholarship has proved the identity of the names of the numbers up to ten in the three great families of human speech. Above ten they have nothing in common. It seems, therefore, to follow that primæval man before the confusion of tongues had no power of expressing large numbers. Hence in these lists the generations are limited to ten, and hence too the need of caution in dealing with the mystery which underlies the protracted duration of the lives of the patriarchs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 5:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All the days of Adam were nine hundred and thirty years — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The long lives of men in ancient times, here recorded, are also mentioned by heathen authors. And it was wisely so ordered, both for the greater increase of mankind, and the more speedy replenishing of the earth in the first ages of the world, and for the more effectual preservation and propagation of true religion and other useful knowledge, which, before the invention of letters, could only be conveyed by the channel of tradition.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-5 Adam was made in the image of God; but when fallen he begat a son in his own image, sinful and defiled, frail, wretched, and mortal, like himself. Not only a man like himself, consisting of body and soul, but a sinner like himself. This was the reverse of that Divine likeness in which Adam was made; having lost it, he could not convey it to his seed. Adam lived, in all, 930 years; and then died, according to the sentence passed upon him, To dust thou shalt return. Though he did not die in the day he ate forbidden fruit, yet in that very day he became mortal. Then he began to die; his whole life after was but a reprieve, a forfeited, condemned life; it was a wasting, dying life. Man's life is but dying by degrees.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the compass of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:3-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the course of Adam's life is completed. And after the same model the lines of all his lineal descendants in this chapter are drawn up. The certain particulars stated are the years he lived before the birth of a certain son, the number of years he afterward lived during which sons and daughters were born to him, and his death. Two sons, and most probably several daughters, were born to Adam before the birth of Sheth. But these sons have been already noticed, and the line of Noah is here given. It is obvious, therefore, that the following individuals in the genealogy may, or may not, have been first-born sons. The stated formula, \"and he died,\" at the close of each life except that of Henok, is a standing demonstration of the effect of disobedience.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The writer, according to custom, completes the life of one patriarch before he commences that of the next; and so the first event of the following biography is long antecedent to the last event of the preceding one. This simply and clearly illustrates the law of Hebrew narrative.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The only peculiarity in the life of Adam is the statement that his son was \"in his likeness, after his image.\" This is no doubt intended to include that depravity which had become the characteristic of fallen man. It is contrasted with the preceding notice that Adam was originally created in the image of God. If it had been intended merely to indicate that the offspring was of the same species with the parent, the phrase, \"after his kind\" (למינהוּ  lemı̂ynâh, would have been employed, as in the first chapter. This is one of the mysteries of the race, when the head of it is a moral being, and has fallen. His moral depravity, affecting the essential difference of his nature, descends to his offspring.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As this document alludes to the first in the words, \"in the day of God's creating man, in the likeness of God made he him,\" quotes its very words in the sentence, \"male and female created he them, refers to the second in the words, and called their name man\" Genesis 2:7, and also needs this second for the explication of the statement that the offspring of man bore his likeness, it presupposes the existence and knowledge of these documents at the time when it was written. If it had been intended for an independent work, it would have been more full and explanatory on these important topics.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As this document alludes to the first in the words, \"in the day of God's creating man, in the likeness of God made he him,\" quotes its very words in the sentence, \"male and female created he them, refers to the second in the words, and called their name man\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and also needs this second for the explication of the statement that the offspring of man bore his likeness, it presupposes the existence and knowledge of these documents at the time when it was written. If it had been intended for an independent work, it would have been more full and explanatory on these important topics.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. all the days … Adam lived—The most striking feature in this catalogue is the longevity of Adam and his immediate descendants. Ten are enumerated (Ge 5:5-32) in direct succession whose lives far exceed the ordinary limits with which we are familiar—the shortest being three hundred sixty-five, [Ge 5:23] and the longest nine hundred sixty-nine years [Ge 5:27]. It is useless to inquire whether and what secondary causes may have contributed to this protracted longevity—vigorous constitutions, the nature of their diet, the temperature and salubrity of the climate; or, finally—as this list comprises only the true worshippers of God—whether their great age might be owing to the better government of their passions and the quiet, even tenor of their lives. Since we cannot obtain satisfactory evidence on these points, it is wise to resolve the fact into the sovereign will of God. We can, however, trace some of the important uses to which, in the early economy of Providence, it was subservient. It was the chief means of reserving a knowledge of God, of the great truths of religion, as well as the influence of genuine piety. So that, as their knowledge was obtained by tradition, they would be in a condition to preserve it in the greatest purity.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The long lives of men in ancient times, here noted, are also mentioned by heathen authors; and it was wisely so ordered by God, both for the more plentiful increase of mankind in the first age of the world, and for the more effectual propagation of true religion and other useful knowledge to the world. And many natural reasons might be given why their lives were then longer than afterwards. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And all the days that Adam lived were nine hundred and thirty years,.... Not lunar years, as Varro (d), but solar years, which consisted of three hundred and sixty five days and odd hours, and such were in use among the Egyptians in the times of Moses; and of these must be the age of Adam, and of his posterity in this chapter, and of other patriarchs in this book; or otherwise, some must be said to beget children at an age unfit for it, particularly Enoch, who must beget a son in the sixth year of his age; and the lives of some of them must be very short, even shorter than ours, as Abraham and others; and the time between the creation and the deluge could not be two hundred years: but this long life of the antediluvians, according to the Scripture account, is confirmed by the testimony of many Heathen writers, who affirm that the ancients lived a thousand years, as many of them did, pretty near, though not quite, they using a round number to express their longevity by; for the proof of this Josephus (e) appeals to the testimonies of Manetho the Egyptian, and Berosus the Chaldean, and Mochus and Hestiaeus; besides Jerom the Egyptian, and the Phoenician writers; also Hesiod, Hecataeus, Hellanicus, Acusilaus, Ephorus and Nicolaus. And though the length of time they lived may in some measure be accounted for by natural things as means, such as their healthful constitution, simple diet, the goodness of the fruits of the earth, the temperate air and climate they lived in, their sobriety, temperance, labour and exercise; yet no doubt it was so ordered in Providence for the multiplication of mankind, for the cultivation of arts and sciences, and for the spread of true religion in the world, and the easier handing down to posterity such things as were useful, both for the good of the souls and bodies of men. Maimonides (f) is of opinion, that only those individual persons mentioned in Scripture lived so long, not men in common; and which was owing to their diet and temperance, and exact manner of living, or to a miracle; but there is no reason to believe that they were the only temperate persons, or that any miracle should be wrought particularly on their account for prolonging their lives, and not others. But though they lived so long, it is said of them all, as here of the first man: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he died, according to the sentence of the law in Genesis 2:17 and though he died not immediately upon his transgression of the law, yet he was from thence forward under the sentence of death, and liable to it; yea, death seized upon him, and was working in him, till it brought him to the dust of it; his life, though so long protracted, was a dying life, and at last he submitted to the stroke of death, as all his posterity ever since have, one or two excepted, and all must; for \"it is appointed unto men once to die\". Hebrews 9:27. The Arabic (g) writers relate, that Adam when he was near death called to him Seth, Enos, Kainan, and Mahalaleel, and ordered them by his will, when he was dead, to embalm his body with myrrh, frankincense, and cassia, and lay it in the hidden cave, the cave of Machpelah, where the Jews (h) say he was buried, and where Abraham, Sarah, &c. were buried; and that if they should remove from the neighbourhood of paradise, and from the mountain where they dwelt, they should take his body with them, and bury it in the middle or the earth. They are very particular as to the time of his death. They say (i) it was on a Friday, the fourteenth of Nisan, which answers to part of March and part of April, A. M. nine hundred and thirty, in the ninth hour of that day. The Jews are divided about the funeral of him; some say Seth buried him; others, Enoch; and others, God himself (k): the primitive Christian fathers will have it that he was buried at Golgotha, on Mount Calvary, where Christ suffered. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he died, according to the sentence of the law in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and though he died not immediately upon his transgression of the law, yet he was from thence forward under the sentence of death, and liable to it; yea, death seized upon him, and was working in him, till it brought him to the dust of it; his life, though so long protracted, was a dying life, and at last he submitted to the stroke of death, as all his posterity ever since have, one or two excepted, and all must; for \"it is appointed unto men once to die\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Arabic (g) writers relate, that Adam when he was near death called to him Seth, Enos, Kainan, and Mahalaleel, and ordered them by his will, when he was dead, to embalm his body with myrrh, frankincense, and cassia, and lay it in the hidden cave, the cave of Machpelah, where the Jews (h) say he was buried, and where Abraham, Sarah, &c. were buried; and that if they should remove from the neighbourhood of paradise, and from the mountain where they dwelt, they should take his body with them, and bury it in the middle or the earth. They are very particular as to the time of his death. They say (i) it was on a Friday, the fourteenth of Nisan, which answers to part of March and part of April, A. M. nine hundred and thirty, in the ninth hour of that day. The Jews are divided about the funeral of him; some say Seth buried him; others, Enoch; and others, God himself (k): the primitive Christian fathers will have it that he was buried at Golgotha, on Mount Calvary, where Christ suffered. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Apud Lactant. Institut. l. 2. c. 13. (e) Antiqu. l. 1. c. 3. sect. 9. (f) More Nevochim, par. 2. p. 47. (g) Patricides, p. 5. Elmacinus, p. 6. apud Hottinger. Smegma Oriental. l. 1. c. 8. p. 216, 217. (h) Pirke Eliezer, c. 20. Juchasin, fol. 5. 1.((i) Patricides & Elamacinus, apud Hottinger. ib. (k) Juchasin, ut supra. (fol. 5. 1.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Apud Lactant. Institut. l. 2. c. 13. (e) Antiqu. l. 1. c. 3. sect. 9. (f) More Nevochim, par. 2. p. 47. (g) Patricides, p. 5. Elmacinus, p. 6. apud Hottinger. Smegma Oriental. l. 1. c. 8. p. 216, 217. (h) Pirke Eliezer, c. 20. Juchasin, fol. 5. 1.((i) Patricides & Elamacinus, apud Hottinger. ib. (k) Juchasin, ut supra. (fol. 5. 1.) ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And all the days that Adam lived were nine hundred and thirty years: and he died.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As Adam was created in the image of God, so did he beget \"in his own likeness, after his image;\" that is to say, he transmitted the image of God in which he was created, not in the purity in which it came direct from God, but in the form given to it by his own self-determination, modified and corrupted by sin. The begetting of the son by whom the line was perpetuated (no doubt in every case the first-born), is followed by an account of the number of years that Adam and the other fathers lived after that, by the statement that each one begat (other) sons and daughters, by the number of years that he lived altogether, and lastly, by the assertion ויּמת \"and he died.\" This apparently superfluous announcement is \"intended to indicate by its constant recurrence that death reigned from Adam downwards as an unchangeable law (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But against this background of universal death, the power of life was still more conspicuous. For the man did not die till he had propagated life, so that in the midst of the death of individuals the life of the race was preserved, and the hope of the seed sustained, by which the author of death should be overcome.\" In the case of one of the fathers indeed, viz., Enoch (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), life had not only a different issue, but also a different form. Instead of the expression \"and he lived,\" which introduces in every other instance the length of life after the birth of the first-born, we find in the case of Enoch this statement, \"he walked with God (Elohim);\" and instead of the expression \"and he died,\" the announcement, \"and he was not, for God (Elohim) took him.\" The phrase \"walked with God,\" which is only applied to Enoch and Noah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), denotes the most confidential intercourse, the closest communion with the personal God, a walking as it were by the side of God, who still continued His visible intercourse with men (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It must be distinguished from \"walking before God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), and \"walking after God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), both which phrases are used to indicate a pious, moral, blameless life under the law according to the directions of the divine commands. The only other passage in which this expression \"walk with God\" occurs is ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it denotes not the piety of the godly Israelites generally, but the conduct of the priests, who stood in a closer relation to Jehovah under the Old Testament than the rest of the faithful, being permitted to enter the Holy Place, and hold direct intercourse with Him there, which the rest of the people could not do. The article in האלהים gives prominence to the personality of Elohim, and shows that the expression cannot refer to intercourse with the spiritual world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Enoch, the seventh from Adam through Seth, godliness attained its highest point; whilst ungodliness culminated in Lamech, the seventh from Adam through Cain, who made his sword his god. Enoch, therefore, like Elijah, was taken away by God, and carried into the heavenly paradise, so that he did not see (experience) death (Hebrews 11:5); i.e., he was taken up from this temporal life and transfigured into life eternal, being exempted by God from the law of death and of return to the dust, as those of the faithful will be, who shall be alive at the coming of Christ to judgment, and who in like manner shall not taste of death and corruption, but be changed in a moment. There is no foundation for the opinion, that Enoch did not participate at his translation in the glorification which awaits the righteous at the resurrection. For, according to 1 Corinthians 15:20, 1 Corinthians 15:23, it is not in glorification, but in the resurrection, that Christ is the first-fruits. Now the latter presupposes death. Whoever, therefore, through the grace of God is exempted from death, cannot rise from the dead, but reaches ἀφθαρσία, or the glorified state of perfection, through being \"changed\" or \"clothed upon\" (2 Corinthians 5:4). This does not at all affect the truth of the statement in Romans 5:12, Romans 5:14. For the same God who has appointed death as the wages of sin, and given us, through Christ, the victory over death, possesses the power to glorify into eternal life an Enoch and an Elijah, and all who shall be alive at the coming of the Lord without chaining their glorification to death and resurrection. Enoch and Elijah were translated into eternal life with God without passing through disease, death, and corruption, for the consolation of believers, and to awaken the hope of a life after death. Enoch's translation stands about half way between Adam and the flood, in the 987th year after the creation of Adam. Seth, Enos, Cainan, Mahalaleel, and Jared were still alive. His son Methuselah and his grandson Lamech were also living, the latter being 113 years old. Noah was not yet born, and Adam was dead. His translation, in consequence of his walking with God, was \"an example of repentance to all generations,\" as the son of Sirach says (Ecclus. 44:16); and the apocryphal legend in the book of Enoch Genesis 1:9 represents him as prophesying of the coming of the Lord, to execute judgment upon the ungodly (Jde 1:14-15). In comparison with the longevity of the other fathers, Enoch was taken away young, before he had reached half the ordinary age, as a sign that whilst long life, viewed as a time for repentance and grace, is indeed a blessing from God, when the ills which have entered the world through sin are considered, it is also a burden and trouble which God shortens for His chosen. That the patriarchs of the old world felt the ills of this earthly life in all their severity, was attested by Lamech (Genesis 5:28, Genesis 5:29), when he gave his son, who was born 69 years after Enoch's translation, the name of Noah, saying, \"This same shall comfort us concerning our work and the toil of our hands, because of the ground which the Lord hath cursed.\" Noah, נוח from נוּח to rest and הניח to bring rest, is explained by נחם to comfort, in the sense of helpful and remedial consolation. Lamech not only felt the burden of his work upon the ground which God had cursed, but looked forward with a prophetic presentiment to the time when the existing misery and corruption would terminate, and a change for the better, a redemption from the curse, would come. This presentiment assumed the form of hope when his son was born; he therefore gave expression to it in his name. But his hope was not realized, at least not in the way that he desired. A change did indeed take place in the lifetime of Noah. By the judgment of the flood the corrupt race was exterminated, and in Noah, who was preserved because of his blameless walk with God, the restoration of the human race was secured; but the effects of the curse, though mitigated, were not removed; whilst a covenant sign guaranteed the preservation of the human race, and therewith, by implication, his hope of the eventual removal of the curse (Genesis 9:8-17).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In Enoch, the seventh from Adam through Seth, godliness attained its highest point; whilst ungodliness culminated in Lamech, the seventh from Adam through Cain, who made his sword his god. Enoch, therefore, like Elijah, was taken away by God, and carried into the heavenly paradise, so that he did not see (experience) death (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); i.e., he was taken up from this temporal life and transfigured into life eternal, being exempted by God from the law of death and of return to the dust, as those of the faithful will be, who shall be alive at the coming of Christ to judgment, and who in like manner shall not taste of death and corruption, but be changed in a moment. There is no foundation for the opinion, that Enoch did not participate at his translation in the glorification which awaits the righteous at the resurrection. For, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is not in glorification, but in the resurrection, that Christ is the first-fruits. Now the latter presupposes death. Whoever, therefore, through the grace of God is exempted from death, cannot rise from the dead, but reaches ἀφθαρσία, or the glorified state of perfection, through being \"changed\" or \"clothed upon\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This does not at all affect the truth of the statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For the same God who has appointed death as the wages of sin, and given us, through Christ, the victory over death, possesses the power to glorify into eternal life an Enoch and an Elijah, and all who shall be alive at the coming of the Lord without chaining their glorification to death and resurrection. Enoch and Elijah were translated into eternal life with God without passing through disease, death, and corruption, for the consolation of believers, and to awaken the hope of a life after death. Enoch's translation stands about half way between Adam and the flood, in the 987th year after the creation of Adam. Seth, Enos, Cainan, Mahalaleel, and Jared were still alive. His son Methuselah and his grandson Lamech were also living, the latter being 113 years old. Noah was not yet born, and Adam was dead. His translation, in consequence of his walking with God, was \"an example of repentance to all generations,\" as the son of Sirach says (Ecclus. 44:16); and the apocryphal legend in the book of Enoch ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " represents him as prophesying of the coming of the Lord, to execute judgment upon the ungodly (Jde 1:14-15). In comparison with the longevity of the other fathers, Enoch was taken away young, before he had reached half the ordinary age, as a sign that whilst long life, viewed as a time for repentance and grace, is indeed a blessing from God, when the ills which have entered the world through sin are considered, it is also a burden and trouble which God shortens for His chosen. That the patriarchs of the old world felt the ills of this earthly life in all their severity, was attested by Lamech (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), when he gave his son, who was born 69 years after Enoch's translation, the name of Noah, saying, \"This same shall comfort us concerning our work and the toil of our hands, because of the ground which the Lord hath cursed.\" Noah, נוח from נוּח to rest and הניח to bring rest, is explained by נחם to comfort, in the sense of helpful and remedial consolation. Lamech not only felt the burden of his work upon the ground which God had cursed, but looked forward with a prophetic presentiment to the time when the existing misery and corruption would terminate, and a change for the better, a redemption from the curse, would come. This presentiment assumed the form of hope when his son was born; he therefore gave expression to it in his name. But his hope was not realized, at least not in the way that he desired. A change did indeed take place in the lifetime of Noah. By the judgment of the flood the corrupt race was exterminated, and in Noah, who was preserved because of his blameless walk with God, the restoration of the human race was secured; but the effects of the curse, though mitigated, were not removed; whilst a covenant sign guaranteed the preservation of the human race, and therewith, by implication, his hope of the eventual removal of the curse (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:8-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The genealogical table breaks off with Noah; all that is mentioned with reference to him being the birth of his three sons, when he was 500 years old (Genesis 5:32; see Genesis 11:10), without any allusion to the remaining years of his life-an indication of a later hand. \"The mention of three sons leads to the expectation, that whereas hitherto the line has been perpetuated through one member alone, in the future each of the three sons will form a new beginning (vid., Genesis 9:18-19; Genesis 10:1).\" - M. Baumgarten. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The genealogical table breaks off with Noah; all that is mentioned with reference to him being the birth of his three sons, when he was 500 years old (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), without any allusion to the remaining years of his life-an indication of a later hand. \"The mention of three sons leads to the expectation, that whereas hitherto the line has been perpetuated through one member alone, in the future each of the three sons will form a new beginning (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:18-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").\" - M. Baumgarten. ",
            "children": []
          }
        ]
      }
    ]
  }
]