[{"header":"A Story about a Farmer"},{"num":4,"verse":"The next time Jesus taught beside Lake Galilee, a big crowd gathered. It was so large that he had to sit in a boat out on the lake, while the people stood on the shore. "},{"num":2,"verse":"He used stories to teach them many things, and this is part of what he taught:"},{"num":9,"verse":"Then Jesus said, “If you have ears, pay attention.”"},{"header":"Why Jesus Used Stories"},{"num":10,"verse":"When Jesus was alone with the twelve apostles and some others, they asked him about these stories. "},{"num":11,"verse":"He answered:"},{"header":"Jesus Explains the Story about the Farmer"},{"num":13,"verse":"Jesus told them:"},{"header":"Light"},{"num":21,"verse":"Jesus also said:"},{"header":"Another Story about Seeds"},{"num":26,"verse":"Again Jesus said:"},{"header":"A Mustard Seed"},{"num":30,"verse":"Finally, Jesus said:"},{"header":"The Reason for Teaching with Stories"},{"num":33,"verse":"Jesus used many other stories when he spoke to the people, and he taught them as much as they could understand. "},{"num":34,"verse":"He did not tell them anything without using stories. But when he was alone with his disciples, he explained everything to them."},{"header":"A Storm"},{"num":35,"verse":"That evening, Jesus said to his disciples, “Let’s cross to the east side.” "},{"num":36,"verse":"So they left the crowd, and his disciples started across the lake with him in the boat. Some other boats followed along. "},{"num":37,"verse":"Suddenly a windstorm struck the lake. Waves started splashing into the boat, and it was about to sink."},{"num":38,"verse":"Jesus was in the back of the boat with his head on a pillow, and he was asleep. His disciples woke him and said, “Teacher, don’t you care that we’re about to drown?”"},{"num":39,"verse":"Jesus got up and ordered the wind and the waves to be quiet. The wind stopped, and everything was calm."},{"num":40,"verse":"Jesus asked his disciples, “Why were you afraid? Don’t you have any faith?”"},{"num":41,"verse":"Now they were more afraid than ever and said to each other, “Who is this? Even the wind and the waves obey him!”"}]