[{"header":"A Story About a Farmer Sowing Seed(A)"},{"num":4,"verse":"Another time Jesus began teaching by the lake, and a large crowd gathered around him. He got into a boat so that he could sit and teach from the lake. All the people stayed on the shore near the water."},{"num":2,"verse":"Jesus used stories to teach them many things. One of his lessons included this story:"},{"num":3,"verse":"“Listen! A farmer went out to sow seed."},{"num":4,"verse":"While he was scattering the seed, some of it fell by the road. The birds came and ate all that seed."},{"num":5,"verse":"Other seed fell on rocky ground, where there was not enough dirt. It grew quickly there because the soil was not deep."},{"num":6,"verse":"But then the sun rose and the plants were burned. They died because they did not have deep roots."},{"num":7,"verse":"Some other seed fell among thorny weeds. The weeds grew and stopped the good plants from growing. So they did not make grain."},{"num":8,"verse":"But some of the seed fell on good ground. There it began to grow, and it made grain. Some plants made 30 times more grain, some 60 times more, and some 100 times more.”"},{"num":9,"verse":"Then Jesus said, “You people who hear me, listen!”"},{"header":"Why Jesus Used Stories to Teach(B)"},{"num":10,"verse":"Later, Jesus was away from the people. The twelve apostles and his other followers asked him about the stories."},{"num":11,"verse":"Jesus said, “Only you can know the secret truth about God’s kingdom. But to those other people I tell everything by using stories."},{"num":12,"verse":"I do this so that"},{"header":"Jesus Explains the Story About Seed(D)"},{"num":13,"verse":"Then Jesus said to the followers, “Do you understand this story? If you don’t, how will you understand any story?"},{"num":14,"verse":"The farmer is like someone who plants God’s teaching in people."},{"num":15,"verse":"Sometimes the teaching falls on the path. That is like some people who hear the teaching of God. As soon as they hear it, Satan comes and takes away the teaching that was planted in them."},{"num":16,"verse":"“Other people are like the seed planted on rocky ground. They hear the teaching, and they quickly and gladly accept it."},{"num":17,"verse":"But they don’t allow it to go deep into their lives. They keep it only a short time. As soon as trouble or persecution comes because of the teaching they accepted, they give up."},{"num":18,"verse":"“Others are like the seed planted among the thorny weeds. They hear the teaching,"},{"num":19,"verse":"but their lives become full of other things: the worries of this life, the love of money, and everything else they want. This keeps the teaching from growing, and it does not produce a crop in their lives."},{"num":20,"verse":"“And others are like the seed planted on the good ground. They hear the teaching and accept it. Then they grow and produce a good crop—sometimes 30 times more, sometimes 60 times more, and sometimes 100 times more.”"},{"header":"Use the Understanding You Have(E)"},{"num":21,"verse":"Then Jesus said to them, “You don’t take a lamp and hide it under a bowl or a bed, do you? Of course not. You put it on a lampstand."},{"num":22,"verse":"Everything that is hidden will be made clear. Every secret thing will be made known."},{"num":23,"verse":"You people who hear me, listen!"},{"num":24,"verse":"Think carefully about what you are hearing. God will know how much to give you by how much you understand now. But he will give you more than you deserve."},{"num":25,"verse":"The people who have some understanding will receive more. But those who do not have much will lose even the small amount they have.”"},{"header":"Jesus Uses a Story About Seed"},{"num":26,"verse":"Then Jesus said, “God’s kingdom is like a man who plants seed in the ground."},{"num":27,"verse":"The seed begins to grow. It grows night and day. It doesn’t matter whether the man is sleeping or awake, the seed still grows. He doesn’t know how it happens."},{"num":28,"verse":"Without any help the ground produces grain. First the plant grows, then the head, and then all the grain in the head."},{"num":29,"verse":"When the grain is ready, the man cuts it. This is the harvest time.”"},{"header":"What Is God’s Kingdom Like?(F)"},{"num":30,"verse":"Then Jesus said, “What can I use to show you what God’s kingdom is like? What story can I use to explain it?"},{"num":31,"verse":"God’s kingdom is like a mustard seed, which is smaller than any other seed on earth that you can plant."},{"num":32,"verse":"But when you plant it, it grows and becomes the largest of all the plants in your garden. It has branches that are very big. The wild birds can come and make nests there and be protected from the sun.”"},{"num":33,"verse":"Jesus used many stories like these to teach the people. He taught them all they could understand."},{"num":34,"verse":"He always used stories to teach them. But when he was alone with his followers, Jesus explained everything to them."},{"header":"Jesus’ Followers See His Power(G)"},{"num":35,"verse":"That day, at evening, Jesus said to his followers, “Come with me across the lake.”"},{"num":36,"verse":"So they left the crowd behind and went with Jesus in the boat he was already in. There were also other boats that went with them."},{"num":37,"verse":"A very bad wind came up on the lake. The waves were coming over the sides and into the boat, and it was almost full of water."},{"num":38,"verse":"Jesus was inside the boat, sleeping with his head on a pillow. The followers went and woke him. They said, “Teacher, don’t you care about us? We are going to drown!”"},{"num":39,"verse":"Jesus stood up and gave a command to the wind and the water. He said, “Quiet! Be still!” Then the wind stopped, and the lake became calm."},{"num":40,"verse":"He said to his followers, “Why are you afraid? Do you still have no faith?”"},{"num":41,"verse":"They were very afraid and asked each other, “What kind of man is this? Even the wind and the water obey him!”"}]