[{"header":"A Story About Planting Seed"},{"num":4,"verse":"Again Jesus began teaching by the lake. A great crowd gathered around him, so he sat down in a boat near the shore. All the people stayed on the shore close to the water. "},{"num":2,"verse":"Jesus taught them many things, using stories. He said, "},{"num":9,"verse":"Then Jesus said, “Let those with ears use them and listen!”"},{"header":"Jesus Tells Why He Used Stories"},{"num":10,"verse":"Later, when Jesus was alone, the twelve apostles and others around him asked him about the stories."},{"num":11,"verse":"Jesus said, “You can know the secret about the kingdom of God. But to other people I tell everything by using stories "},{"header":"Jesus Explains the Seed Story"},{"num":13,"verse":"Then Jesus said to his followers, “Don’t you understand this story? If you don’t, how will you understand any story? "},{"header":"Use What You Have"},{"num":21,"verse":"Then Jesus said to them, “Do you hide a lamp under a bowl or under a bed? No! You put the lamp on a lampstand. "},{"header":"Jesus Uses a Story About Seed"},{"num":26,"verse":"Then Jesus said, “The kingdom of God is like someone who plants seed in the ground. "},{"header":"A Story About Mustard Seed"},{"num":30,"verse":"Then Jesus said, “How can I show you what the kingdom of God is like? What story can I use to explain it? "},{"num":33,"verse":"Jesus used many stories like these to teach the crowd God’s message—as much as they could understand. "},{"num":34,"verse":"He always used stories to teach them. But when he and his followers were alone, Jesus explained everything to them."},{"header":"Jesus Calms a Storm"},{"num":35,"verse":"That evening, Jesus said to his followers, “Let’s go across the lake.” "},{"num":36,"verse":"Leaving the crowd behind, they took him in the boat just as he was. There were also other boats with them. "},{"num":37,"verse":"A very strong wind came up on the lake. The waves came over the sides and into the boat so that it was already full of water. "},{"num":38,"verse":"Jesus was at the back of the boat, sleeping with his head on a cushion. His followers woke him and said, “Teacher, don’t you care that we are drowning!”"},{"num":39,"verse":"Jesus stood up and commanded the wind and said to the waves, “Quiet! Be still!” Then the wind stopped, and it became completely calm."},{"num":40,"verse":"Jesus said to his followers, “Why are you afraid? Do you still have no faith?”"},{"num":41,"verse":"The followers were very afraid and asked each other, “Who is this? Even the wind and the waves obey him!”"}]