[{"header":"The Parable of the Sower(A)(B)"},{"num":4,"verse":"Again Jesus began to teach by the lake. The crowd that gathered around him was so large that he got into a boat and sat in it out on the lake, while all the people were along the shore at the water’s edge."},{"num":2,"verse":"He taught them many things by parables, and in his teaching said:"},{"num":9,"verse":"Then Jesus said, “Whoever has ears to hear, let them hear.”"},{"num":10,"verse":"When he was alone, the Twelve and the others around him asked him about the parables."},{"num":11,"verse":"He told them, “The secret of the kingdom of God has been given to you. But to those on the outside everything is said in parables"},{"num":13,"verse":"Then Jesus said to them, “Don’t you understand this parable? How then will you understand any parable?"},{"header":"A Lamp on a Stand"},{"num":21,"verse":"He said to them, “Do you bring in a lamp to put it under a bowl or a bed? Instead, don’t you put it on its stand?"},{"header":"The Parable of the Growing Seed"},{"num":26,"verse":"He also said, “This is what the kingdom of God is like. A man scatters seed on the ground."},{"header":"The Parable of the Mustard Seed(U)"},{"num":30,"verse":"Again he said, “What shall we say the kingdom of God is like, or what parable shall we use to describe it?"},{"num":33,"verse":"With many similar parables Jesus spoke the word to them, as much as they could understand."},{"num":34,"verse":"He did not say anything to them without using a parable. But when he was alone with his own disciples, he explained everything."},{"header":"Jesus Calms the Storm(Y)"},{"num":35,"verse":"That day when evening came, he said to his disciples, “Let us go over to the other side.”"},{"num":36,"verse":"Leaving the crowd behind, they took him along, just as he was, in the boat. There were also other boats with him."},{"num":37,"verse":"A furious squall came up, and the waves broke over the boat, so that it was nearly swamped."},{"num":38,"verse":"Jesus was in the stern, sleeping on a cushion. The disciples woke him and said to him, “Teacher, don’t you care if we drown?”"},{"num":39,"verse":"He got up, rebuked the wind and said to the waves, “Quiet! Be still!” Then the wind died down and it was completely calm."},{"num":40,"verse":"He said to his disciples, “Why are you so afraid? Do you still have no faith?”"},{"num":41,"verse":"They were terrified and asked each other, “Who is this? Even the wind and the waves obey him!”"}]