[{"header":"Parable of the Farmer Scattering Seed"},{"num":4,"verse":"Once again Jesus began teaching by the lakeshore. A very large crowd soon gathered around him, so he got into a boat. Then he sat in the boat while all the people remained on the shore."},{"num":2,"verse":"He taught them by telling many stories in the form of parables, such as this one:"},{"num":3,"verse":"“Listen! A farmer went out to plant some seed."},{"num":4,"verse":"As he scattered it across his field, some of the seed fell on a footpath, and the birds came and ate it."},{"num":5,"verse":"Other seed fell on shallow soil with underlying rock. The seed sprouted quickly because the soil was shallow."},{"num":6,"verse":"But the plant soon wilted under the hot sun, and since it didn’t have deep roots, it died."},{"num":7,"verse":"Other seed fell among thorns that grew up and choked out the tender plants so they produced no grain."},{"num":8,"verse":"Still other seeds fell on fertile soil, and they sprouted, grew, and produced a crop that was thirty, sixty, and even a hundred times as much as had been planted!”"},{"num":9,"verse":"Then he said, “Anyone with ears to hear should listen and understand.”"},{"num":10,"verse":"Later, when Jesus was alone with the twelve disciples and with the others who were gathered around, they asked him what the parables meant."},{"num":11,"verse":"He replied, “You are permitted to understand the secret of the Kingdom of God. But I use parables for everything I say to outsiders,"},{"num":12,"verse":"so that the Scriptures might be fulfilled:"},{"num":13,"verse":"Then Jesus said to them, “If you can’t understand the meaning of this parable, how will you understand all the other parables?"},{"num":14,"verse":"The farmer plants seed by taking God’s word to others."},{"num":15,"verse":"The seed that fell on the footpath represents those who hear the message, only to have Satan come at once and take it away."},{"num":16,"verse":"The seed on the rocky soil represents those who hear the message and immediately receive it with joy."},{"num":17,"verse":"But since they don’t have deep roots, they don’t last long. They fall away as soon as they have problems or are persecuted for believing God’s word."},{"num":18,"verse":"The seed that fell among the thorns represents others who hear God’s word,"},{"num":19,"verse":"but all too quickly the message is crowded out by the worries of this life, the lure of wealth, and the desire for other things, so no fruit is produced."},{"num":20,"verse":"And the seed that fell on good soil represents those who hear and accept God’s word and produce a harvest of thirty, sixty, or even a hundred times as much as had been planted!”"},{"header":"Parable of the Lamp"},{"num":21,"verse":"Then Jesus asked them, “Would anyone light a lamp and then put it under a basket or under a bed? Of course not! A lamp is placed on a stand, where its light will shine."},{"num":22,"verse":"For everything that is hidden will eventually be brought into the open, and every secret will be brought to light."},{"num":23,"verse":"Anyone with ears to hear should listen and understand.”"},{"num":24,"verse":"Then he added, “Pay close attention to what you hear. The closer you listen, the more understanding you will be given—and you will receive even more."},{"num":25,"verse":"To those who listen to my teaching, more understanding will be given. But for those who are not listening, even what little understanding they have will be taken away from them.”"},{"header":"Parable of the Growing Seed"},{"num":26,"verse":"Jesus also said, “The Kingdom of God is like a farmer who scatters seed on the ground."},{"num":27,"verse":"Night and day, while he’s asleep or awake, the seed sprouts and grows, but he does not understand how it happens."},{"num":28,"verse":"The earth produces the crops on its own. First a leaf blade pushes through, then the heads of wheat are formed, and finally the grain ripens."},{"num":29,"verse":"And as soon as the grain is ready, the farmer comes and harvests it with a sickle, for the harvest time has come.”"},{"header":"Parable of the Mustard Seed"},{"num":30,"verse":"Jesus said, “How can I describe the Kingdom of God? What story should I use to illustrate it?"},{"num":31,"verse":"It is like a mustard seed planted in the ground. It is the smallest of all seeds,"},{"num":32,"verse":"but it becomes the largest of all garden plants; it grows long branches, and birds can make nests in its shade.”"},{"num":33,"verse":"Jesus used many similar stories and illustrations to teach the people as much as they could understand."},{"num":34,"verse":"In fact, in his public ministry he never taught without using parables; but afterward, when he was alone with his disciples, he explained everything to them."},{"header":"Jesus Calms the Storm"},{"num":35,"verse":"As evening came, Jesus said to his disciples, “Let’s cross to the other side of the lake.”"},{"num":36,"verse":"So they took Jesus in the boat and started out, leaving the crowds behind (although other boats followed)."},{"num":37,"verse":"But soon a fierce storm came up. High waves were breaking into the boat, and it began to fill with water."},{"num":38,"verse":"Jesus was sleeping at the back of the boat with his head on a cushion. The disciples woke him up, shouting, “Teacher, don’t you care that we’re going to drown?”"},{"num":39,"verse":"When Jesus woke up, he rebuked the wind and said to the waves, “Silence! Be still!” Suddenly the wind stopped, and there was a great calm."},{"num":40,"verse":"Then he asked them, “Why are you afraid? Do you still have no faith?”"},{"num":41,"verse":"The disciples were absolutely terrified. “Who is this man?” they asked each other. “Even the wind and waves obey him!”"}]