[{"header":"Parable of the Sower"},{"num":4,"verse":"Once again Jesus went to teach the people at the shore of Lake Galilee and a massive crowd surrounded him. The crowd was so huge that he had to get into a boat and teach the people from there. "},{"num":2,"verse":"He taught them many things by using parables to illustrate spiritual truths, saying:"},{"num":3,"verse":"“Consider this: A sower went out to sow. "},{"num":4,"verse":"As he sowed some fell along the beaten path and soon the birds came and ate it. "},{"num":5,"verse":"Some fell onto gravel with no topsoil and quickly sprouted since the soil had no depth. "},{"num":6,"verse":"But when the days grew hot, the sprouts were scorched and withered because they had insufficient roots. "},{"num":7,"verse":"Some fell among the thorns, and the thorns grew up and choked it, and it yielded no fruit. "},{"num":8,"verse":"But some fell onto good, rich soil that kept producing a good harvest. Some yielded thirty, some sixty—and some a hundredfold! "},{"num":9,"verse":"If you understand this, then you need to respond.”"},{"header":"The Purpose of Parables"},{"num":10,"verse":"Afterward, Jesus’ disciples and those close to him remained behind to ask Jesus about his parables. "},{"num":11,"verse":"He said to them, “The privilege of intimately knowing the mystery of God’s kingdom realm has been granted to you, but not to the others, where everything is revealed in parables."},{"num":12,"verse":"“For even when they see what I do, they will not understand, and when they hear what I say, they will learn nothing, otherwise they would repent and be forgiven.”"},{"num":13,"verse":"Then he said to them, “If you don’t understand this parable, how will you understand any parable? "},{"num":14,"verse":"Let me explain: The farmer sows the message of the kingdom. "},{"num":15,"verse":"What falls on the beaten path represents those who hear the message, but immediately Satan appears and snatches it from their hearts. "},{"num":16,"verse":"And what is sown on gravel represents those who hear the message and receive it joyfully, "},{"num":17,"verse":"but because their hearts fail to sink a deep root, they don’t endure for long. For when trouble or persecution comes on account of the message, they immediately wilt and fall away. "},{"num":18,"verse":"And what is sown among thorns represents those who hear the message, "},{"num":19,"verse":"but they allow the cares of this life and the seduction of wealth and the desires for other things to crowd out and choke the message so that it produces nothing."},{"num":20,"verse":"“But what is sown on good soil represents those who open their hearts to receive the message and their lives bear good fruit—some yield a harvest of thirty, sixty, even a hundredfold!”"},{"header":"Parable of the Lamp"},{"num":21,"verse":"He also gave them this parable: “No one lights a lamp only to place it under a basket or under the bed. It is meant to be placed on a lampstand. "},{"num":22,"verse":"For there is nothing that is hidden that won’t be disclosed, and there is no secret that won’t be brought out into the light! "},{"num":23,"verse":"If you understand what I’m saying, you need to respond!”"},{"num":24,"verse":"Then he said to them, “Be diligent to understand the meaning behind everything you hear, for as you do, more understanding will be given to you. And according to your longing to understand, much more will be added to you. "},{"num":25,"verse":"For those who listen with open hearts will receive more revelation. But those who don’t listen with open hearts will lose what little they think they have!”"},{"header":"Parable of the Growing Seed"},{"num":26,"verse":"Jesus also told them this parable: “God’s kingdom realm is like someone spreading seed on the ground. "},{"num":27,"verse":"He goes to bed and gets up, day after day, and the seed sprouts and grows tall, though he knows not how. "},{"num":28,"verse":"All by itself it sprouts, and the soil produces a crop; first the green stem, then the head on the stalk, and then the fully developed grain in the head. "},{"num":29,"verse":"Then, when the grain is ripe, he immediately puts the sickle to the grain, because harvest time has come.”"},{"header":"Parable of the Tiny Mustard Seed"},{"num":30,"verse":"And he told them this parable: “How can I describe God’s kingdom realm? Let me illustrate it with this parable. "},{"num":31,"verse":"It is like the mustard seed, the tiniest of all the seeds, "},{"num":32,"verse":"yet when it springs up and grows, it becomes the largest plant in the garden, with so many large spreading branches, even birds can nest in its shade.”"},{"header":"Jesus Always Taught Using Parables"},{"num":33,"verse":"Jesus used many parables such as these as he taught the people, and they learned according to their ability to understand. "},{"num":34,"verse":"He never spoke to them without using parables, but would wait until he was alone with his disciples to explain to them their meanings."},{"header":"Jesus Stills a Storm"},{"num":35,"verse":"That same day, after it grew dark, Jesus said to his disciples, “Let’s cross over to the other side of the lake.” "},{"num":36,"verse":"Leaving the crowd behind, the disciples got into the boat in which Jesus was already sitting, and they took him with them. Other boats sailed with them. "},{"num":37,"verse":"Suddenly, as they were crossing the lake, a ferocious storm arose, with violent winds and waves that were crashing into the boat until it was nearly swamped. "},{"num":38,"verse":"But Jesus was calmly sleeping in the stern, resting on a cushion. "},{"num":39,"verse":"So they shook him awake, saying, “Teacher, don’t you even care that we are all about to die!” Fully awake, he rebuked the storm and shouted to the sea, “Hush! Be still!” All at once the wind stopped howling and the water became perfectly calm."},{"num":40,"verse":"Then he turned to his disciples and said to them, “Why are you so afraid? Haven’t you learned to trust yet?” "},{"num":41,"verse":"But they were overwhelmed with fear and awe and said to one another, “Who is this man who has such authority that even the wind and waves obey him?”"}]