[{"num":13,"verse":"[Job continued:] Behold, my eye has seen all this, my ear has heard and understood it."},{"num":2,"verse":"What you know, I also know; I am not inferior to you."},{"num":3,"verse":"Surely I wish to speak to the Almighty, and I desire to argue and reason my case with God [that He may explain the conflict between what I believe of Him and what I see of Him]."},{"num":4,"verse":"But you are forgers of lies [you defame my character most untruthfully]; you are all physicians of no value and have no remedy to offer."},{"num":5,"verse":"Oh, that you would altogether hold your peace! Then you would evidence your wisdom and you might pass for wise men."},{"num":6,"verse":"Hear now my reasoning, and listen to the pleadings of my lips."},{"num":7,"verse":"Will you speak unrighteously for God and talk deceitfully for Him?"},{"num":8,"verse":"Will you show partiality to Him [be unjust to me in order to gain favor with Him]? Will you act as special pleaders for God?"},{"num":9,"verse":"Would it be profitable for you if He should investigate your tactics [with me]? Or as one deceives and mocks a man, do you deceive and mock Him?"},{"num":10,"verse":"He will surely reprove you if you do secretly show partiality."},{"num":11,"verse":"Shall not His majesty make you afraid, and should not your awe for Him restrain you?"},{"num":12,"verse":"Your memorable sayings are proverbs of ashes [valueless]; your defenses are defenses of clay [and will crumble]."},{"num":13,"verse":"Hold your peace! Let me alone, so I may speak; and let come on me what may."},{"num":14,"verse":"Why should I take my flesh in my teeth and put my life in my hands [incurring the danger of God’s wrath]?"},{"num":15,"verse":"[I do it because, though He slay me, yet will I wait for and trust Him and] behold, He will slay me; I have no hope—nevertheless, I will maintain and argue my ways before Him and even to His face."},{"num":16,"verse":"This will be my salvation, that a polluted and godless man shall not come before Him."},{"num":17,"verse":"Listen diligently to my speech, and let my declaration be in your ears."},{"num":18,"verse":"Behold now, I have prepared my case; I know that I shall be justified and vindicated."},{"num":19,"verse":"Who is he who will argue against and refute me? For then I would hold my peace and expire."},{"num":20,"verse":"Only [O Lord] grant two conditions to me, and then will I not hide myself from You:"},{"num":21,"verse":"Withdraw Your hand and take this bodily suffering far from me; and let not my [reverent] dread of You terrify me."},{"num":22,"verse":"Then [Lord] call and I will answer, or let me speak, and You answer me."},{"num":23,"verse":"How many are my iniquities and sins [that so much sorrow should come to me]? Make me recognize and know my transgression and my sin."},{"num":24,"verse":"Why do You hide Your face [as if offended] and alienate me as if I were Your enemy?"},{"num":25,"verse":"Will You harass and frighten a [poor, helpless] leaf driven to and fro, and will You pursue the chaff of the dry stubble?"},{"num":26,"verse":"For You write bitter things against me [in Your bill of indictment] and make me inherit and be accountable now for the iniquities of my youth."},{"num":27,"verse":"You put my feet also in the stocks and observe critically all my paths; You set a circle and limit around the soles of my feet [which I must not overstep]."},{"num":28,"verse":"And he wastes away as a rotten thing, like a garment that is moth-eaten."}]