[{"header":"Job Talks"},{"num":13,"verse":"“See, my eye has seen all this. My ear has heard and understood it. "},{"num":2,"verse":"What you know I also know. I am not less than you."},{"num":3,"verse":"“But I wish to speak to the All-powerful. I want to argue with God. "},{"num":4,"verse":"But you cover things with lies. You are doctors of no worth. "},{"num":5,"verse":"If only you would be quiet, and that would show your wisdom! "},{"num":6,"verse":"Hear what I think. Listen to the arguing of my lips. "},{"num":7,"verse":"Will you say what is not true for God? Will you lie for Him? "},{"num":8,"verse":"Will you show favor for Him? Will you argue for God? "},{"num":9,"verse":"Will it be well when He tests you? Or do you lie to Him as one lies to a man? "},{"num":10,"verse":"For sure He will speak strong words to you if you show favor in secret. "},{"num":11,"verse":"Will not His great power make you afraid? Will not the fear of Him come upon you? "},{"num":12,"verse":"Your wise sayings are sayings of ashes. Your strength is the strength of clay."},{"num":13,"verse":"“Be quiet so that I may speak. Then let come on me what will. "},{"num":14,"verse":"Why should I take my flesh in my teeth, and put my life in my hands? "},{"num":15,"verse":"Even though He would kill me, yet I will trust in Him. I will argue my ways to His face. "},{"num":16,"verse":"This will save me, for a sinful man may not come to Him. "},{"num":17,"verse":"Be careful to listen to my words. Let what I say fill your ears. "},{"num":18,"verse":"See, I am ready to tell everything, and all will know I am right. "},{"num":19,"verse":"Who will talk against me? For then I would be quiet and die."},{"num":20,"verse":"“Only two things I ask of You, and then I will not hide from Your face. "},{"num":21,"verse":"Take Your hand from me, and do not let the fear of You make me so afraid. "},{"num":22,"verse":"Then call, and I will answer. Or let me speak, and You answer me. "},{"num":23,"verse":"How many are my sins and wrong-doings? Help me to know my wrong-doing and sin. "},{"num":24,"verse":"Why do You hide Your face, and think of me as one who hates You? "},{"num":25,"verse":"Will You make a wind-blown leaf afraid? Will You go after the dry parts of a grain-field that have no worth? "},{"num":26,"verse":"For You write bitter things against me. You punish me for the sins I did when I was young. "},{"num":27,"verse":"You put chains on my feet, and watch everything I do. You let me walk only so far. "},{"num":28,"verse":"I am wasting away like a piece of dead wood, like clothing eaten by the moth."}]