[{"num":2,"verse":"¶ Therefore if there is any consolation in Christ, if any comfort of charity, if any fellowship of the Spirit, if any bowels and mercies,"},{"num":2,"verse":"fulfil ye my joy, that ye be likeminded, having the same charity, unanimous, minding the one thing."},{"num":3,"verse":"Let nothing be done through strife or vainglory, but in humility let each esteem others better than themselves,"},{"num":4,"verse":"with each one not looking to their own things, but also to the things of others."},{"num":5,"verse":"Let this mind be in you, which was also in Christ Jesus,"},{"num":6,"verse":"who, being in the form of God, thought it not robbery to be equal with God,"},{"num":7,"verse":"but emptied himself, taking the form of a slave, made in the likeness of men,"},{"num":8,"verse":"and being found in fashion as a man, he humbled himself and became obedient unto death, even the death of the cross. {Gr. stauros – stake}"},{"num":9,"verse":"Therefore, God also has highly exalted him and given him a name which is above every name,"},{"num":10,"verse":"that at the name of Jesus every knee should bow, of things in heaven and things in earth and things under the earth,"},{"num":11,"verse":"and that every tongue should confess that the Lord Jesus Christ is Lord in the glory of God the Father."},{"num":12,"verse":"¶ Therefore, my beloved, as ye have always hearkened, not as in my presence only, but now much more in my absence, work out your own saving health with fear and trembling."},{"num":13,"verse":"For it is God who works in you both to will and to do of his good pleasure."},{"num":14,"verse":"¶ Do all things without murmurings and doubts,"},{"num":15,"verse":"that ye may be blameless and innocent, children of God without rebuke in the midst of a crooked and perverse generation, among whom ye shine as lights in the world,"},{"num":16,"verse":"holding fast the word of life, that I may glory in the day of Christ that I have not run in vain, neither laboured in vain."},{"num":17,"verse":"And even if I am poured out as an offering upon the sacrifice and service of your faith, I joy and rejoice with you all."},{"num":18,"verse":"For the same cause ye also have joy and rejoice with me."},{"num":19,"verse":"But I trust in the Lord Jesus to send Timothy shortly unto you, that I also may be of good comfort when I know your state."},{"num":20,"verse":"For I have no one likeminded, who will naturally care for your state."},{"num":21,"verse":"For all seek their own, not the things which are Jesus Christ’s."},{"num":22,"verse":"But ye know the proof of him, that as a son with the father, he has served with me in the gospel."},{"num":23,"verse":"Therefore, I hope to send him presently, so soon as I shall see how it will go with me."},{"num":24,"verse":"But I trust in the Lord that I also myself shall come shortly."},{"num":25,"verse":"Yet I supposed it necessary to send to you Epaphroditus, my brother and companion in labour and fellowsoldier, but your messenger and he that ministered to my needs."},{"num":26,"verse":"For he longed after you all and was full of heaviness, because ye had heard that he had been sick"},{"num":27,"verse":"For indeed he was sick near unto death, but God had mercy on him and not on him only, but on me also, lest I should have sorrow upon sorrow."},{"num":28,"verse":"I sent him, therefore, the more carefully, that when ye see him again, ye may rejoice and that I may be the less sorrowful."},{"num":29,"verse":"Receive him therefore in the Lord with all gladness and esteem such"},{"num":30,"verse":"because for the work of the Christ he was near unto death, not regarding his life, to supply your lack of service toward me."}]