[{"header":"Jesus Cleanses a Leper; The Centurion’s Faith"},{"num":8,"verse":"When Jesus came down from the mountain, large crowds followed Him. "},{"num":2,"verse":"And a leper came up to Him and bowed down before Him, saying, “Lord, if You are willing, You are able to make me clean (well).” "},{"num":3,"verse":"Jesus reached out His hand and touched him, saying, “I am willing; be cleansed.” Immediately his leprosy was cleansed. "},{"num":4,"verse":"And Jesus said to him, “See that you tell no one [about this]; but go, show yourself to the priest [for inspection] and present the offering that Moses commanded, as a testimony (evidence) to them [of your healing].”"},{"num":5,"verse":"As Jesus went into Capernaum, a centurion came up to Him, begging Him [for help], "},{"num":6,"verse":"and saying, “Lord, my servant is lying at home paralyzed, with intense and terrible, tormenting pain.” "},{"num":7,"verse":"Jesus said to him, “I will come and heal him.” "},{"num":8,"verse":"But the centurion replied to Him, “Lord, I am not worthy to have You come under my roof, but only say the word, and my servant will be healed. "},{"num":9,"verse":"For I also am a man subject to authority [of a higher rank], with soldiers subject to me; and I say to one, ‘Go!’ and he goes, and to another, ‘Come!’ and he comes, and to my slave, ‘Do this!’ and he does it.” "},{"num":10,"verse":"When Jesus heard this, He was amazed and said to those who were following Him, “I tell you truthfully, I have not found such great faith [as this] with anyone in Israel. "},{"num":13,"verse":"Then Jesus said to the centurion, “Go; it will be done for you as you have believed.” And the servant was restored to health at that very hour."},{"header":"Peter’s Mother-in-law and Many Others Healed"},{"num":14,"verse":"When Jesus went into Peter’s house [in Capernaum], He saw Peter’s mother-in-law lying sick in bed with a fever. "},{"num":15,"verse":"He touched her hand and the fever left her; and she got up and served Him. "},{"num":16,"verse":"When evening came, they brought to Him many who were under the power of demons; and He cast out the evil spirits with a word, and restored to health all who were sick [exhibiting His authority as Messiah], "},{"num":17,"verse":"so that He fulfilled what was spoken by the prophet Isaiah: “He Himself took our infirmities [upon Himself] and carried away our diseases.”"},{"header":"Discipleship Tested"},{"num":18,"verse":"Now when Jesus saw a crowd around Him, He gave orders to cast off for the other side of the Sea of Galilee. "},{"num":19,"verse":"Then [on His way to board the boat] a scribe [who was a respected and authoritative interpreter of the Law] came and said to Him, “Master, I will accompany You [as Your student] wherever You go.” "},{"num":20,"verse":"Jesus replied to him, “Foxes have holes and the birds of the air have nests, but the Son of Man has nowhere to lay His head.” "},{"num":21,"verse":"Another of the disciples said to Him, “Lord, let me first go and bury my father (collect my inheritance).” "},{"num":22,"verse":"But Jesus said to him, “Follow Me [believing in Me as Master and Teacher], and allow the [spiritually] dead to bury their own dead.”"},{"num":23,"verse":"When He got into the boat, His disciples followed Him. "},{"num":24,"verse":"And suddenly a violent storm arose on the sea, so that the boat was being covered by the waves; but Jesus was sleeping. "},{"num":25,"verse":"And the disciples went and woke Him, saying, “Lord, save us, we are going to die!” "},{"num":26,"verse":"He said to them, “Why are you afraid, you men of little faith?” Then He got up and rebuked the winds and the sea, and there was [at once] a great and wonderful calm [a perfect peacefulness]. "},{"num":27,"verse":"The men wondered in amazement, saying, “What kind of man is this, that even the winds and the sea obey Him?”"},{"header":"Jesus Casts Out Demons"},{"num":28,"verse":"When He arrived at the other side in the country of the Gadarenes, two demon-possessed men coming out of the tombs met Him. They were so extremely fierce and violent that no one could pass by that way. "},{"num":29,"verse":"And they screamed out, “What business do we have [in common] with each other, Son of God? Have You come to torment us before the appointed time [of judgment]?” "},{"num":30,"verse":"Some distance from them a large herd of pigs was grazing. "},{"num":31,"verse":"The demons began begging Him, “If You drive us out, send us into the herd of pigs.” "},{"num":32,"verse":"And He said to them, “Go!” So they came out [of the men] and went into the pigs, and the whole herd rushed down the steep bank into the sea and died in the water. "},{"num":33,"verse":"The herdsmen ran away, and went to the city and reported everything, including what had happened to the men under the power of demons. "},{"num":34,"verse":"And the whole city came out to meet Jesus; and as soon as they saw Him, they begged Him to leave their region."}]