[{"num":8,"verse":"And when he had come down from the mountain, great crowds followed him."},{"num":2,"verse":"And behold, a leper came up to [him] and did him homage, saying, Lord, if thou wilt, thou art able to cleanse me."},{"num":3,"verse":"And he stretched out his hand and touched him, saying, I will; be cleansed. And immediately his leprosy was cleansed."},{"num":4,"verse":"And Jesus says to him, See thou tell no man, but go, shew thyself to the priest, and offer the gift which Moses ordained, for a testimony to them."},{"num":5,"verse":"And when he had entered into Capernaum, a centurion came to him, beseeching him,"},{"num":6,"verse":"and saying, Lord, my servant lies paralytic in the house, suffering grievously."},{"num":7,"verse":"And Jesus says to him, *I* will come and heal him."},{"num":8,"verse":"And the centurion answered and said, Lord, I am not fit that thou shouldest enter under my roof; but only speak a word, and my servant shall be healed."},{"num":9,"verse":"For *I* also am a man under authority, having under me soldiers, and I say to this [one], Go, and he goes; and to another, Come, and he comes; and to my bondman, Do this, and he does it."},{"num":10,"verse":"And when Jesus heard it, he wondered, and said to those who followed, Verily I say unto you, Not even in Israel have I found so great faith."},{"num":11,"verse":"But I say unto you, that many shall come from [the] rising and setting [sun], and shall lie down at table with Abraham, and Isaac, and Jacob in the kingdom of the heavens;"},{"num":12,"verse":"but the sons of the kingdom shall be cast out into the outer darkness: there shall be the weeping and the gnashing of teeth."},{"num":13,"verse":"And Jesus said to the centurion, Go, and as thou hast believed, be it to thee. And his servant was healed in that hour."},{"num":14,"verse":"And when Jesus had come to Peter's house, he saw his mother-in-law laid down and in a fever;"},{"num":15,"verse":"and he touched her hand, and the fever left her, and she arose and served him."},{"num":16,"verse":"And when the evening was come, they brought to him many possessed by demons, and he cast out the spirits with a word, and healed all that were ill;"},{"num":17,"verse":"so that that should be fulfilled which was spoken through Esaias the prophet, saying, Himself took our infirmities and bore our diseases."},{"num":18,"verse":"And Jesus, seeing great crowds around him, commanded to depart to the other side."},{"num":19,"verse":"And a scribe came up and said to him, Teacher, I will follow thee whithersoever thou mayest go."},{"num":20,"verse":"And Jesus says to him, The foxes have holes, and the birds of the heaven roosting-places; but the Son of man has not where he may lay his head."},{"num":21,"verse":"But another of his disciples said to him, Lord, suffer me first to go away and bury my father."},{"num":22,"verse":"But Jesus said to him, Follow me, and leave the dead to bury their own dead."},{"num":23,"verse":"And he went on board ship and his disciples followed him;"},{"num":24,"verse":"and behold, [the water] became very agitated on the sea, so that the ship was covered by the waves; but *he* slept."},{"num":25,"verse":"And the disciples came and awoke him, saying, Lord save: we perish."},{"num":26,"verse":"And he says to them, Why are ye fearful, O ye of little faith? Then, having arisen, he rebuked the winds and the sea, and there was a great calm."},{"num":27,"verse":"But the men were astonished, saying, What sort [of man] is this, that even the winds and the sea obey him?"},{"num":28,"verse":"And there met him, when he came to the other side, to the country of the Gergesenes, two possessed by demons, coming out of the tombs, exceeding dangerous, so that no one was able to pass by that way."},{"num":29,"verse":"And behold, they cried out, saying, What have we to do with thee, Son of God? hast thou come here before the time to torment us?"},{"num":30,"verse":"Now there was, a great way off from them, a herd of many swine feeding;"},{"num":31,"verse":"and the demons besought him, saying, If thou cast us out, send us away into the herd of swine."},{"num":32,"verse":"And he said to them, Go. And they, going out, departed into the herd of swine; and lo, the whole herd [of swine] rushed down the steep slope into the sea, and died in the waters."},{"num":33,"verse":"But they that fed them fled, and went away into the city and related everything, and what had happened as to those possessed by demons."},{"num":34,"verse":"And behold, the whole city went out to meet Jesus; and when they saw him, they begged [him] to go away out of their coasts."}]