[{"header":"The Cleansing of a Leper(A)"},{"num":8,"verse":"When He came down from the mountains, large crowds followed Him. "},{"num":2,"verse":"And then a leper came and worshipped Him, saying, “Lord, if You are willing, You can make me clean.”"},{"num":3,"verse":"Jesus reached out His hand and touched him, saying, “I will. Be clean.” And immediately his leprosy was cleansed. "},{"num":4,"verse":"Then Jesus said to him, “See that you tell no one. But go your way, show yourself to the priest, and offer the gift that Moses commanded as a testimony to them.”"},{"header":"The Healing of a Centurion’s Servant(B)"},{"num":5,"verse":"And when Jesus entered Capernaum, a centurion came to Him, entreating Him, "},{"num":6,"verse":"and saying, “Lord, my servant is lying at home, sick with paralysis, terribly tormented.”"},{"num":7,"verse":"Jesus said to him, “I will come and heal him.”"},{"num":8,"verse":"The centurion answered and said, “Lord, I am not worthy that You should come under my roof. But speak the word only, and my servant will be healed. "},{"num":9,"verse":"For I am a man under authority, having soldiers under me. And I say to this man, ‘Go,’ and he goes, and to another, ‘Come,’ and he comes, and to my servant, ‘Do this,’ and he does it.”"},{"num":10,"verse":"When Jesus heard it, He was amazed and said to those who followed, “Truly I say to you, I have not found such great faith, no, not in Israel. "},{"num":11,"verse":"And I say to you that many will come from the east and west and will dine with Abraham, Isaac, and Jacob in the kingdom of heaven. "},{"num":12,"verse":"But the sons of the kingdom will be thrown out into outer darkness. There will be weeping and gnashing of teeth.”"},{"num":13,"verse":"Then Jesus said to the centurion, “Go your way. And as you have believed, so let it be done for you.” And his servant was healed that very moment."},{"header":"The Healing of Many People(C)"},{"num":14,"verse":"When Jesus entered Peter’s house, He saw his wife’s mother, lying sick with a fever. "},{"num":15,"verse":"He touched her hand, and the fever left her. And she rose and served them."},{"num":16,"verse":"When the evening came, they brought to Him many who were possessed with demons. And He cast out the spirits with His word, and healed all who were sick, "},{"num":17,"verse":"to fulfill what was spoken by Isaiah the prophet,"},{"header":"The Would-Be Followers of Jesus(D)"},{"num":18,"verse":"Now when Jesus saw large crowds around Him, He gave a command to depart to the other side. "},{"num":19,"verse":"Then a certain scribe came and said to Him, “Teacher, I will follow You wherever You go.”"},{"num":20,"verse":"Jesus replied, “The foxes have holes and the birds of the air have nests, but the Son of Man has no place to lay His head.”"},{"num":21,"verse":"Another of His other disciples said to Him, “Lord, let me first go and bury my father.”"},{"num":22,"verse":"But Jesus said to him, “Follow Me, and let the dead bury their dead.”"},{"header":"The Calming of a Storm(E)"},{"num":23,"verse":"Then He entered the boat, and His disciples followed Him. "},{"num":24,"verse":"Suddenly a great storm arose on the sea, so that the boat was covered with the waves. But He was asleep. "},{"num":25,"verse":"His disciples went to Him and awoke Him, saying, “Lord, save us! We are perishing!”"},{"num":26,"verse":"He replied, “Why are you fearful, O you of little faith?” Then He rose and rebuked the winds and the sea. And there was a great calm."},{"num":27,"verse":"The men were amazed, saying, “What kind of Man is this that even the winds and the sea obey Him!”"},{"header":"The Healing of the Gergesene Demoniacs(F)"},{"num":28,"verse":"When He came to the other side into the country of the Gergesenes, there met Him two men possessed with demons, coming out of the tombs, extremely fierce, so that no one might pass by that way. "},{"num":29,"verse":"Suddenly they cried out, saying, “What have we to do with You, Jesus, Son of God? Have You come here to torment us before the time?”"},{"num":30,"verse":"Now a good way off from them was a herd of many swine feeding. "},{"num":31,"verse":"So the demons begged Him, saying, “If You cast us out, permit us to go away into the herd of swine.”"},{"num":32,"verse":"He said to them, “Go!” And when they came out, they went into the herd of swine. And suddenly the whole herd of swine ran violently down a steep place into the sea, and perished in the waters. "},{"num":33,"verse":"Those who kept them fled, and went their ways into the city, and told everything, including what had happened to those possessed by the demons. "},{"num":34,"verse":"The whole city came out to meet Jesus. And when they saw Him, they begged Him to depart out of their region."}]