[{"num":8,"verse":"When Jesus came down from the hill, many people followed him."},{"num":2,"verse":"A man who had leprosy [a bad skin disease] came and kneeled in front of Jesus and worshipped him. He said to Jesus, `Sir, I know you can heal me if you want to.'"},{"num":3,"verse":"Jesus put out his hand and touched him. He said, `I want to. Be healed.' Right away his leprosy was healed."},{"num":4,"verse":"Jesus said to him, `Do not tell anyone about this. But go and let the priest look at you. Moses gave a law about the sacrifice you must give when you are healed. Give it, to prove to people you are healed.'"},{"num":5,"verse":"When Jesus came to the town of Capernaum, a Roman army officer came to ask him for help."},{"num":6,"verse":"He said, `Sir, one of my servants is in bed at my house. He cannot move and has much pain.'"},{"num":7,"verse":"Jesus said, `I will come and heal him.'"},{"num":8,"verse":"The officer said, `Sir, I am not good enough to have you come into my house. Just say the word and my servant will be healed."},{"num":9,"verse":"I myself am a man who takes orders, and I have soldiers who take orders from me. I say to one, \"Go,\" and he goes. I say to another one, \"Come,\" and he comes. I say to my servant, \"Do this,\" and he does it.'"},{"num":10,"verse":"Jesus was surprised when he heard this. He said to the people who followed him, `I tell you the truth. I have not found any Jew who believes as this man does."},{"num":11,"verse":"I tell you, many people will come from the east and from the west. They will sit down with Abraham, Isaac, and Jacob in the kingdom of heaven."},{"num":12,"verse":"But those who were born in the kingdom will be put into the darkness outside. There they will cry and make noises with their teeth.'"},{"num":13,"verse":"Jesus said to the officer, `Go home. What you have believed, will be done.' At that very same time the officer's servant was healed."},{"num":14,"verse":"Jesus went into Peter's house. There he saw the mother of Peter's wife in bed, sick with fever."},{"num":15,"verse":"Jesus took hold of her hand and the fever left her. She got up and began to do things for Jesus."},{"num":16,"verse":"That evening, many people who had bad spirits were brought to Jesus. He spoke to the bad spirits and drove them out. And he healed all the people who were sick."},{"num":17,"verse":"What the prophet Isaiah said came true. He said, `He took away the things that made us weak. He took away the things that made us sick.'"},{"num":18,"verse":"Jesus saw many people around him. So he said, `Let us cross over to the other side of the sea.'"},{"num":19,"verse":"A scribe came and said to him, `Teacher, I will go anywhere you go.'"},{"num":20,"verse":"Jesus said, `Foxes have holes to live in. Birds have nests. But the Son of Man has no place to lie down to rest.'"},{"num":21,"verse":"Another man who was a follower of Jesus, said to Jesus, `Lord, let me go first and bury my father.'"},{"num":22,"verse":"But Jesus said to him, `Come with me. Let those who are dead bury their own dead people.'"},{"num":23,"verse":"Jesus got in the boat and his disciples got in with him."},{"num":24,"verse":"A bad storm came on the sea. The waves were high. Water came into the boat. But Jesus was sleeping."},{"num":25,"verse":"The disciples came to Jesus and woke him. `Lord, save us!' they shouted. `We will die!'"},{"num":26,"verse":"Jesus said to them, `Why do you fear? You do not believe in God very much!' Then Jesus got up. He said to the winds and the sea, `Stop!' Then all was quiet."},{"num":27,"verse":"The disciples were surprised. They said `What kind of man is this? Even the winds and the sea obey him.'"},{"num":28,"verse":"Jesus came to the other side of the sea, to the country of the Gadarene people. There were graves in that place. Two men came from among the graves to meet him. They had bad spirits in them. They were so bad and strong that people feared to pass that way."},{"num":29,"verse":"They shouted, `Jesus, Son of God, what do you want to do to us? Have you come here to punish us before it is our time?'"},{"num":30,"verse":"Many pigs were eating in a place far from them."},{"num":31,"verse":"The bad spirits begged Jesus, `If you drive us out of these men, let us go into the pigs.'"},{"num":32,"verse":"Jesus said, `Go!' The spirits came out of the men and went into the pigs. All the pigs ran fast down the steep hill into the sea. They died in the water."},{"num":33,"verse":"The men who cared for the pigs ran to the town. They told everything and what had happened to the men who had the bad spirits."},{"num":34,"verse":"All the people in the town came out to meet Jesus. When they saw him, they begged him to go away out of their country"}]