[[],[{"type":"header","content":"Idolatrous Worship Denounced"},{"type":"prose","content":"And the word of the  came to me, saying, "}],[{"type":"prose","content":"“Son of man, set your face against the mountains of Israel and prophesy against them, "}],[{"type":"prose","content":"and say, ‘You mountains of Israel, hear the word of the Lord ! Thus says the Lord  to the mountains and the hills, to the ravines and the valleys: “Behold, I Myself am going to bring a sword on you, and I will destroy your high places [of idolatrous worship], "}],[{"type":"prose","content":"and your altars will become deserted and your pillars for sun-worship will be smashed in pieces; and I will throw down your slain in front of your idols [that cannot bring them back to life]. "}],[{"type":"prose","content":"I will also lay the dead bodies of the children of Israel in front of their [Canaanite] idols; and I will scatter your bones all around your altars. "}],[{"type":"prose","content":"Everywhere you live, the cities will become waste and the high places will become deserted, so that your altars may bear their guilt  become deserted, your idols may be broken and destroyed, your incense altars [for sun-worship] may be cut down, and your works may be blotted out. "}],[{"type":"prose","content":"The slain will fall among you, then you shall know [without any doubt] that I am the ."}],[{"type":"prose","content":"“Yet I will leave some of you alive [a remnant], for you will have some who escaped the sword among the nations when you are scattered throughout the countries. "}],[{"type":"prose","content":"Then those of you who escape will remember Me among the nations to which they will be exiled, how I have been broken by their lewdness  their adulterous hearts which have turned away from Me, and by their eyes which lust after their idols; and they will loathe themselves for the evils which they have committed, for all their repulsive acts. "}],[{"type":"prose","content":"Then they will know [without any doubt] that I am the ; I have not said in vain that I would bring this disaster [as punishment] on them.”’"}],[{"type":"prose","content":"“Thus says the Lord , ‘Strike with your fist, stamp with your foot and say, “Alas, because of all the evil atrocities of the house of Israel, which will fall by sword, by famine, and by virulent disease! "}],[{"type":"prose","content":"He who is far away will die of the virulent disease, and he who is near will fall by the sword, and he who remains and is besieged will die by the famine. Thus I will spend My wrath on them. "}],[{"type":"prose","content":"Then you will know [without any doubt] that I am the , when their slain are among their idols around their altars, on every high hill, on all the tops of the mountains, under every leafy tree and under every oak with thick branches, the places where they offered sweet incense  a soothing aroma to all their idols. "}],[{"type":"prose","content":"And I will stretch out My hand against them and make the land a more desolate waste than the wilderness toward Diblah [the Moabite city], throughout all the places where they live; and they will know [without any doubt] that I am the .”’”Cross references\n\n"}]]