[{"header":"Chapter 6"},{"num":1,"verse":"Against the Mountains of Israel. This word of the Lord came to me:"},{"num":2,"verse":"Son of man, turn your face toward the mountains of Israel and prophesy against them."},{"num":3,"verse":"Say: Mountains of Israel, hear the word of the Lord God. Thus says the Lord God to the mountains and the hills, to the ravines and the valleys: Behold, I am going to bring a sword against you, and I will destroy your high places."},{"num":4,"verse":"Your altars will be demolished and your incense stands will be shattered, and I will throw down your slain in front of your idols."},{"num":5,"verse":"I will lay the corpses of the people of Israel in front of their idols, and I will scatter their bones all around your altars."},{"num":6,"verse":"Wherever you live, your towns will be destroyed and your high places will be laid waste, your idols will be shattered and destroyed, your incense stands will be smashed, and all of the idols you have made will be obliterated."},{"num":7,"verse":"As the slain will fall in your midst, you will know that I am the Lord."},{"num":8,"verse":"However, among the nations I will spare some of you who will manage to escape the sword and be scattered throughout foreign lands."},{"num":9,"verse":"Those of you who escape will remember me among the nations where you were carried away as captives—how I crushed their adulterous hearts for having deserted me and by their wanton eyes for lusting after idols. Then they will loathe themselves for all the evils that they have done with their abominable practices."},{"num":10,"verse":"And they will know that I, the Lord, was not uttering a vain warning when I threatened to inflict this disaster upon them."},{"num":11,"verse":"Thus says the Lord God: Clap your hands, stamp your feet, and cry, “Alas!” because of all the loathsome abominations of the house of Israel, for which the people will fall by the sword, famine, and pestilence."},{"num":12,"verse":"Those who are far off will die of pestilence; those who are near will fall by the sword; any who survive and are spared will die of famine. Thus, I will exhaust my wrath upon them."},{"num":13,"verse":"Then you will know that I am the Lord, when their slain lie among the idols around their altars, on every high hill, on every mountaintop, under every green tree, and under every leafy oak, wherever they offered sweet-smelling sacrifices to any of their idols."},{"num":14,"verse":"I will stretch out my hand against them and reduce every place where they have settled to a desolate waste, from the desert to Riblah. Then they will know that I am the Lord."}]