[[],[{"type":"header","content":"Judgment against Israel’s Mountains"},{"type":"prose","content":"Again a message came to me from the LORD:"}],[{"type":"prose","content":"“Son of man, turn and face the mountains of Israel and prophesy against them."}],[{"type":"prose","content":"Proclaim this message from the Sovereign LORD against the mountains of Israel. This is what the Sovereign LORD says to the mountains and hills and to the ravines and valleys: I am about to bring war upon you, and I will smash your pagan shrines."}],[{"type":"prose","content":"All your altars will be demolished, and your places of worship will be destroyed. I will kill your people in front of your idols."}],[{"type":"prose","content":"I will lay your corpses in front of your idols and scatter your bones around your altars."}],[{"type":"prose","content":"Wherever you live there will be desolation, and I will destroy your pagan shrines. Your altars will be demolished, your idols will be smashed, your places of worship will be torn down, and all the religious objects you have made will be destroyed."}],[{"type":"prose","content":"The place will be littered with corpses, and you will know that I alone am the LORD."}],[{"type":"prose","content":"“But I will let a few of my people escape destruction, and they will be scattered among the nations of the world."}],[{"type":"prose","content":"Then when they are exiled among the nations, they will remember me. They will recognize how hurt I am by their unfaithful hearts and lustful eyes that long for their idols. Then at last they will hate themselves for all their detestable sins."}],[{"type":"prose","content":"They will know that I alone am the LORD and that I was serious when I said I would bring this calamity on them."}],[{"type":"prose","content":"“This is what the Sovereign LORD says: Clap your hands in horror, and stamp your feet. Cry out because of all the detestable sins the people of Israel have committed. Now they are going to die from war and famine and disease."}],[{"type":"prose","content":"Disease will strike down those who are far away in exile. War will destroy those who are nearby. And anyone who survives will be killed by famine. So at last I will spend my fury on them."}],[{"type":"prose","content":"They will know that I am the LORD when their dead lie scattered among their idols and altars on every hill and mountain and under every green tree and every great shade tree—the places where they offered sacrifices to their idols."}],[{"type":"prose","content":"I will crush them and make their cities desolate from the wilderness in the south to Riblah in the north. Then they will know that I am the LORD.”"}]]