[{"header":"The Four Chariots"},{"num":6,"verse":"Now again I looked up, and four chariots were coming out from between two mountains; and the mountains were mountains of [firm, immovable] bronze (divine judgment). "},{"num":2,"verse":"The first chariot had red horses (war, bloodshed), the second chariot had black horses (famine, death), "},{"num":3,"verse":"the third chariot had white horses (victory), and the fourth chariot had strong dappled horses (death through judgment). "},{"num":4,"verse":"Then I said to the angel who was speaking with me, “What are these, my lord?” "},{"num":5,"verse":"The angel answered me, “These are the four spirits of the heavens, which go out after presenting themselves before the Lord of all the earth, "},{"num":6,"verse":"with the chariot with the black horses going toward the north country; then the one with the white horses follows after them [because there are two northern powers to overcome], and the chariot with the dappled horses goes toward the south country.” "},{"num":7,"verse":"When the strong horses went out, they were eager to patrol the earth. And the Lord said, “Go, patrol the earth.” So they patrolled the earth [watching and protecting it]. "},{"num":8,"verse":"Then He called out to me and said to me, “See, those who are going to the north country have quieted My Spirit [of wrath] in the north country.”"},{"num":9,"verse":"The word of the Lord also came to me, saying, "},{"num":10,"verse":"“Take an offering from the exiles, from Heldai, from Tobijah, and from Jedaiah [as representatives]; and you go the same day and enter the house of Josiah the son of Zephaniah, where they have arrived from Babylon."},{"header":"The Symbolic Crowns"},{"num":11,"verse":"Take silver and gold [from them], and make an ornate crown and set it on the head of Joshua the son of Jehozadak, the high priest. "},{"num":12,"verse":"Then say to Joshua, ‘Thus says the Lord of hosts, “Behold (look, keep in sight, watch), a Man (Messiah) whose name is Branch, for He shall branch out from His place (Israel, the Davidic line); and He shall build the [ultimate] temple of the Lord. "},{"num":13,"verse":"Yes, [you are to build a temple of the Lord, but] it is He who shall build the [ultimate] temple of the Lord, and He shall bear the honor and majesty [as the only begotten of the Father] and sit and rule on His throne. And He shall be a Priest on His throne, and the counsel of peace shall be between the two offices [Priest and King].”’ "},{"num":14,"verse":"Now the crown shall become a reminder in the temple of the Lord to Helem, Tobijah, Jedaiah, and Hen the son of Zephaniah. "},{"num":15,"verse":"And those who are far away will come and [help] build the temple of the Lord.” Then you shall know [without any doubt] that the Lord of hosts sent me (Zechariah) to you. And it will come about if you will diligently obey the [voice of the] Lord your God."}]