[{"num":6,"verse":"And again I lifted up my eyes and saw, and behold, four chariots came out from between two mountains; and the mountains were mountains of firm, immovable bronze."},{"num":2,"verse":"The first chariot had red or bay horses, the second chariot had black horses,"},{"num":3,"verse":"The third chariot had white horses, and the fourth chariot had dappled, active, and strong horses."},{"num":4,"verse":"Then I said to the angel who talked with me, What are these, my lord?"},{"num":5,"verse":"And the angel answered me, These are the four winds or spirits of the heavens, which go forth from presenting themselves before the Lord of all the earth."},{"num":6,"verse":"The chariot with the black horses is going forth into the north country, and the white ones are going forth after them [because there are two northern powers to overcome], and the dappled ones are going forth toward the south country."},{"num":7,"verse":"And [the chariots with] the strong [horses] went forth and sought to go that they might patrol the earth. And [the Lord] said to them, Go, walk to and fro through the earth and patrol it. So they walked about through the earth [watching and protecting it]."},{"num":8,"verse":"Then He summoned me and said to me, Behold, these that go toward the north country have quieted My Spirit [of wrath] and have caused it to rest in the north country."},{"num":9,"verse":"And the word of the Lord came to me, saying,"},{"num":10,"verse":"Accept donations and offerings from these [as representatives of the] exiles, from Heldai, from Tobijah, and from Jedaiah, who have come from Babylon; and come the same day and go to the house of Josiah the son of Zephaniah."},{"num":11,"verse":"Yes, take from them silver and gold, and make crowns and set [one] upon the head of Joshua the son of Jehozadak, the high priest,"},{"num":12,"verse":"And say to him, Thus says the Lord of hosts: [You, Joshua] behold (look at, keep in sight, watch) the Man [the Messiah] whose name is the Branch, for He shall grow up in His place and He shall build the [true] temple of the Lord."},{"num":13,"verse":"Yes, [you are building a temple of the Lord, but] it is He Who shall build the [true] temple of the Lord, and He shall bear the honor and glory [as of the only begotten of the Father] and shall sit and rule upon His throne. And He shall be a Priest upon His throne, and the counsel of peace shall be between the two [offices—Priest and King]."},{"num":14,"verse":"And the [other] crown shall be [credited] to Helem (Heldai), to Tobijah, and to Jedaiah, and to the kindness and favor of Josiah the son of Zephaniah, and shall be in the temple of the Lord for a reminder and memorial."},{"num":15,"verse":"And those who are far off shall come and help build the temple of the Lord, and you shall know (recognize and understand) that the Lord sent me [Zechariah] to you. And [your part in this] shall come to pass if you will diligently obey the voice of the Lord your God."}]