[{"header":"Jehu Kills Ahab’s Family"},{"num":10,"verse":"Ahab had seventy sons in Samaria, so Jehu wrote letters and sent them to Samaria, that is, to the officials of Samaria, the elders, and to the guardians appointed by Ahab, saying, "},{"num":2,"verse":"“Now, when this letter comes to you, since you have your master’s sons with you and you have chariots, horses, a fortified city, and weapons, "},{"num":3,"verse":"choose the best and most upright of your master’s sons and seat him on his father’s throne and fight for your master’s house.”"},{"num":4,"verse":"They were terrified and said, “Look, two kings could not stand before him, so how can we?”"},{"num":5,"verse":"Then the palace administrator, the ruler of the city, the elders, and the guardians sent word to Jehu, saying, “We are your servants. We will do everything you tell us. We will not make any man king. Do whatever is good in your eyes.”"},{"num":6,"verse":"Then Jehu wrote a second letter to them, saying, “If you are on my side and will obey me, then take the heads of your master’s sons and come to me at this time tomorrow in Jezre’el.”"},{"num":7,"verse":"When the letter came, they took the king’s sons and slaughtered all seventy of them. Then they put their heads in baskets and sent them to Jehu in Jezre’el. "},{"num":8,"verse":"When the messenger arrived, he said, “They have brought the heads of the king’s sons.” Jehu said, “Put them in two piles at the entrance to the gate until morning.”"},{"num":9,"verse":"When morning came, he went out and stood and said to all the people, “You are innocent. Indeed I conspired against my master and killed him. But who killed all these? "},{"num":10,"verse":"Know, therefore, that nothing of the word of the Lord, which the Lord spoke against the house of Ahab, will fail. For the Lord did what he said through his servant Elijah.”"},{"num":11,"verse":"Then Jehu killed everyone who remained from the house of Ahab in Jezre’el and all his important people, his close friends, and his priests, so that no survivor was left to him."},{"num":12,"verse":"Then he set out toward Samaria. While he was on the way, at Beth Eked of the Shepherds, "},{"num":13,"verse":"Jehu met some relatives of Ahaziah king of Judah. He said, “Who are you?” They said, “We are Ahaziah’s relatives. We have come down to greet the king’s sons and the queen mother’s sons.”"},{"num":14,"verse":"Then he said, “Take them alive!” So they took them. Then they slaughtered them at the cistern of Beth Eked—forty-two men, and he did not let one survive."},{"num":15,"verse":"Then he set out from there and met Jehonadab son of Recab, who was coming to meet him. Jehu greeted him and said, “Is your heart as true to my heart as my heart is to yours?”"},{"num":16,"verse":"Then Jehu said, “Come with me and see my zeal for the Lord.” So he had him ride with him in his chariot. "},{"num":17,"verse":"When he came to Samaria, he struck down everyone who was left to Ahab there. He wiped out Ahab completely, according to the word which the Lord had spoken to Elijah."},{"header":"Jehu Slaughters the Prophets of Baal"},{"num":18,"verse":"Then Jehu assembled all the people and said to them, “Ahab served Baal a little. Jehu will serve him a great deal. "},{"num":19,"verse":"But now, gather all the prophets of Baal, all his servants, and all his priests! Let no one be missing because I am going to make a great sacrifice to Baal. No one who misses it will live.”"},{"num":20,"verse":"Then Jehu said, “Consecrate a festival for Baal,” and they proclaimed it."},{"num":21,"verse":"Then Jehu sent word through all Israel, and all the servants of Baal came. Not a man was left who did not come. They came into the temple of Baal so that the temple of Baal was filled from end to end. "},{"num":22,"verse":"Then he said to the person in charge of the wardrobe, “Bring out garments for all the servants of Baal.” So he brought out robes for them."},{"num":23,"verse":"Then Jehu and Jehonadab son of Recab went into the temple of Baal. Jehu said to the servants of Baal, “Make a careful search, and see to it that there are no servants of the Lord with you, but only servants of Baal.”"},{"num":24,"verse":"Then they went in to make sacrifices and whole burnt offerings. But Jehu had stationed eighty men outside and said, “If any man escapes from these men whom I am putting into your hands, it will be your life for his life.”"},{"num":25,"verse":"When he was finished offering the whole burnt offering, Jehu said to the guards and to the officers, “Go strike them down! Don’t let anyone out!” So they struck them down with their swords, and the guards and the officers threw the bodies out. They then went into the inner sanctuary of the temple of Baal. "},{"num":26,"verse":"They brought the sacred memorial stones out from the temple of Baal and burned them. "},{"num":27,"verse":"They tore down the memorial stone for Baal and tore down the temple of Baal. They have used it for a latrine to this day. "},{"num":28,"verse":"In this way Jehu exterminated Baal worship from Israel."},{"header":"Jehu Falters in His Faithfulness"},{"num":29,"verse":"But when it came to the sins which Jeroboam son of Nebat caused Israel to commit, Jehu did not turn aside from following the golden calves which were in Bethel and in Dan. "},{"num":30,"verse":"But the Lord said to Jehu, “Because you have done well by doing what is right in my eyes—you have done everything that was in my heart to the house of Ahab—four generations of your sons will sit on the throne of Israel.”"},{"num":31,"verse":"But Jehu was not careful to walk in the law of the Lord, the God of Israel, with all his heart. He did not turn from the sins which Jeroboam caused Israel to commit."},{"num":32,"verse":"In those days, the Lord began to break off pieces from Israel. Then Hazael attacked all the territory of Israel "},{"num":33,"verse":"east of the Jordan, all the land of Gilead, Gad, Reuben, and Manasseh, from Aroer, which is above the canyon of the Arnon, up to Gilead and Bashan."},{"num":34,"verse":"As for the rest of Jehu’s acts and everything he did and all his mighty deeds, are they not written in the annals of the kings of Israel? "},{"num":35,"verse":"Jehu rested with his fathers, and they buried him in Samaria. Then his son Jehoahaz became king in his place. "},{"num":36,"verse":"The time that Jehu ruled as king over Israel in Samaria was twenty-eight years."}]