[{"header":"Jehu Wipes Out Ahab’s Royal House"},{"num":10,"verse":"Ahab’s royal family in the city of Samaria had a total of 70 sons. Jehu wrote some letters to the officials of the city. He also sent them to the elders there. And he sent them to the people who took care of Ahab’s children. Jehu said, "},{"num":2,"verse":"“Your master’s sons are with you. You also have chariots and horses and weapons. And you are living in a city that has high walls around it. As soon as you read this letter, here’s what I want you to do. "},{"num":3,"verse":"Choose the best and most respected son of your master. Place him on his father Joram’s throne. Then fight for your master’s royal house.”"},{"num":4,"verse":"The leaders of Samaria were terrified. They said, “King Joram and King Ahaziah couldn’t stand up against Jehu. So how can we?”"},{"num":5,"verse":"The city governor and the person in charge of the palace sent a message to Jehu. The message was also from the elders and the people who took care of Ahab’s children. In the message, they said, “We will serve you. We’ll do anything you say. We won’t appoint anyone to be king. Do what you think is best.”"},{"num":6,"verse":"Then Jehu wrote them a second letter. He said, “You say you are on my side. You say you will obey me. If you really mean it, bring me the heads of your master’s sons. Meet me in Jezreel by this time tomorrow.”"},{"num":7,"verse":"When Jehu’s letter arrived, the men went and got the princes. They killed all 70 of them. They put their heads in baskets. Then they sent them to Jehu in Jezreel. "},{"num":8,"verse":"When the messenger arrived, he spoke to Jehu. He told him, “The heads of the princes have been brought here.”"},{"num":9,"verse":"The next morning Jehu went out. He stood in front of all the people. He said, “You aren’t guilty of doing anything wrong. I’m the one who made plans against my master Joram. I killed him. But who killed all these? "},{"num":10,"verse":"I want you to know that the Lord has spoken against Ahab’s royal house. Not a word of what he has said will fail. The Lord has done exactly what he announced through his servant Elijah.” "},{"num":11,"verse":"So Jehu killed everyone from Ahab’s family who was in Jezreel. He also killed all Ahab’s chief men. And he killed Ahab’s close friends and his priests. He didn’t leave anyone alive in Ahab’s family."},{"num":12,"verse":"Then Jehu started out for Samaria. At Beth Eked of the Shepherds, "},{"num":13,"verse":"he saw some people. They were relatives of Ahaziah, the king of Judah. Jehu asked them, “Who are you?”"},{"num":14,"verse":"“Take them alive!” Jehu ordered. So his men took them alive. Then they killed them by the well of Beth Eked. They killed a total of 42 of them. Jehu didn’t leave anyone alive."},{"num":15,"verse":"Jehu left there. On the way he met Jehonadab. He was the son of Rekab. Jehonadab was on his way to see Jehu. Jehu greeted him. He asked, “Are you my friend? You know I’m your friend.”"},{"num":16,"verse":"Jehu said, “Come along with me. See how committed I am to serve the Lord.” Jehu had Jehonadab ride along in his chariot."},{"num":17,"verse":"Jehu came to Samaria. He killed everyone there who was left from Ahab’s family. And so he completely destroyed Ahab’s royal house. That’s what the Lord had said would happen. He had spoken that message to Elijah."},{"header":"Jehu Kills the People Who Serve Baal"},{"num":18,"verse":"Then Jehu brought together all the people. He said to them, “Ahab served the god named Baal a little. I will serve him a lot. "},{"num":19,"verse":"Send for all of Baal’s prophets. Also send for all his priests and the others who serve him. Make sure that not a single one is missing. I’m going to hold a great sacrifice to honor Baal. Anyone who doesn’t come will be killed.” But Jehu was lying to them. He was planning to destroy everyone who served Baal."},{"num":20,"verse":"Jehu said, “Call everyone together to honor Baal.” So they did. "},{"num":21,"verse":"Then he sent a message all through Israel. All those who served Baal came. Not a single one of them stayed away. They crowded into Baal’s temple. It was full from one end to the other. "},{"num":22,"verse":"Jehu spoke to the one who took care of the sacred robes. He told him, “Bring robes for everyone who serves Baal.” So he brought the robes out for them."},{"num":23,"verse":"Then Jehu went into Baal’s temple. Jehonadab, the son of Rekab, went with him. Jehu said to those who served Baal, “Look around. Make sure that no one who serves the Lord is here with you. Make sure only those who serve Baal are here.” "},{"num":24,"verse":"So they went in to offer sacrifices and burnt offerings. Jehu had stationed 80 men outside. He warned them, “I’m placing some men in your hands. Don’t let a single one of them escape. If you do, you will pay for his life with yours.”"},{"num":25,"verse":"Jehu finished sacrificing the burnt offering. As soon as he did, he gave an order to the guards and officers. He commanded them, “Go inside and kill everyone. Don’t let a single one of them escape.” So they cut them down with their swords. The guards and officers threw the bodies outside. Then they entered the most sacred area inside Baal’s temple. "},{"num":26,"verse":"They brought the sacred stone of Baal outside. They burned it up. "},{"num":27,"verse":"So they destroyed Baal’s sacred stone. They also tore down Baal’s temple. People have used it as a public toilet to this day."},{"num":28,"verse":"So Jehu destroyed the worship of the god named Baal in Israel. "},{"num":29,"verse":"But he didn’t turn away from the sins of Jeroboam, the son of Nebat. Jeroboam had caused Israel to commit those same sins. Jehu worshiped the golden calves at Bethel and Dan."},{"num":30,"verse":"The Lord said to Jehu, “You have done well. You have accomplished what is right in my eyes. You have done to Ahab’s royal house everything I wanted you to do. So your sons after you will sit on the throne of Israel. They will rule until the time of your children’s grandchildren.” "},{"num":31,"verse":"But Jehu wasn’t careful to obey the law of the Lord. He didn’t obey the God of Israel with all his heart. He didn’t turn away from the sins of Jeroboam. Jeroboam had caused Israel to commit those same sins."},{"num":32,"verse":"In those days the Lord began to make the kingdom of Israel smaller. Hazael gained control over many parts of Israel. He gained control over all their territory "},{"num":33,"verse":"east of the Jordan River. It included the whole land of Gilead from Aroer by the Arnon River valley all the way to Bashan. That was the territory of Gad, Reuben and Manasseh."},{"num":34,"verse":"The other events of Jehu’s rule are written down. Everything he did and accomplished is written in the official records of the kings of Israel."},{"num":35,"verse":"Jehu joined the members of his family who had already died. He was buried in Samaria. His son Jehoahaz became the next king after him. "},{"num":36,"verse":"Jehu had ruled over Israel in Samaria for 28 years."}]