[[],[{"type":"prose","content":"And Ahab hath seventy sons in Samaria, and Jehu writeth letters, and sendeth to Samaria, unto the heads of Jezreel, the elders, and unto the supporters of Ahab, saying,"}],[{"type":"prose","content":"`And now, at the coming in of this letter unto you, and with you [are] sons of your lord, and with you [are] the chariots and the horses, and a fenced city, and the armour,"}],[{"type":"prose","content":"and ye have seen the best and the uprightest of the sons of your lord, and have set [him] on the throne of his father, and fight ye for the house of your lord.'"}],[{"type":"prose","content":"And they fear very greatly, and say, `Lo, the two kings have not stood before him, and how do we stand -- we?'"}],[{"type":"prose","content":"And he who [is] over the house, and he who [is] over the city, and the elders, and the supporters, send unto Jehu, saying, `Thy servants we [are], and all that thou sayest unto us we do; we do not make any one king -- that which [is] good in thine eyes do.'"}],[{"type":"prose","content":"And he writeth unto them a letter a second time, saying, `If ye [are] for me, and to my voice are hearkening, take the heads of the men -- the sons of your lord, and come unto me about this time to-morrow, to Jezreel;' and the sons of the king [are] seventy men, with the great ones of the city those bringing them up."}],[{"type":"prose","content":"And it cometh to pass, at the coming in of the letter unto them, that they take the sons of the king, and slaughter seventy men, and put their heads in baskets, and send unto him to Jezreel,"}],[{"type":"prose","content":"and the messenger cometh in, and declareth to him, saying, `They have brought in the heads of the sons of the king,' and he saith, `Make them two heaps at the opening of the gate till the morning.'"}],[{"type":"prose","content":"And it cometh to pass in the morning, that he goeth out, and standeth, and saith unto all the people, `Righteous are ye; lo, I have conspired against my lord, and slay him -- and who smote all these?"}],[{"type":"prose","content":"Know ye now, that nothing doth fall of the word of Jehovah to the earth that Jehovah spake against the house of Ahab, and Jehovah hath done that which He spake by the hand of His servant Elijah.'"}],[{"type":"prose","content":"And Jehu smiteth all those left to the house of Ahab in Jezreel, and all his great men, and his acquaintances, and his priests, till he hath not left to him a remnant."}],[{"type":"prose","content":"And he riseth, and cometh in and goeth to Samaria; he [is] at the shepherds' shearing-house in the way,"}],[{"type":"prose","content":"and Jehu hath found the brethren of Ahaziah king of Judah, and saith, `Who [are] ye?' and they say, `Brethren of Ahaziah we [are], and we go down to salute the sons of the king, and the sons of the mistress.'"}],[{"type":"prose","content":"And he saith, `Catch them alive;' and they catch them alive, and slaughter them at the pit of the shearing-house, forty and two men, and he hath not left a man of them."}],[{"type":"prose","content":"And he goeth thence, and findeth Jehonadab son of Rechab -- to meet him, and blesseth him, and saith unto him, `Is thy heart right, as my heart [is] with thy heart?' and Jehonadab saith, `It is;' -- `Then it is; give thy hand;' and he giveth his hand, and he causeth him to come up into him into the chariot,"}],[{"type":"prose","content":"and saith, `Come with me, and look on my zeal for Jehovah;' and they cause him to ride in his chariot."}],[{"type":"prose","content":"And he cometh in to Samaria, and smiteth all those left to Ahab in Samaria, till his destroying him, according to the word of Jehovah that He spake unto Elisha."}],[{"type":"prose","content":"And Jehu gathereth the whole of the people, and saith unto them, `Ahab served Baal a little -- Jehu doth serve him much:"}],[{"type":"prose","content":"and now, all the prophets of Baal, all his servants, and all his priests, call ye unto me; let not a man be lacking, for a great sacrifice I have for Baal; every one who is lacking -- he doth not live;' and Jehu hath done [it] in subtilty, in order to destroy the servants of Baal."}],[{"type":"prose","content":"And Jehu saith, `Sanctify a restraint for Baal;' and they proclaim [it]."}],[{"type":"prose","content":"And Jehu sendeth into all Israel, and all the servants of Baal come in, and there hath not been left a man who hath not come in; and they come in to the house of Baal, and the house of Baal is full -- mouth to mouth."}],[{"type":"prose","content":"And he saith to him who [is] over the wardrobe, `Bring out clothing to all servants of Baal;' and he bringeth out to them the clothing."}],[{"type":"prose","content":"And Jehu goeth in, and Jehonadab son of Rechab, to the house of Baal, and saith to the servants of Baal, `Search and see, lest there be here with you of the servants of Jehovah -- but, the servants of Baal by themselves.'"}],[{"type":"prose","content":"And they come in to make sacrifices and burnt-offerings, and Jehu hath set for himself in an out-place eighty men, and saith, `The man who letteth escape [any] of the men whom I am bringing in unto your hand -- his soul for his soul.'"}],[{"type":"prose","content":"And it cometh to pass at his finishing to make the burnt-offering, that Jehu saith to the runners, and to the captains, `Go in, smite them, let none come out;' and they smite them by the mouth of the sword, and the runners and the captains cast [them] out; and they go unto the city, to the house of Baal,"}],[{"type":"prose","content":"and bring out the standing-pillars of the house of Baal, and burn them,"}],[{"type":"prose","content":"and break down the standing-pillar of Baal, and break down the house of Baal, and appoint it for a draught-house unto this day."}],[{"type":"prose","content":"And Jehu destroyeth Baal out of Israel,"}],[{"type":"prose","content":"only -- the sins of Jeroboam son of Nebat, that he caused Israel to sin, Jehu hath not turned aside from after them -- the calves of gold that [are] at Beth-El, and in Dan."}],[{"type":"prose","content":"And Jehovah saith unto Jehu, `Because that thou hast done well, to do that which [is] right in Mine eyes -- according to all that [is] in My heart thou hast done to the house of Ahab -- the sons of the fourth [generation] do sit for thee on the throne of Israel.'"}],[{"type":"prose","content":"And Jehu hath not taken heed to walk in the law of Jehovah, God of Israel, with all his heart, he hath not turned aside from the sins of Jeroboam, that he caused Israel to sin."}],[{"type":"prose","content":"In those days hath Jehovah begun to cut off [some] in Israel, and Hazael smiteth them in all the border of Israel,"}],[{"type":"prose","content":"from the Jordan, at the sun-rising, the whole land of Gilead, of the Gadite, and the Reubenite, and the Manassahite (from Aroer, that [is] by the brook Arnon), even Gilead and Bashan."}],[{"type":"prose","content":"And the rest of the matters of Jehu, and all that he did, and all his might, are they not written on the book of the Chronicles of the kings of Israel?"}],[{"type":"prose","content":"And Jehu lieth with his fathers, and they bury him in Samaria, and reign doth Jehoahaz his son in his stead."}],[{"type":"prose","content":"And the days that Jehu hath reigned over Israel [are] twenty and eight years, in Samaria."}]]