[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(26) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The meek.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The afflicted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This term, combined here with so many expressions for the worship of Jehovah, points to the Levites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Your heart.—LXX. and Vulg., “their,” which carries on the construction better. But such sudden changes of person are common in Hebrew; see even next verse. The feast that was made after a great sacrifice, such as 2Chronicles 7:5, not improbably suggested the figure of the banquet at which all the restored of Israel should meet; afterwards elaborated in the prophets (comp. Isaiah 25:6), and adopted in its refined spiritual sense by our Lord (Luke 14:16).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Your heart.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—LXX. and Vulg., “their,” which carries on the construction better. But such sudden changes of person are common in Hebrew; see even next verse. The feast that was made after a great sacrifice, such as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 7:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not improbably suggested the figure of the banquet at which all the restored of Israel should meet; afterwards elaborated in the prophets (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 25:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and adopted in its refined spiritual sense by our Lord (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 14:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The prophetic glance reaches further than the immediate occasion, and in the sufferer’s triumphant sense of vindication and restoration he embraces the whole world. (Comp. Jeremiah 16:19.) The interposition of Divine judgment in favour of Israel will warn the nations into sudden recollection of Him, and bring them submissive to His throne.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The prophetic glance reaches further than the immediate occasion, and in the sufferer’s triumphant sense of vindication and restoration he embraces the whole world. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) The interposition of Divine judgment in favour of Israel will warn the nations into sudden recollection of Him, and bring them submissive to His throne.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "FEASTING ON THE SACRIFICEPsalm 22:26",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "FEASTING ON THE SACRIFICE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘The flesh of the sacrifice of his peace-offering for thanksgiving shall be offered in the day of his oblation.’ Such was the law for Israel. And the custom of sacrificial feasts, which it embodies, was common to many lands. To such a custom my text alludes; for the Psalmist has just been speaking of ‘paying his vows’ {that is, sacrifices which he had vowed in the time of his trouble}, and to partake of these he invites the meek. The sacrificial dress is only a covering for high and spiritual thoughts. In some way or other the singer of this psalm anticipates that his experiences shall be the nourishment and gladness of a wide circle; and if we observe that in the context that circle is supposed to include the whole world, and that one of the results of partaking of this sacrificial feast is ‘your heart shall live for ever,’ we may well say with the Ethiopian eunuch, ‘Of whom speaketh the Psalmist thus?’ The early part of the psalm answers the question. Jesus Christ laid His hand on this wonderful psalm of desolation, despair, and deliverance when on the Cross He took its first words as expressing His emotion then: ‘My God! My God! Why hast Thou forsaken Me?’ Whatever may be our views as to its authorship, and as to the connection between the Psalmist’s utterances and his own personal experiences, none to whom that voice that rang through the darkness on Calvary is the voice of the Son of God, can hesitate as to who it is whose very griefs and sorrows are thus the spiritual food that gives life to the whole world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " From this, the true point of view, then, from which to look at the whole of this wonderful psalm, I desire to deal with the words of my text now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. We have, first, then, the world’s sacrificial feast. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. We have, first, then, the world’s sacrificial feast.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Jewish ritual, and that of many other nations, as I have remarked, provided for a festal meal following on, and consisting of the material of, the sacrifice. A generation which studies comparative mythology, and spares no pains to get at the meaning underlying the barbarous worship of the rudest nations, ought to be interested in the question of the ideas that formed and were expressed by that elaborate Jewish ritual. In the present case, the signification is plain enough. That which, in one aspect, is a peace-offering reconciling to God, in another aspect is the nourishment and the joy of the hearts that accept it. And so the work of Jesus Christ has two distinct phases of application, according as we think of it as being offered to God or appropriated by men. In the one case it is our peace; in the other it is our food and our life. If we glance for a moment at the marvellous picture of suffering and desolation in the previous portion of this psalm, which sounds the very depths of both, we shall understand more touchingly what it is on which Christian hearts are to feed. The desolation that spoke in ‘Why hast Thou forsaken Me?’ the consciousness of rejection and reproach, of mockery and contempt, which wailed, ‘All that see Me laugh Me to scorn; they shoot out the lip; they shake the head, saying, “He trusted on the Lord that He would deliver Him; let Him deliver Him, seeing He delighteth in Him”‘; the physical sufferings which are the very picture of crucifixion, so as that the whole reads liker history than prophecy, in ‘All My bones are out of joint; My strength is dried up like a potsherd; and My tongue cleaveth to My jaws’; the actual passing into the darkness of the grave, which is expressed in ‘Thou hast brought Me into the dust of death’; and even the minute correspondence, so inexplicable upon any hypothesis except that it is direct prophecy, which is found in ‘They part My garments among them, and cast lots upon My vesture’-these be the viands, not without bitter herbs, that are laid on the table which Christ spreads for us. They are parts of the sacrifice that reconciles to God. Offered to Him they make our peace. They are parts and elements of the food of our spirits. Appropriated and partaken of by us they make our strength and our life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren! there is little food, there is little impulse, little strength for obedience, little gladness or peace of heart to be got from a Christ who is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a Sacrifice. If we would know how much He may be to us, as the nourishment of our best life, and as the source of our purest and permanent gladness, we must, first of all, look upon Him as the Offering for the world’s sin, and then as the very Life and Bread of our souls. The Christ that feeds the world is the Christ that died for the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Hence our Lord Himself, most eminently in one great and profound discourse, has set forth, not only that He is the Bread of God which ‘came down from heaven,’ but that His flesh and His blood are such, and the separation between the two in the discourse, as in the memorial rite, indicates that there has come the violent separation of death, and that thereby He becomes the life of humanity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So my text, and the whole series of Old Testament representations in which the blessings of the Kingdom are set forth as a feast, and the parables of the New Testament in which a similar representation is contained, do all converge upon, and receive their deepest meaning from, that one central thought that the peace-offering for the world is the food of the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We see, hence, the connection between these great spiritual ideas and the central act of Christian worship. The Lord’s Supper simply says by act what my text says in words. I know no difference between the rite and the parable, except that the one is addressed to the eye and the other to the ear. The rite is an acted parable; the parable is a spoken rite. And when Jesus Christ, in the great discourse to which I have referred, dilates at length upon the ‘eating of His flesh and the drinking of His blood’ as being the condition of spiritual life, He is not referring to the Lord’s Supper, but the discourse and the rite refer both to the same spiritual truth. One is a symbol; the other is a saying; and symbol and saying mean just the same thing. The saying does not refer to the symbol, but to that to which the symbol refers. It seems to me that one of the greatest dangers which now threaten Evangelical Christianity is the strange and almost inexplicable recrudescence of Sacramentarianism in this generation to which those Christian communities are contributing, however reluctantly and unconsciously, who say there is something more than commemorative symbols in the bread and wine of the Lord’s table. If once you admit that, it seems, in my humble judgment, that you open the door to the whole flood of evils which the history of the Church declares have come with the Sacramentarian hypothesis. And we must take our stand, as I believe, upon the plain, intelligible thoughts-Baptism is a declaratory symbol, and nothing more; the Lord’s Supper is a commemorative symbol, and nothing more; except that both are acts of obedience to the enjoining Lord. When we stand there we can face all priestly superstitions, and say, ‘Jesus I know; and Paul I know; but who are ye?’ ‘The meek shall eat and be satisfied,’ and the food of the world is the suffering Messiah.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But what have we to say about the act expressed in the text? ‘The meek shall eat.’ I do not desire to dwell at any length upon the thought of the process by which this food of the world becomes ours, in this sermon. But there are two points which perhaps may be regarded as various aspects of one, on which I would like to say just a sentence or two. Of course, the translation of the ‘eating’ of my text into spiritual reality is simply that we partake of the food of our spirits by the act of faith in Jesus Christ. But whilst that is so, let me put emphasis, in a sentence, upon the thought that personal appropriation, and making the world’s food mine, by my own individual act, is the condition on which alone I get any good from it. It is possible to die of starvation at the door of a granary. It is possible to have a table spread with all that is needful, and yet to set one’s teeth, and lock one’s lips, and receive no strength and no gladness from the rich provision. ‘Eat’ means, at any rate, incorporate with myself, take into my very own lips, masticate with my very own teeth, swallow down by my very own act, and so make part of my physical frame. And that is what we have to do with Jesus Christ, or He is nothing to us. ‘Eat’; claim your part in the universal blessing; see that it becomes yours by your own taking of it into the very depths of your heart. And then, and then only, will it become your food.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And how are we to do that if, day in and day out, and week in and week out, and year in and year out, with some of us, there be scarce a thought turned to Him; scarce a desire winging its way to Him; scarce one moment of quiet contemplation of these great truths. We have to ruminate, we have to meditate; we have to make conscious and frequent efforts to bring before the mind, in the first place, and then before the heart and all the sensitive, emotional, and voluntary nature, the great truths on which our salvation rests. In so far as we do that we get good out of them; in so far as we fail to do it, we may call ourselves Christians, and attend to religious observances, and be members of churches, and diligent in good works, and all the rest of it, but nothing passes from Him to us, and we starve even whilst we call ourselves guests at His table.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh! the average Christian life of this day is a strange thing; very, very little of it has the depth that comes from quiet communion with Jesus Christ; and very little of it has the joyful consciousness of strength that comes from habitual reception into the heart of the grace that He brings. What is the good of all your profession unless it brings you to that? If a coroner’s jury were to sit upon many of us-and we are dead enough to deserve it-the verdict would be, ‘Died of starvation.’ ‘The meek shall eat,’ but what about the professing Christians that feed their souls upon anything, everything rather than upon the Christ whom they say they trust and serve?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. And now let me say a word, in the second place, about the rich fruition of this feast. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. And now let me say a word, in the second place, about the rich fruition of this feast.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘The meek shall be satisfied.’ ‘Satisfied!’ Who in the world is? And if we are not, why are we not? Jesus Christ, in the facts of His death and resurrection-for His resurrection as well as His death are included in the psalm-brings to us all that our circumstances, relationships, and inward condition can require.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Think of what that death, as the sacrifice for the world’s sin, does. It sets all right in regard to our relation to God. It reveals to us a God of infinite love. It provides a motive, an impulse, and a Pattern for all life. It abolishes death, and it gives ample scope for the loftiest and most exuberant hopes that a man can cherish. And surely these are enough to satisfy the seeking spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But go to the other end, and think, not of what Christ’s work does for us, but of what we need to have done for us. What do you and I want to be satisfied? It would take a long time to go over the catalogue; let me briefly run through some of the salient points of it. We want, for the intellect, which is the regal part of man, though it be not the highest, truth which is certain, comprehensive, and inexhaustible; the first, to provide anchorage; the second, to meet and regulate and unify all thought and life; and the last, to allow room for endless research and ceaseless progress. And in that fact that the Eternal Son of the Eternal Father took upon Himself human nature, lived, died, rose, and reigns at God’s right hand, I believe there lie the seeds of all truth, except the purely physical and material, which men need. Everything is there; every truth about God, about man, about duty, about a future, about society; everything that the world needs is laid up in germ in that great gospel of our salvation. If a man will take it for the foundation of his beliefs and the guide of his thinkings, he will find his understanding is satisfied, because it grasps the personal Truth who liveth, and is with us for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Our hearts crave, however imperfect their love may be, a perfect love; and a perfect love means one untinged by any dash of selfishness, incapable of any variation or eclipse, all-knowing, all-pitying, all-powerful. We have made experience of precious loves that die. We know of loves that change, that grow cold, that misconstrue, that may have tears but have no hands. We know of ‘loves’ that are only a fine name for animal passions, and are twice cursed, cursing them that give and them that take. The happiest will admit, and the lonely will achingly feel, how we all want for satisfaction a love that cannot fail, that can help, that beareth all things, and that can do all things. We have it in Jesus Christ, and the Cross is the pledge thereof.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Conscience wants pacifying, cleansing, enlightening, directing, and we get all these in the good news of One that has died for us, and that lives to be our Lord. The will needs authority which is not force. And where is there an authority so constraining in its sweetness and so sweet in its constraint as in those silken bonds which are stronger than iron fetters? Hope, imagination, and all other of our powers or weaknesses, our gifts or needs, are satisfied when they feed on Christ. If we feed upon anything else it turns to ashes that break our teeth and make our palates gritty, and have no nourishment in them. We shall be ‘for ever roaming with a hungry heart’ unless we take our places at the feast on the one sacrifice for the world’s peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. I can say but a word as to the guests. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. I can say but a word as to the guests.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is ‘the meek’ who eat. The word translated ‘meek’ has a wider and deeper meaning than that. ‘Meek’ refers, in our common language, mainly to men’s demeanour to one another; but the expression here goes deeper. It means both ‘afflicted’ and ‘lowly’-the right use of affliction being to bow men, and they that bow themselves are those who are fit to come to Christ’s feast. There is a very remarkable contrast between the words of my text and those that follow a verse or two afterwards. ‘The meek shall eat and be satisfied,’ says the text. And then close upon its heels comes, ‘All those that be fat upon earth shall eat.’ That is to say, the lofty and proud have to come down to the level of the lowly, and take indiscriminate places at the table with the poor and the starving, which, being turned into plain English is just this-the one thing that hinders a man from partaking of the fulness of Christ’s feeding grace is self-sufficiency, and the absence of a sense of need. They that ‘hunger and thirst after righteousness shall be filled’; and they that come, knowing themselves to be poor and needy, and humbly consenting to accept a gratuitous feast of charity-they, and only they, do get the rich provisions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You are shut out because you shut yourselves out. They that do not know themselves to be hungry have no ears for the dinner-bell. They that feel the pangs of starvation and know that their own cupboards are empty, they are those who will turn to the table that is spread in the wilderness, and there find a ‘feast of fat things.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, dear friends! when He calls, do not let us make excuses, but rather listen to that voice that says to us, ‘Why do you spend your money for that which is not bread, and your labour for that which satisfieth not. . . . Incline your ear unto Me; hear, and your soul shall live.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 22:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The meek — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, the poor or humble, gentle and teachable, namely, believing and godly persons whose hearts the grace of God hath softened and sweetened, subduing their pride and passion, and their rebellion against God, and fierceness toward men; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall eat and be satisfied — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Shall partake of those spiritual blessings which God hath provided for them in his gospel, that grace, and peace, and comfort, which all believing souls enjoy, in a sense of God’s love, in the pardon of their sins, and in the influences of God’s Spirit. Of these and not of any temporal blessings, this clause is doubtless to be understood. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They shall praise the Lord that seek him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That seek his favour, and the true spiritual knowledge of, and communion with, him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Your heart shall live — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He speaks of the same persons still, though there be a change from the third to the second person, as is usual in these poetical books. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For ever — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Your comfort shall not be short and transitory, as worldly comforts are, but everlasting.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:22-31 The Saviour now speaks as risen from the dead. The first words of the complaint were used by Christ himself upon the cross; the first words of the triumph are expressly applied to him, Heb 2:12. All our praises must refer to the work of redemption. The suffering of the Redeemer was graciously accepted as a full satisfaction for sin. Though it was offered for sinful men, the Father did not despise or abhor it for our sakes. This ought to be the matter of our thanksgiving. All humble, gracious souls should have a full satisfaction and happiness in him. Those that hunger and thirst after righteousness in Christ, shall not labour for that which satisfies not. Those that are much in praying, will be much in thanksgiving. Those that turn to God, will make conscience of worshipping before him. Let every tongue confess that he is Lord. High and low, rich and poor, bond and free, meet in Christ. Seeing we cannot keep alive our own souls, it is our wisdom, by obedient faith, to commit our souls to Christ, who is able to save and keep them alive for ever. A seed shall serve him. God will have a church in the world to the end of time. They shall be accounted to him for a generation; he will be the same to them that he was to those who went before them. His righteousness, and not any of their own, they shall declare to be the foundation of all their hopes, and the fountain of all their joys. Redemption by Christ is the Lord's own doing. Here we see the free love and compassion of God the Father, and of our Lord Jesus Christ, for us wretched sinners, as the source of all grace and consolation; the example we are to follow, the treatment as Christians we are to expect, and the conduct under it we are to adopt. Every lesson may here be learned that can profit the humbled soul. Let those who go about to establish their own righteousness inquire, why the beloved Son of God should thus suffer, if their own doings could atone for sin? Let the ungodly professor consider whether the Saviour thus honoured the Divine law, to purchase him the privilege of despising it. Let the careless take warning to flee from the wrath to come, and the trembling rest their hopes upon this merciful Redeemer. Let the tempted and distressed believer cheerfully expect a happy end of every trial.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The meek shall eat and be satisfied - The word \"meek\" - ענוים  ‛ănâviym - means here rather \"afflicted, distressed, miserable.\" This is its usual meaning. It is employed sometimes in the sense of mild or meek (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but it here manifestly denotes the afflicted; the poor; the distressed. When it is said that they would \"eat and be satisfied,\" the idea is that of prosperity or abundance; and the statement is, that, as the result of the Redeemer's work, blessings in abundance would be imparted to the poor and the distressed - those who had been destitute, forsaken, and friendless.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They shall praise the Lord that seek him - Those that worship God, or the pious, shall see abundant cause to praise God. They will not merely call upon him by earnest prayer, but they will render him thanks for his mercies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Your heart shall live for ever - The hearts of those that worship God. Their hearts would not faint or be discouraged. They would exult and rejoice continually. In other words, their joy and their praise would never die away. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Your heart shall live for ever - The hearts of those that worship God. Their hearts would not faint or be discouraged. They would exult and rejoice continually. In other words, their joy and their praise would never die away. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25, 26. My praise shall be of thee—or, perhaps better, \"from thee,\" that is, God gives grace to praise Him. With offering praise, he further evinces his gratitude by promising the payment of his vows, in celebrating the usual festival, as provided in the law (De 12:18; 16:11), of which the pious or humble, and they that seek the Lord (His true worshippers) shall partake abundantly, and join him in praise [Ps 22:26]. In the enthusiasm produced by his lively feelings, he addresses such in words, assuring them of God's perpetual favor [Ps 22:26]. The dying of the heart denotes death (1Sa 25:37); so its living denotes life.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The meek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. faithful or godly persons, who are frequently called meek ones, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 25:9 76:9 149:4 Isaiah 11:4 61:1 Zephaniah 2:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 76:9 149:4 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 61:1 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 2:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", because the grace of God doth soften and sweeten the hearts of sinners, and subdues their pride, and passion, and rebellion against God, and their fierceness towards men. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the poor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as this word is oft rendered; which seems well to suit this place, partly, because these are opposed to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ones upon earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 22:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; partly, because the following ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eating",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "satisfaction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may seem most proper and acceptable to such as were in want; partly, because here is an allusion to the legal feasts, made of the remainders of the sacrifices, in which the poor had a share; and partly, because this well agrees to the time of Christ’s coming, when the body of the Jewish nation were a poor and afflicted people, and the poor especially ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "did receive the gospel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 11:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Eat and be satisfied; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is mentioned as a great blessing, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joel 2:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as it is threatened as a grievous curse that men should eat and not be satisfied, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 26:26 Micah 6:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 6:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". But because it was comparatively a poor and mean thing to have one’s belly filled and satisfied with that food which perisheth and passeth away presently after it is received, this magnificent promise is doubtless to be understood spiritually, of those spiritual blessings, that grace, and peace, and comfort, and full satisfaction, which all believing and pious souls have in the sense of God’s love, and the pardon of their sins, and in the influences of God’s Spirit into their souls. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That seek him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that seek his favour; or that inquire after him, and labour to know and discern him; wherein possibly the Spirit of God may intimate to us the necessity of seeking, and the difficulty of finding or discovering God, when he shall appear in the flesh, and in the form of a servant; which was likely to hide him from the eyes of the carnal and careless Jews, and not to be discerned but by those that were studious and inquisitive concerning the mind of God revealed in the Scriptures concerning that matter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Your heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. their; for he speaks of the same persons still, though there be a change from the third to the second person, as is usual in these poetical and prophetical books of Scripture. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall live, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. shall be greafiy refreshed and comforted; life being oft put for a happy and comfortable life, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 1:25 Psalm 34:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 1:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 34:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; in which respect Jacob’s heart or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is said to have revived, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 45:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 45:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; as, on the contrary, Nabal’s heart was said to have ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "died within him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 25:37",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:37",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", when it was oppressed with great sadness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For ever; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " your comfort shall not be short and transitory, as worldly comforts are, but everlasting. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The meek shall eat and be satisfied,.... Such who, being made thoroughly sensible of sin, look upon themselves the chief of sinners, and the least of saints; and being truly convicted of the insufficiency of their own righteousness, wholly trust to and rely on the righteousness of Christ; and, being acquainted with their impotency and inability to do any good thing of themselves, ascribe all to the grace of God, and have no dependence on anything done by them; who are willing to be instructed and reproved by the meanest saint; are not easily provoked to wrath; patiently bear indignities and affronts, and are gentle unto all men: these shall \"eat\" the fat and drink the sweet of Christ the bread of lift; they shall eat of his flesh by faith, which is meat indeed; they shall find the word, and eat it; feed on the wholesome words of Christ, the words of faith and good doctrine, and shall be \"satisfied\", or \"filled\": other food is not satisfying; it proves gravel, ashes, and wind; it is not bread, and satisfies not; but such as hunger and thirst after Christ and his righteousness, and are poor in their own eyes, meek and humble; these are filled with good things to satisfaction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Jarchi interprets these words of the time of the redemption and the days of the Messiah; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall praise the Lord that seek him; in Christ, with their whole heart; who being filled by him and satisfied, bless the Lord for their spiritual food and comfortable repast, as it becomes men to do for their corporeal food, Deuteronomy 8:10; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they shall praise the Lord that seek him; in Christ, with their whole heart; who being filled by him and satisfied, bless the Lord for their spiritual food and comfortable repast, as it becomes men to do for their corporeal food, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 8:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "your heart shall live for ever; this is an address of Christ to them that fear the Lord, the seed of Jacob and Israel; the meek ones, and that seek the Lord, his face and favour, and who eat and are satisfied; signifying, that they should be revived and refreshed, should be cheerful and comfortable; should live by faith on Christ now, and have eternal life in them; and should live with him for ever hereafter, and never die the second death. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "your heart shall live for ever; this is an address of Christ to them that fear the Lord, the seed of Jacob and Israel; the meek ones, and that seek the Lord, his face and favour, and who eat and are satisfied; signifying, that they should be revived and refreshed, should be cheerful and comfortable; should live by faith on Christ now, and have eternal life in them; and should live with him for ever hereafter, and never die the second death. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{q} The meek shall eat and be satisfied: they shall praise the LORD that seek him: your heart shall live for ever.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The meek shall eat and be satisfied: they shall praise the LORD that seek him: your heart shall live for ever.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) He alludes still to the sacrifice.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The meek shall eat and be satisfied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The flesh of a sacrifice offered in performance of a vow was to be eaten on the same day on which it was offered, or on the morrow (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Psalmist will invite the meek to join him in this eucharistic meal. Such an invitation is not indeed prescribed in the Law, but it is in full accordance with the command to invite the poor and needy to share in the tithes (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 26:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; where the phrase ‘eat and be satisfied’ occurs), and in the harvest festivals (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There seems to be no good reason for supposing that the words are to be understood wholly in a figurative and spiritual sense, though on the other hand their meaning is not to be limited to the external performance of a ritual ceremony. At any rate the language of this and the preceding verse is based upon the idea of a sacrifice of thanksgiving of which the worshippers partook (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ‘Eat and be satisfied’ is not merely a current formula for the refreshment which flows from Divine blessing, the Psalmist anticipating that his own deliverance will lead to the prosperity of all the godly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that seek him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V., that seek after him. All Jehovah’s devoted followers (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 24:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") will swell the anthem.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "your heart shall live",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] R.V., let your heart live for ever. The entertainer invokes a blessing on his guests. May those who were ready to perish be revived and quickened with an undying energy! With the whole verse cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If the primary and immediate reference is to a sacrificial feast, it is clear that the words reach far beyond the outward rite to the spiritual communion of which it was the symbol; while the Christian reader cannot but see the counterpart and fulfilment of the words in the Holy Eucharist.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 26.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The meek shall eat and be satisfied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the Eucharistic feasts of Christ's  kingdom it is \"the meek\" especially who shall eat, and be satisfied, feeling that they have all their souls long for - a full banquet, of the very crumbs of which they are not worthy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They shall praise the Lord that seek him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The service shall be emphatically one of praise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Your heart shall live for ever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The result shall be life for evermore; for the body and blood of the Lord Jesus Christ, worthily received, preserve men's bodies and souls to everlasting life. Psalm 22:26",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 22:26-27) The call to thanksgiving is now ended; and there follows a grateful upward glance towards the Author of the salvation; and this grateful upward glance grows into a prophetic view of the future. This fact, that the sufferer is able thus to glory and give thanks in the great congregation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), proceeds from Jahve (מאת as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 118:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 71:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The first half of the verse, according to Baer's correct accentuation, closes with בּקהל רב. יראיו does not refer to קהל, but, as everywhere else, is meant to be referred to Jahve, since the address of prayer passes over into a declarative utterance. It is not necessary in this passage to suppose, that in the mind of David the paying of vows is purely ethical, and not a ritualistic act. Being rescued he will bring the שׁלמי נדר, which it is his duty to offer, the thank-offerings, which he vowed to God when in the extremest peril. When the sprinkling with blood (זריקה) and the laying of the fat pieces upon the altar (הקטרה) were completed, the remaining flesh of the shalemim was used by the offerer to make a joyous meal; and the time allowed for this feasting was the day of offering and on into the night in connection with the tda-shelamim offering, and in connection with the shelamim of vows even the following day also (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The invitation of the poor to share in it, which the law does not command, is rendered probable by these appointments of the law, and expressly commended by other and analogous appointments concerning the second and third tithes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refers to this: he will invite the ענוים, those who are outwardly and spiritually poor, to this \"eating before Jahve;\" it is to be a meal for which they thank God, who has bestowed it upon them through him whom He has thus rescued. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is as it were the host's blessing upon his guests, or rather Jahve's guests through him: \"your heart live for ever,\" i.e., may this meal impart to you ever enduring refreshment. יחי optative of חיה, here used of the reviving of the heart, which is as it were dead (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to spiritual joy. The reference to the ritual of the peace offerings is very obvious. And it is not less obvious, that the blessing, which, for all who can be saved, springs from the salvation that has fallen to the lot of the sufferer, is here set forth. But it is just as clear, that this blessing consists in something much higher than the material advantage, which the share in the enjoyment of the animal sacrifice imparts; the sacrifice has its spiritual meaning, so that its outward forms are lowered as it were to a mere figure of its true nature; it relates to a spiritual enjoyment of spiritual and lasting results. How natural, then, is the thought of the sacramental eucharist, in which the second David, like to the first, having attained to the throne through the suffering of death, makes us partakers of the fruits of His suffering!  ",
        "children": []
      }
    ]
  }
]