[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(31) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the generation just foretold: it shall announce His righteousness to a still younger generation (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to a people born",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that He wrought. The tale of Jehovah’s goodness to Israel would be handed on from age to age,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“His triumphs would be sung",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By some yet unmoulded tongue.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 22:31",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:31",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They shall come — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The seed last mentioned, or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "some shall come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(for this may be indefinitely spoken,) and do the work here mentioned, namely, the apostles and ministers of the gospel shall come from Judea and Jerusalem, from whence the gospel was to go forth, to the Gentile world, to the several parts whereof the apostles went upon this errand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And shall declare his righteousness: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "either, 1st, His wonderful grace and mercy to mankind. in giving them Christ and the gospel: for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is often put for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mercy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "kindness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, 2d, That righteousness which God hath appointed for the justification of sinners, called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness of faith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 3:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Php 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which the Jews were ignorant of, and would not submit to, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but which the Gentiles joyfully embraced. Or, 3d, His truth or faithfulness, (which is very frequently and properly called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the performance of those exceeding great and precious promises made and recorded in the Old Testament, and especially those two concerning the sending of Messias, and concerning the calling of the Gentiles; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Unto a people that shall be born — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either, 1st, Spiritually, that is, born again: for conversion to God is sometimes called a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "birth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and creation, even in the Old Testament. Or rather, 2d, Naturally, that is, unto succeeding generations. Whereby David gives us a key to understand this Psalm, and teacheth us that he speaks not here of himself, or of the occurrences of his times, but of things which were to be done in after ages, even in the spreading of the gospel among the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gentiles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the time of the New Testament. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That he hath done this — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They shall declare that this is the work of God, and not of man, and is carried on by his power alone in the world, against all the policy and power of men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:22-31 The Saviour now speaks as risen from the dead. The first words of the complaint were used by Christ himself upon the cross; the first words of the triumph are expressly applied to him, Heb 2:12. All our praises must refer to the work of redemption. The suffering of the Redeemer was graciously accepted as a full satisfaction for sin. Though it was offered for sinful men, the Father did not despise or abhor it for our sakes. This ought to be the matter of our thanksgiving. All humble, gracious souls should have a full satisfaction and happiness in him. Those that hunger and thirst after righteousness in Christ, shall not labour for that which satisfies not. Those that are much in praying, will be much in thanksgiving. Those that turn to God, will make conscience of worshipping before him. Let every tongue confess that he is Lord. High and low, rich and poor, bond and free, meet in Christ. Seeing we cannot keep alive our own souls, it is our wisdom, by obedient faith, to commit our souls to Christ, who is able to save and keep them alive for ever. A seed shall serve him. God will have a church in the world to the end of time. They shall be accounted to him for a generation; he will be the same to them that he was to those who went before them. His righteousness, and not any of their own, they shall declare to be the foundation of all their hopes, and the fountain of all their joys. Redemption by Christ is the Lord's own doing. Here we see the free love and compassion of God the Father, and of our Lord Jesus Christ, for us wretched sinners, as the source of all grace and consolation; the example we are to follow, the treatment as Christians we are to expect, and the conduct under it we are to adopt. Every lesson may here be learned that can profit the humbled soul. Let those who go about to establish their own righteousness inquire, why the beloved Son of God should thus suffer, if their own doings could atone for sin? Let the ungodly professor consider whether the Saviour thus honoured the Divine law, to purchase him the privilege of despising it. Let the careless take warning to flee from the wrath to come, and the trembling rest their hopes upon this merciful Redeemer. Let the tempted and distressed believer cheerfully expect a happy end of every trial.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They shall come - That is, there were those who would thus come. Who these would be is not specified. The obvious sense is, that some would rise up to do this; that the succession of such men would be kept up from age to age, making known these great facts and truths to succeeding generations. The language would be applicable to a class of men called, from age to age, to proclaim these truths, and set apart to this work. It is a fair application of the verse to refer it to those who have been actually designated for such an office - the ministers of religion appointed to keep up the memory of the great work of redemption in the world. Thus understood, the passage is a proper carrying out of the great truths stated in the psalm - that, in virtue of the sufferings of the Redeemer, God would be made known to men; that his worship would be kept up in the earth; that distant generations would serve him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And shall declare his righteousness - No language could better describe the actual office of the ministers of the Gospel as appointed to set forth the \"righteousness\" of God, to vindicate his government and laws, and to state the way in which men may be made righteous, or may be justified. Compare Romans 1:17; Romans 3:26.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And shall declare his righteousness - No language could better describe the actual office of the ministers of the Gospel as appointed to set forth the \"righteousness\" of God, to vindicate his government and laws, and to state the way in which men may be made righteous, or may be justified. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 3:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Unto a people that shall be born - To future generations.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That he hath done this - That God has done or accomplished what is stated in this psalm; that is, on the supposition that it refers to the Messiah, that he has caused an atonement to be made for mankind, or that redemption has been provided through the sufferings of the Messiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I have given what seems to me to be a fair exposition of this psalm, referring it wholly to the Messiah. No part of the interpretation, on this view of the psalm, seems to me to be forced or unnatural, and as thus interpreted it seems to me to have as fair and obvious an applicability to him as even Isaiah 53:1-12, or any other portion of the prophecies. The scene in the psalm is the cross, the Redeemer suffering for the sins of man. The main features of the psalm relate to the course of thoughts which then passed through the mind of the Redeemer; his sorrow at the idea of being abandoned by God; his confidence in God; the remembrance of his early hopes; his emotions at the taunts and revilings of his enemies; his consciousness of prostrated strength; his feelings as the soldiers pierced his hands and his feet, and as they proceeded to divide his raiment; his prayer that his enemies might not be suffered to accomplish their design, or to defeat the work of redemption; his purpose to make God known to men; his assurance that the effect of his sufferings would be to bring the dwellers on the earth to serve God, and to make his name and his righteousness known to far distant times. I regard the whole psalm, therefore, as applicable to the Messiah alone; and believing it to be inspired, I cannot but feel that we have here a most interesting and affecting account, given long before it occurred, of what actually passed through the mind of the Redeemer when on the cross - an account more full than we have anywhere else in the Bible. Other statements pertain more particularly to the external events of the crucifixion; here we have a record in anticipation of what actually passed through his own mind in those hours of unspeakable anguish when he made an atonement for the sins of the world. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I have given what seems to me to be a fair exposition of this psalm, referring it wholly to the Messiah. No part of the interpretation, on this view of the psalm, seems to me to be forced or unnatural, and as thus interpreted it seems to me to have as fair and obvious an applicability to him as even ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:1-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or any other portion of the prophecies. The scene in the psalm is the cross, the Redeemer suffering for the sins of man. The main features of the psalm relate to the course of thoughts which then passed through the mind of the Redeemer; his sorrow at the idea of being abandoned by God; his confidence in God; the remembrance of his early hopes; his emotions at the taunts and revilings of his enemies; his consciousness of prostrated strength; his feelings as the soldiers pierced his hands and his feet, and as they proceeded to divide his raiment; his prayer that his enemies might not be suffered to accomplish their design, or to defeat the work of redemption; his purpose to make God known to men; his assurance that the effect of his sufferings would be to bring the dwellers on the earth to serve God, and to make his name and his righteousness known to far distant times. I regard the whole psalm, therefore, as applicable to the Messiah alone; and believing it to be inspired, I cannot but feel that we have here a most interesting and affecting account, given long before it occurred, of what actually passed through the mind of the Redeemer when on the cross - an account more full than we have anywhere else in the Bible. Other statements pertain more particularly to the external events of the crucifixion; here we have a record in anticipation of what actually passed through his own mind in those hours of unspeakable anguish when he made an atonement for the sins of the world. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31. that he hath done this—supply \"it,\" or \"this\"—that is, what the Psalm has unfolded.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either the converts and worshippers, ver. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 22:27,29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; or their seed last mentioned, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 22:30",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:30",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or this may be indefinitely spoken, as such verbs are oft used, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "they shall come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. some or other shall come, and do the work here mentioned, to wit, the apostles and ministers of the gospel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, from Judea and Jerusalem (from whence the gospel was first to go forth) to the Gentile world, to the several parts whereof the apostles went upon this errand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His righteousness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God’s righteousness; either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. His wonderful grace and mercy to mankind, in giving them Christ and the gospel; for righteousness is oft put for mercy or kindness, as hath been noted again and again. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. That righteousness which God hath appointed for the justification of sinners, called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the righteousness of faith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 3:21,22 Php 3:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 3:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",22 Php 3:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which the Jews were ignorant of, and would not submit to, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 10:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 10:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the Gentiles joyfully embraced. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. His truth or faithfulness, (which is very frequently and fitly called righteousness,) in the performance of those exceeding great and precious promises made and recorded in the Old Testament, and especially those two concerning the sending of the Messias, and concerning the calling of the Gentiles. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That shall be born; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Spiritually, i.e. born again; for regeneration is oft called a birth; as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 87:4,5 Joh 1:13 1 Peter 1:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 87:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",5 Joh 1:13 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 1:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and a creation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 102:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 102:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Naturally, i.e. unto succeeding generations; whereby David gives us a key to understand this Psalm, and teacheth us that he speaks not here of himself, or of the occurrences of his times, but of things which were to be done in after-ages, even of the spreading of the gospel among the Gentiles, in the time of the New Testament. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That he hath done this, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. they shall declare that this is the work of God, and not of man, and carried on by his only power in the world, against all the wit and force of men. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (this being added as a proof or demonstration of that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of God now mentioned) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i.e. the Lord, plainly understood here, and expressed in the foregoing verse) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hath done",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wrought it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, his righteousness; i.e. he hath executed with his hand what he spake with his mouth; he hath demonstrated the truth of his promises by his actions, and by the accomplishment of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They shall come,.... One generation after another; there shall always be a succession of regenerate persons, who shall come to Christ, and to his churches; and a succession of Gospel ministers among them, who shall come forth, being sent and qualified by Christ; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall declare his righteousness, either the faithfulness of God, in fulfilling his promises; especially those which respect the mission of Christ, and salvation by him, as Zacharias did, Luke 1:68; or rather the righteousness of Christ, which is revealed in the Gospel, and makes a most considerable part of the declaration of it, and is published by Gospel ministers in all ages, as the only justifying righteousness before God: and that ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and shall declare his righteousness, either the faithfulness of God, in fulfilling his promises; especially those which respect the mission of Christ, and salvation by him, as Zacharias did, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:68",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or rather the righteousness of Christ, which is revealed in the Gospel, and makes a most considerable part of the declaration of it, and is published by Gospel ministers in all ages, as the only justifying righteousness before God: and that ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "unto a people that shall be born; in successive generations; that shall be brought upon the stage of time and life; or that shall be born again; for to such only, in a spiritual and saving way, is the righteousness of Christ declared, revealed, and applied, by the blessed Spirit, through the ministry of the word: it is added, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that he hath done this; wrought this righteousness; so Jarchi; that is, is the author of it; is become the end of the law for it; has finished it, and brought it in; or else all the great things spoken of in this psalm, relating to the Messiah, his sufferings, death, and resurrection, and the calling of the Gentiles; all which are the Lord's doings, and are what is declared in the Gospel: the Targum is, \"the miracles which he hath done\"; the Septuagint version, and those that follow it, connect this clause with the preceding thus, \"to a people that shall be born, whom the Lord hath made\"; made them his people, created them in Christ, and formed them for himself. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that he hath done this; wrought this righteousness; so Jarchi; that is, is the author of it; is become the end of the law for it; has finished it, and brought it in; or else all the great things spoken of in this psalm, relating to the Messiah, his sufferings, death, and resurrection, and the calling of the Gentiles; all which are the Lord's doings, and are what is declared in the Gospel: the Targum is, \"the miracles which he hath done\"; the Septuagint version, and those that follow it, connect this clause with the preceding thus, \"to a people that shall be born, whom the Lord hath made\"; made them his people, created them in Christ, and formed them for himself. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "They shall come, and shall declare his righteousness unto a people that shall be born, that he hath {u} done this.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They shall come, and shall declare his righteousness unto a people that shall be born, that he hath ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{u}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " done ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "this",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) That is, God has fulfilled his promise.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] And they shall declare his righteousness unto a people that shall be born; i.e. to the next generation. From one generation to another the tradition of Jehovah’s righteousness, of His faithfulness to His covenant, will be handed down.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that he hath done",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this] Or as R.V., that he hath done it. The object is not expressed. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which combines ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 22:8; Psalm 22:31",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:31",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 52:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:126",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " unites the first and last lines of the Psalm.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Kay",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He has wrought out His purpose of salvation, interposed on His servant’s behalf, proved Himself the living righteous and true God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The song of praise, begun by the Psalmist (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 22:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), is taken up by Israel; all the nations of the earth swell the chorus; and the strain echoes on through all the ages. So gloriously ends the Psalm which began in the darkest sorrow. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Per crucem ad lucem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is a parable of the history of the individual, of Israel, of the Church, of the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 31.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They shall come, and shall declare his righteousness unto a people that shall be born, that he hath done this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". One generation after another shall come, and shall report God's righteousness, as shown forth in Christ, each to its successor - a people yet to be born - telling them that God \"has done this;\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " effected all that is here sketched out, and so accomplished the work of redemption. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalm 22:31",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The eating is here again brought to mind. The perfect, אכלוּ, and the future of sequence, ויּשׁתּחווּ, stand to one another in the relation of cause and effect. It is, as is clear from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", an eating that satisfies the soul, a spiritual meal, that is intended, and in fact, one that is brought about by the mighty act of rescue God has wrought. At the close of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the form of the ritual thank-offering is straightway ignored, ראוּ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") takes the place of the אכלוּ. There it is the view of one who is rescued and who thankfully glorifies God, which leads to others sharing with him in the enjoyment of the salvation he has experienced; here it is an actual enjoyment of it, the joy, springing from thankfulness, manifesting itself not merely in words but in a thank-offering feast, at which, in Israel, those who long for salvation are the invited guests, for with them it is an acknowledgment of the mighty act of a God whom they already know; but among the heathen, men of the most diversified conditions, the richest and the poorest, for to them it is a favour unexpectedly brought to them, and which is all the more gratefully embraced by them on that account. So magnificent shall be the feast, that all דּשׁני־ארץ, i.e., those who stand out prominently before the world and before their own countrymen by reason of the abundance of their temporal possessions (compare on the ascensive use of ארץ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 75:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 76:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), choose it before this abundance, in which they might revel, and, on account of the grace and glory which the celebration includes within itself, they bow down and worship. In antithesis to the \"fat ones of the earth\" stand those who go down to the dust (עפר, always used in this formula of the dust of the grave, like the Arabic turâb) by reason of poverty and care. In the place of the participle יורדי we now have with ונפשׁו ( equals  ואשׁר נפשׁו) a clause with ולא, which has the value of a relative clause (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 9:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently): and they who have not heretofore prolonged and could not prolong their life (Ges. 123, 3, c). By comparing ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Philippians 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hupfeld understands it to be those who are actually dead; so that it would mean, His kingdom extends to the living and the dead, to this world and the nether world. But any idea of a thankful adoration of God on the part of the dwellers in Hades is alien to the Old Testament; and there is nothing to force us to it here, since יורד עפר, can just as well mean descensuri as qui descenderunt, and נפשׁו dna ,tnuredne חיּה (also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") means to preserve his own life, - a phrase which can be used in the sense of vitam sustentare and of conservare with equal propriety. It is, therefore, those who are almost dead already with care and want, these also (and how thankfully do these very ones) go down upon their knees, because they are accounted worthy to be guests at this table. It is the same great feast, of which Isaiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", prophesies, and which he there accompanies with the music of his words. And the result of this evangel of the mighty act of rescue is not only of boundless universality, but also of unlimited duration: it propagates itself from one generation to another.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Formerly we interpreted Psalm 22:31 \"a seed, which shall serve Him, shall be reckoned to the Lord for a generation;\" taking יספּר as a metaphor applying to the census, 2 Chronicles 2:16, cf. Psalm 87:6, and לדּור, according to Psalm 24:6 and other passages, as used of a totality of one kind, as זרע of the whole body of those of the same race. But the connection makes it more natural to take דור in a genealogical sense; and, moreover, with the former interpretation it ought to have been לדּור instead of לדּור. We must therefore retain the customary interpretation: \"a seed (posterity) shall serve Him, it shall be told concerning the Lord to the generation (to come).\" Decisive in favour of this interpretation is לדּור with the following יבאוּ, by which דור acquires the meaning of the future generation, exactly as in Psalm 71:18, inasmuch as it at once becomes clear, that three generations are distinctly mentioned, viz., that of the fathers who turn unto Jahve, Psalm 22:30, that of the coming דור, Psalm 22:31, and עם נולד, to whom the news of the salvation is propagated by this דור, Psalm 22:31 : \"They shall come (בּוא as in Psalm 71:18 : to come into being), and shall declare His righteousness to the people that shall be born, that He hath finished.\" Accordingly זרע is the principal notion, which divides itself into (יבאו) דור and עם נולד; from which it is at once clear, why the expression could be thus general, \"a posterity,\" inasmuch as it is defined by what follows. עם נולד is the people which shall be born, or whose birth is near at hand (Psalm 78:6); the lxx well renders it: λαῷ τῷ τεχθησομένῳ (cf. Psalm 102:19 עם נברא populus creandus). צדקתו is the dikaiosu'nee of God, which has become manifest in the rescue of the great sufferer. That He did not suffer him to come down to the very border of death without snatching him out of the way of his murderous foes and raising him to a still greater glory, this was divine צדקה. That He did not snatch him out of the way of his murderous foes without suffering him to be on the point of death - even this wrathful phase of the divine צדקה, is indicated in Psalm 22:16, but then only very remotely. For the fact, that the Servant of God, before spreading the feast accompanying the shelamim (thank-offering) in which He makes the whole world participants in the fruit of His suffering, offered Himself as an asham (sin-offering), does not become a subject of prophetic revelation until later on, and then under other typical relationships. The nature of the עשׂה, which is in accordance with the determinate counsel of God, is only gradually disclosed in the Old Testament. This one word, so full of meaning (as in Psalm 52:11; Psalm 37:5; Isaiah 44:23), implying the carrying through of the work of redemption, which is prefigured in David, comprehends everything within itself. It may be compared to the לעשׂות, Genesis 2:3, at the close of the history of the creation. It is the last word of the Psalm, just as τετέλεσται is the last word of the Crucified One. The substance of the gospel in its preparatory history and its fulfilment, of the declaration concerning God which passes from generation to generation, is this, that God has accomplished what He planned when He anointed the son of Jesse and the Son of David as mediator in His work of redemption; that He accomplished it by leading the former through affliction to the throne, and making the cross to the latter a ladder leading up to heaven. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Formerly we interpreted ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"a seed, which shall serve Him, shall be reckoned to the Lord for a generation;\" taking יספּר as a metaphor applying to the census, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 87:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and לדּור, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 24:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and other passages, as used of a totality of one kind, as זרע of the whole body of those of the same race. But the connection makes it more natural to take דור in a genealogical sense; and, moreover, with the former interpretation it ought to have been לדּור instead of לדּור. We must therefore retain the customary interpretation: \"a seed (posterity) shall serve Him, it shall be told concerning the Lord to the generation (to come).\" Decisive in favour of this interpretation is לדּור with the following יבאוּ, by which דור acquires the meaning of the future generation, exactly as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 71:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", inasmuch as it at once becomes clear, that three generations are distinctly mentioned, viz., that of the fathers who turn unto Jahve, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that of the coming דור, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and עם נולד, to whom the news of the salvation is propagated by this דור, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"They shall come (בּוא as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 71:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : to come into being), and shall declare His righteousness to the people that shall be born, that He hath finished.\" Accordingly זרע is the principal notion, which divides itself into (יבאו) דור and עם נולד; from which it is at once clear, why the expression could be thus general, \"a posterity,\" inasmuch as it is defined by what follows. עם נולד is the people which shall be born, or whose birth is near at hand (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); the lxx well renders it: λαῷ τῷ τεχθησομένῳ (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 102:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " עם נברא populus creandus). צדקתו is the dikaiosu'nee of God, which has become manifest in the rescue of the great sufferer. That He did not suffer him to come down to the very border of death without snatching him out of the way of his murderous foes and raising him to a still greater glory, this was divine צדקה. That He did not snatch him out of the way of his murderous foes without suffering him to be on the point of death - even this wrathful phase of the divine צדקה, is indicated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but then only very remotely. For the fact, that the Servant of God, before spreading the feast accompanying the shelamim (thank-offering) in which He makes the whole world participants in the fruit of His suffering, offered Himself as an asham (sin-offering), does not become a subject of prophetic revelation until later on, and then under other typical relationships. The nature of the עשׂה, which is in accordance with the determinate counsel of God, is only gradually disclosed in the Old Testament. This one word, so full of meaning (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 52:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), implying the carrying through of the work of redemption, which is prefigured in David, comprehends everything within itself. It may be compared to the לעשׂות, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", at the close of the history of the creation. It is the last word of the Psalm, just as τετέλεσται is the last word of the Crucified One. The substance of the gospel in its preparatory history and its fulfilment, of the declaration concerning God which passes from generation to generation, is this, that God has accomplished what He planned when He anointed the son of Jesse and the Son of David as mediator in His work of redemption; that He accomplished it by leading the former through affliction to the throne, and making the cross to the latter a ladder leading up to heaven. ",
            "children": []
          }
        ]
      }
    ]
  }
]