[{"header":"Paul before the Supreme Council"},{"num":23,"verse":"Paul fixed his eyes on the members of the council and said, “My brothers, up to this day I have lived my life before God with a perfectly clear conscience.”"},{"num":2,"verse":"At that moment, Ananias the high priest ordered those standing near Paul to strike him in the mouth."},{"num":3,"verse":"Paul responded, “God is going to strike you, you corrupt pretender! For you sit there judging me according to the law, yet you broke the law when you ordered me to be struck.”"},{"num":4,"verse":"Those standing near Paul said to him, “Do you dare insult the high priest of God?”"},{"num":5,"verse":"Paul answered, “I had no idea, brothers, that he was the high priest. For the Scriptures say, ‘Do not curse the ruler of your people.’ ”"},{"num":6,"verse":"Just then Paul realized that part of the council were Sadducees, who deny the resurrection of the dead, and others were of the separated ones. So he shouted, “My fellow Jews, I am a separated one, and the son of a separated one. That’s why I’m on trial here. It’s because of the hope I have that the dead will rise to live again.”"},{"num":7,"verse":"When he said this, a heated argument started among them, dividing the council between the Sadducees and the separated ones. "},{"num":8,"verse":"Paul knew that the Sadducees teach there is no resurrection and do not believe in angels or spirits, but the separated ones believe in them all. "},{"num":9,"verse":"This sparked an even greater uproar among them."},{"num":10,"verse":"When the shouting match became intense, the commander, fearing they would tear Paul to pieces, intervened and ordered his soldiers to go in to their meeting and seize him and take him back to their headquarters."},{"num":11,"verse":"That night our Lord appeared to Paul and stood before him and said, “Receive miracle power. For just as you have spoken for me in Jerusalem, you will also speak for me in Rome.”"},{"header":"The Plot to Kill Paul"},{"num":12,"verse":"The next day, more than forty Jews formed a conspiracy and bound themselves under an oath to have no food or water until they had killed Paul. "},{"num":14,"verse":"They went to the high priest and the elders to divulge their plans and said to them, “We have united in a solemn oath not to eat or drink until Paul is dead. "},{"num":15,"verse":"So we urge you to have the commander bring him to you as though you were to determine his case with a more thorough inquiry. And we will kill him before he even gets here!”"},{"num":16,"verse":"When Paul’s nephew, his sister’s son, overheard their plot to kill him, he came to the headquarters and informed him of their plans. "},{"num":17,"verse":"Paul called for one of the captains and said, “Take this boy to the commander, for he has something important to report to him.”"},{"num":18,"verse":"The captain took him to the commander and informed him, “Paul the prisoner asked me to bring this boy to you because he has something important for you to know.”"},{"num":19,"verse":"The commander took him by the arm and led him aside in private and asked him, “What do you have to tell me?”"},{"num":20,"verse":"He replied, “The Jews have plotted to kill Paul. Tomorrow they will ask you to bring him again to the supreme council under the pretense of wanting to question him further. "},{"num":21,"verse":"Don’t believe them, because they have forty men lying in wait to ambush Paul. These men have sworn an oath not to eat or drink until they have killed him. They’re all waiting for you to agree to their request so they can carry out their plot.”"},{"num":22,"verse":"The commander dismissed Paul’s nephew after directing him, “Tell no one that you’ve reported these things to me.” "},{"num":23,"verse":"Then he summoned two of his captains and said to them, “I want you to take Paul by horseback to Caesarea tonight at nine o’clock. Dispatch two hundred infantrymen, seventy horsemen, and another two hundred spearmen to provide security and deliver him safely to Governor Felix.” "},{"num":25,"verse":"He sent with them a letter that read:"},{"num":31,"verse":"The soldiers carried out their orders and escorted Paul during the night until they reached the city of Antipatris. "},{"num":32,"verse":"The next day the horsemen continued on with Paul and the rest of the soldiers were dismissed to return to their headquarters."},{"num":33,"verse":"Upon their arrival in Caesarea, they presented the letter to the governor and brought Paul before him. "},{"num":34,"verse":"After reading the letter, he asked Paul what province he was from."},{"num":35,"verse":"The governor said, “I will give you a full hearing when your accusers arrive here also.” Then he ordered that Paul be kept under guard in Herod’s palace."}]