[{"header":"Nathan's Message to David(A)"},{"num":7,"verse":"King David was settled in his palace, and the Lord kept him safe from all his enemies. "},{"num":2,"verse":"Then the king said to the prophet Nathan, “Here I am living in a house built of cedar, but God's Covenant Box is kept in a tent!”"},{"num":3,"verse":"Nathan answered, “Do whatever you have in mind, because the Lord is with you.” "},{"num":4,"verse":"But that night the Lord said to Nathan, "},{"num":5,"verse":"“Go and tell my servant David that I say to him, ‘You are not the one to build a temple for me to live in. "},{"num":6,"verse":"From the time I rescued the people of Israel from Egypt until now, I have never lived in a temple; I have traveled around living in a tent. "},{"num":7,"verse":"In all my traveling with the people of Israel I never asked any of the leaders that I appointed why they had not built me a temple made of cedar.’"},{"num":8,"verse":"“So tell my servant David that I, the Lord Almighty, say to him, ‘I took you from looking after sheep in the fields and made you the ruler of my people Israel. "},{"num":9,"verse":"I have been with you wherever you have gone, and I have defeated all your enemies as you advanced. I will make you as famous as the greatest leaders in the world. "},{"num":10,"verse":"I have chosen a place for my people Israel and have settled them there, where they will live without being oppressed any more. Ever since they entered this land, they have been attacked by violent people, but this will not happen again. I promise to keep you safe from all your enemies and to give you descendants. "},{"num":12,"verse":"When you die and are buried with your ancestors, I will make one of your sons king and will keep his kingdom strong. "},{"num":13,"verse":"He will be the one to build a temple for me, and I will make sure that his dynasty continues forever. "},{"num":14,"verse":"I will be his father, and he will be my son. When he does wrong, I will punish him as a father punishes his son. "},{"num":15,"verse":"But I will not withdraw my support from him as I did from Saul, whom I removed so that you could be king. "},{"num":16,"verse":"You will always have descendants, and I will make your kingdom last forever. Your dynasty will never end.’”"},{"num":17,"verse":"Nathan told David everything that God had revealed to him."},{"header":"David's Prayer of Thanksgiving(E)"},{"num":18,"verse":"Then King David went into the Tent of the Lord's presence, sat down and prayed, “Sovereign Lord, I am not worthy of what you have already done for me, nor is my family. "},{"num":19,"verse":"Yet now you are doing even more, Sovereign Lord; you have made promises about my descendants in the years to come. And you let a man see this, Sovereign Lord! "},{"num":20,"verse":"What more can I say to you! You know me, your servant. "},{"num":21,"verse":"It was your will and purpose to do this; you have done all these great things in order to instruct me. "},{"num":22,"verse":"How great you are, Sovereign Lord! There is none like you; we have always known that you alone are God. "},{"num":23,"verse":"There is no other nation on earth like Israel, whom you rescued from slavery to make them your own people. The great and wonderful things you did for them have spread your fame throughout the world. You drove out other nations and their gods as your people advanced, the people whom you set free from Egypt to be your own. "},{"num":24,"verse":"You have made Israel your own people forever, and you, Lord, have become their God."},{"num":25,"verse":"“And now, Lord God, fulfill for all time the promise you made about me and my descendants, and do what you said you would. "},{"num":26,"verse":"Your fame will be great, and people will forever say, ‘The Lord Almighty is God over Israel.’ And you will preserve my dynasty for all time. "},{"num":27,"verse":"Lord Almighty, God of Israel! I have the courage to pray this prayer to you, because you have revealed all this to me, your servant, and have told me that you will make my descendants kings."},{"num":28,"verse":"“And now, Sovereign Lord, you are God; you always keep your promises, and you have made this wonderful promise to me. "},{"num":29,"verse":"I ask you to bless my descendants so that they will continue to enjoy your favor. You, Sovereign Lord, have promised this, and your blessing will rest on my descendants forever.”"}]