[{"header":"Chapter 7"},{"num":1,"verse":"Defeat at Ai. But the Israelites acted treacherously with regard to the ban; Achan, son of Carmi, son of Zabdi, son of Zerah of the tribe of Judah, took goods that were under the ban, and the anger of the Lord flared up against the Israelites."},{"num":2,"verse":"Joshua next sent men from Jericho to Ai, which is near Beth-aven and east of Bethel, with the order, “Go up and reconnoiter the land.” When they had explored Ai, "},{"num":3,"verse":"they returned to Joshua and advised, “Do not send all the people up; if only about two or three thousand go up, they can attack and overcome Ai. You need not tire all the people: the enemy there are few.” "},{"num":4,"verse":"About three thousand of the people made the attack, but they fled before the army at Ai, "},{"num":5,"verse":"who killed some thirty-six of them. They pursued them from the city gate to the Shebarim, and defeated them on the descent, so that the confidence of the people melted away like water."},{"num":6,"verse":"Joshua, together with the elders of Israel, tore their garments and fell face down before the ark of the Lord until evening; and they threw dust on their heads. "},{"num":7,"verse":"“Alas, Lord God,” Joshua prayed, “why did you ever allow this people to cross over the Jordan, delivering us into the power of the Amorites, that they might destroy us? Would that we had been content to dwell on the other side of the Jordan. "},{"num":8,"verse":"Please, Lord, what can I say, now that Israel has turned its back to its enemies? "},{"num":9,"verse":"When the Canaanites and the other inhabitants of the land hear of it, they will close in around us and efface our name from the earth. What will you do for your great name?”"},{"num":10,"verse":"The Lord replied to Joshua: Stand up. Why are you lying there? "},{"num":11,"verse":"Israel has sinned: they have transgressed the covenant which I enjoined on them. They have taken goods subject to the ban. They have stolen and lied, placing the goods in their baggage. "},{"num":12,"verse":"If the Israelites cannot stand up to their enemies, but must turn their back to them, it is because they are under the ban. I will not continue to be with you unless you remove that which is banned from among you. "},{"num":13,"verse":"Get up, sanctify the people. Tell them, “Sanctify yourselves before tomorrow, for thus says the Lord, the God of Israel: That which is banned is in your midst, Israel. You cannot stand up to your enemies until you remove it from among you. "},{"num":14,"verse":"In the morning you must come forward by tribes. The tribe which the Lord designates shall come forward by clans; the clan which the Lord designates shall come forward by families; the family which the Lord designates shall come forward one by one. "},{"num":15,"verse":"Whoever is designated as having incurred the ban shall be destroyed by fire, with all that is his, because he has trangressed the covenant of the Lord and has committed a shameful crime in Israel.”"},{"num":16,"verse":"Achan’s Guilt and Punishment. Early the next morning Joshua had Israel come forward by tribes, and the tribe of Judah was designated. "},{"num":17,"verse":"Then he had the clans of Judah come forward, and the clan of Zerah was designated. He had the clan of Zerah come forward by families, and Zabdi was designated. "},{"num":18,"verse":"Finally he had that family come forward one by one, and Achan, son of Carmi, son of Zabdi, son of Zerah of the tribe of Judah, was designated. "},{"num":19,"verse":"Joshua said to Achan, “My son, give glory to the Lord, the God of Israel, and praise him by telling me what you have done; do not hide it from me.” "},{"num":20,"verse":"Achan answered Joshua, “I have indeed sinned against the Lord, the God of Israel. This is what I have done: "},{"num":21,"verse":"Among the spoils, I saw a beautiful Babylonian mantle, two hundred shekels of silver, and a bar of gold fifty shekels in weight; I coveted them and I took them. They are now hidden in the ground inside my tent, with the silver underneath.” "},{"num":22,"verse":"Joshua sent messengers and they ran to the tent and there they were, hidden in the tent, with the silver underneath. "},{"num":23,"verse":"They took them from the tent, brought them to Joshua and all the Israelites, and spread them out before the Lord."},{"num":24,"verse":"Then Joshua and all Israel took Achan, son of Zerah, with the silver, the mantle, and the bar of gold, and with his sons and daughters, his ox, his donkey and his sheep, his tent, and all his possessions, and led them off to the Valley of Achor. "},{"num":25,"verse":"Joshua said, “What misery have you caused us? May the Lord bring misery upon you today!” And all Israel stoned him to death. They burnt them with fire and they stoned them. "},{"num":26,"verse":"Over Achan they piled a great heap of stones, which remains to the present day. Then the Lord turned from his anger. That is why the place is called the Valley of Achor to this day."}]