[{"header":"Achan Sins Against the Lord"},{"num":7,"verse":"But the Israelites weren’t faithful to the Lord. They didn’t destroy what had been set apart to him. So they did not do what they had been told to do. Achan had taken some of those things. So the Lord became very angry with Israel. Achan was the son of Karmi. Karmi was the son of Zimri. And Zimri was the son of Zerah. Achan and all his relatives were from the tribe of Judah."},{"num":2,"verse":"Joshua sent men from Jericho to Ai. Ai is near Beth Aven east of Bethel. Joshua told the men, “Go up and check out the area around Ai.” So the men went up and checked it out."},{"num":3,"verse":"Then they returned to Joshua. They said, “The whole army doesn’t have to go up and attack Ai. Send only two or three thousand men. They can take the city. Don’t make the whole army go up there. Only a few people live in Ai.” "},{"num":4,"verse":"So only about 3,000 troops went up. But the men of Ai drove them away. "},{"num":5,"verse":"They chased the Israelites from the city gate all the way to Shebarim. They killed about 36 of them on the way down. So the Israelites were terrified."},{"num":6,"verse":"Joshua and the elders of Israel became sad. Joshua tore his clothes. He fell in front of the ark of the Lord with his face to the ground. He remained there until evening. The elders did the same thing. They also sprinkled dust on their heads. "},{"num":7,"verse":"Joshua said, “Lord and King, why did you ever bring these people across the Jordan River? Did you want to hand us over to the Amorites? Did you want them to destroy us? I wish we had been content to stay on the other side of the Jordan! "},{"num":8,"verse":"Lord, our enemies have driven us away. What can I say? "},{"num":9,"verse":"The Canaanites will hear about it. So will everyone else in the country. They will surround us. They’ll erase any mention of our name from the face of the earth. Then what will you do when people don’t honor your great name anymore?”"},{"num":10,"verse":"The Lord said to Joshua, “Get up! What are you doing down there on your face? "},{"num":11,"verse":"Israel has sinned. I made a covenant with them. I commanded them to keep it. But they have broken it. They have taken some of the things that had been set apart to me in a special way to be destroyed. They have stolen. They have lied. They have taken the things they stole and have put them with their own things. "},{"num":12,"verse":"That is why the Israelites can’t stand up against their enemies. They turn their backs and run. That’s because I have decided to let them be destroyed. You must destroy the things you took that had been set apart to me. If you do not, I will not be with you anymore."},{"num":13,"verse":"“Go and set the people apart. Tell them, ‘Make yourselves pure. Get ready for tomorrow. Here is what the Lord, the God of Israel, wants you to do. He says, “People of Israel, you have kept some of the things that had been set apart to me to be destroyed. You can’t stand up against your enemies until you get rid of those things.”"},{"num":14,"verse":"“ ‘In the morning, come forward tribe by tribe. The tribe the Lord chooses will come forward group by group. The group the Lord chooses will come forward family by family. And the men in the family the Lord chooses will come forward one by one. "},{"num":15,"verse":"Whoever is caught with the things that had been set apart to the Lord will be destroyed by fire. Everything that belongs to that person will also be destroyed. He has broken the Lord’s covenant. He has done a very terrible thing in Israel!’ ”"},{"num":16,"verse":"Early the next morning Joshua had Israel come forward by tribes. The tribe of Judah was chosen. "},{"num":17,"verse":"The groups of Judah came forward. The group of Zerah was chosen. Joshua had the group of Zerah come forward by families. The family of Zimri was chosen. "},{"num":18,"verse":"He had their men come forward one by one. Achan was chosen. Achan was the son of Karmi. Karmi was the son of Zimri. And Zimri was the son of Zerah. Zerah was from the tribe of Judah."},{"num":19,"verse":"Joshua said to Achan, “My son, the Lord is the God of Israel. So give him glory and honor him by telling the truth! Tell me what you have done. Don’t hide it from me.”"},{"num":20,"verse":"Achan replied, “It’s true! I’ve sinned against the Lord, the God of Israel. Here is what I’ve done. "},{"num":21,"verse":"I saw a beautiful robe from Babylonia among the things we had taken. I saw five pounds of silver. And I saw a gold bar that weighed 20 ounces. I wanted them, so I took them. I hid them in the ground inside my tent. The silver is on the bottom.”"},{"num":22,"verse":"So Joshua sent some messengers. They ran to Achan’s tent. And there was everything, hidden in his tent! The silver was on the bottom. "},{"num":23,"verse":"They brought the things out of the tent. They took them to Joshua and all the Israelites. And they spread them out in the sight of the Lord."},{"num":24,"verse":"Then Joshua and all the people grabbed Achan, the son of Zerah. They took the silver, the robe and the gold bar. They took Achan’s sons and daughters. They took his cattle, donkeys and sheep. They also took his tent and everything he had. They carried all of it out to the Valley of Achor. "},{"num":25,"verse":"Joshua said to Achan, “Why have you brought this trouble on us? The Lord will bring trouble on you today.”"},{"num":26,"verse":"They placed a large pile of rocks on top of Achan’s body. The place has been called the Valley of Achor ever since. That pile is still there to this day. After the people killed Achan, the Lord was no longer angry with them."}]