[{"num":7,"verse":"Forsooth the sons of Israel brake the commandment, and mis-took of the cursed thing; for Achan, the son of Carmi, the son of Zabdi, [the] son of Zerah, of the lineage of Judah, took something of the cursed thing; and the Lord was wroth against the sons of Israel. (But one of the Israelites disobeyed the Lord’s command, and took some of the cursed things; for Achan, the son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, took some of the cursed things; and so the Lord was angry with the Israelites.)"},{"num":2,"verse":"And when Joshua sent men from Jericho against Ai, which is beside Bethaven, at the east coast of the city of Bethel, he said to them, Go ye up, and espy the land. Which [ful]filled the commandments, and espied Ai; (And when Joshua sent men from Jericho to Ai, which is beside Bethaven, to the east of the city of Bethel, he said to them, Go ye up, and spy out the land. And they fulfilled his commands, and spied out Ai;)"},{"num":3,"verse":"and they turned again, and said to him, All the people go not up thither, but two either three thousand of men go, and do away the city (and they returned, and said to him, All the people do not need to go up there, but only two or three thousand men need to go, and do away the city); why shall all the people be travailed in vain against (such) full few enemies?"},{"num":4,"verse":"Therefore three thousand of fighters ascended, which turned the backs anon, and were smitten of the men of Ai; (And so three thousand fighting men went up, who at once turned their backs, after they were attacked by the men of Ai;)"},{"num":5,"verse":"and six and thirty men of them were slain; and the adversaries pursued them from the (city) gate unto Shebarim; and they felled down fleeing by (the) low places. And the heart of the people dreaded much, and it was made unsteadfast at the likeness of water (And the people’s hearts were full of fear, and they were made as unstable as water)."},{"num":6,"verse":"And Joshua rent his clothes, and he fell down low to the earth before the ark of the Lord, unto the eventide, as well he, as all the elder men of Israel; and they casted powder on their heads. (And Joshua tore his clothes, and he fell down onto the ground before the Ark of the Lord, until the evening, he, as well as all the elders of Israel; and they threw powder on their heads.)"},{"num":7,"verse":"And Joshua said, Alas! alas! Lord God, what wouldest thou lead this people over the flood Jordan, that thou shouldest betake us in the hand of Amorites, and should lose us? I would, that as we began, we had dwelled beyond (the) Jordan. (And Joshua said, Alas! alas! Lord God, why didest thou lead this people over the Jordan River, so that thou couldest deliver us into the hands of the Amorites, and so destroy us? Oh how I wish, that we had stayed on the other side of the Jordan!)"},{"num":8,"verse":"My Lord God, what shall I say, seeing Israel turning the backs to his enemies? (My Lord God, what can I say, after seeing the men of Israel turn their backs to their enemies?)"},{"num":9,"verse":"Canaanites, and all the dwellers of the land shall hear this, and they shall be gathered together, and shall compass us, and they shall do away our name from [the] earth; and what shalt thou do to thy great name? (The Canaanites, and all the inhabitants of this land, shall hear of this, and they shall be gathered together, and shall surround us, and they shall do away our names from the earth; and then what shalt thou do for thy great name?)"},{"num":10,"verse":"And the Lord said to Joshua, Rise thou up; why liest thou low in the earth? (why liest thou there on the ground?)"},{"num":11,"verse":"Israel hath sinned, and hath broken my covenant; they have taken of the cursed thing(s), and they have stolen of it, and lied, and hid among their vessels. (Someone in Israel hath sinned, and hath broken my covenant; he hath taken some of the cursed things, yea, he hath stolen it, and lied about it, and hid it among his own possessions.)"},{"num":12,"verse":"And therefore Israel may not stand before his enemies, and he shall flee them, for it is defouled with cursing; I shall no more be with you, till that ye destroy him that is guilty of this trespass. (And so the men of Israel cannot stand before their enemies, and they shall flee from them, for they be defiled with curses; I shall no longer be with you, unless and until ye destroy him who is guilty of this trespass.)"},{"num":13,"verse":"Rise thou (up), hallow the people, and say thou to them, Be ye hallowed against tomorrow (Hallow thyselves for tomorrow); for the Lord God of Israel saith these things, O thou Israel! cursing is in the midst of thee; thou shalt not be able to stand before thine enemies, till he that is defouled by this trespass, be done away from thee."},{"num":14,"verse":"And ye shall come (forth) early, all men by your lineages; and whatever lineage the lot shall find, it shall come by his families (it shall come by its families); and the family shall come by (its) houses, and the house shall come by (its) men."},{"num":15,"verse":"And whoever shall be taken with this trespass, he shall be burnt with fire with all his chattel, for he brake the covenant of the Lord, and did unleaveful thing in Israel. (And whoever shall be taken with this trespass, he shall be burned with fire along with all his possessions, for he broke the covenant of the Lord, and did an unlawful thing in Israel.)"},{"num":16,"verse":"Therefore Joshua rose early, and setted in order Israel by his lineages; and the lineage of Judah was found; (And so Joshua rose up early, and put Israel in order, tribe by tribe; and the tribe of Judah was found;)"},{"num":17,"verse":"and when that lineage was brought forth by his families, the family of Zerah was found. And Joshua brought forth it by men, either houses, and found Zabdi; (and when that tribe was brought forth by its families, the family of Zerah was found. And Joshua brought forth that family by its men, or its households, and found Zabdi;)"},{"num":18,"verse":"whose house he parted into all men by themselves; and he found Achan, the son of Carmi, [the] son of Zabdi, [the] son of Zerah, of the lineage of Judah."},{"num":19,"verse":"And Joshua said to Achan, My son, give thou glory to the Lord God of Israel, and acknowledge thou, and show to me what thou hast done; hide thou it not."},{"num":20,"verse":"And Achan answered to Joshua, and said to him, Verily (Truly), I have sinned before the Lord God of Israel, and I have done thus and thus;"},{"num":21,"verse":"for among the spoils I saw a red mantle full good, and two hundred shekels of silver, and a golden rule of fifty shekels; and I coveted those, and took away, and I hid those in the earth, against the midst of my tabernacle; and I covered the silver with the earth delved. (for among the spoils I saw a fine red mantle, and two hundred shekels of silver, and a gold bar weighing fifty shekels; and I coveted them, and took them away, and I hid them in a hole in the ground, in the middle of my tent; and I put the silver underneath it all.)"},{"num":22,"verse":"Then Joshua sent servants, the which ran to his tabernacle, and found all these things hid in the same place, and the silver together; (Then Joshua sent some servants, who ran to his tent, and found all these things hidden there, and the silver underneath it all;)"},{"num":23,"verse":"and they took these things away from the tent, and they brought them to Joshua, and to all the sons of Israel (and to all the Israelites); and they casted them forth before the Lord."},{"num":24,"verse":"Then Joshua took Achan, the son of Zerah, and the silver, and the mantle, and the golden rule, and his sons, and daughters, his oxen, asses, and sheep, and the tabernacle itself, and all the purtenance of his household; and all Israel with Joshua; and they led them to the valley of Achor; (Then Joshua took Achan, the son of Zerah, and the silver, and the mantle, and the gold bar, and his sons, and daughters, and his oxen, and donkeys, and sheep, and the tent itself, and all the purtenance of his household; and all Israel went with Joshua; and they led them to the valley of Achor;)"},{"num":25,"verse":"where Joshua said, For thou hast troubled us, the Lord shall full out trouble thee in this day. And all Israel stoned him; and all things that were his, were wasted by fire. (where Joshua said, For thou hast brought forth trouble upon us, the Lord shall now bring trouble upon thee. And then all Israel stoned him; and all his things were destroyed by fire.)"},{"num":26,"verse":"And they gathered upon him a great heap of stones, the which abide there still into this day. And the strong vengeance of the Lord was turned away from Israel; and the name of that place is called the valley of Achor unto this day."}]