[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But now the Lord hath spoken . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The point of contrast seems to lie in the vaguer character of what had gone before, and the specific defined prediction that follows. “Within three years,” measured with the exactness of the hired labourer, who will not give more than he has contracted for, and of the employer, who will not take less. The same phrase meets us in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 21:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The glory of Moab shall be contemned.—We may infer from the fact that the prophecy was recorded when the writings of Isaiah were collected. whether by himself or another, that men looked on it as an instance of his prevision. History is, indeed, silent as to the manner of its fulfilment. It was probable, however, that the armies of Salmaneser or Sargon swept, as those of Pul and Tiglath-pileser had done (1Chronicles 5:26), over the region east of the Jordan, and so invaded Moab. (See Note on Isaiah 17:1.) We note that here also there was to be a “remnant,” but not like that of Israel, the germ of a renewed strength.Matthew Henry's Concise Commentary16:6-14 Those who will not be counselled, cannot be helped. More souls are ruined by pride than by any other sin whatever. Also, the very proud are commonly very passionate. With lies many seek to gain the gratification of pride and passion, but they shall not compass proud and angry projects. Moab was famous for fields and vineyards; but they shall be laid waste by the invading army. God can soon turn laughter into mourning, and joy into heaviness. In God let us always rejoice with holy triumph; in earthly things let us always rejoice with holy trembling. The prophet looks with concern on the desolations of such a pleasant country; it causes inward grief. The false gods of Moab are unable to help; and the God of Israel, the only true God, can and will make good what he has spoken. Let Moab know her ruin is very near, and prepare. The most awful declarations of Divine wrath, discover the way of escape to those who take warning. There is no escape, but by submission to the Son of David, and devoting ourselves to him. And, at length, when the appointed time comes, all the glory, prosperity, and multitude of the wicked shall perish.Barnes' Notes on the BibleBut now the Lord hath spoken - This refers to the particular and specific prophecy of Isaiah that destruction should come upon them in three years. Instead of a \"general but indefinite\" prediction of calamity to the Moabites, such as had been uttered by the former prophets, or by Isaiah himself before, it was now specific and definite in regard to the \"time\" when it should be fulfilled.Within three years - We have no means of ascertaining the exact fulfillment of this prediction, nor do we certainly know by whom it was accomplished.As the years of an hireling - A man that is hired has a certain time specified during which he is to labor; the years, the months, the days for which he is engaged are agreed on, nor will he suffer any addition to be made to it. So the prophet says that the very time is fixed. It shall not be varied. It will be adhered to by God - as the time is adhered to between a man who employs another and him who is hired. And it means, that \"exactly at the time\" which is here specified, the predicted destruction should come upon Moab.The glory of Moab - That in which it glories, or boasts - its wealth, its armies, its cities, towns, etc.Shall be contemned - Shall be esteemed of no value; shall be destroyed.And the remnant - There shall be few cities, few people, and very little wealth that shall escape the desolation (compare Isaiah 10:25; Isaiah 24:6). Jerome says that 'this prophecy was delivered after the death of Ahaz, and in the reign of Hezekiah, during whose reign the ten tribes were led by Sennacherib, king of the Assyrians, into captivity. And, therefore, after three years, the Assyrians came and destroyed Moab, and very few were left in the land who could inhabit the deserted cities, or cultivate the desolate fields.' But it is not certainly known to what particular time the prophecy refers. In regard to the present state of Moab, and the complete fulfillment of the prophecies respecting it, the following works may be consulted: Newton, \"On the Prophecies;\" Keith, \"On the Prophecies;\" Burckhardt's \"Travels in Syria;\" and Captains Irby and Mangles' \"Travels.\" In regard to the fulfillment of these predictions respecting the destruction of Moab, it may be sufficient to refer to the remarks which I have made on the particular places which are mentioned in these two chapters, and to the writers mentioned above.All travelers concur in the general desolation of that country which was once so thickly studded with towns, and that abounded so richly in flocks, and produced so luxuriantly the grape. It is now strewed with ruins. All the cities of Moab have disappeared. Their place is characterized in the map of Volney's \"Travels, by the ruins of towns.\" Burckhardt, who encountered many difficulties in so desolate and dangerous a land, thus records the brief history of a few of them: 'The ruins of Eleale, Heshbon, Meon, Medaba, Dibon, Arver, all situated on the north side of the Arnon, still subsist to illustrate the history of the Beni-Israel' (\"Life and Travels,\" prefixed to the \"Travel's in Nubia,\" pp. 48, 49). 'And it might be added,' says Keith, 'that they still subsist to confirm the inspiration of the Jewish Scriptures, for the desolation of each of these cities was the theme of a distinct prediction' (\"Prophecies,\" p. 129). Within the boundaries of Moab, Burckhardt enumerates about \"fifty\" ruined cities, many of them extensive. In general they are a broken down and undistinguishable mass of ruins; but, in some instances, there are remains of temples, sepulchral monuments, traces of hanging gardens, entire columns lying on the ground, and dilapidated walls made of stones of large dimensions (see \"Travels in Syria,\" pp. 311-456).In view of these two chapters, constituting one prophecy, and the facts in regard to the present state of the country of Moab, we may observe that we have here clear and unanswerable evidence of the genuineness and truth of the sacred records. That evidence is found in the \"particularity\" with which \"places\" are mentioned; and in the fact that impostors would not \"specify\" places, any further than was unavoidable. Mistakes, we all know, are liable to be made by those who attempt to describe the \"geography\" of places which they have not seen. Yet here is a description of a land and its numerous towns, made nearly three thousand years ago, and in its \"particulars\" it is sustained by all the travelers in modern times. The ruins of the same towns are still seen; their places, in general, can be designated; and there is a moral certainty, therefore, that this prophecy was made by one who \"knew\" the locality of those places, and that, therefore, the prophecy is ancient and genuine.An impostor would never have attempted such a description as this; nor could he have made it so accurate and true. In the language of Prof. Stuart (\"Bib. Rep.,\" vol. vii. pp. 108, 109), we may say, 'How obviously everything of this kind serves to give confirmation to the authority and credibility of the sacred records! Do sceptics undertake to scoff at the Bible, and aver that it is the work of impostors who lived in later ages? Besides asking them what \"object\" impostors could have in forging a book of such high and lofty principles, we may ask - and ask with an assurance that need not fear the danger of being put to the blush - whether impostors of later ages could possibly have so managed, as to preserve all the \"localities\" in complete order which the Scriptures present? Rare impostors they must indeed have been - people possessed of more knowledge of antiquity than we can well imagine could ever be possessed by such as would condescend to an imposition of such a character. In fact the thing appears to be morally impossible, if one considers it in the light of \"antiquity,\" when so little knowledge of a geographical kind was in existence, and when mistakes respecting countries and places with which one was not personally familiar, were almost, if not altogether, unavoidable.'How happens it, now, that the authors of the Old Testament Scriptures should have possessed such a wonderful tact in geography, as it would seem they did, unless they lived at the time and in the countries of which they have spoken? This happens not elsewhere. It is but yesterday since one of the first scientific writers on geology in Great Britain, published to the world the declaration that our Mississippi and Missouri rivers \"belong to the tropics.\" Respectable writers, even in Germany, the land of Classical attainments, have sometimes placed Coelo-Syria on the east of the Anti-Libanus ridge, or even seemed to transfer Damascus over the mountains, and place it between the two Lebanon ridges in the valley.' No such mistakes occur in the sacred writers. They write as people who were familiar with the geography of places named; they mention places with the utmost familiarity; and, after a lapse of three thousand years, every successive traveler who visits Moab, Idumea, or Palestine, does something to confirm the accuracy of Isaiah. Towns, bearing the same name, or the ruins of towns, are located in the same relative position in which he said they were; and the ruins of once splendid cities, broken columns, dilapidated walls, trodden down vineyards, and half-demolished temples, proclaim to the world that those cities are what he said they would be, and that he was under the inspiration of God. Jamieson-Fausset-Brown Bible Commentary14. three years … hireling—Just as a hireling has his fixed term of engagement, which neither he nor his master will allow to be added to or to be taken from, so the limit within which Moab is to fall is unalterably fixed (Isa 21:16). Fulfilled about the time when the Assyrians led Israel into captivity. The ruins of Elealeh, Heshbon, Medeba, Dibon, &c., still exist to confirm the inspiration of Scripture. The accurate particularity of specification of the places three thousand years ago, confirmed by modern research, is a strong testimony to the truth of prophecy.   Matthew Poole's Commentary Hath spoken;  hath made this further discovery of his mind to me. Within three years;  to be computed either, 1. From the time of Jerusalem’s destruction by Nebuchadnezzar, who did, as is confessed by all, invade the Moabites at or about that time, and execute the judgment first foretold by this prophet, and afterwards by Jeremiah 48. Or rather, 2. From the time of the delivery of this prophecy; which being uncertain, leaves us the greater latitude for the determination of the precise time when this was fulfilled. But this is certain, from Isaiah 1:1, that this prophecy must be delivered, at furthest, before the end of Hezekiah’s reign. And then there ariseth this great difficulty, How this can consist with the prophecy of Jeremiah, who above or about a hundred years after this time speaketh of Moab as a people that had been at ease from their youth, and had not gone into captivity, Jeremiah 48:11, and prophesieth against them in the very same words which Isaiah useth in this prophecy? The answer is, That they do not speak of the same time, nor of the same calamity; but Isaiah of a former tribulation, and Jeremiah of their latter devastation. It is true, Jeremiah useth the same words which Isaiah doth, and so do the later prophets sometimes use the words of the former, to other purposes than they were first delivered, as we shall see hereafter, and as is most evident from the Revelation of St. John, in which the same words are used concerning mystical Babylon. which were used by the foregoing prophets concerning the first and literal Babylon. And although the foregoing prophecy of Isaiah seems to speak of the same destruction threatened by Jeremiah, and inflicted by Nebuchadnezzar; yet this prophecy contained in this verse, and ushered in with another preface, seems to be of a differing nature, and to speak of a more speedy and less grievous affliction that should befall them, which should be as a pledge to assure them of the certain accomplishment of the other prophecy, and of their utter destruction. And therefore it is observable, that the prophet doth not here say, Within three years all that I have foretold and threatened shall be fulfilled; but only, the glory of Moab shall be contemned, & c., which is quite another thing; and as the terms here used are much milder, so that; judgment here denounced seems much less, than in the foregoing prophecy. And therefore this verse may very well be understood of some great blow given to the Moabites, either by Sennacherib, or by his son Esarhaddon, from which notwithstanding they in a little time recovered themselves, and flourished again, and continued so to do till Nebuchadnezzar completed their destruction. And this may well enough consist with what is said of Moab’s being at ease from his youth, Jeremiah 48:11, which is not to be understood simply, as if they had been wholly free from war and other calamities; for the contrary is evident, both from Scripture, as 2 Samuel 8:2 2 Kings 3:24,25, and from other histories; but comparatively, that they had not been brought to desolation, nor carried away into captivity, as it is explained in the following words, and as Israel had been at that time, and Judah was threatened to be. As the years of an hireling,  i.e. within three years precisely accounted; for hirelings are very punctual in observing the time for which they are hired; and their thoughts and desires run much upon it, because then they are to receive their wages; of which see Job 7:1,2 14:6. And this exposition is confirmed by comparing this place with Isaiah 21:16, where the same phrase is used of one year. So groundless is that opinion which the Jewish writers gather from this place, compared with Deu 15:18, that three years was the usual and appointed time for the generality of hired servants. The glory of Moab;  their strength, and wealth, and other things in which they glory. Shall be contemned;  shall be made contemptible to those who formerly admired them. With all that great multitude;  with the great numbers of their people, of which they boasted. Shall be very small and feeble,  comparatively to what they were before; which might be very true, and yet afterwards, in a hundred years’ space, they might be sufficiently recruited. Gill's Exposition of the Entire BibleBut now the Lord hath spoken,.... Something else. What follows is a distinct prophecy from the former, and has a date annexed to it, when it should be fulfilled: the former prophecy relates to the utter destruction of the Moabites by the Babylonians, in the times of Nebuchadnezzar; of which Jeremiah, Jeremiah 48:1 prophesies, in much the same language as Isaiah; and so Jarchi observes, that the final destruction of Moab was by the hand of Nebuchadnezzar: but this was of a lesser nature, and to be accomplished in a short time, either by Shalmaneser, or by Sennacherib king of Assyria, or Esarhaddon his son: saying, within three years, as the year of an hireling; that is, precisely and exactly three years, neither more nor fewer, neither sooner nor later; as whatever time is agreed upon by an hireling, as soon as ever it is out, which he often thinks of, and counts exactly, he demands his wages, and his freedom. Some think this prophecy bears date with the former, concerning the Philistines, which was the year King Ahaz died, Isaiah 14:28 and so had its accomplishment in the fourth year of Hezekiah, when Shalmaneser came up against Samaria (k), and took Moab in his way, 2 Kings 18:9 others, that it was given out in the fourth year of Hezekiah, when the Assyrian besieged Samaria, and after three years took it, and then returned and fell upon the Moabites; others place it in the eleventh year of Hezekiah, and suppose it to be fulfilled in his fourteenth by Sennacherib, about the same time he came up and took the fenced cities of Judah, and besieged Jerusalem, 2 Kings 18:13 and with this agree the Jewish writers (l), whose words are these, \"after those things, and the establishment thereof, Sennacherib king of Assyria came into Judah, 2 Chronicles 32:1 and at the same time sent Tartan to Ashdod, Isaiah 20:1 who overran the Ammonites and Moabites, who helped him when he besieged Samaria three years, that it might be fulfilled what is said, Isaiah 16:14 at the same time the king of Assyria sent Rabshakeh from Lachish to Jerusalem.'' Upon which Kimchi observes, as an interpretation of the phrase, \"as the years of an hireling\", \"it is as if it was said, because they helped the king of Assyria three years against Samaria, it was as if they had been hired; therefore they fell by his hand, and the glory of Moab was light in the hand of the king of Assyria.'' But others make it to be three years after this time; but very likely it might be later still, about the eighteenth or nineteenth year of Hezekiah, as Gataker thinks, who, in his notes on this place, has collected all these senses, and made his observations on them; and so had its accomplishment in some expedition of Esarhaddon, who greatly weakened and impoverished the country of Moab, though he did not destroy it, and which was an earnest and pledge of the utter destruction of it before prophesied of. Noldius renders it, \"after three years\"; and so Grotius: it was in the first year of Hezekiah, as Noldius observes, that this was said; and in the fourth year of his reign, Shalmaneser came against Samaria, and in his way was the beginning of this destruction, and but a beginning of it, as he observes, yet a pledge of the consummation by Nebuchadnezzar, which was long after these three years of Isaiah. And the glory of Moab shall be contemned with all that great multitude; of cities and towns, of the inhabitants of them, and of wealth and riches, things in which Moab gloried, and were reckoned weighty and heavy things; these were accounted light by the king of Assyria, who spoiled them, or at least greatly diminished them: and the remnant shall be very small and feeble; or, \"not mighty\" or \"strong\"; those that were not cut off by the Assyrian army would be but few, and these weak and without strength, being dispossessed of their cities, and of their wealth; though, in process of time, between this, and the fulfilment of the former prophecy, and that of Jeremiah, they recovered themselves, and became very numerous and flourishing. (k) See Prideaux's Connect. par. 1. B. 1. p. 18. So Vitringa. (l) Seder Olam Rabba, c. 23. p. 64. Geneva Study BibleBut now the LORD hath spoken, saying, {o} Within three years, as the years of an {p} hireling, and the glory of Moab shall be despised, with all that great multitude; and the remnant shall be very small and feeble.(o) He appointed a certain time to punish the enemies in.(p) Who will observe justly the time for which he is hired and serve no longer but will ever long for it.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "The glory of Moab shall be contemned.—We may infer from the fact that the prophecy was recorded when the writings of Isaiah were collected. whether by himself or another, that men looked on it as an instance of his prevision. History is, indeed, silent as to the manner of its fulfilment. It was probable, however, that the armies of Salmaneser or Sargon swept, as those of Pul and Tiglath-pileser had done (1Chronicles 5:26), over the region east of the Jordan, and so invaded Moab. (See Note on Isaiah 17:1.) We note that here also there was to be a “remnant,” but not like that of Israel, the germ of a renewed strength.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "16:6-14 Those who will not be counselled, cannot be helped. More souls are ruined by pride than by any other sin whatever. Also, the very proud are commonly very passionate. With lies many seek to gain the gratification of pride and passion, but they shall not compass proud and angry projects. Moab was famous for fields and vineyards; but they shall be laid waste by the invading army. God can soon turn laughter into mourning, and joy into heaviness. In God let us always rejoice with holy triumph; in earthly things let us always rejoice with holy trembling. The prophet looks with concern on the desolations of such a pleasant country; it causes inward grief. The false gods of Moab are unable to help; and the God of Israel, the only true God, can and will make good what he has spoken. Let Moab know her ruin is very near, and prepare. The most awful declarations of Divine wrath, discover the way of escape to those who take warning. There is no escape, but by submission to the Son of David, and devoting ourselves to him. And, at length, when the appointed time comes, all the glory, prosperity, and multitude of the wicked shall perish.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "But now the Lord hath spoken - This refers to the particular and specific prophecy of Isaiah that destruction should come upon them in three years. Instead of a \"general but indefinite\" prediction of calamity to the Moabites, such as had been uttered by the former prophets, or by Isaiah himself before, it was now specific and definite in regard to the \"time\" when it should be fulfilled.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Within three years - We have no means of ascertaining the exact fulfillment of this prediction, nor do we certainly know by whom it was accomplished.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "As the years of an hireling - A man that is hired has a certain time specified during which he is to labor; the years, the months, the days for which he is engaged are agreed on, nor will he suffer any addition to be made to it. So the prophet says that the very time is fixed. It shall not be varied. It will be adhered to by God - as the time is adhered to between a man who employs another and him who is hired. And it means, that \"exactly at the time\" which is here specified, the predicted destruction should come upon Moab.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "The glory of Moab - That in which it glories, or boasts - its wealth, its armies, its cities, towns, etc.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Shall be contemned - Shall be esteemed of no value; shall be destroyed.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "And the remnant - There shall be few cities, few people, and very little wealth that shall escape the desolation (compare Isaiah 10:25; Isaiah 24:6). Jerome says that 'this prophecy was delivered after the death of Ahaz, and in the reign of Hezekiah, during whose reign the ten tribes were led by Sennacherib, king of the Assyrians, into captivity. And, therefore, after three years, the Assyrians came and destroyed Moab, and very few were left in the land who could inhabit the deserted cities, or cultivate the desolate fields.' But it is not certainly known to what particular time the prophecy refers. In regard to the present state of Moab, and the complete fulfillment of the prophecies respecting it, the following works may be consulted: Newton, \"On the Prophecies;\" Keith, \"On the Prophecies;\" Burckhardt's \"Travels in Syria;\" and Captains Irby and Mangles' \"Travels.\" In regard to the fulfillment of these predictions respecting the destruction of Moab, it may be sufficient to refer to the remarks which I have made on the particular places which are mentioned in these two chapters, and to the writers mentioned above.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "All travelers concur in the general desolation of that country which was once so thickly studded with towns, and that abounded so richly in flocks, and produced so luxuriantly the grape. It is now strewed with ruins. All the cities of Moab have disappeared. Their place is characterized in the map of Volney's \"Travels, by the ruins of towns.\" Burckhardt, who encountered many difficulties in so desolate and dangerous a land, thus records the brief history of a few of them: 'The ruins of Eleale, Heshbon, Meon, Medaba, Dibon, Arver, all situated on the north side of the Arnon, still subsist to illustrate the history of the Beni-Israel' (\"Life and Travels,\" prefixed to the \"Travel's in Nubia,\" pp. 48, 49). 'And it might be added,' says Keith, 'that they still subsist to confirm the inspiration of the Jewish Scriptures, for the desolation of each of these cities was the theme of a distinct prediction' (\"Prophecies,\" p. 129). Within the boundaries of Moab, Burckhardt enumerates about \"fifty\" ruined cities, many of them extensive. In general they are a broken down and undistinguishable mass of ruins; but, in some instances, there are remains of temples, sepulchral monuments, traces of hanging gardens, entire columns lying on the ground, and dilapidated walls made of stones of large dimensions (see \"Travels in Syria,\" pp. 311-456).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "In view of these two chapters, constituting one prophecy, and the facts in regard to the present state of the country of Moab, we may observe that we have here clear and unanswerable evidence of the genuineness and truth of the sacred records. That evidence is found in the \"particularity\" with which \"places\" are mentioned; and in the fact that impostors would not \"specify\" places, any further than was unavoidable. Mistakes, we all know, are liable to be made by those who attempt to describe the \"geography\" of places which they have not seen. Yet here is a description of a land and its numerous towns, made nearly three thousand years ago, and in its \"particulars\" it is sustained by all the travelers in modern times. The ruins of the same towns are still seen; their places, in general, can be designated; and there is a moral certainty, therefore, that this prophecy was made by one who \"knew\" the locality of those places, and that, therefore, the prophecy is ancient and genuine.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "An impostor would never have attempted such a description as this; nor could he have made it so accurate and true. In the language of Prof. Stuart (\"Bib. Rep.,\" vol. vii. pp. 108, 109), we may say, 'How obviously everything of this kind serves to give confirmation to the authority and credibility of the sacred records! Do sceptics undertake to scoff at the Bible, and aver that it is the work of impostors who lived in later ages? Besides asking them what \"object\" impostors could have in forging a book of such high and lofty principles, we may ask - and ask with an assurance that need not fear the danger of being put to the blush - whether impostors of later ages could possibly have so managed, as to preserve all the \"localities\" in complete order which the Scriptures present? Rare impostors they must indeed have been - people possessed of more knowledge of antiquity than we can well imagine could ever be possessed by such as would condescend to an imposition of such a character. In fact the thing appears to be morally impossible, if one considers it in the light of \"antiquity,\" when so little knowledge of a geographical kind was in existence, and when mistakes respecting countries and places with which one was not personally familiar, were almost, if not altogether, unavoidable.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "'How happens it, now, that the authors of the Old Testament Scriptures should have possessed such a wonderful tact in geography, as it would seem they did, unless they lived at the time and in the countries of which they have spoken? This happens not elsewhere. It is but yesterday since one of the first scientific writers on geology in Great Britain, published to the world the declaration that our Mississippi and Missouri rivers \"belong to the tropics.\" Respectable writers, even in Germany, the land of Classical attainments, have sometimes placed Coelo-Syria on the east of the Anti-Libanus ridge, or even seemed to transfer Damascus over the mountains, and place it between the two Lebanon ridges in the valley.' No such mistakes occur in the sacred writers. They write as people who were familiar with the geography of places named; they mention places with the utmost familiarity; and, after a lapse of three thousand years, every successive traveler who visits Moab, Idumea, or Palestine, does something to confirm the accuracy of Isaiah. Towns, bearing the same name, or the ruins of towns, are located in the same relative position in which he said they were; and the ruins of once splendid cities, broken columns, dilapidated walls, trodden down vineyards, and half-demolished temples, proclaim to the world that those cities are what he said they would be, and that he was under the inspiration of God. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "14. three years … hireling—Just as a hireling has his fixed term of engagement, which neither he nor his master will allow to be added to or to be taken from, so the limit within which Moab is to fall is unalterably fixed (Isa 21:16). Fulfilled about the time when the Assyrians led Israel into captivity. The ruins of Elealeh, Heshbon, Medeba, Dibon, &c., still exist to confirm the inspiration of Scripture. The accurate particularity of specification of the places three thousand years ago, confirmed by modern research, is a strong testimony to the truth of prophecy.   ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hath spoken; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hath made this further discovery of his mind to me. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Within three years; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to be computed either, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1. From the time of Jerusalem’s destruction by Nebuchadnezzar, who did, as is confessed by all, invade the Moabites at or about that time, and execute the judgment first foretold by this prophet, and afterwards by ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Or rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. From the time of the delivery of this prophecy; which being uncertain, leaves us the greater latitude for the determination of the precise time when this was fulfilled. But this is certain, from ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that this prophecy must be delivered, at furthest, before the end of Hezekiah’s reign. And then there ariseth this great difficulty, How this can consist with the prophecy of Jeremiah, who above or about a hundred years after this time speaketh of Moab as a people that had ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "been at ease from their youth, and had not gone into captivity",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 48:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and prophesieth against them in the very same words which Isaiah useth in this prophecy? The answer is, That they do not speak of the same time, nor of the same calamity; but Isaiah of a former tribulation, and Jeremiah of their latter devastation. It is true, Jeremiah useth the same words which Isaiah doth, and so do the later prophets sometimes use the words of the former, to other purposes than they were first delivered, as we shall see hereafter, and as is most evident from the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Revelation of St. John",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in which the same words are used concerning mystical Babylon. which were used by the foregoing prophets concerning the first and literal Babylon. And although the foregoing prophecy of Isaiah seems to speak of the same destruction threatened by Jeremiah, and inflicted by Nebuchadnezzar; yet this prophecy contained in this verse, and ushered in with another preface, seems to be of a differing nature, and to speak of a more speedy and less grievous affliction that should befall them, which should be as a pledge to assure them of the certain accomplishment of the other prophecy, and of their utter destruction. And therefore it is observable, that the prophet doth not here say, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Within three years",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " all that I have foretold and threatened shall be fulfilled; but only, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "the glory of Moab shall be contemned, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "& c., which is quite another thing; and as the terms here used are much milder, so that; judgment here denounced seems much less, than in the foregoing prophecy. And therefore this verse may very well be understood of some great blow given to the Moabites, either by Sennacherib, or by his son Esarhaddon, from which notwithstanding they in a little time recovered themselves, and flourished again, and continued so to do till Nebuchadnezzar completed their destruction. And this may well enough consist with what is said of Moab’s ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "being at ease from his youth, Jeremiah 48:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which is not to be understood simply, as if they had been wholly free from war and other calamities; for the contrary is evident, both from Scripture, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2 Samuel 8:2 2 Kings 3:24,25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and from other histories; but comparatively, that they had not been brought to desolation, nor carried away into captivity, as it is explained in the following words, and as Israel had been at that time, and Judah was threatened to be. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "As the years of an hireling, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i.e. within three years precisely accounted; for hirelings are very punctual in observing the time for which they are hired; and their thoughts and desires run much upon it, because then they are to receive their wages; of which see ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 7:1,2 14:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And this exposition is confirmed by comparing this place with ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 21:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the same phrase is used of one year. So groundless is that opinion which the Jewish writers gather from this place, compared with ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Deu 15:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that three years was the usual and appointed time for the generality of hired servants. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The glory of Moab; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " their strength, and wealth, and other things in which they glory. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Shall be contemned; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shall be made contemptible to those who formerly admired them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "With all that great multitude; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with the great numbers of their people, of which they boasted. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Shall be very small and feeble, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " comparatively to what they were before; which might be very true, and yet afterwards, in a hundred years’ space, they might be sufficiently recruited. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "But now the Lord hath spoken,.... Something else. What follows is a distinct prophecy from the former, and has a date annexed to it, when it should be fulfilled: the former prophecy relates to the utter destruction of the Moabites by the Babylonians, in the times of Nebuchadnezzar; of which Jeremiah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 48:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prophesies, in much the same language as Isaiah; and so Jarchi observes, that the final destruction of Moab was by the hand of Nebuchadnezzar: but this was of a lesser nature, and to be accomplished in a short time, either by Shalmaneser, or by Sennacherib king of Assyria, or Esarhaddon his son: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "saying, within three years, as the year of an hireling; that is, precisely and exactly three years, neither more nor fewer, neither sooner nor later; as whatever time is agreed upon by an hireling, as soon as ever it is out, which he often thinks of, and counts exactly, he demands his wages, and his freedom. Some think this prophecy bears date with the former, concerning the Philistines, which was the year King Ahaz died, Isaiah 14:28 and so had its accomplishment in the fourth year of Hezekiah, when Shalmaneser came up against Samaria (k), and took Moab in his way, 2 Kings 18:9 others, that it was given out in the fourth year of Hezekiah, when the Assyrian besieged Samaria, and after three years took it, and then returned and fell upon the Moabites; others place it in the eleventh year of Hezekiah, and suppose it to be fulfilled in his fourteenth by Sennacherib, about the same time he came up and took the fenced cities of Judah, and besieged Jerusalem, 2 Kings 18:13 and with this agree the Jewish writers (l), whose words are these, ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "\"after those things, and the establishment thereof, Sennacherib king of Assyria came into Judah, 2 Chronicles 32:1 and at the same time sent Tartan to Ashdod, Isaiah 20:1 who overran the Ammonites and Moabites, who helped him when he besieged Samaria three years, that it might be fulfilled what is said, Isaiah 16:14 at the same time the king of Assyria sent Rabshakeh from Lachish to Jerusalem.'' ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Upon which Kimchi observes, as an interpretation of the phrase, \"as the years of an hireling\", ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "\"it is as if it was said, because they helped the king of Assyria three years against Samaria, it was as if they had been hired; therefore they fell by his hand, and the glory of Moab was light in the hand of the king of Assyria.'' ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "But others make it to be three years after this time; but very likely it might be later still, about the eighteenth or nineteenth year of Hezekiah, as Gataker thinks, who, in his notes on this place, has collected all these senses, and made his observations on them; and so had its accomplishment in some expedition of Esarhaddon, who greatly weakened and impoverished the country of Moab, though he did not destroy it, and which was an earnest and pledge of the utter destruction of it before prophesied of. Noldius renders it, \"after three years\"; and so Grotius: it was in the first year of Hezekiah, as Noldius observes, that this was said; and in the fourth year of his reign, Shalmaneser came against Samaria, and in his way was the beginning of this destruction, and but a beginning of it, as he observes, yet a pledge of the consummation by Nebuchadnezzar, which was long after these three years of Isaiah. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "And the glory of Moab shall be contemned with all that great multitude; of cities and towns, of the inhabitants of them, and of wealth and riches, things in which Moab gloried, and were reckoned weighty and heavy things; these were accounted light by the king of Assyria, who spoiled them, or at least greatly diminished them: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and the remnant shall be very small and feeble; or, \"not mighty\" or \"strong\"; those that were not cut off by the Assyrian army would be but few, and these weak and without strength, being dispossessed of their cities, and of their wealth; though, in process of time, between this, and the fulfilment of the former prophecy, and that of Jeremiah, they recovered themselves, and became very numerous and flourishing. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(k) See Prideaux's Connect. par. 1. B. 1. p. 18. So Vitringa. (l) Seder Olam Rabba, c. 23. p. 64. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "But now the LORD hath spoken, saying, {o} Within three years, as the years of an {p} hireling, and the glory of Moab shall be despised, with all that great multitude; and the remnant shall be very small and feeble.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(o) He appointed a certain time to punish the enemies in.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(p) Who will observe justly the time for which he is hired and serve no longer but will ever long for it.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " describe real events, the verse shews that in the interval Moab had recovered some measure of its former prosperity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as the years of a hireling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As the hireling serves for the stipulated time, but not a moment longer, so the judgment on Moab shall not be deferred beyond the space of three years (cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 21:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the glory of Moab",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 16:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be contemned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or “contemptible.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the remnant … feeble",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. “the remnant shall be small, little (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—of time), not strong.” It is hazardous to assume that the “remnant” here is the nucleus of a regenerated Messianic community.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Now\" - an addition has been made to the prophecy. Isaiah is authorized to announce that in three years' time, counted as strictly as possible, the judgment pronounced shall fall on Moab; her \"glory\" shall be turned into shame, her \"multitude\" shall be cut off, and only a \"remnant\" shall be left, weak, small, and powerless. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As the years of an hireling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Counted with the utmost exactness. A hireling would not consent to serve a day longer than his contract bound him, nor would his master consent that he should serve a day short of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "With all that great multitude.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " We have no means of accurately estimating the population of Moab. The entire area of the region which the Moabites inhabited seems to have been not more than fifteen hundred square miles. The greater part of it was, however, exceedingly fertile; and we are, perhaps, justified in allowing it a population of two hundred to the square mile, which is about that of Germany. This would give three hundred thousand inhabitants, of whom the adult males would be seventy-five thousand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Feeble",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "not powerful",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " very much the contrary, very weak. Moab seems to have offered a very slight resistance to Asshur-bani-pal (G. Smith, 'History of Asshur-bani-pal,' p. 259). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaiah 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The massa is now brought to a close, and there follows an epilogue which fixes the term of the fulfilment of what is not predicted now for the first time, from the standpoint of the anticipated history. \"This is the word which Jehovah spake long ago concerning Moab. And now Jehovah speaketh thus: In three years, like years of a hireling, the glory of Moab is disgraced, together with all the multitude of the great; a remnant is left, contemptibly small, not great at all.\" The time fixed is the same as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 20:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of working time the hirer remits nothing, and the labourer gives nothing in. The statement as to the time, therefore, is intended to be taken exactly: three years, not more, rather under than over. Then will the old saying of God concerning Moab be fulfilled. Only a remnant, a contemptible remnant, will be left (וּשׁאר, cf., וּמשׂושׂ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in sense equivalent to ושׁאר); for every history of the nations is but the shadow of the history of Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The massa in Isaiah 15:1-16:12 was a word that had already gone forth from Jehovah \"long ago.\" This statement may be understood in three different senses. In the first place, Isaiah may mean that older prophecies had already foretold essentially the same concerning Moab. But what prophecies? We may get an answer to this question from the prophecies of Jeremiah concerning Moab in Jeremiah 48. Jeremiah there reproduces the massa Moab of the book of Isaiah, but interweaves with it reminiscences (1.) out of the mâshal on Moab in Numbers 21:27-30; (2.) out of Balaam's prophecy concerning Moab in Numbers 24:17; (3.) out of the prophecy of Amos concerning Moab (Amos 2:1-3). And it might be to these earlier words of prophecy that Isaiah here refers (Hvernick, Drechsler, and others). But this is very improbable, as there is no ring of these earlier passages in the massa, such as we should expect if Isaiah had had them in his mind. Secondly, Isaiah might mean that Isaiah 15:1. contained the prophecy of an older prophet, which he merely brought to remembrance in order to connect therewith the precise tenor of its fulfilment which had been revealed to him. This is at present the prevailing view. Hitzig, in a special work on the subject (1831), as well as in his Commentary, has endeavoured to prove, on the ground of 2 Kings 14:25, that in all probability Jonah was the author of the oracle which Isaiah here resumes. And Knobel, Maurer, Gustav Baur, and Thenius agree with him in this; whilst De Wette, Ewald, and Umbreit regard it as, at any rate, decidedly non-Messianic. If the conjecture that Jonah was the author could but be better sustained, we should heartily rejoice in this addition to the history of the literature of the Old Testament. But all that we know of Jonah is at variance with such a conjecture. He was a prophet of the type of Elijah and Elisha, in whom the eloquence of a prophet's words was thrown altogether into the shade by the energy of a prophet's deeds. His prophecy concerning the restoration of the kingdom of Israel to its old boundaries, which was fulfilled by the victories of Jeroboam II, we cannot therefore imagine to have been so pictorial or highly poetical as the massa Moab (which would only be one part of that prophecy) really is; and the fact that he was angry at the sparing of Nineveh harmonizes very badly with its elegiac softness and its flood of tears. Moreover, it is never intimated that the conquerors to whom Moab was to succumb would belong to the kingdom of Israel; and the hypothesis is completely overthrown by the summons addressed to Moab to send tribute to Jerusalem. But the conclusion itself, that the oracle must have originated with any older prophet whatever, is drawn from very insufficient premises. No doubt it is a thing altogether unparalleled even in Isaiah, that a prophecy should assume so thoroughly the form of a kinah, or lamentation; still there are tendencies to this in Isaiah 22:4 (cf., Isaiah 21:3-4), and Isaiah was an inexhaustible master of language of every character and colour. It is true we do light upon many expressions which cannot be pointed out anywhere else in the book of Isaiah, such as baalē goyim, hedâd, yelâlâh, yâra‛, yithrâh, mâhir, mētz, nosâphoth, pekuddâh (provision, possession); and there is something peculiar in the circular movement of the prophecy, which is carried out to such an extent in the indication of reason and consequence, as well as in the perpetually returning, monotonous connection of the sentences by ci (for) and ‛al-cēn (lâcēn, therefore), the former of which is repeated twice in Isaiah 15:1, three times in Isaiah 15:8-9, and four times in succession in Isaiah 15:5-6. But there is probably no prophecy, especially in chapters 13-23, which does not contain expressions that the prophet uses nowhere else; and so far as the conjunctions ci and a‛ l-cēn (lâcēn), are concerned, Isaiah crowds them together in other passages as well, and here almost to monotony, as a natural consequence of the prevailing elegiac tone. Besides, even Ewald can detect the characteristics of Isaiah in Isaiah 16:1-6; and you have only to dissect the whole rhetorically, syntactically, and philologically, with the carefulness of a Caspari, to hear throughout the ring of Isaiah's style. And whoever has retained the impression which he brought with him from the oracle against Philistia, will be constrained to say, that not only the stamp and outward form, but also the spirit and ideas, are thoroughly Isaiah's. Hence the third possible conjecture must be the correct one. Thirdly, then, Isaiah may mean that the fate of Moab, which he has just proclaimed, was revealed to him long ago; and the addition made now is, that it will be fulfilled in exactly three years. מאז does not necessarily point to a time antecedent to that of Isaiah himself (compare Isaiah 44:8; Isaiah 48:3, Isaiah 48:5, Isaiah 48:7, with 2 Samuel 15:34). If we assume that what Isaiah predicts down to Isaiah 16:12 was revealed to him in the year that Ahaz died, and that the epilogue reckons from the third or tenth year of Hezekiah, in either case the interval is long enough for the mê'âz (from of old). And we decide in favour of this. Unfortunately, we know nothing certain as to the time at which the three years commence. The question whether it was Shalmanassar, Sargon, or Sennacherib who treated the Moabites so harshly, is one that we cannot answer. In Herodotus (ii. 141), Sennacherib is called \"king of the Arabians and Assyrians;\" and Moab might be included in the Arabians. In any case, after the fulfilment of Isaiah's prophecy in the Assyrian times, there was still a portion left, the fulfilment of which, according to Jeremiah 48, was reserved for the Chaldeans. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The massa in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 15:1-16:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " was a word that had already gone forth from Jehovah \"long ago.\" This statement may be understood in three different senses. In the first place, Isaiah may mean that older prophecies had already foretold essentially the same concerning Moab. But what prophecies? We may get an answer to this question from the prophecies of Jeremiah concerning Moab in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jeremiah there reproduces the massa Moab of the book of Isaiah, but interweaves with it reminiscences (1.) out of the mâshal on Moab in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 21:27-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; (2.) out of Balaam's prophecy concerning Moab in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 24:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; (3.) out of the prophecy of Amos concerning Moab (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 2:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). And it might be to these earlier words of prophecy that Isaiah here refers (Hvernick, Drechsler, and others). But this is very improbable, as there is no ring of these earlier passages in the massa, such as we should expect if Isaiah had had them in his mind. Secondly, Isaiah might mean that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 15:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". contained the prophecy of an older prophet, which he merely brought to remembrance in order to connect therewith the precise tenor of its fulfilment which had been revealed to him. This is at present the prevailing view. Hitzig, in a special work on the subject (1831), as well as in his Commentary, has endeavoured to prove, on the ground of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 14:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that in all probability Jonah was the author of the oracle which Isaiah here resumes. And Knobel, Maurer, Gustav Baur, and Thenius agree with him in this; whilst De Wette, Ewald, and Umbreit regard it as, at any rate, decidedly non-Messianic. If the conjecture that Jonah was the author could but be better sustained, we should heartily rejoice in this addition to the history of the literature of the Old Testament. But all that we know of Jonah is at variance with such a conjecture. He was a prophet of the type of Elijah and Elisha, in whom the eloquence of a prophet's words was thrown altogether into the shade by the energy of a prophet's deeds. His prophecy concerning the restoration of the kingdom of Israel to its old boundaries, which was fulfilled by the victories of Jeroboam II, we cannot therefore imagine to have been so pictorial or highly poetical as the massa Moab (which would only be one part of that prophecy) really is; and the fact that he was angry at the sparing of Nineveh harmonizes very badly with its elegiac softness and its flood of tears. Moreover, it is never intimated that the conquerors to whom Moab was to succumb would belong to the kingdom of Israel; and the hypothesis is completely overthrown by the summons addressed to Moab to send tribute to Jerusalem. But the conclusion itself, that the oracle must have originated with any older prophet whatever, is drawn from very insufficient premises. No doubt it is a thing altogether unparalleled even in Isaiah, that a prophecy should assume so thoroughly the form of a kinah, or lamentation; still there are tendencies to this in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 21:3-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and Isaiah was an inexhaustible master of language of every character and colour. It is true we do light upon many expressions which cannot be pointed out anywhere else in the book of Isaiah, such as baalē goyim, hedâd, yelâlâh, yâra‛, yithrâh, mâhir, mētz, nosâphoth, pekuddâh (provision, possession); and there is something peculiar in the circular movement of the prophecy, which is carried out to such an extent in the indication of reason and consequence, as well as in the perpetually returning, monotonous connection of the sentences by ci (for) and ‛al-cēn (lâcēn, therefore), the former of which is repeated twice in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 15:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", three times in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 15:8-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and four times in succession in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 15:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But there is probably no prophecy, especially in chapters 13-23, which does not contain expressions that the prophet uses nowhere else; and so far as the conjunctions ci and a‛ l-cēn (lâcēn), are concerned, Isaiah crowds them together in other passages as well, and here almost to monotony, as a natural consequence of the prevailing elegiac tone. Besides, even Ewald can detect the characteristics of Isaiah in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:1-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and you have only to dissect the whole rhetorically, syntactically, and philologically, with the carefulness of a Caspari, to hear throughout the ring of Isaiah's style. And whoever has retained the impression which he brought with him from the oracle against Philistia, will be constrained to say, that not only the stamp and outward form, but also the spirit and ideas, are thoroughly Isaiah's. Hence the third possible conjecture must be the correct one. Thirdly, then, Isaiah may mean that the fate of Moab, which he has just proclaimed, was revealed to him long ago; and the addition made now is, that it will be fulfilled in exactly three years. מאז does not necessarily point to a time antecedent to that of Isaiah himself (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 48:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 48:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 48:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). If we assume that what Isaiah predicts down to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " was revealed to him in the year that Ahaz died, and that the epilogue reckons from the third or tenth year of Hezekiah, in either case the interval is long enough for the mê'âz (from of old). And we decide in favour of this. Unfortunately, we know nothing certain as to the time at which the three years commence. The question whether it was Shalmanassar, Sargon, or Sennacherib who treated the Moabites so harshly, is one that we cannot answer. In Herodotus (ii. 141), Sennacherib is called \"king of the Arabians and Assyrians;\" and Moab might be included in the Arabians. In any case, after the fulfilment of Isaiah's prophecy in the Assyrian times, there was still a portion left, the fulfilment of which, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", was reserved for the Chaldeans. ",
            "children": []
          }
        ]
      }
    ]
  }
]