[{"num":7,"verse":"And the Lord said to Noah, Come with all your household into the ark, for I have seen you to be righteous (upright and in right standing) before Me in this generation."},{"num":2,"verse":"Of every clean beast you shall receive and take with you seven pairs, the male and his mate, and of beasts that are not clean a pair of each kind, the male and his mate,"},{"num":3,"verse":"Also of the birds of the air seven pairs, the male and the female, to keep seed [their kind] alive over all the earth or land."},{"num":4,"verse":"For in seven days I will cause it to rain upon the earth forty days and forty nights, and every living substance and thing that I have made I will destroy, blot out, and wipe away from the face of the earth."},{"num":5,"verse":"And Noah did all that the Lord commanded him."},{"num":6,"verse":"Noah was 600 years old when the flood of waters came upon the earth or land."},{"num":7,"verse":"And Noah and his sons and his wife and his sons’ wives with him went into the ark because of the waters of the flood."},{"num":8,"verse":"Of clean animals and of animals that are not clean, and of birds and fowls, and of everything that creeps on the ground,"},{"num":9,"verse":"There went in two and two with Noah into the ark, the male and the female, as God had commanded Noah."},{"num":10,"verse":"And after the seven days the floodwaters came upon the earth or land."},{"num":11,"verse":"In the year 600 of Noah’s life, in the seventeenth day of the second month, that same day all the fountains of the great deep were broken up and burst forth, and the windows and floodgates of the heavens were opened."},{"num":12,"verse":"And it rained upon the earth forty days and forty nights."},{"num":13,"verse":"On the very same day Noah and Shem, Ham, and Japheth, the sons of Noah, and Noah’s wife and the three wives of his sons with them, went into the ark,"},{"num":14,"verse":"They and every [wild] beast according to its kind, all the livestock according to their kinds, every moving thing that creeps on the land according to its kind, and every fowl according to its kind, every winged thing of every sort."},{"num":15,"verse":"And they went into the ark with Noah, two and two of all flesh in which there were the breath and spirit of life."},{"num":16,"verse":"And they that entered, male and female of all flesh, went in as God had commanded [Noah]; and the Lord shut him in and closed [the door] round about him."},{"num":17,"verse":"The flood [that is, the downpour of rain] was forty days upon the earth; and the waters increased and bore up the ark, and it was lifted [high] above the land."},{"num":18,"verse":"And the waters became mighty and increased greatly upon the land, and the ark went [gently floating] upon the surface of the waters."},{"num":19,"verse":"And the waters prevailed so exceedingly and were so mighty upon the earth that all the high hills under the whole sky were covered."},{"num":20,"verse":"[In fact] the waters became fifteen cubits higher, as the high hills were covered."},{"num":21,"verse":"And all flesh ceased to breathe that moved upon the earth—fowls and birds, [tame] animals, [wild] beasts, all swarming and creeping things that swarm and creep upon the land, and all mankind."},{"num":22,"verse":"Everything on the dry land in whose nostrils were the breath and spirit of life died."},{"num":23,"verse":"God destroyed (blotted out) every living thing that was upon the face of the earth; man and animals and the creeping things and the birds of the heavens were destroyed (blotted out) from the land. Only Noah remained alive, and those who were with him in the ark."},{"num":24,"verse":"And the waters prevailed [mightily] upon the earth or land 150 days (five months)."}]