[{"num":7,"verse":"(ii) Adonai said to Noach, “Come into the ark, you and all your household; for I have seen that you alone in this generation are righteous before me. "},{"num":2,"verse":"Of every clean animal you are to take seven couples, and of the animals that are not clean, one couple; "},{"num":3,"verse":"also of the birds in the air take seven couples — in order to preserve their species throughout the earth. "},{"num":4,"verse":"For in seven more days I will cause it to rain on the earth forty days and forty nights; I will wipe out every living thing that I have made from the face of the earth.” "},{"num":5,"verse":"Noach did all that Adonai ordered him to do."},{"num":6,"verse":"Noach was 600 years old when the water flooded the earth. "},{"num":7,"verse":"Noach went into the ark with his sons, his wife and his sons’ wives, because of the floodwaters. "},{"num":8,"verse":"Of clean animals, of animals that are not clean, of birds, and of everything that creeps on the ground, "},{"num":9,"verse":"couples, male and female, went in to Noach in the ark, as God had ordered Noach."},{"num":10,"verse":"After seven days the water flooded the earth. "},{"num":11,"verse":"On the seventeenth day of the second month of the 600th year of Noach’s life all the fountains of the great deep were broken up, and the windows of the sky were opened. "},{"num":12,"verse":"It rained on the earth forty days and forty nights."},{"num":13,"verse":"On that same day Noach entered the ark with Shem, Ham and Yefet the sons of Noach, Noach’s wife and the three wives of his sons accompanying them; "},{"num":14,"verse":"they, and every animal of every species, all the livestock of every species, every animal that creeps on the ground of every species, and every bird of every species — all sorts of winged creatures. "},{"num":15,"verse":"They went in to Noach in the ark, couples from every kind of living thing that breathes. "},{"num":16,"verse":"Those that entered went in, male and female, from every kind of living being, as God had ordered him; and Adonai shut him inside."},{"num":17,"verse":"(iii) The flood was forty days on the earth; the water grew higher and floated the ark, so that it was lifted up off the earth. "},{"num":18,"verse":"The water overflowed the earth and grew deeper, until the ark floated on the surface of the water. "},{"num":19,"verse":"The water overpowered the earth mightily; all the high mountains under the entire sky were covered; "},{"num":20,"verse":"the water covered the mountains by more than twenty-two-and-a-half feet. "},{"num":21,"verse":"All living beings that moved on the earth perished — birds, livestock, other animals, insects, and every human being, "},{"num":22,"verse":"everything in whose nostrils was the breath of the spirit of life; whatever was on dry land died. "},{"num":23,"verse":"He wiped out every living thing on the surface of the ground — not only human beings, but livestock, creeping animals and birds in the air. They were wiped out from the earth; only Noach was left, along with those who were with him in the ark. "},{"num":24,"verse":"The water held power over the earth for 150 days."}]