[{"num":7,"verse":"And Jehovah said to Noah, Go into the ark, thou and all thy house; for thee have I seen righteous before me in this generation."},{"num":2,"verse":"Of all clean beasts thou shalt take to thee by sevens, a male and its female; but of the beasts that are not clean two, a male and its female."},{"num":3,"verse":"Also of the fowl of the heavens by sevens, male and female; to keep seed alive on the face of all the earth."},{"num":4,"verse":"For in yet seven days I will cause it to rain on the earth forty days and forty nights; and every living being which I have made will I destroy from the ground."},{"num":5,"verse":"And Noah did according to all that Jehovah had commanded him."},{"num":6,"verse":"And Noah was six hundred years old when the flood of waters was on the earth."},{"num":7,"verse":"And Noah went in, and his sons, and his wife, and his sons' wives with him, into the ark, because of the waters of the flood."},{"num":8,"verse":"Of clean beasts, and of beasts that are not clean, and of fowl, and of everything that creeps on the ground,"},{"num":9,"verse":"there came two and two unto Noah into the ark, male and female, as God had commanded Noah."},{"num":10,"verse":"And it came to pass after seven days that the waters of the flood were on the earth."},{"num":11,"verse":"In the six hundredth year of Noah's life, in the second month, on the seventeenth day of the month, on that same day all the fountains of the great deep were broken up, and the windows of heaven were opened."},{"num":12,"verse":"And the pour of rain was on the earth forty days and forty nights."},{"num":13,"verse":"On the same day went Noah, and Shem and Ham and Japheth, the sons of Noah, and Noah's wife, and the three wives of his sons with them, into the ark;"},{"num":14,"verse":"they, and every beast after its kind, and all the cattle after their kind, and every creeping thing that creeps on the earth after its kind, and all fowl after its kind—every bird of every wing."},{"num":15,"verse":"And they went to Noah, into the ark, two and two of all flesh, in which was the breath of life."},{"num":16,"verse":"And they that came, came male and female of all flesh, as God had commanded him. And Jehovah shut him in."},{"num":17,"verse":"And the flood was forty days on the earth. And the waters increased, and bore up the ark; and it was lifted up above the earth."},{"num":18,"verse":"And the waters prevailed and increased greatly on the earth; and the ark went on the face of the waters."},{"num":19,"verse":"And the waters prevailed exceedingly on the earth; and all the high mountains that are under all the heavens were covered."},{"num":20,"verse":"Fifteen cubits upward the waters prevailed; and the mountains were covered."},{"num":21,"verse":"And all flesh that moved on the earth expired, fowl as well as cattle, and beasts, and all crawling things which crawl on the earth, and all mankind:"},{"num":22,"verse":"everything which had in its nostrils the breath of life, of all that was on the dry [land], died."},{"num":23,"verse":"And every living being was destroyed that was on the ground, both man, and cattle, and creeping things, and fowl of the heavens; and they were destroyed from the earth. And Noah alone remained, and what was with him in the ark."},{"num":24,"verse":"And the waters prevailed on the earth a hundred and fifty days."}]