[{"header":"The Flood Begins"},{"num":7,"verse":"Then the Lord said to Noah, “I have seen that you are the best man among the people of this time. So you and your family go into the boat. "},{"num":2,"verse":"Take with you seven pairs, each male with its female, of every kind of clean animal. And take one pair, each male with its female, of every kind of unclean animal. "},{"num":3,"verse":"Take seven pairs of all the birds of the sky, each male with its female. This will allow all these animals to continue living on the earth after the flood. "},{"num":4,"verse":"Seven days from now I will send rain on the earth. It will rain 40 days and 40 nights. I will destroy from the earth every living thing that I made.”"},{"num":5,"verse":"Noah did everything that the Lord commanded him."},{"num":6,"verse":"Noah was 600 years old when the flood came. "},{"num":7,"verse":"He and his wife and his sons and their wives went into the boat. They went in to escape the waters of the flood. "},{"num":8,"verse":"The clean animals, the unclean animals, the birds and everything that crawls on the ground "},{"num":9,"verse":"came to Noah. They went into the boat in groups of two, male and female. This was just as God had commanded Noah. "},{"num":10,"verse":"Seven days later the flood started."},{"num":11,"verse":"Noah was now 600 years old. The flood started on the seventeenth day of the second month of that year. That day the underground springs split open. And the clouds in the sky poured out rain. "},{"num":12,"verse":"The rain fell on the earth for 40 days and 40 nights."},{"num":13,"verse":"On that same day Noah and his wife, his sons Shem, Ham and Japheth and their wives went into the boat. "},{"num":14,"verse":"They had every kind of wild animal and tame animal. There was every kind of animal that crawls on the earth. Every kind of bird was there. "},{"num":15,"verse":"They all came to Noah in the boat in groups of two. There was every creature that had the breath of life. "},{"num":16,"verse":"One male and one female of every living thing came. It was just as God had commanded Noah. Then the Lord closed the door behind them."},{"num":17,"verse":"Water flooded the earth for 40 days. As the water rose, it lifted the boat off the ground. "},{"num":18,"verse":"The water continued to rise, and the boat floated on the water above the earth. "},{"num":19,"verse":"The water rose so much that even the highest mountains under the sky were covered by it. "},{"num":20,"verse":"The water continued to rise until it was more than 20 feet above the mountains."},{"num":21,"verse":"All living things that moved on the earth died. This included all the birds, tame animals, wild animals and creatures that swarm on the earth. And all human beings died. "},{"num":22,"verse":"So everything on dry land died. This means everything that had the breath of life in its nose. "},{"num":23,"verse":"So God destroyed from the earth every living thing that was on the land. This was every man, animal, crawling thing and bird of the sky. All that was left was Noah and what was with him in the boat. "},{"num":24,"verse":"And the waters continued to cover the earth for 150 days."}]