[{"num":7,"verse":"Next God said to Noah, “Now board the ship, you and all your family—out of everyone in this generation, you’re the righteous one."},{"num":2,"verse":"“Take on board with you seven pairs of every clean animal, a male and a female; one pair of every unclean animal, a male and a female; and seven pairs of every kind of bird, a male and a female, to insure their survival on Earth. In just seven days I will pour rain on Earth for forty days and forty nights. I’ll make a clean sweep of everything that I’ve made.”"},{"num":5,"verse":"Noah did everything God commanded him."},{"num":6,"verse":"Noah was 600 years old when the floodwaters covered the Earth. Noah and his wife and sons and their wives boarded the ship to escape the flood. Clean and unclean animals, birds, and all the crawling creatures came in pairs to Noah and to the ship, male and female, just as God had commanded Noah. In seven days the floodwaters came."},{"num":11,"verse":"It was the six-hundredth year of Noah’s life, in the second month, on the seventeenth day of the month that it happened: all the underground springs erupted and all the windows of Heaven were thrown open. Rain poured for forty days and forty nights."},{"num":13,"verse":"That’s the day Noah and his sons Shem, Ham, and Japheth, accompanied by his wife and his sons’ wives, boarded the ship. And with them every kind of wild and domestic animal, right down to all the kinds of creatures that crawl and all kinds of birds and anything that flies. They came to Noah and to the ship in pairs—everything and anything that had the breath of life in it, male and female of every creature came just as God had commanded Noah. Then God shut the door behind him."},{"num":17,"verse":"The flood continued forty days and the waters rose and lifted the ship high over the Earth. The waters kept rising, the flood deepened on the Earth, the ship floated on the surface. The flood got worse until all the highest mountains were covered—the high-water mark reached twenty feet above the crest of the mountains. Everything died. Anything that moved—dead. Birds, farm animals, wild animals, the entire teeming exuberance of life—dead. And all people—dead. Every living, breathing creature that lived on dry land died; he wiped out the whole works—people and animals, crawling creatures and flying birds, every last one of them, gone. Only Noah and his company on the ship lived."},{"num":24,"verse":"The floodwaters took over for 150 days."}]