[{"header":"A Loyal Soldier of Christ Jesus"},{"num":2,"verse":"Timothy, you are a son to me. Be strong in the grace that we have because we belong to Christ Jesus."},{"num":2,"verse":"What you have heard me teach publicly you should teach to others. Share these teachings with people you can trust. Then they will be able to teach others these same things."},{"num":3,"verse":"As a good soldier of Christ Jesus, accept your share of the troubles we have."},{"num":4,"verse":"A soldier wants to please his commanding officer, so he does not spend any time on activities that are not a part of his duty."},{"num":5,"verse":"Athletes in a race must obey all the rules to win."},{"num":6,"verse":"The farmer who works hard deserves the first part of the harvest."},{"num":7,"verse":"Think about what I am saying. The Lord will help you understand it all."},{"num":8,"verse":"Remember Jesus Christ. He is from the family of David. After Jesus died, he was raised from death. This is the Good News that I tell people."},{"num":9,"verse":"And because I tell that message, I am suffering. I am even bound with chains like someone who has really done wrong. But God’s message is not bound."},{"num":10,"verse":"So I patiently accept all these troubles. I do this to help the people God has chosen so that they can have the salvation that is in Christ Jesus. With this salvation comes glory that never ends."},{"num":11,"verse":"Here is a true statement:"},{"header":"A Worker Who Pleases God"},{"num":14,"verse":"Keep on telling everyone these truths. And warn them before God not to argue about words. Such arguments don’t help anyone, and they ruin those who listen to them."},{"num":15,"verse":"Do your best to be the kind of person God will accept, and give yourself to him. Be a worker who has no reason to be ashamed of his work, one who applies the true teaching in the right way."},{"num":16,"verse":"Stay away from people who talk about useless things that are not from God. That kind of talk will lead a person more and more against God."},{"num":17,"verse":"Their evil teaching will spread like a sickness inside the body. Hymenaeus and Philetus are men like that."},{"num":18,"verse":"They have left the true teaching. They say that the day when people will be raised from death has already come and gone. And they are destroying the faith of some people."},{"num":19,"verse":"But God’s strong foundation never moves, and these words are written on it: “The Lord knows those who belong to him.” Also, these words are written there: “Everyone who says they believe in the Lord must stop doing wrong.”"},{"num":20,"verse":"In a large house there are things made of gold and silver. But there are also things made of wood and clay. Some of these are used for special purposes, others for ordinary jobs."},{"num":21,"verse":"The Lord wants to use you for special purposes, so make yourself clean from all evil. Then you will be holy, and the Master can use you. You will be ready for any good work."},{"num":22,"verse":"Stay away from the evil things a young person like you typically wants to do. Do your best to live right and to have faith, love, and peace, together with others who trust in the Lord with pure hearts."},{"num":23,"verse":"Stay away from foolish and stupid arguments. You know that these arguments grow into bigger arguments."},{"num":24,"verse":"As a servant of the Lord, you must not argue. You must be kind to everyone. You must be a good teacher, and you must be patient."},{"num":25,"verse":"You must gently teach those who don’t agree with you. Maybe God will let them change their hearts so that they can accept the truth."},{"num":26,"verse":"The devil has trapped them and now makes them do what he wants. But maybe they can wake up to see what is happening and free themselves from the devil’s trap."}]