[{"num":14,"verse":"Therefore (And so in time, when he was a grown man,) Samson went down into Timnath, and he saw there a woman of the daughters of (the) Philistines;"},{"num":2,"verse":"and he went up, and he told this to his father and mother, and said, I saw a woman in Timnath of the daughters of Philistines, and I beseech, that ye take her (to be) a wife to me (and I beseech thee, that ye get her for a wife for me)."},{"num":3,"verse":"To whom his father and mother said, Whether there is no woman among the daughters of thy brethren, and in all my people, for thou wilt take a wife of the Philistines, that be uncircumcised? And Samson said to his father, Take thou this (for a) wife to me, for she hath pleased mine eyes. (To whom his father and mother said, Is there no woman among the daughters of thy kinsmen, or among all our people, that thou must take a wife of the Philistines, yea, of those who be uncircumcised? And Samson said to his father, Get thou her for a wife for me, for she hath pleased my eyes.)"},{"num":4,"verse":"But his father and mother knew not, that this thing was done of the Lord (that this thing was done by the Lord); and that he sought occasions against [the] Philistines; for in that time (the) Philistines were lords of Israel."},{"num":5,"verse":"Therefore Samson went down with his father and mother into Timnath; and when they had come to the vineries of the city, a fierce and roaring whelp of a lion appeared, and ran to Samson (and ran at Samson)."},{"num":6,"verse":"And the spirit of the Lord felled into Samson, and he rent the lion into gobbets, as if he had rent a kid, and utterly he had nothing in his hand; and he would not show this to his father and mother. (And the spirit of the Lord fell upon Samson, and he tore the lion into pieces, like tearing up a goat kid, and he had utterly nothing in his hands; but he did not tell what he had done to either his father or his mother.)"},{"num":7,"verse":"And (so) he went down, and spake to the woman, that pleased his eyes."},{"num":8,"verse":"And after some days he turned [again] to take her; and he went aside to see the lion’s carrion (and he went aside to see the lion’s carcass); and lo! a swarm of bees was in the lion’s mouth, and (also) an honeycomb."},{"num":9,"verse":"And when Samson had taken the comb in his hands, he ate it in the way; and he came to his father and mother, and gave them part thereof, and they ate; nevertheless he would not show to them, that he had taken that honey of the lion’s mouth. (And when Samson had taken the comb in his hands, he ate some honey on the way; and he came to his father and mother, and gave them part of it, and they ate it; but he did not tell them, that he had taken the honey out of the lion’s mouth.)"},{"num":10,"verse":"And so his father went down to the woman, and made a feast to his son Samson; for so young men were wont to do. (And so his father went down to see the woman, and Samson gave a feast there, as young men were wont to do.)"},{"num":11,"verse":"Therefore when the citizens of that place had seen him, they gave to him thirty fellows, which should be with him."},{"num":12,"verse":"To which Samson spake, I shall put forth to you a problem, that is, a doubtful word and privy, and if ye solve it to me within (the) seven days of the feast, I shall give to you thirty linen clothes, and coats of the same number; (To whom Samson said, I shall put forth a problem, or a riddle, to you, and if ye solve it for me within the seven days of the feast, I shall give you thirty linen clothes, and the same number of coats;)"},{"num":13,"verse":"soothly if ye may not solve (it), ye shall give to me thirty linen clothes, and coats of the same number (and the same number of coats). Which answered to him, Set forth the problem, (so) that we hear it."},{"num":14,"verse":"And he said to them, Meat went out of the eater, and sweetness went out of the strong. And by three days they might not solve the proposition, that is, the reason(ing) set forth (And for three days, they could not solve the riddle)."},{"num":15,"verse":"And when the seventh day came, they said to the wife of Samson, Gloss thine husband, and counsel him, that he show to thee what the problem signifieth. That if thou wilt not do it, we shall burn thee and the house of thy father. Whether therefore ye called us to [the] weddings, that ye should rob us? (And when the fourth day came, they said to Samson’s wife, Flatter thy husband, and counsel him, so that he show thee what the answer is. And if thou wilt not do this, we shall burn down thee and thy father’s house as well. Or have ye only called us to the wedding, so that ye could rob us?)"},{"num":16,"verse":"And she shedded tears at Samson, and complained, and said, Thou hatest me, and lovest me not, therefore thou wilt not expound to me the problem, which thou hast put forth to the sons of my people. And he answered, I would not say this thing to my father and mother, and shall I be able to show it to thee? (And so she shed tears before Samson, and complained, and said, Thou hatest me, and lovest me not, and so thou wilt not expound the riddle to me, which thou hast put forth to the sons of my people. And he answered, If I would not even tell it to my father or my mother, then why would I tell it to thee?)"},{"num":17,"verse":"Therefore by seven days of the feast she wept upon him; and at the last in the seventh day, he told it to her clearly, when she was dis-easeful to him. And anon she told it to her citizens. (And so for the remainder of the seven days of the feast, she wept before him; and at last on the seventh day, he told her the answer, after that she had made his life miserable. And at once she told it to her fellow citizens.)"},{"num":18,"verse":"And they said to him in the seventh day before the going down of the sun, What is sweeter than honey, and what is stronger than a lion? And he said to them, If ye had not eared, or busied you, in my cow calf, that is, my wife, ye had not found (out) my proposition. (And so on the seventh day, before the going down of the sun, they said to him, What is sweeter than honey, and stronger than a lion? And he said to them, If ye had not busied yourselves with my cow calf, that is, with my wife, ye would not have solved my riddle.)"},{"num":19,"verse":"Therefore the spirit of the Lord felled into him; and he went down to Ashkelon, and killed there thirty men, whose clothes he took away, and he gave to them that solved the problem; and he was full wroth, and went up into his father’s house. (And then the spirit of the Lord fell upon him; and he went down to Ashkelon, and killed thirty men there, whose clothes he took away, and he gave them to those who had solved his riddle; and he was very angry, and went back to his father’s house.)"},{"num":20,"verse":"Forsooth his wife took (as) an husband, one of the friends and privy keepers of her. [Forsooth the wife of him took an husband, one of his friends and wooers.]"}]