[{"num":14,"verse":"One day Y’honatan the son of Sha’ul said to the young man carrying his armor, “Come, let’s go across to the garrison of the P’lishtim on the other side. But he didn’t tell his father. "},{"num":2,"verse":"Sha’ul was waiting at the far edge of Giv‘ah under the pomegranate tree in Migron; the force with him numbered about 600 men. "},{"num":3,"verse":"Achiyah the son of Achituv, I-Khavod’s brother, the son of Pinchas the son of ‘Eli, the cohen of Adonai in Shiloh, was carrying a ritual vest. No one knew that Y’honatan had gone."},{"num":4,"verse":"Between the passes by which Y’honatan was trying to cross to the garrison of the P’lishtim, there was a rocky spur on one side and another rocky spur on the other side; the name of the one was Botzetz, and of the other, Seneh. "},{"num":5,"verse":"The one spur rose up on the north, in front of Mikhmas, and the other on the south, in front of Geva. "},{"num":6,"verse":"Y’honatan said to his armor-bearer, “Come on, let’s go across to the garrison of these uncircumcised people. Maybe Adonai will do something for us, since Adonai can rescue with a few people as easily as with many.” "},{"num":7,"verse":"His armor-bearer replied, “Do everything you think you should; I’m with you, whatever you decide.” "},{"num":8,"verse":"Y’honatan said, “Here, we’ll cross over to those men and let them know we’re there. "},{"num":9,"verse":"If they say, ‘Wait till we come to you,’ we’ll stand still where we are and not go up to them. "},{"num":10,"verse":"But if they say, ‘Come up to us,’ we’ll go on up; and that will be the sign that Adonai has given us victory over them.”"},{"num":11,"verse":"So both of them let their presence be known to the garrison of the P’lishtim; and the P’lishtim said, “Look, some Hebrews coming out of the holes they’ve been hiding in!” "},{"num":12,"verse":"Then the men of the garrison said to Y’honatan and his armor-bearer, “Come up to us; we want to show you something.” Y’honatan told his armor-bearer, “Come on up after me, for Adonai has handed them over to Isra’el.” "},{"num":13,"verse":"Y’honatan climbed up, using his hands as well as his feet, with his armor-bearer behind him. The P’lishtim fell before Y’honatan, and his armor-bearer following him finished them off. "},{"num":14,"verse":"That first slaughter, of about twenty men, was accomplished by Y’honatan and his armor bearer in a space only half as long as one side of the area a pair of oxen could plow in a day [about 200 yards]."},{"num":15,"verse":"There was panic in the field camp among all the P’lishtim; likewise, the garrison and the raiding party panicked. Besides all this, there was an earthquake; thus it grew into panic caused by God. "},{"num":16,"verse":"Sha’ul’s men on watch in Giv‘at-Binyamin could see the enemy camp scattering and running in all directions. "},{"num":17,"verse":"Sha’ul ordered the forces with him to call the roll and see who was missing. So they called the roll, and found Y’honatan and his armor-bearer not present. "},{"num":18,"verse":"Sha’ul told Achiyah, “Bring the ark of God here”; for at that time the ark of God was with the people of Isra’el. "},{"num":19,"verse":"But while Sha’ul was talking to the cohen, the uproar in the camp of the P’lishtim continued and kept getting louder. Sha’ul said to the cohen, “Put your hand down.” "},{"num":20,"verse":"Sha’ul and the entire force with him assembled and went to battle, but they found the P’lishtim all fighting each other in utter confusion. "},{"num":21,"verse":"The Hebrews from the surrounding countryside who had previously been with the P’lishtim and had gone up with them into the camp deserted and went over to Isra’el with Sha’ul and Y’honatan. "},{"num":22,"verse":"Likewise, on hearing that the P’lishtim were fleeing, all the men of Isra’el who had hidden themselves in the hills of Efrayim pursued them in battle. "},{"num":23,"verse":"So Adonai saved Isra’el that day, and the battle spread as far as Beit-Aven."},{"num":24,"verse":"Isra’el’s soldiers had been driven to exhaustion that day; but Sha’ul issued this warning to the people: “A curse on any man who eats any food until evening, when I will have finished taking vengeance on my enemies.” So none of the people even tasted food. "},{"num":25,"verse":"Now the people came to a forest where there was a honeycomb on the ground. "},{"num":26,"verse":"When the people had entered the forest, they saw there the honeycomb with honey dripping out; but no one put his hand to his mouth, because the people feared the oath. "},{"num":27,"verse":"But Y’honatan hadn’t heard his father charging the people with the oath, so he put out the end of the staff in his hand, dipped it in the honeycomb and raised it to his mouth; whereupon his eyes lit up. "},{"num":28,"verse":"But one of the people said in response, “Your father strictly charged the people with an oath, ‘A curse on any man who eats any food today’; even though the people are fainting with hunger.” "},{"num":29,"verse":"Y’honatan answered, “My father has brought trouble to the land. Just look how my eyes have lit up because I tasted a little of this honey. "},{"num":30,"verse":"How much greater would the slaughter of the P’lishtim have been today, then, if the people had eaten freely of the spoil they found with their enemies!”"},{"num":31,"verse":"That day they had attacked the P’lishtim from Mikhmas to Ayalon; but the people were very exhausted. "},{"num":32,"verse":"So the people rushed at the spoil, seizing sheep, cows and calves, slaughtering them on the ground, and eating the flesh with the blood. "},{"num":33,"verse":"Sha’ul was told, “Look how the people are sinning against Adonai, eating with the blood.” He said, “You have not kept faith! Roll a big stone to me immediately! "},{"num":34,"verse":"Now,” Sha’ul said, “go around among the people and tell them, ‘Each of you is to bring his cow and his sheep and slaughter them here. Then eat. Don’t sin against Adonai by eating with the blood.” So each person brought his animal with him that evening and killed it there. "},{"num":35,"verse":"Sha’ul erected an altar to Adonai; it was the first altar that he erected to Adonai."},{"num":36,"verse":"Sha’ul said, “Let’s go after the P’lishtim by night. We’ll plunder them until dawn; we won’t leave one of them alive.” They answered, “Do whatever seems good to you.” But the cohen said, “Let’s approach God here.” "},{"num":37,"verse":"Sha’ul consulted God: “Should I go down in pursuit of the P’lishtim? Will you hand them over to Isra’el?” But he didn’t answer him that day. "},{"num":38,"verse":"Sha’ul said, “Come here, all you heads of the people. Think carefully: who has committed this sin today? "},{"num":39,"verse":"For, as Adonai Isra’el’s deliverer lives, even if it proves to be Y’honatan my son, he must be put to death.” But no one among all the people answered him. "},{"num":40,"verse":"Then he said to all Isra’el, “You be on one side, and I and Y’honatan my son will be on the other side.” The people replied to Sha’ul, “Do what seems good to you.” "},{"num":41,"verse":"Sha’ul said to Adonai the God of Isra’el, “Who is right?” Y’honatan and Sha’ul were chosen by lot, and the people went free. "},{"num":42,"verse":"Sha’ul said, “Cast lots between me and Y’honatan my son.” Y’honatan was chosen. "},{"num":43,"verse":"Then Sha’ul said to Y’honatan, “Tell me what you did.” Y’honatan told him, “Yes, I tasted a little honey with the end of the staff in my hand. Here I am; I’m ready to die.” "},{"num":44,"verse":"Sha’ul said, “May God do the same to me and more also if you are not put to death, Y’honatan!” "},{"num":45,"verse":"But the people said to Sha’ul, “Must Y’honatan die, who has accomplished this great deliverance in Isra’el? Heaven forbid! As Adonai lives, not one hair of his head will fall to the ground; because he worked with God today!” In this way the people rescued Y’honatan, so that he didn’t die. "},{"num":46,"verse":"Then Sha’ul stopped pursuing the P’lishtim, and the P’lishtim returned to their own territory."},{"num":47,"verse":"So Sha’ul took over the rulership of Isra’el. He fought against all his enemies on every side — against Mo’av, the people of ‘Amon, Edom, the kings of Tzovah and the P’lishtim. No matter which way he turned, he defeated them. "},{"num":48,"verse":"He demonstrated his strength by attacking ‘Amalek, and he saved Isra’el from the power of those who were plundering them."},{"num":49,"verse":"The sons of Sha’ul were Y’honatan, Yishvi and Malkishua, while the names of his two daughters were these: the name of the older, Merav, and of the younger, Mikhal. "},{"num":50,"verse":"Sha’ul’s wife was named Achino‘am the daughter of Achima‘atz; the commander of his army was named Avner the son of Ner, Sha’ul’s uncle. "},{"num":51,"verse":"Kish was the father of Sha’ul, and Ner the father of Avner was the son of Avi’el."},{"num":52,"verse":"As long as Sha’ul lived there was bitter war against the P’lishtim. Whenever Sha’ul saw any strong or courageous man, he recruited him into his service."}]