[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:18-24 The best way to have a good night, is to keep a good conscience. We are sure of what the king doubted, that the servants of the living God have a Master well able to protect them. See the power of God over the fiercest creatures, and believe his power to restrain the roaring lion that goeth about continually seeking to devour. Daniel was kept perfectly safe, because he believed in his God. Those who boldly and cheerfully trust in God to protect them in the way of duty, shall always find him a present help. Thus the righteous is delivered out of trouble, and the wicked cometh in his stead. The short triumph of the wicked will end in their ruin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then was the king exceeding glad for him - On account of Daniel. That is, he was rejoiced for the sake of Daniel that he had received no hurt, and that he might be restored to his place, and be useful again in the government. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. because he believed—\"Faith\" is stated in Heb 11:33 to have been his actuating principle: a prelude to the Gospel. His belief was not with a view to a miraculous deliverance. He shut his eyes to the event, committing the keeping of his soul to God, in well-doing, as unto a faithful Creator (1Pe 4:19), sure of deliverance in a better life, if not in this.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He trusted in God’s power and faithfulness, not to work a miracle, but committed himself to him as a righteous Judge, who would deliver here, or save him hereafter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then was the king exceeding glad for him,.... For Daniel, because of his safety, because he was alive, and in health, and unhurt; and the speech he made was very acceptable to him, agreeable to his sentiments, and which he was satisfied was just and true: or \"with\", or \"for himself\" (l); being now eased of a guilty and distracted conscience: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and commanded that they should take Daniel up out of the den; that is, he ordered those that were with him, his servants that attended him, either to roll away the stone, and so let him out; or to let down ropes, and draw him out, or ladders by which he might ascend; for one would think it would not have been safe for them to have gone down into it, to take him up: these orders the king gave without the consent of his lords, being animated to it by the miracle wrought: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so Daniel was taken up out of the den, and no manner of hurt was found upon him; no bruise by throwing him into the den, no wound was made by the lions, or his flesh in the least torn by them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because he believed in his God; served and worshipped him; of which service and worship faith is a particular branch, and is put for the whole, and without which it is not pleasing and acceptable to God; he trusted the Lord, he committed himself to his power and providence; he left himself wholly in the hands of the Lord, to dispose of him, whether for life or death, as he pleased; he believed he was able to deliver him, but he was not anxious about it: for this seems not to design any particular act of faith, with respect to this miracle wrought for him, but his general trust and confidence in God; and the apostle seems to have reference to this, when among other things he ascribes to faith the stopping of the mouths of lions, Hebrews 11:33. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because he believed in his God; served and worshipped him; of which service and worship faith is a particular branch, and is put for the whole, and without which it is not pleasing and acceptable to God; he trusted the Lord, he committed himself to his power and providence; he left himself wholly in the hands of the Lord, to dispose of him, whether for life or death, as he pleased; he believed he was able to deliver him, but he was not anxious about it: for this seems not to design any particular act of faith, with respect to this miracle wrought for him, but his general trust and confidence in God; and the apostle seems to have reference to this, when among other things he ascribes to faith the stopping of the mouths of lions, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) \"apud se\", Piscator; \"apud illum\", Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) \"apud se\", Piscator; \"apud illum\", Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then was the king exceeding glad for him, and commanded that they should take Daniel up out of the den. So Daniel was taken up out of the den, and no manner of hurt was found upon him, because he {k} believed in his God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then was the king exceeding glad for him, and commanded that they should take Daniel up out of the den. So Daniel was taken up out of the den, and no manner of hurt was found upon him, because he ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " believed in his God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Because he committed himself wholly to God whose cause he defended, he was assured that nothing but good could come to him: and in this we see the power of faith, as in He 11:33.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] to be omitted (like ‘with himself’ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 6:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because he believed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—or (R.V.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "trusted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in his God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then was the king exceeding glad for him, and commanded that they should take Daniel up out of the den. So Daniel was taken up out of the den, and no manner of hurt was found upon him, because he believed in his God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The verse that occupies the same place in the Septuagint is not a translation of the present verse at all, but looks as if it had been a sentence in the original longer documents which followed the above Massoretic verse, \"Then all the powers gathered together, and saw Daniel, that the lions had not hurt him.\" It is barely possible float the first clause here represents Aramaic text that might be misread into the Massoretic text. Although it is supported by the later versions, the Massoretic text has a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "suspicions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " appearance. The last clause is a moral reflection, unlike anything else in the Book of Daniel, and is omitted, as we saw, from the Septuagint. The assertion of the king's gladness, too, differs in colour from the other statements in the book; thus compare the language concerning Nebuchadnezzar when the three Hebrew youths were delivered from the fiery furnace. At the same time, it is to be observed that the use of the hophal form in the verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hoosaq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is an evidence of the antiquity of this portion of the verse. The hypothesis that tins narrative has been condensed from a longer one, has much to support it. The lesson inculcated, that faith in God would result in deliverance, is very true, even though it was not in the text. The irregular form of the adjective ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "t'ayb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " points out a possibility that there has been some modification of the text. Sometimes words not understood have resulted in known words being written in an irregular way. Daniel 6:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After Daniel had been thrown into the lions' den, its mouth was covered with a flat stone, and the stone was sealed with the king's seal and that of the great officers of state, that nothing might change or be changed (בּּדּניּאל צבוּ) concerning Daniel (צבוּ, affair, matter), not that the device against Daniel might not be frustrated (Hv., v. Leng., Maur., Klief.). This thought required the stat. emphat. צנוּתא, and also does not correspond with the application of a double seal. The old translator Theodot. is correct in his rendering: ὅπως μὴ ἀλλοιωθῇ πρᾶγμα ἐν τῷ Δανιήλ, and the lxx paraphrasing: ὅπως μὴ απ ̓αὐτῶν (μεγιστάνων) αρθῇ ὁ Δανιήλ, ἤ ὁ βασιλεύς αὐτὸν ἀνασπάσῃ ἐκ τοῦ λακκοῦ. Similarly also Ephr. Syr. and others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The den of lions is designated by גּבּא, which the Targg. use for the Hebr. בור, a cistern. From this v. Leng., Maur., and Hitzig infer that the writer had in view a funnel-shaped cistern dug out in the ground, with a moderately small opening or mouth from above, which could be covered with a stone, so that for this one night the lions had to be shut in, while generally no stone lay on the opening. The pit also into which Joseph, the type of Daniel, was let down was a cistern (Genesis 37:24), and the mouth of the cistern was usually covered with a stone (Genesis 29:3; Lamentations 3:53). It can hence scarcely be conceived how the lions, over which no angel watched, could have remained in such a subterranean cavern covered with a stone. \"The den must certainly have been very capacious if, as it appears, 122 men with their wives and children could have been thrown into it immediately after one another (v. 25 [Daniel 6:24]); but this statement itself only shows again the deficiency of every view of the matter,\" - and thus the whole history is a fiction fabricated after the type of the history of Joseph! But these critics who speak thus have themselves fabricated the idea of the throwing into the den of 122 men with women and children - for the text states no number - in order that they might make the whole narrative appear absurd.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The den of lions is designated by גּבּא, which the Targg. use for the Hebr. בור, a cistern. From this v. Leng., Maur., and Hitzig infer that the writer had in view a funnel-shaped cistern dug out in the ground, with a moderately small opening or mouth from above, which could be covered with a stone, so that for this one night the lions had to be shut in, while generally no stone lay on the opening. The pit also into which Joseph, the type of Daniel, was let down was a cistern (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the mouth of the cistern was usually covered with a stone (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 29:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 3:53",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It can hence scarcely be conceived how the lions, over which no angel watched, could have remained in such a subterranean cavern covered with a stone. \"The den must certainly have been very capacious if, as it appears, 122 men with their wives and children could have been thrown into it immediately after one another (v. 25 [",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "]); but this statement itself only shows again the deficiency of every view of the matter,\" - and thus the whole history is a fiction fabricated after the type of the history of Joseph! But these critics who speak thus have themselves fabricated the idea of the throwing into the den of 122 men with women and children - for the text states no number - in order that they might make the whole narrative appear absurd.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "We have no account by the ancients of the construction of lions' dens. Ge. Hst, in his work on Fez and Morocco, p. 77, describes the lions' dens as they have been found in Morocco. According to his account, they consist of a large square cavern under the earth, having a partition-wall in the middle of it, which is furnished with a door, which the keeper can open and close from above. By throwing in food they can entice the lions from the one chamber into the other, and then, having shut the door, they enter the vacant space for the purpose of cleaning it. The cavern is open above, its mouth being surrounded by a wall of a yard and a half high, over which one can look down into the den. This description agrees perfectly with that which is here given in the text regarding the lions' den. Finally, גּבּא does not denote common cisterns. In Jeremiah 41:7, Jeremiah 41:9, גּוּבא (Hebr. בור) is a subterranean chamber into which seventy dead bodies were cast; in Isaiah 14:15, the place of Sheol is called גּוב. No reason, therefore, exists for supposing that it is a funnel-formed cistern. The mouth (פּוּם) of the den is not its free opening above by which one may look down into it, but an opening made in its side, through which not only the lions were brought into it, but by which also the keepers entered for the purpose of cleansing the den and of attending to the beasts, and could reach the door in the partition-wall (cf. Hst, p. 270). This opening was covered with a great flat stone, which was sealed, the free air entering to the lions from above. This also explains how, according to Daniel 6:20 ff., the king was able to converse with Daniel before the removal of the stone (namely, by the opening above).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We have no account by the ancients of the construction of lions' dens. Ge. Hst, in his work on Fez and Morocco, p. 77, describes the lions' dens as they have been found in Morocco. According to his account, they consist of a large square cavern under the earth, having a partition-wall in the middle of it, which is furnished with a door, which the keeper can open and close from above. By throwing in food they can entice the lions from the one chamber into the other, and then, having shut the door, they enter the vacant space for the purpose of cleaning it. The cavern is open above, its mouth being surrounded by a wall of a yard and a half high, over which one can look down into the den. This description agrees perfectly with that which is here given in the text regarding the lions' den. Finally, גּבּא does not denote common cisterns. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 41:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 41:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", גּוּבא (Hebr. בור) is a subterranean chamber into which seventy dead bodies were cast; in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 14:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the place of Sheol is called גּוב. No reason, therefore, exists for supposing that it is a funnel-formed cistern. The mouth (פּוּם) of the den is not its free opening above by which one may look down into it, but an opening made in its side, through which not only the lions were brought into it, but by which also the keepers entered for the purpose of cleansing the den and of attending to the beasts, and could reach the door in the partition-wall (cf. Hst, p. 270). This opening was covered with a great flat stone, which was sealed, the free air entering to the lions from above. This also explains how, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ff., the king was able to converse with Daniel before the removal of the stone (namely, by the opening above).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Daniel 6:19-21 (Daniel 6:18-20)",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:19-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:18-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Then the king went to his palace, and passed the night fasting: neither were any of his concubines brought before him; and this sleep went from him. The king spent a sleepless night in sorrow on account of Daniel. טות, used adverbially, in fasting, i.e., without partaking of food in the evening. דּחוה, concubina; cf. The Arab. dahâ and dahâ equals , subigere faeminam, and Gesen. Thes. p. 333. On the following morning (v. 20 [Daniel 6:19]) the king rose early, at the dawn of day, and went to the den of lions, and with lamentable voice called to him feebly hoping that Daniel might be delivered by his God whom he continually served. Daniel answered the king, thereby showing that he had been preserved; whereupon the king was exceeding glad. The future or imperf. יקוּם (Daniel 6:19) is not to be interpreted with Kranichfeld hypothetically, he thought to rise early, seeing he did actually rise early, but is used instead of the perf. to place the clause in relation to the following, meaning: the king, as soon as he arose at morning dawn, went hastily by the early light. בּנגהא, at the shining of the light, serves for a nearer determination of the בּשׁפרפּרא, at the morning dawn, namely, as soon as the first rays of the rising sun appeared. The predicate the living God is occasioned by the preservation of life, which the king regarded as possible, and probably was made known to the king in previous conversations with Daniel; cf. Psalm 42:3; Psalm 84:3; 1 Samuel 17:36, etc.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then the king went to his palace, and passed the night fasting: neither were any of his concubines brought before him; and this sleep went from him. The king spent a sleepless night in sorrow on account of Daniel. טות, used adverbially, in fasting, i.e., without partaking of food in the evening. דּחוה, concubina; cf. The Arab. dahâ and dahâ equals , subigere faeminam, and Gesen. Thes. p. 333. On the following morning (v. 20 [",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "]) the king rose early, at the dawn of day, and went to the den of lions, and with lamentable voice called to him feebly hoping that Daniel might be delivered by his God whom he continually served. Daniel answered the king, thereby showing that he had been preserved; whereupon the king was exceeding glad. The future or imperf. יקוּם (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is not to be interpreted with Kranichfeld hypothetically, he thought to rise early, seeing he did actually rise early, but is used instead of the perf. to place the clause in relation to the following, meaning: the king, as soon as he arose at morning dawn, went hastily by the early light. בּנגהא, at the shining of the light, serves for a nearer determination of the בּשׁפרפּרא, at the morning dawn, namely, as soon as the first rays of the rising sun appeared. The predicate the living God is occasioned by the preservation of life, which the king regarded as possible, and probably was made known to the king in previous conversations with Daniel; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Daniel 6:22-24 (Daniel 6:21-23)",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:22-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:21-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In his answer Daniel declares his innocence, which God had recognised, and on that account had sent His angel (cf. Psalm 34:8; Psalm 91:11.) to shut the mouths of the lions; cf. Hebrews 10:33. ואף, and also (concluding from the innocence actually testified to by God) before the king, i.e., according to the king's judgment, he had done nothing wrong or hurtful. By his transgression of the edict he had not done evil against the king's person. This Daniel could the more certainly say, the more he perceived how the king was troubled and concerned about his preservation, because in Daniel's transgression he himself had seen no conspiracy against his person, but only fidelity toward his own God. The king hereupon immediately gave command that he should be brought out of the den of lions. The Aph. הנסקה and the Hoph. הסּק, to not come from נסק, but from סלק; the  נis merely compensative. סלק, to mount up, Aph. to bring out; by which, however, we are not to understand a being drawn up by ropes through the opening of the den from above. The bringing out was by the opened passage in the side of the den, for which purpose the stone with the seals was removed. To make the miracle of his preservation manifest, and to show the reason of it, v. 24 (Daniel 6:23) states that Daniel was found without any injury, because he had trusted in his God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In his answer Daniel declares his innocence, which God had recognised, and on that account had sent His angel (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 34:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 91:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) to shut the mouths of the lions; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ואף, and also (concluding from the innocence actually testified to by God) before the king, i.e., according to the king's judgment, he had done nothing wrong or hurtful. By his transgression of the edict he had not done evil against the king's person. This Daniel could the more certainly say, the more he perceived how the king was troubled and concerned about his preservation, because in Daniel's transgression he himself had seen no conspiracy against his person, but only fidelity toward his own God. The king hereupon immediately gave command that he should be brought out of the den of lions. The Aph. הנסקה and the Hoph. הסּק, to not come from נסק, but from סלק; the  נis merely compensative. סלק, to mount up, Aph. to bring out; by which, however, we are not to understand a being drawn up by ropes through the opening of the den from above. The bringing out was by the opened passage in the side of the den, for which purpose the stone with the seals was removed. To make the miracle of his preservation manifest, and to show the reason of it, v. 24 (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") states that Daniel was found without any injury, because he had trusted in his God.",
            "children": []
          }
        ]
      }
    ]
  }
]