[{"header":"The Collection for Christians in Jerusalem"},{"num":8,"verse":"Brothers and sisters, we want you to know how God showed his kindness  to the churches in the province of Macedonia. "},{"num":2,"verse":"While they were being severely tested by suffering, their overflowing joy, along with their extreme poverty, has made them even more generous. "},{"num":3,"verse":"I assure you that by their own free will they have given all they could, even more than they could afford. "},{"num":4,"verse":"They made an appeal to us, begging us to let them participate in the ministry of God’s kindness to his holy people ⌞in Jerusalem⌟. "},{"num":5,"verse":"They did more than we had expected. First, they gave themselves to the Lord and to us, since this was God’s will. "},{"num":6,"verse":"This led us to urge Titus to finish his work of God’s kindness among you in the same way as he had already started it."},{"num":7,"verse":"Indeed, the more your faith, your ability to speak, your knowledge, your dedication, and your love for us increase, the more we want you to participate in this work of God’s kindness."},{"num":8,"verse":"I’m not commanding you, but I’m testing how genuine your love is by pointing out the dedication of others. "},{"num":9,"verse":"You know about the kindness of our Lord Jesus Christ. He was rich, yet for your sake he became poor in order to make you rich through his poverty."},{"num":10,"verse":"I’m giving you my opinion because it will be helpful to you. Last year you were not only willing ⌞to take a collection⌟ but had already started to do it. "},{"num":11,"verse":"So finish what you began to do. Then your willingness will be matched by what you accomplish "},{"num":12,"verse":"with whatever contributions you have. Since you are willing to do this, ⌞remember⌟ that people are accepted if they give what they are able to give. God doesn’t ask for what they don’t have."},{"num":13,"verse":"I don’t mean that others should have relief while you have hardship. Rather, it’s a matter of striking a balance. "},{"num":14,"verse":"At the present time, your surplus fills their need so that their surplus may fill your need. In this way things balance out. "},{"num":15,"verse":"This is what Scripture says: “Those who had gathered a lot didn’t have too much, and those who gathered a little didn’t have too little.”"},{"num":16,"verse":"I thank God for making Titus as dedicated to you as I am. "},{"num":17,"verse":"He accepted my request and eagerly went to visit you by his own free will."},{"num":18,"verse":"With him we have sent our Christian brother whom all the churches praise for the way he tells the Good News. "},{"num":19,"verse":"More than that, the churches elected him to travel with us and bring this gift of God’s kindness. We are administering it in a way that brings glory to the Lord and shows that we are doing it willingly. "},{"num":20,"verse":"We don’t want anyone to find fault with the way we are administering this generous gift. "},{"num":21,"verse":"We intend to do what is right, not only in the sight of the Lord, but also in the sight of people."},{"num":22,"verse":"We have also sent with them our Christian brother whom we have often tested in many ways and found to be a dedicated worker. We find that he is much more dedicated now than ever because he has so much confidence in you."},{"num":23,"verse":"If any questions are raised, remember that Titus is my partner and coworker to help you. The other men are representatives of the churches and bring glory to Christ. "},{"num":24,"verse":"So give these men a demonstration of your love. Show their congregations that we were right to be proud of you."}]