[{"num":8,"verse":"Now we make known to you, Achim b’Moshiach, the Chen v’Chesed Hashem that was granted to Moshiach’s Kehillot of Macedonia,"},{"num":2,"verse":"That during a great ordeal of tzoros, their abundant simcha and the extreme depth of their oni (poverty) abounded to the osher (riches) of their generosity [SHEMOT 36:5; Pp 1:29-30; 1Th 1:6; 2:14; 3:3 4];"},{"num":3,"verse":"That according to their ability, I give solemn edut, and ad kdei kach (so much) even beyond their ability, they gave voluntarily and of their own accord,"},{"num":4,"verse":"Begging us, requesting from us the privilege of participating in giving tzedakah to the Messianic Jewish ministry of the Kadoshim [Ro 15:26; Ac 11:29; 2C 9:1]"},{"num":5,"verse":"And this not merely according to tikvateinu. They gave themselves first to Adoneinu and to us [Moshiach’s Shlichim] birtzon Hashem (in the will of G-d),"},{"num":6,"verse":"So that it was necessary for us to urge Titos that as he began and made a haschala (start) before, so he should complete among you also this mitzvah of avodas kodesh of the Chen v’Chesed Hashem."},{"num":7,"verse":"Now just as you abound in everything‖in emunah, in torah, in da’as [1C 1:5] and in all zerizut (diligence) and in our ahavah (love) for you‖see also that you excel in this Chen v’Chesed Hashem. [1C 16:1 2]"},{"num":8,"verse":"I do not lay this out as a mitzvah, but the sincerity of your ahavah I am testing against the zerizut of others,"},{"num":9,"verse":"For you have da’as of the Chen v’Chesed of Adoneinu Rebbe, Melech HaMoshiach Yehoshua, who, though being rich, for your sakes, he became poor, [Mt 8:20; Pp 2:6-7] that you by Moshiach’s oni (poverty) may become rich."},{"num":10,"verse":"And in this I give my etza (advice): it is tov me’od that last shanah you were the first not only to give tzedakah but also to be willing to do so."},{"num":11,"verse":"Now also complete what you started! Then your readiness in desiring it may be matched by your finishing it from what you have. [SHEMOT 25:2]"},{"num":12,"verse":"For if the readiness is already present, it is acceptable according to whatever one may have‖not according to what one does not have. [MISHLE 3:27-28; Mk 12:43]"},{"num":13,"verse":"For it is not that there should be relief to others and distress and tzoros to you, but that there should be a balance of equality"},{"num":14,"verse":"During the present time of your abundance for those who lack, and also for your lack there may be their abundance, [2C 9:12] so also there may be equality,"},{"num":15,"verse":"As it has been written V’LO HE’DIF HAMARBEH V’HAMMAMIT LO HECHSIR. (\"The one that gathered the much did not have too much and the one that gathered little did not have too little” SHEMOT 16:18)"},{"num":16,"verse":"But Baruch Hashem, the One having given the same zerizut (diligence) for you in the lev (heart) of Titos,"},{"num":17,"verse":"Because of the chozek (encouragement) he received, and having more zerizut on his own accord, he went forth to you."},{"num":18,"verse":"And we sent with him the Ach b’Moshiach who is bavust (famous) among all the Kehillot for his proclaiming the Besuras HaGeulah,"},{"num":19,"verse":"And not only this but also this Ach b’Moshiach has been handpicked by the Kehillot to travel with us and with this avodas kodesh of chesed being administered by us to the kavod of Adoneinu Himself and as a gvies eidus (testimony) to your goodwill."},{"num":20,"verse":"Avoiding also that anyone should murmur about our handling of this liberal matanah (gift);"},{"num":21,"verse":"For our tachlis is to do what is tov me’od B’EINEI ELOHIM V’ADAM (“in the eyes of G-d and man”). [MISHLE 3:4 TARGUM HASHIVIM]"},{"num":22,"verse":"And we sent with them our Ach b’Moshiach whom we have often tested and found having zerizut in much, and now having even more zerizut by his great bitachon in you."},{"num":23,"verse":"As for Titos, he is my shutaf and your fellow po’el in your avodas kodesh; as for our Achim b’Moshiach, they are shlichim of the Kehillot, the kavod of Moshiach."},{"num":24,"verse":"Therefore, openly before the Moshiach’s Kehillot, demonstrate your ahavah and vindicate our glorying about you [2C 7:14]."}]