[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The chains.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 8:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where they are also ornaments of Midianite kings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "earrings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "These and the “bracelets “were probably of gold. The “mufflers” were the long flowing veil, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mantilla, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "worn so as to cover the head, as now in Spain, or Egypt, or Turkey.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:16-26 The prophet reproves and warns the daughters of Zion of the sufferings coming upon them. Let them know that God notices the folly and vanity of proud women, even of their dress. The punishments threatened answered the sin. Loathsome diseases often are the just punishment of pride. It is not material to ask what sort of ornaments they wore; many of these things, if they had not been in fashion, would have been ridiculed then as now. Their fashions differed much from those of our times, but human nature is the same. Wasting time and money, to the neglect of piety, charity, and even of justice, displease the Lord. Many professors at the present day, seem to think there is no harm in worldly finery; but were it not a great evil, would the Holy Spirit have taught the prophet to expose it so fully? The Jews being overcome, Jerusalem would be levelled with the ground; which is represented under the idea of a desolate female seated upon the earth. And when the Romans had destroyed Jerusalem, they struck a medal, on which was represented a woman sitting on the ground in a posture of grief. If sin be harboured within the walls, lamentation and mourning are near the gates.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The chains - Margin, \"sweet balls.\" The word used here is derived from the verb נטף  nâṭaph, to drop, to fall in drops, or to distil,\" as juice from a plant. Hence, it means that which \"resembles drops\" - as pearls, or precious stones, used as ornaments for the neck or ears. We retain a similar word as applicable to the ornaments of the ears, by calling them \"drops.\" The Chaldee renders this \"chains,\" and so also the Vulgate. The Septuagint understands it of a \"hanging\" or \"pendant\" ornament - and this is its undoubted meaning - an ornament pendant like gum distilling from a plant. 'These consist, first, of one most beautifully worked, with a pendant ornament for the neck; there is also a profusion of others which go round the same part, and rest on the bosom. In making curious chains, the goldsmiths of England do not surpass those of the East.' - \"Roberts.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the bracelets - For the wrists. The Chaldee translates it, 'bracelets for the hands.' These ornaments were very ancient; see Genesis 24:22; Numbers 31:50. - Mahomet promises to those who shall follow him, gold and silver bracelets. 'The bracelets are large ornaments for the wrists, in which are sometimes enclosed small bells.' - \"Roberts.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the bracelets - For the wrists. The Chaldee translates it, 'bracelets for the hands.' These ornaments were very ancient; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 31:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - Mahomet promises to those who shall follow him, gold and silver bracelets. 'The bracelets are large ornaments for the wrists, in which are sometimes enclosed small bells.' - \"Roberts.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Mufflers - Margin, \"spangled ornaments.\" The word used here is derived from a verb, \"to tremble, to shake\" - רעל  râ‛al - and the name is given to the ornament, whatever it was, probably from its \"tremulous\" motion. Perhaps it means a \"light, thin veil;\" or possibly, as in the margin, spangled ornaments, producing a tremulous, changing aspect. In Zechariah 7:2, the word is used to denote 'trembling' - giddiness, or intoxication. It was early customary, and is still common in Oriental countries, for the females to wear veils. No female ventures abroad without her veil. That which is supposed to be intended here, is described by the Arabian scholiast Safieri, quoted by Gesenius. It is drawn tight over the upper part of the head, but the part around the eyes is open, and a space left to see through, and the lower part is left loose and flowing, and thus produces the \"tremulous\" appearance indicated in this place; see the notes and illustrations at Isaiah 3:24. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Mufflers - Margin, \"spangled ornaments.\" The word used here is derived from a verb, \"to tremble, to shake\" - רעל  râ‛al - and the name is given to the ornament, whatever it was, probably from its \"tremulous\" motion. Perhaps it means a \"light, thin veil;\" or possibly, as in the margin, spangled ornaments, producing a tremulous, changing aspect. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 7:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the word is used to denote 'trembling' - giddiness, or intoxication. It was early customary, and is still common in Oriental countries, for the females to wear veils. No female ventures abroad without her veil. That which is supposed to be intended here, is described by the Arabian scholiast Safieri, quoted by Gesenius. It is drawn tight over the upper part of the head, but the part around the eyes is open, and a space left to see through, and the lower part is left loose and flowing, and thus produces the \"tremulous\" appearance indicated in this place; see the notes and illustrations at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. chains—rather, pendants, hanging about the neck, and dropping on the breast.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "mufflers—veils covering the face, with apertures for the eyes, close above and loosely flowing below. The word radically means \"tremulous,\" referring to the changing effect of the spangles on the veil.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The chains,.... According to Kimchi and R. Levi ben Gersom on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 8:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these were drop bottles, or vessels of gold, in which were put stacte or balsam; and the former says here, they were such in which balsam was put, and women hung about their necks; though, he observes, some interpret them of chains, which were made of small stones of bdellium; hence pure bdellium is called in the Arabic tongue  and so Jarchi renders the word \"chains\"; and they are called by this name, because they hang about the neck, and drop upon the breast, and are in the form of precious stones, bored and strung: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the bracelets; hand bracelets, according to the Targum; such as Abraham's servant gave to Rebekah, Genesis 24:22, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the bracelets; hand bracelets, according to the Targum; such as Abraham's servant gave to Rebekah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the mufflers; these were veils which covered the whole face, excepting the eyes, the same that we call masks: it is said (a) of the Arabian women, that they went out  that is, as Bartenora explains it, they were veiled about the head, so that the whole face was covered, excepting their eyes; though Maimonides interprets them of little bells, which the Arabian women went out with; the Targum here explains the word by \"women's veils\"; though some think only the \"spangles\" which were on them are meant, so called from their trembling and shaking motion. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Misn. Sabbat, c. 6. sect. 6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Misn. Sabbat, c. 6. sect. 6. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The chains, and the bracelets, and the mufflers,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " The ear-drops",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 8:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R.V. “collars”) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and the arm-chains and the veils",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—the last (the Arabian ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ra‘l",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is in two parts, one thrown back over the head from above the eyes, the other hanging down over the face.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The chains, and the bracelets, and the mufflers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the ear-drops",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and the armlets",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and the veils",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Earrings were worn from very ancient times by both the Assyrians and the Egyptians. The ring had frequently a pendant hanging from it. Men wore armlets in Assyria, and both men and women in Egypt (Lepsius, 'Denktamer,' pt. 3. pl. 1). Veils have always been regarded in the East as almost a necessary part of female attire. Isaiah 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prophet then proceeds to describe still further how the Lord would take away the whole of their toilet as plunder. \"On that day the Lord will put away the show of the ankle-clasps, and of the head-bands, and of the crescents; the ear-rings, and the arm-chains, and the light veils; the diadems, and the stepping-chains, and the girdles, and the smelling-bottles, and the amulets; the finger-rings, and the nose-rings; the gala-dresses, and the sleeve-frocks, and the wrappers, and the pockets; the hand-mirrors, and the Sindu-cloths, and the turbans, and the gauze mantles.\" The fullest explanation of all these articles of female attire is to be found in N. W. Schrder's work, entitled Commentarius de vestitu mulierum Hebraearum ad Jes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:16-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Ludg. Batav 1745 (a quarto volume), and in that of Ant. Theod. Hartmann, consisting of three octavo volumes, and entitled Die Hebrerin am Putztische und als Braut (The Jewess at the Toilet-table, and as Bride, 1809-10); to which we may also add, Saalschtz, Archaeologie, chapter iii., where he treats of the dresses of men and women. It was not usually Isaiah's custom to enter into such minute particulars. Of all the prophets, Ezekiel was the one most addicted to this, as we may see, for example, from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And even in other prophecies against the women we find nothing of the kind again (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). But in this instance, the enumeration of the female ornaments is connected with that of the state props in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and that of the lofty and exalted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:13-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so as to form a trilogy, and has its own special explanation in that boundless love of ornament which had become prevalent in the time of Uzziah-Jotham. It was the prophet's intention to produce a ludicrous, but yet serious impression, as to the immeasurable luxury which really existed; and in the prophetic address, his design throughout is to bring out the glaring contrast between the titanic, massive, worldly glory, in all its varied forms, and that true, spiritual, and majestically simple glory, whose reality is manifested from within outwards. In fact, the theme of the whole address is the way of universal judgment leading on from the false glory to the true. The general idea of tiphereth (show: rendered \"bravery\" in Eng. ver.) which stands at the head and includes the whole, points to the contrast presented by a totally different tiphereth which follows in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In explaining each particular word, we must be content with what is most necessary, and comparatively the most certain. \"Ankle-clasps\" (acâsim): these were rings of gold, silver, or ivory, worn round the ankles; hence the denom. verb (icces) in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to make a tinkling sound with these rings. \"Head-bands,\" or \"frontlets\" (shebisim, from shâbas  equals  shâbatz: plectere), were plaited bands of gold or silver thread worn below the hair-net, and reaching from one ear to the other. There is some force, however, in the explanation which has been very commonly adopted since the time of Schrder, namely, that they were sun-like balls ( equals  shemisim), which were worn as ornaments round the neck, from the Arabic ‛sumeisa (‛subeisa), a little sun. The \"crescents\" (saharonim) were little pendants of this kind, fastened round the neck and hanging down upon the breast (in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 8:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we meet with them as ornaments hung round the camels' necks). Such ornaments are still worn by Arabian girls, who generally have several different kinds of them; the hilâl, or new moon, being a symbol of increasing good fortune, and as such the most approved charm against the evil eye. \"Ear-rings\" (netiphoth, ear-drops): we meet with these in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 8:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as an ornament worn by Midianitish kings. Hence the Arabic munattafe, a woman adorned with ear-rings. \"Arm-chains:\" sheroth, from shâra, to twist. According to the Targum, these were chains worn upon the arm, or spangles upon the wrist, answering to the spangles upon the ankles. \"Fluttering veils\" (re'âloth, from râ'al, to hang loose): these were more expensive than the ordinary veils worn by girls, which were called tza'iph. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Diadems\" (pe'erim) are only mentioned in other parts of the Scriptures as being worn by men (e.g., by priests, bride-grooms, or persons of high rank). \"Stepping-chains:\" tze'âdoth, from tze'âdah, a step; hence the chain worn to shorten and give elegance to the step. \"Girdles:\" kisshurim, from kâshar (Cingere), dress girdles, such as were worn by brides upon their wedding-day (compare Jeremiah 2:32 with Isaiah 49:18); the word is erroneously rendered hair-pins (kalmasmezayyah) in the Targum. \"Smelling-bottles:\" botte hannephesh, holders of scent (nephesh, the breath of an aroma). \"Amulets:\" lechashim (from lâchash, to work by incantations), gems or metal plates with an inscription upon them, which were worn as a protection as well as an ornament. \"Finger-rings:\" tabbâ'oth, from tâba, to impress or seal, signet-rings worn upon the finger, corresponding to the Chothâm worn by men upon the breast suspended by a cord. \"Nose-rings\" (nizmê hâaph) were fastened in the central division of the nose, and hung down over the mouth: they have been ornaments in common use in the East from the time of the patriarchs (Genesis 24:22) down to the present day. \"Gala-dresses\" (machalâtsoth) are dresses not usually worn, but taken off when at home. \"Sleeve-frocks\" (ma'atâphâh): the second tunic, worn above the ordinary one, the Roman stola. \"Wrappers\" (mitpâchoth, from tâphach, expandere), broad cloths wrapped round the body, such as Ruth wore when she crept in to Boaz in her best attire (Ruth 3:15). \"Pockets\" (Charitim) were for holding money (2 Kings 5:23), which was generally carried by men in the girdle, or in a purse (Cis). \"Hand-mirrors\" (gilyonim): the Septuagint renders this διαφανῆ λακωνικὰ, sc. ἱμάτια, Lacedaemonian gauze or transparent dresses, which showed the nakedness rather than concealed it (from gâlâh, retegere); but the better rendering is mirrors with handles, polished metal plates (from gâlâh, polire), as gillâyon is used elsewhere to signify a smooth table. \"Sindu-cloths\" (sedinim), veils or coverings of the finest linen, viz., of Sindu or Hindu cloth (σινδόνες) - Sindu, the land of Indus, being the earlier name of India.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Diadems\" (pe'erim) are only mentioned in other parts of the Scriptures as being worn by men (e.g., by priests, bride-grooms, or persons of high rank). \"Stepping-chains:\" tze'âdoth, from tze'âdah, a step; hence the chain worn to shorten and give elegance to the step. \"Girdles:\" kisshurim, from kâshar (Cingere), dress girdles, such as were worn by brides upon their wedding-day (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); the word is erroneously rendered hair-pins (kalmasmezayyah) in the Targum. \"Smelling-bottles:\" botte hannephesh, holders of scent (nephesh, the breath of an aroma). \"Amulets:\" lechashim (from lâchash, to work by incantations), gems or metal plates with an inscription upon them, which were worn as a protection as well as an ornament. \"Finger-rings:\" tabbâ'oth, from tâba, to impress or seal, signet-rings worn upon the finger, corresponding to the Chothâm worn by men upon the breast suspended by a cord. \"Nose-rings\" (nizmê hâaph) were fastened in the central division of the nose, and hung down over the mouth: they have been ornaments in common use in the East from the time of the patriarchs (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") down to the present day. \"Gala-dresses\" (machalâtsoth) are dresses not usually worn, but taken off when at home. \"Sleeve-frocks\" (ma'atâphâh): the second tunic, worn above the ordinary one, the Roman stola. \"Wrappers\" (mitpâchoth, from tâphach, expandere), broad cloths wrapped round the body, such as Ruth wore when she crept in to Boaz in her best attire (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). \"Pockets\" (Charitim) were for holding money (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 5:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which was generally carried by men in the girdle, or in a purse (Cis). \"Hand-mirrors\" (gilyonim): the Septuagint renders this διαφανῆ λακωνικὰ, sc. ἱμάτια, Lacedaemonian gauze or transparent dresses, which showed the nakedness rather than concealed it (from gâlâh, retegere); but the better rendering is mirrors with handles, polished metal plates (from gâlâh, polire), as gillâyon is used elsewhere to signify a smooth table. \"Sindu-cloths\" (sedinim), veils or coverings of the finest linen, viz., of Sindu or Hindu cloth (σινδόνες) - Sindu, the land of Indus, being the earlier name of India.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The Mishna (Kelim xxiv 13) mentions three different sedinin: night dresses, curtains, and embroidery. The sindon is frequently referred to as a covering wrapped round the person; and in b. Menachoth 41a, it is stated that the sindom is the summer dress, the sarbal (cloak) the winter dress, which may help to explain Mark 14:51-52.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The Mishna (Kelim xxiv 13) mentions three different sedinin: night dresses, curtains, and embroidery. The sindon is frequently referred to as a covering wrapped round the person; and in b. Menachoth 41a, it is stated that the sindom is the summer dress, the sarbal (cloak) the winter dress, which may help to explain ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:51-52",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Turbans\" (tseniphoth, from tsânaph, Convolvere), the head-dress composed of twisted cloths of different colours. \"Gauze mantles\" (redidim, from râdad, extendere, tenuem facere), delicate veil-like mantles thrown over the rest of the clothes. Stockings and handkerchiefs are not mentioned: the former were first introduced into Hither Asia from Media long after Isaiah's time, and a Jerusalem lady no more thought of suing the latter than a Grecian or Roman lady did. Even the veil (burko) now commonly worn, which conceals the whole of the face with the exception of the eyes, did not form part of the attire of an Israelitish woman in the olden time.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Rashi, however, makes a different statement (Sabbath 65a), viz., that \"Israelitish women in Arabia go out with veils which conceal the face, and those in Media with their mantles fastened about the mouth.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The prophet enumerates twenty-one different ornaments: three sevens of a very bad kind, especially for the husbands of these state-dolls. There is no particular order observed in the enumeration, either from head to foot, or from the inner to the outer clothing; but they are arranged as much ad libitum as the dress itself. ",
        "children": []
      }
    ]
  }
]