[[],[{"type":"prose","content":"A word of Jehovah that hath been unto Micah the Morashite in the days of Jotham, Ahaz, Hezekiah, kings of Judah, that he hath seen concerning Samaria and Jerusalem:"}],[{"type":"prose","content":"Hear, O peoples, all of them! Attend, O earth, and its fulness, And the Lord Jehovah is against you for a witness, The Lord from His holy temple."}],[{"type":"prose","content":"For lo, Jehovah is going out from His place, And He hath come down, And hath trodden on high places of earth."}],[{"type":"prose","content":"Melted have been the mountains under Him, And the valleys do rend themselves, As wax from the presence of fire, As waters cast down by a slope."}],[{"type":"prose","content":"For the transgression of Jacob [is] all this, And for the sins of the house of Israel. What [is] the transgression of Jacob? Is it not Samaria? And what the high places of Judah? Is it not Jerusalem?"}],[{"type":"prose","content":"And I have set Samaria for a heap of the field, For plantations of a vineyard, And poured out into a valley her stones, And her foundations I uncover."}],[{"type":"prose","content":"And all her graven images are beaten down, And all her gifts are burnt with fire, And all her idols I make a desolation, For, from the hire of a harlot she gathered, and unto the hire of a harlot they return."}],[{"type":"prose","content":"For this I lament and howl, I go spoiled and naked, I make a lamentation like dragons, And a mourning like daughters of an ostrich."}],[{"type":"prose","content":"For mortal [are] her wounds, For it hath come unto Judah, It hath come to a gate of My people -- to Jerusalem."}],[{"type":"prose","content":"In Gath tell ye not -- in Acco weep not, In Beth-Aphrah, in dust roll thyself."}],[{"type":"prose","content":"Pass over for thee, O inhabitant of Shaphir, Naked one of shame. Not gone out hath the inhabitant of Zaanan, The lamentation of Beth-Ezel doth take from you its standing."}],[{"type":"prose","content":"For stayed for good hath the inhabitant of Maroth, For evil hath come down from Jehovah to the gate of Jerusalem."}],[{"type":"prose","content":"Bind the chariot to a swift beast, O inhabitant of Lachish, The beginning of sin [is] she to the daughter of Zion, For in thee have been found the transgressions of Israel."}],[{"type":"prose","content":"Therefore thou givest presents to Moresheth-Gath, The houses of Achzib become a lying thing to the kings of Israel."}],[{"type":"prose","content":"Yet the possessor I do bring in to thee, O inhabitant of Mareshah, To Adullam come in doth the honour of Israel."}],[{"type":"prose","content":"Make bald and shave, for thy delightful sons, Enlarge thy baldness as an eagle, For they have removed from thee!"}]]