[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then saith. he to Thomas . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This implies a knowledge of the words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 20:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which in itself would carry conviction to the mind of Thomas. This repetition must have carried with this conviction a sense of shame at his unbelief.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And be not faithless, but believing.—Better, and become not unbelieving, but believing. The words do not apply to the fact of the Resurrection only, but to the general spiritual condition of the Apostle. He was in danger of passing from the state of a believer in Christ to that of an unbeliever. His demand for the evidence of the senses was a step backward, a resting on the less, not on the more, certain. His Master would have him retrace that step, and become one who rests upon the intuition of the Spirit.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And be not faithless, but believing.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and become not unbelieving, but believing.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The words do not apply to the fact of the Resurrection only, but to the general spiritual condition of the Apostle. He was in danger of passing from the state of a believer in Christ to that of an unbeliever. His demand for the evidence of the senses was a step backward, a resting on the less, not on the more, certain. His Master would have him retrace that step, and become one who rests upon the intuition of the Spirit.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "John 20:27-29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 20:27-29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then said he to Thomas, Reach hither thy finger, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Thus our Lord lets them see, that he was not unacquainted with what had lately passed among them in his absence, and at the same time takes an effectual way to convince and satisfy his over-scrupulous disciple. Referring to what Thomas had said, he answers it word for word: for he had heard it, though unseen: and one would suppose that his telling him of it so particularly must surely have put him to the blush. Observe well, reader, there is not an unbelieving word in our tongues, no, nor thought in our minds at any time, but it is known to the Lord Jesus. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And be not faithless, but believing ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Believe on this evidence at least, which addresses itself to so many of thy senses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Thomas ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Overwhelmed at once with such abundant demonstration of the fact in question, and such condescending kindness of his Master, fell under the conviction in a moment, and, instead of entering on any further scrutiny, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "answered ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In the utmost transport of astonishment and joy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My Lord and my God! ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As if he had said, I now not only acknowledge thee to be Jesus my Lord, as I have formerly done, and to be infallibly risen from the dead, as my fellow- disciples have affirmed, but I confess thy divine knowledge and power, and prostrate myself before thee as the great incarnate Deity, the glorious Immanuel. And this glorious confession he makes without putting his finger into the print of the nails, &c. The irrefragable argument arising from these words, in proof of the Deity of our blessed Lord, (which so many good writers have stated at large,) cannot be evaded by saying, that these words are only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an exclamation of surprise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as if he had said, Good God! is it indeed thus? for it is expressly declared, he spoke these words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to him:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and no doubt Christ would severely have reproved him, if there had not been just reason to address him thus. It is worthy of observation here, that this slowness and backwardness in Thomas to believe, ought to strengthen and confirm our faith. For hereby it appears, that the witnesses of Christ’s resurrection, who attested it to the world, and pledged their lives upon it, were not easy, credulous men, but very cautious persons, that suspended their belief till they saw the utmost evidence of it which they could desire. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus saith unto him, Because thou hast seen me, thou hast believed ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Thou hast believed my resurrection, because thou hast had it confirmed to thee by the united testimony of several of thy senses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessed are they who have not seen ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "me themselves, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and yet have believed ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— On the credible testimony of others. For they have manifested a greater degree of candour and humility, which renders the faith it produces so much the more acceptable: in other words, they are persons of a more pious and virtuous disposition, who, without the evidence of sense, are so candid as to yield to the proofs which the divine wisdom has thought sufficient for convincing the world. If it be queried why a greater blessedness is pronounced on those who believe on more slender evidence, it may be answered, that our Lord by no means intended to assert, that every one who believes without seeing, is happier than any one believing on sight; for then the meanest Christian now would be more happy than the greatest of the apostles: but only that, where the effects of that faith were equal, it argued greater simplicity, candour, and wisdom to yield to reasonable evidence ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "without seeing, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "than could be argued merely from having believed ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on sight, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "after sufficient evidence of another kind had been proposed. It was therefore, in effect, telling Thomas, his faith would have been more acceptable, if he had not stood out so long: and it was doing it in such a manner as would be most calculated for the comfort and encouragement of believers in future ages, to whom, in many of his speeches to the apostles themselves, our Lord expresses a most obliging and affectionate regard. Let us then maturely consider this declaration of our great Instructer and Saviour. And though we have not those sensible manifestations which were granted to Thomas, let it suffice us, that the apostles were the appointed witnesses of all these things; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what they saw with their eyes, and their hands handled, of the word of life, that have they declared unto us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Let us thankfully receive so convincing a testimony. Let us show an upright and candid mind in accepting such evidence as the wisdom of God has seen fit to give us; remembering, that a truly rational faith is the more acceptable to God, in proportion to the difficulties which it is able to surmount; and that there are peculiar blessings in store for them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "who have not seen, and yet believed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:26-29 That one day in seven should be religiously observed, was an appointment from the beginning. And that, in the kingdom of the Messiah, the first day of the week should be that solemn day, was pointed out, in that Christ on that day once and again met his disciples in a religious assembly. The religious observance of that day has come down to us through every age of the church. There is not an unbelieving word in our tongues, nor thought in our minds, but it is known to the Lord Jesus; and he was pleased to accommodate himself even to Thomas, rather than leave him in his unbelief. We ought thus to bear with the weak, Ro 15:1,2. This warning is given to all. If we are faithless, we are Christless and graceless, hopeless and joyless. Thomas was ashamed of his unbelief, and cried out, My Lord and my God. He spoke with affection, as one that took hold of Christ with all his might; My Lord and my God. Sound and sincere believers, though slow and weak, shall be graciously accepted of the Lord Jesus. It is the duty of those who read and hear the gospel, to believe, to embrace the doctrine of Christ, and that record concerning him, 1Jo 5:11.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And after eight days again - That is, on the return of the first day of the week. From this it appears that they thus early set apart this day for assembling together, and Jesus countenanced it by appearing twice with them. It was natural that the apostles should observe this day, but not probable that they would do it without the sanction of the Lord Jesus. His repeated presence gave such a sanction, and the historical fact is indisputable that from this time this day was observed as the Christian Sabbath. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 20:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. Then saith he to Thomas, Reach hither … behold … put it into my side, and be not faithless, but believing—\"There is something rhythmical in these words, and they are purposely couched in the words of Thomas himself, to put him to shame\" [Luthardt]. But wish what condescension and gentleness is this done!",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " We had need take heed what we speak wherever we are. Christ had not after his resurrection so ordinary and frequent a converse with his disciples as before. This is the fifth time that we read of Christ’s appearing to them since his resurrection. He knew what words of unbelief Thomas had uttered, and accordingly applies himself to him, in a wonderful condescension to his weakness; he bids him reach his finger, and his hands, and behold his hands, and thrust his hands into his side. So pitiful is our Lord, and compassionate towards the infirmities of his people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then saith he to Thomas,.... For whose sake he chiefly came, and whom he at once singled out from the rest, and called by name in the most friendly manner, without upbraiding or reproaching him for not believing the testimony that had been given him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "reach hither thy finger, and behold my hands, and reach hither thine hand and thrust it into my side; that is, make use of every way by seeing, feeling, and examining the scars in my hands, and the hole in my side, and satisfy thyself in the manner thou hast desired; which shows the omniscience of Christ, who knew what had passed between him and the other disciples, and the very words Thomas had expressed himself in; also his great humility and condescension in submitting himself to be examined in the very manner he had fixed; and likewise the reality of his resurrection: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and be not faithless, but believing; in which words Christ dissuades him from unbelief, which is very evil in its own nature, and in its effects; it is the root of all evil; it unfits for duty, and renders the word unprofitable, and leads men off from Christ; and is the more aggravated in the people of God, by the instances, declarations, and promises of grace, and discoveries of love made unto them: and he also encourages him to believe. The exercise of the grace of faith is well pleasing to Christ; it gives glory to him, and makes for the soul's comfort; and a word from Christ, his power going along with it, will enable men to believe, as it did Thomas; which appears by what follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and be not faithless, but believing; in which words Christ dissuades him from unbelief, which is very evil in its own nature, and in its effects; it is the root of all evil; it unfits for duty, and renders the word unprofitable, and leads men off from Christ; and is the more aggravated in the people of God, by the instances, declarations, and promises of grace, and discoveries of love made unto them: and he also encourages him to believe. The exercise of the grace of faith is well pleasing to Christ; it gives glory to him, and makes for the soul's comfort; and a word from Christ, his power going along with it, will enable men to believe, as it did Thomas; which appears by what follows. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then saith he to Thomas, Reach hither thy finger, and behold my hands; and reach hither thy hand, and thrust it into my side: and be not faithless, but believing.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 20:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Εἶτα λέγει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πιστός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He does not need to be informed of Thomas’ incredulity; although it is quite possible that, as Lücke supposes, the others had mentioned it to Him. Still, this is not in the text. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Weiss, who also quotes Bengel’s characteristic note: “Si Pharisaeus ita dixisset Nisi videro, etc., nil impetrasset; sed discipulo pridem probato nil non datur,”. Weiss supposes the hands were seen (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἴδε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the side only touched under the clothes. Some suppose that as the feet are not mentioned in this passage, they had not been nailed but only bound to the cross. See Lücke’s interesting note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ μὴ γίνου ἄπιστος ἀλλὰ πιστός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Incredulitas aliquid habet de voluntario”.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] He at once shews to S. Thomas that He knows the test that he had demanded.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "behold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, see; it is the same word as S. Thomas used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 20:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 20:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "become",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The demand for this proof did not make S. Thomas faithless, but it placed him in peril of becoming so. ‘Faithless’ and ‘believing’ are verbal as well as actual contradictories in the Greek. ‘Faithless’ and ‘faithful,’ ‘unbelieving and ‘believing’ would in this respect be better; but it is best to leave it as in the A. V.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 20:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τῶ Θωμᾷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to Thomas",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He had previously believed: on this account he is not even now cast away.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φέρε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "reach",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") apply to.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὶν δάκτυλόν σου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy finger",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Thomas’ own words are retorted upon him: how must he have been astonished, we may suppose, at the omniscience and goodness of the Saviour! If a Pharisee had spoken thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unless I shall see",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., he would have obtained nothing; but to a disciple that has been formerly approved of, there is nothing that is not given.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὧδε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hither",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The Demonstrative.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἴδε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") touch and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "see",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thomas had said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐὰν μὴ ἴδω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unless I shall see",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πιστὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "believing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He had said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will not believe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εϊτα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "οϋν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; delude, Vulgate; darnach, Luther) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "saith he to Thomas,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as though he had read his heart and sounded the depth of his complicated conflict between hope and fear, despair and love, and moreover intimating the fact that he had heard his disciple's protestations, as well as mercifully appreciated his genuine difficulties, and not unnatural hesitation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Reach hither thy finger, that organ with which thou wouldest test the reality of my being.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Do what thou wilt. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "See! my hands",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and as the word was spoken he spread before his doubting, loving disciple those hands which were nailed to the cursed tree, with all the signs of his great agony upon them still. Thomas had said that he must \"see,\" and that he must touch - \"lay his finger in the print of the nails.\" Here was the Divine opportunity for him, with more than one sense, to assure himself of the reality. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And reach hither thy hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (again the Lord quoted the very words in which the incredulousness of Thomas had been expressed), and put it into my side. He says nothing of the print of the nails, but offers the sacred privilege to the doubtful disciple. Thomas shall have the precise evidence he craved. The most hesitating of the entire group shall have the aid to his faith which he fancied indispensable in his particular case. How often has the unbeliever said, \"If such or such evidence be not granted to me, I cannot, I will not, I by no means will believe\"! Thus Gideon proved the Lord's willingness to utilize his feeble strength in delivering Israel from the Midianites; and even Ahaz was summoned by Isaiah to choose any sign whatsoever in heaven above or in the earth to prove the indestructible vitality of the true seed of Israel and real house of David. Consequently, we cannot say with Bengel, \"Si Pharisseus its dixisset, 'nisi videro, etc.,' nil impetrasset sed discipulo pridem probato nil non datur.\" The Lord does sometimes offer exactly what we ask by way of proof; but we cannot know the precise effect it will produce, even when it is bestowed or when something still more explicit is actually provided for our weakness. Just as the cruel taunts which malice heaped or hurled on the name and work of our Divine Lord became wreaths of glory for his brow, so the cruel wounds which unbelief and bigoted hatred of goodness had inflicted on Immanuel became from that very hour the high, main, indelible evidence of his supreme victory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And become not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μὴ γίνου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") what thou art in danger of becoming - the Lord does not say that Thomas's - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "faithless",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but that he runs the risk of ultimately becoming so through the dependence of his spirit upon the outward (so Meyer, Lange, Westcott, etc.); but be believing, faithful. It is impossible fully to express the play upon these two words. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἄπιστος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not so much a worthless, untrustworthy person, as one who has settled down into an abiding condition of unbelief; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πίστος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not simply\" believing,\" but\" trustworthy,\" \"trusty,\" and \"trustful.\" John 20:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Be not (μὴ γίνου)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Literally, become not. Thomas was in a fair way to become unbelieving, through his doubt of the resurrection.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Faithless - believing (ἄπιστος  - πιστός)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There is a correspondence of the words here, to which, perhaps, the nearest approach in English is unbelieving, believing. ",
        "children": []
      }
    ]
  }
]