[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(29) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jesus saith unto him, Thomas, because thou hast seen me, thou hast believed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The name “Thomas” is omitted in all the better MSS., and the order of the other words suggests that they should be read interrogatively—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus saith unto him, Because thou hast seen Me, hast thou believed?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The tense of the word rendered “hast thou believed” is the perfect-present—“hast thou become, and art thou a believer?” The command of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 20:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " had done its work, and the words are words of approval; but yet they are not wholly so. He had arrived at conviction by means of the senses, but the higher blessedness was that of those who see by the eye of the spirit and not by that of the body; who base their confidence on the conviction of the faith-faculty, and are independent of the changing phenomena of the senses.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Blessed are they that have not seen, and yet have believed.—The truth is expressed in its general form. It is not to be understood in any special sense of the Ten, for the Greek is against it, and the other disciples also had seen and had believed; but it includes all who have become believers without having seen. This blessedness is thought of as existing from the moment of believing, and the act of faith is therefore spoken of in the past tense. The words look forward to the development of the Church which is to be founded upon Apostolic witness, and whose faith must ever be in the unseen. (Comp. Notes on John 1:9 and 1Peter 1:9.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Blessed are they that have not seen, and yet have believed.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The truth is expressed in its general form. It is not to be understood in any special sense of the Ten, for the Greek is against it, and the other disciples also had seen and had believed; but it includes all who have become believers without having seen. This blessedness is thought of as existing from the moment of believing, and the act of faith is therefore spoken of in the past tense. The words look forward to the development of the Church which is to be founded upon Apostolic witness, and whose faith must ever be in the unseen. (Comp. Notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Peter 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:26-29 That one day in seven should be religiously observed, was an appointment from the beginning. And that, in the kingdom of the Messiah, the first day of the week should be that solemn day, was pointed out, in that Christ on that day once and again met his disciples in a religious assembly. The religious observance of that day has come down to us through every age of the church. There is not an unbelieving word in our tongues, nor thought in our minds, but it is known to the Lord Jesus; and he was pleased to accommodate himself even to Thomas, rather than leave him in his unbelief. We ought thus to bear with the weak, Ro 15:1,2. This warning is given to all. If we are faithless, we are Christless and graceless, hopeless and joyless. Thomas was ashamed of his unbelief, and cried out, My Lord and my God. He spoke with affection, as one that took hold of Christ with all his might; My Lord and my God. Sound and sincere believers, though slow and weak, shall be graciously accepted of the Lord Jesus. It is the duty of those who read and hear the gospel, to believe, to embrace the doctrine of Christ, and that record concerning him, 1Jo 5:11.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Because thou hast seen me - Because you have looked upon my body, and seen the proofs that I am the same Saviour that was crucified. Jesus here approves the faith of Thomas, but more highly commends the faith of those who should believe without having seen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Blessed - Happy, or worthy of the divine approbation. The word has here the force of the comparative degree, signifying that they would be in some respects more blessed than Thomas. They would evince higher faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That have not seen ... - Those who should be convinced by the testimony of the apostles, and by the influences of the Spirit. They would evince stronger faith. All faith is of things not seen; and God blesses those most who most implicitly rely on his word. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That have not seen ... - Those who should be convinced by the testimony of the apostles, and by the influences of the Spirit. They would evince stronger faith. All faith is of things not seen; and God blesses those most who most implicitly rely on his word. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29. because thou hast seen me, thou hast believed—words of measured commendation, but of indirect and doubtless painfully—felt rebuke: that is, 'Thou hast indeed believed; it is well: it is only on the evidence of thy senses, and after peremptorily refusing all evidence short of that.'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "blessed they that have not seen, and yet have believed—\"Wonderful indeed and rich in blessing for us who have not seen Him, is this closing word of the Gospel\" [Alford].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Thou believest that I am risen from the dead upon the testimony of thy senses; thou doest well in that: thou hast seen, thou hast felt me; but it is a more noble faith to believe without any such sensible evidence. Faith is properly an assent given to a proposition upon the testimony of revelation, which if it be but human it is no more than a human faith; as we give credit to what our neighbours tell us, though we have not seen it with our own eyes, nor heard it with our ears immediately, nor had it made evident to any of our senses. If the revelation to which the assent is given be from God, we call the assent that is given to it a Divine faith; so that to give credit to a thing upon the evidence of sense, is properly no believing, otherwise than as sense confirms what we have before received by a Divine revelation. This is a sure rule, that by how much our faith stands in less need of an external evidence of sense, the stronger it is. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jesus saith unto him, Thomas,.... The word Thomas is omitted in the Alexandrian copy, and in Beza's ancient copy, and in some others, and in the Syriac, Arabic, and Ethiopic versions. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because thou hast seen me, thou hast believed; which carries in it a tacit and gentle reproof for his unbelief, and suggests, that if he had not seen, he would not have believed; but is not so harsh as if that had been expressed; and which the Jews were wont to do in a severe manner (y). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"One said to R. Jochanan, expound Rabbi; for it is beautiful for thee to expound: for as thou sayest, so I:see: he replied to him, Raka,    , \"if thou seest not, thou wilt not believe\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Christ here allows that Thomas had believed, that he was risen from the dead, and that he was his Lord and God; and though his faith was late and slow, it was sure and certain, and was appropriating; it was a faith of interest, though upon sight, and not on hearing, or the report of the other disciples: now faith on sight may be in persons who have no true spiritual faith; as in some that saw both the person and miracles of Christ on earth, and in others who will see him come in the clouds of heaven; and it has been in others who have truly believed in Christ, as the apostles of the Lamb: but yet, though it may be, as in many it has been, right, yet not so commendable as that without it. From hence may be observed, that Christ allows of the epithets and titles given him by Thomas, and therefore must be Lord and God; and approves of Thomas's faith, and therefore that must be right; though he prefers faith without personal sight of him to it, in the next clause. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Blessed are they that have not seen, and yet have believed. The author of the apocryphal book of 2 Esdras 1:37 says of ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the people to come, whose little ones rejoice in gladness'', ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in the person of the Almighty Lord, \"though they have not seen me with bodily eyes, yet in spirit they believe the thing that I say\". It seems as if there were some at this time in the city of Jerusalem, who firmly believed that Christ was risen from the dead, upon the testimony of others, though they had not seen him themselves. Faith without sight, in other respects, may be considered as opposed to the beatific vision in heaven; and as destitute of sensible communion with God; and as giving credit to doctrines and things above carnal sense and reason; such as the doctrines of the Trinity, the sonship of Christ, his incarnation, and the union of the two natures in him, and the resurrection of the dead; and as believing whatever is said in the word of God, upon the credit of his testimony; and which has for its objects things past, as what were done in eternity, in the council and covenant of grace; the works of creation and providence in time, the birth, sufferings, death, and resurrection of Christ; and also things present, Christ, and the blessings of grace, and things to come, the invisible glories of the other world. Now such are happy that have true faith in these things, for they enjoy many blessings now, as a justifying righteousness, pardon of sin, adoption, freedom of access to God, and security from condemnation; they have spiritual peace, joy, and comfort in their souls, and shall at last be saved with an everlasting salvation. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) T. Bab. Bava Bathra, fol. 75. 1. & Sanhedrin, fol. 100. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) T. Bab. Bava Bathra, fol. 75. 1. & Sanhedrin, fol. 100. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{8} Jesus saith unto him, Thomas, because thou hast seen me, thou hast believed: blessed are they that have not seen, and yet have believed.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{8}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Jesus saith unto him, Thomas, because thou hast seen me, thou hast believed: blessed ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " they that have not seen, and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "yet",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " have believed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(8) True faith depends upon the mouth of God, and not upon the eyes of the flesh.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thomas, because",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] ‘Thomas’ must be omitted on overwhelming evidence, although the addition of the name seems natural here as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ‘Thou hast believed’ is half exclamation, half question (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 16:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blessed are they that have not seen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessed are they that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " saw not. There must have been some disciples who believed in the Resurrection merely on the evidence of others. Jesus had not appeared to every one of His followers.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This last great declaration of blessedness is a Beatitude which is the special property of the countless number of believers who have never seen Christ in the flesh. Just as it is possible for every Christian to become equal in blessedness to Christ’s Mother and brethren by obedience (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:49-50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so it is possible for them to transcend the blessedness of Apostles by faith. All the Apostles, like S. Thomas, had seen before they believed: even S. John’s faith did not shew itself until he had had evidence (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 20:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 20:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). S. Thomas had the opportunity of believing without seeing, but rejected it. The same opportunity is granted to all believers now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Thus this wonderful Gospel begins and ends with the same article of faith. ‘The Word was God,’—‘the Word became flesh,’ is the Evangelist’s solemn confession of a belief which had been proved and deepened by the experience of more than half a century. From this he starts, and patiently traces out for us the main points in the evidence out of which that belief had grown. This done, he shews us the power of the evidence over one needlessly wary of being influenced by insufficient testimony. The result is the instantaneous confession, at once the result of questioning and the victory over it, ‘My Lord and my God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 20:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἑώρακας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou hast seen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and hast touched Me.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πεπίστευκας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou hast believed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Thou dost exercise faith.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μακάριοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blessed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The blessedness of Thomas is not denied, but the rare and richly-favoured lot of those is specially declared, who believe without seeing. For even in the case of the rest of the apostles, it was when they had seen, and not until then that they believed. [There is hardly a doubt but that the apostles accounted the general multitude of believers who had not seen Jesus, as standing higher in that respect than themselves.—V. g.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 29.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jesus saith to him, Because thou hast seen me thou hast believed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Our Lord does not bid him rise, nor say, as the angel did to John in the Apocalypse, \"Worship God;\" nor did he reject the homage which is here so grandly paid; but he describes this very state of mind which induced the disciple to say, \"My Lord and my God!\" as that high, holy acquisition which throughout his ministry he had treated as the main, prime condition of all spiritual blessings. \"Thou hast believed,\" said he, \"and because thou hast seen me; thou hast become a believer in all that I am, because thou hast received this crowning proof of the reality of my victory over death.\" There are critics or scholars (Lachmann, Meyer, Ewald, etc.), who treat the expression as an interrogative: ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Because thou hast seen me, hast thou believed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "art thou now a believing man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "?); and the Revisers have placed this punctuation in their margin. A few cursives thus point the words, but it is improbable, for it would seem, even still, to have suggested a doubt or question in the mind of the Lord touching the reality of the apostle's faith. Moreover, the obvious contrast between those who have seen and those who saw not would be obscured by the punctuation. Observe that Christ did not say, \"Because thou hast touched me, thou hast believed.\" The vision alone brought the apostle back to that high tension of faith which he, with others, had reached on the night of the Passion (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 16:30-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and notes). All the tide of overmastering love surged up within him. But the condition of multitudes was even then less privileged than that of Thomas. It could not be a part of the conduct of the kingdom of God that each separate soul should have all the elements of conviction which the apostles had enjoyed, all the vision and all the inspiration of the chosen prophets of the Lord. There may and will come a time when \"every eye shall see him\" as Thomas saw him, when all shall have the function and powers, equal faculties and opportunity, of seeing him. In the Apocalypse the evangelist, at the very commencement of his visions, saw for himself all the mystery and the certainty of this crowning victory. Meanwhile faith upon testimony, faith in reality through the power of truth, is declared to be the law of the kingdom, and the great beatitude which Christ left as his latest legacy is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Blessed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "are",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "they who saw not, and believed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of whom is he speaking? Clearly not of those who had already received the same advantage which Thomas had now enjoyed so tardily! The apostles, at first, did not accept the testimony of the women, nor the voices and messages o angels, nor the objective fact of the deserted grave. John rebuked himself for not knowing that the Christ must rise from the dead, whether he should have personal ocular evidence of it or not; and he blamed himself for not believing throughout the earthly ministry of Christ that \"the Holy One could not see corruption.\" Still, the fact was patent, that not until the disciples saw the Lord were they glad. Even in their gladness there was the mingling of surprise and incredulousness. To whom, then, did the blessedness apply? Surely, first of all to the multitudes of loving, waiting souls, who were prepared by their reverence and the new life given to them, and by the bewildering rumors of the Easter week, to believe in the Divine necessity of the Resurrection. Christ told the disciples, on their way to Emmaus, that they were foolish and dull of heart in not accepting all that the prophets had spoken. Before the final assurance given by their identification of his Person, he persuaded them to accept his statements, and believe in all that he was, including the fact of his resurrection. Whether they should ever have more convincing evidence or not, they were bound to believe that the suffering Messiah was, in the very nature of things, and by Divine necessity, Victor of death, and must see the travail of his soul. This does but repeat the same idea, ,' Blessed are they who saw not as Thomas and the other disciples were at this moment doing, and yet believed.\" But the beatitude includes the whole future of the Church. \"Whom having not seen, ye love; in whom, though now ye see him not, yet believing, ye rejoice with joy unspeakable and full of glory.\" So said St. Peter to the widely scattered Church. The Lord does not sever the link between external facts and spiritual principles, and thus propound a group of subjective conceptions for a series of objective realities (as Baur and others have urged); but he does pronounce a great benediction on those who can rise to faith in himself through the word which he has spoken, and which his apostles would continue to proclaim without intervention of physical contact or visible manifestation. \"If Christ be not risen, then is your faith vain; ye are yet in your sins.\" These words are charged with the grounds of conviction for others. Instead of the first disciples being disposed to transform hallucinations of spiritual manifestation into tangible and visible objective facts, they appear to have been more prone and tempted to transform some utterly indisputable facts into spiritual phenomena. There were objective facts, but every attempt which has been made to discredit the Resurrection while admitting these facts has utterly broken down. Even if the narratives of the four Gospels, with their divergent representation, be left out of sight, nothing can be more certain than that, in the space of a quarter of a century, the Churches of Christ in Antioch, Corinth, Philippi, Rome, Ephesus, and Ancyra were existing, and held, without doubt or question, the objective fact. Paul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:1-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") simply recounts, not for the first time, but as a resume of long-since-delivered instruction, the indubitable fact of the Resurrection. It was not an incredible thing, even to Agrippa, that God should raise the dead; nor need it be so now to any one who accepts as true Christ's account of the Father. The creation of the Church unquestionably turns on the settled conviction of the first disciples that Jesus rose from the dead. That conviction cannot be accounted for independently of the fact. Every attempt to explain it apart from the fact itself has hitherto been wrecked. John 20:29",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thomas",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Omit. ",
        "children": []
      }
    ]
  }
]