[{"num":39,"verse":"In that time Merodachbaladan, the son of Baladan, the king of Babylon, sent books and gifts to Hezekiah; for he had heard, that Hezekiah had been sick, and was recovered. (At that time Merodachbaladan, the son of Baladan, the king of Babylon, sent letters and gifts to Hezekiah; for he had heard, that Hezekiah had been sick, but now had recovered.)"},{"num":2,"verse":"Forsooth Hezekiah was glad on them, and showed to them the cell(s) of sweet smelling spices, and of silver, and of gold, and of smelling things, and of best ointment, and all the shops of his purtenance of household, and all things that were found in his treasures; no word was, which Hezekiah showed not to them in his house, and in all his power. (And Hezekiah welcomed the messengers, and showed them the rooms for the sweet smelling spices, and the rooms for the silver, and the gold, and the best perfumes, and all the shops of his purtenance of household, and everything that was found among his treasures; yea, there was nothing, which Hezekiah did not show them in his house, and of all his power.)"},{"num":3,"verse":"Soothly Isaiah, the prophet, entered to king Hezekiah (And the prophet Isaiah went in to King Hezekiah), and said to him, What said these men, and from whence came they to thee? And Hezekiah said, From a far land they came to me, from Babylon."},{"num":4,"verse":"And Isaiah said, What saw they in thine house? And Hezekiah said, They saw all things that be in mine house; nothing was in my treasures, which I showed not to them."},{"num":5,"verse":"And Isaiah said to Hezekiah, Hear thou the word of the Lord of hosts."},{"num":6,"verse":"Lo! days shall come, and all things that be in thine house, and which things thy fathers treasured till to this day (and which things thy forefathers treasured unto this day), shall be taken away into Babylon; not anything shall be left, saith the Lord."},{"num":7,"verse":"And they shall take [away] of thy sons, that shall go out of thee, which thou shalt engender; and they shall be honest servants and chaste in the palace of the king of Babylon. (And they shall take away some of thy sons, who shall go out of thee, whom thou shalt beget; and they shall be made honest and chaste servants, that is, they shall be made eunuchs, to serve in the palace of the king of Babylon.)"},{"num":8,"verse":"And Hezekiah said to Isaiah, The word of the Lord is good, which he spake. And Hezekiah said, Peace and truth be made only in my days. (And Hezekiah said to Isaiah, The word of the Lord is good, which he spoke. And Hezekiah said, Let there be only peace and truth in my days.)"}]