[{"num":8,"verse":"And the word of the Lord of hosts came to me, saying,"},{"num":2,"verse":"Thus says the Lord of hosts: I am jealous for Zion with great jealousy, and I am jealous for her with great wrath [against her enemies]."},{"num":3,"verse":"Thus says the Lord: I shall return to Zion and will dwell in the midst of Jerusalem, and Jerusalem shall be called the [faithful] City of Truth, and the mountain of the Lord of hosts, the Holy Mountain."},{"num":4,"verse":"Thus says the Lord of hosts: Old men and old women shall again dwell in Jerusalem and sit out in the streets, every man with his staff in his hand for very [advanced] age."},{"num":5,"verse":"And the streets of the city shall be full of boys and girls playing in its streets."},{"num":6,"verse":"Thus says the Lord of hosts: Because it will be marvelous in the eyes of the remnant of this people in those days [in which it comes to pass], should it also be marvelous in My eyes? says the Lord of hosts."},{"num":7,"verse":"Thus says the Lord of hosts: Behold, I will save My people from the east country and from the west [the country of the going down of the sun]."},{"num":8,"verse":"And I will bring them [home] and they shall dwell in the midst of Jerusalem; and they shall be My people, and I will be their God in truth and faithfulness and in righteousness."},{"num":9,"verse":"Thus says the Lord of hosts: Let your hands be strong and hardened, you who in these days hear these words from the mouths of the prophets who on the day that the foundation of the house of the Lord of hosts was laid foretold that the temple should be rebuilt."},{"num":10,"verse":"For before those days there was no hire for man nor any hire for beast, neither was there any peace or success to him who went out or came in because of the adversary and oppressor, for I set (let loose) all men, every one against his neighbor."},{"num":11,"verse":"But now [in this period since you began to build] I am not to the remnant of this people as in the former days, says the Lord of hosts."},{"num":12,"verse":"For there shall the seed produce peace and prosperity; the vine shall yield her fruit and the ground shall give its increase and the heavens shall give their dew; and I will cause the remnant of this people to inherit and possess all these things."},{"num":13,"verse":"And as you have been a curse and a byword among the nations, O house of Judah and house of Israel, so will I save you, and you shall be a blessing. Fear not, but let your hands be strong and hardened."},{"num":14,"verse":"For thus says the Lord of hosts: As I thought to bring calamity upon you when your fathers provoked Me to wrath, says the Lord of hosts, and I did not relent or revoke your sentence,"},{"num":15,"verse":"So again have I purposed in these days to do good to Jerusalem and to the house of Judah. Fear not!"},{"num":16,"verse":"These are the things that you shall do: speak every man the truth with his neighbor; render the truth and pronounce the judgment or verdict that makes for peace in [the courts at] your gates."},{"num":17,"verse":"And let none of you think or imagine or devise evil or injury in your hearts against his neighbor, and love no false oath, for all these things I hate, says the Lord."},{"num":18,"verse":"And the word of the Lord of hosts came to me [Zechariah], saying,"},{"num":19,"verse":"Thus says the Lord of hosts: The fast of the fourth month and the fast of the fifth, the fast of the seventh and the fast of the tenth, shall be to the house of Judah times of joy and gladness and cheerful, appointed seasons; therefore [in order that this may happen to you, as the condition of fulfilling the promise] love truth and peace."},{"num":20,"verse":"Thus says the Lord of hosts: It shall yet come to pass that there shall come [to Jerusalem] peoples and the inhabitants of many and great cities,"},{"num":21,"verse":"And the inhabitants of one city shall go to them of another, saying, Let us go speedily to pray and entreat the favor of the Lord and to seek, inquire of, and require [to meet our own most essential need] the Lord of hosts. I will go also."},{"num":22,"verse":"Yes, many people and strong nations shall come to Jerusalem to seek, inquire of, and require [to fill their own urgent need] the Lord of hosts and to pray to the Lord for His favor."},{"num":23,"verse":"Thus says the Lord of hosts: In those days ten men out of all languages of the nations shall take hold of the robe of him who is a Jew, saying, Let us go with you, for we have heard that God is with you."}]