[{"header":"The Coming Peace and Prosperity of Zion"},{"num":8,"verse":"Then the word of the Lord of armies came, saying,"},{"num":2,"verse":"“The Lord of armies says this: ‘I am exceedingly jealous for Zion, yes, with great wrath I am jealous for her.’"},{"num":3,"verse":"The Lord says this: ‘I will return to Zion and dwell in the midst of Jerusalem. Then Jerusalem will be called the City of Truth, and the mountain of the Lord of armies will be called the Holy Mountain.’"},{"num":4,"verse":"The Lord of armies says this: ‘Old men and old women will again sit in the public squares of Jerusalem, each person with his staff in his hand because of age."},{"num":5,"verse":"And the public squares of the city will be filled with boys and girls playing in its squares.’"},{"num":6,"verse":"The Lord of armies says this: ‘If it is too difficult in the sight of the remnant of this people in those days, will it also be too difficult in My sight?’ declares the Lord of armies."},{"num":7,"verse":"The Lord of armies says this: ‘Behold, I am going to save My people from the land of the east and from the land of the west;"},{"num":8,"verse":"and I will bring them back and they will live in the midst of Jerusalem; and they shall be My people, and I will be their God in truth and righteousness.’"},{"num":9,"verse":"“The Lord of armies says this: ‘Let your hands be strong, you who are listening in these days to these words from the mouth of the prophets, those who spoke in the day that the foundation of the house of the Lord of armies was laid, so that the temple might be built."},{"num":10,"verse":"For before those days there was no wage for man nor any wage for animal; and for him who went out or came in there was no peace because of his enemies, and I sent all the people against one another."},{"num":11,"verse":"But now I will not treat the remnant of this people as in the former days,’ declares the Lord of armies."},{"num":12,"verse":"‘For there will be the seed of peace: the vine will yield its fruit, the land will yield its produce, and the heavens will provide their dew; and I will give to the remnant of this people all these things as an inheritance."},{"num":13,"verse":"And it will come about that just as you were a curse among the nations, house of Judah and house of Israel, so I will save you that you may become a blessing. Do not fear; let your hands be strong.’"},{"num":14,"verse":"“For this is what the Lord of armies says: ‘Just as I determined to do harm to you when your fathers provoked Me to anger,’ says the Lord of armies, ‘and I have not relented,"},{"num":15,"verse":"so I have again determined in these days to do good to Jerusalem and to the house of Judah. Do not fear!"},{"num":16,"verse":"These are the things which you shall do: speak the truth to one another; judge with truth and judgment for peace at your gates."},{"num":17,"verse":"Also let none of you devise evil in your heart against another, and do not love perjury; for all these things are what I hate,’ declares the Lord.”"},{"num":18,"verse":"Then the word of the Lord of armies came to me, saying,"},{"num":19,"verse":"“The Lord of armies says this: ‘The fast of the fourth, the fast of the fifth, the fast of the seventh, and the fast of the tenth months will become joy, jubilation, and cheerful festivals for the house of Judah; so love truth and peace.’"},{"num":20,"verse":"“The Lord of armies says this: ‘It will yet turn out that peoples will come, that is, the inhabitants of many cities."},{"num":21,"verse":"The inhabitants of one city will go to another, saying, “Let’s go at once to plead for the favor of the Lord, and to seek the Lord of armies; I also will go.”"},{"num":22,"verse":"So many peoples and mighty nations will come to seek the Lord of armies in Jerusalem, and to plead for the favor of the Lord.’"},{"num":23,"verse":"The Lord of armies says this: ‘In those days ten people from all the nations will grasp the garment of a Jew, saying, “Let us go with you, for we have heard that God is with you.”’”"}]