[{"num":11,"verse":"The word that was made of the Lord to Jeremy, and said, (The word of the Lord that was made to Jeremiah, and said,)"},{"num":2,"verse":"Hear ye the words of this covenant, and speak ye to the men of Judah, and to the dwellers of Jerusalem; (Hear ye the words of this covenant, and speak ye to the people of Judah, and to the inhabitants of Jerusalem;)"},{"num":3,"verse":"and thou shalt say to them, The Lord God of Israel saith these things, Cursed be the man that heareth not the words of this covenant, (and thou shalt say to them, The Lord God of Israel saith these things, Cursed be the person who would not listen to, or obey, the words of this covenant,)"},{"num":4,"verse":"which I commanded to your fathers, in the day in which I led them out of the land of Egypt, from the iron furnace; and I said, Hear ye my voice, and do ye all things which I commanded to you, and ye shall be into a people to me, and I shall be into God to you;"},{"num":5,"verse":"that I raise (up) the oath which I swore to your fathers, that I should give to them a land flowing with milk and honey, as this day is (as it is this day). And I answered, and said, Amen, Lord."},{"num":6,"verse":"And the Lord said to me, Cry thou [out] all these words in the cities of Judah, and without[forth] Jerusalem, and say thou, Hear ye the words of this covenant, and do ye them;"},{"num":7,"verse":"for I witnessing have witnessed to your fathers, in the day in which I led them out of the land of Egypt, unto this day; I rose (up) early, and witnessed, and said, Hear ye my voice."},{"num":8,"verse":"And they heard not, neither bowed down their ear, but they went forth each man in the shrewdness of his evil heart (But they would not listen, or obey, nor bowed down their ear, but they went forth each person in the depravity of their own evil heart); and I brought in on them all the words of this covenant, which I commanded that they should do, and they did not."},{"num":9,"verse":"And the Lord said to me, Swearing together is found in the men of Judah, and in the dwellers of Jerusalem; (And the Lord said to me, Conspiracy, or plotting together, is found among the people of Judah, and the inhabitants of Jerusalem;)"},{"num":10,"verse":"they turned again to the former wickednesses of their fathers, that would not hear my words; and therefore these men went after alien gods, for to serve them; the house of Israel and the house of Judah made void my covenant, which I made with the fathers of them. (they returned to the former wickednesses of their forefathers, who would not listen to, or obey, my words; and so these people went after strange, or foreign, gods, to serve them; the house of Israel and the house of Judah made void my covenant, which I had made with their forefathers.)"},{"num":11,"verse":"Wherefore the Lord saith these things, Lo! I shall bring in on them evils, of which they shall not be able to go out (from which they shall not be able to escape); and they shall cry to me, and I shall not hear them."},{"num":12,"verse":"And the cities of Judah and the dwellers of Jerusalem shall go, and shall cry to them to which they offer sacrifices; and they shall not save them in the time of their torment. (And the cities of Judah and the inhabitants of Jerusalem shall go, and shall cry to them to which they offer sacrifices; but they shall not save them in their time of torment.)"},{"num":13,"verse":"For thou, Judah, thy gods were by the number of thy cities, and thou settedest altars of shame, by the number of the ways of Jerusalem, altars to offer sacrifices to Baalim (altars to offer sacrifices to Baal)."},{"num":14,"verse":"Therefore do not thou pray for this people, and take thou not (up) praising and prayer for them; for I shall not hear (them) in the time of the cry of them to me, in the time of the torment of them."},{"num":15,"verse":"What is it, that my darling doeth many great trespasses in mine house? whether holy fleshes shall do away from thee thy malice, in which thou hast glory? (What right hath my darling to be in my House, she who doeth so many great trespasses? shall holy flesh do away from thee thy malice, in which thou hast so much glory?)"},{"num":16,"verse":"The Lord called thy name an olive tree, fair, full of fruit, shapely; at the voice of a great speech, fire burnt on high therein, and the bushes thereof be burnt. (Once the Lord called thee an olive tree, yea, beautiful, full of fruit, and shapely; but now, at the sound of a great shout, fire shall burn on high there, and its bushes shall be burned down.)"},{"num":17,"verse":"And the Lord of hosts that planted thee, spake evil on thee, for the evils of the house of Israel, and of the house of Judah, which they did to themselves, and offered to Baalim, to stir me to wrath. (And the Lord of hosts who planted thee, spoke evil against thee, for the evils of the house of Israel, and of the house of Judah, which they did to themselves, when they stirred me to anger, by offering to Baal.)"},{"num":18,"verse":"Forsooth, Lord, thou showedest to me, and I knew; thou showedest to me the studies of them. (But, Lord, thou hast shown me, and so I knew; yea, thou hast shown me their deeds.)"},{"num":19,"verse":"And I am as a mild lamb, which is borne to slain sacrifice; and I knew not, that they thought counsels on me, and said, Send we a tree into the bread of him, and raze we him away from the land of livers, and his name be no more had in mind. (And I am like a meek lamb, which is carried to the slain sacrifice; and I knew not that they thought up plans against me, and said, Destroy we the tree with its fruit, and raze we him down from the land of the living, and his name shall no longer be remembered.)"},{"num":20,"verse":"But thou, Lord of hosts, that deemest justly, and provest reins and hearts, see I thy vengeance of them; for to thee I showed my cause. (But thou, Lord of hosts, who judgest justly, and provest reins and hearts, let me see thy vengeance against them; for I have shown my cause to thee/for I have made my case to thee.)"},{"num":21,"verse":"Therefore the Lord saith these things to the men of Anathoth, that seek thy life, and say, Thou shalt not prophesy in the name of the Lord, and thou shalt not die in our hands. (And so the Lord saith these things to those people of Anathoth, who seek thy life, and say, Prophesy thou no more in the name of the Lord, and then thou shalt not die by our hands.)"},{"num":22,"verse":"Therefore the Lord of hosts saith these things, Lo! I shall visit on them; the young men of them shall die by sword, the sons of them, and the daughters of them, shall die for hunger; (And so the Lord of hosts saith these things, Lo! I shall punish them; their young men shall die by the sword, and their sons, and their daughters, shall die by hunger;)"},{"num":23,"verse":"and no remnants, either children left, shall be of them; for I shall bring in evil on the men of Anathoth, the year of the visitation of them. (and there shall be no remnant, or any children, left of them; for I shall bring in evil upon the people of Anathoth, yea, the time of their punishment.)"}]