[{"header":"Samson’s Weakness"},{"num":16,"verse":"Then Samson went to Gaza and saw a prostitute there, and went in to her. "},{"num":2,"verse":"The Gazites were told, “Samson has come here.” So they surrounded the place and waited all night at the gate of the city to ambush him. They kept quiet all night, saying, “In the morning, when it is light, we will kill him.” "},{"num":3,"verse":"But Samson lay [resting] until midnight, then at midnight he got up and took hold of the doors of the city gate and the two door-posts, and pulled them up, [security] bar and all, and he put them on his shoulders and carried them up to the top of the hill which is opposite Hebron."},{"num":4,"verse":"After this he fell in love with a [Philistine] woman [living] in the Valley of Sorek, whose name was Delilah. "},{"num":5,"verse":"So the [five] lords (governors) of the Philistines came to her and said to her, “Persuade him, and see where his great strength lies and [find out] how we may overpower him so that we may bind him to subdue him. And each of us will give you eleven hundred pieces of silver.” "},{"num":6,"verse":"So Delilah said to Samson, “Please tell me where your great strength lies and with what you may be bound and subdued.” "},{"num":7,"verse":"Samson said to her, “If they bind me with seven fresh cords (tendons) that have not been dried, then I will be weak and be like any [other] man.” "},{"num":8,"verse":"Then the Philistine lords brought her seven fresh cords that had not been dried, and she bound him with them. "},{"num":9,"verse":"Now she had men lying in ambush in an inner room. And she said to him, “The Philistines are upon you, Samson!” And he broke the cords as a string of tow breaks when it touches fire. So [the secret of] his strength was not discovered."},{"num":10,"verse":"Then Delilah said to Samson, “See now, you have mocked me and told me lies; now please tell me [truthfully] how you may be bound.” "},{"num":11,"verse":"He said to her, “If they bind me tightly with new ropes that have not been used, then I will become weak and be like any [other] man.” "},{"num":12,"verse":"So Delilah took new ropes and bound him with them and said to him, “The Philistines are upon you, Samson!” And the men lying in ambush were in the inner room. But he snapped the ropes off his arms like [sewing] thread."},{"num":13,"verse":"Then Delilah said to Samson, “Until now you have mocked me and told me lies; tell me [truthfully] with what you may be bound.” And he said to her, “If you weave the seven braids of my hair with the web [and fasten it with a pin, then I will become weak and be like any other man.” "},{"num":14,"verse":"So while he slept, Delilah took the seven locks (braids) of his hair and wove them into the web]. And she fastened it with the pin [of the loom] and said to him, “The Philistines are upon you, Samson!” And he awoke from his sleep and pulled out the pin of the [weaver’s] loom and the web."},{"header":"Delilah Extracts His Secret"},{"num":15,"verse":"Then she said to him, “How can you say, ‘I love you,’ when your heart is not with me? You have mocked me these three times and have not told me where your great strength lies.” "},{"num":16,"verse":"When she pressured him day after day with her words and pleaded with him, he was annoyed to death. "},{"num":17,"verse":"Then [finally] he told her everything that was in his heart and said to her, “A razor has never been used on my head, for I have been a Nazirite to God from my mother’s womb. If I am shaved, then my strength will leave me, and I will become weak and be like any [other] man.”"},{"num":18,"verse":"Then Delilah realized that he had told her everything in his heart, so she sent and called for the Philistine lords, saying, “Come up this once, because he has told me everything in his heart.” Then the Philistine lords came up to her and brought the money [they had promised] in their hands. "},{"num":19,"verse":"She made Samson sleep on her knees, and she called a man and had him shave off the seven braids of his head. Then she began to abuse Samson, and his strength left him. "},{"num":20,"verse":"She said, “The Philistines are upon you, Samson!” And he awoke from his sleep and said, “I will go out as I have time after time and shake myself free.” For Samson did not know that the Lord had departed from him. "},{"num":21,"verse":"Then the Philistines seized him and gouged out his eyes; and they brought him down to Gaza and bound him with [two] bronze chains; and he was forced to be a grinder [of grain into flour at the mill] in the prison. "},{"num":22,"verse":"But the hair of his head began to grow again after it had been shaved off."},{"num":23,"verse":"Now the Philistine lords gathered together to offer a great sacrifice to Dagon their god, and to celebrate, for they said,"},{"num":24,"verse":"When the people saw Samson, they praised their god, for they said,"},{"num":25,"verse":"Now when they were in high spirits, they said, “Call for Samson, so that he may amuse us.” So they called Samson out of the prison, and he entertained them. They made him stand between the pillars. "},{"num":26,"verse":"Then Samson said to the boy who held him by the hand, “Let me feel the pillars on which the [roof of the] house rests, so that I may lean against them.” "},{"num":27,"verse":"Now the house was full of men and women; all the Philistine lords were there, and on the flat roof were about three thousand men and women who looked on while Samson was entertaining them."},{"header":"Samson Is Avenged"},{"num":28,"verse":"Then Samson called to the Lord and said, “O Lord God, please remember me and please strengthen me just this one time, O God, and let me take vengeance on the Philistines for my two eyes.” "},{"num":29,"verse":"Samson took hold of the two middle [support] pillars on which the house rested, and braced himself against them, one with his right hand and the other with his left. "},{"num":30,"verse":"And Samson said, “Let me die with the Philistines!” And he stretched out with all his might [collapsing the support pillars], and the house fell on the lords and on all the people who were in it. So the dead whom he killed at his death were more than those whom he had killed during his life. "},{"num":31,"verse":"Then his brothers and his father’s entire [tribal] household came down, took him, and brought him up; and they buried him in the tomb of Manoah his father, [which was] between Zorah and Eshtaol. So Samson had judged Israel for twenty years."}]