[{"num":16,"verse":"Shimshon went to ‘Azah, where he saw a prostitute and went in to spend the night with her. "},{"num":2,"verse":"The people in ‘Azah were told that Shimshon had come, so they surrounded the place where he was and also set an ambush for him all night at the city gate. Their plan was to do nothing at night, but to wait until morning and then kill him. "},{"num":3,"verse":"However, Shimshon stayed in bed until midnight; then he got up, took hold of the doors of the city gate and the two posts as well, pulled them up, bar and all, hoisted them on his shoulders, and carried them up to the top of the hill overlooking Hevron."},{"num":4,"verse":"After this, he fell in love with a woman who lived in the Sorek Valley, whose name was D’lilah. "},{"num":5,"verse":"The chiefs of the P’lishtim went up to her and said, “Coax him into telling you where his great strength comes from and how we can overcome him, so that we can tie him up and subdue him. If you do, each of us will give you 1,100 pieces of silver.” "},{"num":6,"verse":"D’lilah said to Shimshon, “Please tell me what it is that makes you so strong, and how someone could tie you up and subdue you.” "},{"num":7,"verse":"Shimshon replied, “If they tie me up with seven fresh bowstrings that have never been dried, I will become as weak as any other man.” "},{"num":8,"verse":"The chiefs of the P’lishtim brought up to her seven fresh bowstrings which had not been dried, and she tied him up with them. "},{"num":9,"verse":"Now she had people lying in wait in the inside room. So she said to him, “Shimshon! The P’lishtim have come for you!” But he snapped the bowstrings as easily as a piece of straw breaks when it touches fire, and the source of his strength remained unknown."},{"num":10,"verse":"D’lilah said to Shimshon, “You’re making fun of me, telling me lies. Now, come on, tell me what it takes to tie you up.” "},{"num":11,"verse":"“All it takes,” he answered, “is to tie me up with new ropes that haven’t been used. Then I’ll become weak and be like anyone else.” "},{"num":12,"verse":"So D’lilah took new ropes, tied him up, and said to him, “Shimshon! The P’lishtim have come for you!” (The people lying in wait were in the inside room.) But he broke the ropes from off his arms like a thread."},{"num":13,"verse":"D’lilah said to Shimshon, “Till now you’ve been making fun of me and telling me lies. Tell me what it takes to tie you up.” He said, “If you weave the seven locks of my hair across thread on a loom.” "},{"num":14,"verse":"So she fastened her cloth work in the loom with a pin and wove his hair in, then said to him, “Shimshon! The P’lishtim have come for you!” He awoke from his sleep and pulled away the loom pin and the interwoven cloth. "},{"num":15,"verse":"She said to him, “How can you say you love me when your heart isn’t with me? Three times you’ve made fun of me, and you haven’t told me the source of your great strength.”"},{"num":16,"verse":"Every day she kept nagging at him and pressing at him, till it bothered him to death, "},{"num":17,"verse":"so that he finally told her everything. He said to her, “No razor has ever touched my head, because I have been a nazir of God since I was born. If someone shaves me, then my strength will leave me; and I will be like any other man.” "},{"num":18,"verse":"When D’lilah saw that he had really confided in her, she sent and summoned the chiefs of the P’lishtim with the message, “Come up this one last time, because he has finally told me the truth.” The chiefs of the P’lishtim went up to her and brought the money with them. "},{"num":19,"verse":"She had him go to sleep in her lap and called for a man to shave off his seven locks of hair. Then she began tormenting him, but his strength had gone away. "},{"num":20,"verse":"She said, “Shimshon! The P’lishtim have come for you!” He awoke from his sleep and said, “I’ll get out this time, just as I shook myself loose before.” But he didn’t know that Adonai had left him. "},{"num":21,"verse":"So the P’lishtim seized him, gouged out his eyes and took him down to ‘Azah. There they bound him with two bronze chains and put him to work grinding grain at the mill in the prison. "},{"num":22,"verse":"However, after the hair on his head had been cut off, it began growing back again."},{"num":23,"verse":"The chiefs of the P’lishtim assembled to offer a great sacrifice to their god Dagon. As they celebrated they sang,"},{"num":24,"verse":"Upon seeing him, the people praised their god:"},{"num":25,"verse":"When they were in high spirits they said, “Summon Shimshon to amuse us.” So they called Shimshon out of the prison, and he amused them. When they put him between the columns, "},{"num":26,"verse":"Shimshon said to the boy holding him by the hand, “Let me feel the columns supporting the building, so that I can lean on them.” "},{"num":27,"verse":"The building was full of men and women; and all the chiefs of the P’lishtim were there; in addition to them, there were about three thousand men and women on the roof, watching, as Shimshon performed. "},{"num":28,"verse":"Shimshon called to Adonai, “Adonai Elohim, just this once, please, think of me, and please, give me strength, so that I can take revenge on the P’lishtim for at least one of my two eyes.” "},{"num":29,"verse":"Shimshon got a good hold on the two middle columns supporting the building and leaned on them, on one with his right hand and on the other with his left. "},{"num":30,"verse":"Then, crying, “Let me die with the P’lishtim!” he pushed with all his might; and the building collapsed on the chiefs and on all the people inside. So he killed more at his death than he had killed during his life."},{"num":31,"verse":"His brothers and all his father’s family came down, took him, brought him up and buried him between Tzor‘ah and Eshta’ol, in the tomb of his father Manoach. He had judged Isra’el twenty years."}]