[{"header":"Samson’s Weakness"},{"num":16,"verse":"Now Samson went to Gaza and saw a prostitute there, and had relations with her."},{"num":2,"verse":"When it was reported to the Gazites, saying, “Samson has come here,” they surrounded the place and lay in wait for him all night at the gate of the city. And they kept silent all night, saying, “Let’s wait until the morning light, then we will kill him.”"},{"num":3,"verse":"Now Samson lay asleep until midnight, and at midnight he got up and took hold of the doors of the city gate and the two doorposts, and pulled them up along with the bars; then he put them on his shoulders, and carried them up to the top of the mountain which is opposite Hebron."},{"num":4,"verse":"After this it came about that he was in love with a woman in the Valley of Sorek, whose name was Delilah."},{"num":5,"verse":"So the governors of the Philistines came up to her and said to her, “Entice him, and see where his great strength lies and how we can overpower him so that we may bind him to humble him. Then we will each give you 1,100 pieces of silver.”"},{"num":6,"verse":"So Delilah said to Samson, “Please tell me where your great strength lies, and how you can be bound to humble you.”"},{"num":7,"verse":"And Samson said to her, “If they bind me with seven fresh animal tendons that have not been dried, then I will become weak and be like any other man.”"},{"num":8,"verse":"Then the governors of the Philistines brought up to her seven fresh animal tendons that had not been dried, and she bound him with them."},{"num":9,"verse":"Now she had men prepared for an ambush in an inner room. And she said to him, “The Philistines are upon you, Samson!” But he tore the tendons to pieces just like a thread of flax is torn apart when it comes too close to fire. So his strength was not discovered."},{"num":10,"verse":"Then Delilah said to Samson, “Behold, you have toyed with me and told me lies; now please tell me how you may be bound.”"},{"num":11,"verse":"Then He said to her, “If they bind me tightly with new ropes which have not been used, then I will become weak and be like any other man.”"},{"num":12,"verse":"So Delilah took new ropes and bound him with them and said to him, “The Philistines are upon you, Samson!” For the men in the ambush were waiting in the inner room. But he tore the ropes from his arms like thread."},{"num":13,"verse":"Then Delilah said to Samson, “Up to now you have toyed with me and told me lies; tell me how you may be bound.” And he said to her, “If you weave the seven locks of my hair with the web [and fasten it with the pin, then I will be weak like any other man.”"},{"num":14,"verse":"So while he slept, Delilah wove the seven locks of his hair with the web]. And she fastened it with the pin and said to him, “The Philistines are upon you, Samson!” But he awoke from his sleep and pulled out the pin of the loom and the web."},{"header":"Delilah Extracts His Secret"},{"num":15,"verse":"Then she said to him, “How can you say, ‘I love you,’ when your heart is not with me? You have toyed with me these three times and have not told me where your great strength is.”"},{"num":16,"verse":"And it came about, when she pressed him daily with her words and urged him, that his soul was annoyed to death."},{"num":17,"verse":"So he told her all that was in his heart and said to her, “A razor has never come on my head, for I have been a Nazirite to God from my mother’s womb. If I am shaved, then my strength will leave me and I will become weak and be like any other man.”"},{"num":18,"verse":"When Delilah saw that he had told her all that was in his heart, she sent word and called the governors of the Philistines, saying, “Come up once more, for he has told me all that is in his heart.” Then the governors of the Philistines came up to her and brought up the money in their hands."},{"num":19,"verse":"And she made him sleep on her knees, and called for a man and had him shave off the seven locks of his head. Then she began to humble him, and his strength left him."},{"num":20,"verse":"She said, “The Philistines are upon you, Samson!” And he awoke from his sleep and said, “I will go out as at other times and shake myself free.” But he did not know that the Lord had departed from him."},{"num":21,"verse":"Then the Philistines seized him and gouged out his eyes; and they brought him down to Gaza and restrained him with bronze chains, and he became a grinder in the prison."},{"num":22,"verse":"However, the hair of his head began to grow again after it was shaved off."},{"num":23,"verse":"Now the governors of the Philistines assembled to offer a great sacrifice to Dagon their god, and to celebrate, for they said,"},{"num":24,"verse":"When the people saw him, they praised their god, for they said,"},{"num":25,"verse":"It so happened when they were in high spirits, that they said, “Call for Samson, that he may amuse us.” So they called for Samson from the prison, and he entertained them. And they made him stand between the pillars."},{"num":26,"verse":"Then Samson said to the boy who was holding his hand, “Let me feel the pillars on which the house rests, so that I may lean against them.”"},{"num":27,"verse":"Now the house was full of men and women, and all the governors of the Philistines were there. And about three thousand men and women were on the roof looking on while Samson was entertaining them."},{"header":"Samson Is Avenged"},{"num":28,"verse":"Then Samson called to the Lord and said, “Lord God, please remember me and please strengthen me just this time, O God, that I may at once take vengeance on the Philistines for my two eyes.”"},{"num":29,"verse":"Then Samson grasped the two middle pillars on which the house rested, and braced himself against them, the one with his right hand and the other with his left."},{"num":30,"verse":"And Samson said, “Let me die with the Philistines!” And he pushed outwards powerfully, so that the house fell on the governors and all the people who were in it. And the dead whom he killed at his death were more than those whom he killed during his lifetime."},{"num":31,"verse":"Then his brothers and all his father’s household came down and took him, and brought him up and buried him between Zorah and Eshtaol in the tomb of his father Manoah. So he had judged Israel for twenty years."}]