[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "XXXIX.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Merodach-baladan.—The name is conspicuous in the Assyrian inscriptions of Sargon (Records of the Past, ix. 13), as having rebelled against him and set up an independent monarchy. He is described in them as son of Yakin, but this is, probably, a dynastic appellative, just as Jehu is described in the Assyrian records (Records of the Past, v. 41) as “the son of Khumri” (i.e., Omri). The mission had two ostensible objects: (1) congratulation on Hezekiah’s recovery; (2) to inquire and report as to the phenomenon of the sun-dial (2Chronicles 32:31). Really, we may believe the object of Merôdach-baladan was to open negotiations for an alliance with Judah. The “present,” interpreted after the manner of the East, would seem almost like an acknowledgment of Hezekiah’s hegemony, or even suzerainty, in such a confederacy.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Merodach-baladan.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The name is conspicuous in the Assyrian inscriptions of Sargon (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Records of the Past, ix.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 13), as having rebelled against him and set up an independent monarchy. He is described in them as ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "son of Yakin, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "but this is, probably, a dynastic appellative, just as Jehu is described in the Assyrian records (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Records of the Past, v.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 41) as “the son of Khumri” (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Omri). The mission had two ostensible objects: (1) congratulation on Hezekiah’s recovery; (2) to inquire and report as to the phenomenon of the sun-dial (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 32:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Really, we may believe the object of Merôdach-baladan was to open negotiations for an alliance with Judah. The “present,” interpreted after the manner of the East, would seem almost like an acknowledgment of Hezekiah’s ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "hegemony, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or even ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "suzerainty, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "in such a confederacy.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39:1-8 This chapter is the same as 2Ki 20:12-19.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At that time - That is, soon after his recovery; or after he had amassed great wealth, and was surrounded with the evidences of prosperity ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 32:27-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Merodach-baladan, the son of Balddan, king of Babylon - In the parallel place in 2 Kings 20:12, this name is written Berodach-baladan, by a change of a single letter. Probably the name was written and pronounced both ways. Merodach was an idol of the Babylonians Jeremiah 50:2 : 'Babylon is taken, Bel is confounded, Merodach is confounded.' This idol, according to Gesenius, was probably the planet Mars, or Mars the god of war. To this god, as well as to Saturn, the ancient Semitic nations offered human sacrifices (see Gesenius' Lex. and Corem. in loc.) The word 'Balddan' is also a compound word, and means 'Bel is his lord.' The name of this idol, Merodach, was often incorporated into the proper names of kings, and of others. Thus we have the names Evil-Merodach, Messi-Mordachus, Sisimor-dachus, Mardocentes, etc. In regard to the statement of Isaiah in this verse, no small degree of difficulty has been felt by commentators, and it is not until quite recently that the difficulty has been removed, and it has been done in a manner to furnish an additional and most striking demonstration of the entire and minute accuracy of the sacred narrative. The difficulty arose from several circnmstances:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Merodach-baladan, the son of Balddan, king of Babylon - In the parallel place in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 20:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", this name is written Berodach-baladan, by a change of a single letter. Probably the name was written and pronounced both ways. Merodach was an idol of the Babylonians ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : 'Babylon is taken, Bel is confounded, Merodach is confounded.' This idol, according to Gesenius, was probably the planet Mars, or Mars the god of war. To this god, as well as to Saturn, the ancient Semitic nations offered human sacrifices (see Gesenius' Lex. and Corem. in loc.) The word 'Balddan' is also a compound word, and means 'Bel is his lord.' The name of this idol, Merodach, was often incorporated into the proper names of kings, and of others. Thus we have the names Evil-Merodach, Messi-Mordachus, Sisimor-dachus, Mardocentes, etc. In regard to the statement of Isaiah in this verse, no small degree of difficulty has been felt by commentators, and it is not until quite recently that the difficulty has been removed, and it has been done in a manner to furnish an additional and most striking demonstration of the entire and minute accuracy of the sacred narrative. The difficulty arose from several circnmstances:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "1. This king of Babylon is nowhere else mentioned in sacred history.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. The kingdom of Assyria was yet flourishing, and Babylon was one of its dependencies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For, only nine years before, Salmanassar the Assyrian monarch is said to have transported the inhabitants of Babylon to other parts 2 Kings 17:24, and Manasseh, not many years after, was carried captive to Babylon by the king of Assyria 2 Chronicles 33:11. These instances incontestably prove that at the time of Hezekiah, Babylon was dependent on the Assyrian kings. Who, then, it is asked, was this Merodach-baladan, king of Babylon? If he was governor of that city, how could he send an embassy of congratulation to the Jewish sovereign, then at war with his liege lord? The canon of Ptolemy gives us no king of this name, nor does his chronology appear reeoncilable with sacred history.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For, only nine years before, Salmanassar the Assyrian monarch is said to have transported the inhabitants of Babylon to other parts ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Manasseh, not many years after, was carried captive to Babylon by the king of Assyria ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 33:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". These instances incontestably prove that at the time of Hezekiah, Babylon was dependent on the Assyrian kings. Who, then, it is asked, was this Merodach-baladan, king of Babylon? If he was governor of that city, how could he send an embassy of congratulation to the Jewish sovereign, then at war with his liege lord? The canon of Ptolemy gives us no king of this name, nor does his chronology appear reeoncilable with sacred history.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "'In this darkness and doubt,' says Dr. Wiseman, 'we must have continued, and the apparent contradiction of this text to ether passages would have remaimed inexplicable, had not the progress of modern Oriental study brought to light a document of the most venerable antiquity. This is nothing less than a fragment of Berosus, preserved in the chronicle of Eusebius. This interesting fragment informs us, that after Sennacherib's brother had governed Babylon, as Assyrian viceroy, Acises unjustly possessed himself of the supreme command. After thirty days he was murdered by Merodach-baladan, who usurped the sovereignty for six months, when he was in turn killed, and was succeeded by Elibus. But after three years, Sennacherib collected an army, gave the usurper battle, conquered, and took him prisoner. Having once more reduced Babylon to his obedience, he left his son Assordan, the Esarhaddon of Scripture, as governor of the city.'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The only objection to this satement, or to the entire consistency of this fragment with the Scripture narrative is, that Isaiah relates the murder of Sennacherib, and the succession of Esarhaddon before Merodach-baladan's embassy to Jerusalem. But to this Gesenius has well replied, that this arrangement is followed by the prophet in order to conclude the history of the Assyrian monarch, which has no further connection with the subject, so as not to return to it again.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By this order, also, the prophecy of his murder is more closely connected with the history of its fulfillment (Isaiah 37:7; compare Isaiah 37:38). And this solution, which supposes some interval to have elapsed between Sennacherib's return to Nineveh, and his death, is rendered probable by the words of the text itself. 'He went and returned, and dwelt in Nineveh; and it came to pass,' etc. Isaiah 37:37-38)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "By this order, also, the prophecy of his murder is more closely connected with the history of its fulfillment (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). And this solution, which supposes some interval to have elapsed between Sennacherib's return to Nineveh, and his death, is rendered probable by the words of the text itself. 'He went and returned, and dwelt in Nineveh; and it came to pass,' etc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:37-38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus we have it certainly explained how there was a king, or rather a usurper in Babylon at the time when it was really a provincial city of the Assyrian empire. Nothing was more probable than that Merodach-baladan, having seized the throne, should endeavor to unite himself in league and amity with the enemies of his master, against whom he had revolted. Hezekiah, who, no less than himself, had thrown off the Assyrian yoke, and was in powerful alliance with the king of Egypt, would be his first resource. No embassy, on the other hand, could be more welcome to the Jewish monarch who had the common enemy in his neighborhood, and who would be glad to see a division made in his favor by a rebellion in the very heart of that enemy's kingdom. Hence arose that excessive attention which he paid to the envoys of the usurper, and which so offended Isaiah, or rather God, who, as a consequence, threatened the Babylonian captivity (see Dr. Wiseman's Lectures on Science and Revealed Religion, pp. 369-371 Ed. And. 1837).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sent letters - The Septuagint adds, καὶ πρέβεις  kai presbeis - 'and ambassadors.'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And a present - It was customary among the Orientals, as it is now, to send a valuable present when one prince sent an embassage for any purpose to another. It is stated in 2 Chronicles 32:31, that one object of their coming was to make inquiry 'of the wonder that was done in the land;' that is, of the miracle in regard to the retrocession of the shadow on the sun-dial of Ahaz. It is well known that, from the earliest periods, the Babylonians and Chaldeans were distinguished for their attention to astronomy. Indeed, as a science, astronomy was first cultivated on the plains of Chaldea; and there the knowledge of that science was scarcely surpassed by any of the ancient nations. The report which they had heard of this miracle would, therefore, be to them a matter of deep interest as an astronomical fact, and they came to make inquiry into the exact truth of the report. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And a present - It was customary among the Orientals, as it is now, to send a valuable present when one prince sent an embassage for any purpose to another. It is stated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 32:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that one object of their coming was to make inquiry 'of the wonder that was done in the land;' that is, of the miracle in regard to the retrocession of the shadow on the sun-dial of Ahaz. It is well known that, from the earliest periods, the Babylonians and Chaldeans were distinguished for their attention to astronomy. Indeed, as a science, astronomy was first cultivated on the plains of Chaldea; and there the knowledge of that science was scarcely surpassed by any of the ancient nations. The report which they had heard of this miracle would, therefore, be to them a matter of deep interest as an astronomical fact, and they came to make inquiry into the exact truth of the report. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 39",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Isa 39:1-8. Hezekiah's Error in the Display of His Riches to the Babylonian Ambassador.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Merodach-baladan—For a hundred fifty years before the overthrow of Nineveh by Cyaxares the Mede, a succession of rulers, mostly viceroys of Assyria, ruled Babylon, from the time of Nabonassar, 747 B.C. That date is called \"the Era of Nabonassar.\" Pul or Phallukha was then expelled, and a new dynasty set up at Nineveh, under Tiglath-pileser. Semiramis, Pul's wife, then retired to Babylon, with Nabonassar, her son, whose advent to the throne of Babylon, after the overthrow of the old line at Nineveh, marked a new era. Sometimes the viceroys of Babylon made themselves, for a time, independent of Assyria; thus Merodach-baladan at this time did so, encouraged by the Assyrian disaster in the Jewish campaign. He had done so before, and was defeated in the first year of Sennacherib's reign, as is recorded in cuneiform characters in that monarchs palace of Koyunjik. Nabopolassar was the first who established, permanently, his independence; his son, Nebuchadnezzar, raised Babylon to the position which Nineveh once occupied; but from the want of stone near the Lower Euphrates, the buildings of Babylon, formed of sun-dried brick, have not stood the wear of ages as Nineveh has.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Merodach—an idol, the same as the god of war and planet Mars (Jer 50:2). Often kings took their names from their gods, as if peculiarly under their tutelage. So Belshazzar from Bel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Baladan—means \"Bel is his lord.\" The chronicle of Eusebius contains a fragment of Berosus, stating that Acises, an Assyrian viceroy, usurped the supreme command at Babylon. Merodach- (or Berodach-) baladan murdered him and succeeded to the throne. Sennacherib conquered Merodach-baladan and left Esar-haddon, his son, as governor of Babylon. Merodach-baladan would naturally court the alliance of Hezekiah, who, like himself, had thrown off the yoke of the Assyrian king, and who would be equally glad of the Babylonian alliance against Assyria; hence arose the excessive attention which he paid to the usurper.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "sick—An additional reason is given (2Ch 32:31). \"The princes of Babylon sent to enquire of the wonder that was done in the land\"; namely, the recession of the shadow on Ahaz' sundial; to the Chaldean astronomers, such a fact would be especially interesting, the dial having been invented at Babylon.The king of Babel sendeth ambassadors with letters and a present to Hezekiah; who showeth them all his treasures, Isaiah 39:1-2. Isaiah foretelleth him of the Babylonish captivity, Isaiah 39:3-7. His resignation, Isaiah 39:8.  No text from Poole on this verse. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "sick—An additional reason is given (2Ch 32:31). \"The princes of Babylon sent to enquire of the wonder that was done in the land\"; namely, the recession of the shadow on Ahaz' sundial; to the Chaldean astronomers, such a fact would be especially interesting, the dial having been invented at Babylon.The king of Babel sendeth ambassadors with letters and a present to Hezekiah; who showeth them all his treasures, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 39:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Isaiah foretelleth him of the Babylonish captivity, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 39:3-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His resignation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 39:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " No text from Poole on this verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At that time Merodachbaladan, the son of Baladan, king of Babylon,.... The same is called Berodach, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which, according to Hillerus (z), is the same with Barmerodach, the son of Merodach; though it is generally took to be a slip of the scribe's there, or a change of letter, as is common in names; he was either afterwards made a god of, or he had his name from an idol of the Babylonians so called, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which signifies \"a pure lord.\" Jerom observes it, as the opinion of the Jews, that he was the father of Nebuchadnezzar, which is not probable. Kimchi takes him to be the same with Esarhaddon, the son of Sennacherib; but he was king of Assyria, not of Babylon; it is most likely that he is the Assyrian king, whom Ptolemy in his canon calls Mardocempad; his other name Baladan, which is compounded of two words, \"bal\" and \"adan\", and both of them signify lord, he took from his father, for he is called the son of Baladan; by Josephus (a) he is called Baladas, who says that Berosus the Chaldean makes mention of a king of Babylon by this name. Bishop Usher (b) thinks he is the same that is called by profane writers Belesis, and Belessus, and Nabonasarus; his name consists of the names of three idols, Merodach, an idol of the Babylonians, as before observed, and Bal, the contraction of Baal, and Adon, the same with Adonis: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he sent letters and a present to Hezekiah; by his ambassadors, which was always usual in embassies and visits, and still is in the eastern countries; the purport of which embassy was to congratulate him upon his recovery, and to inquire concerning the miracle that was wrought in his land; either the destruction of the Assyrian army in one night by an angel, or rather the sun's going back ten degrees, 2 Chronicles 32:31 and, as Josephus (c) says, to enter into an alliance with him; and this seems to be the true reason of sending these ambassadors; or the king of Babylon had lately fallen off from the Assyrian monarch, and therefore was desirous of entering into a league with Hezekiah the king of Assyria's enemy, in order to strengthen himself against him, and secure his liberty he had just gained: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he sent letters and a present to Hezekiah; by his ambassadors, which was always usual in embassies and visits, and still is in the eastern countries; the purport of which embassy was to congratulate him upon his recovery, and to inquire concerning the miracle that was wrought in his land; either the destruction of the Assyrian army in one night by an angel, or rather the sun's going back ten degrees, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 32:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and, as Josephus (c) says, to enter into an alliance with him; and this seems to be the true reason of sending these ambassadors; or the king of Babylon had lately fallen off from the Assyrian monarch, and therefore was desirous of entering into a league with Hezekiah the king of Assyria's enemy, in order to strengthen himself against him, and secure his liberty he had just gained: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for he had heard that he had been sick, and was recovered; which both gives a reason of the embassy, and points at the time when it was; very probably the same year of his sickness and recovery. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Onomast. Sacr. p, 603. (a) Antiqu. l. 10. c. 2. sect. 2.((b) Annales Vet. Test. p. 87, 88. (c) Ibid. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Onomast. Sacr. p, 603. (a) Antiqu. l. 10. c. 2. sect. 2.((b) Annales Vet. Test. p. 87, 88. (c) Ibid. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "At that time {a} Merodachbaladan, the son of Baladan, king of Babylon, sent {b} letters and a present to Hezekiah: for he had heard that he had been sick, and had recovered.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "At that time ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Merodachbaladan, the son of Baladan, king of Babylon, sent ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " letters and a present to Hezekiah: for he had heard that he had been sick, and had recovered.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) This was the first king of Babylon, who overcame the Assyrians in the tenth year of his reign.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Merodach-baladan, the son of Baladan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The form “Berodach” in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is less correct. Marduk-habal-iddina is described in the monuments as “son of Yakin”; but this is no reason for doubting the identity of the person. The latter is probably his dynastic title.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "letters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a letter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". LXX. adds ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ πρέσβεις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. “ambassadors,” whose presence is assumed in the next verse.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for he had heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] So in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " correctly. The text here reads strictly “and he heard.” The motive here specified was merely a pretext to veil the real political object of the mission. This appears clearly enough in what follows. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 32:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the embassy was prompted by scientific curiosity with regard to the miracle of the sun-dial.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "At that time",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 32:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it appears that a part of the business of the ambassadors was to inquire concerning the astronomical marvel which had recently occurred in the land). The embassy probably followed the illness of Hezekiah within a year. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Merodach-Baladan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is a more correct form than the \"Berodach-Baladan\" of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The name is one common to several Babylonian kings, as to one who reigned about  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 1325",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to a second who is placed about  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 900",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to a third who was contemporary with the Assyrian kings Sargon and Sennacherib. It is this last of whom we have a notice in the present passage. He appears first in the Assyrian inscriptions as a petty prince, ruling a small tract upon the seacoast, about the mouths of the Tigris and Euphrates. Tiglath-Pileser takes tribute front him about  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 744",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 721",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we find him advanced to a more prominent position. Taking advantage of the troubles of the time, he shakes off the Assyrians yoke, and makes himself King of Babylon, where he has a reign of twelve years - from  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 721",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 709",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This reign is recognized by Sargon in his inscriptions ('Records of the Past,' vol. 9. p. 14), and by the Greek chronologist, Ptolemy, in his 'Canon.' In  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 709",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Sargon leads an expedition against him, and drives him out of Babylonia into the coast-tract, Chaldea, where he besieges him in his ancestral town Bit-Yakin, takes the city, and makes him prisoner (ibid., p. 15). On the death of Sargon, in  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 705",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Merodach-Baladan escapes from confinement, and hastens once more to Babylon, where he is acknowledged as king, and has a second reign, which lasts six months (Alex. Polyhist. ap. Euseb., 'Chronicles Can.,' 1. 5. § 1). He is then driven from the country by Sennacherib, and, after various vicissitudes, obliged to become a refugee in Elam (G. Smith, 'Hist. of Babylonia,' pp. 125-128). The name of Merodach-Baladau is composed of the three elements, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Merodach",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (equivalent to \"Mar-duk\"), the god, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "bal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"son,\" and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "iddina",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"has given,\" and thus signifies \"Merodach  has given (me) a son.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The son of Baladan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Baladan\" is scarcely a possible Babylonian name. \"Beladan\" would, however, be quite possible, being a name formed on the model of Ishtardddin ('Eponym Canon,' p. 30), Ninip-iddin (p. 35), Ilu-iddin (p. 57), etc. And the corruption of Beladan into Baladan would be easy. Merodach-Baladan III. is called by Sargon \"the son of Yakin;\" but this is perhaps a tribal or local rather than a personal name. Compare Jehu's appellation of \"son of Omri\" (ibid., p. 114). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Sent letters and a present to Hezekiah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hezekiah's fourteenth year was  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 714",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Merodach-Baladan had then been King of Babylon for eight years, and, knowing that he might at any time be attacked by Sargon, was naturally looking out for alliances with other powers, which Assyria equally threatened. He had recently concluded a treaty with Khumbanigas, King of Elam ('Records of the Past,' vol. 9. p. 14), and had obtained the support of several of the Aramaean tribes on the Euphrates. He now apparently thought that Judaea, which Sargon was also threatening (ch. 38:6), might be induced to join him. Hezekiah's illness and \"the wonder done in the land\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 32:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") furnished him with pretexts for an embassy, which probably had more serious objects than either congratulation or scientific inquiry. Isaiah 39:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "From this point onwards the text of the book of Kings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:12-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 32:24-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") runs parallel to the text before us. Babylonian ambassadors have an interview with the convalescent king of Judah. \"At that time Merodach Bal'adan (K. Berodach Bal'adan), son of Bal'adan king of Babel, sent writings and a present to Hizkiyahu, and heard (K. for he had heard) that he (K. Hizkiyahu) had been sick, and was restored again.\" The two texts here share the original text between them. Instead of the unnatural ויּשׁמע (which would link the cause on to the effect, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), we should read שׁמע כּי, whereas ויּחזק in our text appears to be the genuine word out of which חזקיהו in the other text has sprung, although it is not indispensable, as חלה has a pluperfect sense. In a similar manner the name of the king of Babylon is given here correctly as מראדך (Nissel, מרדך without א, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whilst the book of Kings has בּראד (according to the Masora with א), probably occasioned by the other name Bal'ădân, which begins with Beth. It cannot be maintained that the words ben Bal'ădân are a mistake; at the same time, Bal'ădân (Jos. Baladas) evidently cannot be a name by itself if Merō'dakh Bal'ădân signifies \"Merodach (the Babylonian Bel or Jupiter)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Rawlinson, Monarchies, i.169.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "filium dedit.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Oppert, Expdition, ii.355.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the Canon Ptol. Mardokempados is preceded by a Jugaeus; and the inscriptions, according to G. Rawlinson, Mon. ii. 395, indicate Merodach-Baladan as the \"son of Yakin.\" They relate that the latter acknowledged Tiglath-pileser as his feudal lord; that, after reigning twelve years as a vassal, he rose in rebellion against Sargon in league with the Susanians and the Aramaean tribes above Babylonia, and lost everything except his life; that he afterwards rebelled against Sennacherib in conjunction with a Chaldean prince named Susub, just after Sennacherib had returned from his first",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The inscription is mention two campaigns.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Judaean campaign to Nineveh; and that having been utterly defeated, he took refuge in an island of the Persian Gulf. He does not make his appearance any more; but Susub escaped from his place of concealment, and being supported by the Susanians and certain Aramaean tribes, fought a long and bloody battle with Sennacherib on the Lower Tigris. this battle he lost, and Nebo-som-iskun, a son of Merodach Baladan, fell into the hands of the conqueror. In the midst of these details, as given by the inscriptions, the statement of the Can. Ptol. may still be maintained, according to which the twelve years of Mardokempados (a contraction, as Ewald supposes, of Mardokempalados) commence with the year 721. From this point onwards the biblical and extra-biblical accounts dovetail together; whereas in Polyhistor (Eus. chron. arm.) the following Babylonian rulers are mentioned: \"a brother of Sennacherib, Acises, who reigned hardly a month; Merodach Baladan, six months; Elibus into the third year; Asordan, Sennacherib's son, who was made king after the defeat of Elibus.\" Now, as the Can. Ptolem. also gives a Belibos with a three years' reign, the identity of Mardokempados and Marodach Baladan is indisputable. The Can. Ptol. seems only to take into account his legitimate reign as a vassal, and Polyhistor (from Berosus) only his last act of rebellion. At the same time, this is very far from removing all the difficulties that lie in the way of a reconciliation, more especially the chronological difficulties. Rawlinson, who places the commencement of the (second) Judaean campaign in the year 698, and therefore transfers it to the end of the twenty-ninth year of Hezekiah's reign instead of the middle, sets himself in opposition not only to Isaiah 36:1, but also to Isaiah 38:5 and 2 Kings 18:2. According to the biblical accounts, as compared with the Can. Ptol., the embassy must have been sent by Merodach Baladan during the period of his reign as vassal, which commenced in the year 721. Apparently it had only the harmless object of congratulating the king upon his recovery (and also, according to 2 Chronicles 32:31, of making some inquiry, in the interests of Chaldean astrology, into the mōphēth connected with the sun-dial); but it certainly had also the secret political object of making common cause with Hezekiah to throw off the Assyrian yoke. All that can be maintained with certainty beside this is, that the embassy cannot have been sent before the fourteenth year of Hezekiah's reign; for as he reigned twenty-nine years, his illness must have occurred, according to Isaiah 38:5, in the fourteenth year itself, i.e., the seventh year of Mardokempados. Such questions as whether the embassy came before or after the Assyrian catastrophe, which was till in the future at the time referred to in Isaiah 38:4-6, or whether it came before or after the payment of the compensation money to Sennacherib (2 Kings 18:14-16), are open to dispute. In all probability it took place immediately before the Assyrian campaign,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Judaean campaign to Nineveh; and that having been utterly defeated, he took refuge in an island of the Persian Gulf. He does not make his appearance any more; but Susub escaped from his place of concealment, and being supported by the Susanians and certain Aramaean tribes, fought a long and bloody battle with Sennacherib on the Lower Tigris. this battle he lost, and Nebo-som-iskun, a son of Merodach Baladan, fell into the hands of the conqueror. In the midst of these details, as given by the inscriptions, the statement of the Can. Ptol. may still be maintained, according to which the twelve years of Mardokempados (a contraction, as Ewald supposes, of Mardokempalados) commence with the year 721. From this point onwards the biblical and extra-biblical accounts dovetail together; whereas in Polyhistor (Eus. chron. arm.) the following Babylonian rulers are mentioned: \"a brother of Sennacherib, Acises, who reigned hardly a month; Merodach Baladan, six months; Elibus into the third year; Asordan, Sennacherib's son, who was made king after the defeat of Elibus.\" Now, as the Can. Ptolem. also gives a Belibos with a three years' reign, the identity of Mardokempados and Marodach Baladan is indisputable. The Can. Ptol. seems only to take into account his legitimate reign as a vassal, and Polyhistor (from Berosus) only his last act of rebellion. At the same time, this is very far from removing all the difficulties that lie in the way of a reconciliation, more especially the chronological difficulties. Rawlinson, who places the commencement of the (second) Judaean campaign in the year 698, and therefore transfers it to the end of the twenty-ninth year of Hezekiah's reign instead of the middle, sets himself in opposition not only to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 36:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but also to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". According to the biblical accounts, as compared with the Can. Ptol., the embassy must have been sent by Merodach Baladan during the period of his reign as vassal, which commenced in the year 721. Apparently it had only the harmless object of congratulating the king upon his recovery (and also, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 32:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of making some inquiry, in the interests of Chaldean astrology, into the mōphēth connected with the sun-dial); but it certainly had also the secret political object of making common cause with Hezekiah to throw off the Assyrian yoke. All that can be maintained with certainty beside this is, that the embassy cannot have been sent before the fourteenth year of Hezekiah's reign; for as he reigned twenty-nine years, his illness must have occurred, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in the fourteenth year itself, i.e., the seventh year of Mardokempados. Such questions as whether the embassy came before or after the Assyrian catastrophe, which was till in the future at the time referred to in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or whether it came before or after the payment of the compensation money to Sennacherib (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:14-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), are open to dispute. In all probability it took place immediately before the Assyrian campaign,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: A reviewer in the Theol. L. Bl. 1857, p. 12, inquires: \"How could the prophet have known that all that Hezekiah showed to the Babylonian ambassador would one day be brought to Babylon, when in a very short time these treasures would all have been given by Hezekiah to the king of Assyria?\" Answer: The prophecy is so expressed in Isaiah 39:6-7, that this intervening occurrence does not prejudice its truth at all.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: A reviewer in the Theol. L. Bl. 1857, p. 12, inquires: \"How could the prophet have known that all that Hezekiah showed to the Babylonian ambassador would one day be brought to Babylon, when in a very short time these treasures would all have been given by Hezekiah to the king of Assyria?\" Answer: The prophecy is so expressed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 39:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that this intervening occurrence does not prejudice its truth at all.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "as Hezekiah was still able to show off the abundance of his riches to the Babylonian ambassadors. ",
        "children": []
      }
    ]
  }
]