[{"header":"Avoid Israel’s Mistakes"},{"num":10,"verse":"For I do not want you to be unaware, believers, that our fathers were all under the cloud [in which God’s presence went before them] and they all passed [miraculously and safely] through the [Red] Sea; "},{"num":2,"verse":"And all [of them] were baptized into Moses [into his safekeeping as their leader] in the cloud and in the sea; "},{"num":3,"verse":"and all [of them] ate the same spiritual food; "},{"num":4,"verse":"and all [of them] drank the same spiritual drink, for they were drinking from a spiritual rock which followed them; and the rock was Christ. "},{"num":5,"verse":"Nevertheless, God was not well-pleased with most of them, for they were scattered along the ground in the wilderness [because their lack of self-control led to disobedience which led to death]."},{"num":6,"verse":"Now these things [the warnings and admonitions] took place as examples for us, so that we would not crave evil things as they did. "},{"num":7,"verse":"Do not be worshipers of handmade gods, as some of them were; just as it is written [in Scripture], “The people sat down to eat and drink [after sacrificing to the golden calf at Horeb], and stood up to play [indulging in immoral activities].” "},{"num":8,"verse":"We must not indulge in [nor tolerate] sexual immorality, as some of them did, and twenty-three thousand [suddenly] fell [dead] in a single day! "},{"num":9,"verse":"We must not tempt the Lord [that is, test His patience, question His purpose or exploit His goodness], as some of them did—and they were killed by serpents. "},{"num":10,"verse":"And do not murmur [in unwarranted discontent], as some of them did—and were destroyed by the destroyer. "},{"num":11,"verse":"Now these things happened to them as an example and warning [to us]; they were written for our instruction [to admonish and equip us], upon whom the ends of the ages have come. "},{"num":12,"verse":"Therefore let the one who thinks he stands firm [immune to temptation, being overconfident and self-righteous], take care that he does not fall [into sin and condemnation]. "},{"num":13,"verse":"No temptation [regardless of its source] has overtaken or enticed you that is not common to human experience [nor is any temptation unusual or beyond human resistance]; but God is faithful [to His word—He is compassionate and trustworthy], and He will not let you be tempted beyond your ability [to resist], but along with the temptation He [has in the past and is now and] will [always] provide the way out as well, so that you will be able to endure it [without yielding, and will overcome temptation with joy]."},{"num":14,"verse":"Therefore, my beloved, run [keep far, far away] from [any sort of] idolatry [and that includes loving anything more than God, or participating in anything that leads to sin and enslaves the soul]. "},{"num":15,"verse":"I am speaking as to wise and sensible people; judge [carefully and thoughtfully consider] for yourselves what I say. "},{"num":16,"verse":"Is the cup of blessing which we bless [at the Lord’s Supper] not a sharing in the blood of Christ? [Indeed it is.] Is the bread which we break not a sharing in the body of Christ? [Indeed it is.] "},{"num":17,"verse":"Since there is one bread, we [believers] who are many are [united into] one body; for we all partake of the one bread [which represents the body of Christ]. "},{"num":18,"verse":"Consider the people of Israel; are those who eat the sacrifices not partners of the altar [united in their worship of the same God]? [Indeed they are.] "},{"num":19,"verse":"What do I mean then? That a thing offered to idols is anything [special or changed simply because it is offered], or that an idol is anything? "},{"num":20,"verse":"On the contrary, the things which the Gentiles (pagans) sacrifice, they sacrifice to demons [in effect], and not to God; and I do not want you to become partners with demons [by eating at feasts in pagan temples]. "},{"num":21,"verse":"You cannot drink [both] the Lord’s cup and the cup of demons. You cannot share in both the Lord’s table and the table of demons [thereby becoming partners with them]. "},{"num":22,"verse":"Do we [really] provoke the Lord to jealousy [when we eat food sacrificed to handmade “gods” at pagan feasts]? Are we [spiritually] stronger than He? [Certainly not! He knows that the idols are nothing. But we deeply offend Him.]"},{"num":23,"verse":"All things are lawful [that is, morally legitimate, permissible], but not all things are beneficial or advantageous. All things are lawful, but not all things are constructive [to character] and edifying [to spiritual life]. "},{"num":24,"verse":"Let no one seek [only] his own good, but [also] that of the other person. "},{"num":25,"verse":"[Regarding meat offered to idols:] Eat anything that is sold in the meat market without asking any questions for the sake of your conscience, "},{"num":26,"verse":"For the [whole] earth is the Lord’s, and everything that is in it. "},{"num":27,"verse":"If one of the unbelievers invites you [to a meal at his home] and you want to go, eat whatever is served to you without asking questions [about its source] for the sake of your conscience. "},{"num":28,"verse":"But if anyone says to you, “This meat has been offered in sacrifice to an idol,” do not eat it, out of consideration for the one who told you, and for conscience’s sake— "},{"num":29,"verse":"and by conscience I mean for the sake of the other man’s, not yours. For why is my freedom [of choice] judged by another’s conscience [another’s ethics—another’s sense of right and wrong]? "},{"num":30,"verse":"If I take my share [of food] with thankfulness, why am I accused because of something for which I give thanks?"},{"num":31,"verse":"So then, whether you eat or drink or whatever you do, do all to the glory of [our great] God. "},{"num":32,"verse":"Do not offend Jews or Greeks or even the church of God [but live to honor Him]; "},{"num":33,"verse":"just as I please everyone in all things [as much as possible adapting myself to the interests of others], not seeking my own benefit but that of the many, so that they [will be open to the message of salvation and] may be saved."}]