[{"num":10,"verse":"For I would not have you ignorant, brethren, that all our fathers were under the cloud, and all passed through the sea;"},{"num":2,"verse":"and all were baptised unto Moses in the cloud and in the sea;"},{"num":3,"verse":"and all ate the same spiritual food,"},{"num":4,"verse":"and all drank the same spiritual drink, for they drank of a spiritual rock which followed [them]: (now the rock was the Christ;)"},{"num":5,"verse":"yet God was not pleased with the most of them, for they were strewed in the desert."},{"num":6,"verse":"But these things happened [as] types of us, that we should not be lusters after evil things, as they also lusted."},{"num":7,"verse":"Neither be ye idolaters, as some of them; as it is written, The people sat down to eat and to drink, and rose up to play."},{"num":8,"verse":"Neither let us commit fornication, as some of them committed fornication, and fell in one day three and twenty thousand."},{"num":9,"verse":"Neither let us tempt the Christ, as some of them tempted, and perished by serpents."},{"num":10,"verse":"Neither murmur ye, as some of them murmured, and perished by the destroyer."},{"num":11,"verse":"Now all these things happened to them [as] types, and have been written for our admonition, upon whom the ends of the ages are come."},{"num":12,"verse":"So that let him that thinks that he stands take heed lest he fall."},{"num":13,"verse":"No temptation has taken you but such as is according to man's nature; and God is faithful, who will not suffer you to be tempted above what ye are able [to bear], but will with the temptation make the issue also, so that [ye] should be able to bear [it]."},{"num":14,"verse":"Wherefore, my beloved, flee from idolatry."},{"num":15,"verse":"I speak as to intelligent [persons]: do *ye* judge what I say."},{"num":16,"verse":"The cup of blessing which we bless, is it not [the] communion of the blood of the Christ? The bread which we break, is it not [the] communion of the body of the Christ?"},{"num":17,"verse":"Because we, [being] many, are one loaf, one body; for we all partake of that one loaf."},{"num":18,"verse":"See Israel according to flesh: are not they who eat the sacrifices in communion with the altar?"},{"num":19,"verse":"What then do I say? that what is sacrificed to an idol is anything, or that an idol is anything?"},{"num":20,"verse":"But that what [the nations] sacrifice they sacrifice to demons, and not to God. Now I do not wish you to be in communion with demons."},{"num":21,"verse":"Ye cannot drink [the] Lord's cup, and [the] cup of demons: ye cannot partake of [the] Lord's table, and of [the] table of demons."},{"num":22,"verse":"Do we provoke the Lord to jealousy? are we stronger than he?"},{"num":23,"verse":"All things are lawful, but all are not profitable; all things are lawful, but all do not edify."},{"num":24,"verse":"Let no one seek his own [advantage], but that of the other."},{"num":25,"verse":"Everything sold in the shambles eat, making no inquiry for conscience sake."},{"num":26,"verse":"For the earth [is] the Lord's and its fulness."},{"num":27,"verse":"But if any one of the unbelievers invite you, and ye are minded to go, all that is set before you eat, making no inquiry for conscience sake."},{"num":28,"verse":"But if any one say to you, This is offered to holy purposes, do not eat, for his sake that pointed it out, and conscience sake;"},{"num":29,"verse":"but conscience, I mean, not thine own, but that of the other: for why is my liberty judged by another conscience?"},{"num":30,"verse":"If *I* partake with thanksgiving, why am I spoken evil of for what *I* give thanks for?"},{"num":31,"verse":"Whether therefore ye eat, or drink, or whatever ye do, do all things to God's glory."},{"num":32,"verse":"Give no occasion to stumbling, whether to Jews, or Greeks, or the assembly of God."},{"num":33,"verse":"Even as *I* also please all in all things; not seeking my own profit, but that of the many, that they may be saved."}]