[{"header":"Warnings from Israel’s Past"},{"num":10,"verse":"Now I want you to know, brothers, that our fathers were all under the cloud, all passed through the sea, "},{"num":2,"verse":"and all were baptized into Moses in the cloud and in the sea. "},{"num":3,"verse":"They all ate the same spiritual food, "},{"num":4,"verse":"and all drank the same spiritual drink. For they drank from a spiritual rock that followed them, and that rock was Christ. "},{"num":5,"verse":"But God was not pleased with most of them, for they were struck down in the wilderness."},{"num":6,"verse":"Now these things became examples for us, so that we will not desire evil things as they did. "},{"num":7,"verse":"Don’t become idolaters as some of them were; as it is written, The people sat down to eat and drink, and got up to play. "},{"num":8,"verse":"Let us not commit sexual immorality as some of them did, and in a single day 23,000 people fell dead. "},{"num":9,"verse":"Let us not test Christ as some of them did and were destroyed by snakes. "},{"num":10,"verse":"Nor should we complain as some of them did, and were killed by the destroyer. "},{"num":11,"verse":"Now these things happened to them as examples, and they were written as a warning to us, on whom the ends of the ages have come. "},{"num":12,"verse":"So, whoever thinks he stands must be careful not to fall. "},{"num":13,"verse":"No temptation has overtaken you except what is common to humanity. God is faithful, and He will not allow you to be tempted beyond what you are able, but with the temptation He will also provide a way of escape so that you are able to bear it."},{"header":"Warning against Idolatry"},{"num":14,"verse":"Therefore, my dear friends, flee from idolatry. "},{"num":15,"verse":"I am speaking as to wise people. Judge for yourselves what I say. "},{"num":16,"verse":"The cup of blessing that we give thanks for, is it not a sharing in the blood of Christ? The bread that we break, is it not a sharing in the body of Christ? "},{"num":17,"verse":"Because there is one bread, we who are many are one body, for all of us share that one bread. "},{"num":18,"verse":"Look at the people of Israel. Do not those who eat the sacrifices participate in what is offered on the altar? "},{"num":19,"verse":"What am I saying then? That food offered to idols is anything, or that an idol is anything? "},{"num":20,"verse":"No, but I do say that what they sacrifice, they sacrifice to demons and not to God. I do not want you to participate with demons! "},{"num":21,"verse":"You cannot drink the cup of the Lord and the cup of demons. You cannot share in the Lord’s table and the table of demons. "},{"num":22,"verse":"Or are we provoking the Lord to jealousy? Are we stronger than He?"},{"header":"Christian Liberty"},{"num":23,"verse":"“Everything is permissible,” but not everything is helpful. “Everything is permissible,” but not everything builds up. "},{"num":24,"verse":"No one should seek his own good, but the good of the other person."},{"num":25,"verse":"Eat everything that is sold in the meat market, asking no questions for conscience’ sake, "},{"num":26,"verse":"for the earth is the Lord’s, and all that is in it. "},{"num":27,"verse":"If one of the unbelievers invites you over and you want to go, eat everything that is set before you, without raising questions of conscience. "},{"num":28,"verse":"But if someone says to you, “This is food offered to an idol,” do not eat it, out of consideration for the one who told you, and for conscience’ sake. "},{"num":29,"verse":"I do not mean your own conscience, but the other person’s. For why is my freedom judged by another person’s conscience? "},{"num":30,"verse":"If I partake with thanks, why am I slandered because of something I give thanks for?"},{"num":31,"verse":"Therefore, whether you eat or drink, or whatever you do, do everything for God’s glory. "},{"num":32,"verse":"Give no offense to the Jews or the Greeks or the church of God, "},{"num":33,"verse":"just as I also try to please all people in all things, not seeking my own profit, but the profit of many, so that they may be saved. "}]