[{"header":"Don’t Be Like the Jews"},{"num":10,"verse":"Brothers, I want you to know what happened to our ancestors who followed Moses. They were all under the cloud, and they all went through the sea. "},{"num":2,"verse":"They were all baptized as followers of Moses in the cloud and in the sea. "},{"num":3,"verse":"They all ate the same spiritual food. "},{"num":4,"verse":"And they all drank the same spiritual drink. They drank from that spiritual rock that was with them. That rock was Christ. "},{"num":5,"verse":"But God was not pleased with most of them. They died in the desert."},{"num":6,"verse":"And these things that happened are examples for us. They should stop us from wanting evil things as those people did. "},{"num":7,"verse":"Do not worship idols, as some of them did. It is written in the Scriptures: “The people sat down to eat and drink. Then they got up and had wild parties.” "},{"num":8,"verse":"We should not take part in sexual sin, as some of them did. In one day 23,000 of them died because of their sins. "},{"num":9,"verse":"We should not test the Lord as some of them did. They were killed by snakes. "},{"num":10,"verse":"And do not complain as some of them did. They were killed by the angel that destroys."},{"num":11,"verse":"The things that happened to those people are examples. And they were written down to be warnings for us. For we live in a time when all these things of the past have reached their goal. "},{"num":12,"verse":"So anyone who thinks he is standing strong should be careful not to fall. "},{"num":13,"verse":"The only temptations that you have are the temptations that all people have. But you can trust God. He will not let you be tempted more than you can stand. But when you are tempted, God will also give you a way to escape that temptation. Then you will be able to stand it."},{"num":14,"verse":"So, my dear friends, stay away from worshiping idols. "},{"num":15,"verse":"I am speaking to you, as to reasonable people; judge for yourselves what I say. "},{"num":16,"verse":"We give thanks for the cup of blessing. It is a sharing in the blood of Christ’s death. And the bread that we break is a sharing in the body of Christ. "},{"num":17,"verse":"There is one loaf of bread. And we are many people. But we all share from that one loaf. So we are really one body."},{"num":18,"verse":"Think about the people of Israel: Do not those who eat the sacrifices share in the altar? "},{"num":19,"verse":"I do not mean that the food sacrificed to an idol is something important. And I do not mean that an idol is anything at all. "},{"num":20,"verse":"But I say that what is sacrificed to idols is offered to demons, not to God. And I do not want you to share anything with demons. "},{"num":21,"verse":"You cannot drink the cup of the Lord and the cup of demons, too. You cannot share in the Lord’s table and the table of demons, too. "},{"num":22,"verse":"Do we want to make the Lord jealous? We are not stronger than he is, are we?"},{"header":"How to Use Christian Freedom"},{"num":23,"verse":"“We are allowed to do all things.” Yes. But not all things are good for us to do. “We are allowed to do all things.” Yes. But not all things help others grow stronger. "},{"num":24,"verse":"No one should try to do what will help only himself. He should try to do what is good for others."},{"num":25,"verse":"Eat any meat that is sold in the meat market. Do not ask questions about the meat to see if it is something you think is wrong to eat. "},{"num":26,"verse":"You can eat it, “because the earth and everything on it belong to the Lord.”"},{"num":27,"verse":"Someone who is not a believer may invite you to eat with him. If you want to go, eat anything that is put before you. Do not ask questions about it. "},{"num":28,"verse":"But if anyone says to you, “That food was offered to idols,” then do not eat it. Do not eat it because of that person who told you and because eating it would be something that might be thought wrong. "},{"num":29,"verse":"I don’t mean that you think it is wrong. But the other person might think it is wrong. My own freedom should not be judged by what someone else thinks. "},{"num":30,"verse":"I eat the meal with thankfulness. And I do not want to be criticized because of something I thank God for."},{"num":31,"verse":"So if you eat, or if you drink, or if you do anything, do everything for the glory of God. "},{"num":32,"verse":"Never do anything that might make others do wrong—Jews, Greeks, or God’s church. "},{"num":33,"verse":"I do the same thing. I try to please everybody in every way. I am not trying to do what is good for me. I try to do what is good for the most people. I do this so that they can be saved."}]