[{"header":"Learn from What Happened in the Time of Moses"},{"num":10,"verse":"I want you to know, brothers and sisters, that all our ancestors who left Egypt were under the cloud, and they all went through the sea. "},{"num":2,"verse":"They were all united with Moses by baptism in the cloud and in the sea. "},{"num":3,"verse":"All of them ate the same spiritual food, "},{"num":4,"verse":"and all of them drank the same spiritual drink. They drank from the spiritual rock that went with them, and that rock was Christ. "},{"num":5,"verse":"Yet, God was not pleased with most of them, so their dead bodies were scattered over the desert."},{"num":6,"verse":"These things have become examples for us so that we won’t desire what is evil, as they did. "},{"num":7,"verse":"So don’t worship false gods as some of them did, as Scripture says, “The people sat down to a feast which turned into an orgy.” "},{"num":8,"verse":"We shouldn’t sin sexually as some of them did. Twenty-three thousand of them died on one day. "},{"num":9,"verse":"We shouldn’t put the Lord to the test as some of them did. They were killed by snakes. "},{"num":10,"verse":"Don’t complain as some of them did. The angel of death destroyed them. "},{"num":11,"verse":"These things happened to make them an example for others. These things were written down as a warning for us who are living in the closing days of history. "},{"num":12,"verse":"So, people who think they are standing firmly should be careful that they don’t fall."},{"num":13,"verse":"There isn’t any temptation that you have experienced which is unusual for humans. God, who faithfully keeps his promises, will not allow you to be tempted beyond your power to resist. But when you are tempted, he will also give you the ability to endure the temptation as your way of escape."},{"header":"Stay Away from Worshiping False Gods"},{"num":14,"verse":"Therefore, my dear friends, get as far away from the worship of false gods as you can."},{"num":15,"verse":"I’m talking to intelligent people. Judge for yourselves what I’m saying. "},{"num":16,"verse":"When we bless the cup of blessing aren’t we sharing in the blood of Christ? When we break the bread aren’t we sharing in the body of Christ? "},{"num":17,"verse":"Because there is one loaf, we are one body, although we are many individuals. All of us share one loaf."},{"num":18,"verse":"Look at the people of Israel from a human point of view. Don’t those who eat the sacrifices share what is on the altar? "},{"num":19,"verse":"Do I mean that an offering made to a false god is anything, or that a false god itself is anything? "},{"num":20,"verse":"Hardly! What I am saying is that these sacrifices which people make are made to demons and not to God. I don’t want you to be partners with demons. "},{"num":21,"verse":"You cannot drink the Lord’s cup and the cup of demons. You cannot participate at the table of the Lord and at the table of demons. "},{"num":22,"verse":"Are we trying to make the Lord jealous? Are we stronger than he is?"},{"num":23,"verse":"Someone may say, “I’m allowed to do anything,” but not everything is helpful. I’m allowed to do anything, but not everything encourages growth. "},{"num":24,"verse":"People should be concerned about others and not just about themselves. "},{"num":25,"verse":"Eat anything that is sold in the market without letting your conscience trouble you. "},{"num":26,"verse":"Certainly, “The earth is the Lord’s and everything it contains is his.” "},{"num":27,"verse":"If an unbeliever invites you to his house for dinner, and you wish to go, eat anything he serves you without letting your conscience trouble you. "},{"num":28,"verse":"However, if someone says to you, “This was sacrificed to a god,” don’t eat it because of the one who informed you and because of conscience. "},{"num":29,"verse":"I’m not talking about your conscience but the other person’s conscience. Why should my freedom be judged by someone else’s conscience? "},{"num":30,"verse":"If I give thanks to God for the food I eat, why am I condemned for that? "},{"num":31,"verse":"So, whether you eat or drink, or whatever you do, do everything to the glory of God. "},{"num":32,"verse":"Don’t cause others to stumble, whether they are Jewish, Greek, or members of God’s church. "},{"num":33,"verse":"I try to please everyone in every way. I don’t think about what would be good for me but about what would be good for many people so that they might be saved. "}]