[{"header":"Warnings from History"},{"num":10,"verse":"For I do not want you to be ignorant, brothers and sisters, that our fathers were all under the cloud and all passed through the sea."},{"num":2,"verse":" They all were immersed into Moses in the cloud and in the sea. "},{"num":3,"verse":"And all ate the same spiritual food, "},{"num":4,"verse":"and all drank the same spiritual drink—for they were drinking from a spiritual rock that followed them, and the Rock was Messiah."},{"num":5,"verse":" Nevertheless, God was not pleased with most of them, for they were struck down in the desert."},{"num":6,"verse":"Now these things happened as examples for us, so we wouldn’t crave evil things, just as they did."},{"num":7,"verse":" Do not be idolaters, as some of them were. As it is written, “The people sat down to eat and drink, and rose up to play.”"},{"num":8,"verse":" And let’s not commit sexual immorality, as some of them did—and in one day 23,000 fell."},{"num":9,"verse":" And let’s not test the Lord, as some of them did—and were destroyed by serpents."},{"num":10,"verse":" And let’s not grumble, as some of them did—and were destroyed by the destroying angel."},{"num":11,"verse":" Now these things happened to them as an example, and it was written down as a warning to us—on whom the ends of the ages have come. "},{"num":12,"verse":"Therefore let the one who thinks that he stands watch out that he doesn’t fall. "},{"num":13,"verse":"No temptation has taken hold of you except what is common to mankind. But God is faithful—He will not allow you to be tempted beyond what you can handle. But with the temptation He will also provide a way of escape, so you will be able to endure it."},{"header":"Feast with the Lord—Not with Idols"},{"num":14,"verse":"Therefore, my dearly loved ones, flee from idolatry. "},{"num":15,"verse":"I speak as to sensible people—judge for yourselves what I say. "},{"num":16,"verse":"The cup of blessing that we bless—isn’t it a sharing of Messiah’s blood? The bread which we break—isn’t it a sharing of Messiah’s body? "},{"num":17,"verse":"Since there is one bread, we who are many are one body—for we all partake of the one bread. "},{"num":18,"verse":"Consider physical Israel. Those who eat the sacrifices—aren’t they partners in the altar?"},{"num":19,"verse":"What am I saying then—that an idol sacrifice is anything, or that an idol is anything? "},{"num":20,"verse":"No, I’m saying that what the pagans sacrifice is to demons and not to God, and I don’t want you to become partners with demons."},{"num":21,"verse":" You cannot drink the cup of the Lord and the cup of demons. You cannot partake of the table of the Lord and the table of demons. "},{"num":22,"verse":"Or do we provoke the Lord to jealousy? We are not stronger than He, are we?"},{"num":23,"verse":"“Everything is permitted”—but not everything is helpful. “Everything is permitted”—but not everything builds up. "},{"num":24,"verse":"Let no one seek his own good, but the good of his neighbor. "},{"num":25,"verse":"Eat whatever is sold in the meat market, without raising questions of conscience. "},{"num":26,"verse":"For “the earth is the Lord’s, and its fullness.”"},{"num":27,"verse":" If an unbeliever invites you over and you want to go, eat whatever is set before you, without raising questions of conscience. "},{"num":28,"verse":"But if anyone says to you, “This is from an idol sacrifice,” do not eat it, for the sake of the one who informed you, and for the sake of conscience—"},{"num":29,"verse":"not your own conscience, I mean, but the other person’s. For why is my freedom judged by another’s conscience? "},{"num":30,"verse":"If I partake with thankfulness, why am I denounced because of something I give thanks for?"},{"num":31,"verse":"Therefore, whether you eat or drink or whatever you do, do all to the glory of God. "},{"num":32,"verse":"Give no offense either to Jewish or Greek people or to God’s community—"},{"num":33,"verse":"just as I also try to please everyone in everything, not seeking my own benefit but the benefit of many, so that they may be saved."}]