[{"header":"Orders from the Lord"},{"num":1,"verse":"After Moses the Lord’s servant died, the Lord spoke to Joshua, Nun’s son. He had been Moses’ helper."},{"num":2,"verse":"“My servant Moses is dead. Now get ready to cross over the Jordan with this entire people to the land that I am going to give to the Israelites."},{"num":3,"verse":"I am giving you every place where you set foot, exactly as I promised Moses."},{"num":4,"verse":"Your territory will stretch from the desert and the Lebanon as far as the great Euphrates River, including all Hittite land, up to the Mediterranean Sea on the west."},{"num":5,"verse":"No one will be able to stand up against you during your lifetime. I will be with you in the same way I was with Moses. I won’t desert you or leave you."},{"num":6,"verse":"Be brave and strong, because you are the one who will help this people take possession of the land, which I pledged to give to their ancestors."},{"num":7,"verse":"“Be very brave and strong as you carefully obey all of the Instruction that Moses my servant commanded you. Don’t deviate even a bit from it, either to the right or left. Then you will have success wherever you go."},{"num":8,"verse":"Never stop speaking about this Instruction scroll. Recite it day and night so you can carefully obey everything written in it. Then you will accomplish your objectives and you will succeed."},{"num":9,"verse":"I’ve commanded you to be brave and strong, haven’t I? Don’t be alarmed or terrified, because the Lord your God is with you wherever you go.”"},{"header":"Joshua gives orders"},{"num":10,"verse":"Then Joshua gave orders to the people’s officers:"},{"num":11,"verse":"“Go through the camp and give orders to the people. Say, ‘Get supplies ready for yourselves because in three days you will be crossing over the Jordan to enter the land and take it over. The Lord your God is going to give it to you as your possession.’”"},{"num":12,"verse":"Then Joshua addressed the Reubenites, the Gadites, and half the tribe of Manasseh:"},{"num":13,"verse":"“Remember the command that Moses the Lord’s servant gave you: ‘The Lord your God will give you rest and give you this land.’"},{"num":14,"verse":"Your wives, children, and cattle may remain in the land that Moses has given you on the east side of the Jordan. But all you brave fighters, organized for war, must cross over in front of your fellow Israelites. You must help them"},{"num":15,"verse":"until the Lord gives a rest like yours to your fellow Israelites and they too take possession of the land that the Lord your God is giving them. Then you may return and take over the land that belongs to you, which Moses the Lord’s servant has given you on the east side of the Jordan.”"},{"num":16,"verse":"They answered Joshua, “We will obey everything you have commanded us and go anywhere you send us."},{"num":17,"verse":"We will obey you in the same way that we obeyed Moses. Just let the Lord your God be with you as he was with Moses!"},{"num":18,"verse":"Anybody who stubbornly opposes what you declare and doesn’t obey any of your commands will be put to death. Be brave and strong!”"}]