[{"header":"God’s Command to Joshua"},{"num":1,"verse":"Moses was the servant of the Lord. Joshua son of Nun was Moses’ assistant. After Moses died, the Lord said to Joshua: "},{"num":2,"verse":"“My servant Moses is dead. Now you and all these people go across the Jordan River. Go into the land I am giving to the people of Israel. "},{"num":3,"verse":"I promised Moses I would give you this land. So I will give you every place you go in the land. "},{"num":4,"verse":"All the land from the desert in the south to Lebanon in the north will be yours. All the land from the great river, the Euphrates, in the east, to the Mediterranean Sea in the west will be yours. This includes the land of the Hittites. "},{"num":5,"verse":"Just as I was with Moses, so I will be with you. No one will be able to stop you all your life. I will not leave you. I will never leave you alone."},{"num":6,"verse":"“Joshua, be strong and brave! You must lead these people so they can take their land. This is the land I promised their fathers I would give them. "},{"num":7,"verse":"Be strong and brave. Be sure to obey all the teachings my servant Moses gave you. If you follow them exactly, you will be successful in everything you do. "},{"num":8,"verse":"Always remember what is written in the Book of the Teachings. Study it day and night. Then you will be sure to obey everything that is written there. If you do this, you will be wise and successful in everything. "},{"num":9,"verse":"Remember that I commanded you to be strong and brave. So don’t be afraid. The Lord your God will be with you everywhere you go.”"},{"header":"Joshua’s Orders to the People"},{"num":10,"verse":"So Joshua gave orders to the officers of the people. He said, "},{"num":11,"verse":"“Go through the camp and tell the people, ‘Get your supplies ready. Three days from now you will cross the Jordan River. You will go and take the land the Lord your God is giving you.’”"},{"num":12,"verse":"Then Joshua spoke to the people of Reuben, Gad and the eastern half-tribe of Manasseh. Joshua said, "},{"num":13,"verse":"“Remember what Moses, the servant of the Lord, told you. He said the Lord your God would give you rest. And he said the Lord would give you this land. "},{"num":14,"verse":"Now the Lord has given you this land east of the Jordan River. Your wives, your children and your animals may stay here. But your fighting men must dress for war and cross the Jordan River ahead of your brothers. You must help your brothers. "},{"num":15,"verse":"The Lord has given you a place to rest. He will do the same for your brothers. But you must help them until they take the land. This is the land the Lord their God is giving them. Then you may return to your own land east of the Jordan River. That is the land that Moses, the servant of the Lord, gave you.”"},{"num":16,"verse":"Then the people answered Joshua, “Anything you command us to do, we will do. Any place you send us, we will go. "},{"num":17,"verse":"Just as we fully obeyed Moses, we will obey you. We ask only that the Lord your God be with you just as he was with Moses. "},{"num":18,"verse":"Then, if anyone refuses to obey your commands or turns against you, he will be put to death. Just be strong and brave!”"}]