[{"header":"The New Jerusalem"},{"num":21,"verse":"Then I saw a new heaven and a new earth [Is. 65:17; 66:22; 2 Pet. 3:13]. [For] The first heaven and the first earth had ·disappeared [passed away], and there was no sea anymore [the sea represents chaos and evil, so its absence indicates peace and security]. "},{"num":2,"verse":"And I saw the holy city, the new Jerusalem [the believers’ eternal dwelling place; 3:12], coming down out of heaven from God. It was prepared like a bride ·dressed [adorned] for her husband [19:7, 9]. "},{"num":3,"verse":"And I heard a loud voice from the throne, saying, “[Look; Behold] Now God’s ·presence [dwelling; tabernacle] is with people, and he will ·live [dwell; tabernacle; John 1:14] with them, and they will be his people [Ex. 29:45; Jer. 31:33; Ezek. 37:27]. God himself will be with them and will be their God. "},{"num":4,"verse":"He will wipe away every tear from their eyes [7:17; Is. 25:8], and there will be no more death [Is. 25:8; 1 Cor. 15:54], ·sadness [mourning], crying, or pain, because ·all the old ways [the old order; the first things] are gone.”"},{"num":5,"verse":"The One who was sitting on the throne [Jesus] said, “Look! I am making everything new!” Then he said, “Write this, because these words are ·true and can be trusted [faithful/reliable and true].”"},{"num":6,"verse":"The One on the throne said to me, “It is ·finished [done; accomplished]. I am the Alpha and the Omega [the first and last letters of the Greek alphabet; 1:8], the Beginning and the End. I will give ·free water [freely] from the spring of the water of life to anyone who is thirsty [Is. 55:1; John 7:37]. "},{"num":7,"verse":"Those who ·win the victory [conquer] will ·receive [inherit] ·this [these things; God’s promise], and I will be their God, and they will be my children [21:3; 2 Sam. 7:14]. "},{"num":8,"verse":"But cowards, those ·who refuse to believe [without faith], who do ·evil [vile; detestable] things, who kill, who sin sexually, who do ·evil magic [sorcery], who worship idols, and who tell lies—all these will have ·a place [their part] in the lake of burning sulfur. This is the second death [20:6].”"},{"num":9,"verse":"Then one of the seven angels who had the seven bowls full of the seven last ·troubles [plagues] came to me, saying, “·Come with me [Come], and I will show you the bride, the wife of the Lamb [the church; Eph. 5:27–29].” "},{"num":10,"verse":"And the angel carried me away ·by the Spirit [or in the spirit] to a very large and high mountain. He showed me the holy city, Jerusalem, coming down out of heaven from God. "},{"num":11,"verse":"It ·was shining with [possessed; had] the glory of God and was ·bright [radiant; brilliant] like a ·very expensive jewel [precious stone], like a jasper, clear as crystal. "},{"num":12,"verse":"The city had a great high wall with twelve gates with twelve angels at the gates, and on each gate was written the name of one of the twelve tribes of Israel. "},{"num":13,"verse":"There were three gates on the east, three on the north, three on the south, and three on the west [Ezek. 48:30–35]. "},{"num":14,"verse":"The walls of the city were built on twelve foundation stones, and on the stones were written the names of the twelve apostles of the Lamb."},{"num":15,"verse":"The angel who talked with me had a measuring rod made of gold to measure the city, its gates, and its wall. "},{"num":16,"verse":"The city ·was built in a square [lies foursquare], and its length was equal to its width. The angel measured the city with the rod. The city was ·1,500 miles long, 1,500 miles wide, and 1,500 miles high [1,200 stadia—its length and width and height are equal; the unit of measure called a stadium was approximately 600 feet]. "},{"num":17,"verse":"The angel also measured the wall. It was ·216 feet [144 cubits] ·high [or thick; the Greek is ambiguous], by human measurements, which the angel was using. "},{"num":18,"verse":"The wall was made of jasper, and the city was made of pure gold, as pure as glass. "},{"num":19,"verse":"The foundation stones of the city walls were ·decorated [ornamented] with every kind of ·jewel [precious stone; Ex. 28:15–21; Is. 54:11–12]. The first foundation was jasper, the second was sapphire, the third was ·chalcedony [agate], the fourth was emerald, "},{"num":20,"verse":"the fifth was ·onyx [sardonyx], the sixth was carnelian, the seventh was ·chrysolite [yellow quartz], the eighth was beryl, the ninth was topaz, the tenth was ·chrysoprase [turquoise], the eleventh was jacinth, and the twelfth was amethyst [the specific identity of some of these jewels is uncertain]. "},{"num":21,"verse":"The twelve gates were twelve pearls, each gate having been made from a single pearl. And the ·street [main street; square] of the city was made of pure gold as clear as glass."},{"num":22,"verse":"I did not see a temple in the city, because the Lord God ·Almighty [All-powerful] and the Lamb are the city’s temple [a temple representing the presence of God is not needed because God’s presence is throughout the city]. "},{"num":23,"verse":"The city does not need the sun or the moon to shine on it, because the glory of God ·is its [gives it] light, and the Lamb is the city’s lamp [Is. 60:19]. "},{"num":24,"verse":"By its light the ·people of the world [nations] will walk, and the kings of the earth will bring their glory into it [Is. 60:1–3]. "},{"num":25,"verse":"The city’s gates will never be shut on any day [Is. 60:11], because there is no night there. "},{"num":26,"verse":"The glory and the honor of the nations will be brought into it [as gifts to God]. "},{"num":27,"verse":"Nothing ·unclean [impure; profane; common] and no one who does ·shameful [detestable; abominable] things or tells lies will ever go into it. Only those whose names are written in the Lamb’s ·book [scroll] of life [3:5] will enter the city."}]