[{"header":"The New Heaven and the New Earth"},{"num":21,"verse":"Then I saw a new heaven and a new earth; for the first heaven and the first earth had passed away, and the sea was no more. "},{"num":2,"verse":"And I saw the holy city, the new Jerusalem, coming down out of heaven from God, prepared as a bride adorned for her husband. "},{"num":3,"verse":"And I heard a loud voice from the throne saying,"},{"num":5,"verse":"And the one who was seated on the throne said, ‘See, I am making all things new.’ Also he said, ‘Write this, for these words are trustworthy and true.’ "},{"num":6,"verse":"Then he said to me, ‘It is done! I am the Alpha and the Omega, the beginning and the end. To the thirsty I will give water as a gift from the spring of the water of life. "},{"num":7,"verse":"Those who conquer will inherit these things, and I will be their God and they will be my children. "},{"num":8,"verse":"But as for the cowardly, the faithless, the polluted, the murderers, the fornicators, the sorcerers, the idolaters, and all liars, their place will be in the lake that burns with fire and sulphur, which is the second death.’"},{"header":"Vision of the New Jerusalem"},{"num":9,"verse":"Then one of the seven angels who had the seven bowls full of the seven last plagues came and said to me, ‘Come, I will show you the bride, the wife of the Lamb.’ "},{"num":10,"verse":"And in the spirit he carried me away to a great, high mountain and showed me the holy city Jerusalem coming down out of heaven from God. "},{"num":11,"verse":"It has the glory of God and a radiance like a very rare jewel, like jasper, clear as crystal. "},{"num":12,"verse":"It has a great, high wall with twelve gates, and at the gates twelve angels, and on the gates are inscribed the names of the twelve tribes of the Israelites; "},{"num":13,"verse":"on the east three gates, on the north three gates, on the south three gates, and on the west three gates. "},{"num":14,"verse":"And the wall of the city has twelve foundations, and on them are the twelve names of the twelve apostles of the Lamb."},{"num":15,"verse":"The angel who talked to me had a measuring rod of gold to measure the city and its gates and walls. "},{"num":16,"verse":"The city lies foursquare, its length the same as its width; and he measured the city with his rod, fifteen hundred miles; its length and width and height are equal. "},{"num":17,"verse":"He also measured its wall, one hundred and forty-four cubits by human measurement, which the angel was using. "},{"num":18,"verse":"The wall is built of jasper, while the city is pure gold, clear as glass. "},{"num":19,"verse":"The foundations of the wall of the city are adorned with every jewel; the first was jasper, the second sapphire, the third agate, the fourth emerald, "},{"num":20,"verse":"the fifth onyx, the sixth cornelian, the seventh chrysolite, the eighth beryl, the ninth topaz, the tenth chrysoprase, the eleventh jacinth, the twelfth amethyst. "},{"num":21,"verse":"And the twelve gates are twelve pearls, each of the gates is a single pearl, and the street of the city is pure gold, transparent as glass."},{"num":22,"verse":"I saw no temple in the city, for its temple is the Lord God the Almighty and the Lamb. "},{"num":23,"verse":"And the city has no need of sun or moon to shine on it, for the glory of God is its light, and its lamp is the Lamb. "},{"num":24,"verse":"The nations will walk by its light, and the kings of the earth will bring their glory into it. "},{"num":25,"verse":"Its gates will never be shut by day—and there will be no night there. "},{"num":26,"verse":"People will bring into it the glory and the honour of the nations. "},{"num":27,"verse":"But nothing unclean will enter it, nor anyone who practises abomination or falsehood, but only those who are written in the Lamb’s book of life."}]