[{"num":21,"verse":"And I saw a new Heaven and a new Earth. For the first Heaven and the first Earth had passed away. And there was no more sea."},{"num":2,"verse":"And I, John, saw the holy city, New Jerusalem, come down from God out of Heaven, prepared as a bride adorned for her husband."},{"num":3,"verse":"And I heard a great voice out of Heaven, saying, “Behold, the Tabernacle of God is with man! And He will dwell with them! And they shall be His people! And God Himself shall be their God with them!"},{"num":4,"verse":"“And God shall wipe away all tears from their eyes! And there shall be no more death or sorrow or crying. Nor shall there be any more pain. For the first things are passed!”"},{"num":5,"verse":"And He who sat upon the throne, said, “Behold, I make all things new!” And He said to me, “Write. For these things are faithful and true.”"},{"num":6,"verse":"And He said to me, “It is done. I am Alpha and Omega, the beginning and the end. I will give freely from the well of the water of life to him who is thirsty."},{"num":7,"verse":"“He who overcomes, shall inherit all things. And I will be his God. And he shall be My Son."},{"num":8,"verse":"“But the fearful and unbelieving, and the abominable and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall take their place in the lake which burns with fire and brimstone; which is the second death.”"},{"num":9,"verse":"And there came to me one of the seven angels, who had the seven vials full of the seven last plagues, and talked with me, saying, “Come. I will show you the Bride, the Lamb’s wife.”"},{"num":10,"verse":"And he carried me away in the Spirit to a great and high mountain. And he showed me the great city, the holy Jerusalem, descending out of Heaven from God;"},{"num":11,"verse":"having the glory of God. And she shined like a most precious stone, as a jasper stone, clear as crystal;"},{"num":12,"verse":"And had a great high wall, with twelve gates. And at the gates were twelve angels. And the names written on them were the twelve tribes of the children of Israel."},{"num":13,"verse":"On the east part, there were three gates; and on the north side, three gates; on the south side three gates; and on the west side, three gates."},{"num":14,"verse":"And the wall of the city had twelve foundations; and in them, the names of the Lamb’s twelve Apostles."},{"num":15,"verse":"And he who walked with me had a golden reed, with which to measure the city, and the gates thereof, and the wall thereof."},{"num":16,"verse":"And the city lays square. And the length is as large as the breadth of it. And he measured the city with the reed: twelve thousand furlongs. And the length and the breadth and the height of it are equal."},{"num":17,"verse":"And he measured the wall thereof: 144 cubits, by the measure of man (that is, of the angel)."},{"num":18,"verse":"And the structure of the wall was of jasper. And the city was pure gold, like clear glass."},{"num":19,"verse":"And the foundations of the wall of the city were garnished with all kinds of precious stones. The first foundation was of jasper; the second, Sapphire; the third, of Chalcedony; the fourth of an Emerald;"},{"num":20,"verse":"the fifth, of a Sardonyx; the sixth, of a Sardius; the seventh, of a Chrysolite; the eighth, of a Beryl; the ninth, of a Topaz; the tenth, of a Chrysoprase; the eleventh, of a Jacinth; the twelfth, an Amethyst."},{"num":21,"verse":"And the twelve gates were twelve pearls. And every gate is made of one pearl. And the street of the city is pure gold, as shining glass."},{"num":22,"verse":"And I saw no Temple therein. For the Lord God Almighty and the Lamb are the Temple of it."},{"num":23,"verse":"And their city has no need of the sun, nor of the moon, to shine in it. For the glory of God lit it. And the Lamb is the Light of it."},{"num":24,"verse":"And the people who are saved shall walk in the light of it. And the kings of the earth shall bring their glory and honor to it."},{"num":25,"verse":"And the gates of it shall not be shut by day. For there shall be no night there."},{"num":26,"verse":"And the glory and honor of the Gentiles shall be brought into it."},{"num":27,"verse":"And there shall enter into it no unclean thing, nor whatever works abomination or lies; but only those who are written in the Lamb’s Book of Life."}]