[{"header":"The Table of Nations"},{"num":10,"verse":"These are the family records of Noah’s sons, Shem, Ham, and Japheth. They also had sons after the flood."},{"num":2,"verse":"Japheth’s sons: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras. "},{"num":3,"verse":"Gomer’s sons: Ashkenaz, Riphath, and Togarmah. "},{"num":4,"verse":"And Javan’s sons: Elishah, Tarshish, Kittim, and Dodanim. "},{"num":5,"verse":"The coastland peoples spread out into their lands. These are Japheth’s sons by their clans, in their nations. Each group had its own language."},{"num":6,"verse":"Ham’s sons: Cush, Egypt, Put, and Canaan. "},{"num":7,"verse":"Cush’s sons: Seba, Havilah, Sabtah, Raamah, and Sabteca. And Raamah’s sons: Sheba and Dedan."},{"num":8,"verse":"Cush fathered Nimrod, who was the first powerful man on earth. "},{"num":9,"verse":"He was a powerful hunter in the sight of the Lord. That is why it is said, “Like Nimrod, a powerful hunter in the sight of the Lord.” "},{"num":10,"verse":"His kingdom started with Babylon, Erech, Accad, and Calneh, in the land of Shinar. "},{"num":11,"verse":"From that land he went to Assyria and built Nineveh, Rehoboth-ir, Calah, "},{"num":12,"verse":"and Resen, between Nineveh and the great city Calah."},{"num":13,"verse":"Mizraim fathered Ludim, Anamim, Lehabim, Naphtuhim, "},{"num":14,"verse":"Pathrusim, Casluhim (the Philistines came from them), and Caphtorim."},{"num":15,"verse":"Canaan fathered Sidon his firstborn, then Heth, "},{"num":16,"verse":"the Jebusites, the Amorites, the Girgashites, "},{"num":17,"verse":"the Hivites, the Arkites, the Sinites, "},{"num":18,"verse":"the Arvadites, the Zemarites, and the Hamathites. Afterward the Canaanite clans scattered. "},{"num":19,"verse":"The Canaanite border went from Sidon going toward Gerar as far as Gaza, and going toward Sodom, Gomorrah, Admah, and Zeboiim as far as Lasha."},{"num":20,"verse":"These are Ham’s sons, by their clans, according to their languages, in their own lands and their nations."},{"num":21,"verse":"And Shem, Japheth’s older brother, also had sons. Shem was the father of all the sons of Eber. "},{"num":22,"verse":"Shem’s sons were Elam, Asshur, Arpachshad, Lud, and Aram."},{"num":23,"verse":"Aram’s sons: Uz, Hul, Gether, and Mash."},{"num":24,"verse":"Arpachshad fathered Shelah, and Shelah fathered Eber. "},{"num":25,"verse":"Eber had two sons. One was named Peleg, for during his days the earth was divided; his brother was named Joktan. "},{"num":26,"verse":"And Joktan fathered Almodad, Sheleph, Hazarmaveth, Jerah, "},{"num":27,"verse":"Hadoram, Uzal, Diklah, "},{"num":28,"verse":"Obal, Abimael, Sheba, "},{"num":29,"verse":"Ophir, Havilah, and Jobab. All these were Joktan’s sons. "},{"num":30,"verse":"Their settlements extended from Mesha to Sephar, the eastern hill country."},{"num":31,"verse":"These are Shem’s sons by their clans, according to their languages, in their lands and their nations."},{"num":32,"verse":"These are the clans of Noah’s sons, according to their family records, in their nations. The nations on earth spread out from these after the flood."}]