[[],[{"type":"header","content":"The Table of Nations"},{"type":"prose","content":"This is the account of Noah’s sons: Shem, Ham, and Japheth. Sons were born to them after the flood."}],[{"type":"prose","content":"The sons of Japheth were Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras. "}],[{"type":"prose","content":"The sons of Gomer were Ashkenaz, Riphath, and Togarmah. "}],[{"type":"prose","content":"The sons of Javan were Elishah, Tarshish, the Kittim, and the Dodanim. "}],[{"type":"prose","content":"From these the coastlands of the nations were separated into their lands, every one according to its language, according to their families, by their nations."}],[{"type":"prose","content":"The sons of Ham were Cush, Mizraim, Put, and Canaan. "}],[{"type":"prose","content":"The sons of Cush were Seba, Havilah, Sabtah, Raamah, and Sabteca. The sons of Raamah were Sheba and Dedan."}],[{"type":"prose","content":"Cush was the father of Nimrod; he began to be a valiant warrior on the earth. "}],[{"type":"prose","content":"He was a mighty hunter before the . (That is why it is said, “Like Nimrod, a mighty hunter before the .”) "}],[{"type":"prose","content":"The primary regions of his kingdom were Babel, Erech, Akkad, and Calneh in the land of Shinar. "}],[{"type":"prose","content":"From that land he went to Assyria, where he built Nineveh, Rehoboth Ir, Calah, "}],[{"type":"prose","content":"and Resen, which is between Nineveh and the great city Calah."}],[{"type":"prose","content":"Mizraim was the father of the Ludites, Anamites, Lehabites, Naphtuhites, "}],[{"type":"prose","content":"Pathrusites, Casluhites (from whom the Philistines came), and Caphtorites."}],[{"type":"prose","content":"Canaan was the father of Sidon his firstborn, Heth, "}],[{"type":"prose","content":"the Jebusites, Amorites, Girgashites, "}],[{"type":"prose","content":"Hivites, Arkites, Sinites, "}],[{"type":"prose","content":"Arvadites, Zemarites, and Hamathites. Eventually the families of the Canaanites were scattered "}],[{"type":"prose","content":"and the borders of Canaan extended from Sidon all the way to Gerar as far as Gaza, and all the way to Sodom, Gomorrah, Admah, and Zeboyim, as far as Lasha. "}],[{"type":"prose","content":"These are the sons of Ham, according to their families, according to their languages, by their lands, and by their nations."}],[{"type":"prose","content":"And sons were also born to Shem (the older brother of Japheth), the father of all the sons of Eber."}],[{"type":"prose","content":"The sons of Shem were Elam, Asshur, Arphaxad, Lud, and Aram. "}],[{"type":"prose","content":"The sons of Aram were Uz, Hul, Gether, and Mash. "}],[{"type":"prose","content":"Arphaxad was the father of Shelah, and Shelah was the father of Eber. "}],[{"type":"prose","content":"Two sons were born to Eber: One was named Peleg because in his days the earth was divided, and his brother’s name was Joktan. "}],[{"type":"prose","content":"Joktan was the father of Almodad, Sheleph, Hazarmaveth, Jerah, "}],[{"type":"prose","content":"Hadoram, Uzal, Diklah, "}],[{"type":"prose","content":"Obal, Abimael, Sheba, "}],[{"type":"prose","content":"Ophir, Havilah, and Jobab. All these were sons of Joktan. "}],[{"type":"prose","content":"Their dwelling place was from Mesha all the way to Sephar in the eastern hills. "}],[{"type":"prose","content":"These are the sons of Shem according to their families, according to their languages, by their lands, and according to their nations."}],[{"type":"prose","content":"These are the families of the sons of Noah, according to their genealogies, by their nations, and from these the nations spread over the earth after the flood."}]]