[{"num":10,"verse":"These be the generations of the sons of Noe; Shem, Ham, and Japheth (These be the descendants of Noah’s sons, Shem, Ham, and Japheth). And sons were born to them after the great flood."},{"num":2,"verse":"The sons of Japheth were Gomer, and Magog, and Madai, and Javan, and Tubal, and Meshech, and Tiras."},{"num":3,"verse":"Forsooth the sons of Gomer were Ashkenaz, and Riphath, and Togarmah."},{"num":4,"verse":"Forsooth the sons of Javan were Elishah, and Tarshish, (and) Kittim, and Dodanim;"},{"num":5,"verse":"of these sons the isles of the heathen men were parted in their countries, each by his language, and families, in his nations. (from these sons the heathen on the islands separated into their own countries, with their own languages, and families, and nations.)"},{"num":6,"verse":"Soothly the sons of Ham were Cush, and Mizraim, and Phut, and Canaan."},{"num":7,"verse":"Forsooth the sons of Cush were Seba, and Havilah, and Sabtah, and Raamah, and Sabtechah. The sons of Raamah were Sheba, and Dedan."},{"num":8,"verse":"Forsooth Cush begat Nimrod; (and) he began to be mighty in [the] earth,"},{"num":9,"verse":"and he was a strong hunter, or oppressor, of men before the Lord; of him a proverb went out, (saying,) As Nimrod, a strong hunter before the Lord. (and he was a strong hunter before the Lord; and a proverb went out about him, saying, Be ye like Nimrod, a strong hunter before the Lord.)"},{"num":10,"verse":"Soothly the beginning of his realm was Babylon, and Erech, and Accad, and Calneh, in the land of Shinar."},{"num":11,"verse":"Asshur went out of that land, and builded Nineveh, and [the] streets of the city, and Calah, (And he went out of that land to Assyria, and he built the cities of Nineveh, and Rehoboth Ir, and Calah,)"},{"num":12,"verse":"and Resen betwixt Nineveh and Calah; this is a great city."},{"num":13,"verse":"And soothly Mizraim begat Ludim, and Anamim, and Lehabim, and Naphtuhim, (And Mizraim begat the Lydians, and Anamites, and Lehabites, and Naphtuhites,)"},{"num":14,"verse":"and Pathrusim, and Casluhim; of which the Philistines and Caphtorim came forth. (and Pathrusites, and Casluhites, and the Caphtorites, from whom came forth the Philistines.)"},{"num":15,"verse":"Forsooth Canaan engendered Sidon, his first engendered son, (and) Heth, (And Canaan begat Sidon, his first-born son, and the Hittites,)"},{"num":16,"verse":"and Jebusites, and Amorites, Girgashites,"},{"num":17,"verse":"(and) Hivites, and Arkites, (and) Sinites,"},{"num":18,"verse":"and Arvadites, (and) Zemarites, and Hamathites; and [the] peoples of (the) Canaanites were sown abroad by these men."},{"num":19,"verse":"And the terms of Canaan were made to men coming from Sidon to Gerar, till to Gaza (And Canaan’s borders went from Sidon to Gerar, and unto Gaza), (and then) till thou enter into Sodom, and Gomorrah, and Admah, and Zeboiim, till to Lasha."},{"num":20,"verse":"These were the sons of Ham, in their kindreds, and languages, and generations, and lands, and folks (and nations)."},{"num":21,"verse":"Also of Shem were born the fathers of all the sons of Eber, and Japheth was the more, or elder, brother (of Shem) [and Shem was the elder brother of Japheth]. (And of Shem were born the fathers of all the sons of Eber, and Shem was the elder brother of Japheth.)"},{"num":22,"verse":"The sons of Shem were Elam, and Asshur, and Arphaxad, and Lud, and Aram."},{"num":23,"verse":"The sons of Aram were Uz, and Hul, and Gether, and Mash."},{"num":24,"verse":"And soothly Arphaxad begat Salah, of whom Eber was born."},{"num":25,"verse":"And two sons were born to Eber, the name to the one son was Peleg, for the land was parted in his days (for the peoples of the world were divided in his time); and the name of his brother was Joktan."},{"num":26,"verse":"And that Joktan begat Almodad, and Sheleph, and Hazarmaveth, (and) Jerah,"},{"num":27,"verse":"and Hadoram, and Uzal, and Diklah,"},{"num":28,"verse":"and Obal, and Abimael, (and) Sheba,"},{"num":29,"verse":"and Ophir, and Havilah, and Jobab; all these were the sons of Joktan."},{"num":30,"verse":"And the habitation of them was made from Mesha, as men goeth till to Sephar, an hill of the east. (And they lived in the hill country of the east, from Mesha unto Sephar.)"},{"num":31,"verse":"These be the sons of Shem, by kindreds, and languages, and countries, in their folks (and nations)."},{"num":32,"verse":"These be the families of Noe, by their peoples, and nations; [the] folks in [the] earth were parted of these after the great flood. (These be the families of Noah, by their peoples, and their nations; all the nations on the earth came from these three men/came from these people after the great flood.)"}]