[{"header":"The Ark of the Covenant Is Brought to Jerusalem"},{"num":6,"verse":"David again gathered all the chosen men of Israel. There were 30,000 of them. "},{"num":2,"verse":"Then David and all his people went to Baalah in Judah. They took the Ark of the Covenant of God from Baalah in Judah and moved it to Jerusalem. The Ark of the Covenant is called by the Name, the name of the Lord of heaven’s armies. His throne is between the gold creatures with wings that are on the Ark of the Covenant. "},{"num":3,"verse":"David’s men put the Ark of the Covenant of God on a new cart. Then they brought the Ark of the Covenant out of Abinadab’s house on the hill. Uzzah and Ahio, sons of Abinadab, led the new cart. "},{"num":4,"verse":"This cart had the Ark of the Covenant of God on it. Ahio was walking in front of it. "},{"num":5,"verse":"David and all the Israelites were playing all kinds of musical instruments before the Lord. They were made of pine wood. There were lyres, harps, tambourines, rattles and cymbals."},{"num":6,"verse":"When David’s men came to the threshing floor of Nacon, the oxen stumbled. The Ark of the Covenant of God began to fall off the cart. So Uzzah reached out and took hold of it. "},{"num":7,"verse":"The Lord was angry with Uzzah and killed him. Uzzah had not honored God when he touched the Ark of the Covenant. So Uzzah died there beside it. "},{"num":8,"verse":"David was angry because the Lord had killed Uzzah. So that place is called The Punishment of Uzzah even today."},{"num":9,"verse":"David was afraid of the Lord that day. He said, “How can the Ark of the Covenant of the Lord come to me now?” "},{"num":10,"verse":"So David would not move the Ark of the Covenant of the Lord to be with him in Jerusalem. Instead, he took it to the house of Obed-Edom, a man from Gath. "},{"num":11,"verse":"The Ark of the Covenant of the Lord stayed in Obed-Edom’s house for three months. And the Lord blessed Obed-Edom and all his family."},{"num":12,"verse":"The people told David, “The Lord has blessed the family of Obed-Edom. And all his things are blessed. This is because the Ark of the Covenant of God is there.” So David went and brought it up from Obed-Edom’s house to Jerusalem with joy. "},{"num":13,"verse":"When the men carrying the Ark of the Covenant of the Lord had walked six steps, David sacrificed a bull and a fat calf. "},{"num":14,"verse":"Then David danced with all his might before the Lord. He had on a holy linen vest. "},{"num":15,"verse":"David and all the Israelites shouted with joy. They blew the trumpets as they brought the Ark of the Covenant of the Lord to the city."},{"num":16,"verse":"Saul’s daughter Michal was looking out the window. She watched as the Ark of the Covenant of the Lord came into the city. When she saw David jumping and dancing before the Lord, she hated him."},{"num":17,"verse":"David put up a tent for the Ark of the Covenant. Then the Israelites put it in its place inside the tent. David offered whole burnt offerings and fellowship offerings before the Lord. "},{"num":18,"verse":"When David finished offering the whole burnt offerings and the fellowship offerings, he blessed the people in the name of the Lord of heaven’s armies. "},{"num":19,"verse":"David gave a loaf of bread, a cake of dates and a cake of raisins to everyone. He gave them to all the Israelites, both men and women. Then all the people went home."},{"num":20,"verse":"David went back to bless the people in his home. But Saul’s daughter Michal came out to meet him. She said, “The king of Israel did not honor himself today! You took off your clothes in front of the servant girls of your officers. You were like a foolish man who takes off his clothes without shame!”"},{"num":21,"verse":"Then David said to Michal, “I did it before the Lord. The Lord chose me, not your father. He didn’t choose anyone from Saul’s family. The Lord appointed me to be leader of his people, the Israelites. So I will celebrate in front of the Lord. "},{"num":22,"verse":"Maybe I will lose even more honor. And you may think little of me. But the girls you talk about will honor me!”"},{"num":23,"verse":"And Saul’s daughter Michal had no children to the day she died."}]