[{"header":"The Special Box Is Brought to Jerusalem"},{"num":6,"verse":"Again David gathered all the chosen men of Israel. There were 30,000. "},{"num":2,"verse":"He got up and went with all the people who were with him to Baale-judah to bring from there the special box of God. It is called by the name of the Lord of All Who sits on His throne above the cherubim. "},{"num":3,"verse":"They carried the special box of God on a new wagon, and brought it out of the family of Abinadab which was on the hill. Abinadab’s sons Uzzah and Ahio were leading the new wagon. "},{"num":4,"verse":"They brought it with the special box of God from the family of Abinadab, which was on the hill. Ahio was walking in front of the special box. "},{"num":5,"verse":"And David and all those of the family of Israel sang and danced before the Lord with all their strength. They played songs with harps and timbrels."},{"num":6,"verse":"But the cattle pulling the wagon almost made the special box of God fall when they came to the grain-floor of Nacon. So Uzzah put out his hand and took hold of the special box so it would not fall. "},{"num":7,"verse":"The anger of the Lord burned against Uzzah. God killed him there for his mistake. And he died there by the special box of God. "},{"num":8,"verse":"David became angry because the Lord had gone against Uzzah. So that place is called Perez-uzzah to this day. "},{"num":9,"verse":"David was afraid of the Lord that day, and he said, “How can the special box of the Lord come to me?” "},{"num":10,"verse":"So David was not willing to move the special box of the Lord into the city of David. But he took it aside to the house of Obed-edom the Gittite. "},{"num":11,"verse":"The special box of the Lord stayed in the house of Obed-edom the Gittite for three months. And the Lord brought good to Obed-edom and all of his family."},{"num":12,"verse":"Now it was told to King David, “The Lord has brought good to the house of Obed-edom and all that belongs to him, because of the special box of God.” So David went and brought the special box of God from Obed-edom’s family into the city of David with joy. "},{"num":13,"verse":"When the men who carried the special box of the Lord had gone six steps, David killed and gave to the Lord a bull and a fat calf. "},{"num":14,"verse":"He was dancing before the Lord with all his strength. And he was wearing a linen vest. "},{"num":15,"verse":"So David and all those of the family of Israel were bringing the special box of the Lord with a loud voice and the sound of the horn. "},{"num":16,"verse":"As the special box of the Lord came into the city of David, Saul’s daughter Michal looked out of the window. She saw King David jumping and dancing before the Lord, and she hated him in her heart. "},{"num":17,"verse":"They brought in the special box of the Lord and put it in its place inside the tent David had set up for it. And David gave burnt gifts and peace gifts to the Lord. "},{"num":18,"verse":"When he had finished giving the burnt gifts and peace gifts, David prayed that good would come to the people in the name of the Lord of All. "},{"num":19,"verse":"Then he gave a loaf of bread, a loaf of dates and a loaf of dried grapes to each man and woman of all the people of Israel. And all the people went home."},{"num":20,"verse":"David returned to pray that good would come to his family. But Saul’s daughter Michal came out to meet him, and said, “How the king of Israel honored himself today! He took his clothes off today so that his servants’ young women would see him. He acted like one of the foolish ones taking his clothes off without shame!” "},{"num":21,"verse":"So David said to Michal, “It was before the Lord. He chose me over your father and all his family, and made me ruler over the people of the Lord, over Israel. So I will act with joy before the Lord. "},{"num":22,"verse":"I will be honored less than this. I will be without pride in my own eyes. But the young women you have spoken about will honor me.” "},{"num":23,"verse":"And Saul’s daughter Michal had no child to the day of her death."}]