[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The fire shall ever be burning.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This fire, which first came down from heaven (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), was to be continually fed with the fuel especially provided by the congregation, and with the daily burnt offerings. During the second Temple, this perpetual fire consisted ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "of ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "three parts or separate piles of wood on the same altar: on the largest one the daily sacrifice was burnt; the second, which was called the pile of incense, supplied the fire for the censers to burn the morning and evening incense; and the third was the perpetual fire from which the other two portions were fed. It never was quenched till the destruction of the Temple by Nebuchadnezzar. Indeed, we are positively assured that the pious priests who were carried captives into Persia concealed it in a pit, where it remained till the time of Nehemiah, when it was restored to the altar (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Maccabees 1:19-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The authorities in the time of Christ, however, assure us that the perpetual fire was one of the five things wanting in the second Temple.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:8-13 The daily sacrifice of a lamb is chiefly referred to. The priest must take care of the fire upon the altar. The first fire upon the altar came from heaven, ch. 9:24; by keeping that up continually, all their sacrifices might be said to be consumed with the fire from heaven, in token of God's acceptance. Thus should the fire of our holy affections, the exercise of our faith and love, of prayer and praise, be without ceasing.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fire shall ever be burning - This was a symbol of the never-ceasing worship which Yahweh required of His people. It was essentially connected with their acts of sacrifice. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. Command Aaron and his sons, saying, This … law of the burnt offering—In this passage Moses received instructions to be delivered to the priests respecting their official duties, and first the burnt offering—Hebrew, \"a sacrifice, which went up in smoke.\" The daily service consisted of two lambs, one offered in the morning at sunrise, the other in the evening, when the day began to decline. Both of them were consumed on the altar by means of a slow fire, before which the pieces of the sacrifice were so placed that they fed it all night. At all events, the observance of this daily sacrifice on the altar of burnt offering was a daily expression of national repentance and faith. The fire that consumed these sacrifices had been kindled from heaven at the consecration of the tabernacle [Le 9:24], and to keep it from being extinguished and the sacrifices from being burned with common fire, strict injunctions are here given respecting not only the removal of the ashes [Le 6:10, 11], but the approaching near to the fireplace in garments that were not officially \"holy.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fire shall ever be burning upon the altar,.... This was what first fell from heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and which in after ages was maintained by constant fuel put unto it, there being every day burnt offerings upon it; which was an emblem of the love of Christ to his people, which is ever in a flame and burning, and can never be quenched by the many waters of their sins and iniquities; nor by all the sufferings he underwent to atone for them; nor by all the meanness and afflictions they are attended with; his love is fervent towards them, and always the same: and also of their love to him, which is unquenchable by the persecutions of men, by afflictions by the hand of God, by divine desertions, by Satan's temptations, or their own corruptions: it likewise may be an emblem of the graces of the Spirit of God in the hearts of his people, which have both light and heat in them; and though they are sometimes very low as to exercise, yet are in a wonderful manner preserved amidst great oppositions made unto them from within and from without; and may also be a symbol of the word of God, sometimes compared to fire for its light and heat, and may be signified by the fire on the altar for its perpetuity, which continues and abides, notwithstanding the attempts of men and devils to get it out of the world; and though the ministers of it die, that lives, and has been preserved in the worst of times, and will burn most clearly, and shine most brightly in the end of the world. This perpetual fire may also point at the prayers of saints, the fervency of them, and their perseverance in them; or rather to the efficacy and acceptance of the sacrifice of Christ, which always continues; nor may it be amiss applied to the afflictions of God's people, which constantly attend them in this world, and they must expect to have while in it; and even to the wrath of God on wicked men to all eternity, and which is the fire that cannot be quenched: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it shall never go out; as it is highly probable it never did, until the destruction of the temple by Nebuchadnezzar; though the author of second Maccabees states that:\"For when our fathers were led into Persia, the priests that were then devout took the fire of the altar privily, and hid it in an hollow place of a pit without water, where they kept it sure, so that the place was unknown to all men.'' 2 Maccabees 1:19)pretends that some devout priests, who were carried captives into Persia, hid the fire of the altar privily in the hollow of a pit, where was no water, and in which it was kept sure and unknown to men, and was found and restored in the times of Nehemiah,\"20 Now after many years, when it pleased God, Neemias, being sent from the king of Persia, did send of the posterity of those priests that had hid it to the fire: but when they told us they found no fire, but thick water; 21 Then commanded he them to draw it up, and to bring it; and when the sacrifices were laid on, Neemias commanded the priests to sprinkle the wood and the things laid thereupon with the water. 22 When this was done, and the time came that the sun shone, which afore was hid in the cloud, there was a great fire kindled, so that every man marvelled.'' (2 Maccabees 1)but this is contrary to what the Jews always assert (b), that the fire from heaven was wanting in the second temple; and yet from the account Josephus (c) gives of a festival called \"Xylophoria\", or the feast of the wood carrying, it seems to have been then in being, and great care was taken to preserve it that it might not go out; for, he says, at that feast it is a custom for all to bring wood to the altar, that so there might never be wanting fuel for the fire, for it always remained unextinguished: as to, what some have observed out of Diodorus Siculus (d), that Antiochus Epiphanes, when he went into the temple, quenched this fire, it appears to be a mistake; for Diodorus does not say that he put out the fire of the altar, but that he extinguished the immortal lamp, as it was called by them (the Jews), which was always burning in the temple; by which he plainly means the lamp in the candlestick, and perhaps what the Jews call the western lamp, which was always burning, and was the middle lamp bending to the west, and to which the rest bent: the Heathens in many places imitated this perpetual fire: the Brahmans among the Indians speak of fire falling from heaven, kept by them on everlasting hearths, or in fire pans (e), for that purpose: the Persians had their perpetual fire, having a great opinion of that element: in the march of Darius against Alexander, it is observed by the historian (f), that the fire which the Persians call sacred and eternal was placed on altars of silver, and he is said to adjure his soldiers by the gods of their country, and by the eternal fire on the altars, &c. to rescue the Persian name and nation from the last degree of reproach (g): the Grecians have many traces of this continual fire on the altar among them: at Mantinia, as Pausanias (h) relates, was a temple of Ceres and Proserpina, where a fire was kindled, and great care taken that it might not be extinguished; and in the temple of Pan, a fire burned which was never quenched: and the same writer says (i), with the Eleans was an altar which had fire continually burning on it night and day: and Aelianus (k) makes mention of an altar of Venus at Eryce in Sicily, which burnt night and day; and of which he says many things wonderful and fabulous: and it is well known that the Romans had their goddess Vesta, whom Velleius Paterculus (l) calls the keeper of the perpetual fires; and there were certain virgins, called the \"vestal\" virgins, whose business it was to take care that the fire never went out; and is by Virgil (m) called the eternal fire: and Vesta itself is thought by some learned men to be the same with \"Esh-jah\", the fire of Jehovah: now these were all satanical imitations of the perpetual fire on the altar of God. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) T. Hieros. Taaniot, fol. 65. 1. T. Bab. Yoma, fol. 21. 2.((c) De Bello Jud. l. 2. c. 17. sect. 6. (d) Eclog. 1. ex l. 34. p. 902. (e) Ammian. Marcellin. l. 23. (f) Curt. Hist. l. 3. c. 3.((g) Curt. Hist. l. 4. c. 14. (h) Arcadica sive, l. 8. p. 469, 516. (i) Eliac. 1. sive, l. 5. p. 316. (k) Hist. Animal. l. 10. c. 50. (l) Hist. l. 2. in fine. (m) \"Vos aeterni igneis\", &c. Aeneid. l. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) T. Hieros. Taaniot, fol. 65. 1. T. Bab. Yoma, fol. 21. 2.((c) De Bello Jud. l. 2. c. 17. sect. 6. (d) Eclog. 1. ex l. 34. p. 902. (e) Ammian. Marcellin. l. 23. (f) Curt. Hist. l. 3. c. 3.((g) Curt. Hist. l. 4. c. 14. (h) Arcadica sive, l. 8. p. 469, 516. (i) Eliac. 1. sive, l. 5. p. 316. (k) Hist. Animal. l. 10. c. 50. (l) Hist. l. 2. in fine. (m) \"Vos aeterni igneis\", &c. Aeneid. l. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The fire shall ever be burning upon the altar; it shall never go out.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Fire was to be kept constantly burning upon the altar without going out, not in order that the heavenly fire, which proceeded from Jehovah when Aaron and his sons first entered upon the service of the altar after their consecration, and consumed the burnt-offerings and peace-offerings, might never be extinguished (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but that the burnt-offering might never go out, because this was the divinely appointed symbol and visible sign of the uninterrupted worship of Jehovah, which the covenant nation could never suspend either day or night, without being unfaithful to its calling. For the same reason other nations also kept perpetual fire burning upon the altars of their principal gods. (For proofs, see Rosenmller and Knobel ad h. l.) ",
        "children": []
      }
    ]
  }
]