[{"num":32,"verse":"In the twelfth year, in the twelfth month on the first day, the word of the Lord came to me: "},{"num":2,"verse":"‘Son of man, take up a lament concerning Pharaoh king of Egypt and say to him:"},{"num":3,"verse":"‘“This is what the Sovereign Lord says:"},{"num":11,"verse":"‘“For this is what the Sovereign Lord says:"},{"num":16,"verse":"‘This is the lament they will chant for her. The daughters of the nations will chant it; for Egypt and all her hordes they will chant it, declares the Sovereign Lord.’"},{"num":17,"verse":"In the twelfth year, on the fifteenth day of the month, the word of the Lord came to me: "},{"num":18,"verse":"‘Son of man, wail for the hordes of Egypt and consign to the earth below both her and the daughters of mighty nations, along with those who go down to the pit. "},{"num":19,"verse":"Say to them, “Are you more favoured than others? Go down and be laid among the uncircumcised.” "},{"num":20,"verse":"They will fall among those killed by the sword. The sword is drawn; let her be dragged off with all her hordes. "},{"num":21,"verse":"From within the realm of the dead the mighty leaders will say of Egypt and her allies, “They have come down and they lie with the uncircumcised, with those killed by the sword.”"},{"num":22,"verse":"‘Assyria is there with her whole army; she is surrounded by the graves of all her slain, all who have fallen by the sword. "},{"num":23,"verse":"Their graves are in the depths of the pit and her army lies around her grave. All who had spread terror in the land of the living are slain, fallen by the sword."},{"num":24,"verse":"‘Elam is there, with all her hordes around her grave. All of them are slain, fallen by the sword. All who had spread terror in the land of the living went down uncircumcised to the earth below. They bear their shame with those who go down to the pit. "},{"num":25,"verse":"A bed is made for her among the slain, with all her hordes around her grave. All of them are uncircumcised, killed by the sword. Because their terror had spread in the land of the living, they bear their shame with those who go down to the pit; they are laid among the slain."},{"num":26,"verse":"‘Meshek and Tubal are there, with all their hordes around their graves. All of them are uncircumcised, killed by the sword because they spread their terror in the land of the living. "},{"num":27,"verse":"But they do not lie with the fallen warriors of old, who went down to the realm of the dead with their weapons of war – their swords placed under their heads and their shields resting on their bones – though these warriors also had terrorised the land of the living."},{"num":28,"verse":"‘You too, Pharaoh, will be broken and will lie among the uncircumcised, with those killed by the sword."},{"num":29,"verse":"‘Edom is there, her kings and all her princes; despite their power, they are laid with those killed by the sword. They lie with the uncircumcised, with those who go down to the pit."},{"num":30,"verse":"‘All the princes of the north and all the Sidonians are there; they went down with the slain in disgrace despite the terror caused by their power. They lie uncircumcised with those killed by the sword and bear their shame with those who go down to the pit."},{"num":31,"verse":"‘Pharaoh – he and all his army – will see them and he will be consoled for all his hordes that were killed by the sword, declares the Sovereign Lord. "},{"num":32,"verse":"Although I allowed him to spread terror in the land of the living, Pharaoh and all his hordes will be laid among the uncircumcised, with those killed by the sword, declares the Sovereign Lord.’"}]