[[],[{"type":"header","content":"Lamentation over Pharaoh and Egypt"},{"type":"prose","content":"In the twelfth year, in the twelfth month, on the first day of the month, the word of the LORD came to me: "}],[{"type":"prose","content":"Mortal, raise a lamentation over Pharaoh king of Egypt, and say to him:"},{"type":"poetry","content":"You consider yourself a lion among the nations,"},{"type":"poetry","content":"you thrash about in your streams,"}],[{"type":"poetry","content":"Thus says the Lord :"}],[{"type":"poetry","content":"I will throw you on the ground,"},{"type":"poetry","content":"and will cause all the birds of the air to settle on you,"}],[{"type":"poetry","content":"I will strew your flesh on the mountains,"}],[{"type":"poetry","content":"I will drench the land with your flowing blood"}],[{"type":"poetry","content":"When I blot you out, I will cover the heavens,"},{"type":"poetry","content":"I will cover the sun with a cloud,"}],[{"type":"poetry","content":"All the shining lights of the heavens"}],[{"type":"poetry","content":"I will trouble the hearts of many peoples,"}],[{"type":"poetry","content":"I will make many peoples appalled at you;"},{"type":"poetry","content":"When I brandish my sword before them,"},{"type":"poetry","content":"for their lives, each one of them,"}],[{"type":"poetry","content":"For thus says the Lord :"},{"type":"poetry","content":"The sword of the king of Babylon shall come against you."}],[{"type":"poetry","content":"I will cause your hordes to fall"},{"type":"poetry","content":"They shall bring to ruin the pride of Egypt,"}],[{"type":"poetry","content":"I will destroy all its livestock"},{"type":"poetry","content":"and no human foot shall trouble them any more,"}],[{"type":"poetry","content":"Then I will make their waters clear,"}],[{"type":"poetry","content":"When I make the land of Egypt desolate"},{"type":"poetry","content":"when I strike down all who live in it,"}],[{"type":"poetry","content":"This is a lamentation; it shall be chanted."},{"type":"poetry","content":"Over Egypt and all its hordes they shall chant it,"}],[{"type":"header","content":"Dirge over Egypt"},{"type":"prose","content":"In the twelfth year, in the first month, on the fifteenth day of the month, the word of the LORD came to me:"}],[{"type":"poetry","content":"Mortal, wail over the hordes of Egypt,"},{"type":"poetry","content":"with Egypt and the daughters of majestic nations,"}],[{"type":"poetry","content":"“Whom do you surpass in beauty?"}],[{"type":"prose","content":"They shall fall among those who are killed by the sword. Egypt has been handed over to the sword; carry away both it and its hordes. "}],[{"type":"prose","content":"The mighty chiefs shall speak of them, with their helpers, out of the midst of Sheol: “They have come down, they lie still, the uncircumcised, killed by the sword.”"}],[{"type":"prose","content":"Assyria is there, and all its company, their graves all around it, all of them killed, fallen by the sword. "}],[{"type":"prose","content":"Their graves are set in the uttermost parts of the Pit. Its company is all around its grave, all of them killed, fallen by the sword, who spread terror in the land of the living."}],[{"type":"prose","content":"Elam is there, and all its hordes around its grave; all of them killed, fallen by the sword, who went down uncircumcised into the world below, who spread terror in the land of the living. They bear their shame with those who go down to the Pit. "}],[{"type":"prose","content":"They have made Elam a bed among the slain with all its hordes, their graves all around it, all of them uncircumcised, killed by the sword; for terror of them was spread in the land of the living, and they bear their shame with those who go down to the Pit; they are placed among the slain."}],[{"type":"prose","content":"Meshech and Tubal are there, and all their multitude, their graves all around them, all of them uncircumcised, killed by the sword; for they spread terror in the land of the living. "}],[{"type":"prose","content":"And they do not lie with the fallen warriors of long ago who went down to Sheol with their weapons of war, whose swords were laid under their heads, and whose shields are upon their bones; for the terror of the warriors was in the land of the living. "}],[{"type":"prose","content":"So you shall be broken and lie among the uncircumcised, with those who are killed by the sword."}],[{"type":"prose","content":"Edom is there, its kings and all its princes, who for all their might are laid with those who are killed by the sword; they lie with the uncircumcised, with those who go down to the Pit."}],[{"type":"prose","content":"The princes of the north are there, all of them, and all the Sidonians, who have gone down in shame with the slain, for all the terror that they caused by their might; they lie uncircumcised with those who are killed by the sword, and bear their shame with those who go down to the Pit."}],[{"type":"prose","content":"When Pharaoh sees them, he will be consoled for all his hordes—Pharaoh and all his army, killed by the sword, says the Lord GOD. "}],[{"type":"prose","content":"For he spread terror in the land of the living; therefore he shall be laid to rest among the uncircumcised, with those who are slain by the sword—Pharaoh and all his multitude, says the Lord GOD."}]]