[{"num":12,"verse":"But just when Rehoboam was at the height of his popularity and power he abandoned the Lord, and the people followed him in this sin. "},{"num":2,"verse":"As a result, King Shishak of Egypt attacked Jerusalem in the fifth year of King Rehoboam’s reign "},{"num":3,"verse":"with 1,200 chariots, 60,000 cavalrymen and an unnumbered host of infantrymen—Egyptians, Libyans, Sukkiim, and Ethiopians. "},{"num":4,"verse":"He quickly conquered Judah’s fortified cities and soon arrived at Jerusalem."},{"num":5,"verse":"The prophet Shemaiah now met with Rehoboam and the Judean leaders from every part of the nation (they had fled to Jerusalem for safety) and told them, “The Lord says, ‘You have forsaken me, so I have forsaken you and abandoned you to Shishak.’”"},{"num":6,"verse":"Then the king and the leaders of Israel confessed their sins and exclaimed, “The Lord is right in doing this to us!”"},{"num":7,"verse":"And when the Lord saw them humble themselves, he sent Shemaiah to tell them, “Because you have humbled yourselves, I will not completely destroy you; some will escape. I will not use Shishak to pour out my anger upon Jerusalem. "},{"num":8,"verse":"But you must pay annual tribute to him. Then you will realize how much better it is to serve me than to serve him!”"},{"num":9,"verse":"So King Shishak of Egypt conquered Jerusalem and took away all the treasures of the Temple and of the palace, also all of Solomon’s gold shields. "},{"num":10,"verse":"King Rehoboam replaced them with bronze shields and committed them to the care of the captain of his bodyguard. "},{"num":11,"verse":"Whenever the king went to the Temple, the guards would carry them and afterwards return them to the armory. "},{"num":12,"verse":"When the king humbled himself, the Lord’s anger was turned aside and he didn’t send total destruction; in fact, even after Shishak’s invasion, the economy of Judah remained strong."},{"num":13,"verse":"King Rehoboam reigned seventeen years in Jerusalem, the city God had chosen as his residence after considering all the other cities of Israel. He had become king at the age of forty-one, and his mother’s name was Naamah the Ammonitess. "},{"num":14,"verse":"But he was an evil king, for he never did decide really to please the Lord. "},{"num":15,"verse":"The complete biography of Rehoboam is recorded in the histories written by Shemaiah the prophet and by Iddo the seer and in The Genealogical Register."},{"num":16,"verse":"When Rehoboam died he was buried in Jerusalem, and his son Abijah became the new king."}]