[{"num":1,"verse":"Remind them to submit to rulers and authorities. They should be obedient and ready to do every good thing."},{"num":2,"verse":"They shouldn’t speak disrespectfully about anyone, but they should be peaceful, kind, and show complete courtesy toward everyone."},{"num":3,"verse":"We were once foolish, disobedient, deceived, and slaves to our desires and various pleasures too. We were spending our lives in evil behavior and jealousy. We were disgusting, and we hated other people."},{"num":4,"verse":"But “when God our savior’s kindness and love appeared,"},{"num":5,"verse":"he saved us because of his mercy, not because of righteous things we had done. He did it through the washing of new birth and the renewing by the Holy Spirit,"},{"num":6,"verse":"which God poured out upon us generously through Jesus Christ our savior."},{"num":7,"verse":"So, since we have been made righteous by his grace, we can inherit the hope for eternal life.”"},{"num":8,"verse":"This saying is reliable. And I want you to insist on these things, so that those who have come to believe in God might give careful attention to doing good. These things are good and useful for everyone."},{"header":"Final instructions and greetings"},{"num":9,"verse":"Avoid stupid controversies, genealogies, and fights about the Law, because they are useless and worthless."},{"num":10,"verse":"After a first and second warning, have nothing more to do with a person who causes conflict,"},{"num":11,"verse":"because you know that someone like this is twisted and sinful—so they condemn themselves."},{"num":12,"verse":"When I send Artemas or Tychicus to you, try to come to me in Nicopolis, because I’ve decided to spend the winter there."},{"num":13,"verse":"Help Zenas the lawyer and Apollos on their journey with enthusiasm so that they won’t need anything."},{"num":14,"verse":"But our people should also learn to devote themselves to doing good in order to meet pressing needs so they aren’t unproductive."},{"num":15,"verse":"Everyone with me greets you; greet those who love us faithfully."}]