[[],[{"type":"prose","content":"Remember, O Jehovah, what hath befallen us, Look attentively, and see our reproach."}],[{"type":"prose","content":"Our inheritance hath been turned to strangers, Our houses to foreigners."}],[{"type":"prose","content":"Orphans we have been -- without a father, our mothers [are] as widows."}],[{"type":"prose","content":"Our water for money we have drunk, Our wood for a price doth come."}],[{"type":"prose","content":"For our neck we have been pursued, We have laboured -- there hath been no rest for us."}],[{"type":"prose","content":"[To] Egypt we have given a hand, [To] Asshur, to be satisfied with bread."}],[{"type":"prose","content":"Our fathers have sinned -- they are not, We their iniquities have borne."}],[{"type":"prose","content":"Servants have ruled over us, A deliverer there is none from their hand."}],[{"type":"prose","content":"With our lives we bring in our bread, Because of the sword of the wilderness."}],[{"type":"prose","content":"Our skin as an oven hath been burning, Because of the raging of the famine."}],[{"type":"prose","content":"Wives in Zion they have humbled, Virgins -- in cities of Judah."}],[{"type":"prose","content":"Princes by their hand have been hanged, The faces of elders have not been honoured."}],[{"type":"prose","content":"Young men to grind they have taken, And youths with wood have stumbled."}],[{"type":"prose","content":"The aged from the gate have ceased, Young men from their song."}],[{"type":"prose","content":"Ceased hath the joy of our heart, Turned to mourning hath been our dancing."}],[{"type":"prose","content":"Fallen hath the crown [from] our head, Wo [is] now to us, for we have sinned."}],[{"type":"prose","content":"For this hath our heart been sick, For these have our eyes been dim."}],[{"type":"prose","content":"For the mount of Zion -- that is desolate, Foxes have gone up on it."}],[{"type":"prose","content":"Thou, O Jehovah, to the age remainest, Thy throne to generation and generation."}],[{"type":"prose","content":"Why for ever dost Thou forget us? Thou forsakest us for length of days!"}],[{"type":"prose","content":"Turn us back, O Jehovah, unto Thee, And we turn back, renew our days as of old."}],[{"type":"prose","content":"For hast Thou utterly rejected us? Thou hast been wroth against us -- exceedingly?"}]]