[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Tabor and Hermon.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Introduced not only as standing roughly for west and east, but for their prominence and importance in the landscape. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall rejoice.—Better, sing for joy.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Shall rejoice.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "sing for joy.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "89:5-14 The more God's works are known, the more they are admired. And to praise the Lord, is to acknowledge him to be such a one that there is none like him. Surely then we should feel and express reverence when we worship God. But how little of this appears in our congregations, and how much cause have we to humble ourselves on this account! That almighty power which smote Egypt, will scatter the enemies of the church, while all who trust in God's mercy will rejoice in his name; for mercy and truth direct all he does. His counsels from eternity, and their consequences to eternity, are all justice and judgment.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The north and the south, thou hast created them - All that there is in the north and in the south - in the northern and the southern sky - the constellations and the stars; and all that there is in the earth - in the regions of cold and of heat - far as they extend in either direction. The word rendered \"north\" here - צפון  tsâphôn - means properly that which is hidden or dark, and was applied to the north, because the ancients regarded it as the seat of gloom and darkness. Hom. Od., ix. 25. The south, on the other hand, was regarded by them as illuminated and made bright by the beams of the sun. The word rendered \"south\" - ימין  yâmı̂yn - means literally the right hand, and was applied to the south because the ancient geographers were supposed to face the east, as now they are supposed to face the north. Compare the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Tabor and Hermon - That is, the west and the east - the former of these mountains being on the western side of Palestine, the other on the eastern, and both of them being objects of beauty and grandeur. The idea is, that God had control of all parts of the universe; that the world in every direction, and in every part, declared his power, and made known his greatness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall rejoice in thy name - Or, do rejoice in thee. That is, They, as it were, exult in thee as their God. They are clothed with beauty, as if full of joy; and they acknowledge that all this comes from thee as the great Creator. Compare Psalm 65:8, Psalm 65:12; Psalm 96:11-12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall rejoice in thy name - Or, do rejoice in thee. That is, They, as it were, exult in thee as their God. They are clothed with beauty, as if full of joy; and they acknowledge that all this comes from thee as the great Creator. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 65:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 65:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 96:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. rejoice in thy name—praise Thy perfections by their very existence.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The north and the south; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the northern and southern parts of the world, yea, even the remotest ends thereof; though not yet known to us, were made and are ruled by thee. Or possibly he may understand the northern and southern empires, and people of the world, who have from time to time annoyed and disturbed the kingdom of David and of Israel, of which this Psalm principally treats, such as Syria, Chaldea, and Assyria; which in Scripture phrase are called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the north",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in reference to that kingdom; and Egypt, and Ethiopia, and Arabia, which are southward from it. These, saith he, are all thy creatures, and none of them can withstand thee, if thou wilt undertake to deliver thy people. But this I only propose with submission. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Tabor and Hermon; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " two eminent mountains in the land of Canaan; Tabor in the west and within Jordan, Hermon on the east and without Jordan; by which he may understand either, first, The western and eastern parts of the world; and so all the four parts of the world are contained in this verse. But this may seem an uncouth and incongruous description of the east and west, partly because the north and the south here mentioned are not those parts of the land of Canaan, but of the world with respect to it; and therefore the east and west should in reason have been so too; and partly because these places were not so situated in Canaan, for Tabor was not in the west part of Canaan, but rather in the middle space between the sea and Jordan; and Hermon was not so much on the east as on the north, being indeed the northern border of the land without Jordan. Or, secondly, The several parts of the land of Canaan, both within Jordan, where Mount Tabor is; and without it, where Hermon lies. And the mountains may be named rather than the valleys, because when their fertility is expressed, the fertility of the valleys is more strongly supposed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall rejoice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. shall be fruitful and prosperous, and so give their inhabitants cause to rejoice. Joy and singing are oft ascribed to mountains and fields, &c., in a poetical strain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In thy name; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in or by thy favour, and the fruits thereof. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The two extreme parts of the world, the northern and southern poles, whether inhabited or uninhabited, are created by the Lord, to answer some purpose or another; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 26:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Tabor and Hermon shall rejoice in thy name; Tabor was a mountain in the western part of Galilee, in the tribe of Zebulun, Joshua 19:12. This mountain, according to Mr. Maundrell (a), stands by itself in the plain of Esdraelon, about 1200 to 1800 yards within the plain; it has a plain area at top, most fertile and delicious, of an oval figure, extended about six hundred yards in breadth, and twice that in length; this area is enclosed with trees on all parts, except towards the south, in which there are in several places cisterns of good water. It is generally thought to be the mountain Christ was transfigured upon before his disciples; and if so, it might then be said to rejoice in his name, when he appeared in so glorious a form upon it; Moses and Elias talking with him, and a voice from the excellent Glory declaring him his beloved Son; and especially the disciples rejoiced in his name there and then, who could say, It is good for us to be here, Matthew 17:1. Hermon was a mountain called by the Sidonians Sirion, and by the Amorites Shenir, Deuteronomy 3:8 and was in the east; and so Mr. Maundrell (b), speaking of Tabor, says, not many miles eastward you see Mount Hermon, at the foot of which is seated Nain, famous for our Lord's raising the widow's son there, Luke 7:11, there was an Hermon near Mount Tabor, thought likely to be here meant; but, be these mountains where and what they may, they were no doubt very high and fruitful ones, clothed with fruitful trees and grass, and covered with flocks; which made the proprietors and all the beholders rejoice in the goodness, wisdom, and power of God: the Targum in the king's Bible gives the four quarters very truly, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Tabor and Hermon shall rejoice in thy name; Tabor was a mountain in the western part of Galilee, in the tribe of Zebulun, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This mountain, according to Mr. Maundrell (a), stands by itself in the plain of Esdraelon, about 1200 to 1800 yards within the plain; it has a plain area at top, most fertile and delicious, of an oval figure, extended about six hundred yards in breadth, and twice that in length; this area is enclosed with trees on all parts, except towards the south, in which there are in several places cisterns of good water. It is generally thought to be the mountain Christ was transfigured upon before his disciples; and if so, it might then be said to rejoice in his name, when he appeared in so glorious a form upon it; Moses and Elias talking with him, and a voice from the excellent Glory declaring him his beloved Son; and especially the disciples rejoiced in his name there and then, who could say, It is good for us to be here, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 17:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hermon was a mountain called by the Sidonians Sirion, and by the Amorites Shenir, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and was in the east; and so Mr. Maundrell (b), speaking of Tabor, says, not many miles eastward you see Mount Hermon, at the foot of which is seated Nain, famous for our Lord's raising the widow's son there, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", there was an Hermon near Mount Tabor, thought likely to be here meant; but, be these mountains where and what they may, they were no doubt very high and fruitful ones, clothed with fruitful trees and grass, and covered with flocks; which made the proprietors and all the beholders rejoice in the goodness, wisdom, and power of God: the Targum in the king's Bible gives the four quarters very truly, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the desert of the north, and the inhabitants of the south, thou hast created; Tabor on the west, and Hermon on the east, praise in thy name.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Journey from Aleppo to Jerusalem, p. 113, 114, Ed. 7. (b) Journey from Aleppo to Jerusalem, p. 115, Ed. 7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Journey from Aleppo to Jerusalem, p. 113, 114, Ed. 7. (b) Journey from Aleppo to Jerusalem, p. 115, Ed. 7. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The north and the south thou hast created them: {k} Tabor and Hermon shall rejoice in thy name.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The north and the south thou hast created them: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Tabor and Hermon shall rejoice in thy name.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Tabor is a mountain west from Jerusalem, and Hermon to the East, so the prophet signifies that all parts and places of the world will obey God's power for the deliverance of his Church.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The north and the south",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The furthest extremities of the world. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 26:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tabor and Hermon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] These mountains are named, not so much to represent the West and East of the land, as because they are the grandest and most conspicuous natural features of Palestine. Tabor is described as a “strange and beautiful mountain,” towering “over the monotonous undulations of the surrounding hills,” and “so thickly studded with trees, as to rise from the plain like a mass of verdure.” In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 46:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is used as an emblem of pre-eminence. Hermon was “the image of unearthly grandeur, which nothing else but perpetual snow can give; especially as seen in the summer, when ‘the firmament around it seems to be on fire.’ ” Stanley, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sinai and Palestine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 350, 404.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall rejoice in thy name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better as R.V., rejoice. Nature is a revelation of its Creator, and rejoices in the fulfilment of its office. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 65:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The north and the south then hast created them: Tabor and Hermon shall rejoice in thy Name.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As in ver. 11 \"heaven and earth\" stand for all creation, the whole  of the material universe, so here the four points of the compass designate the same. Tabor and Herman undoubtedly represent the west and the east. They present themselves to the poet's mind as standing over against each other, one on this side, and the other on that side, of Jordan. Psalm 89:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At the time of the poet the nation of the house of David was threatened with assault from violent foes; and this fact gives occasion for this picture of God's power in the kingdom of nature. He who rules the raging of the sea, also rules the raging of the sea of the peoples, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 65:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". גּאוּת, a proud rising, here of the sea, like גּאוה in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 46:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Instead of בּשׂוע, Hitzig pleasantly enough reads בּשׁוא  equals  בּשׁאו from שׁאה; but שׂוא is also possible so far as language is concerned, either as an infinitive  equals  נשׂוא, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (instead of שׂאת), or as an infinitival noun, like שׂיא, loftiness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with a likewise rejected Nun. The formation of the clause favours our taking it as a verb: when its waves rise, Thou stillest them. From the natural sea the poet comes to the sea of the peoples; and in the doings of God at the Red Sea a miraculous subjugation of both seas took place at one and the same time. It is clear from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 74:13-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that Egypt is to be understood by Rahab in this passage as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 87:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word signifies first of all impetuosity, violence, then a monster, like \"the wild beast of the reed,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e., the leviathan or the dragon. דּכּאת is conjugated after the manner of the Lamed He verbs, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". כּחלל is to be understood as describing the event or issue (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): so that in its fall the proudly defiant kingdom is like one fatally smitten. Thereupon in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:12-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " again follows in the same co-ordination first the praise of God drawn from nature, then from history. Jahve's are the heavens and the earth. He is the Creator, and for that very reason the absolute owner, of both. The north and the right hand, i.e., the south, represent the earth in its entire compass from one region of the heavens to the other. Tabor on this side of the Jordan represents the west (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Hermon opposite the east of the Holy Land. Both exult by reason of the name of God; by their fresh, cheerful look they give the impression of joy at the glorious revelation of the divine creative might manifest in themselves. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the praise again enters upon the province of history. \"An arm with (עם) heroic strength,\" says the poet, inasmuch as he distinguishes between the attribute inherent in God and the medium of its manifestation in history. His throne has as its מכון, i.e., its immovable foundation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 16:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), righteousness of action and right, by which all action is regulated, and which is unceasingly realized by means of the action. And mercy and truth wait upon Him. קדּם פּני is not; to go before any one (הלּך לפני, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 85:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but anticipatingly to present one's self to any one, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 88:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 95:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Mercy and truth, these two genii of sacred history (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), stand before His face like waiting servants watching upon His nod. ",
        "children": []
      }
    ]
  }
]