[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That know the joyful sound",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that are familiar with the shouting and music that accompanied the feasts of Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They shall walk.—Better in the present; and so of the verb in the next verse. The light of Jehovah’s countenance of course means His favour.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "They shall walk.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better in the present; and so of the verb in the next verse. The light of Jehovah’s countenance of course means His favour.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "CONTINUAL SUNSHINEPsalm 89:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "CONTINUAL SUNSHINE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Psalmist has just been setting forth, in sublime language, the glories of the divine character-God’s strength, His universal sway, the justice and judgment which are the foundation of His Throne, the mercy and truth which go as heralds before His face. A heathen singing of any of his gods would have gone on to describe the form and features of the god or goddess who came behind the heralds, but the Psalmist remembers ‘Thou shalt not make unto thyself any . . . likeness of God.’ A sacred reverence checks his song. He veils his face in his mantle while He whom no man can see and live passes by. Then he breaks into rapturous exclamations which are very prosaically and poorly represented by our version. For the text is not a mere statement, as it is made to be by reading ‘Blessed is the people,’ but it is a burst of adoring wonder, and should be read, ‘Oh! the blessedness of the people that know the joyful sound.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, the force of this exclamation is increased if we observe that the word that is rendered ‘joyful sound’ is the technical word for the trumpet blast at Jewish feasts. The purpose of these blasts, like those of the heralds at the coronation of a king, was to proclaim the presence of God, the King of Israel, in the festival, as well as to express the gladness of the worshippers. Thus the Psalmist, when he says, ‘Blessed is the people that know the joyful sound,’ has no reference, as we ordinarily take him to have, to the preaching of the Gospel, but to the trumpet-blasts that proclaimed the present God and throbbed with the gladness of the waiting worshippers. So that this exclamation is equivalent to ‘Oh! how blessed are the people who are sure that they have God with them!’ and who, being sure, bow before Him in loving worship. It is to be further noticed that the subsequent words of the text state the first element which it indicates of that blessedness of a devout life, ‘They shall walk, O Lord! in the light of Thy countenance.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. We deal first with the meaning of this phrase. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. We deal first with the meaning of this phrase.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Of course, ‘the light of Thy countenance’ is a very obvious and natural symbol for favour, complacency, goodwill on the part of Him that is conceived of as looking on any one. We read, for instance, in reference to a much lower subject in the Book of Proverbs, ‘In the light of the king’s countenance is life, and his favour is as a cloud of the latter rain.’ Again we have, in the Levitical benediction, the phrase accompanied in the parallel clauses by what is really an explanation of it, ‘The Lord cause His face to shine upon thee and be gracious unto thee.’ So that the simple and obvious meaning of the words, ‘the light of Thy countenance,’ is the favour and lovingkindness of God manifested in that gracious Face which He turns to His servants. As for the other chief word in the clause, ‘to walk’ is the equivalent throughout Scripture for the conduct of the active life and daily conversation of a man, and to walk in the light is simply to have the consciousness of the divine Presence and the experience of the divine lovingkindness and friendship as a road on which we travel our life’s journey, or an atmosphere round us in which all our activities are done and in which we ever remain, as a diver in his bell, to keep evil and sin from us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is only one more remark in the nature of explanation which I make, and that is that the expression here for walking is cast in the original into a form which grammarians call intensive, strengthening the simple idea expressed by the word. We may express its force if we read, ‘They walk continually in the light of Thy countenance.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Is not that just a definition of the Christian life as an unbroken realisation of the divine Presence, and an unbroken experience of the lovingkindness and favour of God? Is not that religion in its truest, simplest essence, in its purest expression? The people who are sure that they have their King in their midst, and who feel that He is looking down upon them with tender pity, with loving care, with nothing but friendship and sweetness in His heart, these people, says the Psalmist, are blessed. So much, then, for the meaning of the word.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Consider the possibility of such a condition being ours. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Consider the possibility of such a condition being ours.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Can such a thing be? Is it possible for a man to go through life carrying this atmosphere constantly with him? Can the continuity which, as I remarked, is expressed by the original accurately rendered, be kept up through an ordinary life that has all manner of work to do, or are we only to ‘hear the joyful sound,’ now and then, at rare intervals, on set occasions, answering to these ancient feasts? Which of the two is it to be, dear brethren? There is no need whatever why any amount of hard work, or outward occupations of the most secular character, or any amount of distractions, should break for us the continuity of that consciousness and of that experience. We may carry God with us wherever we go, if only we remember that where we cannot carry Him with us we ought not to go. We may carry Him with us into all the dusty roads of life; we may always walk on the sunny side of the street if we like. We may always bear our own sunshine with us. And although we are bound to be diligent in business, and some of us have had to take a heavy lift of a great deal of hard work, and much of it apparently standing in no sort of relation to our religious life, yet for all that it is possible to bend all to this one direction, and to make everything a means of bringing us nearer to God and fuller of the conscious enjoyment of His presence. And if we have not learned to do that with our daily work, then our daily work is a curse to us. If we have allowed it to become so absorbing or distracting as that it dims and darkens our sense of the divine Presence, then it is time for us to see what is wrong in the method or in the amount of work which is thus darkening our consciences. I know it is hard, I know that an absolute attainment of such an ideal is perhaps beyond us, but I know that we can approach-I was going to say infinitely, but a better word is indefinitely-nearer it than any of us have ever yet done. As the psalm goes on to say in the next clause, it is possible for us to ‘rejoice in His Name all the day.’ Ay, even at your tasks, and at your counters, and in your kitchens, and in my study, it is possible for us; and if our hearts are what and where they ought to be, the possibility will be realised. Earthly duty has no necessary effect of veiling the consciousness of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor is there any reason why our troubles, sorrows, losses, solitude should darken that sunshine. I know that that is hard, too, perhaps harder than the other. It is more difficult to have a sense of the sunshine of the divine Presence shining through the clouds of disaster and sorrow than even it is to have it shining through the dust that is raised by traffic and secular occupation. But it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " possible. There is nothing in all the sky so grand as clouds smitten by sunshine, and the light is never so glorious as when it is flashed back from them and dyes their piled bosoms with all celestial colours. There is no experience of God’s Presence so blessed as that of a man who, in the midst of sorrow, has yet with him the assurance of the Father’s friendship and favour and love, and so can say ‘as sorrowful, yet always rejoicing.’ This sunshine shines in the foulest corners, and the most thunder-laden clouds only flash back its glories in new forms.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is only one thing that breaks the continuity of that blessedness, and that is our own sin. We carry our own weather with us, whether we will or no, and we can bring winter into the middle of summer by flinging God away from us, and summer into the midst of winter by grappling Him to our hearts. There is only one thing that necessarily breaks our sense of His Presence, and that is that our hearts should turn away from His face. A man can work hard and yet feel that God is with him. A man can be weighed upon by many distresses and yet feel that God is with him and loves him; but a man cannot commit the least tiny sin and love it, and feel at the same time that God is with him. The heart is like a sensitive photographic plate, it registers the variations in the sunshine; and the one hindrance that makes it impossible for God’s light to fall upon my soul with the assurance of friendship and the sense of sweetness, is that I should be hugging some evil to my heart. It is not the dusty highway of life nor the dark vales of weeping and of the shadow of death through which we sometimes have to pass that make it impossible for this sunlight to pour down upon us, but it is our gathering round ourselves of the poisonous mists of sin through which that light cannot pierce; or if it pierce, pierces transformed and robbed of all its beauty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Let me note next the blessedness which draws out the Psalmist’s rapturous exclamation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Let me note next the blessedness which draws out the Psalmist’s rapturous exclamation.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The same phrase is employed in one of the other psalms, which, I think, bears in its contents the confirmation of the attribution of it to David. When he was fleeing before his rebellious son, at the very lowest ebb of his fortunes, away on the uplands of Moab, a discrowned king, a fugitive in danger of death at every moment, he sang a psalm in which these words occur: ‘There be many that say, Who will show us any good?’ ‘Lord, lift up the light of Thy countenance upon us’; and then follows, ‘Thou hast put gladness into my heart more than when their corn and wine abound.’ The speech of the many, ‘Who will show us any good?’ is contrasted with the prayer of the one, ‘Lord, lift Thou up the light of Thy countenance upon us.’ That is blessedness. It is the only thing that makes the heart to be at rest. It is the only thing that makes life truly worth living, the only thing that brings sweetness which has no after taint of bitterness and breeds no fear of its passing away. To have that unsetting sunshine streaming down upon my open heart, and to carry about with me whithersoever I go, like some melody from hidden singers sounding in my ears, the Name and the Love of my Father God-that and that only, brother, is true rest and abiding blessedness. There are many other joys far more turbulent, more poignant, but they all pass. Many of them leave a nauseous taste in the mouth when they are swallowed; all of them leave us the poorer for having had them and having them no more. For one who is not a Christian I do not know that it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is‘Better to have loved and lostThan never to have loved at all.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "‘Better to have loved and lost",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Than never to have loved at all.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But for those to whom God’s Face is as a Sun, life in all its possibilities is blessed; and there is no blessedness besides. So let us keep near Him, ‘walking in the light,’ in our changeful days, ‘as He is in the light’ in His essential and unalterable being; and that light will be to us all which it is taken in Scripture to symbolise-knowledge and joy and purity; and in us, too, there will be ‘no darkness at all.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there is one last word that I must say, and that is that a possible terror is intertwined with this blessedness. The next psalm to this says, with a kind of tremulous awe in the Psalmist’s voice: ‘Thou hast set our iniquities before Thee, our secret sins in the light of Thy countenance.’ In that sense all of us, good and bad, lovers of God and those that are careless about Him, walk all the day long in the light of His face, and He sees and marks all our else hidden evil. It needs something more than any of us can do to make the thought that we do stand in the full glaring of that great searchlight, not turned occasionally but focussed steadily on us individually, a joy and a blessing to us. And what we need is offered us when we read, ‘His countenance was as the sun shineth in his strength, and I fell at His feet as dead. And He laid His hand upon me and said, Fear not! I am He that liveth and was dead; and behold! I am alive for ever more.’ If we put our poor trust in the Eternal Light that was manifest in Christ, then we shall walk in the sunshine of His face on earth, and that lamp will burn for us in the darkness of the grave and lead us at last into the ever-blazing centre of the Sun itself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 89:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessed are the people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Next to the praises of Jehovah, is declared the happiness of those who have him for their God, who are his worshippers and servants, living under his righteous and merciful government; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that know — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That hear, from time to time, acknowledge and obey; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the joyful sound — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“The sound of the trumpet, by which the festivals of the Jewish Church were proclaimed, and the people were called together to the offices of devotion;” that is, who have God’s word and ordinances among them, and are favoured with his presence, and with the tokens of his mercy and grace, in and by these means; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they shall walk, O Lord, in the light of thy countenance — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Being blessed with the light of truth, and being enabled to walk therein, they shall live under the comfortable influences of thy love and favour. Remember, reader, “these blessings are now become our own; the evangelical trumpet hath sounded through the once heathen world; the Sun of righteousness hath risen upon all nations. Let us attend to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "joyful sound; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "let us walk in the glorious ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "light.” — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Horne.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "89:15-18 Happy are those who so know the joyful sound of the gospel as to obey it; who experience its power upon their hearts, and bring forth the fruit of it in their lives. Though believers are nothing in themselves, yet having all in Christ Jesus, they may rejoice in his name. May the Lord enable us to do so. The joy of the Lord is the strength of his people; whereas unbelief dispirits ourselves and discourages others. Though it steals upon us under a semblance of humility, yet it is the very essence of pride. Christ is the Holy One of Israel; and in him was that peculiar people more blessed than in any other blessing.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blessed is the people - Happy is their condition. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That know the joyful sound - That hear that sound. DeWette explains this of the call to the festivals and offerings, Leviticus 23:24; Numbers 10:10; Psalm 27:6. That is, says he, those who honor and worship God. The Hebrew word - תרועה  terû‛âh - means a loud noise; a tumult; especially, shouts of joy, or rejoicing, Job 8:21; 1 Samuel 4:5; the \"shout of a king,\" that is, the joyful acclamations with which a king is welcomed, Numbers 23:21; the shout of battle, Jeremiah 4:19; Jeremiah 49:2. Then it means the sound or clangor of trumpets, Leviticus 25:9; Numbers 29:1-6. The word is, therefore, especially applicable to the sounding of the trumpets which attended the celebration of the great; festivals among the Hebrews, and there can be little doubt that this is the reference here. The idea is, that they are blessed or happy who are the worshippers of Yahweh, the true God; who are summoned to his service; who are convened to the place of his worship.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That know the joyful sound - That hear that sound. DeWette explains this of the call to the festivals and offerings, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 10:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 27:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That is, says he, those who honor and worship God. The Hebrew word - תרועה  terû‛âh - means a loud noise; a tumult; especially, shouts of joy, or rejoicing, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the \"shout of a king,\" that is, the joyful acclamations with which a king is welcomed, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 23:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the shout of battle, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 4:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Then it means the sound or clangor of trumpets, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 29:1-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word is, therefore, especially applicable to the sounding of the trumpets which attended the celebration of the great; festivals among the Hebrews, and there can be little doubt that this is the reference here. The idea is, that they are blessed or happy who are the worshippers of Yahweh, the true God; who are summoned to his service; who are convened to the place of his worship.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They shall walk, O Lord, in the light of thy countenance - They shall live in thy favor, and enjoy thy smiles. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They shall walk, O Lord, in the light of thy countenance - They shall live in thy favor, and enjoy thy smiles. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. His government of righteousness is served by \"mercy\" and \"truth\" as ministers (Ps 85:10-13).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "know the joyful sound—understand and appreciate the spiritual blessings symbolized by the feasts to which the people were called by the trumpet (Le 25:9, &c.).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "walk … countenance—live in His favor (Ps 4:6; 44:3).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "walk … countenance—live in His favor (Ps 4:6; 44:3).",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15 Blessed is the people that know the joyful sound: they shall walk, O Lord, in the light of thy countenance,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16 In thy name shall they rejoice all the day: and in thy righteous shall they be exalted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17 For thou art the glory of their strength: and in thy favour our how shall be exalted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18 For the Lord is our defence; and the Holy One of Israel is our king.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 89:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:15",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Blessed is the people that know the joyful sound.\" He is a blessed God of whom the Psalmist has been singing, and therefore they are a blessed people who partake of his bounty, and know how to exult in his favour. Praise is a peculiarly joyful sound, and blessed are those who are familiar with its strains. The covenant promises have also a sound beyond measure precious, and they are highly favoured who understand their meaning and recognise their own personal interest in them, There may also be a reference here to the blowing of trumpets and other gladsome noises which attended the worship of Jehovah, who, unlike the gods of the heathen was not adored by the shrieks of wretched victims, or the yells and outcries of terror-stricken crowds, but by the joyful shouts of his happy people. \"They shall walk, O Lord, in the light of thy countenance.\" For them it is joy enough that Jehovah is favourable to them; all day long this contents them and enables them with vigour to pursue their pilgrimage. Only a covenant God could look with favour upon men, and those who have known him in that relationship learn to rejoice in him, yea, to walk with him in fellowship, and to continue in communion with him we give God our ear and hear the joyful sound, he will shew us his face and make us glad. While the sun shines, men walk without stumbling as to their feet, and when the Lord smiles on us we live without grief as to our souls.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 89:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:16",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"In thy name shall they rejoice all the day.\" And good cause they have for so doing, for to the soul which, in Christ Jesus, has entered into covenant with God, every attribute is a fountain of delight. There is no hour in the day, and no day in our life, in which we may not rejoice in the name, person, and character of the Lord. We need no other reason for rejoicing. As philosophers could make merry without music, so can we rejoice without carnal comforts; the Lord All-sufficient is an all-sufficient source of joy. \"And in thy righteousness, shall they be exalted.\" By the Lord's righteous dealings the saints are uplifted in due time, however great may have been the oppression and the depression from which they may have suffered. In the righteousness which the covenant supplies, which is entirely of the Lord, believers are set on high, in a secure and blessed position, so that they are full of sacred happiness. If God were unjust, or if he regarded us as being without righteousness, we must be filled with misery, but as neither of these things is so, we are exalted indeed, and would extol the name of the Lord.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 89:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:17",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For thou art the glory of their strength.\" Surely in the Lord Jehovah have we both righteousness and strength. He is our beauty and glory when we are strong in him, as well as our comfort anti sustenance when we tremble because of conscious weakness in ourselves. No man whom the Lord makes strong may dare to glory in himself, he must ascribe all honour to the Lord alone; we have neither strength nor beauty apart from him. \"And in thy favour our horn shall be exalted.\" By the use of the word our the Psalmist identifies himself with the blessed people, and this indicates how much sweeter it is to sing in the first person than concerning others. May we have grace to claim a place among those in covenant with God, in Christ Jesus, for then a sense of divine favour will make us also bold and joyous. A creature full of strength and courage lifts up its horn, and so also does a believer become potent, valiant, and daring. The horn was an eastern ornament, worn by men and women, or at least is so at this day, and by the uplifting of this the wearer showed himself to be in good spirits, and in a confident frame of mind: we wear no such outward vanities, but our inward soul is adorned and made bravely triumphant when the favour of God is felt by us. Worldly men need outward prosperity to make them lift up their heads, but the saints find more than enough encouragement in the secret love of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 89:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:18",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For the Lord is our defence.\" Whoever else may defend us, he is our ultimate Defender and Shield. \"And the Holy One of Israel is our king.\" He who protects should govern, our defender should be acknowledged as our king. Kings are called the shields of nations, and the God of Israel is both our Ruler and Defence. Another sense may be that Israel's defender and king was of the Lord, belonging to him and sent by him; even the protectors of the land being themselves protected by the Lord. The title \"the Holy One of Israel\" is peculiarly delightful to the renewed heart. God is one, we worship none beside. He is holiness itself, the only being who can be called \"the Holy One,\" and in his perfection of character we see the most excellent reason for our faith. He who is holy cannot break his promises, or act unjustly concerning his oath and covenant. Moreover, he is the Holy One of Israel, being specially the God of his own elect, ours by peculiar ties, ours for ever and ever. Who among the saints will not rejoice in the God of election? Are they not indeed a people greatly blessed who can call this God their God for ever and ever? ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The psalmist, intending to describe the doleful estate of the royal family and kingdom of Israel, aggravates it by the consideration of their former felicity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That know the joyful sound, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. who enjoy the presence of God and his ordinances, and the tokens of his grace and mercy to them, to which they were called and invited by the sound of trumpets, which upon that only reason was very pleasant and grateful to the Israelites. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 10:9,10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". So the sign is put for the thing signified, as is manifest, both from the following clause of the verse, and because otherwise the hearing of the outward sound of trumpets could never make them blessed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Walk in the light of thy countenance; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they live under the comfortable influences of thy grace and favour; whereof at present we are bereaved. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Blessed is the people that know the joyful sound,.... Of the love, grace, and mercy of God displayed in Christ, of peace and pardon by his blood, of justification by his righteousness, of atonement by his sacrifice, and of complete salvation by his obedience, sufferings, and death; this is the sound of the Gospel, and a joyful one it is to sensible sinners; and is so called in allusion either to a shout made upon a victory gained, and such a sound is the Gospel; it declares victory by Christ over sin, Satan, the world, and death, and every enemy; and that he has made his people more than conquerors over them; or to the jubilee trumpet, which proclaimed liberty and a restoration of inheritances, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and so the Gospel proclaims liberty to the captives, freedom from the dominion of sin, and condemnation by it, from the tyranny of Satan, and the bondage of the law; and gives an account of the inheritance the saints have in Christ, and through his death, to which they are regenerated, and for which they are made meet by the Spirit of God, and of which he is the seal and earnest: or to the silver trumpets, for the use of the congregation of Israel, and blown at their solemn feasts, and other times, and were all of a piece, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the trumpet of the Gospel gives a certain sound, an even one, a very musical one; there is no jar nor discord in it; is a soul charming alluring sound, and very loud; it has reached, and will reach again, to the ends of the earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is a blessing to hear it, but it is a greater to \"know\" it, not merely notionally, but spiritually and experimentally; so as not only to approve of it, and be delighted with it, but so as to distinguish it from all other sounds; and by faith to receive it, and appropriate the things it publishes to a man's own soul; and such must be \"blessed\", or happy persons, for the reasons following in this verse, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall walk, O Lord, in the light of thy countenance: enjoy the gracious presence of God, have the manifestation of himself, the discoveries of his love, communion with him through Christ, and the comforts of the Holy Spirit, and these continued; so that they shall walk in the sunshine of these things, though not always; for sometimes they walk in darkness, and see no light; but it is an unspeakable mercy and blessing to walk herein at any time, for ever so short a season, see Psalm 4:6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they shall walk, O Lord, in the light of thy countenance: enjoy the gracious presence of God, have the manifestation of himself, the discoveries of his love, communion with him through Christ, and the comforts of the Holy Spirit, and these continued; so that they shall walk in the sunshine of these things, though not always; for sometimes they walk in darkness, and see no light; but it is an unspeakable mercy and blessing to walk herein at any time, for ever so short a season, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Blessed is the people that {m} know the joyful sound: they shall walk, O LORD, in the light of thy {n} countenance.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Blessed ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the people that ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " know the joyful sound: they shall walk, O LORD, in the light of thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " countenance.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Feeling in their conscience that God is their father.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) They will be preserved by your fatherly providence.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Happy the people that know the shout of joy,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That walk, Jehovah, In the light of thy countenance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Terû‘âh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may mean the jubilant shouting with which religious festivities were celebrated (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 95:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); or the acclamation with which a king was greeted (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 47:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 47:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); or the blowing of trumpets upon certain solemn occasions (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Happy indeed is Israel when it can thus greet its God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), enjoying the sunshine of His favour (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "15–18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Happy the people that have such a God, and whose King is the vicegerent of such a Sovereign. These verses form the transition to the second division of the Psalms , vv19 ff. From the praise of God it is natural to pass on to the felicity of His people, and from the mention of the people to the king who is their head and His representative.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Blessed is the people that know the joyful sound.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The sound of devotional joy appears to be intended - the sound which went up from the sanctuary in the great festival times (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:1, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They shall walk, O Lord, in the light of thy countenance.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Herein consists especially their blessedness (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 89:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The poet has now described what kind of God He is upon whose promise the royal house in Israel depends. Blessed, then, is the people that walks in the light of His countenance. הלּך of a self-assured, stately walk. The words ידעי תּרוּעה are the statement of the ground of the blessing interwoven into the blessing itself: such a people has abundant cause and matter for exultation (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). תּרוּעה is the festive sound of joy of the mouth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and of trumpets or sackbuts (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This confirmation of the blessing is expanded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jahve's שׁם, i.e., revelation or manifestation, becomes to them a ground and object of unceasing joy; by His צדקה, i.e., the rigour with which He binds Himself to the relationship He has entered upon with His people and maintains it, they are exalted above abjectness and insecurity. He is תּפארת עזּמו, the ornament of their strength, i.e., their strength which really becomes an ornament to them. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the poet declares Israel to be this happy people. Pinsker's conjecture, קרנם (following the Targum), destroys the transition to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is formed by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The plural reading of Kimchi and of older editions (e.g., Bomberg's), קרנינוּ, is incompatible with the figure; but it is immaterial whether we read תּרים with the Chethb (Targum, Jerome), or with the Ker (lxx, Syriac) תּרוּם.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Zur Geschichte des Karaismus, pp. קפא and קפב, according to which, reversely, in Joshua 5:1 עברוּ is to be read instead of עברם, and Isaiah 33:2 זרענוּ instead of זרעם, Psalm 12:8 תשמרנּוּ instead of תשמרם, Micah 7:19 חטאתנוּ instead of חטאתם, Job 32:8 תביננּוּ instead of תבינם, Proverbs 25:27 כבודנוּ instead of כבודם (the limiting of our honour brings honour, - an unlikely interpretation of the חקר).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Zur Geschichte des Karaismus, pp. קפא and קפב, according to which, reversely, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " עברוּ is to be read instead of עברם, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " זרענוּ instead of זרעם, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " תשמרנּוּ instead of תשמרם, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 7:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " חטאתנוּ instead of חטאתם, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 32:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " תביננּוּ instead of תבינם, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 25:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " כבודנוּ instead of כבודם (the limiting of our honour brings honour, - an unlikely interpretation of the חקר).)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "מגנּנוּ and מלכּנוּ in Psalm 89:19 are parallel designations of the human king of Israel; מגן as in Psalm 47:10, but not in Psalm 84:10. For we are not compelled, with a total disregard of the limits to the possibilities of style (Ew. 310, a), to render Psalm 89:19: and the Holy One of Israel, (as to Him, He) is our King (Hitzig), since we do not bring down the Psalm beyond the time of the kings. Israel's shield, Israel's king, the poet says in the holy defiant confidence of faith, is Jahve's, belongs to the Holy One of Israel, i.e., he stands as His own possession under the protection of Jahve, the Holy One, who has taken Israel to Himself for a possession; it is therefore impossible that the Davidic throne should become a prey to any worldly power. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "מגנּנוּ and מלכּנוּ in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are parallel designations of the human king of Israel; מגן as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 47:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but not in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For we are not compelled, with a total disregard of the limits to the possibilities of style (Ew. 310, a), to render ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": and the Holy One of Israel, (as to Him, He) is our King (Hitzig), since we do not bring down the Psalm beyond the time of the kings. Israel's shield, Israel's king, the poet says in the holy defiant confidence of faith, is Jahve's, belongs to the Holy One of Israel, i.e., he stands as His own possession under the protection of Jahve, the Holy One, who has taken Israel to Himself for a possession; it is therefore impossible that the Davidic throne should become a prey to any worldly power. ",
            "children": []
          }
        ]
      }
    ]
  }
]