[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "89:1-4 Though our expectations may be disappointed, yet God's promises are established in the heavens, in his eternal counsels; they are out of the reach of opposers in hell and earth. And faith in the boundless mercy and everlasting truth of God, may bring comfort even in the deepest trials.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thy seed will I establish for ever - Thy children; thy posterity. The reference is to his successors on the throne. The promise was that there should not fail to be one on his throne; that is, that his dynasty should never become extinct. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"And thy house and thy kingdom shall be established forever before thee: thy throne shall be established forever.\" Compare also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word rendered \"establish\" means properly to fit; then, to make firm; to put on a solid basis.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And build up thy throne - It shall be kept up; it shall be like a building that is constantly progressing toward completion. The meaning is, that it would not fail. He would not begin the work, and then abandon it. The dynasty, the kingdom, the throne, would be complete and perpetual.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To all generations - As long as the world should stand. This can have been accomplished only by the Messiah occupying in a spiritual sense the throne of \"his father David.\" Compare Luke 1:32-33. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To all generations - As long as the world should stand. This can have been accomplished only by the Messiah occupying in a spiritual sense the throne of \"his father David.\" Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:32-33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3, 4. The object of this faith expressed in God's words (2Sa 7:11-16).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with—or literally, \"to\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "my chosen—as the covenant is in the form of a promise.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " I will perpetuate the kingdom to thy posterity; which was promised upon condition, and was literally and fully accomplished in Christ, who was of the seed of David. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thy seed will I establish for ever,.... Meaning not the natural seed of David, at least not only them; whose family was indeed preserved, though in very low circumstances, until the Messiah came, who sprung from thence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the spiritual seed of Christ, to whom it was promised that he should have a seed, and should see and enjoy it, and which should endure for ever; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so he always has had a seed to serve him in all generations, in the worst of times, and will; and who are established in him, and will be kept and preserved by him, and whom he will present to his Father, saying, \"Lo, I and the children whom thou hast given me\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and build up thy throne to all generations; and this shows that the passage is not to be understood literally of David, and of his temporal throne and kingdom, which did not last many generations; but of the spiritual throne and kingdom of the Messiah, who sprung from him, called the throne of his father David, whose throne is for ever and ever, and whose kingdom is an everlasting kingdom, Luke 1:32, Psalm 45:6, his throne is in the heavens, where he will reign until all enemies are put under his feet; and it is also in the midst of his church, and in the hearts of his people, where he reigns as King of saints; and he is on the same throne with his Father; it is the same with his, as to glory, power, and authority; on this he will sit, and judge the world at the last day; and on it he will reign with his people a thousand years, in the New Jerusalem state, and after that to all eternity, Revelation 3:21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and build up thy throne to all generations; and this shows that the passage is not to be understood literally of David, and of his temporal throne and kingdom, which did not last many generations; but of the spiritual throne and kingdom of the Messiah, who sprung from him, called the throne of his father David, whose throne is for ever and ever, and whose kingdom is an everlasting kingdom, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", his throne is in the heavens, where he will reign until all enemies are put under his feet; and it is also in the midst of his church, and in the hearts of his people, where he reigns as King of saints; and he is on the same throne with his Father; it is the same with his, as to glory, power, and authority; on this he will sit, and judge the world at the last day; and on it he will reign with his people a thousand years, in the New Jerusalem state, and after that to all eternity, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Selah. See Gill on Psalm 3:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Selah. See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thy seed will I establish for ever, and build up thy throne to all generations. Selah.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thy seed will I establish forever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:12, 13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Psalm 130:12). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And build up thy throne to all generations.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The promises to David were not fulfilled in the letter. After Zerubbabel, no prince of the Davidic house sat on the throne of David, or had temporal sway over Israel. The descendants of David sank into obscurity, and so remained for five centuries. Still, however, God's faithfulness was sure. In Jesus Christ, of the seed of David, the true King of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "everlasting",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " kingdom was raised up - every pledge made to David was fulfilled. \"Messiah the Prince,\" eternal King of an eternal kingdom, appeared as the true \"Seed' intended, and began his spiritual reign over the spiritual Israel, which still continues, and will continue forever. Psalm 89:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The poet, who, as one soon observes, is a חכם (for the very beginning of the Psalm is remarkable and ingenious), begins with the confession of the inviolability of the mercies promised to the house of David, i.e., of the הסדי דוד הנּאמנים, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The Vulgate renders: Misericordias Domini in aeternum cantabo. The second Sunday after Easter takes its name from this rendering.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God's faithful love towards the house of David, a love faithful to His promises, will he sing without ceasing, and make it known with his mouth, i.e., audibly and publicly (cf. Job 19:16), to the distant posterity. Instead of חסדי, we find here, and also in Lamentations 3:22, חסדי with a not merely slightly closed syllable. The Lamed of לדר ודר is, according to Psalm 103:7; Psalm 145:12, the datival Lamed. With כּי־אמרתּי (lxx, Jerome, contrary to Psalm 89:3, ὅτι εἶπας) the poet bases his resolve upon his conviction. נבנה means not so much to be upheld in building, as to be in the course of continuous building (e.g., Job 22:23; Malachi 3:15, of an increasingly prosperous condition). Loving-kindness is for ever (accusative of duration) in the course of continuous building, viz., upon the unshakeable foundation of the promise of grace, inasmuch as it is fulfilled in accordance therewith. It is a building with a most solid foundation, which will not only not fall into ruins, but, adding one stone of fulfilment upon another, will rise ever higher and higher. שׁמים then stands first as casus absol., and בּהם is, as in Psalm 19:5, a pronoun having a backward reference to it. In the heavens, which are exalted above the rise and fall of things here below, God establishes His faithfulness, so that it stands fast as the sun above the earth, although the condition of things here below seems sometimes to contradict it (cf. Psalm 119:89). Now follow in Psalm 89:4-5 the direct words of God, the sum of the promises given to David and to his seed in 2 Samuel 7, at which the poet arrives more naturally in Psalm 89:20. Here they are strikingly devoid of connection. It is the special substance of the promises that is associated in thought with the \"loving-kindness\" and \"truth\" of Psalm 89:3, which is expanded as it were appositionally therein. Hence also אכין and תּכין, וּבניתי and יבּנה correspond to one another. David's seed, by virtue of divine faithfulness, has an eternally sure existence; Jahve builds up David's throne \"into generation and generation,\" inasmuch as He causes it to rise ever fresh and vigorous, never as that which is growing old and feeble. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God's faithful love towards the house of David, a love faithful to His promises, will he sing without ceasing, and make it known with his mouth, i.e., audibly and publicly (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), to the distant posterity. Instead of חסדי, we find here, and also in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 3:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", חסדי with a not merely slightly closed syllable. The Lamed of לדר ודר is, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 103:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 145:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the datival Lamed. With כּי־אמרתּי (lxx, Jerome, contrary to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ὅτι εἶπας) the poet bases his resolve upon his conviction. נבנה means not so much to be upheld in building, as to be in the course of continuous building (e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of an increasingly prosperous condition). Loving-kindness is for ever (accusative of duration) in the course of continuous building, viz., upon the unshakeable foundation of the promise of grace, inasmuch as it is fulfilled in accordance therewith. It is a building with a most solid foundation, which will not only not fall into ruins, but, adding one stone of fulfilment upon another, will rise ever higher and higher. שׁמים then stands first as casus absol., and בּהם is, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", a pronoun having a backward reference to it. In the heavens, which are exalted above the rise and fall of things here below, God establishes His faithfulness, so that it stands fast as the sun above the earth, although the condition of things here below seems sometimes to contradict it (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:89",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Now follow in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the direct words of God, the sum of the promises given to David and to his seed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", at which the poet arrives more naturally in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here they are strikingly devoid of connection. It is the special substance of the promises that is associated in thought with the \"loving-kindness\" and \"truth\" of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which is expanded as it were appositionally therein. Hence also אכין and תּכין, וּבניתי and יבּנה correspond to one another. David's seed, by virtue of divine faithfulness, has an eternally sure existence; Jahve builds up David's throne \"into generation and generation,\" inasmuch as He causes it to rise ever fresh and vigorous, never as that which is growing old and feeble. ",
            "children": []
          }
        ]
      }
    ]
  }
]