[{"num":15,"verse":"Then some from Judea came down and taught the brothers, saying, “Unless you are circumcised according to the custom of Moses, you cannot be saved.”"},{"num":2,"verse":"And when there was great dissension and disputation by Paul and Barnabas against them, they ordained that Paul and Barnabas, and certain others of them, should go up to Jerusalem (to the apostles and elders) about this question."},{"num":3,"verse":"Thus, being sent forth by the church, they passed through Phoenicia and Samaria, declaring the conversion of the Gentiles. And they brought great joy to all the brothers."},{"num":4,"verse":"And when they had come to Jerusalem, they were received by the church, and by the apostles and elders. And they told what things God had done through them."},{"num":5,"verse":"“But,” they said, “some of the Pharisee sect who believed, rose up, saying that it was necessary to circumcise them, and to command them to keep the Law of Moses.”"},{"num":6,"verse":"Then the apostles and elders came together to consider this matter."},{"num":7,"verse":"And when there had been great disputation, Peter rose up, and said to them, “Men, brothers, you know that a good while ago, God chose me from among us. So that by my mouth the Gentiles should hear the word of the Gospel and believe."},{"num":8,"verse":"“And God, Who knows the hearts, bore them witness in giving the Holy Ghost to them even as to us."},{"num":9,"verse":"“And after He had purified their hearts by faith, He made no distinction between us and them."},{"num":10,"verse":"“Now, therefore, why do you tempt God, to lay a yoke on the disciples’ necks which neither our fathers nor we were able to bear?"},{"num":11,"verse":"“But we believe we are saved through the grace of the Lord Jesus Christ, just as they are.”"},{"num":12,"verse":"Then all the multitude kept silent and heard Barnabas and Paul, who told what signs and wonders God had done through them among the Gentiles."},{"num":13,"verse":"And after their silence, James answered, saying, “Men, brothers, hear me."},{"num":14,"verse":"“Simeon has declared how God first visited the Gentiles, to take a people to His Name."},{"num":15,"verse":"“And the words of the Prophets agree with this. As it is written,"},{"num":16,"verse":"‘After this I will return, and will rebuild the Tabernacle of David, which has fallen down. And I will rebuild the ruins thereof, and I will set it up."},{"num":17,"verse":"‘So that the remaining men - and all the Gentiles upon whom My Name is called - might seek after the Lord, saith the Lord Who does all these things.’"},{"num":18,"verse":"“From the beginning of the world, God knows all His works."},{"num":19,"verse":"“Therefore my judgment is that we do not trouble those of the Gentiles who have turned to God,"},{"num":20,"verse":"“but that we write to them to abstain from filthiness of idols, and from fornication, and from that which is strangled, and from blood."},{"num":21,"verse":"“For Moses has, for generations, had those who preach him in every city (seeing he is read in the synagogues every Sabbath).”"},{"num":22,"verse":"Then it seemed good to the apostles and elders (with the whole church) to send chosen men of their own company to Antioch with Paul and Barnabas: namely, Judas (whose surname was Barsabas) and Silas, leaders among the brothers."},{"num":23,"verse":"And they wrote letters by them like this, “The Apostles, and the Elders, and the Brothers, to the Gentile Brothers in Antioch, and in Syria, and in Cilicia, greetings,"},{"num":24,"verse":"“Since we have heard that some who went out from us have troubled you with words, and upset your minds, saying, ‘You must be circumcised and keep the Law’ (to whom we gave no such commandment),"},{"num":25,"verse":"“It therefore seemed good to us - after we had come together with one mind - to send chosen men to you with our beloved Barnabas and Paul."},{"num":26,"verse":"“Men who have given up their lives for the Name of our Lord Jesus Christ."},{"num":27,"verse":"“We have therefore sent Judas and Silas, who shall also tell you the same things by mouth."},{"num":28,"verse":"“For it seemed good to the Holy Ghost (and to us) to lay no more burden upon you other than these necessary things:"},{"num":29,"verse":"“that you abstain from things offered to idols, and blood, and that which is strangled, and from fornication. If you keep yourselves from these, you shall do well. Farewell.”"},{"num":30,"verse":"Now when they had left, they came to Antioch. And after they had assembled the multitude, they delivered the letter."},{"num":31,"verse":"And when they had read it, they rejoiced for the consolation."},{"num":32,"verse":"And Judas and Silas, being Prophets, encouraged the brothers with many words, and strengthened them."},{"num":33,"verse":"And after they had stayed there a time, they were sent back in peace by the brothers to the apostles."},{"num":34,"verse":"However, Silas thought it good to remain there."},{"num":35,"verse":"Paul and Barnabas also stayed in Antioch, teaching and preaching (with many others) the word of the Lord."},{"num":36,"verse":"But after some days, Paul said to Barnabas, “Let us return and visit our brothers in every city where we have preached the word of the Lord and see how they are doing.”"},{"num":37,"verse":"And Barnabas planned to take John (called Mark) with them."},{"num":38,"verse":"But Paul did not think it good to take with them one who had left them in Pamphylia, and not gone with them to do the work."},{"num":39,"verse":"Therefore there was such a sharp disagreement that they separated from one another. And Barnabas took Mark and sailed to Cyprus."},{"num":40,"verse":"And Paul chose Silas and departed, being commended by the brothers to the grace of God."},{"num":41,"verse":"And he went through Syria and Cilicia, establishing the churches."}]