[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Exodus",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "FOUR SHAPING CENTURIES",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "DEATH AND GROWTHExodus 1:6 - - Exodus 1:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "DEATH AND GROWTH",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These remarkable words occur in a short section which makes the link between the Books of Genesis and of Exodus. The writer recapitulates the list of the immigrants into Egypt, in the household of Jacob, and then, as it were, having got them there, he clears the stage to prepare for a new set of actors. These few words are all that he cares to tell us about a period somewhat longer than that which separates us from the great Protestant Reformation. He notes but two processes-silent dropping away and silent growth. ‘Joseph died, and all his brethren, and all that generation.’ Plant by plant the leaves drop, and the stem rots and its place is empty. Seed by seed the tender green spikelets pierce the mould, and the field waves luxuriant in the breeze and the sunshine. ‘The children of Israel were fruitful, and increased abundantly.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, then, let us look at this twofold process which is always at work-silent dropping away and silent growth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It seems to me that the writer, probably unconsciously, being profoundly impressed with certain features of that dropping away, reproduces them most strikingly in the very structure of his sentence: ‘Joseph died, and all his brethren, and all that generation.’ The uniformity of the fate, and the separate times at which it befell individuals, are strongly set forth in the clauses, which sound like the threefold falls of earth on a coffin. They all died, but not all at the same time. They went one by one, one by one, till, at the end, they were all gone. The two things that appeal to our imagination, and ought to appeal to our consciences and wills, in reference to the succession of the generations of men, are given very strikingly, I think, in the language of my text-namely, the stealthy assaults of death upon the individuals, and its final complete victory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If any of you were ever out at sea, and looked over a somewhat stormy water, you will have noticed, I dare say, how strangely the white crests of the breakers disappear, as if some force, acting from beneath, had plucked them under, and over the spot where they gleamed for a moment runs the blue sea. So the waves break over the great ocean of time; I might say, like swimmers pulled under by sharks, man after man, man after man, gets twitched down, till at the end-’Joseph died, and all his brethren, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that generation.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is another process going on side by side with this. In the vegetable world, spring and autumn are two different seasons: May rejoices in green leaves and opening buds, and nests with their young broods; but winter days are coming when the greenery drops and the nests are empty, and the birds flown. But the singular and impressive thing {which we should see if we were not so foolish and blind} which the writer of our text lays his finger upon is that at the same time the two opposite processes of death and renewal are going on, so that if you look at the facts from the one side it seems nothing but a charnel-house and a Golgotha that we live in, while, seen from the other side, it is a scene of rejoicing, budding young life, and growth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You get these two processes in the closest juxtaposition in ordinary life. There is many a house where there is a coffin upstairs and a cradle downstairs. The churchyard is often the children’s playground. The web is being run down at the one end and woven at the other. Wherever we look-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Every moment dies a man,Every moment one is born.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Every moment dies a man,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Every moment one is born.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Joseph died, and all his brethren, and all that generation. And the children of Israel . . .multiplied . . .exceedingly.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there is another thought here than that of the contemporaneousness of the two processes, and that is, as it is written on John Wesley’s monument in Westminster Abbey, ‘God buries the workmen and carries on the work.’ The great Vizier who seemed to be the only protection of Israel is lying in ‘a coffin in Egypt.’ And all these truculent brothers of his that had tormented him, they are gone, and the whole generation is swept away. What of that? They were the depositories of God’s purposes for a little while. Are God’s purposes dead because the instruments that in part wrought them are gone? By no means. If I might use a very vulgar proverb, ‘There are as good fish in the sea as ever came out of it,’ especially if God casts the net. So when the one generation has passed away there is the other to take up the work. Thus the text is a fitting introduction to the continuance of the history of the further unfolding of God’s plan which occupies the Book of Exodus.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Such being the twofold process suggested by this text, let us next note the lessons which it enforces.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In the first place, let us be quite sure that we give it its due weight in our thoughts and lives. Let us be quite sure that we never give an undue weight to the one half of the whole truth. There are plenty of people who are far too much, constitutionally and {perhaps by reason of a mistaken notion of religion} religiously, inclined to the contemplation of the more melancholy side of these truths; and there are a great many people who are far too exclusively disposed to the contemplation of the other. But the bulk of us never trouble our heads about either the one or the other, but go on, forgetting altogether that swift, sudden, stealthy, skinny hand that, if I might go back to my former metaphor, is put out to lay hold of the swimmer and then pull him underneath the water, and which will clasp us by the ankles one day and drag us down. Do you ever think about it? If not, surely, surely you are leaving out of sight one of what ought to be the formative elements in our lives.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then, on the other hand, when our hearts are faint, or when the pressure of human mortality-our own, that of our dear ones, or that of others-seems to weigh us down, or when it looks to us as if God’s work was failing for want of people to do it, let us remember the other side-’And the children of Israel . . .increased . . .and waxed exceeding mighty; . . .and the land was filled with them.’ So we shall keep the middle path, which is the path of safety, and so avoid the folly of extremes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But then, more particularly, let me say that this double contemplation of the two processes under which we live ought to stimulate us to service. It ought to say to us, ‘Do you cast in your lot with that work which is going to be carried on through the ages. Do you see to it that your little task is in the same line of direction as the great purpose which God is working out-the increasing purpose which runs through the ages.’ An individual life is a mere little backwater, as it were, in the great ocean. But its minuteness does not matter, if only the great tidal wave which rolls away out there, in the depths and the distance amongst the fathomless abysses, tells also on the tiny pool far inland and yet connected with the sea by some narrow, long fiord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If my little life is part of that great ocean, then the ebb and flow will alike act on it and make it wholesome. If my work is done in and for God, I shall never have to look back and say, as we certainly shall say one day, either here or yonder, unless our lives be thus part of the divine plan, ‘What a fool I was! Seventy years of toiling and moiling and effort and sweat, and it has all come to nothing; like a long algebraic sum that covers pages of intricate calculations, and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pluses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "minuses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " just balance each other; and the net result is a great round nought.’ So let us remember the twofold process, and let it stir us to make sure that ‘in our embers’ shall be ‘something that doth live,’ and that not ‘Nature,’ but something better-God-’remembers what was so fugitive.’ It is not fugitive if it is a part of the mighty whole.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But further, let this double contemplation make us very content with doing insignificant and unfinished work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Joseph might have said, when he lay dying: ‘Well! perhaps I made a mistake after all. I should not have brought this people down here, even if I have been led hither. I do not see that I have helped them one step towards the possession of the land.’ Do you remember the old proverb about certain people who should not see half-finished work? All our work in this world has to be only what the physiologists call functional. God has a great scheme running on through ages. Joseph gives it a helping hand for a time, and then somebody else takes up the running, and carries the purpose forward a little further. A great many hands are placed on the ropes that draw the car of the Ruler of the world. And one after another they get stiffened in death; but the car goes on. We should be contented to do our little bit of the work. Never mind whether it is complete and smooth and rounded or not. Never mind whether it can be isolated from the rest and held up, and people can say, ‘He did that entire thing unaided.’ That is not the way for most of us. A great many threads go to make the piece of cloth, and a great many throws of the shuttle to weave the web. A great many bits of glass make up the mosaic pattern; and there is no reason for the red bit to pride itself on its fiery glow, or the grey bit to boast of its silvery coolness. They are all parts of the pattern, and as long as they keep their right places they complete the artist’s design. Thus, if we think of how ‘one soweth and another reapeth,’ we may be content to receive half-done works from our fathers, and to hand on unfinished tasks to them that come after us. It is not a great trial of a man’s modesty, if he lives near Jesus Christ, to be content to do but a very small bit of the Master’s work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And the last thing that I would say is, let this double process going on all round us lift our thoughts to Him who lives for ever. Moses dies; Joshua catches the torch from his hand. And the reason why he catches the torch from his hand is because God said, ‘As I was with Moses so I will be with thee.’ Therefore we have to turn away in our contemplations from the mortality that has swallowed up so much wisdom and strength, eloquence and power, which the Church or our own hearts seem so sorely to want: and, whilst we do, we have to look up to Jesus Christ and say, ‘He lives! He lives! No man is indispensable for public work or for private affection and solace so long at there is a living Christ for us to hold by.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear brethren, we need that conviction for ourselves often. When life seems empty and hope dead, and nothing is able to fill the vacuity or still the pain, we have to look to the vision of the Lord sitting on the empty throne, high and lifted up, and yet very near the aching and void heart. Christ lives, and that is enough.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So the separated workers in all the generations, who did their little bit of service, like the many generations of builders who laboured through centuries upon the completion of some great cathedral, will be united at the last; ‘and he that soweth, and he that reapeth, shall rejoice together’ in the harvest which was produced by neither the sower nor the reaper, but by Him who blessed the toils of both.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Joseph died, and all his brethren, and all that generation’; but Jesus lives, and therefore His people ‘grow and multiply,’ and His servants’ work is blessed; and at the end they shall be knit together in the common joy of the great harvest, and of the day when the headstone is brought forth with shoutings of ‘Grace! grace unto it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 1:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All that generation — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By degrees wore off. Perhaps all Jacob’s sons died much about the same time, for there was not past seven years’ difference in age between the eldest and the youngest of them, except Benjamin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-7 During more than 200 years, while Abraham, Isaac, and Jacob lived at liberty, the Hebrews increased slowly; only about seventy persons went down into Egypt. There, in about the same number of years, though under cruel bondage, they became a large nation. This wonderful increase was according to the promise long before made unto the fathers. Though the performance of God's promises is sometimes slow, it is always sure.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Seventy - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The object of the writer in this introductory statement is to give a complete list of the heads of separate families at the time of their settlement in Egypt. See the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 26:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "THE SECOND BOOK OF MOSES, CALLED EXODUS. Commentary by Robert Jamieson   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "CHAPTER 1",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ex 1:1-22. Increase of the Israelites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Now these are the names—(See Ge 46:8-26).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1635",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Joseph died, and all his brethren,.... It is a notion of the Jews, that Joseph died before any of his brethren; see Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 50:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and they gather it from these words; but it does not necessarily follow from hence, they might die some before him and some after him; and as they were all born in about seven years' time, excepting Benjamin, they might all die within a little time of each other: according to the Jewish writers (d), the dates of their death were these,\"Reuben lived one hundred and twenty four years, and died two years after Joseph; Simeon lived one hundred and twenty years, and died the year after Joseph; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ed one hundred and thirty seven years, and died twenty four years after Joseph; Judah lived one hundred and nineteen years, Issachar one hundred and twenty two, Zebulun one hundred and twenty four, and died two years after Joseph; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ed one hundred and twenty seven years, Asher one hundred and twenty three years, Benjamin one hundred and eleven years, and died twenty six years before Levi; Gad lived one hundred and twenty five years, and Naphtali one hundred and thirty three years;''but though this account of the Jews, of their times, and of the times of their death, is not to be depended upon, yet it is certain they all died in Egypt, though they were not buried there; but as Stephen says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they were carried over to Shechem and interred there, either quickly after their decease, or, however, were taken along with the bones of Joseph by the children of Israel, when they departed out of Egypt: and it is also evident that they all died before the affliction and oppression of the children of Israel in Egypt began; and this account seems to be given on purpose to point this out unto us, being placed in the order it is. Levi lived the longest of them all, and the affliction did not begin till after his death; and the Jewish chronologers say (e) that from his death to the children of Israel's going out of Egypt were one hundred and sixteen years; and they further observe (f), that it could not last more than one hundred and sixteen years, and not less than eighty seven, according to the years of Miriam: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all that generation; in which Joseph and his brethren had lived. These also died, Egyptians as well as Israelites, before the oppression began. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) R. Bechai apud Shalshalet Hakabala, fol. 3. 2. & 4. 1.((e) R. Gedaliah in Shalshalet, fol. 5. 1. Ganz. Tzemach David: par. 1. fol. 6. 1.((f) Seder Olam Rabba, c. 3. p. 9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) R. Bechai apud Shalshalet Hakabala, fol. 3. 2. & 4. 1.((e) R. Gedaliah in Shalshalet, fol. 5. 1. Ganz. Tzemach David: par. 1. fol. 6. 1.((f) Seder Olam Rabba, c. 3. p. 9. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Joseph died, and all his brethren, and all that generation.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The continuation in J of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 50:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", preparing partly for the notice, now preserved fragmentarily in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 7, of the increase of the Israelites in Egypt, and partly for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Joseph died",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, \"So Joseph died\" - a reference to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "- and all his brethren",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All the other actual sons of Jacob - some probably before him; some, as Levi (ch. 6:16), after him. Joseph's \"hundred and ten years\" did not constitute an extreme longevity. And all that generation. All the wives of Jacob's sons, their sister Dinah, and the full-grown members of their households who accompanied them into Egypt. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " CHAPTER 1:7-14 Exodus 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After the death of Joseph and his brethren and the whole of the family that had first immigrated, there occurred that miraculous increase in the number of the children of Israel, by which the blessings of creation and promise were fully realised. The words פּרוּ ישׁרצוּ (swarmed), and ירבּוּ point back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and יעצמוּ to עצוּם גּוי in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The land was filled with them,\" i.e., the land of Egypt, particularly Goshen, where they were settled (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The extra-ordinary fruitfulness of Egypt in both men and cattle is attested not only by ancient writers, but by modern travellers also (vid., Aristotelis hist. animal. vii. 4, 5; Columella de re rust. iii. 8; Plin. hist. n. vii. 3; also Rosenmller a. und n. Morgenland i. p. 252). This blessing of nature was heightened still further in the case of the Israelites by the grace of the promise, so that the increase became extraordinarily great (see the comm. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]