[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There arose up a new king.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A king of a new dynasty might seem to be intended. Some suppose him to be Aahmes I., the founder of the eighteenth dynasty of Manetho; others suggest Rameses II., one of the greatest monarchs of the nineteenth. The present writer inclines to regard him as Seti I., the father of this Rameses, and the son of Rameses I. Seti, though not the actual founder of the nineteenth dynasty, was the originator of its greatness. (See Excursus I. “On Egyptian History, as connected with the Book of Exodus,” at the end of this Book.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which knew not Joseph.—It seems to be implied that, for some considerable time after his death, the memory of the benefits conferred by Joseph upon Egypt had protected his kinsfolk. But, in the shifts and changes incident to politics—especially to Oriental politics—this condition of things had passed away. The “new king” felt under no obligation to him, perhaps was even ignorant of his name. He viewed the political situation apart from all personal predilections, and saw a danger in it.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Which knew not Joseph.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—It seems to be implied that, for some considerable time after his death, the memory of the benefits conferred by Joseph upon Egypt had protected his kinsfolk. But, in the shifts and changes incident to politics—especially to Oriental politics—this condition of things had passed away. The “new king” felt under no obligation to him, perhaps was even ignorant of his name. He viewed the political situation apart from all personal predilections, and saw a danger in it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Exodus",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "FOUR SHAPING CENTURIESExodus 1:1 - - Exodus 1:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "FOUR SHAPING CENTURIES",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The four hundred years of Israel’s stay in Egypt were divided into two unequal periods, in the former and longer of which they were prosperous and favoured, while in the latter they were oppressed. Both periods had their uses and place in the shaping of the nation and its preparation for the Exodus. Both carry permanent lessons.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The long days of unclouded prosperity. These extended over centuries, the whole history of which is summed up in two words: death and growth. The calm years glided on, and the shepherds in Goshen had the happiness of having no annals. All that needed to be recorded was that, one by one, the first generation died off, and that the new generations ‘were fruitful, and increased abundantly, and multiplied, and waxed exceeding mighty.’ The emphatic repetitions recall the original promises in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The preceding specification of the number of the original settlers {repeated from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} brings into impressive contrast the small beginnings and the rapid increase. We may note that eloquent setting side by side of the two processes which are ever going on simultaneously, death and birth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One by one men pass out of the warmth and light into the darkness, and so gradually does the withdrawal proceed that we scarcely are aware of its going on, but at last ‘all that generation’ has vanished. The old trees are all cleared off the ground, and everywhere their place is taken by the young saplings. The web is ever being woven at one end, and run down at the other. ‘The individual withers, but the race is more and more.’ How solemn that continual play of opposing movements is, and how blind we are to its solemnity!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That long period of growth may be regarded in two lights. It effected the conversion of a horde into a nation by numerical increase, and so was a link in the chain of the divine working. The great increase, of which the writer speaks so strongly, was, no doubt, due to the favourable circumstances of the life in Goshen, but was none the less regarded by him, and rightly so, as God’s doing. As the Psalmist sings, ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " increased His people greatly.’ ‘Natural processes’ are the implements of a supernatural will. So Israel was being multiplied, and the end for which it was peacefully growing into a multitude was hidden from all but God. But there was another end, in reference to which the years of peaceful prosperity may be regarded; namely, the schooling of the people to patient trust in the long-delayed fulfilment of the promise. That hope had burned bright in Joseph when he died, and he being dead yet spake of it from his coffin to the successive generations. Delay is fitted and intended to strengthen faith and make hope more eager. But that part of the divine purpose, alas! was not effected as the former was. In the moral region every circumstance has two opposite results possible. Each condition has, as it were, two handles, and we can take it by either, and generally take it by the wrong one. Whatever is meant to better us may be so used by us as to worsen us. And the history of Israel in Egypt and in the desert shows only too plainly that ease weakened, if it did not kill, faith, and that Goshen was so pleasant that it drove the hope and the wish for Canaan out of mind. ‘While the bridegroom tarried they all slumbered and slept.’ Is not Israel in Egypt, slackening hold of the promise because it tarried, a mirror in which the Church may see itself? and do ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not know the enervating influence of Goshen, making us reluctant to shoulder our packs and turn out for the pilgrimage? The desert repels more strongly than Canaan attracts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The shorter period of oppression. Probably the rise of a ‘new king’ means a revolution in which a native dynasty expelled foreign monarchs. The Pharaoh of the oppression was, perhaps, the great Rameses II., whose long reign of sixty-seven years gives ample room for protracted and grinding oppression of Israel. The policy adopted was characteristic of these early despotisms, in its utter disregard of humanity and of everything but making the kingdom safe. It was not intentionally cruel, it was merely indifferent to the suffering it occasioned. ‘Let us deal ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wisely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with them’-never mind about justice, not to say kindness. Pharaoh’s ‘politics,’ like those of some other rulers who divorce them from morality, turned out to be impolitic, and his ‘wisdom’ proved to be roundabout folly. He was afraid that the Israelites, if they were allowed to grow, might find out their strength and seek to emigrate; and so he set to work to weaken them with hard bondage, not seeing that that was sure to make them wish the very thing that he was blunderingly trying to prevent. The only way to make men glad to remain in a community is to make them at home there. The sense of injustice is the strongest disintegrating force. If there is a ‘dangerous class’ the surest way to make them more dangerous is to treat them harshly. It was a blunder to make ‘lives bitter,’ for hearts also were embittered. So the people were ripened for revolt, and Goshen became less attractive.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " God used Pharaoh’s foolish wisdom, as He had used natural laws, to prepare for the Exodus. The long years of ease had multiplied the nation. The period of oppression was to stir them up out of their comfortable nest, and make them willing to risk the bold dash for freedom. Is not that the explanation, too, of the similar times in our lives? It needs that we should experience life’s sorrows and burdens, and find how hard the world’s service is, and how quickly our Goshens may become places of grievous toil, in order that the weak hearts, which cling so tightly to earth, may be detached from it, and taught to reach upwards to God. ‘Blessed is the man . . .in whose heart are thy ways,’ and happy is he who so profits by his sorrows that they stir in him the pilgrim’s spirit, and make him yearn after Canaan, and not grudge to leave Goshen. Our ease and our troubles, opposite though they seem and are, are meant to further the same end,-to make us fit for the journey which leads to rest and home. We often misuse them both, letting the one sink us in earthly delights and oblivion of the great hope, and the other embitter our spirits without impelling them to seek the things that are above. Let us use the one for thankfulness, growth, and patient hope, and the other for writing deep the conviction that this is not our rest, and making firm the resolve that we will gird our loins and, staff in hand, go forth on the pilgrim road, not shrinking from the wilderness, because we see the mountains of Canaan across its sandy flats.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 1:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There arose a new king — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "One of another family, according to Josephus; for it appears from ancient writers that the kingdom of Egypt often passed from one family to another. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That knew not Joseph — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "All that knew him loved him, and were kind to his relations for his sake; but when he was dead he was soon forgotten, and the remembrance of the good offices he had done was either not retained or not regarded. If we work for men only, our works, at furthest, will die with us; if for God, they will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "follow us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:8-14 The land of Egypt became to Israel a house of bondage. The place where we have been happy, may soon become the place of our affliction; and that may prove the greatest cross to us, of which we said, This same shall comfort us. Cease from man, and say not of any place on this side heaven, This is my rest. All that knew Joseph, loved him, and were kind to his brethren for his sake; but the best and most useful services a man does to others, are soon forgotten after his death. Our great care should be, to serve God, and to please him who is not unrighteous, whatever men are, to forget our work and labour of love. The offence of Israel is, that he prospers. There is no sight more hateful to a wicked man than the prosperity of the righteous. The Egyptians feared lest the children of Israel should join their enemies, and get them up out of the land. Wickedness is ever cowardly and unjust; it makes a man fear, where no fear is, and flee, when no one pursues him. And human wisdom often is foolishness, and very sinful. God's people had task-masters set over them, not only to burden them, but to afflict them with their burdens. They not only made them serve for Pharaoh's profit, but so that their lives became bitter. The Israelites wonderfully increased. Christianity spread most when it was persecuted: the blood of the martyrs was the seed of the church. They that take counsel against the Lord and his Israel, do but imagine a vain thing, and create greater vexation to themselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The expressions in this verse are special and emphatic. \"A new king\" is a phrase not found elsewhere. It is understood by most commentators to imply that he did not succeed his predecessor in the natural order of descent and inheritance. He \"arose up over Egypt,\" occupying the land, as it would seem, on different terms from the king whose place he took, either by usurpation or conquest. The fact that he knew not Joseph implies a complete separation from the traditions of Lower Egypt. At present the generality of Egyptian scholars identify this Pharaoh with Rameses II, but all the conditions of the narrative are fulfilled in the person of Amosis I((or, Aahmes), the head of the 18th Dynasty. He was the descendant of the old Theban sovereigns, but his family was tributary to the Dynasty of the Shepherds, the Hyksos of Manetho, then ruling in the North of Egypt. Amosis married an Ethiopian princess, and in the third year of his reign captured Avaris, or Zoan, the capital of the Hyksos, and completed the expulsion of that race. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. Now there arose up a new king—About sixty years after the death of Joseph a revolution took place—by which the old dynasty was overthrown, and upper and lower Egypt were united into one kingdom. Assuming that the king formerly reigned in Thebes, it is probable that he would know nothing about the Hebrews; and that, as foreigners and shepherds, the new government would, from the first, regard them with dislike and scorn.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A new king, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. another king; one of another disposition, or interest, or family; for the kingdom of Egypt did oft pass from one family to another, as appears from the history of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dynastics",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " recorded in ancient writers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which knew not Joseph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "acknowledged not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the vast obligations which Joseph had laid not only upon the kingdoms of Egypt, and the king under whom Joseph lived, but upon all his successors, in regard of those vast additions of wealth and power which he had made to that crown. This phrase notes his ungrateful disowning and ill requiting of Joseph’s favours. For words of knowledge in Scripture commonly include the affections and actions; as men are oft said not to know God, when they do not love nor serve him; and God is said not to know men, when he doth not love them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now there arose up a new king over Egypt,.... Stephen calls him another king, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " one of another family, according to Josephus (g); who was not of the seed royal, as Aben Ezra; and Sir John Marsham (h) thinks this was Salatis, who, according to Manetho (i), was the first of the Hycsi or pastor kings that ruled in lower Egypt; but these kings seem to have reigned before that time; see Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Bishop Usher (k) takes this king to be one of the ancient royal family, whose name was Ramesses Miamun; and gives us a succession of the Egyptian kings from the time of Joseph's going into Egypt to this king: the name of that Pharaoh that reigned when Joseph was had into Egypt, and whose dreams he interpreted, was Mephramuthosis; after him reigned Thmosis, Amenophis, and Orus; and in the reign of the last of these Joseph died, and after Orus reigned Acenehres a daughter of his, then Rathotis a brother of Acenchres, after him Acencheres a son of Rathotis, then another Acencheres, after him Armais, then Ramesses, who was succeeded by Ramesses Miamun, here called the new king, because, as the Jews (l) say, new decrees were made in his time; and this Pharaoh, under whom Moses was born, they call Talma (m), and with Artapanus (n) his name is Palmanothes: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which knew not Joseph; which is not to be understood of ignorance of his person, whom he could not know; nor of the history of him, and of the benefits done by him to the Egyptian nation, though, no doubt, this was among their records, and which, one would think, he could not but know; or rather, he had no regard to the memory of Joseph; and so to his family and kindred, the whole people of Israel: he acknowledged not the favours of Joseph to his nation, ungratefully neglected them, and showed no respect to his posterity, and those in connection with him, on his account; though, if a stranger, it is not to be wondered at. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Antiqu. l. 2. c. 9. sect. 1.((h) Canon. Chron. Sec. 8. p. 107. (i) Apud Joseph. Contr. Apion. l. 1. sect. 14. (k) Annal. Vet. Test. p. 17. 18. (l) T. Bab. Erubin. fol. 53. 1.((m) Juchasin, fol. 135. 2.((n) Apud Euseb. Praepar. Evangel. l. 9. c. 27. p. 431. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(g) Antiqu. l. 2. c. 9. sect. 1.((h) Canon. Chron. Sec. 8. p. 107. (i) Apud Joseph. Contr. Apion. l. 1. sect. 14. (k) Annal. Vet. Test. p. 17. 18. (l) T. Bab. Erubin. fol. 53. 1.((m) Juchasin, fol. 135. 2.((n) Apud Euseb. Praepar. Evangel. l. 9. c. 27. p. 431. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Now there arose up a new king over Egypt, which {c} knew not Joseph.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Now there arose up a new king over Egypt, which ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " knew not Joseph.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) He did not consider how God had preserved Egypt for the sake of Joseph.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there arose a new king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Implying the rise of a king whose reign began a new policy. The king, to judge from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 11 (see the notes on Pithom and Raʿamses), will have been Rameses II, the third ruler of the 19th dynasty (b.c. 1300–1234 Petrie; 1292–1225 Breasted): set further the Introduction, § 4. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (P), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 45:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 50:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (E), and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. (P), the birth of Moses took place 430–(110–39)–80 = 279 years after Joseph’s death. But there are many indications that the chronological statements of P are of slight value (cf. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the writer’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. xxvi–xxxi).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "knew not Joseph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Not only lit., was not acquainted with Joseph but also, it is implied, did not remember his services to Egypt, and have no thought or care for his people. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " b.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "8–14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "first",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " measure taken to check the increase of the Israelites: they are set to do forced labour on public works in Egypt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "There arose up a new king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is asked, Does this mean merely another king, or a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "completely different",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " king, one of a new dynasty or a new family, not bound by precedent, but free to adopt and likely to adopt quite new principles of government? The latter seems the more probable supposition; but it is probable only, not certain. Assuming it to be what is really meant, we have to ask, What changes of dynasty fall within the probable period of the Israelite sojourn in Egypt, and to which of them is it most likely that allusion is here made? Some writers (as Kalisch) have supposed the Hyksos dynasty to be meant, and the \"new king\" to be Set, or Salatis, the first of the Hyksos rulers. But the date of Salatis appears to us too early. If Joseph was, as we suppose, the minister of Apophis, the last Hyksos king, two changes of dynasty only can come into consideration - that which took place about  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 1700",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or, according to some,  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 1600",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), when the Hyksos were expelled; and that which followed about three centuries later, when the eighteenth dynasty was superseded by the nineteenth. To us it seems that the former of these occasions, though in many respects suitable, is ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(a)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " too near the going down into Egypt to allow time for the multiplication which evidently took place before this king arose (see ver. 7), and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(b)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " unsuitable from the circumstance that the first king of this dynasty was not a builder of new cities (see ver. 11), but only a repairer of temples. We therefore conclude that the \"new king\" was either Rameses I., the founder of the nineteenth dynasty, or Seti I., his son, who within little more than a year succeeded him. It is evident that this view receives much confirmation from the name of one of the cities built for the king by the Hebrews, which was Raamses, or Rameses, a name now appearing for the first time in the Egyptian dynastic lists. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who knew not Joseph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Who not only had no personal know]edge of Joseph, but was wholly ignorant of his history. At the distance of from two to three centuries the benefits conferred by Joseph upon Egypt, more especially as they were conferred under a foreign and hated dynasty, were forgotten. Exodus 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The promised blessing was manifested chiefly in the fact, that all the measures adopted by the cunning of Pharaoh to weaken and diminish the Israelites, instead of checking, served rather to promote their continuous increase.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Exodus 1:8-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:8-9",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"There arose a new king over Egypt, who knew not Joseph.\" ויּקם signifies he came to the throne, קוּם denoting his appearance in history, as in Deuteronomy 34:10. A \"new king\" (lxx: βασιλεὺς ἕτερος; the other ancient versions, rex novus) is a king who follows different principles of government from his predecessors. Cf. חדשׁים אלהים, \"new gods,\" in distinction from the God that their fathers had worshipped, Judges 5:8; Deuteronomy 32:17. That this king belonged to a new dynasty, as the majority of commentators follow Josephus",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"There arose a new king over Egypt, who knew not Joseph.\" ויּקם signifies he came to the throne, קוּם denoting his appearance in history, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 34:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A \"new king\" (lxx: βασιλεὺς ἕτερος; the other ancient versions, rex novus) is a king who follows different principles of government from his predecessors. Cf. חדשׁים אלהים, \"new gods,\" in distinction from the God that their fathers had worshipped, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That this king belonged to a new dynasty, as the majority of commentators follow Josephus",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Ant. ii. 9, 1. Τῆς βασιλέιας εἰς ἄλλον οἶκον μεταληλυθυΐ́ας.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in assuming, cannot be inferred with certainty from the predicate new; but it is very probable, as furnishing the readiest explanation of the change in the principles of government. The question itself, however, is of no direct importance in relation to theology, though it has considerable interest in connection with Egyptological researches.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The want of trustworthy accounts of the history of ancient Egypt and its rulers precludes the possibility of bringing this question to a decision. It is true that attempts have been made to mix it up in various ways with the statements which Josephus has transmitted from Manetho with regard to the rule of the Hyksos in Egypt (c. Ap. i. 14 and 26), and the rising up of the \"new king\" has been identified sometimes with the commencement of the Hyksos rule, and at other times with the return of the native dynasty on the expulsion of the Hyksos. But just as the accounts of the ancients with regard to the Hyksos bear throughout the stamp of very distorted legends and exaggerations, so the attempts of modern inquirers to clear up the confusion of these legends, and to bring out the historical truth that lies at the foundation of them all, have led to nothing but confused and contradictory hypotheses; so that the greatest Egyptologists of our own days, - viz., Lepsius, Bunsen, and Brugsch - differ throughout, and are even diametrically opposed to one another in their views respecting the dynasties of Egypt. Not a single trace of the Hyksos dynasty is to be found either in or upon the ancient monuments. The documental proofs of the existence of a dynasty of foreign kings, which the Vicomte de Roug thought that he had discovered in the Papyrus Sallier No. 1 of the British Museum, and which Brugsch pronounced \"an Egyptian document concerning the Hyksos period,\" have since then been declared untenable both by Brugsch and Lepsius, and therefore given up again. Neither Herodotus nor Diodorus Siculus heard anything at all about the Hyksos though the former made very minute inquiry of the Egyptian priests of Memphis and Heliopolis. And lastly, the notices of Egypt and its kings, which we meet with in Genesis and Exodus, do not contain the slightest intimation that there were foreign kings ruling there either in Joseph's or Moses' days, or that the genuine Egyptian spirit which pervades these notices was nothing more than the \"outward adoption\" of Egyptian customs and modes of thought. If we add to this the unquestionably legendary character of the Manetho accounts, there is always the greatest probability in the views of those inquirers who regard the two accounts given by Manetho concerning the Hyksos as two different forms of one and the same legend, and the historical fact upon which this legend was founded as being the 430 years' sojourn of the Israelites, which had been thoroughly distorted in the national interests of Egypt. - For a further expansion and defence of this view see Hvernick's Einleitung in d. A. T. i. 2, pp. 338ff., Ed. 2((Introduction to the Pentateuch, pp. 235ff. English translation).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The new king did not acknowledge Joseph, i.e., his great merits in relation to Egypt. ידע לא signifies here, not to perceive, or acknowledge, in the sense of not wanting to know anything about him, as in 1 Samuel 2:12, etc. In the natural course of things, the merits of Joseph might very well have been forgotten long before; for the multiplication of the Israelites into a numerous people, which had taken place in the meantime, is a sufficient proof that a very long time had elapsed since Joseph's death. At the same time such forgetfulness does not usually take place all at once, unless the account handed down has been intentionally obscured or suppressed. If the new king, therefore, did not know Joseph, the reason must simply have been, that he did not trouble himself about the past, and did not want to know anything about the measures of his predecessors and the events of their reigns. The passage is correctly paraphrased by Jonathan thus: non agnovit (חכּים) Josephum nec ambulavit in statutis ejus. Forgetfulness of Joseph brought the favour shown to the Israelites by the kings of Egypt to a close. As they still continued foreigners both in religion and customs, their rapid increase excited distrust in the mind of the king, and induced him to take steps for staying their increase and reducing their strength. The statement that \"the people of the children of Israel\" (ישׂראל בּני עם lit., \"nation, viz., the sons of Israel;\" for עם with the dist. accent is not the construct state, and ישראל בני is in apposition, cf. Ges. 113) were \"more and mightier\" than the Egyptians, is no doubt an exaggeration.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The new king did not acknowledge Joseph, i.e., his great merits in relation to Egypt. ידע לא signifies here, not to perceive, or acknowledge, in the sense of not wanting to know anything about him, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. In the natural course of things, the merits of Joseph might very well have been forgotten long before; for the multiplication of the Israelites into a numerous people, which had taken place in the meantime, is a sufficient proof that a very long time had elapsed since Joseph's death. At the same time such forgetfulness does not usually take place all at once, unless the account handed down has been intentionally obscured or suppressed. If the new king, therefore, did not know Joseph, the reason must simply have been, that he did not trouble himself about the past, and did not want to know anything about the measures of his predecessors and the events of their reigns. The passage is correctly paraphrased by Jonathan thus: non agnovit (חכּים) Josephum nec ambulavit in statutis ejus. Forgetfulness of Joseph brought the favour shown to the Israelites by the kings of Egypt to a close. As they still continued foreigners both in religion and customs, their rapid increase excited distrust in the mind of the king, and induced him to take steps for staying their increase and reducing their strength. The statement that \"the people of the children of Israel\" (ישׂראל בּני עם lit., \"nation, viz., the sons of Israel;\" for עם with the dist. accent is not the construct state, and ישראל בני is in apposition, cf. Ges. 113) were \"more and mightier\" than the Egyptians, is no doubt an exaggeration.",
            "children": []
          }
        ]
      }
    ]
  }
]