[{"num":8,"verse":"12 The anointing of Aaron, and his sons, with the sacrifice concerning the same."},{"num":1,"verse":"Afterward the Lord spake unto Moses, saying,"},{"num":2,"verse":"Take Aaron and his sons with him, and the garments, and the anointing oil, and a bullock for the sin offering, and two rams, and a basket of unleavened bread,"},{"num":3,"verse":"And assemble all the company at the door of the Tabernacle of the Congregation."},{"num":4,"verse":"So Moses did as the Lord had commanded him, and the company was assembled at the door of the Tabernacle of the Congregation."},{"num":5,"verse":"Then Moses said unto the company, This is the thing which the Lord hath commanded to do."},{"num":6,"verse":"And Moses brought Aaron and his sons, and washed them with water,"},{"num":7,"verse":"And put upon him the coat, and girded him with a girdle, and clothed him with the robe, and put the Ephod on him, which he girded with the broidered girdle of the Ephod, and bound it unto him therewith."},{"num":8,"verse":"And he put the breastplate thereon, and put in the breastplate the Urim and the Thummim."},{"num":9,"verse":"Also he put the miter upon his head, and put upon the miter on the forefront the golden plate, and the holy crown, as the Lord hath commanded Moses."},{"num":10,"verse":"(Now Moses had taken the anointing oil, and anointed the Tabernacle, and all that was therein, and sanctified them,"},{"num":11,"verse":"And sprinkled thereof upon the altar seven times, and anointed the altar and all his instruments, and the laver, and his foot, to sanctify them.)"},{"num":12,"verse":"And he poured of the anointing oil upon Aaron’s head, and anointed him to sanctify him."},{"num":13,"verse":"After, Moses brought Aaron’s sons, and put coats upon them, and girded them with girdles, and put bonnets upon their heads, as the Lord had commanded Moses."},{"num":14,"verse":" Then he brought the bullock for the sin offering, and Aaron and his sons put their hands upon the head of the bullock for the sin offering."},{"num":15,"verse":"And Moses slew him, and took the blood, which he put upon the horn of the Altar round about with his finger, and purified the altar, and poured the rest of the blood at the foot of the altar: so he sanctified it, to make reconciliation upon it."},{"num":16,"verse":"Then he took all the fat that was upon the inwards, and the caul of the liver, and the two kidneys with their fat, which Moses burned upon the altar."},{"num":17,"verse":"But the bullock and his hide, and his flesh, and his dung, he burnt with fire without the host as the Lord had commanded Moses."},{"num":18,"verse":"¶ Also he brought the ram for the burnt offering, and Aaron and his sons put their hands upon the head of the ram."},{"num":19,"verse":"So Moses killed it, and sprinkled the blood upon the altar round about,"},{"num":20,"verse":"And Moses cut the ram in pieces, and burnt the head with the pieces, and the fat,"},{"num":21,"verse":"And washed the inwards and the legs in water: so Moses burnt the ram every whit upon the Altar: for it was a burnt offering for a sweet savor, which was made by fire unto the Lord, as the Lord had commanded Moses."},{"num":22,"verse":"¶ After, he brought the other ram, the ram of consecrations, and Aaron and his sons laid their hands upon the head of the ram,"},{"num":23,"verse":"Which Moses slew, and took of the blood of it, and put it upon the lap of Aaron’s right ear, and upon the thumb of his right hand, and upon the great toe of his right foot."},{"num":24,"verse":"Then Moses brought Aaron’s sons, and put of the blood on the lap of their right ears, and upon the thumbs of their right hands, and upon the great toes of their right feet, and Moses sprinkled the rest of the blood upon the Altar round about."},{"num":25,"verse":"And he took the fat and the rump, and all the fat that was upon the inwards, and the caul of the liver, and the two kidneys with their fat, and the right shoulder."},{"num":26,"verse":"Also he took of the basket of the unleavened cake, and a cake of oiled bread, and one wafer, and put them on the fat, and upon the right shoulder."},{"num":27,"verse":"So he put all in Aaron’s hands, and in his sons’ hands, and shook it to and fro before the Lord."},{"num":28,"verse":"After, Moses took them out of their hands, and burnt them upon the altar for a burnt offering: for these were consecrations for a sweet savor, which were made by fire unto the Lord."},{"num":29,"verse":"Likewise Moses took the breast of the ram of consecrations, and shook it to and fro before the Lord: for it was Moses’ portion as the Lord had commanded Moses."},{"num":30,"verse":"Also Moses took of the anointing oil, and of the blood which was upon the Altar, and sprinkled it upon Aaron, upon his garments, and upon his sons, and on his sons’ garments with him: so he sanctified Aaron, his garments, and his sons, and his sons’ garments with him."},{"num":31,"verse":"¶ Afterward Moses said unto Aaron and his sons, Seethe the flesh at the door of the Tabernacle of the Congregation, and there eat it with the bread that is in the basket of consecrations, as I commanded, saying, Aaron and his sons shall eat it."},{"num":32,"verse":"But that which remaineth of the flesh and of the bread, shall ye burn with fire."},{"num":33,"verse":"And ye shall not depart from the door of the Tabernacle of the Congregation seven days, until the days of your consecrations be at an end: for seven days, said the Lord, shall he consecrate you,"},{"num":34,"verse":"As he hath done this day: so the Lord hath commanded to do, to make an atonement for you."},{"num":35,"verse":"Therefore shall ye abide at the door of the Tabernacle of the Congregation, day and night, seven days, and shall keep the watch of the Lord, that ye die not: for so I am commanded."},{"num":36,"verse":"So Aaron and his sons did all things which the Lord had commanded by thehand of Moses."}]