[{"header":"Chapter 8"},{"num":1,"verse":"Ordination of Aaron and His Sons. The Lord said to Moses: "},{"num":2,"verse":"Take Aaron along with his sons, the vestments, the anointing oil, the bull for a purification offering, the two rams, and the basket of unleavened bread, "},{"num":3,"verse":"then assemble the whole community at the entrance of the tent of meeting. "},{"num":4,"verse":"Moses did as the Lord had commanded. When the community had assembled at the entrance of the tent of meeting, "},{"num":5,"verse":"Moses told them: “This is what the Lord has ordered to be done.” "},{"num":6,"verse":"Bringing forward Aaron and his sons, Moses first washed them with water. "},{"num":7,"verse":"Then he put the tunic on Aaron, girded him with the sash, clothed him with the robe, placed the ephod on him, and girded him with the ephod’s embroidered belt, fastening the ephod on him with it. "},{"num":8,"verse":"He then set the breastpiece on him, putting the Urim and Thummim in it. "},{"num":9,"verse":"He put the turban on his head, attaching the gold medallion, the sacred headband, on the front of the turban, as the Lord had commanded Moses to do."},{"num":10,"verse":"Taking the anointing oil, Moses anointed and consecrated the tabernacle and all that was in it. "},{"num":11,"verse":"Then he sprinkled some of the oil seven times on the altar, and anointed the altar, with all its utensils, and the laver, with its base, to consecrate them. "},{"num":12,"verse":"He also poured some of the anointing oil on Aaron’s head and anointed him, to consecrate him. "},{"num":13,"verse":"Moses likewise brought forward Aaron’s sons, clothed them with tunics, girded them with sashes, and put skullcaps on them, as the Lord had commanded him to do."},{"num":14,"verse":"Ordination Sacrifices. He brought forward the bull for a purification offering, and Aaron and his sons laid their hands on its head. "},{"num":15,"verse":"When it was slaughtered, Moses took the blood and with his finger he put it on the horns around the altar, thus purifying the altar. He poured out the rest of the blood at the base of the altar. Thus he consecrated it so that atonement could be made on it. "},{"num":16,"verse":"Taking all the fat that was over the inner organs, as well as the lobe of the liver and the two kidneys with their fat, Moses burned them on the altar. "},{"num":17,"verse":"The bull, however, with its hide and flesh and dung he burned in the fire outside the camp, as the Lord had commanded Moses to do."},{"num":18,"verse":"He next brought forward the ram of the burnt offering, and Aaron and his sons laid their hands on its head. "},{"num":19,"verse":"When it was slaughtered, Moses splashed the blood on all sides of the altar. "},{"num":20,"verse":"After the ram was cut up into pieces, Moses burned the head, the cut-up pieces and the suet. "},{"num":21,"verse":"After the inner organs and the shanks were washed with water, Moses burned these remaining parts of the ram on the altar. It was a burnt offering for a sweet aroma, an oblation to the Lord, as the Lord had commanded Moses."},{"num":22,"verse":"Then he brought forward the second ram, the ordination ram, and Aaron and his sons laid their hands on its head. "},{"num":23,"verse":"When it was slaughtered, Moses took some of its blood and put it on the lobe of Aaron’s right ear, on the thumb of his right hand, and on the big toe of his right foot. "},{"num":24,"verse":"Moses had the sons of Aaron also come forward, and he put some of the blood on the lobes of their right ears, on the thumbs of their right hands, and on the big toes of their right feet. The rest of the blood he splashed on all the sides of the altar. "},{"num":25,"verse":"He then took the fat: the fatty tail and all the fat over the inner organs, the lobe of the liver and the two kidneys with their fat, and likewise the right thigh; "},{"num":26,"verse":"from the basket of unleavened bread that was set before the Lord he took one unleavened cake, one loaf of bread made with oil, and one wafer; these he placed on top of the portions of fat and the right thigh. "},{"num":27,"verse":"He then put all these things upon the palms of Aaron and his sons, whom he had raise them as an elevated offering before the Lord. "},{"num":28,"verse":"When Moses had removed them from their palms, he burned them on the altar with the burnt offering. They were an ordination offering for a sweet aroma, an oblation to the Lord. "},{"num":29,"verse":"He then took the brisket and raised it as an elevated offering before the Lord; this was Moses’ own portion of the ordination ram, as the Lord had commanded Moses. "},{"num":30,"verse":"Taking some of the anointing oil and some of the blood that was on the altar, Moses sprinkled it upon Aaron and his vestments, as well as his sons and their vestments, thus consecrating both Aaron and his vestments and his sons and their vestments."},{"num":31,"verse":"Moses said to Aaron and his sons, “Boil the meat at the entrance of the tent of meeting, and there eat it with the bread that is in the basket of the ordination offering, in keeping with the command I have received: ‘Aaron and his sons shall eat of it.’ "},{"num":32,"verse":"What is left over of the meat and the bread you shall burn in the fire. "},{"num":33,"verse":"Moreover, you are not to depart from the entrance of the tent of meeting for seven days, until the days of your ordination are completed; for your ordination is to last for seven days. "},{"num":34,"verse":"What has been done today the Lord has commanded be done, to make atonement for you. "},{"num":35,"verse":"You must remain at the entrance of the tent of meeting day and night for seven days, carrying out the prescriptions of the Lord, so that you do not die, for this is the command I have received.” "},{"num":36,"verse":"So Aaron and his sons did all that the Lord had commanded through Moses."}]