[[],[{"type":"header","content":"The Rites of Ordination"},{"type":"prose","content":"The  spoke to Moses, saying: "}],[{"type":"prose","content":"Take Aaron and his sons with him, the vestments, the anointing oil, the bull of sin offering, the two rams, and the basket of unleavened bread; "}],[{"type":"prose","content":"and assemble the whole congregation at the entrance of the tent of meeting. "}],[{"type":"prose","content":"And Moses did as the  commanded him. When the congregation was assembled at the entrance of the tent of meeting, "}],[{"type":"prose","content":"Moses said to the congregation, “This is what the  has commanded to be done.”"}],[{"type":"prose","content":"Then Moses brought Aaron and his sons forward, and washed them with water. "}],[{"type":"prose","content":"He put the tunic on him, fastened the sash around him, clothed him with the robe, and put the ephod on him. He then put the decorated band of the ephod around him, tying the ephod to him with it. "}],[{"type":"prose","content":"He placed the breastpiece on him, and in the breastpiece he put the Urim and the Thummim. "}],[{"type":"prose","content":"And he set the turban on his head, and on the turban, in front, he set the golden ornament, the holy crown, as the  commanded Moses."}],[{"type":"prose","content":"Then Moses took the anointing oil and anointed the tabernacle and all that was in it, and consecrated them. "}],[{"type":"prose","content":"He sprinkled some of it on the altar seven times, and anointed the altar and all its utensils, and the basin and its base, to consecrate them. "}],[{"type":"prose","content":"He poured some of the anointing oil on Aaron’s head and anointed him, to consecrate him. "}],[{"type":"prose","content":"And Moses brought forward Aaron’s sons, and clothed them with tunics, and fastened sashes around them, and tied headdresses on them, as the  commanded Moses."}],[{"type":"prose","content":"He led forward the bull of sin offering; and Aaron and his sons laid their hands upon the head of the bull of sin offering, "}],[{"type":"prose","content":"and it was slaughtered. Moses took the blood and with his finger put some on each of the horns of the altar, purifying the altar; then he poured out the blood at the base of the altar. Thus he consecrated it, to make atonement for it. "}],[{"type":"prose","content":"Moses took all the fat that was around the entrails, and the appendage of the liver, and the two kidneys with their fat, and turned them into smoke on the altar. "}],[{"type":"prose","content":"But the bull itself, its skin and flesh and its dung, he burned with fire outside the camp, as the  commanded Moses."}],[{"type":"prose","content":"Then he brought forward the ram of burnt offering. Aaron and his sons laid their hands on the head of the ram, "}],[{"type":"prose","content":"and it was slaughtered. Moses dashed the blood against all sides of the altar. "}],[{"type":"prose","content":"The ram was cut into its parts, and Moses turned into smoke the head and the parts and the suet. "}],[{"type":"prose","content":"And after the entrails and the legs were washed with water, Moses turned into smoke the whole ram on the altar; it was a burnt offering for a pleasing odor, an offering by fire to the , as the  commanded Moses."}],[{"type":"prose","content":"Then he brought forward the second ram, the ram of ordination. Aaron and his sons laid their hands on the head of the ram, "}],[{"type":"prose","content":"and it was slaughtered. Moses took some of its blood and put it on the lobe of Aaron’s right ear and on the thumb of his right hand and on the big toe of his right foot. "}],[{"type":"prose","content":"After Aaron’s sons were brought forward, Moses put some of the blood on the lobes of their right ears and on the thumbs of their right hands and on the big toes of their right feet; and Moses dashed the rest of the blood against all sides of the altar. "}],[{"type":"prose","content":"He took the fat—the broad tail, all the fat that was around the entrails, the appendage of the liver, and the two kidneys with their fat—and the right thigh. "}],[{"type":"prose","content":"From the basket of unleavened bread that was before the , he took one cake of unleavened bread, one cake of bread with oil, and one wafer, and placed them on the fat and on the right thigh. "}],[{"type":"prose","content":"He placed all these on the palms of Aaron and on the palms of his sons, and raised them as an elevation offering before the . "}],[{"type":"prose","content":"Then Moses took them from their hands and turned them into smoke on the altar with the burnt offering. This was an ordination offering for a pleasing odor, an offering by fire to the . "}],[{"type":"prose","content":"Moses took the breast and raised it as an elevation offering before the ; it was Moses’ portion of the ram of ordination, as the  commanded Moses."}],[{"type":"prose","content":"Then Moses took some of the anointing oil and some of the blood that was on the altar and sprinkled them on Aaron and his vestments, and also on his sons and their vestments. Thus he consecrated Aaron and his vestments, and also his sons and their vestments."}],[{"type":"prose","content":"And Moses said to Aaron and his sons, “Boil the flesh at the entrance of the tent of meeting, and eat it there with the bread that is in the basket of ordination offerings, as I was commanded, ‘Aaron and his sons shall eat it’; "}],[{"type":"prose","content":"and what remains of the flesh and the bread you shall burn with fire. "}],[{"type":"prose","content":"You shall not go outside the entrance of the tent of meeting for seven days, until the day when your period of ordination is completed. For it will take seven days to ordain you; "}],[{"type":"prose","content":"as has been done today, the  has commanded to be done to make atonement for you. "}],[{"type":"prose","content":"You shall remain at the entrance of the tent of meeting day and night for seven days, keeping the ’s charge so that you do not die; for so I am commanded.” "}],[{"type":"prose","content":"Aaron and his sons did all the things that the  commanded through Moses."}]]