[{"num":35,"verse":"The Midbar (desert) and the Tziyyah (dry land) shall be glad over them [the redeemed of Hashem, see 35:9]; and the Aravah shall rejoice, and blossom like the khavatzelet (lily)."},{"num":2,"verse":"It shall bloom abundantly, and rejoice even with gilat (rejoicing) and rannein (joyous singing); the kavod haLevanon (glory of Lebanon) shall be given unto her (the Aravah), the hadar (majesty) of Carmel and Sharon; they [i.e., the desert and dry land in v.1] shall see the Kavod Hashem (glory of Hashem), and the Hadar Eloheinu (majesty of our G-d)."},{"num":3,"verse":"Make ye the weak hands chazak (strong), and steady the birkayim (knees) koshlot (feeble ones [knees] that give way, i.e., of those of the Golus returning to G-d in Tziyon)."},{"num":4,"verse":"Say to them that are of a fearful lev, Be strong, fear not; hinei, Eloheichem (your G-d) will come with nakam (vengeance), even Elohim gemul (divine retribution); He will come and save you."},{"num":5,"verse":"Then the eyes of the ivvrim (blind people) shall be opened, and the ears of the chereshim (deaf ones) shall be unstopped."},{"num":6,"verse":"Then shall the pisei’ach (lame) leap like the deer, and the leshon (tongue) of the illem (the mute, the people unable to utter speech) sing for joy; for in the midbar shall mayim break forth, and streams in the Aravah."},{"num":7,"verse":"And the sharav (burning sand) shall become an agam (pool, lake, pond) and the thirsty land, springs of mayim; in the habitation of jackals, where each [jackal] lay, shall be khatzir (grassland) as well as reeds and gomeh (papyrus, bulrushes)."},{"num":8,"verse":"And a maslul (highway) shall be there, and a derech (road), and it shall be called The Derech HaKodesh (The Holy Road); the tameh (unclean, impure person [see Isa 26:7]) shall not pass along it, inasmuch as it shall be for them; that is, the Holech Derech (Walker of the Road, i.e., whoever is the [Redeemed] Wayfarer on the Derech HaKodesh), even evilim (morally bad foolish people) shall not go astray thereon."},{"num":9,"verse":"No aryeh (lion) shall be there, nor any peritz chayyot (ravenous, dangerous, ferocious of [wild] beasts) shall go up thereon, it shall not be found there; but the Ge’ulim (redeemed people) shall walk there;"},{"num":10,"verse":"And the Peduyei Hashem (ransomed ones of Hashem) shall return, and come to Tziyon with songs and simchat olam (everlasting joy) upon their heads; they shall obtain sasson (joy) and simchah (gladness), and sorrow and sighing shall flee away."}]