[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Was minded.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it became with the heart of Joash",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 6:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To repair.—See margin to 2Chronicles 15:8. “To restore” is perhaps the best modern equivalent of the Hebrew term. The account of the restoration of the Temple is given here in different language from what we find in the parallel passage, which is not very clear.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "To repair.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—See margin ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "to",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 15:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". “To restore” is perhaps the best modern equivalent of the Hebrew term. The account of the restoration of the Temple is given here in different language from what we find in the parallel passage, which is not very clear.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The chronicler appears to have paraphrased the account he found in his authority. The Levites are not mentioned in Kings.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The chronicler appears to have paraphrased the account he found in his authority. The ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Levites",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are not mentioned in Kings.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2 Chronicles",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "GLAD GIVERS AND FAITHFUL WORKERS2 Chronicles 24:4 - 2 Chronicles 24:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "GLAD GIVERS AND FAITHFUL WORKERS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 24:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 24:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Joash owed his life and his throne to the high-priest Jehoiada, who was his uncle by marriage with the sister of Ahaziah, his father. Rescued by his aunt when an infant, he ‘was with them, hid in the house of God six years,’ and, when seven years old, was made king by Jehoiada’s daring revolt against ‘that wicked woman,’ Athaliah. Jehoiada’s influence was naturally paramount, and was as wholesome as strong. It is remarkable, however, that this impulse to repair the Temple seems to have originated with the king, not with the high-priest, though no doubt the spirit which conceived the impulse was largely moulded by the latter. The king, whose childhood had found a safe asylum in the Temple, might well desire its restoration, even apart from considerations of religion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The story first brings into strong contrast the eager king, full of his purpose, and the sluggards to whom he had to entrust its execution. We can only guess the point in his reign at which Joash summoned the priests to his help. It was after his marriage {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 24:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, and considerably before the twenty-third year of his reign, at which time his patience was exhausted {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. Some years were apparently wasted by the dawdling sluggishness of the priests, who, for some reason or other, did not go into the proposed restoration heartily. Joash seems to have suspected that they would push the work languidly; for there is a distinct tinge of suspicion and ‘whipping up’ in his injunction to ‘hasten the matter.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The first intention was to raise the funds by sending out the priests and Levites to collect locally the statutory half-shekel, as well as other contributions mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 12:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There we learn that each collector was to go to ‘his acquaintance.’ The subscription was to be spread over some years, and for a while Joash waited quietly; but in the twenty-third year of his reign {see 2 Kings}, he could stand delay no longer. Whether the priests had been diligent in collecting or not, they had done nothing towards repairing. Perhaps they found it difficult to determine the proportion of the money which was needed for the ordinary expenses of worship, and for the restoration fund; and, as the former included their own dues and support, they would not be likely to set it down too low. Perhaps they did not much care to carry out a scheme which had not begun with themselves; for priests are not usually eager to promote ecclesiastical renovations suggested by laymen. Perhaps they did not care as much about the renovation as the king did, and smiled at his earnestness as a pious imagining. Possibly there was even deliberate embezzlement. But, at any rate, there was half-heartedness, and that always means languid work, and that always means failure. The earnest people are fretted continually by the indifferent. Every good scheme is held back, like a ship with a foul bottom, by the barnacles that stick to its keel and bring down its speed. Professional ecclesiastics in all ages have succumbed to the temptation of thinking that ‘church property’ was first of all to be used for their advantage, and, secondarily, for behoof of God’s house. Eager zeal has in all ages to be yoked to torpid indifference, and to drag its unwilling companion along, like two dogs in a leash. Direct opposition is easier to bear than apparent assistance which tries to slow down to half speed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Joash’s command is imperative on all workers for God. ‘See that ye hasten the matter,’ for time is short, the fruit great, the evening shadows lengthening, the interests at stake all-important, and the Lord of the harvest will soon come to count our sheaves. Whatever work may be done without haste, God’s cannot be, and a heavy curse falls on him who ‘does the work of the Lord negligently.’ The runner who keeps well on this side of fatigue, panting, and sweat, has little chance of the crown.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The next step is the withdrawal of the work from the sluggards. They are relieved both of the collection and expenditure of the money. Apparently {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} the contributors handed their donations to the doorkeepers, who put them into the chest with ‘a hole in the lid of it,’ in the sight of the donors. The arrangement was not flattering to the hierarchy, but as appearances were saved by Jehoiada’s making the chest {see 2 Kings} they had to submit with the best grace they could. In our own times, we have seen the same thing often enough. When clergy have maladministered church property, Parliament has appointed ecclesiastical commissioners. Common sense prescribes taking slovenly work out of lazy hands. The more rigidly that principle is carried out in the church and the nation, at whatever cost of individual humiliation, the better for both. ‘The tools to the hands that can use them’ is the ideal for both. God’s dealings follow the same law, both in withdrawing opportunities of service and in giving more of such. The reward for work is more work, and the punishment for sloth is compulsory idleness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " III. We are next shown the glad givers. Probably suspicion had been excited in others than the king, and had checked liberality. People will not give freely if the expenses of the collectors’ support swallow up the funds. It is hard to get help for a vague scheme, which unites two objects, and only gives the balance, after the first is provided for, to the second and more important. So the whole nation, both high and low, was glad when the new arrangement brought a clear issue, and secured the right appropriation of the money.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " No doubt, too, Joash’s earnestness kindled others. Chronicles speaks only of the ‘tax,’-that is, the half-shekel,-but Kings mentions two other sources, one of which is purely spontaneous gifts, and these are implied by the tone of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 24:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which lays stress on the gladness of the offerers. That is the incense which adds fragrance to our gifts. Grudging service is no service, and money given for ever so religious a purpose, without gladness because of the opportunity of giving, is not, in the deepest sense, given at all. Love is a longing to give to the beloved, and whoever truly loves God will know no keener delight than surrender for His dear sake. Pecuniary contributions for religious purposes afford a rough but real test of the depth of a man’s religion; but it is one available only for himself, since the motive, and not the amount, is the determining element. We all need to bring our hearts more under the Influence of God’s love to us, that our love to Him may be increased, and then to administer possessions, under the impulse to glad giving which enkindled love will always excite. Super-heated steam has most expansive power and driving force. These glad givers may remind us not only of the one condition of acceptable giving, but also of the need for clear and worthy objects, and of obvious disinterestedness in those who seek for money to help good causes. The smallest opening for suspicion that some of it sticks to the collector’s fingers is fatal, as it should be.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Joash was evidently a business-like king. We next hear of the precautions he took to secure the public confidence. There was a rough but sufficient audit. When the chest grew heavy, and sounded full, two officials received it at the ‘king’s office.’ The Levites carried it there, but were not allowed to handle the contents. The two tellers represented the king and the chief priest, and thus both the civil and religious authorities were satisfied, and each officer was a check on the other. Public money should never be handled by a man alone; and an honest one will always wish, like Paul, to have a brother associated with him, that no man may blame him in his administration of it. If we take ‘day by day’ literally, we have a measure of the liberality which filled the chest daily; but, more probably, the expression simply means ‘from time to time,’ when occasion required.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The application of the money is next narrated. In this Jehoiada is associated with Joash, the king probably desiring to smooth over any slight that might seem to have been put on the priests, as well as being still under the influence of the high-priest’s strong character and early kindness. Together they passed over the results of the contribution to the contractors, who in turn paid it in wages to the workmen who repaired the fabric, such as masons and carpenters, and to other artisans who restored other details, such as brass and iron work. The Second Book of Kings tells us that Joash’s cautious provision against misappropriation seems to have deserted him at this stage; for no account was required of the workmen, ‘for they dealt faithfully.’ That is an indication of their goodwill. The humble craftsmen were more reliable than the priests. They had, no doubt, given their half-shekel like others, and now they gladly gave their work, and were not hirelings, though they were hired. We, too, have to give our money and our labour; and if our hearts are right, we shall give both with the same conscientious cheerfulness, and, if we are paid in coin for our work, will still do it for higher reasons and looking for other wages. These Temple workmen may stand as patterns of what religion should do for those of us whose lot is to work with our hands,-and not less for others who have to toil with their brains, and the sweat of whose brow is inside their heads. A Christian workman should be a ‘faithful’ workman, and will be so if he is full of faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Joash knew when to trust and when to keep a sharp eye on men. His experience with the priests had not soured him into suspecting everybody. Cynical disbelief in honesty is more foolish and hurtful to ourselves than even excessive trust. These workmen wrought all the more faithfully because they knew that they were trusted, and in nine cases out of ten men will try to live up to our valuation of them. The Rugby boys used to say, ‘It’s a shame to tell Arnold a lie, he always believes us.’ Better to be cheated once than to treat the nine as rogues,-better for them and better for ourselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Faithful’ work is prosperous work. As ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 24:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " picturesquely says, ‘Healing went up upon the work’; and the Temple was restored to its old fair proportions, and stood strong as before. Where there is conscientious effort, God’s blessing is not withheld. Labour ‘in the Lord’ can never be empty labour, though even a prophet may often be tempted, in a moment of weary despondency, to complain, ‘I have laboured in vain.’ We may not see the results, nor have the workmen’s joy of beholding the building rise, course by course, under our hands, but we shall see it one day, though now we have to work in the dark.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There seems a discrepancy between the statements in Chronicles and Kings as to the source from which the cost of the sacrificial vessels was defrayed, since, according to the former, it was from the restoration fund, which is expressly denied by the latter. The explanation seems reasonable, that, as Chronicles says, it was from the balance remaining after all restoration charges were liquidated, that this other expenditure was met. First, the whole amount was sacredly devoted to the purpose for which it had been asked, and then, when the honest overseers repaid the uncounted surplus, which they might have kept, it was found sufficient to meet the extra cost of furnishing. God blesses the faithful steward of his gifts with more than enough for the immediate service, and the best use of the surplus is to do more with it for Him. ‘God is able to make all grace abound unto you; that ye, having always all sufficiency in every thing, may abound unto every good work, . . . being enriched in every thing unto all liberality.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:1-14 Joash is more zealous about the repair of the temple than Jehoiada himself. It is easier to build temples, than to be temples to God. But the repairing of places for public worship is a good work, which all should promote. And many a good work would be done that now lies undone, if active men would put it forward.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Athaliah's destruction of the seed royal had left Joash without a natural successor, and his marriage at the earliest suitable age, was, therefore, a matter of state policy. One of his wives in question was probably \"Jehoaddan of Jerusalem,\" the mother of Amaziah ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 25:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", who must have been taken to wife by Joash as early as his 21st year. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4-14. Joash was minded to repair the house of the Lord—(See on [451]2Ki 12:4-16).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it came to pass after this,.... After his marriage, when he was about twenty or twenty one years of age, perhaps: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that Joash was minded to repair the house of the Lord; which in some places might be fallen to decay, having been built one hundred and fifty years or more, and in others defaced by Athaliah, and needed ornamenting, see 2 Kings 12:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that Joash was minded to repair the house of the Lord; which in some places might be fallen to decay, having been built one hundred and fifty years or more, and in others defaced by Athaliah, and needed ornamenting, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it came to pass after this, that Joash was minded to repair the house of the LORD.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4–14 (= ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 12:4-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Restoration of the Temple",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to repair",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to restore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Heb. “to renew.” Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 24:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To repair",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The idea of this verb (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "חָדַשׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is that of making new. 2 Chronicles 24:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As to the repair of the temple, see the commentary on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 12:5-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where both the formal divergences and the essential agreement of the two narratives are pointed out. ",
        "children": []
      }
    ]
  }
]