[{"num":7,"verse":"Entreating here of marriage, 4 which is a remedy against fornication, 10 and may not be broken,  18, 20 he willeth every man to live contented with his lot.  25 He showeth what the end of virginity should be, 35 and who ought to marry."},{"num":1,"verse":"Now concerning the things whereof ye wrote unto me, It were good for a man not to touch a woman."},{"num":2,"verse":"Nevertheless, to avoid fornication, let every man have his wife, and let every woman have her own husband."},{"num":3,"verse":"Let the husband give unto the wife due benevolence, and likewise also the wife unto the husband."},{"num":4,"verse":"The wife hath not the power of her own body, but the husband: and likewise also the husband hath not the power of his own body, but the wife."},{"num":5,"verse":"Defraud not one another, except it be with consent for a time, that ye may give yourselves to fasting and prayer, and again come together, that Satan tempt you not for your incontinency."},{"num":6,"verse":"But I speak this by permission, not by commandment."},{"num":7,"verse":"For I would that all men were even as I myself am: but every man hath his proper gift of God, one after this manner, and another after that."},{"num":8,"verse":"Therefore I say unto the unmarried, and unto the widows, It is good for them if they abide even as I do."},{"num":9,"verse":"But if they cannot abstain, let them marry: for it is better to marry than to burn."},{"num":10,"verse":"And unto the married I command, not I, but the Lord, Let not the wife depart from her husband."},{"num":11,"verse":"But and if she depart, let her remain unmarried, or be reconciled unto her husband, and let not the husband put away his wife."},{"num":12,"verse":"But to the remnant I speak, and not the Lord, If any brother have a wife that believeth not, if she be content to dwell with him, let him not forsake her."},{"num":13,"verse":"And the woman which hath an husband that believeth not, if he be content to dwell with her, let her not forsake him."},{"num":14,"verse":"For the unbelieving husband is sanctified to the wife, and the unbelieving wife is sanctified to the husband, else were your children unclean: but now are they holy."},{"num":15,"verse":"But if the unbelieving depart, let him depart: a brother or a sister is not in subjection in such things: but God hath called us in peace."},{"num":16,"verse":"For what knowest thou, O wife, whether thou shalt save thine husband? Or what knowest thou, O man, whether thou shalt save thy wife?"},{"num":17,"verse":"But as God hath distributeth to every man, as the Lord hath called every one, so let him walk: and so ordain I in all Churches."},{"num":18,"verse":"Is any man called being circumcised? let him not gather his uncircumcision: is any called uncircumcised? let him not be circumcised."},{"num":19,"verse":"Circumcision is nothing, and uncircumcision is nothing, but the keeping of the commandments of God."},{"num":20,"verse":"Let every man abide in the same vocation wherein he was called."},{"num":21,"verse":"Art thou called being a servant? care not for it: but if yet thou mayest be free, use it rather."},{"num":22,"verse":"For he that is called in the Lord, being a servant, is the Lord’s freeman: likewise also he that is called being free, is Christ’s servant."},{"num":23,"verse":"Ye are bought with a price: be not the servants of men."},{"num":24,"verse":"Brethren, let every man, wherein he was called, therein abide with God."},{"num":25,"verse":"Now concerning virgins, I have no commandment of the Lord: but I give mine advise, as one that hath obtained mercy of the Lord to be faithful."},{"num":26,"verse":"I suppose then this to be good for the present necessity: I mean that it is good for a man so to be."},{"num":27,"verse":"Art thou bound unto a wife? seek not to be loosed: art thou loosed from a wife? seek not a wife."},{"num":28,"verse":"But if thou takest a wife, thou sinnest not: and if a virgin marry, she sinneth not: nevertheless, such shall have trouble in the flesh: but I spare you."},{"num":29,"verse":"And this I say, brethren, because the time is short, hereafter that both they which have wives, be as though they had none:"},{"num":30,"verse":"And they that weep, as though they wept not: and they that rejoice, as though they rejoiced not: and they that buy, as though they possessed not:"},{"num":31,"verse":"And they that use this world, as though they used it not: for the fashion of this world goeth away."},{"num":32,"verse":"And I would have you without care. The unmarried careth for things of the Lord, how he may please the Lord."},{"num":33,"verse":"But he that is married, careth for the things of the world, how he may please his wife."},{"num":34,"verse":"There is difference also between a virgin and a wife: the unmarried woman careth for the things of the Lord, that she may be holy, both in body and in spirit: but she that is married, careth for the things of the world, how she may please her husband."},{"num":35,"verse":"And this I speak for your own commodity, not to tangle you in a snare, but that ye follow that which is honest, and that ye may cleave fast unto the Lord without separation."},{"num":36,"verse":"But if any man think that it is uncomely for his virgin, if she pass the flower of her age, and need so require, let him do what he will, he sinneth not: let them be married."},{"num":37,"verse":"Nevertheless, he that standeth firm in his heart, that he hath no need, but hath power over his own will, and hath so decreed in his heart, that he will keep his virgin, he doeth well."},{"num":38,"verse":"So then he that giveth her to marriage, doeth well, but he that giveth her not to marriage, doeth better."},{"num":39,"verse":"The wife is bound by the law, as long as her husband liveth: but if her husband be dead, she is at liberty to marry with whom she will, only in the Lord."},{"num":40,"verse":"But she is more blessed, if she so abide in my judgment: and I think that I have also the Spirit of God."}]