[{"header":"Directions concerning Marriage"},{"num":7,"verse":"Now concerning the matters about which you wrote: ‘It is well for a man not to touch a woman.’ "},{"num":2,"verse":"But because of cases of sexual immorality, each man should have his own wife and each woman her own husband. "},{"num":3,"verse":"The husband should give to his wife her conjugal rights, and likewise the wife to her husband. "},{"num":4,"verse":"For the wife does not have authority over her own body, but the husband does; likewise the husband does not have authority over his own body, but the wife does. "},{"num":5,"verse":"Do not deprive one another except perhaps by agreement for a set time, to devote yourselves to prayer, and then come together again, so that Satan may not tempt you because of your lack of self-control. "},{"num":6,"verse":"This I say by way of concession, not of command. "},{"num":7,"verse":"I wish that all were as I myself am. But each has a particular gift from God, one having one kind and another a different kind."},{"num":8,"verse":"To the unmarried and the widows I say that it is well for them to remain unmarried as I am. "},{"num":9,"verse":"But if they are not practising self-control, they should marry. For it is better to marry than to be aflame with passion."},{"num":10,"verse":"To the married I give this command—not I but the Lord—that the wife should not separate from her husband "},{"num":11,"verse":"(but if she does separate, let her remain unmarried or else be reconciled to her husband), and that the husband should not divorce his wife."},{"num":12,"verse":"To the rest I say—I and not the Lord—that if any believer has a wife who is an unbeliever, and she consents to live with him, he should not divorce her. "},{"num":13,"verse":"And if any woman has a husband who is an unbeliever, and he consents to live with her, she should not divorce him. "},{"num":14,"verse":"For the unbelieving husband is made holy through his wife, and the unbelieving wife is made holy through her husband. Otherwise, your children would be unclean, but as it is, they are holy. "},{"num":15,"verse":"But if the unbelieving partner separates, let it be so; in such a case the brother or sister is not bound. It is to peace that God has called you. "},{"num":16,"verse":"Wife, for all you know, you might save your husband. Husband, for all you know, you might save your wife."},{"header":"The Life That the Lord Has Assigned"},{"num":17,"verse":"However that may be, let each of you lead the life that the Lord has assigned, to which God called you. This is my rule in all the churches. "},{"num":18,"verse":"Was anyone at the time of his call already circumcised? Let him not seek to remove the marks of circumcision. Was anyone at the time of his call uncircumcised? Let him not seek circumcision. "},{"num":19,"verse":"Circumcision is nothing, and uncircumcision is nothing; but obeying the commandments of God is everything. "},{"num":20,"verse":"Let each of you remain in the condition in which you were called."},{"num":21,"verse":"Were you a slave when called? Do not be concerned about it. Even if you can gain your freedom, make use of your present condition now more than ever. "},{"num":22,"verse":"For whoever was called in the Lord as a slave is a freed person belonging to the Lord, just as whoever was free when called is a slave of Christ. "},{"num":23,"verse":"You were bought with a price; do not become slaves of human masters. "},{"num":24,"verse":"In whatever condition you were called, brothers and sisters, there remain with God."},{"header":"The Unmarried and the Widows"},{"num":25,"verse":"Now concerning virgins, I have no command of the Lord, but I give my opinion as one who by the Lord’s mercy is trustworthy. "},{"num":26,"verse":"I think that, in view of the impending crisis, it is well for you to remain as you are. "},{"num":27,"verse":"Are you bound to a wife? Do not seek to be free. Are you free from a wife? Do not seek a wife. "},{"num":28,"verse":"But if you marry, you do not sin, and if a virgin marries, she does not sin. Yet those who marry will experience distress in this life, and I would spare you that. "},{"num":29,"verse":"I mean, brothers and sisters, the appointed time has grown short; from now on, let even those who have wives be as though they had none, "},{"num":30,"verse":"and those who mourn as though they were not mourning, and those who rejoice as though they were not rejoicing, and those who buy as though they had no possessions, "},{"num":31,"verse":"and those who deal with the world as though they had no dealings with it. For the present form of this world is passing away."},{"num":32,"verse":"I want you to be free from anxieties. The unmarried man is anxious about the affairs of the Lord, how to please the Lord; "},{"num":33,"verse":"but the married man is anxious about the affairs of the world, how to please his wife, "},{"num":34,"verse":"and his interests are divided. And the unmarried woman and the virgin are anxious about the affairs of the Lord, so that they may be holy in body and spirit; but the married woman is anxious about the affairs of the world, how to please her husband. "},{"num":35,"verse":"I say this for your own benefit, not to put any restraint upon you, but to promote good order and unhindered devotion to the Lord."},{"num":36,"verse":"If anyone thinks that he is not behaving properly towards his fiancée, if his passions are strong, and so it has to be, let him marry as he wishes; it is no sin. Let them marry. "},{"num":37,"verse":"But if someone stands firm in his resolve, being under no necessity but having his own desire under control, and has determined in his own mind to keep her as his fiancée, he will do well. "},{"num":38,"verse":"So then, he who marries his fiancée does well; and he who refrains from marriage will do better."},{"num":39,"verse":"A wife is bound as long as her husband lives. But if the husband dies, she is free to marry anyone she wishes, only in the Lord. "},{"num":40,"verse":"But in my judgement she is more blessed if she remains as she is. And I think that I too have the Spirit of God."}]