[[],[{"type":"header","content":"Caleb’s Request"},{"type":"prose","content":"Now these are  which the tribes of Israel inherited in the land of Canaan, which Eleazar the priest, and Joshua the son of Nun, and the heads of the households of the tribes of Israel apportioned to them as an inheritance, "}],[{"type":"prose","content":"by the lot of their inheritance, as the LORD had commanded through Moses, for the nine tribes and the half-tribe. "}],[{"type":"prose","content":"For Moses had given an inheritance to the two tribes and the half-tribe beyond the Jordan; but he did not give [any territory as] an inheritance to the Levites among them. "}],[{"type":"prose","content":"For the sons of Joseph were two tribes, Manasseh and Ephraim, and no portion was given in the land to the Levites except cities in which to live, with their pasture lands for their livestock and for their property. "}],[{"type":"prose","content":"The Israelites did just as the LORD had commanded Moses, and they divided the land."}],[{"type":"prose","content":"Then the [tribe of the] sons of Judah approached Joshua in Gilgal, and Caleb the son of Jephunneh the Kenizzite said to him, “You know the word which the LORD said to Moses the man of God concerning me and you in Kadesh-barnea. "}],[{"type":"prose","content":"I was forty years old when Moses the servant of the LORD sent me from Kadesh-barnea to scout the land [of Canaan], and I brought a report back to him as it was in my heart. "}],[{"type":"prose","content":"My brothers (fellow spies) who went up with me made the heart of the people melt with fear; but I followed the LORD my God completely. "}],[{"type":"prose","content":"So Moses swore [an oath to me] on that day, saying, ‘Be assured that the land on which your foot has walked will be an inheritance to you and to your children always, because you have followed the LORD my God completely.’ "}],[{"type":"prose","content":"And now, look, the LORD has let me live, just as He said, these forty-five years since the LORD spoke this word to Moses, when Israel wandered in the wilderness; and now, look at me, I am eighty-five years old today. "}],[{"type":"prose","content":"I am still as strong today as I was the day Moses sent me; as my strength was then, so is my strength now, for war and for going out and coming in. "}],[{"type":"prose","content":"So now, give me this hill country about which the LORD spoke that day, for you heard on that day that the [giant-like] Anakim were there, with great fortified cities; perhaps the LORD will be with me, and I shall drive them out just as the LORD said.”"}],[{"type":"prose","content":"So Joshua blessed him and gave Hebron to Caleb the son of Jephunneh as an inheritance. "}],[{"type":"prose","content":"Therefore, Hebron became the inheritance of Caleb the son of Jephunneh the Kenizzite to this day, because he followed the LORD, the God of Israel, completely. "}],[{"type":"prose","content":"The name of Hebron was formerly Kiriath-arba [city of Arba];  was the greatest man among the [giant-like] Anakim. Then the land had rest from war."}]]