[{"num":57,"verse":"To the victory, lose thou not the seemly song, either the sweet song, of David, when he fled from the face of Saul into the den. God, have mercy on me, have thou mercy on me; for my soul trusteth in thee. And I shall hope in the shadow of thy wings; till wickedness pass. (To victory, destroy thou not the comely song, or the sweet song, of David, when he fled from the face of Saul into the cave. God, have mercy on me, have thou mercy on me; for my soul trusteth in thee. And I shall trust in the shadow of thy wings, until all wickedness pass by.)"},{"num":2,"verse":"I shall cry to God alder-highest; to God that did well to me. (I shall cry to the Most High God; to God who did so much good for me.)"},{"num":3,"verse":"He sent from heaven, and delivered me; he gave into shame them that defoul me. God sent his mercy and his truth, (He sent from heaven, and saved me; he shamed those who persecute me. God showed his love and his faithfulness,)"},{"num":4,"verse":"and delivered my soul from the midst of whelps of lions; I slept troubled, or disturbed. The sons of men, the teeth of them be armours and arrows; and their tongue is a sharp sword. (and saved me from the midst of those ravenous lions. Yea, those sons of men, whose teeth be like arms, or spears, and arrows; and whose tongues be like sharp swords.)"},{"num":5,"verse":"God, be thou enhanced above heavens; and thy glory above all earth. (God, be thou exalted above the heavens; and thy glory above all the earth.)"},{"num":6,"verse":"They made ready a snare to my feet; and they greatly bowed my life. They delved a ditch before my face; and they felled down into it. (They prepared a snare for my feet; and they greatly bowed down my life. They dug a ditch before me; but they themselves fell down into it.)"},{"num":7,"verse":"God, mine heart is ready, mine heart is ready; I shall sing, and I shall say psalm. (God, my heart is ready, my heart is ready; I shall sing, yea, I shall sing a song.)"},{"num":8,"verse":"My glory, rise thou up; psaltery and harp, rise thou up; I shall rise up early. (My spirit, rise thou up; lute and harp, rise thou up; yea, I shall rise up in the morning.)"},{"num":9,"verse":"Lord, I shall acknowledge to thee among peoples; and I shall say psalm [to thee] among heathen men. (Lord, I shall praise thee/Lord, I shall confess thee/Lord, I shall give thanks to thee among the peoples; and I shall sing a song to thee among the heathen.)"},{"num":10,"verse":"For thy mercy is magnified till to heavens; and thy truth till to the clouds. (For thy love reacheth above the heavens; and thy faithfulness up to the clouds.)"},{"num":11,"verse":"God, be thou enhanced above heavens; and thy glory above all earth. (God, be thou exalted above the heavens; and let thy glory be over all the earth.)"}]