[{"num":14,"verse":"And it came to pass, when he went into the house of one of the rulers of the Pharisees on a sabbath to eat bread, that they were watching him. "},{"num":2,"verse":"And behold, there was before him a certain man that had the dropsy. "},{"num":3,"verse":"And Jesus answering spake unto the lawyers and Pharisees, saying, Is it lawful to heal on the sabbath, or not? "},{"num":4,"verse":"But they held their peace. And he took him, and healed him, and let him go. "},{"num":5,"verse":"And he said unto them, Which of you shall have an ass or an ox fallen into a well, and will not straightway draw him up on a sabbath day? "},{"num":6,"verse":"And they could not answer again unto these things."},{"num":7,"verse":"And he spake a parable unto those that were bidden, when he marked how they chose out the chief seats; saying unto them, "},{"num":8,"verse":"When thou art bidden of any man to a marriage feast, sit not down in the chief seat; lest haply a more honorable man than thou be bidden of him, "},{"num":9,"verse":"and he that bade thee and him shall come and say to thee, Give this man place; and then thou shalt begin with shame to take the lowest place. "},{"num":10,"verse":"But when thou art bidden, go and sit down in the lowest place; that when he that hath bidden thee cometh, he may say to thee, Friend, go up higher: then shalt thou have glory in the presence of all that sit at meat with thee. "},{"num":11,"verse":"For every one that exalteth himself shall be humbled; and he that humbleth himself shall be exalted."},{"num":12,"verse":"And he said to him also that had bidden him, When thou makest a dinner or a supper, call not thy friends, nor thy brethren, nor thy kinsmen, nor rich neighbors; lest haply they also bid thee again, and a recompense be made thee. "},{"num":13,"verse":"But when thou makest a feast, bid the poor, the maimed, the lame, the blind: "},{"num":14,"verse":"and thou shalt be blessed; because they have not wherewith to recompense thee: for thou shalt be recompensed in the resurrection of the just."},{"num":15,"verse":"And when one of them that sat at meat with him heard these things, he said unto him, Blessed is he that shall eat bread in the kingdom of God. "},{"num":16,"verse":"But he said unto him, A certain man made a great supper; and he bade many: "},{"num":17,"verse":"and he sent forth his servant at supper time to say to them that were bidden, Come; for all things are now ready. "},{"num":18,"verse":"And they all with one consent began to make excuse. The first said unto him, I have bought a field, and I must needs go out and see it; I pray thee have me excused. "},{"num":19,"verse":"And another said, I have bought five yoke of oxen, and I go to prove them; I pray thee have me excused. "},{"num":20,"verse":"And another said, I have married a wife, and therefore I cannot come. "},{"num":21,"verse":"And the servant came, and told his lord these things. Then the master of the house being angry said to his servant, Go out quickly into the streets and lanes of the city, and bring in hither the poor and maimed and blind and lame. "},{"num":22,"verse":"And the servant said, Lord, what thou didst command is done, and yet there is room. "},{"num":23,"verse":"And the lord said unto the servant, Go out into the highways and hedges, and constrain them to come in, that my house may be filled. "},{"num":24,"verse":"For I say unto you, that none of those men that were bidden shall taste of my supper."},{"num":25,"verse":"Now there went with him great multitudes: and he turned, and said unto them, "},{"num":26,"verse":"If any man cometh unto me, and hateth not his own father, and mother, and wife, and children, and brethren, and sisters, yea, and his own life also, he cannot be my disciple. "},{"num":27,"verse":"Whosoever doth not bear his own cross, and come after me, cannot be my disciple. "},{"num":28,"verse":"For which of you, desiring to build a tower, doth not first sit down and count the cost, whether he have wherewith to complete it? "},{"num":29,"verse":"Lest haply, when he hath laid a foundation, and is not able to finish, all that behold begin to mock him, "},{"num":30,"verse":"saying, This man began to build, and was not able to finish. "},{"num":31,"verse":"Or what king, as he goeth to encounter another king in war, will not sit down first and take counsel whether he is able with ten thousand to meet him that cometh against him with twenty thousand? "},{"num":32,"verse":"Or else, while the other is yet a great way off, he sendeth an ambassage, and asketh conditions of peace. "},{"num":33,"verse":"So therefore whosoever he be of you that renounceth not all that he hath, he cannot be my disciple. "},{"num":34,"verse":"Salt therefore is good: but if even the salt have lost its savor, wherewith shall it be seasoned? "},{"num":35,"verse":"It is fit neither for the land nor for the dunghill: men cast it out. He that hath ears to hear, let him hear."}]