[{"header":"Healing on the Sabbath"},{"num":14,"verse":"One Sabbath, when Jesus went to share a meal in the home of one of the leaders of the Pharisees, they were watching him closely."},{"num":2,"verse":"A man suffering from an abnormal swelling of the body was there."},{"num":3,"verse":"Jesus asked the lawyers and Pharisees, “Does the Law allow healing on the Sabbath or not?”"},{"num":4,"verse":"But they said nothing. Jesus took hold of the sick man, cured him, and then let him go."},{"num":5,"verse":"He said to them, “Suppose your child or ox fell into a ditch on the Sabbath day. Wouldn’t you immediately pull it out?”"},{"num":6,"verse":"But they had no response."},{"header":"Lessons on humility and generosity"},{"num":7,"verse":"When Jesus noticed how the guests sought out the best seats at the table, he told them a parable."},{"num":8,"verse":"“When someone invites you to a wedding celebration, don’t take your seat in the place of honor. Someone more highly regarded than you could have been invited by your host."},{"num":9,"verse":"The host who invited both of you will come and say to you, ‘Give your seat to this other person.’ Embarrassed, you will take your seat in the least important place."},{"num":10,"verse":"Instead, when you receive an invitation, go and sit in the least important place. When your host approaches you, he will say, ‘Friend, move up here to a better seat.’ Then you will be honored in the presence of all your fellow guests."},{"num":11,"verse":"All who lift themselves up will be brought low, and those who make themselves low will be lifted up.”"},{"num":12,"verse":"Then Jesus said to the person who had invited him, “When you host a lunch or dinner, don’t invite your friends, your brothers and sisters, your relatives, or rich neighbors. If you do, they will invite you in return and that will be your reward."},{"num":13,"verse":"Instead, when you give a banquet, invite the poor, crippled, lame, and blind."},{"num":14,"verse":"And you will be blessed because they can’t repay you. Instead, you will be repaid when the just are resurrected.”"},{"num":15,"verse":"When one of the dinner guests heard Jesus’ remarks, he said to Jesus, “Happy are those who will feast in God’s kingdom.”"},{"num":16,"verse":"Jesus replied, “A certain man hosted a large dinner and invited many people."},{"num":17,"verse":"When it was time for the dinner to begin, he sent his servant to tell the invited guests, ‘Come! The dinner is now ready.’"},{"num":18,"verse":"One by one, they all began to make excuses. The first one told him, ‘I bought a farm and must go and see it. Please excuse me.’"},{"num":19,"verse":" Another said, ‘I bought five teams of oxen, and I’m going to check on them. Please excuse me.’"},{"num":20,"verse":"Another said, ‘I just got married, so I can’t come.’"},{"num":21,"verse":" When he returned, the servant reported these excuses to his master. The master of the house became angry and said to his servant, ‘Go quickly to the city’s streets, the busy ones and the side streets, and bring the poor, crippled, blind, and lame.’"},{"num":22,"verse":"The servant said, ‘Master, your instructions have been followed and there is still room.’"},{"num":23,"verse":"The master said to the servant, ‘Go to the highways and back alleys and urge people to come in so that my house will be filled."},{"num":24,"verse":"I tell you, not one of those who were invited will taste my dinner.’”"},{"header":"Discipleship’s demands"},{"num":25,"verse":"Large crowds were traveling with Jesus. Turning to them, he said,"},{"num":26,"verse":"“Whoever comes to me and doesn’t hate father and mother, spouse and children, and brothers and sisters—yes, even one’s own life—cannot be my disciple."},{"num":27,"verse":"Whoever doesn’t carry their own cross and follow me cannot be my disciple."},{"num":28,"verse":"“If one of you wanted to build a tower, wouldn’t you first sit down and calculate the cost, to determine whether you have enough money to complete it?"},{"num":29,"verse":"Otherwise, when you have laid the foundation but couldn’t finish the tower, all who see it will begin to belittle you."},{"num":30,"verse":"They will say, ‘Here’s the person who began construction and couldn’t complete it!’"},{"num":31,"verse":"Or what king would go to war against another king without first sitting down to consider whether his ten thousand soldiers could go up against the twenty thousand coming against him?"},{"num":32,"verse":"And if he didn’t think he could win, he would send a representative to discuss terms of peace while his enemy was still a long way off."},{"num":33,"verse":"In the same way, none of you who are unwilling to give up all of your possessions can be my disciple."},{"num":34,"verse":"“Salt is good. But if salt loses its flavor, how will it become salty again?"},{"num":35,"verse":"It has no value, neither for the soil nor for the manure pile. People throw it away. Whoever has ears to hear should pay attention.”"}]