[{"header":"Jesus Heals on the Sabbath"},{"num":14,"verse":"One Sabbath day Jesus went to eat dinner in the home of a leader of the Pharisees, and the people were watching him closely."},{"num":2,"verse":"There was a man there whose arms and legs were swollen."},{"num":3,"verse":"Jesus asked the Pharisees and experts in religious law, “Is it permitted in the law to heal people on the Sabbath day, or not?”"},{"num":4,"verse":"When they refused to answer, Jesus touched the sick man and healed him and sent him away."},{"num":5,"verse":"Then he turned to them and said, “Which of you doesn’t work on the Sabbath? If your son or your cow falls into a pit, don’t you rush to get him out?”"},{"num":6,"verse":"Again they could not answer."},{"header":"Jesus Teaches about Humility"},{"num":7,"verse":"When Jesus noticed that all who had come to the dinner were trying to sit in the seats of honor near the head of the table, he gave them this advice:"},{"num":8,"verse":"“When you are invited to a wedding feast, don’t sit in the seat of honor. What if someone who is more distinguished than you has also been invited?"},{"num":9,"verse":"The host will come and say, ‘Give this person your seat.’ Then you will be embarrassed, and you will have to take whatever seat is left at the foot of the table!"},{"num":10,"verse":"“Instead, take the lowest place at the foot of the table. Then when your host sees you, he will come and say, ‘Friend, we have a better place for you!’ Then you will be honored in front of all the other guests."},{"num":11,"verse":"For those who exalt themselves will be humbled, and those who humble themselves will be exalted.”"},{"num":12,"verse":"Then he turned to his host. “When you put on a luncheon or a banquet,” he said, “don’t invite your friends, brothers, relatives, and rich neighbors. For they will invite you back, and that will be your only reward."},{"num":13,"verse":"Instead, invite the poor, the crippled, the lame, and the blind."},{"num":14,"verse":"Then at the resurrection of the righteous, God will reward you for inviting those who could not repay you.”"},{"header":"Parable of the Great Feast"},{"num":15,"verse":"Hearing this, a man sitting at the table with Jesus exclaimed, “What a blessing it will be to attend a banquet in the Kingdom of God!”"},{"num":16,"verse":"Jesus replied with this story: “A man prepared a great feast and sent out many invitations."},{"num":17,"verse":"When the banquet was ready, he sent his servant to tell the guests, ‘Come, the banquet is ready.’"},{"num":18,"verse":"But they all began making excuses. One said, ‘I have just bought a field and must inspect it. Please excuse me.’"},{"num":19,"verse":"Another said, ‘I have just bought five pairs of oxen, and I want to try them out. Please excuse me.’"},{"num":20,"verse":"Another said, ‘I just got married, so I can’t come.’"},{"num":21,"verse":"“The servant returned and told his master what they had said. His master was furious and said, ‘Go quickly into the streets and alleys of the town and invite the poor, the crippled, the blind, and the lame.’"},{"num":22,"verse":"After the servant had done this, he reported, ‘There is still room for more.’"},{"num":23,"verse":"So his master said, ‘Go out into the country lanes and behind the hedges and urge anyone you find to come, so that the house will be full."},{"num":24,"verse":"For none of those I first invited will get even the smallest taste of my banquet.’”"},{"header":"The Cost of Being a Disciple"},{"num":25,"verse":"A large crowd was following Jesus. He turned around and said to them,"},{"num":26,"verse":"“If you want to be my disciple, you must, by comparison, hate everyone else—your father and mother, wife and children, brothers and sisters—yes, even your own life. Otherwise, you cannot be my disciple."},{"num":27,"verse":"And if you do not carry your own cross and follow me, you cannot be my disciple."},{"num":28,"verse":"“But don’t begin until you count the cost. For who would begin construction of a building without first calculating the cost to see if there is enough money to finish it?"},{"num":29,"verse":"Otherwise, you might complete only the foundation before running out of money, and then everyone would laugh at you."},{"num":30,"verse":"They would say, ‘There’s the person who started that building and couldn’t afford to finish it!’"},{"num":31,"verse":"“Or what king would go to war against another king without first sitting down with his counselors to discuss whether his army of 10,000 could defeat the 20,000 soldiers marching against him?"},{"num":32,"verse":"And if he can’t, he will send a delegation to discuss terms of peace while the enemy is still far away."},{"num":33,"verse":"So you cannot become my disciple without giving up everything you own."},{"num":34,"verse":"“Salt is good for seasoning. But if it loses its flavor, how do you make it salty again?"},{"num":35,"verse":"Flavorless salt is good neither for the soil nor for the manure pile. It is thrown away. Anyone with ears to hear should listen and understand!”"}]