[{"num":14,"verse":"One Sabbath day Jesus went to eat at the house of a ruler. He was a ruler of the Pharisees. They were watching Jesus."},{"num":2,"verse":"man stood in front of him. He was sick. His body was filled with water."},{"num":3,"verse":"Jesus asked the teachers of God's law and the Pharisees, `Is it right to heal a person on the Sabbath day or not?'"},{"num":4,"verse":"They did not answer. So he took the man and healed him. Then he sent him away."},{"num":5,"verse":"Jesus said to them, `If your horse or cow falls into a hole, which one of you will not pull him out right away on the Sabbath day?'"},{"num":6,"verse":"They could not answer that."},{"num":7,"verse":"Jesus told a story to the people who were asked to eat at the house. He saw that they chose to sit at the best places."},{"num":8,"verse":"He said to them, `When you are called to a wedding, do not sit in the best place. It may be that a better man than you has been called."},{"num":9,"verse":"Then the man who called you both will come and say to you, \"Get up and let this man sit here.\" Then you will be ashamed. And you will go and sit down in the last place."},{"num":10,"verse":"But when you are asked to go to a wedding, go and sit down in the last place. Then when the man who called you comes, he will say to you, \"Friend, come to a better place.\" Then all the people who sit at the table will see how he respects you."},{"num":11,"verse":"`Everyone who puts himself up in a high place will be brought down to a low place. And everyone who puts himself down in a low place will be brought up to a high place.'"},{"num":12,"verse":"Then Jesus said to the man who had asked him to come, `When you make a dinner or a feast, do not ask your friends, or your brothers, or the people in your family, or your rich neighbours. They will repay you by making a dinner for you."},{"num":13,"verse":"But when you make a dinner, ask the people who are poor, hurt, lame, or blind."},{"num":14,"verse":"You will be made happy because they cannot pay you. You will be repaid when all good people are raised from death.'"},{"num":15,"verse":"One of those who was sitting at the table heard this. He said, `Happy is the person who will eat in the kingdom of God!'"},{"num":16,"verse":"But Jesus said to him, `A man made a big feast and asked many people to come."},{"num":17,"verse":"When the feast was ready, he sent his servant to tell the people who had been asked. He said, \"Come. Everything is ready.\""},{"num":18,"verse":"But the people all began to make excuses. The first one said, `I have bought a farm. I must go and see it. I beg you, excuse me from the feast.\""},{"num":19,"verse":"Another man said, \"I have bought ten oxen. I am going to see them. I beg you, excuse me from the feast.\""},{"num":20,"verse":"Another one said, \"I have married a woman, and so I cannot come.\""},{"num":21,"verse":"`The servant came and told his master. Then the master was very angry. He said to his servant, \"Go out quickly. Go on all the streets in the city. Bring here people who are poor, hurt, blind, or lame.\""},{"num":22,"verse":"`The servant came back and said, \"Sir, I have done what you told me to do. There is still room for more people.\""},{"num":23,"verse":"Then the master said to the servant, \"Go out onto the roads and behind bushes. Find people and make them come in so that my house will be full."},{"num":24,"verse":"I tell you, not one of the men who were called first will eat any of my feast.'"},{"num":26,"verse":"Many people were going with Jesus. He turned to them and said, `If any man comes to me, he must hate his father and mother, his wife and children, his brothers and sister. Yes, he must hate himself too. If he does not, he cannot be my disciple."},{"num":27,"verse":"If anyone does not carry his cross [is not ready to die] and come with me, he cannot be my disciple."},{"num":28,"verse":"`When any of you wants to build a high house, you sit down first and see how much it will cost. You want to see if you have enough money to finish it."},{"num":29,"verse":"If you do not have enough money, you will not be able to finish it after you have made the foundation. Then all the people who see it will laugh at you."},{"num":30,"verse":"They will say, \"This man started to build a house and could not finish it.\""},{"num":31,"verse":"`When a king goes to fight against another king, he sits down first and thinks about the matter. He will ask himself, \"Can I fight him with ten thousand soldiers? He has twenty thousand soldiers.\""},{"num":32,"verse":"If he cannot fight him, he will send some men to meet the other king while he is still far away. He will try to make peace with him."},{"num":33,"verse":"`In the same way, any one of you who does not give up all he has cannot be my disciple.'"},{"num":34,"verse":"`Salt is good. But if the salt has lost its taste, how can it be made salty again?"},{"num":35,"verse":"It is not good for the land or the dirt pile. People throw it away. `Everyone who has ears to hear, listen!\""}]