[{"header":"Chapter 20"},{"num":1,"verse":"Invasion from Edom. After this the Moabites, the Ammonites, and with them some Meunites came to fight against Jehoshaphat. "},{"num":2,"verse":"Jehoshaphat was told: “A great multitude is coming against you from across the sea, from Edom; they are already in Hazazon-tamar” (which is En-gedi). "},{"num":3,"verse":"Frightened, Jehoshaphat resolved to consult the Lord. He proclaimed a fast throughout all Judah. "},{"num":4,"verse":"Then Judah gathered to seek the Lord’s help; from every one of the cities of Judah they came to seek the Lord."},{"num":5,"verse":"Jehoshaphat’s Prayer. Jehoshaphat stood up in the assembly of Judah and Jerusalem in the house of the Lord before the new court, "},{"num":6,"verse":"and he said: “Lord, God of our ancestors, are you not God in heaven, and do you not rule over all the kingdoms of the nations? In your hand is power and might, and no one can withstand you. "},{"num":7,"verse":"Was it not you, our God, who dispossessed the inhabitants of this land before your people Israel and gave it forever to the descendants of Abraham, your friend? "},{"num":8,"verse":"They have dwelt in it and they built in it a sanctuary for your name. They have said: "},{"num":9,"verse":"‘If evil comes upon us, the sword of judgment, or pestilence, or famine, we will stand before this house and before you, for your name is in this house, and we will cry out to you in our affliction, and you will hear and save!’ "},{"num":10,"verse":"And now, see the Ammonites, Moabites, and those of Mount Seir whom you did not allow Israel to invade when they came from the land of Egypt, but instead they passed them by and did not destroy them: "},{"num":11,"verse":"See how they are now repaying us by coming to drive us out of the possession you have given us. "},{"num":12,"verse":"O our God, will you not bring judgment on them? We are powerless before this vast multitude that is coming against us. We ourselves do not know what to do, so our eyes are turned toward you.”"},{"num":13,"verse":"Victory Prophesied. All Judah was standing before the Lord, with their little ones, their wives, and their children. "},{"num":14,"verse":"And the spirit of the Lord came upon Jahaziel, son of Zechariah, son of Benaiah, son of Jeiel, son of Mattaniah, a Levite of the clan of Asaph, in the midst of the assembly, "},{"num":15,"verse":"and he said: “Pay attention, all of Judah, inhabitants of Jerusalem, and King Jehoshaphat! The Lord says to you: Do not fear or be dismayed at the sight of this vast multitude, for the battle is not yours but God’s. "},{"num":16,"verse":"Go down against them tomorrow. You will see them coming up by the ascent of Ziz, and you will come upon them at the end of the wadi which opens on the wilderness of Jeruel. "},{"num":17,"verse":"You will not have to fight in this encounter. Take your places, stand firm, and see the salvation of the Lord; he will be with you, Judah and Jerusalem. Do not fear or be dismayed. Tomorrow go out to meet them, and the Lord will be with you.” "},{"num":18,"verse":"Then Jehoshaphat knelt down with his face to the ground, and all Judah and the inhabitants of Jerusalem fell down before the Lord in worship. "},{"num":19,"verse":"Levites from among the Kohathites and Korahites stood up to sing the praises of the Lord, the God of Israel, their voices ever louder."},{"num":20,"verse":"The Invaders Destroyed. Early in the morning they went out to the wilderness of Tekoa. As they were going out, Jehoshaphat halted and said: “Listen to me, Judah and inhabitants of Jerusalem! Let your faith in the Lord, your God, be firm, and you will be firm. Have faith in his prophets and you will succeed.” "},{"num":21,"verse":"After taking counsel with the people, he appointed some to sing to the Lord and some to praise the holy Splendor as it went forth at the head of the army. They sang: “Give thanks to the Lord, whose love endures forever.” "},{"num":22,"verse":"At the moment they began their jubilant praise, the Lord laid an ambush against the Ammonites, Moabites, and those of Mount Seir who were coming against Judah, so that they were defeated. "},{"num":23,"verse":"For the Ammonites and Moabites set upon the inhabitants of Mount Seir and exterminated them according to the ban. And when they had finished with the inhabitants of Seir, each helped to destroy the other."},{"num":24,"verse":"When Judah came to the watchtower of the wilderness and looked toward the throng, there were only corpses fallen on the ground, with no survivors. "},{"num":25,"verse":"Jehoshaphat and his people came to gather the spoils, and they found an abundance of cattle and personal property, garments and precious vessels. They took so much that they were unable to carry it all; it took them three days to gather the spoils, there was so much of it. "},{"num":26,"verse":"On the fourth day they held an assembly in the Valley of Berakah—for there they blessed the Lord; that is why the place is called the Valley of Berakah to this day. "},{"num":27,"verse":"Then all the men of Judah and Jerusalem, with Jehoshaphat at their head, returned to Jerusalem with joy; for the Lord had given them joy over their enemies. "},{"num":28,"verse":"They came to Jerusalem, with harps, lyres, and trumpets, to the house of the Lord. "},{"num":29,"verse":"And the fear of God came upon all the kingdoms of the surrounding lands when they heard how the Lord had fought against the enemies of Israel. "},{"num":30,"verse":"Thereafter Jehoshaphat’s kingdom had peace, for his God gave him rest on every side."},{"num":31,"verse":"Jehoshaphat’s Other Deeds. Thus Jehoshaphat reigned over Judah. He was thirty-five years old when he became king, and he reigned twenty-five years in Jerusalem. His mother’s name was Azubah, daughter of Shilhi. "},{"num":32,"verse":"He walked in the way of Asa his father unceasingly, doing what was right in the Lord’s sight. "},{"num":33,"verse":"Nevertheless, the high places did not disappear and the people had not yet set their hearts on the God of their ancestors."},{"num":34,"verse":"The rest of the acts of Jehoshaphat, first and last, are recorded in the chronicle of Jehu, son of Hanani, which was incorporated into the book of the kings of Israel. "},{"num":35,"verse":"After this, Jehoshaphat king of Judah joined with Ahaziah king of Israel—he acted wickedly. "},{"num":36,"verse":"He joined with him in building ships to go to Tarshish; the fleet was built at Ezion-geber. "},{"num":37,"verse":"But Eliezer, son of Dodavahu from Mareshah, prophesied against Jehoshaphat. He said: “Because you have joined with Ahaziah, the Lord will shatter your work.” And the ships were wrecked and were unable to sail to Tarshish."}]