[{"header":"Jehoshaphat Faces War"},{"num":20,"verse":"Later the Moabites, Ammonites, and some Meunites came to start a war with Jehoshaphat. "},{"num":2,"verse":"Messengers came and told Jehoshaphat, “A large army is coming against you from Edom, from the other side of the Dead Sea. They are already in Hazazon Tamar!” (Hazazon Tamar is also called En Gedi.) "},{"num":3,"verse":"Jehoshaphat was afraid, so he decided to ask the Lord what to do. He announced that everyone in Judah should fast during this special time of prayer to God. "},{"num":4,"verse":"The people of Judah came together to ask the Lord for help; they came from every town in Judah."},{"num":5,"verse":"The people of Judah and Jerusalem met in front of the new courtyard in the Temple of the Lord. Then Jehoshaphat stood up, "},{"num":6,"verse":"and he said, “Lord, God of our ancestors, you are the God in heaven. You rule over all the kingdoms of the nations. You have power and strength, so no one can stand against you. "},{"num":7,"verse":"Our God, you forced out the people who lived in this land as your people Israel moved in. And you gave this land forever to the descendants of your friend Abraham. "},{"num":8,"verse":"They lived in this land and built a Temple for you. They said, "},{"num":9,"verse":"‘If trouble comes upon us, or war, punishment, sickness, or hunger, we will stand before you and before this Temple where you have chosen to be worshiped. We will cry out to you when we are in trouble. Then you will hear and save us.’"},{"num":10,"verse":"“But now here are men from Ammon, Moab, and Edom. You wouldn’t let the Israelites enter their lands when the Israelites came from Egypt. So the Israelites turned away and did not destroy them. "},{"num":11,"verse":"But see how they repay us for not destroying them! They have come to force us out of your land, which you gave us as our own. "},{"num":12,"verse":"Our God, punish those people. We have no power against this large army that is attacking us. We don’t know what to do, so we look to you for help.”"},{"num":13,"verse":"All the men of Judah stood before the Lord with their babies, wives, and children. "},{"num":14,"verse":"Then the Spirit of the Lord entered Jahaziel. (Jahaziel was Zechariah’s son. Zechariah was Benaiah’s son. Benaiah was Jeiel’s son, and Jeiel was Mattaniah’s son.) Jahaziel, a Levite and a descendant of Asaph, stood up in the meeting. "},{"num":15,"verse":"He said, “Listen to me, King Jehoshaphat and all you people living in Judah and Jerusalem. The Lord says this to you: ‘Don’t be afraid or discouraged because of this large army. The battle is not your battle, it is God’s. "},{"num":16,"verse":"Tomorrow go down there and fight those people. They will come up through the Pass of Ziz. You will find them at the end of the ravine that leads to the Desert of Jeruel. "},{"num":17,"verse":"You won’t need to fight in this battle. Just stand strong in your places, and you will see the Lord save you. Judah and Jerusalem, don’t be afraid or discouraged, because the Lord is with you. So go out against those people tomorrow.’”"},{"num":18,"verse":"Jehoshaphat bowed facedown on the ground. All the people of Judah and Jerusalem bowed down before the Lord and worshiped him. "},{"num":19,"verse":"Then some Levites from the Kohathite and Korahite people stood up and praised the Lord, the God of Israel, with very loud voices."},{"num":20,"verse":"Jehoshaphat’s army went out into the Desert of Tekoa early in the morning. As they were starting out, Jehoshaphat stood and said, “Listen to me, people of Judah and Jerusalem. Have faith in the Lord your God, and you will stand strong. Have faith in his prophets, and you will succeed.” "},{"num":21,"verse":"Jehoshaphat listened to the people’s advice. Then he chose men to be singers to the Lord, to praise him because he is holy and wonderful. As they marched in front of the army, they said,"},{"num":22,"verse":"As they began to sing and praise God, the Lord set ambushes for the people of Ammon, Moab, and Edom who had come to attack Judah. And they were defeated. "},{"num":23,"verse":"The Ammonites and Moabites attacked the Edomites, destroying them completely. After they had killed the Edomites, they killed each other."},{"num":24,"verse":"When the men from Judah came to a place where they could see the desert, they looked at the enemy’s large army. But they only saw dead bodies lying on the ground; no one had escaped. "},{"num":25,"verse":"When Jehoshaphat and his army came to take their valuables, they found many supplies, much clothing, and other valuable things. There was more than they could carry away; there was so much it took three days to gather it all. "},{"num":26,"verse":"On the fourth day Jehoshaphat and his army met in the Valley of Beracah and praised the Lord. That is why that place has been called the Valley of Beracah to this day."},{"num":27,"verse":"Then Jehoshaphat led all the men from Judah and Jerusalem back to Jerusalem. The Lord had made them happy because their enemies were defeated. "},{"num":28,"verse":"They entered Jerusalem with harps, lyres, and trumpets and went to the Temple of the Lord."},{"num":29,"verse":"When all the kingdoms of the lands around them heard how the Lord had fought Israel’s enemies, they feared God. "},{"num":30,"verse":"So Jehoshaphat’s kingdom was not at war. His God gave him peace from all the countries around him."},{"header":"Jehoshaphat’s Rule Ends"},{"num":31,"verse":"Jehoshaphat ruled over the country of Judah. He was thirty-five years old when he became king, and he ruled in Jerusalem for twenty-five years. His mother’s name was Azubah daughter of Shilhi. "},{"num":32,"verse":"Jehoshaphat was good like his father Asa, and he did what the Lord said was right. "},{"num":33,"verse":"But the places where gods were worshiped were not removed, and the people did not really want to follow the God of their ancestors."},{"num":34,"verse":"The other things Jehoshaphat did as king, from the beginning to the end, are written in the records of Jehu son of Hanani, which are in the book of the kings of Israel."},{"num":35,"verse":"Later, Jehoshaphat king of Judah made a treaty with Ahaziah king of Israel, which was a wrong thing to do. "},{"num":36,"verse":"Jehoshaphat agreed with Ahaziah to build trading ships, which they built in the town of Ezion Geber. "},{"num":37,"verse":"Then Eliezer son of Dodavahu from the town of Mareshah spoke against Jehoshaphat. He said, “Jehoshaphat, because you joined with Ahaziah, the Lord will destroy what you have made.” The ships were wrecked so they could not sail out to trade."}]