[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And no man . . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Or, better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (for it is of more than mankind that the Apostle speaks) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was able",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the heaven, nor on the earth, nor under the earth, nor even",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (still less?) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to look thereon.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The looking on the book is usually understood of the look cast on the book of one who would read the contents. If so, the thought is, none could open, still less read, the roll. It may, however, be that all who attempted to take the book were unable to face the glory in which it lay. When Christ revealed Himself to Saul he could not see for the glory of that light.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-7 The apostle saw in the hand of Him that sat upon the throne, a roll of parchments in the form usual in those times, and sealed with seven seals. This represented the secret purposes of God about to be revealed. The designs and methods of Divine Providence, toward the church and the world, are stated, fixed, and made a matter of record. The counsels of God are altogether hidden from the eye and understanding of the creature. The several parts are not unsealed and opened at once, but after each other, till the whole mystery of God's counsel and conduct is finished in the world. The creatures cannot open it, nor read it; the Lord only can do so. Those who see most of God, are most desirous to see more; and those who have seen his glory, desire to know his will. But even good men may be too eager and hasty to look into the mysteries of the Divine conduct. Such desires, if not soon answered, turn to grief and sorrow. If John wept much because he could not look into the book of God's decrees, what reason have many to shed floods of tears for their ignorance of the gospel of Christ! of that on which everlasting salvation depends! We need not weep that we cannot foresee future events respecting ourselves in this world; the eager expectation of future prospects, or the foresight of future calamities, would alike unfit us for present duties and conflicts, or render our prosperous days distressing. Yet we may desire to learn, from the promises and prophecies of Scripture, what will be the final event to believers and to the church; and the Incarnate Son has prevailed, that we should learn all that we need to know. Christ stands as Mediator between God and both ministers and people. He is called a Lion, but he appears as a Lamb slain. He appears with the marks of his sufferings, to show that he pleads for us in heaven, in virtue of his satisfaction. He appears as a Lamb, having seven horns and seven eyes; perfect power to execute all the will of God, and perfect wisdom to understand it, and to do it in the most effectual manner. The Father put the book of his eternal counsels into the hand of Christ, and Christ readily and gladly took it into his hand; for he delights to make known the will of his Father; and the Holy Spirit is given by him to reveal the truth and will of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And no man in heaven - No one - οὐδεὶς  oudeis. There is no limitation in the original to man. The idea is, that there was no one in heaven - evidently alluding to the created beings there - who could open the volume. Is it not taught here that angels cannot penetrate the future, and disclose what is to come? Are not their faculties limited in this respect like those of man?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor in earth - Among all classes of people - sages, divines, prophets, philosophers - who among those have ever been able to penetrate the future, and disclose what is to come?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither under the earth - These divisions compose, in common language, the universe: what is in heaven above; what is on the earth; and whatever there is under the earth - the abodes of the dead. May there not be an allusion here to the supposed science of necromancy, and an assertion that even the dead cannot penetrate the future, and disclose what is to come? Compare the notes on Isaiah 8:19. In all these great realms no one advanced who was qualified to undertake the office of making a disclosure of what the mysterious scroll might contain.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Neither under the earth - These divisions compose, in common language, the universe: what is in heaven above; what is on the earth; and whatever there is under the earth - the abodes of the dead. May there not be an allusion here to the supposed science of necromancy, and an assertion that even the dead cannot penetrate the future, and disclose what is to come? Compare the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In all these great realms no one advanced who was qualified to undertake the office of making a disclosure of what the mysterious scroll might contain.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Was able to open the book - Had ability - ἠδύνατε  ēdunate - to do it. It was a task beyond their power. Even if anyone had been found who had a rank and a moral character which might have seemed to justify the effort, there was no one who had the power of reading what was recorded respecting coming events.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither to look thereon - That is, so to open the seals as to have a view of what was written therein. That it was not beyond their power merely to see the book is apparent from the fact that John himself saw it in the hand of him that sat on the throne; and it is evident also Revelation 5:5 that in that sense the elders saw it. But no one could prevail to inspect the contents, or so have access to the interior of the volume as to be able to see what was written there. It could be seen, indeed Revelation 5:1, that it was written on both sides of the parchment, but what the writing was no one could know. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Neither to look thereon - That is, so to open the seals as to have a view of what was written therein. That it was not beyond their power merely to see the book is apparent from the fact that John himself saw it in the hand of him that sat on the throne; and it is evident also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that in that sense the elders saw it. But no one could prevail to inspect the contents, or so have access to the interior of the volume as to be able to see what was written there. It could be seen, indeed ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that it was written on both sides of the parchment, but what the writing was no one could know. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. no man—Greek, \"no one.\" Not merely no man, but also no one of any order of beings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in earth—Greek, \"upon the earth.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "under the earth—namely, in Hades.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "look thereon—to look upon the contents, so as to read them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " None of the angels ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nor any man upon the ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nor any of them whose bodies are ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "under the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and their souls in heaven, nor any infernal spirits; none was found sufficient ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to open the book, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to look on it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There was none who replied to the angel’s question, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 5:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 5:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And no man in heaven,.... Or \"no one in heaven\", whether angels, or the souls of departed saints; neither the one nor the other know anything of what is to come, until it is revealed unto them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "nor in earth: among all the men on earth, even those of the greatest sagacity and penetration, the wise, the prudent, the scribe, the disputer of this world, such who are most conversant with books, and have the greatest reach into the things of nature, or of grace: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither under the earth; the dead buried there, good or bad; which may be said agreeably to the notions of the ancient Jews, who believed the immortality of souls, and that they were rewarded or punished, , \"under the earth\", according to their virtue or vice in life (d): or the devils in hell; or whoever on the earth are influenced by them, as magicians, sorcerers, soothsayers, and necromancers: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "was able to open the book, neither to look thereon; or in it, so as to read it, understand it, and show to John what was in it; for the sense is, there was no creature in heaven, earth, or hell, who were masters of the deepest knowledge, and made pretensions to any, that were able to foresee and foretell things to come; or to exhibit the prophecies in this book, and represent them to John in the manner they afterwards were, and much less to accomplish them. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Joseph. Antiqu. l. 18. c. 1. sect 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Joseph. Antiqu. l. 18. c. 1. sect 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{4} And no man in heaven, nor in earth, neither under the earth, was able to open the book, neither to look thereon.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{4}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And no man in heaven, nor in earth, neither under the earth, was able to open the book, neither to look thereon.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) Thus neither of them that are in heaven, nor of them who are in the earth. Now this counting of parts, is sufficient to the denying of the whole; For of the creatures, one sort is in heaven, above the earth: another in the earth, and another under the earth in the sea, as is later declared in Re 5:13.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑποκάτω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the under-world of departed spirits or of daemons. Not even angels ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ οὐρανῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 13:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") can discharge this function; their rôle in the Apocalypse is prominent but limited. Gunkel prefers to think of a magical background to the whole symbolism; the book defies the necromancy of the universe, but yields to the superior power of “the new god, the lord of the book”. For the mythological basis of the idea of an opened heavenly book ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Winckler (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Alt-orient. Forsch.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ii. 386) and Brandis (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hermes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 1867, 283). The triple division of the universe was originally Babylonian but it had long ago become a popular religious idea, (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Php 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "no one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—the term includes others as well as men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "under the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. in the world of the dead. In view of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Revelation 5:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 5:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", we can hardly make it mean “in the sea,” on the analogy of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " fin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neither to look thereon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Which would have enabled him to read some fragments of its contents, viz. as much as was written on the outer fold of the back of the roll.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And no man in heaven, nor in earth, neither under the earth, was able to open the book, neither to look thereon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "no one in the heaven, or on the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). That is, no one in all creation - in heaven, or on earth, or in the place of departed spirits. No one was able \"to look thereon\" (that is, \"to read therein\") as a consequence of no one being fit to open the book. Revelation 5:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Under the earth",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Hades.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To look (βλέπειν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on John 1:29. To take a single look at the contents. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". To take a single look at the contents. ",
            "children": []
          }
        ]
      }
    ]
  }
]