[[],[],[{"type":"header","content":"The Great Tree Is Made Small and the Small Tree Great"},{"type":"prose","content":"’s Message came to me: “Son of man, make a riddle for the house of Israel. Tell them a story. Say, ‘, the Master, says:"},{"type":"poetry","content":"“‘A great eagle"},{"type":"poetry","content":"In full plumage and bright colors,"},{"type":"poetry","content":"And took the top off a cedar,"},{"type":"poetry","content":"Took it to a land of traders,"},{"type":"poetry","content":"Then he took a cutting from the land"},{"type":"poetry","content":"It sprouted into a flourishing vine,"},{"type":"poetry","content":"Its branches grew toward the eagle"},{"type":"poetry","content":"A vine putting out shoots,"},{"type":"prose","content":"* * *"}],[{"type":"prose","content":"’s Message came to me: “Tell this house of rebels, ‘Do you get it? Do you know what this means?’"}],[{"type":"prose","content":"“Tell them, ‘The king of Babylon came to Jerusalem and took its king and its leaders back to Babylon. He took one of the royal family and made a covenant with him, making him swear his loyalty. The king of Babylon took all the top leaders into exile to make sure that this kingdom stayed weak—didn’t get any big ideas of itself—and kept the covenant with him so that it would have a future."}],[{"type":"prose","content":"“‘But he rebelled and sent emissaries to Egypt to recruit horses and a big army. Do you think that’s going to work? Are they going to get by with this? Does anyone break a covenant and get off scot-free?"}],[{"type":"prose","content":"“‘As sure as I am the living God, this king who broke his pledge of loyalty and his covenant will die in that country, in Babylon. Pharaoh with his big army—all those soldiers!—won’t lift a finger to fight for him when Babylon sets siege to the city and kills everyone inside. Because he broke his word and broke the covenant, even though he gave his solemn promise, because he went ahead and did all these things anyway, he won’t escape."}],[{"type":"prose","content":"“‘Therefore, , the Master, says, As sure as I am the living God, because the king despised my oath and broke my covenant, I’ll bring the consequences crashing down on his head. I’ll send out a search party and catch him. I’ll take him to Babylon and have him brought to trial because of his total disregard for me. All his elite soldiers, along with the rest of the army, will be killed in battle, and whoever is left will be scattered to the four winds. Then you’ll realize that I, , have spoken."}],[{"type":"prose","content":"“‘, the Master, says, I personally will take a shoot from the top of the towering cedar, a cutting from the crown of the tree, and plant it on a high and towering mountain, on the high mountain of Israel. It will grow, putting out branches and fruit—a majestic cedar. Birds of every sort and kind will live under it. They’ll build nests in the shade of its branches. All the trees of the field will recognize that I, , made the great tree small and the small tree great, made the green tree turn dry and the dry tree sprout green branches. I, , said it—and I did it.’”"}]]