[{"header":"The Eagle and the Vine"},{"num":17,"verse":"The Lord spoke his word to me, saying: "},{"num":2,"verse":"“Human, give a riddle and tell a story to the people of Israel. "},{"num":3,"verse":"Say, ‘This is what the Lord God says: A giant eagle with big wings and long feathers of many different colors came to Lebanon and took hold of the top of a cedar tree. "},{"num":4,"verse":"He pulled off the top branch and brought it to a land of traders, where he planted it in a city of traders."},{"num":5,"verse":"“‘The eagle took some seed from the land and planted it in a good field near plenty of water. He planted it to grow like a willow tree. "},{"num":6,"verse":"It sprouted and became a low vine that spread over the ground. The branches turned toward the eagle, but the roots were under the eagle. So the seed became a vine, and its branches grew, sending out leaves."},{"num":7,"verse":"“‘But there was another giant eagle with big wings and many feathers. The vine then bent its roots toward this eagle. It sent out its branches from the area where it was planted toward the eagle so he could water it. "},{"num":8,"verse":"It had been planted in a good field by plenty of water so it could grow branches and give fruit. It could have become a fine vine.’"},{"num":9,"verse":"“Say to them, ‘This is what the Lord God says: The vine will not continue to grow. The first eagle will pull up the vine’s roots and strip off its fruit. Then the vine and all its new leaves will dry up and die. It will not take a strong arm or many people to pull the vine up by its roots. "},{"num":10,"verse":"Even if it is planted again, it will not continue to grow. It will completely dry up and die when the east wind hits it in the area where it grew.’”"},{"header":"Zedekiah Against Nebuchadnezzar"},{"num":11,"verse":"Then the Lord spoke his word to me, saying: "},{"num":12,"verse":"“Say now to the people who refuse to obey: ‘Do you know what these things mean?’ Say: ‘The king of Babylon came to Jerusalem and took the king and important men of Jerusalem and brought them to Babylon. "},{"num":13,"verse":"Then he took a member of the family of the king of Judah and made an agreement with him, forcing him to take an oath. The king also took away the leaders of Judah "},{"num":14,"verse":"to make the kingdom weak so it would not be strong again. Then the kingdom of Judah could continue only by keeping its agreement with the king of Babylon. "},{"num":15,"verse":"But the king of Judah turned against the king of Babylon by sending his messengers to Egypt and asking them for horses and many soldiers. Will the king of Judah succeed? Will the one who does such things escape? He cannot break the agreement and escape."},{"num":16,"verse":"“‘As surely as I live, says the Lord God, he will die in Babylon, in the land of the king who made him king of Judah. The king of Judah hated his promise to the king of Babylon and broke his agreement with him. "},{"num":17,"verse":"The king of Egypt with his mighty army and many people will not help the king of Judah in the war. The Babylonians will build devices to attack the cities and to kill many people. "},{"num":18,"verse":"The king of Judah showed that he hated the promise by breaking the agreement. He promised to support Babylon, but he did all these things. So he will not escape."},{"num":19,"verse":"“‘So this is what the Lord God says: As surely as I live, this is true: I will pay back the king of Judah for hating my promise and breaking my agreement. "},{"num":20,"verse":"I will spread my net over him, and he will be caught in my trap. Then I will bring him to Babylon, where I will punish him for the unfaithful acts he did against me. "},{"num":21,"verse":"All the best of his soldiers who escape will die by the sword, and those who live will be scattered to every wind. Then you will know that I, the Lord, have spoken."},{"num":22,"verse":"“‘This is what the Lord God says: I myself will also take a young branch from the top of a cedar tree, and I will plant it. I will cut off a small twig from the top of the tree’s young branches, and I will plant it on a very high mountain. "},{"num":23,"verse":"I will plant it on the high mountain of Israel. Then it will grow branches and give fruit and become a great cedar tree. Birds of every kind will build nests in it and live in the shelter of the tree’s branches. "},{"num":24,"verse":"Then all the trees in the countryside will know that I am the Lord. I bring down the high tree and make the low tree tall. I dry up the green tree and make the dry tree grow. I am the Lord. I have spoken, and I will do it.’”"}]