[{"header":"Jeroboam Warned, Stricken"},{"num":13,"verse":"Now behold, there came a man of God from Judah to Bethel by the word of the Lord, while Jeroboam was standing by the altar to burn incense."},{"num":2,"verse":"He cried against the altar by the word of the Lord, and said, “O altar, altar, thus says the Lord, ‘Behold, a son shall be born to the house of David, Josiah by name; and on you he shall sacrifice the priests of the high places who burn incense on you, and human bones shall be burned on you.’”"},{"num":3,"verse":"Then he gave a sign the same day, saying, “This is the sign which the Lord has spoken, ‘Behold, the altar shall be split apart and the ashes which are on it shall be poured out.’”"},{"num":4,"verse":"Now when the king heard the saying of the man of God, which he cried against the altar in Bethel, Jeroboam stretched out his hand from the altar, saying, “Seize him.” But his hand which he stretched out against him dried up, so that he could not draw it back to himself."},{"num":5,"verse":"The altar also was split apart and the ashes were poured out from the altar, according to the sign which the man of God had given by the word of the Lord."},{"num":6,"verse":"The king said to the man of God, “Please entreat the Lord your God, and pray for me, that my hand may be restored to me.” So the man of God entreated the Lord, and the king’s hand was restored to him, and it became as it was before."},{"num":7,"verse":"Then the king said to the man of God, “Come home with me and refresh yourself, and I will give you a reward.”"},{"num":8,"verse":"But the man of God said to the king, “If you were to give me half your house I would not go with you, nor would I eat bread or drink water in this place."},{"num":9,"verse":"For so it was commanded me by the word of the Lord, saying, ‘You shall eat no bread, nor drink water, nor return by the way which you came.’”"},{"num":10,"verse":"So he went another way and did not return by the way which he came to Bethel."},{"header":"The Disobedient Prophet"},{"num":11,"verse":"Now an old prophet was living in Bethel; and his sons came and told him all the deeds which the man of God had done that day in Bethel; the words which he had spoken to the king, these also they related to their father."},{"num":12,"verse":"Their father said to them, “Which way did he go?” Now his sons had seen the way which the man of God who came from Judah had gone."},{"num":13,"verse":"Then he said to his sons, “Saddle the donkey for me.” So they saddled the donkey for him and he rode away on it."},{"num":14,"verse":"So he went after the man of God and found him sitting under an oak; and he said to him, “Are you the man of God who came from Judah?” And he said, “I am.”"},{"num":15,"verse":"Then he said to him, “Come home with me and eat bread.”"},{"num":16,"verse":"He said, “I cannot return with you, nor go with you, nor will I eat bread or drink water with you in this place."},{"num":17,"verse":"For a command came to me by the word of the Lord, ‘You shall eat no bread, nor drink water there; do not return by going the way which you came.’”"},{"num":18,"verse":"He said to him, “I also am a prophet like you, and an angel spoke to me by the word of the Lord, saying, ‘Bring him back with you to your house, that he may eat bread and drink water.’” But he lied to him."},{"num":19,"verse":"So he went back with him, and ate bread in his house and drank water."},{"num":20,"verse":"Now it came about, as they were sitting down at the table, that the word of the Lord came to the prophet who had brought him back;"},{"num":21,"verse":"and he cried to the man of God who came from Judah, saying, “Thus says the Lord, ‘Because you have disobeyed the command of the Lord, and have not observed the commandment which the Lord your God commanded you,"},{"num":22,"verse":"but have returned and eaten bread and drunk water in the place of which He said to you, “Eat no bread and drink no water”; your body shall not come to the grave of your fathers.’”"},{"num":23,"verse":"It came about after he had eaten bread and after he had drunk, that he saddled the donkey for him, for the prophet whom he had brought back."},{"num":24,"verse":"Now when he had gone, a lion met him on the way and killed him, and his body was thrown on the road, with the donkey standing beside it; the lion also was standing beside the body."},{"num":25,"verse":"And behold, men passed by and saw the body thrown on the road, and the lion standing beside the body; so they came and told it in the city where the old prophet lived."},{"num":26,"verse":"Now when the prophet who brought him back from the way heard it, he said, “It is the man of God, who disobeyed the command of the Lord; therefore the Lord has given him to the lion, which has torn him and killed him, according to the word of the Lord which He spoke to him.”"},{"num":27,"verse":"Then he spoke to his sons, saying, “Saddle the donkey for me.” And they saddled it."},{"num":28,"verse":"He went and found his body thrown on the road with the donkey and the lion standing beside the body; the lion had not eaten the body nor torn the donkey."},{"num":29,"verse":"So the prophet took up the body of the man of God and laid it on the donkey and brought it back, and he came to the city of the old prophet to mourn and to bury him."},{"num":30,"verse":"He laid his body in his own grave, and they mourned over him, saying, “Alas, my brother!”"},{"num":31,"verse":"After he had buried him, he spoke to his sons, saying, “When I die, bury me in the grave in which the man of God is buried; lay my bones beside his bones."},{"num":32,"verse":"For the thing shall surely come to pass which he cried by the word of the Lord against the altar in Bethel and against all the houses of the high places which are in the cities of Samaria.”"},{"num":33,"verse":"After this event Jeroboam did not return from his evil way, but again he made priests of the high places from among all the people; any who would, he ordained, to be priests of the high places."},{"num":34,"verse":"This event became sin to the house of Jeroboam, even to blot it out and destroy it from off the face of the earth."}]