[{"header":"Chapter 13"},{"num":1,"verse":"Prophetic Disobedience. A man of God came from Judah and went to Bethel, led by the word of the Lord, and Jeroboam was standing by the altar offering incense."},{"num":2,"verse":"He cried out the word of the Lord against the altar saying, “O altar, O altar, thus says the Lord, ‘A son will be born to the house of David by the name of Josiah. On you he will sacrifice the priests of the high places who now burn incense upon you. Human bones will be burnt upon you.’ ”"},{"num":3,"verse":"That same day he gave a sign saying, “This is a sign of what the Lord has proclaimed: The altar will be split in two and the ashes on it will be poured out.”"},{"num":4,"verse":"When the king heard the man of God speaking against the altar in Bethel, Jeroboam stretched out his hand from the altar proclaiming, “Seize him!” The hand that he stretched out toward him shriveled up, and he could not pull it back again."},{"num":5,"verse":"The altar split apart and its ashes spilt out from the altar, fulfilling the sign that the man of God had proclaimed through the word of the Lord."},{"num":6,"verse":"The king said to the man of God, “Intercede now to the Lord, your God, and pray for me so that my hand might be made well.” The man of God interceded with the Lord, and the king’s hand was made well, just like it was before."},{"num":7,"verse":"The king said to the man of God, “Come home with me and have something to eat, and I will give you a gift.”"},{"num":8,"verse":"But the man of God said to the king, “Even if you were to give me half of what belongs to you, I would not go with you, nor would I eat bread or drink water in this place.”"},{"num":9,"verse":"I received a command by the word of the Lord, “Do not eat bread or drink water or return by the way you came.”"},{"num":10,"verse":"He returned by another way, and did not go back by the way that he had come to Bethel."},{"num":11,"verse":"Fate of a Disobedient Prophet. Now there was an old prophet who lived in Bethel whose sons came and told him all about the things that the man of God had done in Bethel that day."},{"num":12,"verse":"They also told their father what he had said to the king. Their father asked them, “Which way did he go?” His sons showed him the way on which the man of God from Judah had gone."},{"num":13,"verse":"He said to his sons, “Saddle up the donkey for me.” They saddled up the donkey, and he rode on it."},{"num":14,"verse":"He rode after the man of God and found him sitting under an oak tree and said to him, “Are you the man of God who came from Judah?” He answered, “I am.”"},{"num":15,"verse":"So he said to him, “Come home and eat with me.”"},{"num":16,"verse":"He answered, “I cannot return nor can I go with you. I cannot eat bread with you nor drink water with you in that place."},{"num":17,"verse":"The word of the Lord told me, ‘Do not eat bread nor drink water there. Do not return by the way which you came.’ ”"},{"num":18,"verse":"He said, “I am also a prophet like you. An angel spoke the word of the Lord to me, saying, ‘Bring him back with you into your house so that he can eat bread and drink water.’ ” But he was lying."},{"num":19,"verse":"The man of God returned with him and he ate bread and drank water in his house."},{"num":20,"verse":"While they were sitting at the table, the word of the Lord came to the prophet who brought him back."},{"num":21,"verse":"He cried out to the man of God who had come from Judah, “Thus says the Lord: ‘Because you defied the mouth of the Lord and have not observed the command that the Lord, your God, commanded you,"},{"num":22,"verse":"but you came back and ate bread and drank water in the place that I told you not to eat bread nor drink water, therefore your body will not be buried in the tomb of your fathers.’ ”"},{"num":23,"verse":"When he had finished eating bread and drinking, the prophet who had brought him back saddled his donkey up for him."},{"num":24,"verse":"On the way, a lion came upon him and killed him, and his body was thrown down upon the road, with both the donkey and the lion standing alongside of him."},{"num":25,"verse":"Some of those who were passing by on the road saw his body tossed down there, and there was a lion standing by the body. They came and reported it in the city where the old prophet was living."},{"num":26,"verse":"When the prophet who had brought him back while he was on his way heard about it, he said, “It is the man of God who disobeyed the word of the Lord. The Lord has delivered him over to the lion who tore him to pieces and killed him, just as the word of the Lord had declared to him.”"},{"num":27,"verse":"The prophet said to his sons, “Saddle up the donkey for me,” and they saddled it up."},{"num":28,"verse":"They went out and found the body that had been thrown down along the way, and the donkey and the lion were standing alongside of it. The lion had not eaten the body nor had it attacked the donkey."},{"num":29,"verse":"The prophet picked up the body of the man of God and put it upon the donkey. He brought it back to the old prophet’s city to mourn for him and bury him."},{"num":30,"verse":"Then he laid the body in his own grave. They mourned over him saying, “Oh, my brother!”"},{"num":31,"verse":"After he buried him, he said to his sons, “When I die, bury me in the grave where the man of God is buried. Lay my bones alongside of his."},{"num":32,"verse":"The thing that he proclaimed by the word of the Lord against the altar in Bethel and against all of the shrines on the high places throughout the cities of Samaria will certainly be fulfilled.”"},{"num":33,"verse":"Even after this, though, Jeroboam did not turn away from his evil ways. Once again he appointed priests for the high places from the lowliest of people. He consecrated as priests for the high places anyone who wanted to be consecrated."},{"num":34,"verse":"This was the sin of the house of Jeroboam that caused it to be cut off and wiped out from the face of the earth."}]