[{"header":"Prophet Against Bethel"},{"num":13,"verse":"Unexpectedly, a man of God came from Judah to Bethel with the word of Adonai while Jeroboam was standing by the altar to burn incense. "},{"num":2,"verse":"He cried out against the altar with the word of Adonai and said: “O altar, altar, thus says Adonai, behold, a son shall be born to the house of David, Josiah by name, and upon you will he sacrifice the priests of the high places who burn incense on you, and human bones will be burned upon you.’” "},{"num":3,"verse":"The same day he gave a sign, saying, “This is the sign that Adonai has spoken, the altar is about to be split apart and the fat ashes on it will be poured out.”"},{"num":4,"verse":"Now when the king heard the word of the man of God, which he proclaimed against the altar in Bethel, Jeroboam stretched out his hand from the altar saying: “Seize him!” But the hand which he stretched out against him withered—he could not even draw it back to himself. "},{"num":5,"verse":"The altar also was split apart and the fat ashes poured out from the altar, just as was the sign that the man of God gave with the word of Adonai."},{"num":6,"verse":"So the king responded by saying to the man of God: “Please seek the face of Adonai your God, and pray for me, so my hand may be restored to me!” So the man of God sought the face of Adonai and the king’s hand was restored to him, becoming as it was before."},{"num":7,"verse":"Then the king said to the man of God: “Come home with me and have something to eat, and then, I will give you a reward.”"},{"num":8,"verse":"But the man of God said to the king: “Even if you give me half your house, I will not go with you nor will I eat bread or drink water in this place. "},{"num":9,"verse":"For so I was charged by the word of Adonai, saying, ‘You are to eat no bread, nor drink water, nor return by the way by which you came.’” "},{"num":10,"verse":"So he took another road and did not return by the way he had come to Bethel."},{"num":11,"verse":"Now one old prophet was living in Bethel. His son came and told him all the deeds that the man of God had done that day in Bethel and all the words that he had spoken to the king they related to their father. "},{"num":12,"verse":"Then their father asked them: “Which way did he go?” For his sons had seen which way the man of God that came from Judah went."},{"num":13,"verse":"Then he said to his sons, “Saddle the donkey for me!” So they saddled the donkey for him and he rode away on it. "},{"num":14,"verse":"Then he went after the man of God and found him sitting under an oak tree. He said to him, “Are you the man of God who came from Judah?”"},{"num":15,"verse":"“Come home with me,” he said to him, “and eat bread!”"},{"num":16,"verse":"But he said: “I cannot return with you nor go with you, nor will I eat bread or drink water with you in this place. "},{"num":17,"verse":"For it was said to me by the word of Adonai: You shall eat no bread nor drink water there, nor should you return back by the way by which you came.”"},{"num":18,"verse":"So he said to him: “I also am a prophet like you. An angel spoke to me with the word of Adonai saying, ‘Bring him back with you to your house that he may eat bread and drink water.’” (He lied to him.)"},{"num":19,"verse":" So he went back with him and ate bread in his house and drank water."},{"num":20,"verse":"Now while they were sitting at the table, the word of Adonai came to the prophet who had brought him back, "},{"num":21,"verse":"and he cried to the man of God that came from Judah saying, “Thus says Adonai: Because you rebelled against the word of Adonai, and did not keep the commandment which Adonai your God commanded you, "},{"num":22,"verse":"but turned back, ate bread and drank water in the place of which He said to you, ‘Eat no bread and drink no water,’ your carcass will not enter the tomb of your fathers.”"},{"num":23,"verse":"So after he had eaten bread and after he had drunk, he saddled the donkey for him, for the prophet he had brought back. "},{"num":24,"verse":"But when he was gone, a lion met him along the way and killed him. So his carcass was thrown on the road with both the donkey and the lion standing beside the carcass. "},{"num":25,"verse":"Then, men passed by and saw the carcass thrown on the road with the lion standing by the carcass. So they came and told it in the town where the old prophet lived. "},{"num":26,"verse":"Now when the prophet who had brought him back from the road heard it, he said: “It is the man of God who defied the word of Adonai; therefore Adonai gave him to the lion which mauled him and killed him, according to the word Adonai spoke to him.”"},{"num":27,"verse":"Then he spoke to his sons saying: “Saddle the donkey for me!” So they saddled it. "},{"num":28,"verse":"Then he went and found his carcass lying on the road, with the donkey and the lion standing by the carcass. The lion had not eaten the carcass nor mauled the donkey. "},{"num":29,"verse":"Then the prophet picked up the carcass of the man of God, he laid it on the donkey and brought it back to the town of the old prophet to mourn and to bury him. "},{"num":30,"verse":"He laid his carcass in his own tomb and they mourned over him saying, “Oy, my brother!” "},{"num":31,"verse":"After burying him, he said to his sons, “When I die, bury me in the tomb where the man of God is buried; lay my bones beside his bones. "},{"num":32,"verse":"For the message he declared by the word of Adonai against the altar in Bethel, and against all the shrines of the high places which are in the towns of Samaria, will surely come to pass.”"},{"num":33,"verse":"Even after this, Jeroboam did not turn back from his evil way, but once again, he appointed priests for the high places from among all ranks of the people. Whoever wanted to be a priest, he consecrated him for the high places. "},{"num":34,"verse":"So this matter became sin against the house of Jeroboam, in the end, wiping it out and destroying it from the face of the earth."}]