[[],[{"type":"prose","content":"And Job answereth and saith: --"}],[{"type":"prose","content":"Truly I have known that [it is] so, And what -- is man righteous with God?"}],[{"type":"prose","content":"If he delight to strive with Him -- He doth not answer him one of a thousand."}],[{"type":"prose","content":"Wise in heart and strong in power -- Who hath hardened toward Him and is at peace?"}],[{"type":"prose","content":"Who is removing mountains, And they have not known, Who hath overturned them in His anger."}],[{"type":"prose","content":"Who is shaking earth from its place, And its pillars move themselves."}],[{"type":"prose","content":"Who is speaking to the sun, and it riseth not, And the stars He sealeth up."}],[{"type":"prose","content":"Stretching out the heavens by Himself, And treading on the heights of the sea,"}],[{"type":"prose","content":"Making Osh, Kesil, and Kimah, And the inner chambers of the south."}],[{"type":"prose","content":"Doing great things till there is no searching, And wonderful, till there is no numbering."}],[{"type":"prose","content":"Lo, He goeth over by me, and I see not, And He passeth on, and I attend not to it."}],[{"type":"prose","content":"Lo, He snatches away, who bringeth it back? Who saith unto Him, `What dost Thou?'"}],[{"type":"prose","content":"God doth not turn back His anger, Under Him bowed have proud helpers."}],[{"type":"prose","content":"How much less do I -- I answer Him? Choose out my words with Him?"}],[{"type":"prose","content":"Whom, though I were righteous, I answer not, For my judgment I make supplication."}],[{"type":"prose","content":"Though I had called and He answereth me, I do not believe that He giveth ear [to] my voice."}],[{"type":"prose","content":"Because with a tempest He bruiseth me, And hath multiplied my wounds for nought."}],[{"type":"prose","content":"He permitteth me not to refresh my spirit, But filleth me with bitter things."}],[{"type":"prose","content":"If of power, lo, the Strong One; And if of judgment -- who doth convene me?"}],[{"type":"prose","content":"If I be righteous, Mine mouth doth declare me wicked, Perfect I am! -- it declareth me perverse."}],[{"type":"prose","content":"Perfect I am! -- I know not my soul, I despise my life."}],[{"type":"prose","content":"It is the same thing, therefore I said, `The perfect and the wicked He is consuming.'"}],[{"type":"prose","content":"If a scourge doth put to death suddenly, At the trial of the innocent He laugheth."}],[{"type":"prose","content":"Earth hath been given Into the hand of the wicked one. The face of its judges he covereth, If not -- where, who [is] he?"}],[{"type":"prose","content":"My days have been swifter than a runner, They have fled, they have not seen good,"}],[{"type":"prose","content":"They have passed on with ships of reed, As an eagle darteth on food."}],[{"type":"prose","content":"Though I say, `I forget my talking, I forsake my corner, and I brighten up!'"}],[{"type":"prose","content":"I have been afraid of all my griefs, I have known that Thou dost not acquit me."}],[{"type":"prose","content":"I -- I am become wicked; why [is] this? [In] vain I labour."}],[{"type":"prose","content":"If I have washed myself with snow-water, And purified with soap my hands,"}],[{"type":"prose","content":"Then in corruption Thou dost dip me, And my garments have abominated me."}],[{"type":"prose","content":"But if a man like myself -- I answer him, We come together into judgment."}],[{"type":"prose","content":"If there were between us an umpire, He doth place his hand on us both."}],[{"type":"prose","content":"He doth turn aside from off me his rod, And His terror doth not make me afraid,"}],[{"type":"prose","content":"I speak, and do not fear Him, But I am not right with myself."}]]