[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "XIV.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Man that is born of a woman is of few days.—He now takes occasion to dilate on the miserable estate of man generally, rising from the particular instance in himself to the common lot of the race. It is not improbable that these words should be connected with the last of the former chapter. He, as a rotten thing, consumeth—a man born of woman, short of days and full of trouble, who came forth as a flower and was (began to be) cut off (at once); who fled as the shadow that abideth not. After having resolved to come into judgment with God, he pictures to himself the miserable creature with whom God will have to contend if He contends with him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Man that is born of a woman is of few days.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—He now takes occasion to dilate on the miserable estate of man generally, rising from the particular instance in himself to the common lot of the race. It is not improbable that these words should be connected with the last of the former chapter. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "He, as a rotten thing, consumeth",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "a man born of woman, short of days and full of trouble, who came forth as a flower and was ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "began to be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": " cut off ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "at once",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ";",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "who fled as the shadow that abideth not. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "After having resolved to come into judgment with God, he pictures to himself the miserable creature with whom God will have to contend if He contends with ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 14:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Man that is born of a woman — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A weak creature; and, withal, corrupt and sinful, and of that sex by which sin and all other calamities were brought into the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Is of few days — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Few at the most, in comparison with the days of the first patriarchs, much more in comparison with the days of eternity. Man is now a short-lived creature in himself, and withers so soon of his own accord, that he needs no violent hand to cut him off. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And full of trouble — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Liable to a variety of miseries. He is not only troubled, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "full of trouble, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "שׂבע רגז",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sebang rogez, satur trepidæ corporis et animi commotionis, full of disquietude and commotion in mind and body; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "exposed to labour and toil, affliction and pain, grief and fear: a day seldom passing without some cause of vexation and distress, some disorder, some calamity or other. And, therefore, Job intimates, man is a fitter object for God’s compassion than for his anger or severity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-6 Job enlarges upon the condition of man, addressing himself also to God. Every man of Adam's fallen race is short-lived. All his show of beauty, happiness, and splendour falls before the stroke of sickness or death, as the flower before the scythe; or passes away like the shadow. How is it possible for a man's conduct to be sinless, when his heart is by nature unclean? Here is a clear proof that Job understood and believed the doctrine of original sin. He seems to have intended it as a plea, why the Lord should not deal with him according to his own works, but according to His mercy and grace. It is determined, in the counsel and decree of God, how long we shall live. Our times are in his hands, the powers of nature act under him; in him we live and move. And it is very useful to reflect seriously on the shortness and uncertainty of human life, and the fading nature of all earthly enjoyments. But it is still more important to look at the cause, and remedy of these evils. Until we are born of the Spirit, no spiritually good thing dwells in us, or can proceed from us. Even the little good in the regenerate is defiled with sin. We should therefore humble ourselves before God, and cast ourselves wholly on the mercy of God, through our Divine Surety. We should daily seek the renewing of the Holy Ghost, and look to heaven as the only place of perfect holiness and happiness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Man that is born of a woman - See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The object of Job in these verses, is to show the frailty and feebleness of man. He, therefore, dwells on many circumstances adapted to this, and this is one of the most stirring and beautiful. He alludes to the delicacy and feebleness, of the female sex, and says that the offspring of one so frail must himself be frail; the child of one so feeble must himself be feeble. Possibly also there may be an allusion here to the prevailing opinion in the Oriental world of the inferiority of the female sex. The following forcible lines by Lord Bacon, express a similar sentiment:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The world's a bubble, and the life of man",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Less than a span,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In his conception wretched, from the womb",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So to the tomb.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Curst from the cradle, and brought up to years",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With cares and fears.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who then to frail mortality shall trust.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But limns the water, or but writes in dust.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of few days - Hebrew \"Brief of days;\" compare Psalm 90:10; Genesis 47:9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of few days - Hebrew \"Brief of days;\" compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 90:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And full of trouble - Compare the notes at Job 3:17. Who cannot bear witness to this? How expressive a description is it of life! And even too where life seems most happy; where the sun of prosperity seems to shine on our way, and where blessings like drops of dew seem to descend on us, how true is it still theft life is full of trouble, and that the way of man is a weary way! Despite all that he can do - all his care, and skill, and learning and wealth, life is a weary pilgrimage, and is burdened with many woes. \"Few and evil have the days of the years of my pilgrimage been, ' said the patriarch Jacob, and they who have advanced near the same number of years with him can utter with deep emotion the same beautiful language. Goethe, the celebrated German, said of himself in advanced age, \"They have called me a child of fortune, nor have I any wish to complain of the course of my life. Yet it has been nothing but labor and sorrow, and I may truly say that in seventy-five years I have not had four weeks of true comfort. It was the constant rolling of a stone that was always to be lifted anew. When I look back upon my earlier and middle life, and consider how few are left of those that were young with me, I am reminded of a summer visit to a watering-place. On arriving one makes the acquaintance of those who have been already some time there, and leave the week following. This loss is painful. Now one becomes attached to the second generation, with which one lives for a time and becomes intimately connected. But this also passes away and leaves us solitary with the third, which arrives shortly before our own departure, and with which we have no desire to have much contact.\" - Rauch's Psychology, p. 343. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And full of trouble - Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Who cannot bear witness to this? How expressive a description is it of life! And even too where life seems most happy; where the sun of prosperity seems to shine on our way, and where blessings like drops of dew seem to descend on us, how true is it still theft life is full of trouble, and that the way of man is a weary way! Despite all that he can do - all his care, and skill, and learning and wealth, life is a weary pilgrimage, and is burdened with many woes. \"Few and evil have the days of the years of my pilgrimage been, ' said the patriarch Jacob, and they who have advanced near the same number of years with him can utter with deep emotion the same beautiful language. Goethe, the celebrated German, said of himself in advanced age, \"They have called me a child of fortune, nor have I any wish to complain of the course of my life. Yet it has been nothing but labor and sorrow, and I may truly say that in seventy-five years I have not had four weeks of true comfort. It was the constant rolling of a stone that was always to be lifted anew. When I look back upon my earlier and middle life, and consider how few are left of those that were young with me, I am reminded of a summer visit to a watering-place. On arriving one makes the acquaintance of those who have been already some time there, and leave the week following. This loss is painful. Now one becomes attached to the second generation, with which one lives for a time and becomes intimately connected. But this also passes away and leaves us solitary with the third, which arrives shortly before our own departure, and with which we have no desire to have much contact.\" - Rauch's Psychology, p. 343. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 14",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Job 14:1-22. Job Passes from His Own to the Common Misery of Mankind.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. woman—feeble, and in the East looked down upon (Ge 2:21). Man being born of one so frail must be frail himself (Mt 11:11).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "few days—(Ge 47:9; Ps 90:10). Literally, \"short of days.\" Man is the reverse of full of days and short of trouble.Man’s natural misery, sin, and short life, our plea with God not to disturb us by his power, but suffer us to accomplish our appointed time, Job 14:1-6. The other creatures decay and revive; but man, once dead, returneth not till the end of all things, Job 14:7-12. He wisheth to be hid in the grave, in hopes of the resurrection, Job 14:13-15; for that here God was strict in marking his iniquity, and prevailed against him, Job 14:16-20. Man’s misery with respect to his children, Job 14:21,22.  That is born of a woman. This expression is here used, either, 1. To intimate the cause of man’s misery, that he was born of a woman, a weak creature, 1 Peter 3:7, and withal corrupt and sinful, and of that sex by which sin and calamity was brought into the world. See Job 15:14 Genesis 3:17 1 Timothy 2:13,14. Or, 2. To note the universality of the thing; every man, every mother’s son, as we use to speak. Men’s fathers are ofttimes unknown and uncertain, but their mothers are always definite and certain. One man was then to be born, and afterwards was born, without an earthly father, to wit, our Lord and Saviour Christ; but no man was ever born without a mother. Of few days;  a short-lived creature in himself, and therefore needs no violent hand to cut him off, because he withereth so soon of his own accord. Full of trouble;  and therefore a fitter object for Divine compassion, than for his fury or severity. He chiefly intendeth himself; but he expresseth it thus generally, partly to relieve himself with the thoughts of the common calamities of mankind; and partly to move God with the consideration of the frailty and misery of human nature, and consequently of his condition. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "few days—(Ge 47:9; Ps 90:10). Literally, \"short of days.\" Man is the reverse of full of days and short of trouble.Man’s natural misery, sin, and short life, our plea with God not to disturb us by his power, but suffer us to accomplish our appointed time, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 14:1-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The other creatures decay and revive; but man, once dead, returneth not till the end of all things, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 14:7-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He wisheth to be hid in the grave, in hopes of the resurrection, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 14:13-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for that here God was strict in marking his iniquity, and prevailed against him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 14:16-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Man’s misery with respect to his children, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 14:21,22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "That is born of a woman.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " This expression is here used, either, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1. To intimate the cause of man’s misery, that he was born of a woman, a weak creature, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Peter 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and withal corrupt and sinful, and of that sex by which sin and calamity was brought into the world. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 15:14 Genesis 3:17 1 Timothy 2:13,14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. To note the universality of the thing; every man, every mother’s son, as we use to speak. Men’s fathers are ofttimes unknown and uncertain, but their mothers are always definite and certain. One man was then to be born, and afterwards was born, without an earthly father, to wit, our Lord and Saviour Christ; but no man was ever born without a mother. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Of few days; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a short-lived creature in himself, and therefore needs no violent hand to cut him off, because he withereth so soon of his own accord. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Full of trouble; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and therefore a fitter object for Divine compassion, than for his fury or severity. He chiefly intendeth himself; but he expresseth it thus generally, partly to relieve himself with the thoughts of the common calamities of mankind; and partly to move God with the consideration of the frailty and misery of human nature, and consequently of his condition. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Man that is born of a woman,.... Man, Adam; not the first man, so called, for he was made and created out of the dust of the earth, and not born of a woman; the woman was made out of him, and not he of her; \"earthly man\", as Mr. Broughton translates it, as every descendant of Adam is; as is the earth, such are they that are earthy, everyone of which is born of a woman; yet not as opposed unto and distinguished from the heavenly One, or the Lord from heaven, for he also as man was made and born of a woman: this, though a proper description of all mankind, there being none but what are born of a woman, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; yet Job chiefly designs himself; for having spoken of his wasting circumstances in which he was, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", goes on in this to treat of his frailty and mortality, and to improve it into an argument with God for pity and mercy, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; where he speaks of himself in the first person, as here in the third, and all along: he may have respect in this clause to Eve, the mother of all living, from whom all descend, and of whom, in a sense, they may be said to be born; or else to his immediate parent, he and every man being born of a woman; no man, but the first, ever came into the world in any other way; there is one that came into the world without an earthly father, and that is our Lord Jesus Christ, but none without a mother; nor lie, who indeed was born of a virgin, and so in an extraordinary and miraculous manner; and this is observed, not so much on account of natural descent, or to denote that, as being reckoned from the mother, she having so great a concern in the production of man, conceiving, bearing, and bringing him forth; nor to remark the sinfulness of nature, though one born of a sinful woman must needs be so too, since this is expressed clearly in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the weakness and frailty of man; as is the creature that generates, such is that that is generated; creatures born of strong ones are strong, and of weak ones weak; a creature born of a lion is a strong one; and man, born of a woman, must be weak and feeble, and no wonder he is short lived, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "is of few days; or \"short of days\" (c); comes short of the days he might have lived, if man had never sinned, and comes short of the days the first man did live, and which those before the flood generally lived, who most of them lived upwards of nine hundred years; whereas now, and ever since the times of Moses, and about which Job 54ed, the days of the years of man are but threescore and ten; and such are shorter of days still, who live not more than half this time, who are cut off in the bloom and prime of life, the days of whose youth are shortened, who die in their youth, or in their childhood and infancy; and such especially are short of days who are carried from the womb to the grave, or die as soon as born; and those that live the longest, their days are but few, when compared with the days of eternity, or with those men shall live in another world, either good men in heaven, or wicked men in hell, which will be for ever; and especially with respect to God, with whom one day is as a thousand years, and a thousand years as one day, and therefore the days and age of man are as nothing before him. Job has here also a respect to himself, whose days in his own apprehension were very few, and just at an end, and therefore craves pity and compassion, see Job 10:20; and what aggravates the shortness of man's days is, as it follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "is of few days; or \"short of days\" (c); comes short of the days he might have lived, if man had never sinned, and comes short of the days the first man did live, and which those before the flood generally lived, who most of them lived upwards of nine hundred years; whereas now, and ever since the times of Moses, and about which ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 54",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "ed, the days of the years of man are but threescore and ten; and such are shorter of days still, who live not more than half this time, who are cut off in the bloom and prime of life, the days of whose youth are shortened, who die in their youth, or in their childhood and infancy; and such especially are short of days who are carried from the womb to the grave, or die as soon as born; and those that live the longest, their days are but few, when compared with the days of eternity, or with those men shall live in another world, either good men in heaven, or wicked men in hell, which will be for ever; and especially with respect to God, with whom one day is as a thousand years, and a thousand years as one day, and therefore the days and age of man are as nothing before him. Job has here also a respect to himself, whose days in his own apprehension were very few, and just at an end, and therefore craves pity and compassion, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and what aggravates the shortness of man's days is, as it follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and full of trouble; man is born to it, being born in sin; sin and trouble go together, where there is sin there is trouble; sin entered into the world, and death by it, with the numerous train of afflictions and miseries which issue in it: all men have their troubles, some of one sort, and some of another; wicked men are not indeed in trouble as other men, as good men are; they have not the same sort of trouble, yet are not exempt from all; they are \"full of commotion\" (d) disquietude and uneasiness, as the word signifies; they are restless, and ever in motion; they are like the troubled sea, that cannot rest, but is continually casting up mire and dirt; some are of such tempers and dispositions, that they cannot sleep unless they do mischief; and though they are many of them prosperous in their worldly circumstances, there are others that are reduced to poverty and distress, are attended with diseases and disorders, pains and sores, and blaspheme that God that has power over them; and these are of all men the most miserable, having no interest in God, in his loving kindness, nor any enjoyment of his presence, and so nothing to support them in, and carry them through their troubles; and though they are generally without any sense of sin or danger, have no remorse of conscience, and their hearts are hardened; yet at times they are \"full of trembling\" (e), as some render the words; are seized with a panic through the judgments of God that are upon them, or are coming upon them, or when death is made the king of terrors to them: and good men they have their troubles; besides those in common with others, they have inward troubles arising from the vanity of their minds and thoughts, the impurity of their hearts, and the power of indwelling sin in them, and especially from the breaking forth of it in words and deeds; from the weakness of their graces, from the hidings of God's face, and the temptations of Satan: in short, Job's meaning is, that men in the ordinary course of things meet with so much trouble, that there is no need of any extraordinary afflictions to be laid on them, such as his were. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c)  \"brevis dierum\", Montanus, Schmidt, Michaelis, Schultens; so Beza, Vatablus, Drusius, Mercerus. (d)  \"satur commotione\", Junius & Tremellius, Piscator, Cocceius, Schmidt, Michaelis. (e) \"Saturus tremore\", Montanus; \"satur trepidi tumultus\", Schultens. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c)  \"brevis dierum\", Montanus, Schmidt, Michaelis, Schultens; so Beza, Vatablus, Drusius, Mercerus. (d)  \"satur commotione\", Junius & Tremellius, Piscator, Cocceius, Schmidt, Michaelis. (e) \"Saturus tremore\", Montanus; \"satur trepidi tumultus\", Schultens. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Man {a} that is born of a woman is of few days, and full of trouble.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Man ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " born of a woman ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of few days, and full of trouble.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Taking the opportunity of his adversaries words he describes the state of man's life from his birth to his death.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the last verse of ch. 13. Job thought of himself as one of the race of men, and now he speaks of the characteristics of this race.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "born of a woman",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The offspring of one herself weak and doomed to sorrow (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") must also be weak and doomed to trouble, cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 15:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 25:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - This chapter, in which Job concludes the fourth of his addresses, is characterized by a tone of mild and gentle expostulation, which contrasts with the comparative vehemence and passion of the two preceding chapters. It would seem that the patriarch, having vented his feelings, experiences a certain relief, an interval of calm, in which, his own woes pressing less heavily upon him, he is content to moralize on the general condition of humanity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Man that is born of a woman",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this fact Job sees the origin of man's inherent  weakness. He is \"born of a woman,\" who is \"the weaker vessel\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He is conceived by her in uncleanness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. below, ver. 4), brought forth in sorrow and pain (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") suckled at her breasts, placed for years under her guidance. No wonder that he shares the weakness of which she is a sort of type. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Is of few days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "short of days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Length and shortness of days are, no doubt, relative; and it is difficult to say what term of life would not have seemed short to men as they looked back upon it. To Jacob, at the age of a hundred and thirty, it appeared that \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "few",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and evil had the days of the years of his life been\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Methuselah, perhaps, thought the same. We all, as we come towards old age, and death draws manifestly near, feel as if we had only just begun to live, as if, at any rate, we had not done half our work, and were about to be cut off before our time. But would the case be seriously different if our tale of years were doubled? And fall of trouble (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Job 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  1  Man that is born of a woman,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Short of days and full of unrest,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  2  Cometh forth as a flower and is cut down;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He fleeth as a shadow, and continueth not.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  3  Moreover, Thou openest Thine eyes upon him,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And Thou drawest me before Thy tribunal.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Even if he yields to the restraint which his suffering imposes on him, to regard himself as a sinner undergoing punishment, he is not able to satisfy himself by thus persuading himself to this view of God's conduct towards him. How can God pass so strict a judgment on man, whose life is so short and full of sorrow, and which cannot possibly be pure from sin? - Job 14:1. אדם is followed by three clauses in apposition, or rather two, for אשּׁה ילוּד (lxx γεννητὸς γυναικός, as Matthew 11:11; comp. γέννημα γυν. Sir. 10:18) belongs to the subject as an adjectival clause: woman-born man, short-lived, and full of unrest, opens out as a flower. Woman is weak, with pain she brings forth children; she is impure during her lying-in, therefore weakness, suffering, and impurity is the portion of man even from the birth (Job 15:14; Job 25:4). As קצר is the constr. of קצר, so (רגז) שׂבע is from שׂבע, which here, as Job 10:15, has the strong signification: endowed (with adversity). It is questionable whether ויּמּל, Job 14:2, signifies et marcescit or et succiditur. We have decided here as elsewhere (vid., on Psalm 37:2; Psalm 90:6, Genesis, S. 383) in favour of the latter meaning, and as the Targ. (אתמולל), translated \"he is mown down.\" For this meaning (prop. to cut off from above or before, to lop off), - in which the verb מלל (מוּל נמל) is become technical for the περιτομή, - is most probably favoured by its application in Job 24:24; where Jerome however translates, sicut summitates spicarum conterentur, since he derives ימלו from מלל in the signification not found in the Bible (unless perhaps retained in מלילה ni , Deuteronomy 23:25), fricare (Arab. mll, frigere, to parch). At the same time, the signification marcescere, which certainly cannot be combined with praecidere, but may be with fricare (conterere), is not unnatural; it is more appropriate to a flower (comp. נבל ציץ, Isaiah 40:7); it accords with the parallelism Psalm 37:2, and must be considered etymologically possible in comparison with ק־מל א־מל. But it is not supported by any dialect, and none of the old translations furnish any certain evidence in its favour; ימולל, Psalm 90:6, which is to be understood impersonally rather than intransitively, does not favour it; and none of the passages in which ימּל occurs demand it: least of all Job 24:24, where praeciduntur is more suitable than, and Job 18:16, praeciditur, quite as suitable as, marcescit. For these reasons we also take ויּמּל here, not as fut. Kal from מלל, or, as Hahn, from נמל  equals  נבל, to wither, but as fut. Niph. from מלל, to cut down. At the same time, we do not deny the possibility of the notion of withering having been connected with ימל, whether it be that it belonged originally and independently to the root מל, or has branched off from some other radical notion, as \"to fall in pieces\" (lxx here ἐξέπεσεν, and similarly also Job 18:16; Job 24:24; comp. מלחים, rags, נמלח, to come to pieces, to be dissolved) or \"to become soft\" (with which the significations in the dialects, to grind and to parch, may be connected). As a flower, which having opened out is soon cut or withered, is man: אף, accedit quod, insuper. This particle, related to ἐπὶ, adds an enhancing cumulat. More than this, God keeps His eye open (not: His eyes, for the correct reading, expressly noted by the Masora, is עינך without Jod plur.), על־זה, super hoc s. tali, over this poor child of man, who is a perishable flower, and not a \"walking light, but a fleeting shadow\" (Gregory the Great), to watch for and punish his sins, and brings Job to judgment before himself, His tribunal which puts down every justification. Elsewhere the word is pointed במשׁפט, Job 9:32; Job 22:4; here it is במשׁפט, because the idea is rendered determinate by the addition of עמך. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Even if he yields to the restraint which his suffering imposes on him, to regard himself as a sinner undergoing punishment, he is not able to satisfy himself by thus persuading himself to this view of God's conduct towards him. How can God pass so strict a judgment on man, whose life is so short and full of sorrow, and which cannot possibly be pure from sin? - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". אדם is followed by three clauses in apposition, or rather two, for אשּׁה ילוּד (lxx γεννητὸς γυναικός, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; comp. γέννημα γυν. Sir. 10:18) belongs to the subject as an adjectival clause: woman-born man, short-lived, and full of unrest, opens out as a flower. Woman is weak, with pain she brings forth children; she is impure during her lying-in, therefore weakness, suffering, and impurity is the portion of man even from the birth (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). As קצר is the constr. of קצר, so (רגז) שׂבע is from שׂבע, which here, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", has the strong signification: endowed (with adversity). It is questionable whether ויּמּל, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", signifies et marcescit or et succiditur. We have decided here as elsewhere (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 90:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Genesis, S. 383) in favour of the latter meaning, and as the Targ. (אתמולל), translated \"he is mown down.\" For this meaning (prop. to cut off from above or before, to lop off), - in which the verb מלל (מוּל נמל) is become technical for the περιτομή, - is most probably favoured by its application in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 24:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; where Jerome however translates, sicut summitates spicarum conterentur, since he derives ימלו from מלל in the signification not found in the Bible (unless perhaps retained in מלילה ni , ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 23:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), fricare (Arab. mll, frigere, to parch). At the same time, the signification marcescere, which certainly cannot be combined with praecidere, but may be with fricare (conterere), is not unnatural; it is more appropriate to a flower (comp. נבל ציץ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); it accords with the parallelism ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and must be considered etymologically possible in comparison with ק־מל א־מל. But it is not supported by any dialect, and none of the old translations furnish any certain evidence in its favour; ימולל, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 90:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which is to be understood impersonally rather than intransitively, does not favour it; and none of the passages in which ימּל occurs demand it: least of all ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 24:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where praeciduntur is more suitable than, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", praeciditur, quite as suitable as, marcescit. For these reasons we also take ויּמּל here, not as fut. Kal from מלל, or, as Hahn, from נמל  equals  נבל, to wither, but as fut. Niph. from מלל, to cut down. At the same time, we do not deny the possibility of the notion of withering having been connected with ימל, whether it be that it belonged originally and independently to the root מל, or has branched off from some other radical notion, as \"to fall in pieces\" (lxx here ἐξέπεσεν, and similarly also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 24:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; comp. מלחים, rags, נמלח, to come to pieces, to be dissolved) or \"to become soft\" (with which the significations in the dialects, to grind and to parch, may be connected). As a flower, which having opened out is soon cut or withered, is man: אף, accedit quod, insuper. This particle, related to ἐπὶ, adds an enhancing cumulat. More than this, God keeps His eye open (not: His eyes, for the correct reading, expressly noted by the Masora, is עינך without Jod plur.), על־זה, super hoc s. tali, over this poor child of man, who is a perishable flower, and not a \"walking light, but a fleeting shadow\" (Gregory the Great), to watch for and punish his sins, and brings Job to judgment before himself, His tribunal which puts down every justification. Elsewhere the word is pointed במשׁפט, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; here it is במשׁפט, because the idea is rendered determinate by the addition of עמך. ",
            "children": []
          }
        ]
      }
    ]
  }
]