[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 14:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O that thou wouldest hide me in the grave — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The grave is not only a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "resting-place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hiding-place ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to the children of God: Christ has the key of the grave to open and let in now, and to let out at the resurrection. God hides his people in the grave as we hide our treasure in a place of secrecy and safety; and he that hides will find what he has hid, and nothing shall be lost. O that thou wouldst hide me, not only from the storms and troubles of this life, but for the bliss and glory of a better life; let me lie in the grave reserved for immortality, in secret from all the world, but not from thee, not from those eyes which saw my substance when first curiously wrought in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the lowest parts of the earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus, it was not only in a passionate weariness of this life that he wished to die, but in a pious assurance of a better life, to which at length he should arise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Until thy wrath be past — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As long as our bodies lie in the grave there are some effects of God’s wrath against sin, but when the body is raised, that wrath is wholly past, and death, the last enemy, is totally destroyed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That thou wouldest appoint me a set time — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not only fix a time when thou wilt end my sufferings and my life, but when thou wilt remember my flesh lodged in the grave, as thou didst remember ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Noah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "every living thing ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the ark, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The bodies of the saints shall not be forgotten in the dust; there is a time appointed, a set time, for their being inquired after.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:7-15 Though a tree is cut down, yet, in a moist situation, shoots come forth, and grow up as a newly planted tree. But when man is cut off by death, he is for ever removed from his place in this world. The life of man may fitly be compared to the waters of a land flood, which spread far, but soon dry up. All Job's expressions here show his belief in the great doctrine of the resurrection. Job's friends proving miserable comforters, he pleases himself with the expectation of a change. If our sins are forgiven, and our hearts renewed to holiness, heaven will be the rest of our souls, while our bodies are hidden in the grave from the malice of our enemies, feeling no more pain from our corruptions, or our corrections.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Oh that thou wouldest hide me in the grave; - compare the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. Hebrew \"in Sheol\" - ב־שׁאול  bı̂-she'ôl. Vulgate, \"in inferno.\" Septuagint ἐν ἅδῃ  en Hadē - \"in Hades.\" On the meaning of the word \"Sheol,\" see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It does not mean here, I think, the grave. It means the region of departed spirits, the place of the dead, where he wished to be, until the tempest of the wrath of God should pass by. He wished to be shut up in some place where the fury of that tempest would not meet him, and where he would be safe. On the meaning of this passage, however, there has been considerable variety of opinion among expositors. Many suppose that the word here properly means \"the grave,\" and that Job was willing to wait there until the wrath of God should be spent, and then that he desired to be brought forth in the general resurrection of the dead.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So the Chaldee interprets it of the grave - קבורתא. There is evidently a desire on the part of Job to be hid in some secret place until the tempest of wrath should sweep by, and until he should be safe. There is an expectation that he would live again at some future period, and a desire to live after the present tokens of the wrath of God should pass by. It is probably a wish for a safe retreat or a hiding-place - where he might be secure, as from a storm. A somewhat similar expression occurs in Isaiah 2:19, where it is said that people would go into holes and caverns until the storm of wrath should pass by, or in order to escape it. But whether Job meant the grave, or the place of departed spirits, cannot be determined, and is not material. In the view of the ancients the one was not remote from the other. The entrance to Sheol was the grave; and either of them would furnish the protection sought. It should be added, that the grave was with the ancients usually a cave, or an excavation from the rock, and such a place might suggest the idea of a hiding-place from the raging storm.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So the Chaldee interprets it of the grave - קבורתא. There is evidently a desire on the part of Job to be hid in some secret place until the tempest of wrath should sweep by, and until he should be safe. There is an expectation that he would live again at some future period, and a desire to live after the present tokens of the wrath of God should pass by. It is probably a wish for a safe retreat or a hiding-place - where he might be secure, as from a storm. A somewhat similar expression occurs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is said that people would go into holes and caverns until the storm of wrath should pass by, or in order to escape it. But whether Job meant the grave, or the place of departed spirits, cannot be determined, and is not material. In the view of the ancients the one was not remote from the other. The entrance to Sheol was the grave; and either of them would furnish the protection sought. It should be added, that the grave was with the ancients usually a cave, or an excavation from the rock, and such a place might suggest the idea of a hiding-place from the raging storm.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "That thou wouldest appoint me a set time - When I should be delivered or rescued. Herder renders this, \"Appoint me then a new term.\" The word rendered \"a set time\" - חק  chôq - means, properly, something decreed, prescribed, appointed and here an appointed time when God would remember or revisit him. It is the expression of his lingering love of life. He had wished to die. He was borne down by heavy trials, and desired a release. He longed even for the grave; compare Job 3:20-22. But there is the instinctive love of life in his bosom, and he asks that God would appoint a time, though ever so remote, in which he would return to him, and permit him to live again. There is the secret hope of some future life - though remote; and he is willing to be hid for any period of time until the wrath of God should pass by, if he might live again. Such is the lingering desire of life in the bosom of man in the severest trials, and the darkest hours; and so instinctively does man look on even to the most remote period with the hope of life. Nature speaks out in the desires of Job; and one of the objects of the poem is to describe the workings of nature with reference to a future state in the severe trials to which he was subjected. We cannot but remark here, what support and consolation would he have found in the clear revelation which we have of the future world, and what a debt of gratitude do we owe to that gospel which has brought life and immortality to light! ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That thou wouldest appoint me a set time - When I should be delivered or rescued. Herder renders this, \"Appoint me then a new term.\" The word rendered \"a set time\" - חק  chôq - means, properly, something decreed, prescribed, appointed and here an appointed time when God would remember or revisit him. It is the expression of his lingering love of life. He had wished to die. He was borne down by heavy trials, and desired a release. He longed even for the grave; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 3:20-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But there is the instinctive love of life in his bosom, and he asks that God would appoint a time, though ever so remote, in which he would return to him, and permit him to live again. There is the secret hope of some future life - though remote; and he is willing to be hid for any period of time until the wrath of God should pass by, if he might live again. Such is the lingering desire of life in the bosom of man in the severest trials, and the darkest hours; and so instinctively does man look on even to the most remote period with the hope of life. Nature speaks out in the desires of Job; and one of the objects of the poem is to describe the workings of nature with reference to a future state in the severe trials to which he was subjected. We cannot but remark here, what support and consolation would he have found in the clear revelation which we have of the future world, and what a debt of gratitude do we owe to that gospel which has brought life and immortality to light! ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. Job wishes to be kept hidden in the grave until God's wrath against him shall have passed away. So while God's wrath is visiting the earth for the abounding apostasy which is to precede the second coming, God's people shall be hidden against the resurrection glory (Isa 26:19-21).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "set time—a decreed time (Ac 1:7).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the grave; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. In some dark vault under ground, such as good men hide themselves in times of persecution, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 11:38",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:38",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Lord, hide me in some hiding place from thy wrath, and all the intolerable effects of it, which are upon me; for I cannot be hid from thee, but by thee. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. In the grave, properly so called. Though I know life once lost is irrecoverable, yet I heartily desire death, rather than to continue in these torments. And if the next words and wish seem to suppose the continuance of his life, that is not strange; for he speaks like one almost distracted with his miseries, sometimes wishing one thing, sometimes another and the quite contrary, as such persons use to do. And these wishes may be understood disjunctively, I wish either that I were dead, or that God would give me life free from these torments. Or the place may be understood thus, I could wish, if it were possible, that I might lie in the grave for a time till these storms be blown over, and then be restored to a comfortable life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That thou wouldest keep me secret; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in some secret and safe place, under the shadow of thy wings and favour, that I may have some support and comfort from thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Until thy wrath be past; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whilst I am oppressed with such grievous and various calamities; which he calls God’s wrath, because they were, or seemed to be, the effects of his wrath. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A set time, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, to my sufferings, as thou hast done to my life, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 14:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Remember me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. wherein thou wilt remember me, to wit, in mercy, or so as to deliver me; for it is well known that God is frequently said to forget those whom he suffers to continue in misery, and to remember those whom he delivers out of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And that thou wouldest hide me in the grave,.... The house appointed for all living, which some understand by the \"chambers\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; The cemeteries or dormitories of the saints, where they lie and sleep until the indignation of God against a wicked world is over and past; or in Hades, the state of the dead, where they are insensible of what is done in this world, what calamities and judgments are on the inhabitants of it, and so are not affected and grieved with these things; or in some cavern of the earth, in the utmost recesses of it, in the very centre thereof, if possible; his wish is, to be buried alive, or to live in some subterraneous place, free from his present afflictions and misery, than to be upon earth with them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou wouldest keep me secret; so that no eye should see him, that is, no human eye; for he did not expect to be hid from the sight of God, be he where he would, before whom hell and destruction, or the grave, are and have no covering; and not only be secret, but safe from all trials and troubles, oppressions and oppressors; especially as he may mean the grave where the wicked cease from troubling and the weary are at rest; the keys of which Christ keeps in his hands, and locks and unlocks, and none but him; and where he has laid up his jewels, the precious dust of his saints and where they and that will be preserved as hidden treasure: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "until thy wrath be past; either with respect to others, an ungodly world, to punish whom God sometimes comes out of his place in great wrath and indignation; and to prevent his dear children and people from being involved in common and public calamities, he takes them away beforehand, and hides them in his chambers, Isaiah 26:19; or with respect to himself, as to his own apprehension of things, who imagined that the wrath of God was upon him, being severely afflicted by him; all the effects of which he supposed would not be removed until he was brought to the dust, from whence he came, and until his body was changed at the resurrection; till that time there are some appearances of the displeasure of against sin: and then follows another petition, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "until thy wrath be past; either with respect to others, an ungodly world, to punish whom God sometimes comes out of his place in great wrath and indignation; and to prevent his dear children and people from being involved in common and public calamities, he takes them away beforehand, and hides them in his chambers, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or with respect to himself, as to his own apprehension of things, who imagined that the wrath of God was upon him, being severely afflicted by him; all the effects of which he supposed would not be removed until he was brought to the dust, from whence he came, and until his body was changed at the resurrection; till that time there are some appearances of the displeasure of against sin: and then follows another petition, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou wouldest appoint me a set time, and remember me; either for his going down to the grave, and being hid there, for which there is an appointed time; for as that is the place appointed for man, it is appointed for man to go unto it, and the time when, as appears from Job 14:5; or his coming out of the grave, for his resurrection from thence, which also is fixed, even the last day, the day God has appointed to judge the world in righteousness by Christ at which time the dead will be raised; though of that day and hour no man knows: unless he should mean a time for deliverance from his afflictions which also is set; for God, as he settles the bounds of an affliction, how far it should go, and no farther, so likewise the time when it should end; and either of these Job might call a remembering of him, who thought himself in his present case, as a dead man, out of mind, as those that lie in the grave, remembered no more. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that thou wouldest appoint me a set time, and remember me; either for his going down to the grave, and being hid there, for which there is an appointed time; for as that is the place appointed for man, it is appointed for man to go unto it, and the time when, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or his coming out of the grave, for his resurrection from thence, which also is fixed, even the last day, the day God has appointed to judge the world in righteousness by Christ at which time the dead will be raised; though of that day and hour no man knows: unless he should mean a time for deliverance from his afflictions which also is set; for God, as he settles the bounds of an affliction, how far it should go, and no farther, so likewise the time when it should end; and either of these Job might call a remembering of him, who thought himself in his present case, as a dead man, out of mind, as those that lie in the grave, remembered no more. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "O that thou wouldest hide me in the grave, that thou wouldest keep me secret, until thy {e} wrath be past, that thou wouldest appoint me a set time, and {f} remember me!",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O that thou wouldest hide me in the grave, that thou wouldest keep me secret, until thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wrath be past, that thou wouldest appoint me a set time, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " remember me!",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) By this he declares that the fear of God's judgment was the reason why he desired to die.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) That is, relieve my pain and take me to mercy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13–15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Having pursued the destiny of man through all its steps down to its lowest, its complete extinction in death, Job, with a revulsion created by the instinctive demands of the human spirit, rises to the thought that there might be another life after this one. This thought is expressed in the form of an impassioned desire.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "To understand these verses the Hebrew conception of death must be remembered. Death was not an end of personal existence: the dead person subsisted, he did not live. He descended into Sheol, the abode of deceased persons. His existence was a dreamy shadow of his past life. He had no communion with the living, whether men or God; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 3:12-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 10:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:20-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This idea of death is not strictly the teaching of revelation, it is the popular idea from which revelation starts, and revelation on the question rather consists in exhibiting to us how the pious soul struggled with this popular conception and sought to overcome it, and how faith demanded and realized, as faith does, its demand, that the communion with God enjoyed in this life should not be interrupted in death. This was in short a demand and a faith that the state of Sheol should be overleaped, and that the believing soul should be “taken” by God in death to Himself, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was the solution that generally presented itself to the mind when death was contemplated. The present passage differs in two particulars. It does not exhibit such assured faith as these passages in the Psalms. The problem before the Psalmists was a much simpler one than that before Job. They were men who, when they wrote their words of faith, enjoyed God’s fellowship, and their faith protested against this fellowship being interrupted in death. But Job has lost the sense of God’s fellowship through his afflictions, which are to his mind proof of God’s estrangement from him, hence he has so to speak a double obstacle to overcome, where the Psalmists had only one, and this makes him do no more here than utter a prayer, while the Psalmists expressed a firm assurance. In the following chapters, especially ch. 19, Job also rises to assurance. In another particular this passage differs from these Psalms. It contemplates a different and much more complete solution of the problem. In both the hope of immortality has a purely religious foundation. It springs from the irrepressible longing for communion with God. The Psalmists, in the actual enjoyment of this communion, either protest against death absolutely (Psalms 16), and demand a continuance in life that this fellowship may continue—that is, they rise to the idea of true immortality; or, contemplating death as a fact, they protest against the popular conception of it, and demand that the deceased person shall not sink into Sheol, but pass across its gulf to God. Job’s conception is different from either of these, because his circumstances are different. He does not enjoy the fellowship of God, his afflictions are evidence of the contrary. His firm conviction is that his malady is mortal, in other words, that God’s anger will pursue him to the grave. On this side of death he has no hope of a return to God’s favour. Hence, contemplating that he shall die under God’s anger, his thought is that he might remain in Sheol till God’s wrath be past, for He keepeth not His anger for ever; that God would appoint him a period to remain in death and then remember him with returning mercy and call him back again to His fellowship. But to his mind this involves a complete return to life again of the whole man (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 14:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), for in death there is no fellowship with God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Thus his solution, though it appears to his mind only as a momentary gleam of light, is broader than that of the Psalmists, and corresponds to that made known in subsequent revelation. It is probable that this conception, which the Author of the Poem allows Job to rise to out of the very extremity of his despair, was one not unfamiliar to himself (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The verses read as a whole:—",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "13  Oh that thou wouldst hide me in Sheol,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "  That thou wouldst keep me secret till thy wrath be past,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "  That thou wouldst appoint me a set time and remember me—",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "14  If a man die shall he live again?—",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "  All the days of my appointed time would I wait",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "  Till my release came;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "15  Thou wouldst call and I would answer thee,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "  Thou wouldst have a desire to the work of thine hands.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As Job follows the fascinating thought, the feeling forces itself upon his mind how much is implied in it, nothing less than that a man when dead should live again (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 14:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), but he will not allow himself to be arrested in his pursuit of the glorious vision—he describes how he would wait all the period appointed to him (his “warfare,” cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") till his release came, and dwells upon the joy and readiness with which he would answer the voice of his Creator calling him to His fellowship again when He longed after the work of His hands long estranged and hidden from Him (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The words “call” and “answer,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 14:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", have here naturally quite a different sense from the forensic or judicial one which belongs to them in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and similar passages.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Oh that thou wouldest hide me in the grave!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " literally, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Sheol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which here does not so much mean \"the grave,\" as the place of departed spirits, described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 10:21, 22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Job desires to have God's protection in that\" land of darkness,\" and to be \"hidden\" there by him until his wrath be past. It has been generally supposed that he means after his death; but Schultens thinks his desire was to descend to Sheol ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "alive",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and there remain, while his punishment continued, hidden from the eyes of men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That thou wouldest keep me secret, until thy wrath be past.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Job assumes that, if he is being punished for his youthful sins (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), his punishment will not be for long - at any rate, not for ever; God's anger will at last be satisfied and cease. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That thou wouldest appoint me a set time, and remember me!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How long he may have to suffer be does not greatly care. Only let it be \"a set time\" - a fixed, definite period  - and at the end of it, let God\" remember\" him. Job 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13  Oh that Thou wouldst hide me in Shel,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That Thou wouldst conceal me till Thine anger change,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That Thou wouldst appoint me a time and then remember me!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14  If man dieth, shall he live again?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All the days of my warfare would Iwait,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Until my change should come.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15  Thou wouldst call and I would answer,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou wouldst have a desire for the work of Thy hands - ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  For now thou numberest my steps,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And dost not restrain thyself over my sins.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The optative יתּן מי introduces a wish that has reference to the future, and is therefore, as at Job 6:8, followed by futt.; comp. on the other hand, Job 23:3, utinam noverim. The language of the wish reminds one of such passages in the Psalms as Psalm 31:21; Psalm 27:5 (comp. Isaiah 26:20): \"In the day of trouble He hideth me in His pavilion, and in the secret of His tabernacle doth He conceal me.\" So Job wishes that Hades, into which the wrath of God now precipitates him for ever, may only be a temporary place of safety for him, until the wrath of God turn away (שׁוּב, comp. the causative, Job 9:13); that God would appoint to him, when there, a חק, i.e., a terminus ad quem (comp. Job 14:5), and when this limit should be reached, again remember him in mercy. This is a wish that Job marks out for himself. The reality is indeed different: \"if (ἐὰν) a man dies, will he live again?\" The answer which Job's consciousness, ignorant of anything better, alone can give, is: No, there is no life after death. It is, however, none the less a craving of his heart that gives rise to the wish; it is the most favourable thought, - a desirable possibility, - which, if it were but a reality, would comfort him under all present suffering: \"all the days of my warfare would I wait until my change came.\" צבא is the name he gives to the whole of this toilsome and sorrowful interval between the present and the wished-for goal, - the life on earth, which he likens to the service of the soldier or of the hireling (Job 7:1), and which is subject to an inevitable destiny (Job 5:7) of manifold suffering, together with the night of Hades, where this life is continued in its most shadowy and dismal phase. And חליפה does not here signify destruction in the sense of death, as the Jewish expositors, by comparing Isaiah 2:18 and Sol 2:11, explain it; but (with reference to צבאי, comp. Job 10:17) the following after (Arab. chlı̂ft, succession, successor, i.e., of Mohammed), relief, change (syn. תּמוּרה, exchange, barter), here of change of condition, as Psalm 55:20, of change of mind; Aquila, Theod., ἄλλαγμα. Oh that such a change awaited him! What a blessed future would it be if it should come to pass! Then would God call to him in the depth of Shel, and he, imprisoned until the appointed time of release, would answer Him from the deep. After His anger was spent, God would again yearn after the work of His hands (comp. Job 10:3), the natural loving relation between the Creator and His creature would again prevail, and it would become manifest that wrath is only a waning power (Isaiah 54:8), and love His true and essential attribute. Schlottman well observes: \"Job must have had a keen perception of the profound relation between the creature and his Maker in the past, to be able to give utterance to such an imaginative expectation respecting the future.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The optative יתּן מי introduces a wish that has reference to the future, and is therefore, as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", followed by futt.; comp. on the other hand, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", utinam noverim. The language of the wish reminds one of such passages in the Psalms as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 27:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): \"In the day of trouble He hideth me in His pavilion, and in the secret of His tabernacle doth He conceal me.\" So Job wishes that Hades, into which the wrath of God now precipitates him for ever, may only be a temporary place of safety for him, until the wrath of God turn away (שׁוּב, comp. the causative, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); that God would appoint to him, when there, a חק, i.e., a terminus ad quem (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and when this limit should be reached, again remember him in mercy. This is a wish that Job marks out for himself. The reality is indeed different: \"if (ἐὰν) a man dies, will he live again?\" The answer which Job's consciousness, ignorant of anything better, alone can give, is: No, there is no life after death. It is, however, none the less a craving of his heart that gives rise to the wish; it is the most favourable thought, - a desirable possibility, - which, if it were but a reality, would comfort him under all present suffering: \"all the days of my warfare would I wait until my change came.\" צבא is the name he gives to the whole of this toilsome and sorrowful interval between the present and the wished-for goal, - the life on earth, which he likens to the service of the soldier or of the hireling (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and which is subject to an inevitable destiny (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") of manifold suffering, together with the night of Hades, where this life is continued in its most shadowy and dismal phase. And חליפה does not here signify destruction in the sense of death, as the Jewish expositors, by comparing ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and Sol 2:11, explain it; but (with reference to צבאי, comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the following after (Arab. chlı̂ft, succession, successor, i.e., of Mohammed), relief, change (syn. תּמוּרה, exchange, barter), here of change of condition, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 55:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of change of mind; Aquila, Theod., ἄλλαγμα. Oh that such a change awaited him! What a blessed future would it be if it should come to pass! Then would God call to him in the depth of Shel, and he, imprisoned until the appointed time of release, would answer Him from the deep. After His anger was spent, God would again yearn after the work of His hands (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the natural loving relation between the Creator and His creature would again prevail, and it would become manifest that wrath is only a waning power (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 54:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and love His true and essential attribute. Schlottman well observes: \"Job must have had a keen perception of the profound relation between the creature and his Maker in the past, to be able to give utterance to such an imaginative expectation respecting the future.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Job 14:16, Job supports what is cheering in this prospect, with which he wishes he might be allowed to console himself, by the contrast of the present. עתּה כּי is used here as in Job 6:21; כי is not, as elsewhere, where עתה כי introduces the conclusion, confirmatory (indeed now  equals  then indeed), but assigns a reason (for now). Now God numbers his steps (Job 13:27), watching him as a criminal, and does not restrain himself over his sin. Most modern expositors (Ew., Hlgst, Hahn, Schlottm.) translate: Thou observest not my sins, i.e., whether they are to be so severely punished or not; but this is poor. Raschi: Thou waitest not over my sins, i.e., to punish them; instead of which Ralbag directly: Thou waitest not for my sins  equals  repentance or punishment; but שׁמר is not supported in the meaning: to wait, by Genesis 37:11. Aben-Ezra: Thou lookest not except on my sins, by supplying רק, according to Ecclesiastes 2:24 (where, however, probably משׁיאכל should be read, and מ after אדם, just as in Job 33:17, has fallen away). The most doubtful is, with Hirzel, to take the sentence as interrogative, in opposition to the parallelism: and dost Thou not keep watch over my sins? It seems to me that the sense intended must be derived from the phrase אף שׁמר, which means to keep anger, and consequently to delay the manifestation of it (Amos 1:11). This phrase is here so applied, that we obtain the sense: Thou keepest not Thy wrath to thyself, but pourest it out entirely. Mercerus is substantially correct: non reservas nec differs peccati mei punitionem. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Job supports what is cheering in this prospect, with which he wishes he might be allowed to console himself, by the contrast of the present. עתּה כּי is used here as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; כי is not, as elsewhere, where עתה כי introduces the conclusion, confirmatory (indeed now  equals  then indeed), but assigns a reason (for now). Now God numbers his steps (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 13:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), watching him as a criminal, and does not restrain himself over his sin. Most modern expositors (Ew., Hlgst, Hahn, Schlottm.) translate: Thou observest not my sins, i.e., whether they are to be so severely punished or not; but this is poor. Raschi: Thou waitest not over my sins, i.e., to punish them; instead of which Ralbag directly: Thou waitest not for my sins  equals  repentance or punishment; but שׁמר is not supported in the meaning: to wait, by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Aben-Ezra: Thou lookest not except on my sins, by supplying רק, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (where, however, probably משׁיאכל should be read, and מ after אדם, just as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", has fallen away). The most doubtful is, with Hirzel, to take the sentence as interrogative, in opposition to the parallelism: and dost Thou not keep watch over my sins? It seems to me that the sense intended must be derived from the phrase אף שׁמר, which means to keep anger, and consequently to delay the manifestation of it (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This phrase is here so applied, that we obtain the sense: Thou keepest not Thy wrath to thyself, but pourest it out entirely. Mercerus is substantially correct: non reservas nec differs peccati mei punitionem. ",
            "children": []
          }
        ]
      }
    ]
  }
]