[{"header":"King Hezekiah Makes Improvements"},{"num":31,"verse":"When the Passover celebration was finished, the Israelites who were in Jerusalem for Passover went out to the towns of Judah. Then they smashed the stone idols that were in the towns. These stone idols were used to worship false gods. They also cut down the Asherah poles. And they destroyed the high places and the altars all through the areas of Judah and Benjamin. They did the same things in the area of Ephraim and Manasseh. They did these things until they destroyed all the things used for worshiping the false gods. Then all the Israelites went back home to their own towns."},{"num":2,"verse":"The priests and Levites had been divided into groups, and each group had its own special job to do. So King Hezekiah told these groups to begin doing their jobs again. So the priests and Levites again had the job of offering the burnt offerings and the fellowship offerings. And they had the job of serving in the Temple and singing and praising God by the doors to the Lord’s house."},{"num":3,"verse":"Hezekiah gave some of his own animals to be offered as the burnt offerings. These animals were used for the daily burnt offerings that were given each morning and each evening. They were offered on the Sabbath days, during New Moon celebrations, and on the other special meeting days, as the law of the Lord commands."},{"num":4,"verse":"The people were supposed to give a part of their crops and things to the priests and Levites. So Hezekiah commanded the people living in Jerusalem to give them their share. In that way the priests and Levites could spend all of their time doing what the law of the Lord told them to do."},{"num":5,"verse":"People all around the country heard about this command. So the Israelites gave the first part of their harvest of grain, grapes, oil, honey, and all the things they grew in their fields. They brought one-tenth of all these many things."},{"num":6,"verse":"The men of Israel and Judah living in the towns of Judah also brought one-tenth of their cattle and sheep. They also brought one-tenth of the things that were put in a special place that was only for the Lord their God. They brought all these things and put them in piles."},{"num":7,"verse":"The people began to bring these things in the third month and they finished bringing the collection in the seventh month."},{"num":8,"verse":"When Hezekiah and the leaders came, they saw the piles of things that were collected. They praised the Lord and his people, the Israelites."},{"num":9,"verse":"Then Hezekiah asked the priests and the Levites about the piles of things."},{"num":10,"verse":"Azariah the high priest from Zadok’s family said to Hezekiah, “From the time that the people started bringing the offerings into the Lord’s house, we have had plenty to eat. We have eaten until we are full and there is still plenty left over! The Lord has really blessed his people. That is why we have so much left over.”"},{"num":11,"verse":"Then Hezekiah commanded the priests to make storerooms ready in the Lord’s Temple. So this was done."},{"num":12,"verse":"Then the priests brought the offerings, tithes, and other things that were to be given only to God. All these things collected were put in the storerooms in the Temple. Conaniah the Levite was in charge of everything that was collected. Shimei was second in charge of these things. Shimei was Conaniah’s brother."},{"num":13,"verse":"Conaniah and his brother Shimei were supervisors of these men: Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismakiah, Mahath, and Benaiah. King Hezekiah and Azariah the official in charge of God’s Temple chose these men."},{"num":14,"verse":"Kore was in charge of the offerings that the people freely gave to God. He was responsible for giving out the collections that were given to the Lord. And he was responsible for giving out the gifts that had been made holy. Kore was the gatekeeper at the East Gate. His father’s name was Imnah the Levite."},{"num":15,"verse":"Eden, Miniamin, Jeshua, Shemaiah, Amariah, and Shecaniah helped Kore. These men served faithfully in the towns where the priests were living. They gave the collection of things to their relatives in each group of priests. They gave the same things to the more important people and to the less important."},{"num":16,"verse":"These men also gave the collection of things to the males three years old and older who had their names in the Levite family histories. All these males were to enter the Lord’s Temple for daily service to do the things they were responsible to do. Each group of Levites had their own responsibility."},{"num":17,"verse":"The priests were given their part of the collection. This was done by families, in the way they were listed in the family histories. The Levites who were 20 years old and older were given their part of the collection, according to their groups and responsibilities."},{"num":18,"verse":"The Levites’ babies, wives, sons, and daughters also got part of the collection. This was done for all the Levites who were listed in the family histories. This was because the Levites were faithful to always keep themselves holy and ready for service."},{"num":19,"verse":"Some of Aaron’s descendants, the priests, lived in the towns or on farms near the towns where the Levites were living. Men were chosen by name in each of these towns to give part of the collection to these descendants of Aaron. All the males and those named in the family histories of the Levites got part of the collection."},{"num":20,"verse":"So King Hezekiah did those good things in all Judah. He did what was good and right and faithful before the Lord his God."},{"num":21,"verse":"He had success in every work he began—the service of God’s Temple and in obeying the law and commands, and in following his God. Hezekiah did all these things with all his heart."}]