[{"header":"Chapter 31"},{"num":1,"verse":"Liturgical Reforms. After all this was over, those Israelites who had been present went forth to the cities of Judah and smashed the sacred pillars, cut down the asherahs, and tore down the high places and altars throughout Judah, Benjamin, Ephraim, and Manasseh, until they were all destroyed. Then the Israelites returned to their cities, each to his own possession."},{"num":2,"verse":"Hezekiah re-established the divisions of the priests and the Levites according to their former divisions, assigning to each priest and Levite his proper service, whether in regard to burnt offerings or communion offerings, thanksgiving or praise, or ministering in the gates of the encampment of the Lord. "},{"num":3,"verse":"From his own wealth the king allotted a portion for burnt offerings, those of morning and evening and those on sabbaths, new moons, and festivals, as is written in the law of the Lord. "},{"num":4,"verse":"He also commanded the people living in Jerusalem to provide for the support of the priests and Levites, that they might firmly adhere to the law of the Lord."},{"num":5,"verse":"As soon as the order was promulgated, the Israelites brought, in great quantities, the best of their grain, wine, oil, and honey, and all the produce of the fields; they gave a generous tithe of everything. "},{"num":6,"verse":"Israelites and Judahites living in other cities of Judah also brought in tithes of oxen, sheep, and votive offerings consecrated to the Lord, their God; these they brought in and heaped up in piles. "},{"num":7,"verse":"It was in the third month that they began to establish these heaps, and they completed them in the seventh month. "},{"num":8,"verse":"When Hezekiah and the princes had come and seen the piles, they blessed the Lord and his people Israel. "},{"num":9,"verse":"Then Hezekiah questioned the priests and the Levites concerning the piles, "},{"num":10,"verse":"and the priest Azariah, head of the house of Zadok, answered him, “Since they began to bring the offerings to the house of the Lord, we have eaten, been satisfied, and had much left over, for the Lord has blessed his people. This great supply is what was left over.”"},{"num":11,"verse":"Hezekiah then gave orders that chambers be constructed in the house of the Lord. When this had been done, "},{"num":12,"verse":"they deposited the offerings, tithes, and votive offerings there for safekeeping. The overseer of these things was Conaniah the Levite, and his brother Shimei was second in command. "},{"num":13,"verse":"Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismachiah, Mahath, and Benaiah were supervisors subject to Conaniah the Levite and his brother Shimei by appointment of King Hezekiah and of Azariah, the prefect of the house of God. "},{"num":14,"verse":"Kore, the son of Imnah, a Levite and the keeper of the eastern gate, was in charge of the voluntary offerings made to God; he distributed the offerings made to the Lord and the most holy of the votive offerings. "},{"num":15,"verse":"Under him in the priestly cities were Eden, Miniamin, Jeshua, Shemaiah, Amariah, and Shecaniah, who faithfully made the distribution to their brothers, great and small alike, according to their divisions."},{"num":16,"verse":"There was also a register by ancestral houses of males three years of age and over, for all priests who were eligible to enter the house of the Lord according to the daily schedule to fulfill their service in the order of their divisions. "},{"num":17,"verse":"The priests were inscribed in their family records according to their ancestral houses, as were the Levites twenty years of age and over according to their various offices and divisions. "},{"num":18,"verse":"A distribution was also made to all who were inscribed in the family records, for their little ones, wives, sons and daughters—thus for the entire assembly, since they were to sanctify themselves by sharing faithfully in the votive offerings. "},{"num":19,"verse":"The sons of Aaron, the priests who lived on the lands attached to their cities, had in every city men designated by name to distribute portions to every male of the priests and to every Levite listed in the family records."},{"num":20,"verse":"Hezekiah did this in all Judah. He did what was good, upright, and faithful before the Lord, his God. "},{"num":21,"verse":"Everything that he undertook, for the service of the house of God or for the law and the commandment, was to seek his God. He did this with all his heart, and he prospered."}]