[{"header":"Changes Made by Hezekiah"},{"num":31,"verse":"Now when all this was finished, all the people of Israel who were there went out to the cities of Judah. They broke in pieces the pillars set up for the false gods. They cut down the objects of the false goddess Asherah. And they pulled down the high places and the altars through all Judah and Benjamin, and in Ephraim and Manasseh. They destroyed all of them. Then all the people of Israel returned to their cities, every man to his land."},{"num":2,"verse":"Hezekiah divided the religious leaders and the Levites into groups, each by the work he was to do. He chose the religious leaders and Levites for giving the burnt gifts and peace gifts, for serving and giving thanks, and for praising in the gates of the camp of the Lord. "},{"num":3,"verse":"He decided what the king should give of his own animals for the burnt gifts, for the morning and evening, for the Days of Rest and the New Moons and the Special Suppers, as it is written in the Law of the Lord. "},{"num":4,"verse":"And he told the people who lived in Jerusalem to give the share that should go to the religious leaders and the Levites, that they might give themselves to the Law of the Lord. "},{"num":5,"verse":"As soon as the news spread, the people of Israel gave much of the first-fruits of grain, new wine, oil, honey, and of all the food of the field. They brought in more than a tenth part of everything. "},{"num":6,"verse":"The people of Israel and Judah, who lived in the cities of Judah, also brought in a tenth part of the cattle and sheep. And they brought a tenth part of the holy things which were set apart for the Lord their God. They laid them one on top of the other. "},{"num":7,"verse":"They began to lay them on top of each other in the third month, and finished by the seventh month."},{"num":8,"verse":"And when Hezekiah and the rulers came and saw all the things, they praised the Lord and His people Israel. "},{"num":9,"verse":"Then Hezekiah asked the religious leaders and the Levites about all the things which had been brought. "},{"num":10,"verse":"Azariah the head religious leader of the family of Zadok said to him, “Since the gifts began to be brought into the Lord’s house, we have had much more than enough to eat. For the Lord has brought good to His people, and we have all this much left.”"},{"num":11,"verse":"Then Hezekiah told them to make rooms ready in the house of the Lord, and they made them ready. "},{"num":12,"verse":"And they were faithful to bring in the gifts and the tenth part and the holy things. Conaniah the Levite was the captain over them, and his brother Shimei was second. "},{"num":13,"verse":"The leaders under Conaniah and his brother Shimei were Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismachiah, Mahath, and Benaiah. They were chosen by King Hezekiah. Azariah was the head captain of the house of God. "},{"num":14,"verse":"Kore, the son of Imnah the Levite, who watched over the east gate, was captain of the free-will gifts to God. He divided the gifts for the Lord and the most holy things. "},{"num":15,"verse":"Under his rule were Eden, Miniamin, Jeshua, Shemaiah, Amariah, and Shecaniah, in the cities of the religious leaders. They were faithful to give shares to their brothers by their groups, large and small alike."},{"num":16,"verse":"Also they gave to those whose names were written down by families, from three years old and older. They gave to everyone who went into the Lord’s house for each day’s duty, for the work each of their groups was to do. "},{"num":17,"verse":"The names of the religious leaders were written down by their family groups, and the Levites from twenty years old and older, by their duties and their groups. "},{"num":18,"verse":"Also written down were the names of their little children, their wives, their sons, and their daughters, for all the people. For they were faithful to set themselves apart to be holy. "},{"num":19,"verse":"Also the sons of Aaron, the religious leaders who were in the fields around their cities, or in each and every city, were taken care of. There were men chosen by name to give shares to every male among the religious leaders and to everyone whose name was written down among the Levites."},{"num":20,"verse":"Hezekiah did this through all Judah. He did what was good and right and true before the Lord his God. "},{"num":21,"verse":"All the work he began in the house of God, obeying the Laws and looking to his God, he did with all his heart and all went well for him."}]