[{"header":"Restoring the Kohanim and Levites"},{"num":31,"verse":"When all this was finished, all Israel who were present went out to the towns of Judah and smashed the pillars, smashed the Asherah poles and demolished the high places and the altars throughout all Judah and Benjamin, as well as throughout Ephraim and Manasseh, until they had destroyed them all. Then all Bnei-Yisrael returned to their towns, each to their own property."},{"num":2,"verse":"Then Hezekiah reestablished the divisions of the kohanim and the Levites together with their divisions, each of the kohanim and Levites according to his service: for burnt offerings, peace offerings, to minister, to praise, or to sing praises in the gates of the courts of Adonai."},{"num":3,"verse":" The king also contributed a portion of his own assets for the burnt offerings: the morning and the evening burnt offerings and the burnt offerings for Shabbatot, the New Moons and the moadim, as it is written in the Torah of Adonai. "},{"num":4,"verse":"Moreover, he commanded the people, the residents of Jerusalem, to give the portion allotted to the kohanim and the Levites, so that they might devote themselves to the Torah of Adonai. "},{"num":5,"verse":"As soon as the word spread, Bnei-Yisrael gave generously the firstfruits of their grain, wine, oil, honey and all the produce of the field, as well as tithe of all the abundance. "},{"num":6,"verse":"The children of Israel and Judah who lived in the towns of Judah, also brought in the tithe of bulls and sheep, and the tithe of the sacred things consecrated to Adonai their God. They piled them in heaps. "},{"num":7,"verse":"In the third month the heaps began to accumulate and finished in the seventh month. "},{"num":8,"verse":"When Hezekiah and the officials came and saw the heaps, they blessed Adonai and His people Israel."},{"num":9,"verse":"Hezekiah asked the kohanim and the Levites about the heaps. "},{"num":10,"verse":"Azariah the chief kohen from the house of Zadok, replied to him saying, “Ever since the gifts began to be brought into the House of Adonai, we have had enough to eat and more than enough, for Adonai has blessed His people with plenty left over.”"},{"num":11,"verse":"Then Hezekiah ordered them to prepare storerooms in the House of Adonai, and they prepared them. "},{"num":12,"verse":"They faithfully brought in the offerings and the tithes and the consecrated gifts. Conaniah the Levite was the leader in charge over them and Shimei his brother was next in rank. "},{"num":13,"verse":"Jehiel, Azaziah, Nahath, Asahel, Jerimoth, Jozabad, Eliel, Ismachiah, Mahath and Benaiah were supervisors under Conaniah and Shimei his brother, by the appointment of Hezekiah the king and Azariah the leader in charge of the House of God. "},{"num":14,"verse":"Kore the son of Imnah the Levite, keeper of the East Gate, was over the freewill offerings of God, distributing the offering of Adonai and the consecrated gifts. "},{"num":15,"verse":"Eden, Miniamin, Jeshua, Shemaiah, Amariah and Shecaniah faithfully assisted him in the towns of the kohanim, making allocations to their brothers by divisions—to great and little alike, "},{"num":16,"verse":"only considering genealogical records, to the males three years old and upward—to all who entered into the House of Adonai, to perform the daily duties according to their responsibilities and their divisions—"},{"num":17,"verse":"to the kohanim who were genealogically registered by their ancestral houses, as well as to the Levites 20 years old and upward, according to their duties and their divisions. "},{"num":18,"verse":"The genealogical registry included all their little ones, their wives and sons and daughters of the entire assembly. Thus in their faithfulness they consecrated themselves as holy."},{"num":19,"verse":"As for the sons of Aaron, the kohanim, who lived in the fields of the common lands of their towns—in every town—men were designated by name to distribute portions to all the males among the kohanim and to all who were genealogically registered among the Levites. "},{"num":20,"verse":"Thus Hezekiah did throughout all Judah. He did what was good, right and true before Adonai his God. "},{"num":21,"verse":"Every work he undertook in the service of the House of God and in the Torah and the mitzvot to seek his God, he did wholeheartedly and succeeded."}]