[{"header":"God’s People Enter His Sabbath Rest"},{"num":4,"verse":"God’s promise of enjoying his rest still stands. So be careful that none of you fails to receive it. "},{"num":2,"verse":"The good news was announced to our people of long ago. It has also been preached to us. The message they heard didn’t have any value for them. That’s because they didn’t share the faith of those who obeyed. "},{"num":3,"verse":"Now we who have believed enjoy that rest. God said,"},{"num":4,"verse":"Somewhere he spoke about the seventh day. He said, “On the seventh day God rested from all his works.” (Genesis 2:2) "},{"num":5,"verse":"In the part of Scripture I talked about earlier God spoke. He said, “They will never enjoy the rest I planned for them.” (Psalm 95:11)"},{"num":6,"verse":"It is still true that some people will enjoy this rest. But those who had the good news announced to them earlier didn’t go in. That’s because they didn’t obey. "},{"num":7,"verse":"So God again chose a certain day. He named it Today. He did this when he spoke through David a long time later. Here is what was written in the Scripture already given."},{"num":8,"verse":"Suppose Joshua had given them rest. If he had, God would not have spoken later about another day. "},{"num":9,"verse":"So there is still a Sabbath rest for God’s people. "},{"num":10,"verse":"God rested from his work. Those who enjoy God’s rest also rest from their works. "},{"num":11,"verse":"So let us make every effort to enjoy that rest. Then no one will die by disobeying as they did."},{"num":12,"verse":"The word of God is alive and active. It is sharper than any sword that has two edges. It cuts deep enough to separate soul from spirit. It can separate bones from joints. It judges the thoughts and purposes of the heart. "},{"num":13,"verse":"Nothing God created is hidden from him. His eyes see everything. He will hold us responsible for everything we do."},{"header":"Jesus Is the Great High Priest"},{"num":14,"verse":"We have a great high priest. He has gone up into heaven. He is Jesus the Son of God. So let us hold firmly to what we say we believe. "},{"num":15,"verse":"We have a high priest who can feel it when we are weak and hurting. We have a high priest who has been tempted in every way, just as we are. But he did not sin. "},{"num":16,"verse":"So let us boldly approach God’s throne of grace. Then we will receive mercy. We will find grace to help us when we need it."}]