[{"header":"Promised Rest for God’s People"},{"num":4,"verse":"God’s promise of entering his rest still stands, so we ought to tremble with fear that some of you might fail to experience it."},{"num":2,"verse":"For this good news—that God has prepared this rest—has been announced to us just as it was to them. But it did them no good because they didn’t share the faith of those who listened to God."},{"num":3,"verse":"For only we who believe can enter his rest. As for the others, God said, "},{"num":4,"verse":"We know it is ready because of the place in the Scriptures where it mentions the seventh day: “On the seventh day God rested from all his work.”"},{"num":5,"verse":"But in the other passage God said, “They will never enter my place of rest.”"},{"num":6,"verse":"So God’s rest is there for people to enter, but those who first heard this good news failed to enter because they disobeyed God."},{"num":7,"verse":"So God set another time for entering his rest, and that time is today. God announced this through David much later in the words already quoted: "},{"num":8,"verse":"Now if Joshua had succeeded in giving them this rest, God would not have spoken about another day of rest still to come."},{"num":9,"verse":"So there is a special rest still waiting for the people of God."},{"num":10,"verse":"For all who have entered into God’s rest have rested from their labors, just as God did after creating the world."},{"num":11,"verse":"So let us do our best to enter that rest. But if we disobey God, as the people of Israel did, we will fall."},{"num":12,"verse":"For the word of God is alive and powerful. It is sharper than the sharpest two-edged sword, cutting between soul and spirit, between joint and marrow. It exposes our innermost thoughts and desires."},{"num":13,"verse":"Nothing in all creation is hidden from God. Everything is naked and exposed before his eyes, and he is the one to whom we are accountable."},{"header":"Christ Is Our High Priest"},{"num":14,"verse":"So then, since we have a great High Priest who has entered heaven, Jesus the Son of God, let us hold firmly to what we believe."},{"num":15,"verse":"This High Priest of ours understands our weaknesses, for he faced all of the same testings we do, yet he did not sin."},{"num":16,"verse":"So let us come boldly to the throne of our gracious God. There we will receive his mercy, and we will find grace to help us when we need it most."}]