[{"header":"The Christian’s Rest"},{"num":4,"verse":"The same promise of going into God’s rest is still for us. But we should be afraid that some of us may not be able to go in. "},{"num":2,"verse":"We have heard the Good News even as they did, but it did them no good because it was not mixed with faith. "},{"num":3,"verse":"We who have put our trust in God go into His rest. God said this of our early fathers, “I was angry and said, ‘They will not go into My rest.’” And yet God’s work was finished after He made the world."},{"header":"God’s Rest"},{"num":4,"verse":"In the Holy Writings He said this about the seventh day when He made the whole world, “God rested on the seventh day from all He had made.”  "},{"num":5,"verse":"But God said this about those who turned against Him, “They will not go into My rest.”  "},{"num":6,"verse":"Those who heard the Good News first did not go into His rest. It was because they had not obeyed Him. But the promise is still good and some are going into His rest. "},{"num":7,"verse":"God has again set a certain day for people to go into His rest. He says through David many years later as He had said before, “If you hear His voice today, do not let your hearts become hard.” "},{"num":8,"verse":"If Joshua had led those people into God’s rest, He would not have told of another day after that. "},{"num":9,"verse":"And so God’s people have a complete rest waiting for them. "},{"num":10,"verse":"The man who goes into God’s rest, rests from his own work the same as God rested from His work. "},{"num":11,"verse":"Let us do our best to go into that rest or we will be like the people who did not go in."},{"num":12,"verse":"God’s Word is living and powerful. It is sharper than a sword that cuts both ways. It cuts straight into where the soul and spirit meet and it divides them. It cuts into the joints and bones. It tells what the heart is thinking about and what it wants to do. "},{"num":13,"verse":"No one can hide from God. His eyes see everything we do. We must give an answer to God for what we have done."},{"header":"Jesus—Our Great Religious Leader"},{"num":14,"verse":"We have a great Religious Leader Who has made the way for man to go to God. He is Jesus, the Son of God, Who has gone to heaven to be with God. Let us keep our trust in Jesus Christ. "},{"num":15,"verse":"Our Religious Leader understands how weak we are. Christ was tempted in every way we are tempted, but He did not sin. "},{"num":16,"verse":"Let us go with complete trust to the throne of God. We will receive His loving-kindness and have His loving-favor to help us whenever we need it."}]