[{"num":4,"verse":"Therefore, let us walk in yir’at Shomayim, for fear that, while the havtachah (promise) of entering the menuchah of Hashem is still open, anyone of you should seem to have fallen short of it."},{"num":2,"verse":"For indeed we have had Besuras HaGeulah preached to us, just as they did also; but the Dvar Hashem preached did not make that generation benefit, because hearing did not form an agudah with emunah [faith]."},{"num":3,"verse":"For we ma’aminim [in Rebbe Melech HaMoshiach] enter into that menuchah, just as Hashem has said, \"ASHER NISHBA’TI V’API IM YEVO’UN EL MENUCHATI\" (\"As I vowed in My fury, they shall never enter into My rest\" TEHILLIM 95:11), although the ma’asim (works) of Hashem were finished from the hivvased tevel (foundation of the world)."},{"num":4,"verse":"For concerning Shabbos, the Yom HaShevi’i, Hashem has said somewhere, \"VAYISHBOT Elohim BAYOM HASHEVI’I MIKOL MELAKHTO\" (\"And He rested on the seventh day from all His work.\" [BERESHIS 2:2]"},{"num":5,"verse":"And again in this mekor (passage, citation), \"IM YEVO’UN EL MENUCHATI\" (\"Never shall they enter into My rest\" TEHILLIM 95:11)."},{"num":6,"verse":"Therefore, als (since) it remains for some to enter it, and the ones, who formerly had the Besuras HaGeulah preached to them, did not enter, because they were koferim (unbelievers),"},{"num":7,"verse":"So then again Hashem sets a certain day, \"HAYOM\" (\"Today,\" TEHILLIM 95:7) in one of the Tehillim of Dovid [HaMelech], much later, in that quoted above, \"HAYOM IM BEKOLO TISHMAU AL TAKSHU LEVAVCHEM\" (\"Today, if you hear his voice, do not harden your heart\"‖TEHILLIM 95:7)."},{"num":8,"verse":"For if Yehoshua [ben Nun] had brought them to a place of menuchah (rest), Hashem would not have spoken of another \"Yom\" after that [TEHILLIM 95:7]."},{"num":9,"verse":"Therefore, there remains a Shabbos menuchah for the Am Hashem."},{"num":10,"verse":"For whoever has entered into the menuchah of Hashem has also rested from [depending on the zchus (merit) of] his ma’asim, just as Hashem rested from his."},{"num":11,"verse":"Therefore, let us have zerizut (diligence) to enter into that menuchah, for fear that anyone fall through following be’ikvot (in the footsteps) of their same lack of mishma’at (obedience) [cf 3:17-18; 4:6]."},{"num":12,"verse":"For the Dvar Hashem is chai (living) and chazak (strong), sharper than every doubled-edged cherev and penetrating as far as the division of nefesh and ruach, of both joints and marrow, and able to judge the machshavot and deliberations of the kavanat halev (the inner directedness of the heart)."},{"num":13,"verse":"And there is not nivra (anything created) nistar (hidden) from His sight, but all things are laid bare and exposed to the eynayim (eyes) of Him to whom we must render an account."},{"num":14,"verse":"Therefore, als (since) we have a great Kohen Gadol who has made his passing through Shomayim, [Rebbe, Melech HaMoshiach] Yehoshua HaBen HaElohim, let us hold firmly to the hoda’ah (confession) of the hachrazah (proclamation) of our [Orthodox Jewish] Emunah."},{"num":15,"verse":"For we do not have a Kohen Gadol who is unable to sympathize with our weaknesses, but one who has been tempted in every way as we are, yet without chet."},{"num":16,"verse":"Therefore, let us approach with bitachon the Kisse of Chesed, that we may receive rachamim and may find chesed for timely ezrah (aid)."}]