[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But in a great house there are not only vessels of gold and of silver.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The Apostle goes on with the same thought of the “Church of God on earth,” but he changes the imagery. He has been speaking of this Church as the “foundation-storey that cannot be moved” of a still more glorious edifice. He now, as it were, answers a question which would naturally occur to Timothy and to many a devout reader or hearer of the Epistle when they came to this part of the argument. How comes it, then, one would ask, that in this visible Church on earth are so many unworthy members? How is it that in this changeless, abiding foundation of the great Temple of the future, against which all earthly storms may beat, and yet never shake its massive storeys, so many useless crumbling stones are taken for the building?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In a great house, argues St. Paul—still thinking of the Church, but changing the foundation image for that of a great house—are always found two distinct kinds of vessels—the precious and enduring, and also the comparatively valueless and lasting for out a little while; the first kind are destined for honour, the second for dishonour. In St. Paul’s mind, when he wrote these words, the natural sequel to his far-reaching and suggestive comparison of the “foundation” (2Timothy 2:19) were the words of his Master, who had once compared His Church to a drag-net of wide sweep, including in its take something of every kind out of the vast sea-world. The “net”—His Church—was together and to hold in its meshes its great take—the good and the bad, the useful and the useless—till the end of the world. So St. Paul writes how in a great house there must be these varieties of vessels—some for honour, others for dishonour. By these vessels the genuine and spurious members of the Church are represented as forming two distinct classes; and in these classes different degrees of honour and dishonour besides exist—the vessels of gold and silver, the vessels of wood and of earth. To Timothy these comparisons would at once suggest the true and false teachers in his Church at Ephesus; but the reference is a far broader one, and includes all members of the Church of Christ. The enduring nature of the metals gold and silver are contrasted with the perishable nature of the other materials, wood and earth. The former will remain a part of the Church for ever; the latter will only endure until the end of the world.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "In a great house, argues St. Paul",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—still thinking of the Church, but changing the foundation image for that of a great house—are always found two distinct kinds of vessels—the precious and enduring, and also the comparatively valueless and lasting for out a little while; the first kind are destined for honour, the second for dishonour. In St. Paul’s mind, when he wrote these words, the natural sequel to his far-reaching and suggestive comparison of the “foundation” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Timothy 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") were the words of his Master, who had once compared His Church to a drag-net of wide sweep, including in its take something of every kind out of the vast sea-world. The “net”—His Church—was together and to hold in its meshes its great take—the good and the bad, the useful and the useless—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "till the end of the world.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " So St. Paul writes how in a great house there must be these varieties of vessels—some for honour, others for dishonour. By these vessels the genuine and spurious members of the Church are represented as forming two distinct classes; and in these classes different degrees of honour and dishonour besides exist—the vessels of gold and silver, the vessels of wood and of earth. To Timothy these comparisons would at once suggest the true and false teachers in his Church at Ephesus; but the reference is a far broader one, and includes ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "all",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " members of the Church of Christ. The enduring nature of the metals gold and silver are contrasted with the perishable nature of the other materials, wood and earth. The former will remain a part of the Church for ever; the latter will only endure until the end of the world.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2 Timothy",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE GREAT HOUSE AND ITS VESSELS",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "OUR text begins with a ‘but.’ It, therefore, suggests something which may seem to contradict or to modify what has gone before. The Apostle has been speaking about what he calls the ‘foundation of God,’ or the building founded by God, whereby he means the Church. He has been expressing triumphant confidence that, as thus founded, it is indestructible, whatever dangers may threaten or defections may weaken it. But the very contemplation of that grand ideal suggests darker thoughts. He carries on his metaphor, for the ‘great house’ is suggested by ‘the foundation of God,’ and yet the two things do not refer to precisely the same object. The building founded by God which stands fast, whatever happens, is what we call in our abstract way, the ‘invisible Church,’ the ideal community or aggregate of all who are truly joined to Jesus Christ. The great house is what we call the visible Church, the organisation, institution, or institutions comprising those who profess to be thus joined. The one is indestructible, as founded by God; the other is not, being made by men, and composed of heterogeneous elements.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This heterogeneousness of its elements is suggested by the further metaphor, of the vessels of different materials, value, and use. The members of the Church are the various vessels. When we come down from the heights of ideal contemplation to face the reality of the Church as an organisation in the world, we are confronted with this grave fact, that its members are some of them ‘gold and silver,’ some of them ‘wood’ and ‘earth.’ And that fact modifies the triumphant confidence already uttered, and imposes upon us all very plain duties. So I wish to look now at the three things that are suggested to me here. First, a grave fact as to the actual condition of the Church as an organised institution; second, an inspiring possibility open to us all; and, lastly, a plain direction as to the way by which the possibility may become a reality.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Then we have here a grave fact as to the actual condition of the Church as an organised institution.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘In a great house there are vessels of gold and silver.’ There they stand, ranged on some bufet, precious and sparkling, and taken care of; and away down in kitchens or sculleries there are vessels of wood, or of cheap common crockery and pottery. Now, says Paul, that is like the Church as we have to see it in the world. What is the principle of the distinction here? At first sight one might suppose that it refers to the obvious inequality of intellectual and spiritual and other gifts or graces bestowed upon men; that the gold and silver are the more brilliantly endowed in the Christian community, and the wood and the earth are humbler members who have less conspicuous and less useful service to perform. But that is not so. The Bible never recognises that distinction which the world makes so much of, between the largely and slenderly endowed, between the men who do what are supposed to be great things, and those who have to be content with humbler service. Its principle is, ‘small service is true service whilst it lasts,’ and although there are-diversities of operation, the man who has the largest share of gifts stands, in Heaven’s estimate, no whit above the man who has the smallest. All are on the one level; in God’s great army the praise and the honours do not get monopolised by the general officers, but they come down to the privates just as abundantly, if they are equally faithful.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And then another consideration which shows us that it will not do to take gold and silver on the one hand, and wood and earth on the other, as marking the cleavage between the largely and the slenderly endowed members of the Church, is the fact that the way to get out of the one class and into the other, as we shall have to see presently, is by moral purity and not by the increase of intellectual or other endowments. The man that cleanses himself comes out of the category of ‘wood’ and ‘earth,’ and passes into that of ‘gold and silver.’ Thus the basis of the distinction, the ground of classification, lies altogether in goodness or badness, purity or impurity, worthiness or unworthiness. They who are in the highest degree pure are the ‘gold and silver.’ They who are less so, or not at all so, are the ‘wooden’ and the ‘earthen’ vessels. The same line of demarcation is suggested in another passage which employs several of the same phrases and ideas that are found in my text. We read in it about the foundation which is laid, and about the teachers building upon it various elements. Now these elements, on the one hand ‘gold, silver, and precious stones,’ and on the other hand ‘wool, hay, and stubble,’ may be the doctrines that these teachers proclaimed, or perhaps they may be the converts that they brought in. But in any case notice the parallelism, not only in regard to the foundation, but in regard to the distinction of the component parts of the structure - ‘gold and silver,’ as here, and the less valuable list headed, as here, by ‘wood; and then, by reason of the divergence of the metaphor, ‘hay and stubble,’ in the one ease, and ‘earthenware’ in the other. But the suggestion of both passages is that the Church, the visible institution, has in it, and will always have in it, those who, by their purity and consistency of Christian life, answer to the designation of the gold and the silver, and those who, by their lack of that, fail into the other class, of wooden and earthen vessels.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Of course it must be so. ‘What act is all its thought had been?’ Every ideal, when it becomes embodied in an institution, becomes degraded; just as, when you expose quicksilver to the air, a non-transparent film and scum creeps across the surface. The ‘drag-net’ in one of Christ’s parables suggests the same ides, There are no meshes that ever man’s knitting-needle has formed that are fine enough to keep out the bad, as the Church necessarily includes both sets of people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I do not need to dwell upon the question as to whether in these least worthy members of that community are included people that have some faint flickering light of God in their hearts, real though very imperfect Christians, or whether it means only those who are nominally, and not at all really, joined to the Lord. The parting lines between these two classes are very evanescent and very slight; and it is scarcely worth while calling them two classes at all. But only let me remind you that this recognition of the necessary intermingling of unworthy and worthy professors in every Christian Church is no reason for us Nonconformists departing from our fundamental principle that we should try to keep Christ’s Church clear, as far as may be, of the intrusion of unworthy members. The Apostle is not speaking about the conditions that ought to be imposed as precedent to connection with the visible Church, but he is speaking about the evil, whatever the conditions may be, that is sure to attach to it. It attaches to this community of ours here, which, in accordance with New Testament usage, we have no hesitation in calling a Church. We try to keep our communion pure; we do not succeed; we never shall succeed. That is no reason why we should give up trying. But in this little house there are ‘vessels of gold and silver,’ and ‘vessels of wood and earth, and-some to honour and some to dishonour.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But whilst this necessity is no reason for indiscriminate admission of all manner of people into the Christian Church, it is a reason for you that are in it not to make so much as some of you do of the fact that you are in, and not to trust, as some of you do, to the mere nominal, external connection with the ‘great house.’ You may be in it, but you may be down in the back premises, and one of the vessels that have no honourable use. Lay that to heart, dear friends. It is not for me to apply general principles to individual cases, but I may venture to say that, like every true pastor of a Christian community, I cannot help seeing that there are names of people on Our rolls who have a name to live and are dead.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now, secondly, here we have an inspiring possibility open to us all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "On certain conditions any man may be ‘a vessel unto honour,’ by which, of course, is meant that the vessel - that is to say, the man - gets honour.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And how does he get it? By service. If you will look at the passage carefully, you will see that after this general designation of ‘a vessel unto honour,’ there follow three characteristics of the vessel, which taken together make its honour. I shall speak about them in detail presently, but in the meantime let me point out how here there is embodied the great principle of the New Testament that the true honour is service. ‘It shall not be so among you; he that is chief amongst you let him be your servant.’ Just as Jesus Christ, ‘knowing that He came from God and went to God, and that the Father had given all things into His hand, laid aside His garments, and took a towel, and girded Himself, and washed the disciples’ feet,’ so we, if we desire honour and prominence, must find it in service; and if we have by God’s gift, and the concurrence of circumstances, possessions or resources of mind, body, or estate, which make us prominent and above our brethren, we are thereby the more bound to utilise all that we have, and all that we are, for His service. If a man is ambitious let him remember this that service is honour, use is dignity, and there are none other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But now turn for a moment to these three characteristics which are here set forth as constituting the honour of the vessels of gold and silver. The first is ‘sanctified,’ or as it might perhaps better be expressed, consecrated. For, as I suppose many of us know, the foot, idea of sanctification or holiness is not the moral purity which goes along with the expression in our thoughts, but that which is the root of all evangelical purity - via, the yielding of ourselves to God. Consecration is the beginning of purity, and consecration is honour. No man stands higher, in the true Legion of Honour of the Heavens, than he who bears on his breast and in his heart, not a knot of ribbon, but the imprint of a bloody Cross, and for the sake of that yields himself, body, soul, and spirit to God’s service. The vessels that are devoted are the sacrificial vessels of the Temple, which are sacred beyond the golden cups of household use, and yet the commonest domestic utensils may become honourable by virtue of their being thus consecrated. So one of the old prophets. using the same metaphor as my text, with a slightly different application, says that in the day when the Kingdom of God assumes its perfect form upon earth, every pot in Jerusalem shall be as the bowls of the altar, and on the very horse-bells shall be written, ‘Consecrated to the Lord.’ The vessel unto honour must be sanctified.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Then again, ‘meet for the master’s use.’ On the great buffet in the banqueting hall, the cup in the centre, that belongs to the householder, and is lifted to his glowing lips, is the most honourable of all. Every Christian man amongst us may be used by the Christ, and may - more wonderful still! - be useful to Christ. That is condescension, is it not? You remember how, when He would, in modest prophetic pomp, once for all assert in public His claim to be the King of Israel, He sent two of His servants ‘into the village over against’ them with this message, ‘The Lord hath need of him,’ the humble ass. Jesus Christ needs you to carry out His purposes, to be His representatives and the executors of His will, His viceroys and servants in this world. And there is no honour higher than that I, for all my imperfections and limitations, with all my waywardness and slothfulness, should yet be taken by Him, and made use of by Him. Brother l have you any ambition to be used by Jesus, and to be useful to Jesus? And are you of any use to Him? Have you ever been? The questions are for our own hearts, in the privacy of communion with God. I leave them with you.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Ready for every good work.’ The habit of service will grow. A man that is consecrated, and being used by Jesus Christ, will become more and more useful all round. It ought to be our ambition to be men-of-all-work to our Lord. There is great danger of our all yielding to natural limitations, as we suppose them, and confining ourselves to what we take to be our role. It is all right that that should be the prominent part of our ministry in the world. But let us beware of the limitations and the onesidedness that attaches to us, and be ready for the distasteful work, for the uncongenial work, for the work to which our natural fastidiousness and temperaments do not call us. Let us, as I say, try to be many-sided, and to stand with our loins girt and our lamps burning, and our wills held well down, and say ‘ Lord! what wouldst Thou have me to do? Here am I; send me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Now a word about the last point that is here, and that is the plain direction as to the way in which this possibility may become a reality for us all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘If a man purge himself from these.’ These; whom? The’ vessels to dishonour.’ Get out of that class. And how? By purifying yourselves. So, then, there is no necessity of any sort which determines the class to which we belong except our own earnestness and effort. You remember our Lord’s other parable of the four sowings in four different soils. Was there any unconquerable necessity which compelled the wayside soil to be hard and beaten, or the rocky one to be impermeable, or the thorny one to be productive only of thorns and briars? Could they not all have become good soil? And why did they not? Because the men that they represented did not care to become so. And in like manner there is no reason why the earthen pot should not become gold, or the wooden one silver, or the silver one gold - ay! or the gold silver, or the silver wood, or the wood earth. Paul was an earthen vessel, and he became ‘a chosen vessel’ of gold. Judas was a vessel of silver, and he became s vessel of earth, and was dashed in pieces like a potter’s vessel. So you can settle your place. How do you settle it? By purity. Character makes us serviceable. Christ’s kingdom is more helped, His purposes advanced, His will furthered, by holy lives than by shining gifts. And whether you can do much for Him by the latter or no, you can do more for Him by far by means of the former. And you can all have that if you will.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Only notice that purity which makes serviceable, and therefore honourable, and is capable of degrees as between silver and gold, is to be won by our own efforts. ‘If a man therefore shall purify himself.’ I know, of course, that whoever has honestly set himself, for Christ’s sake, to the task of purifying himself, very soon finds out that he, with his ten thousand, cannot beat the king that comes against him with twenty thousand; and if he is a wise man he sends an embassage, not to the enemy, but to the Emperor, and says, ‘Come Thou and help me.’ If we try to purify ourselves, we are necessarily thrown back upon God’s help to do it. But there must be the personal effort, and that effort must go mainly, I think, in the direction of effort to grasp and hold by faith and obedience the Divine Life which come into us and purifies us; and in the other direction of effort to apply to every part of our character and conduct the divine help which we bring to our aid by our humble faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So, brethren, we can, if we will, purify ourselves, and we shall do it most surely when we fall back upon him, and say, ‘Give me the power - that I may perfect holiness in the fear of the Lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Some of us are vessels in another house. But Christ has bound the strong man and spoiled his goods, and taken from him all the armour in which he trusted, and the vessels which he used. And if we will only take Christ’s liberation, and cast ourselves on His grace and power, then we shall be lifted from the dark and doleful house of the strong man, and set in the great house of the great Lord. Yield not your members as instruments of unrighteousness, but yield yourselves unto God, and your members as instruments of righteousness to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Timothy 2:20-21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 2:20-21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But in a great house ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Such as the Christian Church soon became, taking in multitudes of Gentiles in all parts of Asia, Macedonia, Greece, and Italy, and such as it has long been, and now is; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there are not only vessels of gold and silver ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Designed for the most honourable uses; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but of wood and of earth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Intended for uses less houourable. The apostle alludes to the houses of nobles, princes, and other great persons, in which are usually found vessels of different materials, and for various uses. Thus, in the visible church, there always have been, are, and will be, persons of different gifts or abilities, and intended for different offices, as is also represented where the apostle compares the members of the church of Christ to the different members of the human body, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:12-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and elsewhere. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And some to honour, and some",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to dishonour ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That Isaiah , 1 st, Some designed and qualified for more honourable offices than others; and, 2d, Some whose holy tempers and practices are an honour to the religion they profess; and others who, if by departing from outward iniquity they obtain a name and place among the people of God, and are reckoned members of the visible church, yet, by their hypocrisy, formality, lukewarmness, and negligence, are so far from adorning the doctrine of God their Saviour, or from being an honour to the cause of Christ, that they are a disgrace to it. But ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if a man purge himself from these ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— 1st, By making application by faith to Christ’s cleansing blood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 1 John 2 d, By praying for and receiving God’s purifying Spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 36:25-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 1 Peter 3 d, By receiving and obeying the purifying word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 1 Peter 4 th, By exercising purifying faith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Acts , , 5 th, By self-denial and mortification ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he shall be a vessel unto honour — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He shall be a credit to the religion of Jesus; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sanctified ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, separated from sin and sinners, and dedicated to God in heart and life; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "meet for the master’s use",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — For the service of Christ; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prepared unto ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— And employed in; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "every good work ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Which he is called to perform. Add to this, not only may those who are vessels unto dishonour in the bad sense, and a reproach to the Christian cause, become an honour to it by their vital piety and active virtue; but those whose gifts are inferior, and who are like vessels of wood and earth, only fit for lower offices in the church, may, by properly exercising their gifts and graces, so improve them as to become qualified for higher and more useful offices; and be, as it were, vessels of silver and gold. For to him that hath, that makes a right use of, and improves what he hath, shall more be given, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Still, however, they will be but vessels; empty in themselves, and useless, if not filled by, and employed for, the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:14-21 Those disposed to strive, commonly strive about matters of small moment. But strifes of words destroy the things of God. The apostle mentions some who erred. They did not deny the resurrection, but they corrupted that true doctrine. Yet nothing can be so foolish or erroneous, but it will overturn the temporary faith of some professors. This foundation has two writings on it. One speaks our comfort. None can overthrow the faith of any whom God hath chosen. The other speaks our duty. Those who would have the comfort of the privilege, must make conscience of the duty Christ gave himself for us, that he might redeem us from all iniquity, Tit 2:14. The church of Christ is like a dwelling: some furniture is of great value; some of smaller value, and put to meaner uses. Some professors of religion are like vessels of wood and earth. When the vessels of dishonour are cast out to be destroyed, the others will be filled with all the fulness of God. We must see to it that we are holy vessels. Every one in the church whom God approves, will be devoted to his Master's service, and thus fitted for his use.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But in a great house - Still keeping up the comparison of the church with a building. The idea is, that the church is a large edifice, and that in such a building we are not to expect entire uniformity in all the articles which it contains.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There are not only vessels of gold and of silver, ... - You are not to expect to find all the articles of furniture alike, or all made of the same material. Variety in the form, and use, and material, is necessary in furnishing such a house.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And some to honour, and some to dishonour - Some to most honorable uses - as drinking vessels, and vessels to contain costly viands, and some for the less honorable purposes connected with cooking, etc. The same thing is to be expected in the church. See this idea illustrated at greater length under another figure in the notes at 1 Corinthians 12:14-26; compare the notes, Romans 9:21. The application here seems to be, that in the church it is to be presumed that there will be a great variety of gifts and attainments, and that we are no more to expect that all will be alike, than we are that all the vessels in a large house will be made of gold. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And some to honour, and some to dishonour - Some to most honorable uses - as drinking vessels, and vessels to contain costly viands, and some for the less honorable purposes connected with cooking, etc. The same thing is to be expected in the church. See this idea illustrated at greater length under another figure in the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 12:14-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare the notes, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The application here seems to be, that in the church it is to be presumed that there will be a great variety of gifts and attainments, and that we are no more to expect that all will be alike, than we are that all the vessels in a large house will be made of gold. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. in a great house—that is, the visible professing Christian Church (1Ti 3:15). Paul is speaking, not of those without, but of the [visible] family of God [Calvin]. So the parable of the sweep-net (Mt 13:47-49) gathering together of every kind, good and bad: as the good and bad cannot be distinguished while under the waves, but only when brought to shore, so believers and unbelievers continue in the same Church, until the judgment makes the everlasting distinction. \"The ark of Noah is a type of the Church; as in the former there were together the leopard and the kid, the wolf and the lamb; so in the latter, the righteous and sinners, vessels of gold and silver, with vessels of wood and earth\" [Jerome, Dialogue against the Luciferians, 302] (compare Mt 20:16).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "vessels of gold … silver—precious and able to endure fire.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of wood and earth—worthless, fragile, and soon burnt (1Co 3:12-15; 15:47).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "some … some—the former … the latter.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to dishonour—(Pr 16:4; Ro 9:17-23).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Look as it is in a great house, there are several vessels, made of several materials, and for several ends and uses; some are made of gold, some of silver, some of wood, some of earth; some made and bought for more noble and honourable uses, others for more vile, base, and dishonourable uses: so it is in the church of God, which is large, and like a great house. In it are many members; some have obtained like precious faith with us, who are as gold tried in the fire, or like silver purified seven times, by the word of God, and his Spirit sitting as a refiner upon their hearts. But all they are not gold or silver who glitter in an outward profession; some of them have earthy, wooden souls, savouring only sensual things, having nothing of precious faith in them, and are not yet purged from their filthiness, wanting all truth of grace, or sincerity of love. Some, whose work is to honour God, being created to good works, and whose reward will be to be honoured and glorified by him: others, who, by their apostacy from their faith and profession, and by their wicked lives, will dishonour him, and will be eternally rejected by him, as reprobate silver, and sons of perdition. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But in a great house,.... This simile the apostle makes use of, to show that it need not seem strange, nor should it be distressing to anyone's mind, to hear that men of such wicked principles and practices should be in the church of God, who are before mentioned; since in every great house or palace, the house of a nobleman, or palace of a king, there is a variety of vessels of different matter, and for different uses, and some are mean, despicable, and dishonourable; and so it is in the church of God: for by this great house, in the application of the simile, is not meant the world, as some think; for though that is a house built by God, who built all things; and is a very large one, and full of inhabitants, comparable to vessels; and there are in it both good and bad, as always have been; yet it is no startling thing to any man, that there should be bad men in it; rather the wonder is, that there should be any good; but by this house is meant the church of the living God, the pillar and ground of truth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; see Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There are not only vessels of gold and of silver; persons who are members of the visible church, who are comparable to gold and silver, for their worth and value, and preciousness in the sight of Christ, who accounts them his jewels, and peculiar treasure; and for their excellency and usefulness in the church, by reason of those differing gifts bestowed upon them; and for their lustre and purity, both of doctrine and of life; and for their solidity and duration: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but also of wood, and of earth: there are others in a visible church state, who are like to dry wood, destitute of the grace of God, and are fit matter for Satan to work upon, and by them raise and increase the flames of contention and division, and will be fit fuel for everlasting burnings; and there are others who are sensual, and carnal, and worldly, who mind earth, and earthly things, and have no spirituality, nor spiritual mindedness in them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and some to honour; who are designed for honourable service, and behave honourably, and are worthy of honour in the church; are honourable officers, or members in it; and are to the honour of Christ, and the Gospel; and shall at last enjoy honour, glory, immortality, and eternal life. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And some to dishonour; who are to the disreputation of the church, the dishonour of religion, and scandal of the Gospel; by them God is dishonoured, his ways evil spoken of, his doctrines blasphemed, and his name reproached; and who are themselves dishonourable among men now, and will be covered with shame and everlasting contempt hereafter. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And some to dishonour; who are to the disreputation of the church, the dishonour of religion, and scandal of the Gospel; by them God is dishonoured, his ways evil spoken of, his doctrines blasphemed, and his name reproached; and who are themselves dishonourable among men now, and will be covered with shame and everlasting contempt hereafter. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{12} But in a great house there are not only vessels of gold and of silver, but also of wood and of earth; and some to honour, and some to dishonour.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{12}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " But in a great house there are not only vessels of gold and of silver, but also of wood and of earth; and some to honour, and some to dishonour.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(12) The taking away of an objection: it is not dishonour to the good man of the house, that he has not in a great house all vessels of one sort and for one service, but we must look to this, that we are found vessels prepared to honour.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To the church as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θεμέλιος τοῦ Θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " only those belong whom the Lord acknowledges as His, and who abstain from every kind of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀδικία",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This thought is contained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But there were also in the church ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄδικοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", opposing the gospel by word and deed. This strange fact Paul now explains by a figure: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν μεγάλῃ δὲ οἰκίᾳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Greek expositors understand by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἰκία",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “the world,” to which Calvin rightly objects: ac contextus quidem huc potius nos ducit, ut de ecclesia intelligamus; neque enim de extraneis disputat Paulus, sed de ipsa Dei familia. It is different with the similar passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ ἔστι μόνον σκεύη χρυσᾶ καὶ ἀργυρᾶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀλλὰ καὶ ξύλινα καὶ ὀστρὰκινα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] By the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "former",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " articles are meant the worthy, genuine members of the church; by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "latter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", those not genuine (not: those less good, Estius, Mosheim, and others): “each class, however, contains degrees within itself; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” (Wiesinger). The apostle’s distinction is given more precisely in the next words, which cannot be referred alike to each of the two classes named, but express the same antithesis: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ἃ μὲν εἰς τιμήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz. the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σκεύη χρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀργ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἃ δὲ εἰς ἀτιμίαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz. the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σκεύη ξυλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὀστράκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To this Hofmann objects, that the material of the vessels does not determine their purpose and use, and that the second clause, therefore, does not correspond with the first; “the first antithesis rather declares that in the house of God there are members of rich gifts and spiritual attainments, and members whose gifts are few and who spiritually are of no consideration.” But in this way there is manifestly imported an antithesis of which there is no hint in the context. It is indeed true that vessels even of wood and clay may be applied to honourable uses; but undue pressure is laid on the apostle’s words when they are interpreted in accordance with such a possibility.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς τιμήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς ἀτιμίαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " do not refer to the house, nor to their possessor, on whom they bring honour or shame (Matthies), but to the vessels themselves (de Wette, Wiesinger, van Oosterzee). To some honour is given, to others shame, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the various uses to which they are applied by their possessors. The insertion of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἑτοιμασμένα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would give an unsuitable thought; see Meyer and de Wette on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Although the notional Church, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "corpus Christi verum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is unaffected by the vacillation and disloyalty of its members, nevertheless (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δὲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the Church as we experience it contains many unworthy persons, the recognition of whom as members of the Church is a trial to faith. The notional Church is best figured as a foundation, which is out of sight. But the idea of the superstructure must be added in order to shadow forth the Church as it meets the eye. It is a house, a Great House too, the House of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and therefore containing a great variety of kinds and quality of furniture and utensils. On ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἰκία",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a whole house, as distinguished from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἶκος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which might mean a set of rooms only, a dwelling, see Moulton in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Expositor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", vi., vii. 117. There are two thoughts in the apostle’s mind, thoughts which logically are conflicting, but which balance each other in practice. These are: (1) the reality of the ideal Church, and (2) the providential ordering of the actual Church. Until the drag-net is full, and drawn up on the beach, the bad fish in it cannot be cast away (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:47-48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This is the view of the passage taken by the Latin expositors, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Cyprian, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ep",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Leviticus 25. The explanation of the Greek commentators, that by the “great house” is meant the world at large, is out of harmony with the context. It is to be observed that St. Paul expresses here a milder and more hopeful view of the unworthy elements in the Church than he does in the parallel passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There “the vessels unto dishonour” are “vessels of wrath fitted unto destruction”. Here they are all at least in the Great House, and all for some use, even if for less honourable purposes than those served by the vessels of gold and silver; and the next verse suggests that it is perhaps possible for that which had been a “vessel unto dishonour” to become fit for honourable use in the Master’s personal service. We are reminded of the various qualities of superstructure mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “gold, silver, costly stones, wood, hay, stubble”. See also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Wis 15:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Field, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Notes, in loc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", suggests that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δεσπότης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here is best rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the owner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The connexion is; ‘False teachers may do great damage; but the real truth, the strong main structure, is uninjured and stable, while at the same time there may be some bad work in it as well. And to turn from the structure to the furniture, we must distinguish similarly between the good and the bad portions, the valuable and the worthless.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But in a great house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Though",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is better than either ‘but’ A.V. or ‘now’ R.V. Wordsworth explains well of the ‘imperfections and blemishes which exist in the Visible Church on earth,’ and quotes Augustine ‘in congregatione Christiana,’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Serm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 15; where ‘congregatio’ is in the large sense in which St Jerome for example uses it ‘Ecclesia enim congregatio vocatur’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Proverb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". c. 30), and in which ‘congregation’ is used in our English version of the XXXIX. Articles ‘Ecclesia Christi visibilis est coetus fidelium.’ Our Lord’s parable of the Drag-net is the best parallel to this description of the ‘mixed and imperfect condition of the Church on earth,’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Μεγάλῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Such is the Church.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χρυσᾶ καὶ ἁργυρᾶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of gold and of silver",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of precious materials, hard, able to endure fire.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ξὑλινα καὶ ὀστράκινα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of wood and earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of viler materials, fragile, and fearing the fire.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ἃ μὲν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἃ δὲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the former indeed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz. those of gold, to honour; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but the latter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz. those of wood, to quite a different purpose. Even the gold vessel may be applied to dishonourable purposes; that of wood, to such as are honourable; but that does not easily happen in a well regulated household. Members of the Church inferior in point of gifts and degrees of faith and sanctification are not vessels for dishonour, nor ought any one ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκκαθαίρειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to purge",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " himself from these.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "unto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. (twice). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Now in a great house,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. \"Now\" is hardly the right conjunction. It should rather be \"howbeit.\" The object of the figure of the various vessels in the \"great house\" is to show that, though every one that names the Name of the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ought",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to depart from unrighteousness, yet we must not be surprised if it is not so, and if there are found in the Church some professing Christians whose practice is quite inconsistent with their profession. Perhaps even the vilest members of the visible Church perform some useful function, howbeit they do not mean it. With this mention of the vessels, compare the enumeration in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὀστράκινα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); only here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is also applied to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σκεύη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"earthen vessels;\" as it is in the LXX., ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἄγγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 5:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ὄστρακον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"a tile.\" (For the same figure, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:22, 23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) 2 Timothy 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But the church embraces a variety of characters. Unrighteous men steal into it. So, in a great household establishment there are vessels fit only for base uses.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "House (οἰκίᾳ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As θεμέλιος foundation indicates the inward, essential character of the church, οἰκία exhibits its visible, outward aspect. The mixed character of the church points to its greatness (μεγάλῃ).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Vessels (σκεύη)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on Matthew 12:29; see on Mark 3:27; see on Acts 9:15; see on Acts 27:17; see on 1 Peter 3:7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 3:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 9:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 27:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 3:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Of wood and of earth (ξύλινα καὶ ὀστράκινα)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ξύλινος wooden only here and Revelation 9:20. Ὁστράκινος of baked clay, only here and 2 Corinthians 4:7 (note). Comp. the different metaphor, 1 Corinthians 3:12.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ξύλινος wooden only here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 9:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Ὁστράκινος of baked clay, only here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (note). Comp. the different metaphor, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Some to honor and some to dishonor",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "After Romans 9:21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "After ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]