[{"num":2,"verse":"And Jonah prayed to the Lord his God from the fish’s womb,"},{"num":2,"verse":"and said, I cried to God of my tribulation, and he heard me (and he said, I cried out to God in my tribulation, and he heard me); from the womb of hell I cried, and thou heardest my voice."},{"num":3,"verse":"Thou castedest me down into deepness, in the heart of the sea, and the floods compassed me [about]; all thy swells and thy waves passed on me. (Thou hast thrown me down into the depths, into the heart of the sea, and the water surrounded me; yea, all thy swells and thy waves passed over me.)"},{"num":4,"verse":"And I said, I am cast away from the sight of thine eyes; nevertheless again I shall see thine holy temple. (And I said, Though I am thrown away from thy sight; nevertheless I shall see thy holy Temple again.)"},{"num":5,"verse":"Waters (en)compassed me till to my soul, deepness environed me, the sea(weed) covered mine head. (The water surrounded me unto my very breath, the depths environed me, the seaweed covered my head.)"},{"num":6,"verse":"I went down to the uttermost places of hills, the bars of earth (en)closed me (al)together, into without end; and thou, my Lord God, shalt raise up my life from corruption. (I went down to the uttermost places, or the very roots, of the hills, or of the mountains, and there the bars, or the gates, of the earth would have locked me in forever; but thou, my Lord God, raised up my life from corruption.)"},{"num":7,"verse":"When my soul was anguished in me, I bethought on the Lord, that my prayer come to thee, to thine holy temple. (And when my soul was anguished within me, I thought about the Lord, and that my prayer would come to thee, in thy holy Temple.)"},{"num":8,"verse":"They that keep vanities, forsake their mercy idly. (Those who worship idols, idly desert thy mercy.)"},{"num":9,"verse":"But I in voice of praising shall offer to thee; whatever things I vowed, I shall yield to the Lord, for mine health. (But I shall offer to thee, with my words of praise; yea, whatever I have vowed, I shall give to the Lord, for my deliverance, or my salvation.)"},{"num":10,"verse":"And the Lord said to the fish, and it casted out Jonah on/to the dry land. (And then the Lord spoke to the fish, and it cast out Jonah on/to the dry land.)"}]