[{"num":41,"verse":"Next we went into the main room of the temple. The man measured the doorway of this room: It was ten feet wide, "},{"num":2,"verse":"seventeen feet long, and the distance from the doorway to the wall on either side was eight feet. The main room itself was sixty-eight feet by thirty-four feet."},{"num":3,"verse":"Then the man walked to the far end of the temple’s main room and said, “Beyond this doorway is the most holy place.” He first measured the doorway: It was three feet wide, ten feet long, and the distance from the doorway to the wall on either side was twelve feet. Then he measured the most holy place, and it was thirty-four feet square."},{"header":"The Storage Rooms of the Temple"},{"num":5,"verse":"The man measured the wall of the temple, and it was ten feet thick. Storage rooms seven feet wide were built against the outside of the wall. "},{"num":6,"verse":"There were three levels of rooms, with thirty rooms on each level, and they rested on ledges that were attached to the temple walls, so that nothing was built into the walls. "},{"num":7,"verse":"The walls of the temple were thicker at the bottom than at the top, which meant that the storage rooms on the top level were wider than those on the bottom level. Steps led from the bottom level, through the middle level, and into the top level."},{"num":8,"verse":"The temple rested on a stone base ten feet high, which also served as the foundation for the storage rooms. "},{"num":9,"verse":"The outside walls of the storage rooms were eight feet thick; there was nothing between these walls "},{"num":10,"verse":"and the nearest buildings thirty-four feet away. "},{"num":11,"verse":"One door led into the storage rooms on the north side of the temple, and another door led to those on the south side. The stone base extended eight feet beyond the outside wall of the storage rooms."},{"header":"The West Building and the Measurements of the Temple"},{"num":12,"verse":"I noticed another building: It faced the west end of the temple and was one hundred seventeen feet wide, one hundred fifty feet long, and had walls over eight feet thick."},{"num":13,"verse":"The man measured the length of the temple, and it was one hundred seventy feet. He then measured from the back wall of the temple, across the open space behind the temple, to the back wall of the west building; it was one hundred seventy feet. "},{"num":14,"verse":"The distance across the front of the temple, including the open space on either side, was also one hundred seventy feet."},{"num":15,"verse":"Finally, the man measured the length of the west building, including the side rooms on each end, and it was also one hundred seventy feet."},{"header":"The Inside of the Temple"},{"num":16,"verse":"were paneled with wood all the way from the floor to the windows, while the doorways, the small windows, and the three side rooms were trimmed in wood. "},{"num":17,"verse":"The paneling stopped just above the doorway. These walls were decorated "},{"num":18,"verse":"with carvings of winged creatures and had a carving of a palm tree between the creatures. Each winged creature had two faces: A human face looking at the palm tree on one side, and a lion’s face looking at the palm tree on the other side. These designs were carved into the paneling all the way around the two rooms."},{"num":21,"verse":"The doorframe to the temple’s main room was in the shape of a rectangle."},{"header":"The Wooden Altar"},{"num":22,"verse":"a wooden altar. It was five feet high and four feet square, and its corners, its base, and its sides were made of wood. The man said, “This is a reminder that the Lord is constantly watching over his temple.”"},{"header":"The Doors in the Temple"},{"num":23,"verse":"Both the doorway to the main room of the temple and the doorway to the most holy place had two doors, "},{"num":24,"verse":"and each door had two sections that could fold open. "},{"num":25,"verse":"The doors to the main room were decorated with carvings of winged creatures and palm trees just like those on the walls, and there was a wooden covering over the porch just outside these doors. "},{"num":26,"verse":"The walls on each side of this porch had small windows and were also decorated with carvings of palm trees."}]