[{"header":"Israel’s Mourning Turned to Joy"},{"num":31,"verse":"“At that time,” says the Lord, “I will be the God of all the families of Israel, and they shall be My people.”"},{"num":16,"verse":"Thus says the Lord,"},{"num":23,"verse":"Thus says the Lord of hosts, the God of Israel, “Once more they will speak these words in the land of Judah (the Southern Kingdom) and in her cities when I restore their fortunes and release them from exile,"},{"num":24,"verse":"And [the people of] Judah and all its cities will live there together—the farmer and they who wander about with flocks. "},{"num":25,"verse":"For I [fully] satisfy the weary soul, and I replenish every languishing and sorrowful person.” "},{"num":26,"verse":"At this I (Jeremiah) awoke and looked, and my [trancelike] sleep was sweet [in the assurance it gave] to me."},{"header":"A New Covenant"},{"num":27,"verse":"“Behold (listen carefully), the days are coming,” says the Lord, “when I will sow the house of Israel and the house of Judah with the seed of man and with the seed of beast. "},{"num":28,"verse":"It will be that as I have watched over them to uproot and to break down, to overthrow, destroy, and afflict with disaster, so I will watch over them to build and to plant [with good],” says the Lord."},{"num":30,"verse":"But everyone will die [only] for his own wickedness; every man who eats sour grapes—his [own] teeth shall be set on edge."},{"num":31,"verse":"“Behold, the days are coming,” says the Lord, “when I will make a new covenant with the house of Israel (the Northern Kingdom) and with the house of Judah (the Southern Kingdom), "},{"num":32,"verse":"not like the covenant which I made with their fathers in the day when I took them by the hand to bring them out of the land of Egypt, My covenant which they broke, although I was a husband to them,” says the Lord. "},{"num":33,"verse":"“But this is the covenant which I will make with the house of Israel after those days,” says the Lord, “I will put My law within them, and I will write it on their hearts; and I will be their God, and they will be My people. "},{"num":34,"verse":"And each man will no longer teach his neighbor and his brother, saying, ‘Know the Lord,’ for they will all know Me [through personal experience], from the least of them to the greatest,” says the Lord. “For I will forgive their wickedness, and I will no longer remember their sin.”"},{"num":37,"verse":"Thus says the Lord,"},{"num":38,"verse":"“Behold, the days are coming,” says the Lord, “when the city [of Jerusalem] will be rebuilt for the Lord from the Tower of Hananel to the Corner Gate. "},{"num":39,"verse":"The measuring line will go out farther straight ahead to the hill Gareb; then it will turn to Goah. "},{"num":40,"verse":"And the whole valley (Hinnom) of the dead bodies and [the hill] of the ashes [long dumped there from the temple sacrifices], and all the fields as far as the brook Kidron, to the corner of the Horse Gate toward the east, shall be holy to the Lord. It (the city) will not be uprooted or overthrown anymore to the end of the age.”"}]