[{"header":"Both Israel and Judah Will Be Rescued"},{"num":31,"verse":"“At that time,” declares the Lord, “I will be the God of all the families of Israel, and they will be my people.”"},{"num":2,"verse":"This is what the Lord says:"},{"num":3,"verse":"The Lord appeared to me in a faraway place and said,"},{"num":7,"verse":"This is what the Lord says:"},{"num":15,"verse":"This is what the Lord says:"},{"num":16,"verse":"This is what the Lord says:"},{"num":23,"verse":"This is what the Lord of Armies, the God of Israel, says: When I have brought them back from captivity, they will once again use this saying in Judah and in its cities:"},{"num":26,"verse":"At this, I woke up and looked around. My sleep had been pleasant."},{"num":27,"verse":"“The days are coming,” declares the Lord, “when I will plant the nations of Israel and Judah with people and animals. "},{"num":28,"verse":"Once I watched over them to uproot them, to tear them down, and to wreck, ruin, and hurt them. Now I will watch over them to build them up and to plant them,” declares the Lord. "},{"num":29,"verse":"“When those days come, people will no longer say, ‘Fathers have eaten sour grapes, and their children’s teeth are set on edge.’ "},{"num":30,"verse":"But each person will die for his own sin. Whoever eats sour grapes will have his own teeth set on edge."},{"header":"The New Promise"},{"num":31,"verse":"“The days are coming,” declares the Lord, “when I will make a new promise  to Israel and Judah. "},{"num":32,"verse":"It will not be like the promise that I made to their ancestors when I took them by the hand and brought them out of Egypt. They rejected that promise, although I was a husband to them,” declares the Lord. "},{"num":33,"verse":"“But this is the promise that I will make to Israel after those days,” declares the Lord: “I will put my teachings inside them, and I will write those teachings on their hearts. I will be their God, and they will be my people. "},{"num":34,"verse":"No longer will each person teach his neighbors or his relatives by saying, ‘Know the Lord.’ All of them, from the least important to the most important, will know me,” declares the Lord, “because I will forgive their wickedness and I will no longer hold their sins against them.”"},{"num":37,"verse":"This is what the Lord says:"},{"num":38,"verse":"“The days are coming,” declares the Lord, “when the city will be rebuilt for me from the Tower of Hananel to Corner Gate. "},{"num":39,"verse":"A measuring line will stretch from there straight to the Hill of Gareb, and then it will turn to Goah. "},{"num":40,"verse":"The whole valley, filled with its dead bodies and ashes, and the whole area to the Kidron Valley, as far as the corner of Horse Gate in the east, will be holy to the Lord. It will never be uprooted or torn down again.”"}]