[{"header":"Hope for Restoration"},{"num":31,"verse":"“In that day,” says the Lord, “I will be the God of all the families of Israel, and they will be my people."},{"num":2,"verse":"This is what the Lord says:"},{"header":"Rachel’s Sadness Turns to Joy"},{"num":15,"verse":"This is what the Lord says: "},{"num":23,"verse":"This is what the Lord of Heaven’s Armies, the God of Israel, says: “When I bring them back from captivity, the people of Judah and its towns will again say, ‘The Lord bless you, O righteous home, O holy mountain!’"},{"num":24,"verse":"Townspeople and farmers and shepherds alike will live together in peace and happiness."},{"num":25,"verse":"For I have given rest to the weary and joy to the sorrowing.”"},{"num":26,"verse":"At this, I woke up and looked around. My sleep had been very sweet."},{"num":27,"verse":"“The day is coming,” says the Lord, “when I will greatly increase the human population and the number of animals here in Israel and Judah."},{"num":28,"verse":"In the past I deliberately uprooted and tore down this nation. I overthrew it, destroyed it, and brought disaster upon it. But in the future I will just as deliberately plant it and build it up. I, the Lord, have spoken!"},{"num":29,"verse":"“The people will no longer quote this proverb:"},{"num":30,"verse":"All people will die for their own sins—those who eat the sour grapes will be the ones whose mouths will pucker."},{"num":31,"verse":"“The day is coming,” says the Lord, “when I will make a new covenant with the people of Israel and Judah."},{"num":32,"verse":"This covenant will not be like the one I made with their ancestors when I took them by the hand and brought them out of the land of Egypt. They broke that covenant, though I loved them as a husband loves his wife,” says the Lord."},{"num":33,"verse":"“But this is the new covenant I will make with the people of Israel after those days,” says the Lord. “I will put my instructions deep within them, and I will write them on their hearts. I will be their God, and they will be my people."},{"num":34,"verse":"And they will not need to teach their neighbors, nor will they need to teach their relatives, saying, ‘You should know the Lord.’ For everyone, from the least to the greatest, will know me already,” says the Lord. “And I will forgive their wickedness, and I will never again remember their sins.”"},{"num":38,"verse":"“The day is coming,” says the Lord, “when all Jerusalem will be rebuilt for me, from the Tower of Hananel to the Corner Gate."},{"num":39,"verse":"A measuring line will be stretched out over the hill of Gareb and across to Goah."},{"num":40,"verse":"And the entire area—including the graveyard and ash dump in the valley, and all the fields out to the Kidron Valley on the east as far as the Horse Gate—will be holy to the Lord. The city will never again be captured or destroyed.”"}]