[{"num":31,"verse":"In that time, saith the Lord, I shall be God to all the kindreds of Israel; and they shall be into a people to me. (At that time, saith the Lord, I shall be God to all the tribes of Israel; and they shall be my people.)"},{"num":2,"verse":"The Lord saith these things, The people that was left of sword, found grace in desert; Israel shall go to his rest. (The Lord saith these things, The people who were left from the sword, found favour in the wilderness; yea, Israel shall take rest.)"},{"num":3,"verse":"(From) Far (off) the Lord appeared to me, and in everlasting charity I loved thee; therefore I doing mercy drew thee. (From far away/From long ago the Lord appeared to me, and said, I loved thee with an everlasting love; and so I doing mercy drew thee to me.)"},{"num":4,"verse":"And again I shall build thee, and thou, virgin Israel, shalt be builded; yet thou shalt be adorned with thy tympans, and shalt go out in the quire, either company, of players. (And I shall rebuild thee, and thou, virgin of Israel, shalt be rebuilt; yet thou shalt be adorned with thy drums, or with thy tambourines, and thou shalt go out with the group, or with the company, of dancers.)"},{"num":5,"verse":"Yet thou shalt plant vines in the hills of Samaria; men planting shall plant, and till the time come, they shall not gather grapes (and when the time come, they shall gather the grapes)."},{"num":6,"verse":"For why a day shall be, wherein keepers shall cry in the hill of Samaria, and in the hill of Ephraim, Rise ye, and ascend we into Zion, to our Lord God. (For a day shall be, when watchmen shall cry on the hills of Ephraim, Rise ye, and go we up to Zion, to the Lord our God.)"},{"num":7,"verse":"For the Lord saith these things, Jacob, make ye full out joy in gladness, and neigh ye against the head of heathen men; sound ye, sing ye, and say ye, Lord, save thy people, the residues of Israel. (For the Lord saith these things, Rejoice with happiness for Jacob’s sake, and shout ye among the chieftains of the heathen; sound ye, sing ye, and say ye, Lord, save thy people, the remnant of Israel.)"},{"num":8,"verse":"Lo! I shall bring them from the land of the north, and I shall gather them from the farthest parts of [the] earth; among which shall be a blind man, and (a) crooked (man), and a woman with child, and (a woman) travailing of child together (and a woman with child, and a woman in labour together), (yea,) a great company of them that shall turn again hither."},{"num":9,"verse":"They shall come in weeping, and I shall bring them again in mercy (They shall come with weeping, but I shall comfort them as I lead them here); and I shall bring them by the strands of waters in a rightful way, (so that) they shall not spurn therein; for I am made a father to Israel, and Ephraim is my engendered son."},{"num":10,"verse":"Ye heathen men, hear the word of the Lord, and tell ye in isles that be [a]far (off), and say, He that scattered Israel, shall gather it, and shall keep it, as a shepherd keepeth his flock. (Ye heathen, hear the word of the Lord, and tell ye in the islands that be far away, and say, He who scattered Israel, shall gather it, and shall watch over it, like a shepherd watcheth over his flock.)"},{"num":11,"verse":"For the Lord again-bought Jacob, and delivered him from the hand of the mightier. (For the Lord rescued, or ransomed, Jacob, and saved him from the hand of the one mightier than himself.)"},{"num":12,"verse":"And they shall come, and praise in the hill of Zion; and they shall flow together to the goods of the Lord, on wheat, wine, and oil, and on the fruit of sheep, and of neat; and the soul of them shall be as a watery garden, and they shall no more hunger. (And they shall come, and give praise on Mount Zion; and they shall altogether flow with the good things of the Lord, with wheat, and wine, and oil, and with the fruit of sheep, and with cattle; and their souls shall be like a watered garden, and they shall no longer have hunger.)"},{"num":13,"verse":"Then a virgin shall be glad in a company, young men and eld together (Then a virgin, or a maiden, shall dance, and be glad, and men young and old shall rejoice together); and I shall turn the mourning of them into joy, and I shall comfort them, and I shall make them glad (from out) of their sorrow."},{"num":14,"verse":"And I shall greatly fill the soul of [the] priests with fatness, and my people shall be [ful]filled with my goods, saith the Lord."},{"num":15,"verse":"The Lord saith these things, A voice of wailing, and of weeping, and of mourning, was heard on high (was heard in Ramah); the voice of Rachel beweeping her sons, and not willing to be comforted on them, for they be not."},{"num":16,"verse":"The Lord saith these things, Thy voice rest of weeping, and thine eyes rest of tears; for why meed is to thy work, saith the Lord; and they shall turn again from the land of the enemy. (The Lord saith these things, Let thy voice rest from weeping, and thine eyes rest from tears; for there shall be a reward for thy work, saith the Lord; and they shall return from the land of the enemy.)"},{"num":17,"verse":"And hope is to thy last things, saith the Lord; and thy sons shall turn again to their ends. (And there is hope in thy last things, saith the Lord, and thy sons and daughters shall return to their own lands.)"},{"num":18,"verse":"I hearing heard Ephraim passing over; saying, thou chastisedest me, and I am learned as a young one untamed, either wild; turn thou me, and I shall be turned again, for thou art my Lord God. (Hearing I heard Ephraim mourning, saying, thou hast disciplined, or hast corrected, me, and now I am taught, I who before was like a young calf, untamed and wild; restore thou me, yea, let me return, for thou art the Lord my God.)"},{"num":19,"verse":"For after that thou convertedest me, I did penance; and after that thou showedest to me, I smote mine hip (I struck my hip); I am ashamed, and I (am) shamed, for I (have) suffered the shame of my youth."},{"num":20,"verse":"For Ephraim is a worshipful son to me, for he is a delicate child; for since I spake of him, yet I shall have mind on him; therefore mine entrails be troubled on him, I doing mercy shall have mercy on him, saith the Lord. (For Ephraim is a dear son to me, he is a delightful child; for though I spoke against him, still I remembered him; and so my bowels, or my innards, be concerned for him, I doing mercy shall have mercy on him, saith the Lord.)"},{"num":21,"verse":"Ordain to thee an high lookout place, set to thee bitternesses; (ad)dress thine heart into a straight way, in which thou went; turn again, thou virgin of Israel, turn again to these thy cities. (Ordain for thyself a high lookout place, put up signposts for thyself; direct thy heart toward the straight way in which thou went before; return, O virgin of Israel, return to these thy cities.)"},{"num":22,"verse":"How long, daughter of unsteadfast dwelling, art thou made dissolute in delights? for the Lord hath made a new thing on earth, a woman shall compass a man (for the Lord hath made something new on the earth, a woman shall go about, or shall protect, a man)."},{"num":23,"verse":"The Lord of hosts, God of Israel, saith these things, Yet they shall say this word in the land of Judah, and in the cities thereof, when I shall turn (again) the captivity of them (when I shall restore their fortunes), The Lord bless thee, thou fairness of rightfulness, thou holy hill."},{"num":24,"verse":"And Judah, and all the cities thereof shall dwell in it together, (yea,) earth-tillers, and they that drive flocks."},{"num":25,"verse":"For I filled greatly a faint soul, and I have [full-]filled each hungry soul. (For I have greatly filled a faint soul, and I have filled full each hungry soul.)"},{"num":26,"verse":"Therefore I am as raised from sleep, and I saw; and my sleep was sweet to me."},{"num":27,"verse":"Lo! days come, saith the Lord, and I shall sow the house of Israel and the house of Judah with the seed of men, and with the seed of work beasts."},{"num":28,"verse":"And as I waked on them, to draw up by the root, and to destroy, and to scatter, and to lose, and to torment; so I shall wake on them, to build, and to plant, saith the Lord. (And as I kept watch over them, in order to draw them up by the root, and to destroy, and to scatter, and to lose, and to torment them, now I shall keep watch over them, in order to build, and to plant them, saith the Lord.)"},{"num":29,"verse":"In those days they shall no more say, The fathers ate a sour grape, and the teeth of [the] sons were astonied;"},{"num":30,"verse":"but each man shall die in his wickedness, each man that eateth a sour grape, his teeth shall be astonied. (but each person shall die for their own wickedness, each person who eateth a sour grape, his teeth shall be astonished, or shall be set on edge.)"},{"num":31,"verse":"Lo! days come, saith the Lord, and I shall smite a new bond of peace to the house of Israel, and to the house of Judah; (Lo! days shall come, saith the Lord, and I shall strike a new covenant with the house of Israel, and with the house of Judah;)"},{"num":32,"verse":"not by the covenant which I made with your fathers, in the day in which I took the hand of them, to lead them out of the land of Egypt, the covenant which they made void; and I was Lord of them, saith the Lord (though I was like a lord, or like a husband, to them, saith the Lord)."},{"num":33,"verse":"But this shall be the covenant, which I shall smite with the house of Israel after those days, saith the Lord; I shall give my law in the entrails of them, and I shall write it in the heart of them, and I shall be into God to them, and they shall be into a people to me. (But this shall be the covenant, which I shall strike with the house of Israel after those days, saith the Lord; I shall put my Law in their bowels, or in their innards, and I shall write it upon their hearts, and I shall be their God, and they shall be my people.)"},{"num":34,"verse":"And a man shall no more teach his neighbour, and a man his brother, and say, Know thou the Lord; for all shall know me, from the least of them unto the most, saith the Lord; for I shall be merciful to the wickednesses of them, and I shall no more be mindful on the sin of them (for I shall be merciful to them regarding their wickednesses, and I shall remember their sin no more)."},{"num":35,"verse":"The Lord saith these things, that giveth the sun in the light of day, the order of the moon and of the stars in the light of the night, which troubleth the sea, and the waves thereof sound, the Lord of hosts is name to him. (The Lord saith these things, who giveth the sun for the light of the day, and the order of the moon and of the stars for the light of the night, who troubleth the sea, and its waves sound, or roar, the Lord of hosts is his name.)"},{"num":36,"verse":"If these laws fail before me, saith the Lord, then and the seed of Israel shall fail, that it be not a folk before me in all days. (If these laws fail before me, saith the Lord, then also the children, or the descendants, of Israel shall fail, so that they be not a nation before me forever.)"},{"num":37,"verse":"The Lord saith these things, If (the) heavens above may be measured, and the foundaments of [the] earth beneath be sought out, and I shall cast away all the seed of Israel, for all things which they did, saith the Lord. (The Lord saith these things, If the heavens above could be measured, and the foundations of the earth beneath could be sought out, only then would I cast away all the children, or the descendants, of Israel, for all the things which they have done, saith the Lord.)"},{"num":38,"verse":"Lo! days come, saith the Lord, and a city shall be builded (again) to the Lord, from the tower of Hananeel unto the gate of the corner. (Lo! the days shall come, saith the Lord, and the city shall be rebuilt in the Lord’s honour, from the Tower of Hananeel unto the Corner Gate.)"},{"num":39,"verse":"And it shall go out over the rule of [the] measure, in the sight thereof, on the hill (of) Gareb, and it shall compass Goath (and it shall go all around Goath),"},{"num":40,"verse":"and all the valley of carrions, and it shall compass [the] ashes, and all the country(side) of death, unto the strand of Kidron, and to the corner of the east gate of horses (and all the valley of the dead, and the ashes, and all the countryside unto the Kidron Stream, and unto the corner of the Horse Gate to the east); (yea,) the holy thing of the Lord shall not be drawn out, and it shall no more be destroyed without end."}]