[{"num":81,"verse":"To the overcomer, on the pressers, [the psalm] of Asaph. Make ye fully joy to God, our helper; sing ye heartily to God of Jacob. (To the overcomer, at the winepresses, the song of Asaph. Make ye full out joy to God, our helper; sing ye heartily to the God of Jacob.)"},{"num":2,"verse":"Take ye a psalm, and give ye a tympan; a merry psaltery with an harp. (Give ye a song, and take ye a drum, or a tambourine; and a merry lute, and a harp.)"},{"num":3,"verse":"Blow ye with a trump in the new moon; in the noble day of your solemnity. (Blow ye with a trumpet for the new moon; yea, on the noble day of our solemn feast.)"},{"num":4,"verse":"For why (this) commandment is in Israel; and doom is to God of Jacob. (For this is a law in Israel; and this ordinance is from the God of Jacob.)"},{"num":5,"verse":"He setted that witnessing in Joseph; when he went out of the land of Egypt, he heard a language, that he knew not. (He put that command on Joseph; when he went out of the land of Egypt. And I heard a language, that I knew not.)"},{"num":6,"verse":"He turned away his back from burdens; his hands served in a coffin. (And the Lord said, I took away the burdens from off his back; his hands were delivered from having to carry the baskets.)"},{"num":7,"verse":"In tribulation thou inwardly calledest me, and I delivered thee; I heard thee in the hid place of tempest, I proved thee at the water(s) of against-saying. (In trouble thou calledest to me, and I saved thee; I answered thee from my hidden place in the tempest, and I proved thee at the waters of Meribah.)"},{"num":8,"verse":"My people, hear thou me, and I shall be witness against thee; Israel, if thou hearest me, (My people, hear thou me, and I shall witness to thee; Israel, if thou wouldest but listen to me,)"},{"num":9,"verse":"a fresh God shall not be in thee; and thou shalt not worship an alien god. (there shall be no new god for thee; and thou shalt never worship any foreign, or strange, god.)"},{"num":10,"verse":"For I am thy Lord God, that led thee out of the land of Egypt; make large thy mouth, and I shall fill it. (For I am the Lord thy God, who led thee out of the land of Egypt; open thy mouth wide, and I shall fill it.)"},{"num":11,"verse":"And my people heard not my voice; and Israel gave not attention to me. (But my people would not listen to my voice; yea, Israel would not give their attention to me.)"},{"num":12,"verse":"And I let go them after the desires of their heart; they shall go in their findings. (So I let them go after the desires of their hearts; and they went forth in their own ways.)"},{"num":13,"verse":"If my people had heard me; if Israel had gone in my ways. (If my people would but listen to me; if Israel would just follow my ways,)"},{"num":14,"verse":"For not in hap I had made low their enemies; and I had sent mine hand on men doing tribulation to them. (then I would bring down their enemies; and I would send forth my hand against those who give them trouble.)"},{"num":15,"verse":"The enemies of the Lord lied (down) to him; and their time shall be into worlds. (And then the Lord’s enemies would fall down before me; and their punishment would last forever.)"},{"num":16,"verse":"And he fed them with the fatness of wheat; and he [ful]filled them with honey of the stone. (And I would feed you with the fatness of the wheat; and fulfill you with honey from the rocks, that is, with wild honey.)"}]