[{"num":3,"verse":"Brothers, I could not speak to you as spiritual people, but as people who are led by the flesh, as infants in Christ. "},{"num":2,"verse":"I fed you with milk, not solid food, because you were not yet ready. Why, even now you are still not ready, "},{"num":3,"verse":"because you are still people who are following the flesh. Indeed, insofar as jealousy, strife, and factions have a place among you, are you not people who are following the flesh? Are you not behaving in a merely human way? "},{"num":4,"verse":"When one says, “I belong to Paul,” and another, “I belong to Apollos,” are you not being merely human?"},{"header":"Analogies Illustrating Ministry and the Church"},{"num":5,"verse":"What then is Apollos? And what is Paul? They are ministers through whom you believed, and each served as the Lord gave him his role. "},{"num":6,"verse":"I planted, Apollos watered, but God was causing the growth. "},{"num":7,"verse":"So then, neither the one who plants nor the one who waters is anything, but it is God who causes the growth. "},{"num":8,"verse":"The one who plants and the one who waters are united, and each will receive his own reward according to his own labor. "},{"num":9,"verse":"For God is the one whom we serve as coworkers, and you are God’s field, God’s building."},{"num":10,"verse":"In keeping with the grace of God given to me, as a wise master builder, I laid a foundation, and someone else is building on it. But let each person be careful how he builds on it. "},{"num":11,"verse":"In fact, no one can lay any other foundation than the one that has been laid, which is Jesus Christ. "},{"num":12,"verse":"But if anyone is building on the foundation with gold, silver, costly stones, wood, hay, or straw, "},{"num":13,"verse":"each person’s work will become evident. The Day will make it plain, because it is going to be revealed in fire, and the fire will test each person’s work to show what sort of work it is. "},{"num":14,"verse":"If what someone has built remains, he will receive a reward. "},{"num":15,"verse":"If someone’s work is burned up, he will suffer loss; he himself will be saved, but it will be like an escape through fire."},{"num":16,"verse":"Do you not know that you yourselves are God’s temple, and that God’s Spirit lives in you? "},{"num":17,"verse":"If anyone destroys God’s temple, God will destroy him. For God’s temple is holy, and that is what you are."},{"num":18,"verse":"Let no one deceive himself. If anyone among you thinks that he is wise in this world, let him become a fool so that he may become wise. "},{"num":19,"verse":"To be sure, the wisdom of this world is foolishness in God’s sight. For it is written, “He catches the wise in their craftiness,” "},{"num":20,"verse":"and again, “The Lord knows the reasoning of the wise; he knows that it is worthless.” "},{"num":21,"verse":"Therefore let no one boast about men. For all things belong to you— "},{"num":22,"verse":"whether Paul, or Apollos, or Cephas, or the world, or life, or death, or things present, or things to come. All things belong to you, "},{"num":23,"verse":"and you belong to Christ, and Christ belongs to God."}]