[{"header":"Teachers Are Only God’s Servants"},{"num":3,"verse":"Brothers and sisters, when I was there, I could not talk to you the way I talk to people who are led by the Spirit. I had to talk to you like ordinary people of the world. You were like babies in Christ."},{"num":2,"verse":"And the teaching I gave you was like milk, not solid food. I did this because you were not ready for solid food. And even now you are not ready."},{"num":3,"verse":"You are still not following the Spirit. You are jealous of each other, and you are always arguing with each other. This shows that you are still following your own selfish desires. You are acting like ordinary people of the world."},{"num":4,"verse":"One of you says, “I follow Paul,” and someone else says, “I follow Apollos.” When you say things like that, you are acting like people of the world."},{"num":5,"verse":"Is Apollos so important? Is Paul so important? We are only servants of God who helped you believe. Each one of us did the work God gave us to do."},{"num":6,"verse":"I planted the seed and Apollos watered it. But God is the one who made the seed grow."},{"num":7,"verse":"So the one who plants is not important, and the one who waters is not important. Only God is important, because he is the one who makes things grow."},{"num":8,"verse":"The one who plants and the one who waters have the same purpose. And each one will be rewarded for his own work."},{"num":9,"verse":"We are workers together for God, and you are like a farm that belongs to God."},{"num":10,"verse":"Like an expert builder I built the foundation of that house. I used the gift that God gave me to do this. Other people are building on that foundation. But everyone should be careful how they build."},{"num":11,"verse":"The foundation that has already been built is Jesus Christ, and no one can build any other foundation."},{"num":12,"verse":"People can build on that foundation using gold, silver, jewels, wood, grass, or straw."},{"num":13,"verse":"But the work that each person does will be clearly seen, because the Day will make it plain. That Day will appear with fire, and the fire will test everyone’s work."},{"num":14,"verse":"If the building they put on the foundation still stands, they will get their reward."},{"num":15,"verse":"But if their building is burned up, they will suffer loss. They will be saved, but it will be like someone escaping from a fire."},{"num":16,"verse":"You should know that you yourselves are God’s temple. God’s Spirit lives in you."},{"num":17,"verse":"If you destroy God’s temple, God will destroy you, because God’s temple is holy. You yourselves are God’s temple."},{"num":18,"verse":"Don’t fool yourselves. Whoever thinks they are wise in this world should become a fool. That’s the only way they can be wise."},{"num":19,"verse":"I say this because the wisdom of this world is foolishness to God. As the Scriptures say, “He catches those who think they are wise in their own clever traps.”"},{"num":20,"verse":"The Scriptures also say, “The Lord knows the thoughts of the wise. He knows that their thoughts are worth nothing.”"},{"num":21,"verse":"So there is not a person on earth that any of you should be boasting about. Everything is yours:"},{"num":22,"verse":"Paul, Apollos, Peter, the world, life, death, the present, and the future—all these are yours."},{"num":23,"verse":"And you belong to Christ, and Christ belongs to God."}]