[{"num":3,"verse":"And I could not speak to you, brothers, as to spiritual men, but as to carnal, as to infants in Christ."},{"num":2,"verse":"I gave you milk to drink, and not solid food. For you were not yet able to bear it, nor are you able even now."},{"num":3,"verse":"For you are still fleshly, since there is among you envying and strife and divisions. Are you not still carnal, and walking as man?"},{"num":4,"verse":"For when one says, ‘I am Paul’s’, and another, ‘I am Apollos’s’, are you not carnal?"},{"num":5,"verse":"Who is Paul then? And who is Apollos, but the ministers, by whom you believed, and as the Lord gave to every man?"},{"num":6,"verse":"I have planted, Apollos watered. But God gave the increase."},{"num":7,"verse":"So then, neither is he who plants anything, nor he who waters. But God gives the increase."},{"num":8,"verse":"And he who plants, and he who waters, are one. And everyone shall receive his wages, according to his labor."},{"num":9,"verse":"For we together are God’s laborers. You are God’s fellow workers, and God’s building."},{"num":10,"verse":"According to the grace of God given to me, as a skillful master builder, I have laid the foundation. And another builds on that.  But, let everyone take heed how he builds upon it."},{"num":11,"verse":"For no one can lay a foundation other than that which is laid; which is Jesus Christ."},{"num":12,"verse":"And if anyone builds gold, silver, precious stones, timber, hay, or stubble upon this foundation,"},{"num":13,"verse":"everyone’s work shall be made apparent. For the Day shall declare it, because it shall be revealed by the fire. And the fire shall test everyone’s work, of what sort it is."},{"num":14,"verse":"If anyone’s work that he has built upon abides, he shall receive wages."},{"num":15,"verse":"If anyone’s work burns, he shall suffer loss. But he himself shall be saved, although still, as it were, by fire."},{"num":16,"verse":"Do you not know that you are the Temple of God, and that the Spirit of God dwells in you?"},{"num":17,"verse":"If anyone destroys the Temple of God, God shall destroy him. For the Temple of God is holy, which you are."},{"num":18,"verse":"Let no one deceive himself. If anyone among you seems to be wise in this world, let him be a fool, that he may be wise."},{"num":19,"verse":"For the wisdom of this world is foolishness with God. For it is written, ‘He catches the wise in their own craftiness’."},{"num":20,"verse":"And again, ‘The Lord knows that the thoughts of the wise are useless’."},{"num":21,"verse":"Therefore, let no one boast in man. For all things are yours,"},{"num":22,"verse":"whether it be Paul, or Apollos, or Cephas, or the world, or life, or death - whether things present, or things to come - all are yours,"},{"num":23,"verse":"and you Christ’s, and Christ God’s."}]