[{"num":3,"verse":"Dear brothers, I have been talking to you as though you were still just babies in the Christian life who are not following the Lord but your own desires; I cannot talk to you as I would to healthy Christians who are filled with the Spirit. "},{"num":2,"verse":"I have had to feed you with milk and not with solid food because you couldn’t digest anything stronger. And even now you still have to be fed on milk. "},{"num":3,"verse":"For you are still only baby Christians, controlled by your own desires, not God’s. When you are jealous of one another and divide up into quarreling groups, doesn’t that prove you are still babies, wanting your own way? In fact, you are acting like people who don’t belong to the Lord at all. "},{"num":4,"verse":"There you are, quarreling about whether I am greater than Apollos, and dividing the church. Doesn’t this show how little you have grown in the Lord?"},{"num":5,"verse":"Who am I, and who is Apollos, that we should be the cause of a quarrel? Why, we’re just God’s servants, each of us with certain special abilities, and with our help you believed. "},{"num":6,"verse":"My work was to plant the seed in your hearts, and Apollos’ work was to water it, but it was God, not we, who made the garden grow in your hearts. "},{"num":7,"verse":"The person who does the planting or watering isn’t very important, but God is important because he is the one who makes things grow. "},{"num":8,"verse":"Apollos and I are working as a team, with the same aim, though each of us will be rewarded for his own hard work. "},{"num":9,"verse":"We are only God’s coworkers. You are God’s garden, not ours; you are God’s building, not ours."},{"num":10,"verse":"God, in his kindness, has taught me how to be an expert builder. I have laid the foundation and Apollos has built on it. But he who builds on the foundation must be very careful. "},{"num":11,"verse":"And no one can ever lay any other real foundation than that one we already have—Jesus Christ. "},{"num":12,"verse":"But there are various kinds of materials that can be used to build on that foundation. Some use gold and silver and jewels; and some build with sticks and hay or even straw! "},{"num":13,"verse":"There is going to come a time of testing at Christ’s Judgment Day to see what kind of material each builder has used. Everyone’s work will be put through the fire so that all can see whether or not it keeps its value, and what was really accomplished. "},{"num":14,"verse":"Then every workman who has built on the foundation with the right materials, and whose work still stands, will get his pay. "},{"num":15,"verse":"But if the house he has built burns up, he will have a great loss. He himself will be saved, but like a man escaping through a wall of flames."},{"num":16,"verse":"Don’t you realize that all of you together are the house of God, and that the Spirit of God lives among you in his house? "},{"num":17,"verse":"If anyone defiles and spoils God’s home, God will destroy him. For God’s home is holy and clean, and you are that home."},{"num":18,"verse":"Stop fooling yourselves. If you count yourself above average in intelligence, as judged by this world’s standards, you had better put this all aside and be a fool rather than let it hold you back from the true wisdom from above. "},{"num":19,"verse":"For the wisdom of this world is foolishness to God. As it says in the book of Job, God uses man’s own brilliance to trap him; he stumbles over his own “wisdom” and falls. "},{"num":20,"verse":"And again, in the book of Psalms, we are told that the Lord knows full well how the human mind reasons and how foolish and futile it is."},{"num":21,"verse":"So don’t be proud of following the wise men of this world. For God has already given you everything you need. "},{"num":22,"verse":"He has given you Paul and Apollos and Peter as your helpers. He has given you the whole world to use, and life and even death are your servants. He has given you all of the present and all of the future. All are yours, "},{"num":23,"verse":"and you belong to Christ, and Christ is God’s."}]