[{"header":"Elihu Keeps On Speaking"},{"num":33,"verse":"“But now, Job, hear what I say. Listen to all my words. "},{"num":2,"verse":"See, I open my mouth. My tongue in my mouth wants to speak. "},{"num":3,"verse":"My words come from my heart that is right. My lips speak in truth what I know. "},{"num":4,"verse":"The Spirit of God has made me. And the breath of the All-powerful gives me life. "},{"num":5,"verse":"Prove me wrong if you can. Get ready to answer me, and take your stand. "},{"num":6,"verse":"See, I belong to God like you. I also have been made from the clay. "},{"num":7,"verse":"See, you have no reason to be afraid of me. I should not make it hard for you."},{"num":8,"verse":"“For sure you have spoken in my hearing. I have heard all you have said. "},{"num":9,"verse":"You said, ‘I am pure and without sin. I am not guilty, and there is no sin in me. "},{"num":10,"verse":"But see, God finds things against me. He thinks of me as someone who hates Him. "},{"num":11,"verse":"He puts my feet in chains, and watches all my paths.’ "},{"num":12,"verse":"See, I tell you, in this you are not right. For God is greater than man."},{"num":13,"verse":"“Why do you complain against Him? He does not give a reason for all He does. "},{"num":14,"verse":"For God speaks once, or twice, and yet no one listens. "},{"num":15,"verse":"In a dream, a special dream of the night, when deep sleep comes upon men, while they sleep in their beds, "},{"num":16,"verse":"then He opens the ears of men. He teaches them and makes them afraid telling them of danger, "},{"num":17,"verse":"that He may turn man away from wrong-doing and keep him from pride. "},{"num":18,"verse":"He keeps his soul from going to the place of the dead. And He keeps his life from being destroyed by the sword."},{"num":19,"verse":"“Man is also punished with pain on his bed and has pain all the time in his bones. "},{"num":20,"verse":"So he hates bread, and has no desire for fine foods. "},{"num":21,"verse":"His flesh is so wasted away that it cannot be seen. His bones which were not seen stick out. "},{"num":22,"verse":"His soul comes close to the grave, and his life to those who bring death."},{"num":23,"verse":"“If there is an angel, one out of a thousand, to speak with God for him, and to show a man what is right for him, "},{"num":24,"verse":"then let him be kind to him, and say, ‘Save him from going down to the grave. I have found someone to pay the price to make him free. "},{"num":25,"verse":"Let his flesh become young again. Let him return to the days when he was young and strong.’ "},{"num":26,"verse":"Then he will pray to God, and God will be pleased with him. He will see His face with joy. And God will make man right with Him again. "},{"num":27,"verse":"He will sing to men and say, ‘I have sinned and have not done what is right, but He did not punish me. "},{"num":28,"verse":"He has kept my soul from going to the grave. And my life will see the light.’"},{"num":29,"verse":"“See, God does all these things twice, even three times, to a man, "},{"num":30,"verse":"to turn back his soul from the grave, that he may see the light of life. "},{"num":31,"verse":"Hear what I say, O Job, listen to me. Be quiet and let me speak. "},{"num":32,"verse":"If you have anything to say, answer me. Speak, for I want to make you right with God. "},{"num":33,"verse":"If not, listen to me. Be quiet, and I will teach you wisdom.”"}]