[[],[{"type":"prose","content":"And yet, I pray thee, O Job, Hear my speech and [to] all my words give ear."}],[{"type":"prose","content":"Lo, I pray thee, I have opened my mouth, My tongue hath spoken in the palate."}],[{"type":"prose","content":"Of the uprightness of my heart [are] my sayings, And knowledge have my lips clearly spoken."}],[{"type":"prose","content":"The Spirit of God hath made me, And the breath of the Mighty doth quicken me."}],[{"type":"prose","content":"If thou art able -- answer me, Set in array before me -- station thyself."}],[{"type":"prose","content":"Lo, I [am], according to thy word, for God, From the clay I -- I also, have been formed."}],[{"type":"prose","content":"Lo, my terror doth not frighten thee, And my burden on thee is not heavy."}],[{"type":"prose","content":"Surely -- thou hast said in mine ears, And the sounds of words I hear:"}],[{"type":"prose","content":"`Pure [am] I, without transgression, Innocent [am] I, and I have no iniquity."}],[{"type":"prose","content":"Lo, occasions against me He doth find, He doth reckon me for an enemy to Him,"}],[{"type":"prose","content":"He doth put in the stocks my feet, He doth watch all my paths.'"}],[{"type":"prose","content":"Lo, [in] this thou hast not been righteous, I answer thee, that greater is God than man."}],[{"type":"prose","content":"Wherefore against Him hast thou striven, When [for] all His matters He answereth not?"}],[{"type":"prose","content":"For once doth God speak, and twice, (He doth not behold it.)"}],[{"type":"prose","content":"In a dream -- a vision of night, In the falling of deep sleep on men, In slumberings on a bed."}],[{"type":"prose","content":"Then He uncovereth the ear of men, And for their instruction sealeth:"}],[{"type":"prose","content":"To turn aside man [from] doing, And pride from man He concealeth."}],[{"type":"prose","content":"He keepeth back his soul from corruption, And his life from passing away by a dart."}],[{"type":"prose","content":"And he hath been reproved With pain on his bed, And the strife of his bones [is] enduring."}],[{"type":"prose","content":"And his life hath nauseated bread, And his soul desirable food."}],[{"type":"prose","content":"His flesh is consumed from being seen, And high are his bones, they were not seen!"}],[{"type":"prose","content":"And draw near to the pit doth his soul, And his life to those causing death."}],[{"type":"prose","content":"If there is by him a messenger, An interpreter -- one of a thousand, To declare for man his uprightness:"}],[{"type":"prose","content":"Then He doth favour him and saith, `Ransom him from going down to the pit, I have found an atonement.'"}],[{"type":"prose","content":"Fresher [is] his flesh than a child's, He returneth to the days of his youth."}],[{"type":"prose","content":"He maketh supplication unto God, And He accepteth him. And he seeth His face with shouting, And He returneth to man His righteousness."}],[{"type":"prose","content":"He looketh on men, and saith, `I sinned, And uprightness I have perverted, And it hath not been profitable to me."}],[{"type":"prose","content":"He hath ransomed my soul From going over into the pit, And my life on the light looketh.'"}],[{"type":"prose","content":"Lo, all these doth God work, Twice -- thrice with man,"}],[{"type":"prose","content":"To bring back his soul from the pit, To be enlightened with the light of the living."}],[{"type":"prose","content":"Attend, O Job, hearken to me, Keep silent, and I -- I do speak."}],[{"type":"prose","content":"If there are words -- answer me, Speak, for I have a desire to justify thee."}],[{"type":"prose","content":"If there are not -- hearken thou to me, Keep silent, and I teach thee wisdom."}]]