[{"num":11,"verse":"A guileful balance is abomination with God; and an even weight is his will. (A deceitful scale is an abomination to God; and equal, or honest, weights be his desire.)"},{"num":2,"verse":"Where pride is, there also despising shall be; but where meekness is, there also is wisdom. (Where there is pride, there shall also be despising; but where there is humility, there is also wisdom.)"},{"num":3,"verse":"The simpleness of just men shall (ad)dress them; and the deceiving of wayward men shall destroy them. (The honesty, or the integrity, of the righteous shall direct them; and the deceptions of the wayward shall destroy them.)"},{"num":4,"verse":"Riches shall not profit in the day of vengeance; but rightfulness shall deliver from death. (Riches shall not profit anyone on the day of vengeance; but uprightness shall deliver one from death.)"},{"num":5,"verse":"The rightfulness of a simple man shall (ad)dress his way; and a wicked man shall fall in his wickedness. (The uprightness of an honest person shall direct his way; and a wicked person shall fall because of his wickedness.)"},{"num":6,"verse":"The rightfulness of rightful men shall deliver them; and wicked men shall be taken in their ambushings. (The uprightness of the righteous shall save them; but the wicked shall be caught in their own ambushings.)"},{"num":7,"verse":"When a wicked man is dead, none hope shall be further of him; and [the] abiding of busy men in evil shall perish. (When the wicked die, they shall have no further hope; and the abundance, or the wealth, of those busy with evil shall perish.)"},{"num":8,"verse":"A just man is delivered from anguish; and a wicked man shall be given for him. (The righteous person is delivered from all his anguish; and it is given to a wicked person instead.)"},{"num":9,"verse":"A feigner by mouth deceiveth his friend; but just men shall be delivered by knowing. (A faker, or a hypocrite, deceiveth his friend with his mouth; but the righteous rescue others with their wisdom.)"},{"num":10,"verse":"A city shall be enhanced in the goods of just men; and praising shall be in the perdition of wicked men. (A city shall rejoice for the prosperity of the righteous; and praising shall be in the perdition, or in the perishing, of the wicked.)"},{"num":11,"verse":"A city shall be enhanced by [the] blessing of just men; and it shall be destroyed by the mouth of wicked men. (A city shall be enhanced by the blessing of the righteous; and it shall be destroyed by the words of the wicked.)"},{"num":12,"verse":"He that despiseth his friend, is needy in heart; but a prudent man shall be still. (He who despiseth his friend is foolish; but a man of understanding shall be silent.)"},{"num":13,"verse":"He that goeth guilefully, showeth privates (He who goeth deceitfully, telleth secrets); but he that is faithful, covereth the private (matter) of a friend."},{"num":14,"verse":"Where a governor is not, the people shall fall; but health is, where be many counsels. (Without a leader, or good governance, the people shall fall; but there is victory/but there is salvation, or deliverance, where there be many counsellors, or much planning, or good advice.)"},{"num":15,"verse":"He that maketh faith, that is, (an) obligation, for a stranger, shall be tormented with evil; but he that escheweth snares, shall be secure."},{"num":16,"verse":"A gracious woman shall find glory (A gracious woman shall receive honour); and strong men shall have riches."},{"num":17,"verse":"A merciful man doeth well to his soul (A merciful person doeth good to his own soul); but he that is cruel, casteth away, yea, (even his own) kinsmen."},{"num":18,"verse":"A wicked man maketh unstable work; but faithful meed is to him, that soweth rightfulness. (There is no surety with the work of the wicked; but there is a sure reward for those who sow goodness.)"},{"num":19,"verse":"Mercy shall make ready life; and the following of evil, death. (Mercy bringeth forth life; but death followeth after evil.)"},{"num":20,"verse":"A shrewd heart is abominable to the Lord; and his will is in them, that go simply. (A depraved heart is abominable to the Lord; but his delight is in those who do things honestly, or with integrity.)"},{"num":21,"verse":"Though hand be in hand, an evil man shall not be innocent; but the seed of just men shall be saved. (Be assured, that the evil shall be punished; but the children, or the descendants, of the righteous shall be saved.)"},{"num":22,"verse":"A golden ring in the nostrils of a sow, (is like) a woman fair and fool. (A gold ring in the nostrils of a pig, is like a woman who is comely, but foolish.)"},{"num":23,"verse":"The desire of just men is all good; (but the) abiding of wicked men is strong vengeance. (The desire of the righteous is only for good; but the longing of the wicked is for strong vengeance.)"},{"num":24,"verse":"Some men part their own things, and be made richer; other men ravish things, that be not theirs, and they be ever in neediness. (Some people share their own things, and grow richer; other people steal things, that be not theirs, and still they always be in need.)"},{"num":25,"verse":"A soul that blesseth, shall be made fat; and he that filleth, shall be filled also. (A person who blesseth, or who shareth, shall be made prosperous; and he who filleth, shall also be filled.)"},{"num":26,"verse":"He that hideth wheat, shall be cursed among the peoples; but blessing shall come [up]on the head(s) of sellers. (He who hideth corn, shall be cursed by the people; but blessing, or praise, shall come to the sellers.)"},{"num":27,"verse":"Well (be) he (who) riseth early, that seeketh good things; but he that is a searcher of evils, shall be oppressed of those. (He who riseth early, to seek out the good, shall find favour; but he who searcheth out evils, shall be oppressed by them.)"},{"num":28,"verse":"He that trusteth in his riches, shall fall; but just men shall burgeon as a green leaf (but the righteous shall flourish like the green leaves)."},{"num":29,"verse":"He that troubleth his house, shall have (the) winds in possession; and he that is a fool, shall serve a wise man."},{"num":30,"verse":"The fruit of a rightful man is the tree of life; and he that taketh souls, is a wise man. (The fruit of righteousness is the tree of life; and he who winneth souls, is wise.)"},{"num":31,"verse":"If a just man receiveth in [the] earth, how much more an unfaithful man, and a sinner. (If the righteous receive recompense here on earth, how much more shall the unfaithful, and the sinners!)"}]