[{"num":6,"verse":"And Jehovah spoke to Moses, saying,"},{"num":2,"verse":"If any one sin and act unfaithfully against Jehovah, and lie to his neighbour as to an entrusted thing or a deposit or [that in which] he hath robbed or wronged his neighbour,"},{"num":3,"verse":"or have found what was lost, and denieth it, and sweareth falsely in anything of all that man doeth, sinning therein;"},{"num":4,"verse":"then it shall be, if he hath sinned and transgressed, that he shall restore what he robbed or that in which he hath defrauded, or the deposit, or the lost thing which he found,"},{"num":5,"verse":"or all that about which he hath sworn falsely; and he shall restore it in the principal, and shall add the fifth part more thereto; to [him to] whom it belongeth shall he give it, on the day of his trespass-offering."},{"num":6,"verse":"And his trespass-offering shall he bring to Jehovah, a ram without blemish out of the small cattle according to thy valuation, as a trespass-offering, unto the priest."},{"num":7,"verse":"And the priest shall make atonement for him before Jehovah, and it shall be forgiven him concerning anything of all that he hath done so as to trespass therein."},{"num":8,"verse":"And Jehovah spoke to Moses, saying,"},{"num":9,"verse":"Command Aaron and his sons, saying, This is the law of the burnt-offering; this, the burnt-offering, shall be on the hearth on the altar all night unto the morning, and the fire of the altar shall be kept burning on it."},{"num":10,"verse":"And the priest shall put on his linen raiment, and his linen breeches shall he put on his flesh, and take up the ashes to which the fire hath consumed the burnt-offering on the altar, and he shall put them beside the altar."},{"num":11,"verse":"And he shall put off his garments, and put on other garments, and carry forth the ashes without the camp unto a clean place."},{"num":12,"verse":"And the fire upon the altar shall be kept burning on it: it shall not be put out; and the priest shall burn wood on it every morning, and lay the burnt-offering in order upon it; and he shall burn thereon the fat of the peace-offerings."},{"num":13,"verse":"A continual fire shall be kept burning on the altar: it shall never go out."},{"num":14,"verse":"And this is the law of the oblation: [one of] the sons of Aaron shall present it before Jehovah, before the altar."},{"num":15,"verse":"And he shall take of it his handful of the fine flour of the oblation, and of the oil thereof, and all the frankincense which is on the meat-offering, and shall burn [it] on the altar: [it is] a sweet odour of the memorial thereof to Jehovah."},{"num":16,"verse":"And the remainder thereof shall Aaron and his sons eat: unleavened shall it be eaten in a holy place; in the court of the tent of meeting shall they eat it."},{"num":17,"verse":"It shall not be baken with leaven. As their portion have I given it [unto them] of my offerings by fire: it is most holy; as the sin-offering, and as the trespass-offering."},{"num":18,"verse":"All the males among the children of Aaron shall eat of it. [It is] an everlasting statute in your generations, [their portion] of Jehovah's offerings by fire: whatever toucheth these shall be holy."},{"num":19,"verse":"And Jehovah spoke to Moses, saying,"},{"num":20,"verse":"This is the offering of Aaron and of his sons, which they shall present to Jehovah on the day when he is anointed: the tenth part of an ephah of fine flour as a continual oblation, half of it in the morning, and half thereof at night."},{"num":21,"verse":"It shall be prepared in the pan with oil: saturated with oil shalt thou bring it: baken pieces of the oblation shalt thou present [for] a sweet odour to Jehovah."},{"num":22,"verse":"And the priest who is anointed of his sons in his stead shall prepare it: [it is] an everlasting statute; it shall be wholly burned to Jehovah."},{"num":23,"verse":"And every oblation of the priest shall be wholly burned; it shall not be eaten."},{"num":24,"verse":"And Jehovah spoke to Moses, saying,"},{"num":25,"verse":"Speak unto Aaron and to his sons, saying, This is the law of the sin-offering. At the place where the burnt-offering is slaughtered shall the sin-offering be slaughtered before Jehovah: it is most holy."},{"num":26,"verse":"The priest that offereth it for sin shall eat it: in a holy place shall it be eaten, in the court of the tent of meeting."},{"num":27,"verse":"Everything that toucheth the flesh thereof shall be holy; and if there be splashed of the blood thereof on a garment—that whereon it is sprinkled shalt thou wash in a holy place."},{"num":28,"verse":"And the earthen vessel wherein it hath been sodden shall be broken; and if it have been sodden in a copper pot, it shall be both scoured and rinsed with water."},{"num":29,"verse":"All the males among the priests shall eat thereof: it is most holy."},{"num":30,"verse":"And no sin-offering whereof blood hath been brought to the tent of meeting, to make atonement in the sanctuary, shall be eaten: it shall be burned with fire."}]