[{"num":6,"verse":"And the Lord spake to Moses, and said,"},{"num":2,"verse":"A soul, that is, a man, that sinneth, and despiseth the Lord, and denieth to his neighbour a thing betaken to his keeping, that was betaken to his faith, either taketh masterfully a thing by violence, either maketh false challenge, (Anyone who sinneth, and despiseth the Lord, and denieth to his neighbour that a thing was given to his keeping, that was given to him in faith, or who taketh a thing by violence, or who maketh false challenge,)"},{"num":3,"verse":"either findeth a thing lost, and denieth it furthermore, and forsweareth, and doeth any other thing of many, in which things men be wont to do sin, (or who findeth a lost thing, but denieth it forevermore, and forsweareth, or who doeth any other thing of many things, in which people be wont to sin,)"},{"num":4,"verse":"if it is convicted of the guilt, he shall yield whole all things which he would get by fraud, (if he is convicted, and found guilty, he shall give back whole everything which he hath gotten by fraud,)"},{"num":5,"verse":"and furthermore (add) the fifth part to the lord, to whom he did [the] harm. (and furthermore add a fifth part to it, for the person to whom he did the harm.)"},{"num":6,"verse":"Soothly for his sin he shall offer a ram unwemmed of the flock (And for his trespass offering, he shall offer a ram without blemish of the flock), and he shall give that ram to the priest, by the value and the measure of the trespass;"},{"num":7,"verse":"and the priest shall pray for him before the Lord, and it shall be forgiven to him, for all (the) things (in) which he sinned in doing."},{"num":8,"verse":"And the Lord spake to Moses, and said,"},{"num":9,"verse":"Command thou to Aaron, and to his sons, This is the law of burnt sacrifice; it shall be burnt in the altar all night till the morrow; fire that is given from heaven shall be of the same altar. (Command thou to Aaron, and to his sons, and say, This is the law for the burnt sacrifice; it shall be burned on the altar all night until the morning; and the fire on the altar shall be kept burning there.)"},{"num":10,"verse":"The priest shall be clothed with a coat, and with linen breeches; and he shall take away the ashes, which the fire devouring hath burnt out, and he shall put those beside the altar; (The priest shall be clothed with a linen robe, and with linen breeches; and he shall take away the ashes, which the devouring fire hath burned out, and he shall put them beside the altar;)"},{"num":11,"verse":"and he shall be spoiled of the former clothes, and he shall be clothed with other (clothes), and he shall bear those ashes out of the tents, and in a most clean place he shall make them to be wasted, or quenched, till to a dead spark. (and then he shall take off those clothes, and he shall be clothed with other clothes, and he shall carry those ashes away from the tents, to a most clean place.)"},{"num":12,"verse":"Forsooth [the] fire shall burn ever[more] in the altar, which fire the priest shall nourish, putting wood under (it), in the morrowtide by each day; and when [the] burnt sacrifice is put above, the priest shall burn the inner fatness of peaceable things. (And the fire shall burn forevermore on the altar, which fire the priest shall nourish, putting wood under it, each day in the morning; and when the burnt sacrifice is put on it, then the priest shall burn the inner fat of the peace offering on top of it.)"},{"num":13,"verse":"This is everlasting fire, that shall never fail in the altar. (This is everlasting fire on the altar, that shall never go out.)"},{"num":14,"verse":"This is the law of sacrifice, and of the flowing offerings, which the sons of Aaron shall offer before the Lord, and before the altar. (And this is the law for the grain offering, which the priests, the sons of Aaron, shall offer before the Lord, in front of the altar.)"},{"num":15,"verse":"The priest shall take an handful of tried wheat flour, which is sprinkled with oil, and all the incense which is put on the flour, and he shall burn it on the altar, into mind of sweetest odour of the Lord. (The priest shall take a handful of fine wheat flour, which is sprinkled with oil, and all the frankincense which is put on it, and he shall burn this token of the offering on the altar, to make the sweetest aroma to the Lord.)"},{"num":16,"verse":"Forsooth Aaron with his sons shall eat the tother part of [the] tried wheat flour, without sourdough; and he shall eat this in the holy place of the great porch of the tabernacle. (And Aaron and his sons shall eat the rest of the fine wheat flour as bread made without yeast; and they shall eat this in a holy place, the courtyard of the Tabernacle.)"},{"num":17,"verse":"Soothly therefore it shall not be dighted with sourdough, for a part thereof is offered into incense of the Lord; it shall be holy of holy things, as (the) offering(s) for sin and (for) trespass. (And so it shall not be prepared with yeast, for a part of it is offered as incense to the Lord; it shall be a most holy, or sacred, thing, like the sin offering, and the trespass offering.)"},{"num":18,"verse":"Males only of the kindred of Aaron shall eat it; it is a lawful thing and everlasting in your generations, of the sacrifice of the Lord; each man that toucheth them shall be hallowed. (Only males of Aaron’s family shall eat it; this is an everlasting law for all your generations, for the sacrifices to the Lord; anyone else who toucheth them shall be harmed by their holiness.)"},{"num":19,"verse":"And the Lord spake to Moses, and said,"},{"num":20,"verse":"This is the offering of Aaron, and of his sons, which they ought (to) offer to the Lord, (each) in the day of his anointing; they shall offer the tenth part of ephah of [tried] wheat flour, into everlasting sacrifice, the half thereof in the morrowtide, and the half thereof in the eventide; (This is the offering from Aaron, and his sons, which they ought to offer to the Lord, on the day of their installation, or their ordination; they shall offer the tenth part of an ephah of fine wheat flour, for a consecration offering, half of it in the morning, and half of it in the evening;)"},{"num":21,"verse":"which shall be sprinkled with oil in a frying pan, and (then) it shall be fried."},{"num":22,"verse":"Soothly the priest which is successor to his father, shall offer it hot, into [the] sweetest odour to the Lord; and all it shall be burnt in the altar. (And the priest who is the successor to his father as the High Priest, shall likewise offer it, to make the sweetest aroma to the Lord; and all of it shall be burned on the altar.)"},{"num":23,"verse":"For all the sacrifice of priests shall be burnt with fire, neither any man shall eat thereof. (For all of the grain offering of a priest shall be burned with fire, no one shall eat any of it.)"},{"num":24,"verse":"And the Lord spake to Moses, and said,"},{"num":25,"verse":"Speak thou to Aaron and to his sons, This is the law of sacrifice for sin; it shall be offered before the Lord, in the place where burnt sacrifice is offered; it is holy of holy things. (Say thou to Aaron and his sons, This is the law for the sin offering; it shall be offered before the Lord, in the place where the burnt sacrifice is offered; it is a most holy, or sacred, thing.)"},{"num":26,"verse":"The priest that offereth it, shall eat it in the holy place, in the great porch of the tabernacle (in the courtyard of the Tabernacle)."},{"num":27,"verse":"Whatever thing shall touch the flesh thereof, shall be hallowed (shall be harmed by its holiness); if a cloak is besprinkled with the blood thereof, it shall be washed in the holy place."},{"num":28,"verse":"Soothly the earthen vessel, in which it is sodden, shall be broken; that if the vessel is of brass, it shall be scoured, and washed with water. (Any clay vessel in which it is boiled, shall be broken; but if the vessel is bronze, or is copper, it shall be scoured, and washed in water.)"},{"num":29,"verse":"Each male of the priests’ kin shall eat of the flesh thereof; for it is holy of holy things (for it is a most holy thing)."},{"num":30,"verse":"Soothly the sacrifice which is slain for sin, whose blood is borne into the tabernacle of witnessing to cleanse in the saintuary (whose blood is brought into the Tabernacle of the Witnessing, for the cleansing rite in the sanctuary), shall not be eaten, but it shall be burnt in (the) fire."}]