[{"num":65,"verse":"1 A praise and thanksgiving unto God by the faithful, who are signified by Zion, 4 For the choosing, preservation, and governance of them, 9 And for the plentiful blessings poured forth upon all the earth, but especially toward his Church."},{"num":1,"verse":"O God, praise waiteth for thee in Zion, and unto thee shall the vow be performed."},{"num":2,"verse":"Because thou hearest the prayer, unto thee shall all flesh come."},{"num":3,"verse":"Wicked deeds have prevailed against me: but thou wilt be merciful unto our transgressions."},{"num":4,"verse":"Blessed is he, whom thou choosest and causest to come to thee: he shall dwell in thy courts, and we shall be satisfied with the pleasures of thine House, even of thine holy Temple."},{"num":5,"verse":"O God of our salvation, thou wilt answer us with fearful signs in thy righteousness, O thou the hope of all the ends of the earth, and of them that are far off in the Sea."},{"num":6,"verse":"He establisheth the mountains by his power: and is girded about with strength."},{"num":7,"verse":"He appeaseth the noise of the seas, and the noise of the waves thereof, and the tumults of the people."},{"num":8,"verse":"They also that dwell in the uttermost parts of the earth, shall be afraid of thy signs; thou shalt make the East and the West to rejoice."},{"num":9,"verse":"Thou visitest the earth, and waterest it; thou makest it very rich: the river of God is full of water, thou preparest them corn; for so thou appointest it."},{"num":10,"verse":"Thou waterest abundantly the furrows thereof; thou causest the rain to descend into the valleys thereof; thou makest it soft with showers, and blessest the bud thereof."},{"num":11,"verse":"Thou crownest the year with thy goodness, and thy steps drop fatness."},{"num":12,"verse":"They drop upon the pastures of the wilderness: and the hills shall be compassed with gladness."},{"num":13,"verse":"The pastures are clad with sheep; the valleys also shall be covered with corn; therefore they shout for joy, and sing."}]