[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Unto the house of Micah.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Probably the precincts of the new sanctuary gave their name to a sort of village—Beth-Micah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:7-13 Micah thought it was a sign of God's favour to him and his images, that a Levite should come to his door. Thus those who please themselves with their own delusions, if Providence unexpectedly bring any thing to their hands that further them in their evil way, are apt from thence to think that God is pleased with them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Kurjath-jearim - \"City of forests,\" otherwise called \"Kirjath-Baal\" (marginal reference.), identified by Robinson with the modern \"Kurit-el-Enab,\" on the road from Jaffa to Jerusalem and by Conder with Soba. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11-21. there went from thence of the family of the Danites … six hundred men—This was the collective number of the men who were equipped with arms to carry out this expeditionary enterprise, without including the families and furniture of the emigrants (Jud 18:21). Their journey led them through the territory of Judah, and their first halting place was \"behind,\" that is, on the west of Kirjath-jearim, on a spot called afterwards \"the camp of Dan.\" Prosecuting the northern route, they skirted the base of the Ephraimite hills. On approaching the neighborhood of Micah's residence, the spies having given information that a private sanctuary was kept there, the priest of which had rendered them important service when on their exploring expedition, it was unanimously agreed that both he and the furniture of the establishment would be a valuable acquisition to their proposed settlement. A plan of spoliation was immediately formed. While the armed men stood sentinels at the gates, the five spies broke into the chapel, pillaged the images and vestments, and succeeded in bribing the priest also by a tempting offer to transfer his services to their new colony. Taking charge of the ephod, the teraphim, and the graven image, he \"went in the midst of the people\"—a central position assigned him in the march, perhaps for his personal security; but more probably in imitation of the place appointed for the priests and the ark, in the middle of the congregated tribes, on the marches through the wilderness. This theft presents a curious medley of low morality and strong religious feeling. The Danites exemplified a deep-seated principle of our nature—that men have religious affections, which must have an object on which these may be exercised, while they are often not very discriminating in the choice of the objects. In proportion to the slender influence religion wields over the heart, the greater is the importance attached to external rites; and in the exact observance of these, the conscience is fully satisfied, and seldom or never molested by reflections on the breach of minor morals.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " i.e. To the town in which his house was, for they were not yet entered into it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they passed thence unto Mount Ephraim,.... Steering their coast still northward; this, according to Bunting (b), was eight miles from Kirjathjearim, or Mahanehdan, in which Micah's house was, for as yet they were not come to it, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Ibid. (Travels of the Patriarchs, &c. p. 112.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) Ibid. (Travels of the Patriarchs, &c. p. 112.) ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they passed thence unto mount Ephraim, and came unto the house of Micah.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "From this point they went across to the mountains of Ephraim, and came to Micah's house, i.e., to a place near it. ",
        "children": []
      }
    ]
  }
]