[{"header":"Serve Others with Joy"},{"num":1,"verse":"From Paul and Timothy, servants of Jesus Christ."},{"num":2,"verse":"Grace and peace to you from God our Father and the Lord Jesus Christ."},{"header":"Paul’s Prayer"},{"num":3,"verse":"I thank God every time I remember you. "},{"num":4,"verse":"And I always pray for all of you with joy. "},{"num":5,"verse":"I thank God for the help you gave me while I preached the Good News. You helped from the first day you believed until now. "},{"num":6,"verse":"God began doing a good work in you. And he will continue it until it is finished when Jesus Christ comes again. I am sure of that."},{"num":7,"verse":"And I know that I am right to think like this about all of you. I am sure because I have you in my heart. All of you share in God’s grace with me. You share in God’s grace with me while I am in prison, while I am defending the Good News, and while I am proving the truth of the Good News. "},{"num":8,"verse":"God knows that I want to see you very much. I love all of you with the love of Christ Jesus."},{"num":9,"verse":"This is my prayer for you: that your love will grow more and more; that you will have knowledge and understanding with your love; "},{"num":10,"verse":"that you will see the difference between good and bad and choose the good; that you will be pure and without wrong for the coming of Christ; "},{"num":11,"verse":"that you will be filled with the good things produced in your life by Christ to bring glory and praise to God."},{"header":"Paul’s Troubles Help the Work"},{"num":12,"verse":"Brothers, I want you to know that what has happened to me has helped to spread the Good News. "},{"num":13,"verse":"I am in prison because I am a believer in Christ. All the palace guards and everyone else knows this. "},{"num":14,"verse":"I am still in prison, but most of the believers feel better about it now. And so they are much braver about telling the Good News about Christ."},{"num":15,"verse":"It is true that some preach about Christ because they are jealous and bitter. But others preach about Christ because they want to help. "},{"num":16,"verse":"They preach because they have love, and they know that God gave me the work of defending the Good News. "},{"num":17,"verse":"But others preach about Christ because they are selfish. Their reason for preaching is wrong. They want to make trouble for me in prison."},{"num":18,"verse":"But I do not care if they make trouble for me. The important thing is that they are preaching about Christ. They should do it for the right reasons. But I am happy even if they do it for wrong reasons. And I will continue to be happy. "},{"num":19,"verse":"You are praying for me, and the Spirit of Jesus Christ helps me. So I know that this trouble will bring my freedom. "},{"num":20,"verse":"The thing I want and hope for is that I will not fail Christ in anything. I hope that I will have the courage now, as always, to show the greatness of Christ in my life here on earth. I want to do that if I die or if I live. "},{"num":21,"verse":"To me the only important thing about living is Christ. And even death would be profit for me. "},{"num":22,"verse":"If I continue living in the body, I will be able to work for the Lord. But what should I choose—living or dying? I do not know. "},{"num":23,"verse":"It is hard to choose between the two. I want to leave this life and be with Christ. That is much better. "},{"num":24,"verse":"But you need me here in my body. "},{"num":25,"verse":"I know that you need me, and so I know that I will stay with you. I will help you grow and have joy in your faith. "},{"num":26,"verse":"You will be very happy in Christ Jesus when I am with you again."},{"num":27,"verse":"Be sure that you live in a way that brings honor to the Good News of Christ. Then whether I come and visit you or am away from you, I will hear good things about you. I will hear that you continue strong with one purpose and that you work together as a team for the faith of the Good News. "},{"num":28,"verse":"And you will not be afraid of those who are against you. All of these things are proof from God that you will be saved and that your enemies will be lost. "},{"num":29,"verse":"God gave you the honor both of believing in Christ and suffering for Christ. Both these things bring glory to Christ. "},{"num":30,"verse":"When I was with you, you saw the struggles I had. And you hear about the struggles I am having now. You yourselves are having the same kind of struggles."}]