[{"header":"Chapter 1"},{"num":1,"verse":"Greeting. Paul and Timothy, slaves of Christ Jesus, to all the holy ones in Christ Jesus who are in Philippi, with the overseers and ministers: "},{"num":2,"verse":"grace to you and peace from God our Father and the Lord Jesus Christ."},{"num":3,"verse":"I give thanks to my God at every remembrance of you, "},{"num":4,"verse":"praying always with joy in my every prayer for all of you, "},{"num":5,"verse":"because of your partnership for the gospel from the first day until now. "},{"num":6,"verse":"I am confident of this, that the one who began a good work in you will continue to complete it until the day of Christ Jesus. "},{"num":7,"verse":"It is right that I should think this way about all of you, because I hold you in my heart, you who are all partners with me in grace, both in my imprisonment and in the defense and confirmation of the gospel. "},{"num":8,"verse":"For God is my witness, how I long for all of you with the affection of Christ Jesus. "},{"num":9,"verse":"And this is my prayer: that your love may increase ever more and more in knowledge and every kind of perception, "},{"num":10,"verse":"to discern what is of value, so that you may be pure and blameless for the day of Christ, "},{"num":11,"verse":"filled with the fruit of righteousness that comes through Jesus Christ for the glory and praise of God."},{"num":12,"verse":"I want you to know, brothers, that my situation has turned out rather to advance the gospel, "},{"num":13,"verse":"so that my imprisonment has become well known in Christ throughout the whole praetorium and to all the rest, "},{"num":14,"verse":"and so that the majority of the brothers, having taken encouragement in the Lord from my imprisonment, dare more than ever to proclaim the word fearlessly."},{"num":15,"verse":"Of course, some preach Christ from envy and rivalry, others from good will. "},{"num":16,"verse":"The latter act out of love, aware that I am here for the defense of the gospel; "},{"num":17,"verse":"the former proclaim Christ out of selfish ambition, not from pure motives, thinking that they will cause me trouble in my imprisonment. "},{"num":18,"verse":"What difference does it make, as long as in every way, whether in pretense or in truth, Christ is being proclaimed? And in that I rejoice."},{"num":19,"verse":"for I know that this will result in deliverance for me through your prayers and support from the Spirit of Jesus Christ. "},{"num":20,"verse":"My eager expectation and hope is that I shall not be put to shame in any way, but that with all boldness, now as always, Christ will be magnified in my body, whether by life or by death. "},{"num":21,"verse":"For to me life is Christ, and death is gain. "},{"num":22,"verse":"If I go on living in the flesh, that means fruitful labor for me. And I do not know which I shall choose. "},{"num":23,"verse":"I am caught between the two. I long to depart this life and be with Christ, [for] that is far better. "},{"num":24,"verse":"Yet that I remain [in] the flesh is more necessary for your benefit. "},{"num":25,"verse":"And this I know with confidence, that I shall remain and continue in the service of all of you for your progress and joy in the faith, "},{"num":26,"verse":"so that your boasting in Christ Jesus may abound on account of me when I come to you again."},{"num":27,"verse":"Only, conduct yourselves in a way worthy of the gospel of Christ, so that, whether I come and see you or am absent, I may hear news of you, that you are standing firm in one spirit, with one mind struggling together for the faith of the gospel, "},{"num":28,"verse":"not intimidated in any way by your opponents. This is proof to them of destruction, but of your salvation. And this is God’s doing. "},{"num":29,"verse":"For to you has been granted, for the sake of Christ, not only to believe in him but also to suffer for him. "},{"num":30,"verse":"Yours is the same struggle as you saw in me and now hear about me."}]