[{"header":"Introduction"},{"num":1,"verse":"From Paul and Timothy, both of us servants of Jesus, the Anointed One. To all his devoted followers in Philippi, including your pastors, and to all the servant-leaders of the church."},{"num":2,"verse":"May the blessings of divine grace and supernatural peace that flow from God our wonderful Father, and our Messiah, the Lord Jesus, be upon your lives."},{"header":"Paul Prays for the Philippians"},{"num":3,"verse":"My prayers for you are full of praise to God as I give him thanks for you with great joy! I’m so grateful for our union "},{"num":5,"verse":"and our enduring partnership that began the first time I presented to you the gospel. "},{"num":6,"verse":"I pray with great faith for you, because I’m fully convinced that the One who began this gracious work in you will faithfully continue the process of maturing you until the unveiling of our Lord Jesus Christ!"},{"num":7,"verse":"It’s no wonder I pray with such confidence, since you have a permanent place in my heart! You have remained partners with me in the wonderful grace of God even though I’m here in chains for standing up for the truth of the gospel. "},{"num":8,"verse":"Only God knows how much I dearly love you with the tender affection of Jesus, the Anointed One."},{"num":9,"verse":"I continue to pray for your love to grow and increase beyond measure, bringing you into the rich revelation of spiritual insight in all things."},{"num":10,"verse":"This will enable you to choose the most excellent way of all—becoming pure and without offense until the unveiling of Christ. "},{"num":11,"verse":"And you will be filled completely with the fruits of righteousness that are found in Jesus, the Anointed One—bringing great praise and glory to God!"},{"header":"Paul’s Imprisonment"},{"num":12,"verse":"I want you to know, dear ones, what has happened to me has not hindered, but helped my ministry of preaching the gospel, causing it to expand and spread to many people. "},{"num":13,"verse":"For now the elite Roman guards and government officials overseeing my imprisonment have plainly recognized that I am here because of my love for the Anointed One. "},{"num":14,"verse":"And what I’m going through has actually caused many believers to become even more courageous in the Lord and to be bold and passionate to preach the Word of God, all because of my chains."},{"num":15,"verse":"It’s true that there are some who preach Christ out of competition and controversy, for they are jealous over the way God has used me. Many others have purer motives—they preach with grace and love filling their hearts, "},{"num":16,"verse":"because they know I’ve been destined for the purpose of defending the revelation of God."},{"num":17,"verse":"Those who preach Christ with ambition and competition are insincere—they just want to add to the hardships of my imprisonment. "},{"num":18,"verse":"Yet in spite of all of this I am overjoyed! For what does it matter as long as Christ is being preached? If they preach him with mixed motives or with genuine love, the message of Christ is still being preached. And I will continue to rejoice "},{"num":19,"verse":"because I know that the lavish supply of the Spirit of Jesus, the Anointed One, and your intercession for me will bring about my deliverance. "},{"num":20,"verse":"No matter what, I will continue to hope and passionately cling to Christ, so that he will be openly revealed through me before everyone’s eyes. So I will not be ashamed! In my life or in my death, Christ will be magnified in me. "},{"num":21,"verse":"My true life is the Anointed One, and dying means gaining more of him."},{"num":22,"verse":"So here’s my dilemma: Each day I live means bearing more fruit in my ministry; yet I fervently long to be liberated from this body and joined fully to Christ. That would suit me fine, but the greatest advantage to you would be that I remain alive. So you can see why I’m torn between the two—I don’t know which I prefer."},{"num":25,"verse":"Yet deep in my heart I’m confident that I will be spared so I can add to your joy and further strengthen and mature your faith. "},{"num":26,"verse":"When I am freed to come to you, my deliverance will give you a reason to boast even more in Jesus Christ."},{"num":27,"verse":"Whatever happens, keep living your lives based on the reality of the gospel of Christ. Then when I come to see you, or hear good reports of you, I’ll know that you stand united in one Spirit and one passion—celebrating together as conquerors in the faith of the gospel. "},{"num":28,"verse":"And then you will never be shaken or intimidated by the opposition that rises up against us. Your courage will prove to be a sure sign from God of their coming destruction. "},{"num":29,"verse":"For God has graciously given you the privilege not only to believe in Christ, but also to suffer for him. "},{"num":30,"verse":"For you have been called by him to endure the conflict in the same way I have endured it—for you know I’m not giving up."}]