[{"header":"Honor for Mordecai"},{"num":6,"verse":"That same night, the king simply couldn’t sleep. He had the official royal records brought in, and his young male servants began reading them to the king."},{"num":2,"verse":"They came to the report about Mordecai informing on Bigthan and Teresh. (They were the two royal eunuchs among the guards protecting the king’s doorway, who secretly planned to kill King Ahasuerus.)"},{"num":3,"verse":"“What was done to honor and reward Mordecai for this?” the king asked."},{"num":4,"verse":"“Who is that out in the courtyard?” the king asked. (Haman had just entered the outer courtyard of the palace. He had come to tell the king to impale Mordecai on the pole that he had set up for him.)"},{"num":5,"verse":"The king’s servants answered, “That’s Haman standing out in the courtyard, sir.” So the king said, “Have him come in.”"},{"num":6,"verse":"When Haman entered, the king asked him, “What should be done for the man whom the king really wants to honor?”"},{"num":7,"verse":"So Haman said to the king, “Here’s what should be done for the man the king really wants to honor."},{"num":8,"verse":"Have servants bring out a royal robe that the king himself has worn and a horse on which the king himself has ridden. It should have a royal crest on its head."},{"num":9,"verse":"Then hand over the robe and the horse to another man, one of the king’s officials. Have him personally robe the man whom the king really wants to honor and lead him on the horse through the city square. As he goes, have him shout, ‘This is what the king does for the man he really wants to honor!’”"},{"num":10,"verse":"Then the king said to Haman, “Hurry, take the robe and the horse just as you’ve said and do exactly that for Mordecai the Jew, who works at the King’s Gate. Don’t leave out a single thing you’ve said!”"},{"num":11,"verse":"So Haman took the robe and the horse and put the robe on Mordecai. He led him on horseback through the city square, shouting as he went, “This is what the king does for the man he really wants to honor!”"},{"num":12,"verse":"Afterward, Mordecai returned to the King’s Gate, while Haman hurried home feeling great shame, his head covered."},{"num":13,"verse":"Haman told his wife Zeresh and all his friends everything that had happened to him. Both his friends and his wife said to him, “You’ve already begun to lose out to Mordecai. If he is of Jewish birth, you’ll not be able to win against him. You are surely going to lose out to him.”"},{"header":"Haman’s demise"},{"num":14,"verse":"They were still discussing this with him when several royal eunuchs arrived. They quickly hurried Haman off to the feast that Esther had prepared."}]