[{"header":"Mordecai Is Honored"},{"num":6,"verse":"That same night, the king could not sleep. So he told a servant to bring the history book and read it to him. ( The Book of History of the Kings lists everything that happens during a king’s rule.)"},{"num":2,"verse":"The servant read the book to the king. He read about the evil plan to kill King Xerxes. That was when Mordecai had learned about Bigthana and Teresh. These two men were the king’s officers who guarded the doorway. They had planned to kill the king, but Mordecai learned about the plan and told someone about it."},{"num":3,"verse":"Then the king asked, “What honor and good things have been given to Mordecai for this?”"},{"num":4,"verse":"Haman had just entered the outer area of the king’s palace. He had come to ask the king to hang Mordecai on the hanging post Haman had commanded to be built. The king said, “Who just came into the courtyard?”"},{"num":5,"verse":"The king’s servants said, “Haman is standing in the courtyard.”"},{"num":6,"verse":"When Haman came in, the king asked him a question. He said, “Haman, what should be done for a man the king wants to honor?”"},{"num":7,"verse":"So Haman answered the king, “Do this for the man the king loves to honor:"},{"num":8,"verse":"Have the servants bring a special robe the king himself has worn and a horse the king himself has ridden. Have the servants put the king’s special mark on the horse’s head."},{"num":9,"verse":"Then put one of the king’s most important leaders in charge of the robe and the horse, and let the leader put the robe on the man the king wants to honor. Then let him lead him on the horse through the city streets. As he leads him, let him announce, ‘This is done for the man the king wants to honor!’”"},{"num":10,"verse":"“Go quickly,” the king commanded Haman. “Get the robe and the horse and do just as you have suggested for Mordecai the Jew. He is sitting near the king’s gate. Do everything that you suggested.”"},{"num":11,"verse":"So Haman got the robe and the horse. Then he put the robe on Mordecai and led him on horseback through the city streets. Haman announced ahead of Mordecai, “This is done for the man the king wants to honor!”"},{"num":12,"verse":"After that Mordecai went back to the king’s gate, but Haman hurried home with his head covered because he was embarrassed and ashamed."},{"num":13,"verse":"Then Haman told his wife Zeresh and all his friends everything that had happened to him. His wife and the men who gave him advice said, “If Mordecai is a Jew, you cannot win. You have already started to fall. Surely you will be ruined!”"},{"num":14,"verse":"While they were still talking to Haman, the king’s eunuchs came to Haman’s house. They made Haman hurry to the party that Esther had prepared."}]