[[],[{"type":"header","content":"The King Honors Mordecai"},{"type":"prose","content":"On that night the king could not sleep, and he gave orders to bring the book of records, the annals, and they were read to the king. "}],[{"type":"prose","content":"It was found written how Mordecai had told about Bigthana and Teresh, two of the king’s eunuchs, who guarded the threshold, and who had conspired to assassinate King Ahasuerus. "}],[{"type":"prose","content":"Then the king said, “What honor or distinction has been bestowed on Mordecai for this?” The king’s servants who attended him said, “Nothing has been done for him.” "}],[{"type":"prose","content":"The king said, “Who is in the court?” Now Haman had just entered the outer court of the king’s palace to speak to the king about having Mordecai hanged on the gallows that he had prepared for him. "}],[{"type":"prose","content":"So the king’s servants told him, “Haman is there, standing in the court.” The king said, “Let him come in.” "}],[{"type":"prose","content":"So Haman came in, and the king said to him, “What shall be done for the man whom the king wishes to honor?” Haman said to himself, “Whom would the king wish to honor more than me?” "}],[{"type":"prose","content":"So Haman said to the king, “For the man whom the king wishes to honor, "}],[{"type":"prose","content":"let royal robes be brought, which the king has worn, and a horse that the king has ridden, with a royal crown on its head. "}],[{"type":"prose","content":"Let the robes and the horse be handed over to one of the king’s most noble officials; let him robe the man whom the king wishes to honor, and let him conduct the man on horseback through the open square of the city, proclaiming before him: ‘Thus shall it be done for the man whom the king wishes to honor.’” "}],[{"type":"prose","content":"Then the king said to Haman, “Quickly, take the robes and the horse, as you have said, and do so to the Jew Mordecai who sits at the king’s gate. Leave out nothing that you have mentioned.” "}],[{"type":"prose","content":"So Haman took the robes and the horse and robed Mordecai and led him riding through the open square of the city, proclaiming, “Thus shall it be done for the man whom the king wishes to honor.”"}],[{"type":"prose","content":"Then Mordecai returned to the king’s gate, but Haman hurried to his house, mourning and with his head covered. "}],[{"type":"prose","content":"When Haman told his wife Zeresh and all his friends everything that had happened to him, his advisers and his wife Zeresh said to him, “If Mordecai, before whom your downfall has begun, is of the Jewish people, you will not prevail against him, but will surely fall before him.”"}],[{"type":"header","content":"Haman’s Downfall and Mordecai’s Advancement"},{"type":"prose","content":"While they were still talking with him, the king’s eunuchs arrived and hurried Haman off to the banquet that Esther had prepared. "}]]