[{"header":"The King Honors Mordecai"},{"num":6,"verse":"On that night the king could not sleep; and he gave orders to bring the book of memorable deeds, the chronicles, and they were read before the king. "},{"num":2,"verse":"And it was found written how Mor′decai had told about Bigthana and Teresh, two of the king’s eunuchs, who guarded the threshold, and who had sought to lay hands upon King Ahasu-e′rus. "},{"num":3,"verse":"And the king said, “What honor or dignity has been bestowed on Mor′decai for this?” The king’s servants who attended him said, “Nothing has been done for him.” "},{"num":4,"verse":"And the king said, “Who is in the court?” Now Haman had just entered the outer court of the king’s palace to speak to the king about having Mor′decai hanged on the gallows that he had prepared for him. "},{"num":5,"verse":"So the king’s servants told him, “Haman is there, standing in the court.” And the king said, “Let him come in.” "},{"num":6,"verse":"So Haman came in, and the king said to him, “What shall be done to the man whom the king delights to honor?” And Haman said to himself, “Whom would the king delight to honor more than me?” "},{"num":7,"verse":"And Haman said to the king, “For the man whom the king delights to honor, "},{"num":8,"verse":"let royal robes be brought, which the king has worn, and the horse which the king has ridden, and on whose head a royal crown is set; "},{"num":9,"verse":"and let the robes and the horse be handed over to one of the king’s most noble princes; let him array the man whom the king delights to honor, and let him conduct the man on horseback through the open square of the city, proclaiming before him: ‘Thus shall it be done to the man whom the king delights to honor.’” "},{"num":10,"verse":"Then the king said to Haman, “Make haste, take the robes and the horse, as you have said, and do so to Mor′decai the Jew who sits at the king’s gate. Leave out nothing that you have mentioned.” "},{"num":11,"verse":"So Haman took the robes and the horse, and he arrayed Mor′decai and made him ride through the open square of the city, proclaiming, “Thus shall it be done to the man whom the king delights to honor.”"},{"num":12,"verse":"Then Mor′decai returned to the king’s gate. But Haman hurried to his house, mourning and with his head covered. "},{"num":13,"verse":"And Haman told his wife Zeresh and all his friends everything that had befallen him. Then his wise men and his wife Zeresh said to him, “If Mor′decai, before whom you have begun to fall, is of the Jewish people, you will not prevail against him but will surely fall before him.”"},{"header":"Haman’s Downfall and Mordecai’s Advancement"},{"num":14,"verse":"While they were yet talking with him, the king’s eunuchs arrived and brought Haman in haste to the banquet that Esther had prepared."}]