[{"num":8,"verse":"In the third year of the reign of King Belshazzar a vision appeared to me, Daniel, after the one that appeared to me at the first."},{"num":2,"verse":"And I saw in the vision and it seemed that I was at Shushan the palace or fortress [in Susa, the capital of Persia], which is in the province of Elam, and I saw in the vision and I was by the river of Ulai."},{"num":3,"verse":"And I lifted up my eyes and saw, and behold, there stood before the river a [single] ram which had two horns [representing two kings of Medo-Persia: Darius the Mede, then Cyrus]; and the two horns were high, but one [Persia] was higher than the other, and the higher one came up last."},{"num":4,"verse":"I looked and saw the ram [Medo-Persia] pushing and charging westward and northward and southward; no beast could stand before him, neither could anyone rescue from his power, but he did according to his [own] will and pleasure and magnified himself."},{"num":5,"verse":"As I was considering, behold, a he-goat [the king of Greece] came from the west across the face of the whole earth without touching the ground, and the goat had a conspicuous and remarkable horn between his eyes [symbolizing Alexander the Great]."},{"num":6,"verse":"And he came to the ram that had the two horns which I had seen standing on the bank of the river and ran at him in the heat of his power."},{"num":7,"verse":"[In my vision] I saw him come close to the ram [Medo-Persia], and he was moved with anger against him and he [Alexander the Great] struck the ram and broke his two horns; and there was no power in the ram to stand before him, but the goat threw him to the ground and trampled on him. And there was no one who could rescue the ram from his power."},{"num":8,"verse":"And the he-goat [Alexander the Great] magnified himself exceedingly, and when he was [young and] strong, the great horn [he] was [suddenly] broken; and instead of [him] there came up four notable horns [to whom the kingdom was divided, one] toward [each of] the four winds of the heavens."},{"num":9,"verse":"Out of littleness and small beginnings one of them came forth [Antiochus Epiphanes], a horn whose [impious presumption and pride] grew exceedingly great toward the south and toward the east and toward the ornament [the precious, blessed land of Israel]."},{"num":10,"verse":"And [in my vision this horn] grew great, even against the host of heaven [God’s true people, the saints], and some of the host and of the stars [priests] it cast down to the ground and trampled on them,"},{"num":11,"verse":"Yes, [this horn] magnified itself, even [matching itself] against the Prince of the host [of heaven]; and from Him the continual [burnt offering] was taken away and the place of [God’s] sanctuary was cast down and profaned."},{"num":12,"verse":"And the host [the chosen people] was given [to the wicked horn] together with the continual burnt offering because of the transgression [of God’s people—their abounding irreverence, ungodliness, and lack of piety]. And righteousness and truth were cast down to the ground, and it [the wicked horn] accomplished this [by divine permission] and prospered."},{"num":13,"verse":"Then I heard a holy one speaking, and another holy one said to the one that spoke, For how long is the vision concerning the continual offering, the transgression that makes desolate, and the giving over of both the sanctuary and the host [of the people] to be trampled underfoot?"},{"num":14,"verse":"And he said to him and to me, For 2,300 evenings and mornings; then the sanctuary shall be cleansed and restored."},{"num":15,"verse":"When I, even I, Daniel, had seen the vision, I sought to understand it; then behold, there stood before me one [Gabriel] with the appearance of a man."},{"num":16,"verse":"And I heard a man’s voice between the banks of the [river] Ulai which called and said, Gabriel, make this man [Daniel] understand the vision."},{"num":17,"verse":"So he came near where I stood, and when he came, I was frightened and fell on my face. But he said to me, Understand, O son of man, for the [fulfillment of the] vision belongs to [events that shall occur in] the time of the end."},{"num":18,"verse":"Now as he [Gabriel] was speaking with me, I fell stunned and in deep unconsciousness with my face to the ground; but he touched me and set me upright [where I had stood]."},{"num":19,"verse":"And he said, Behold, I will make you know what will be in the latter time of the indignation [of God upon the ungodly], for it has to do with the time of the end."},{"num":20,"verse":"The ram you saw having two horns, they are the kings of Media and Persia."},{"num":21,"verse":"And the shaggy and rough he-goat is the king of Greece, and the great horn between his eyes is the first king [who consolidated the whole realm, Alexander the Great]."},{"num":22,"verse":"And as for the horn which was shattered, in whose place four others arose, four kingdoms shall arise out of his nation but not having his [Alexander’s] power."},{"num":23,"verse":"And at the latter end of their kingdom, when the transgressors [the apostate Jews] have reached the fullness [of their wickedness, taxing the limits of God’s mercy], a king of fierce countenance and understanding dark trickery and craftiness shall stand up."},{"num":24,"verse":"And his power shall be mighty, but not by his own power; and he shall corrupt and destroy astonishingly and shall prosper and do his own pleasure, and he shall corrupt and destroy the mighty men and the holy people (the people of the saints)."},{"num":25,"verse":"And through his policy he shall cause trickery to prosper in his hand; he shall magnify himself in his heart and mind, and in their security he will corrupt and destroy many. He shall also stand up against the Prince of princes, but he shall be broken and that by no [human] hand."},{"num":26,"verse":"The vision of the evenings and the mornings which has been told you is true. But seal up the vision, for it has to do with and belongs to the [now] distant future."},{"num":27,"verse":"And I, Daniel, fainted and was sick [for several] days. Afterward I rose up and did the king’s business; and I wondered at the vision, but there was no one who understood it or could make it understood."}]