[{"header":"Vision of a Ram and a Goat"},{"num":8,"verse":"Daniel wrote:"},{"num":2,"verse":"in which I was in Susa, the chief city of Babylonia’s Elam Province. I was beside the Ulai River, "},{"num":3,"verse":"when I looked up and saw a ram standing there with two horns on its head—both of them were long, but the second one was longer than the first. "},{"num":4,"verse":"The ram went charging toward the west, the north, and the south. No other animals were strong enough to oppose him, and nothing could save them from his power. So he did as he pleased and became even more powerful."},{"num":5,"verse":"I kept on watching and saw a goat come from the west and charge across the entire earth, without even touching the ground. Between his eyes was a powerful horn, "},{"num":6,"verse":"and with tremendous anger the goat started toward the ram that I had seen beside the river. "},{"num":7,"verse":"The goat was so fierce that its attack broke both horns of the ram, leaving him powerless. Then the goat stomped on the ram, and no one could do anything to help. "},{"num":8,"verse":"After this, the goat became even more powerful. But at the peak of his power, his mighty horn was broken, and four other mighty horns took its place—one pointing to the north and one to the east, one to the south and one to the west."},{"num":9,"verse":"A little horn came from one of these, and its power reached to the south, the east, and even to the holy land. "},{"num":10,"verse":"It became so strong that it attacked the stars in the sky, which were heaven’s army. Then it threw some of them down to the earth and stomped on them. "},{"num":11,"verse":"It humiliated heaven’s army and dishonored its leader by keeping him from offering the daily sacrifices. In fact, it was so terrible that it even disgraced the temple and wiped out true worship. It also did everything else it wanted to do."},{"num":13,"verse":"Then one of the holy angels asked another, “When will the daily sacrifices be offered again? What about this horrible rebellion? When will the temple and heaven’s army no longer be trampled in the dust?”"},{"num":14,"verse":"The other answered, “It will be two thousand three hundred evenings and mornings before the temple is dedicated and in use again.”"},{"header":"Gabriel Interprets the Vision"},{"num":15,"verse":"Daniel wrote:"},{"num":16,"verse":"And from beside the Ulai River, a voice like that of a human said, “Gabriel, help him understand the vision.”"},{"num":17,"verse":"Gabriel came over, and I fell to the ground in fear. Then he said, “You are merely a human, but you need to understand that this vision is about the end of time.”"},{"num":18,"verse":"While he was speaking, I fell facedown in a deep sleep. But he lifted me to my feet "},{"num":19,"verse":"and said:"},{"num":27,"verse":"After this, I was so worn out and weak that it was several days before I could get out of bed and go about my duties for the king. I was disturbed by this vision that made no sense to me."}]