[{"header":"A Vision of a Ram and a Billy Goat"},{"num":8,"verse":"“In King Belshazzar’s third year as king, another vision came to me, Daniel. This was now the second vision."},{"num":2,"verse":"“In the vision, I saw myself in Susa, the capital city of the province Elam, standing at the Ulai Canal. Looking around, I was surprised to see a ram also standing at the gate. The ram had two huge horns, one bigger than the other, but the bigger horn was the last to appear. I watched as the ram charged: first west, then north, then south. No beast could stand up to him. He did just as he pleased, strutting as if he were king of the beasts."},{"num":5,"verse":"“While I was watching this, wondering what it all meant, I saw a billy goat with an immense horn in the middle of its forehead come up out of the west and fly across the whole country, not once touching the ground. The billy goat approached the double-horned ram that I had earlier seen standing at the gate and, enraged, charged it viciously. I watched as, mad with rage, it charged the ram and hit it so hard that it broke off its two horns. The ram didn’t stand a chance against it. The billy goat knocked the ram to the ground and stomped all over it. Nothing could have saved the ram from the goat."},{"num":8,"verse":"“Then the billy goat swelled to an enormous size. At the height of its power its immense horn broke off and four other big horns sprouted in its place, pointing to the four points of the compass. And then from one of these big horns another horn sprouted. It started small, but then grew to an enormous size, facing south and east—toward lovely Palestine. The horn grew tall, reaching to the stars, the heavenly army, and threw some of the stars to the earth and stomped on them. It even dared to challenge the power of God, Prince of the Celestial Army! And then it threw out daily worship and desecrated the Sanctuary. As judgment against their sin, the holy people of God got the same treatment as the daily worship. The horn cast God’s Truth aside. High-handed, it took over everything and everyone."},{"num":13,"verse":"“Then I overheard two holy angels talking. One asked, ‘How long is what we see here going to last—the abolishing of daily worship, this devastating judgment against sin, the kicking around of God’s holy people and the Sanctuary?’"},{"num":14,"verse":"“The other answered, ‘Over the course of 2,300 sacrifices, evening and morning. Then the Sanctuary will be set right again.’"},{"num":15,"verse":"“While I, Daniel, was trying to make sense of what I was seeing, suddenly there was a humanlike figure standing before me."},{"num":16,"verse":"“Then I heard a man’s voice from over by the Ulai Canal calling out, ‘Gabriel, tell this man what is going on. Explain the vision to him.’ He came up to me, but when he got close I became terrified and fell facedown on the ground."},{"num":17,"verse":"“He said, ‘Understand that this vision has to do with the time of the end.’ As soon as he spoke, I fainted, my face in the dirt. But he picked me up and put me on my feet."},{"num":19,"verse":"“And then he continued, ‘I want to tell you what is going to happen as the judgment days of wrath wind down, for there is going to be an end to all this."},{"num":20,"verse":"“‘The double-horned ram you saw stands for the two kings of the Medes and Persians. The billy goat stands for the kingdom of the Greeks. The huge horn on its forehead is the first Greek king. The four horns that sprouted after it was broken off are the four kings that come after him, but without his power."},{"num":27,"verse":"“I, Daniel, walked around in a daze, unwell for days. Then I got a grip on myself and went back to work taking care of the king’s affairs. But I continued to be upset by the vision. I couldn’t make sense of it.”"}]