[{"header":"Daniel Has a Vision About a Ram and a Goat"},{"num":8,"verse":"It was the third year of King Belshazzar’s rule. After the vision that had already appeared to me, I had another one. "},{"num":2,"verse":"In my vision I saw myself in the city of Susa. It has high walls around it. It is in the land of Elam. In the vision I was beside the Ulai Canal. "},{"num":3,"verse":"I looked up and saw a ram that had two horns. It was standing beside the canal. Its horns were long. One of them was longer than the other. But that horn grew up later. "},{"num":4,"verse":"I watched the ram as it charged toward the west. It also charged toward the north and the south. No animal could stand up against it. Not one of them could save anyone from its power. It did as it pleased. And it became great."},{"num":5,"verse":"I was thinking about all of this. Then a goat suddenly came from the west. It had a large horn between its eyes. The goat raced across the whole earth without even touching the ground. "},{"num":6,"verse":"It came toward the ram that had the two horns. It was the ram I had seen standing beside the canal. The goat was very angry. It charged at the ram. "},{"num":7,"verse":"I saw it attack the ram with mighty force. It struck the ram and broke the ram’s two horns. The ram didn’t have the power to stand up against it. The goat knocked the ram to the ground and stomped on it. No one could save the ram from the goat’s power. "},{"num":8,"verse":"The goat became very great. But when its power was at its greatest, the goat’s large horn was broken off. In its place four large horns grew up toward the four winds of heaven."},{"num":9,"verse":"Out of one of the four horns came another horn. It was small at first but became more and more powerful. It grew to the south and to the east and toward the beautiful land of Israel. "},{"num":10,"verse":"It grew until it reached the stars in the sky. It threw some of them down to the earth. And it stomped on them. "},{"num":11,"verse":"It set itself up to be as great as the commander of the Lord’s army. It took away the daily sacrifices from the Lord. And his temple in Jerusalem was thrown down. "},{"num":12,"verse":"Because many of the Lord’s people refused to obey him, they were handed over to the horn. The daily sacrifices were also given over to it. The horn was successful no matter what it did. And true worship of God was thrown down to the ground."},{"num":13,"verse":"Then I heard a holy angel speaking. Another holy angel spoke to him. He asked, “How long will it take for the vision to come true? When will the daily sacrifices be stopped? When will those who refuse to obey God be destroyed? When will the temple be handed over to an enemy? And when will some of the Lord’s people be stomped on?”"},{"num":14,"verse":"One of the holy angels said to me, “It will take 2,300 evenings and mornings. Then the temple will be made holy again.”"},{"header":"Gabriel Tells Daniel What His Vision Means"},{"num":15,"verse":"I was having the vision. And I was trying to understand it. Then I saw someone who looked like a man. "},{"num":16,"verse":"I heard a voice from the Ulai Canal. It called out, “Gabriel, tell Daniel what his vision means.”"},{"num":17,"verse":"Gabriel came close to where I was standing. I was terrified and fell down flat with my face toward the ground. Here is what he said to me. “Son of man, I want you to understand the vision. It’s about the time of the end.”"},{"num":18,"verse":"While he was speaking to me, I was sound asleep. I lay with my face on the ground. Then he touched me. He raised me to my feet."},{"num":19,"verse":"He said, “I am going to tell you what will happen later. It will take place when God is angry. The vision is about the appointed time of the end. "},{"num":20,"verse":"You saw a ram that had two horns. It stands for the kings of Media and Persia. "},{"num":21,"verse":"The goat stands for the king of Greece. The large horn between its eyes is the first king. "},{"num":22,"verse":"Four horns took the horn’s place when it was broken off. They stand for four kingdoms that will come from his nation. But those kingdoms will not be as powerful as his."},{"num":23,"verse":"“Toward the end of their rule, those who refuse to obey God will become completely evil. Then another king will appear. He will have a scary-looking face. He will be a master at making clever plans. "},{"num":24,"verse":"He will become very strong. But he will not get that way by his own power. People will be amazed at the way he destroys everything. He will be successful no matter what he does. He will destroy mighty people. Those mighty people are God’s holy people. "},{"num":25,"verse":"He will tell lies in order to succeed. He will think he is more important than anyone else. When people feel safe, he will destroy many of them. He will stand up against the greatest Prince of all. Then he will be destroyed. But he will not be killed by human beings."},{"num":26,"verse":"“The vision of the evenings and mornings that has been given to you is true. But seal up the vision. It is about a time far off.”"},{"num":27,"verse":"I, Daniel, was worn out. I was too tired to get up for several days. Then I got up and returned to my work for the king. The vision bewildered me. I couldn’t understand it."}]