[{"header":"The Perfect Life"},{"num":22,"verse":"Then the angel showed me a river of the water of life, clear as crystal, flowing from the throne of God and of the Lamb (Christ), "},{"num":2,"verse":"in the middle of its street. On either side of the river was the tree of life, bearing twelve kinds of fruit, yielding its fruit every month; and the leaves of the tree were for the healing of the nations. "},{"num":3,"verse":"There will no longer exist anything that is cursed [because sin and illness and death are gone]; and the throne of God and of the Lamb will be in it, and His bond-servants will serve and worship Him [with great awe and joy and loving devotion]; "},{"num":4,"verse":"they will [be privileged to] see His face, and His name will be on their foreheads. "},{"num":5,"verse":"And there will no longer be night; they have no need for lamplight or sunlight, because the Lord God will illumine them; and they will reign [as kings] forever and ever."},{"header":"You Are Invited to be Blessed"},{"num":6,"verse":"Then he said to me, “These words are faithful and true.” And the Lord, the God of the spirits of the prophets, has sent His angel [as a representative] to show His bond-servants the things that must soon take place."},{"num":8,"verse":"I, John, am the one who heard and saw these things. And when I heard and saw them, I fell down to worship before the feet of the angel who showed me these things. "},{"num":9,"verse":"But he said to me, “Do not do that. I am a fellow servant with you and your brothers the prophets and with those who heed and remember [the truths contained in] the words of this book. Worship God.”"},{"num":10,"verse":"And he said to me, “Do not seal up the words of the prophecy of this book, for the time [of their fulfillment] is near. "},{"num":11,"verse":"Let the one who does wrong, still do wrong; and the one who is filthy (vile, impure), still be filthy; and the one who is righteous (just, upright), still be righteous; and the one who is holy, still be holy.”"},{"num":14,"verse":"Blessed (happy, prosperous, to be admired) are those who wash their robes [in the blood of Christ by believing and trusting in Him—the righteous who do His commandments], so that they may have the right to the tree of life, and may enter by the gates into the city. "},{"num":15,"verse":"Outside are the dogs [the godless, the impure, those of low moral character] and the sorcerers [with their intoxicating drugs, and magic arts], and the immoral persons [the perverted, the molesters, and the adulterers], and the murderers, and the idolaters, and everyone who loves and practices lying (deception, cheating)."},{"header":"The Final Invitation"},{"num":17,"verse":"The [Holy] Spirit and the bride (the church, believers) say, “Come.” And let the one who hears say, “Come.” And let the one who is thirsty come; let the one who wishes take and drink the water of life without cost."},{"num":18,"verse":"I testify and warn everyone who hears the words of the prophecy of this book [its predictions, consolations, and admonitions]: if anyone adds [anything] to them, God will add to him the plagues (afflictions, calamities) which are written in this book; "},{"num":19,"verse":"and if anyone takes away from or distorts the words of the book of this prophecy, God will take away [from that one] his share from the tree of life and from the holy city (new Jerusalem), which are written in this book."},{"num":20,"verse":"He who testifies and affirms these things says, “Yes, I am coming quickly.” Amen. Come, Lord Jesus."},{"num":21,"verse":"The grace of the Lord Jesus (the Christ, the Messiah) be with all [the saints—all believers, those set apart for God]. Amen."}]