[{"header":"A further glimpse of the city"},{"num":1,"verse":"Then he showed me the river of the water of life, sparkling like crystal as it flowed from the throne of God and of the Lamb. In the middle of the street of the city and on either bank of the river grew the tree of life, bearing twelve fruits, a different kind for each month. The leaves of the tree were for the healing of the nations."},{"num":3,"verse":"Nothing that has cursed mankind shall exist any longer; the throne of God and of the Lamb shall be within the city. His servants shall worship him; they shall see his face, and his name will be upon their foreheads. Night shall be no more; they have no more need for either lamplight or sunlight, for the Lord God will shed his light upon them and they shall reign as kings for timeless ages."},{"header":"The angel endorses the revelation"},{"num":6,"verse":"Then the angel said to me, “These words are true and to be trusted, for the Lord God, who inspired the prophets, has sent his angel to show his servants what must shortly happen.”"},{"num":7,"verse":"“See, I come quickly! Happy is the man who pays heed to the words of the prophecy in this book.”"},{"header":"John’s personal endorsement"},{"num":8,"verse":"It is I, John, who have heard and seen these things. At the time when I heard and saw them I fell at the feet of the angel who showed them to me and I was about to worship him. but he said to me, “No! I am fellow-servant to you and to your brother, to the prophets and to those who keep the words of this book. give your worship to God!”"},{"num":10,"verse":"Then he added, “Do not seal up the words of the prophecy in this book, for the time of their fulfilment is near. Let the wicked man continue his wickedness and the filthy man his filthiness; let the good man continue his good deeds, and the holy man continue in holiness."},{"header":"The interjected words of Christ"},{"num":12,"verse":"“See, I come quickly! I carry my reward with me, and repay every man according to his deeds. I am Alpha and Omega, the first and the last, the Beginning and the End. Happy are those who wash their robes, for they have the right to the tree of life and the freedom of the gates of the city. Shut out from the city shall be the depraved, the sorcerers, the impure, the murderers and the idolaters, and everyone who loves and practises a lie!"},{"num":16,"verse":"“I, Jesus, have sent my angel to you with this testimony for the Churches. I am both the root and stock of David, and the bright star of the morning!”"},{"header":"The invitation of the Church and the Spirit"},{"num":17,"verse":"The Spirit and the bride say, “Come!” Let everyone who hears this also say, “Come!” Let the thirsty man come, and let everyone who wishes take the water of life as a gift."},{"header":"John’s testimony to this book"},{"num":18,"verse":"Now I bear solemn witness to every man who hears the words of prophecy in this book: If anyone adds to these words God will add to him the disasters described in this book; if anyone takes away from the words of prophecy in this book, God will take away from him his share in the tree of life and in the holy city which are described in this book."},{"num":20,"verse":"He, who is witness to all this, says, “Yes, I am coming very quickly!” “Amen, come Lord Jesus!”"},{"num":21,"verse":"The grace of the Lord Jesus be with all his people."}]