[{"header":"The Transfiguration"},{"num":17,"verse":"After six days Jesus took Peter, James, and his brother John and led them up on a high mountain by themselves. "},{"num":2,"verse":"He was transfigured in front of them, and his face shone like the sun; his clothes became as white as the light. "},{"num":3,"verse":"Suddenly, Moses and Elijah appeared to them, talking with him. "},{"num":4,"verse":"Then Peter said to Jesus, “Lord, it’s good for us to be here. If you want, I will set up three shelters here: one for you, one for Moses, and one for Elijah.”"},{"num":5,"verse":"While he was still speaking, suddenly a bright cloud covered them, and a voice from the cloud said, “This is my beloved Son, with whom I am well-pleased. Listen to him!”  "},{"num":6,"verse":"When the disciples heard this, they fell facedown and were terrified."},{"num":7,"verse":"Jesus came up, touched them, and said, “Get up; don’t be afraid.” "},{"num":8,"verse":"When they looked up they saw no one except Jesus alone."},{"num":9,"verse":"As they were coming down the mountain, Jesus commanded them, “Don’t tell anyone about the vision until the Son of Man is raised from the dead.”"},{"num":10,"verse":"So the disciples asked him, “Why then do the scribes say that Elijah must come first?” "},{"num":11,"verse":"“Elijah is coming and will restore everything,” he replied. "},{"num":12,"verse":"“But I tell you: Elijah has already come, and they didn’t recognize him. On the contrary, they did whatever they pleased to him. In the same way the Son of Man is going to suffer at their hands.” "},{"num":13,"verse":"Then the disciples understood that he had spoken to them about John the Baptist."},{"header":"The Power of Jesus over a Demon"},{"num":14,"verse":"When they reached the crowd, a man approached and knelt down before him. "},{"num":15,"verse":"“Lord,” he said, “have mercy on my son, because he has seizures and suffers terribly. He often falls into the fire and often into the water. "},{"num":16,"verse":"I brought him to your disciples, but they couldn’t heal him.”"},{"num":17,"verse":"Jesus replied, “You unbelieving and perverse generation, how long will I be with you? How long must I put up with you? Bring him here to me.” "},{"num":18,"verse":"Then Jesus rebuked the demon, and it came out of him, and from that moment the boy was healed."},{"num":19,"verse":"Then the disciples approached Jesus privately and said, “Why couldn’t we drive it out?”"},{"num":20,"verse":"“Because of your little faith,” he told them. “For truly I tell you, if you have faith the size of  a mustard seed, you will tell this mountain, ‘Move from here to there,’ and it will move. Nothing will be impossible for you.”"},{"header":"The Second Prediction of His Death"},{"num":22,"verse":"As they were gathering together in Galilee, Jesus told them, “The Son of Man is about to be betrayed into the hands of men. "},{"num":23,"verse":"They will kill him, and on the third day he will be raised up.” And they were deeply distressed."},{"header":"Paying the Temple Tax"},{"num":24,"verse":"When they came to Capernaum, those who collected the temple tax approached Peter and said, “Doesn’t your teacher pay the temple tax?” "},{"num":25,"verse":"“Yes,” he said."},{"num":26,"verse":"“From strangers,” he said."},{"num":27,"verse":"“But, so we won’t offend them, go to the sea, cast in a fishhook, and take the first fish that you catch. When you open its mouth you’ll find a coin. Take it and give it to them for me and you.”"}]