[{"header":"Moses and Elijah Appear with Jesus(A)"},{"num":17,"verse":"After six days Jesus took Peter, James, and John (the brother of James) and led them up a high mountain where they could be alone."},{"num":2,"verse":"Jesus’ appearance changed in front of them. His face became as bright as the sun and his clothes as white as light. "},{"num":3,"verse":"Suddenly, Moses and Elijah appeared to them and were talking with Jesus."},{"num":4,"verse":"Peter said to Jesus, “Lord, it’s good that we’re here. If you want, I’ll put up three tents here—one for you, one for Moses, and one for Elijah.”"},{"num":5,"verse":"He was still speaking when a bright cloud overshadowed them. Then a voice came out of the cloud and said, “This is my Son, whom I love and with whom I am pleased. Listen to him!”"},{"num":6,"verse":"The disciples were terrified when they heard this and fell facedown on the ground. "},{"num":7,"verse":"But Jesus touched them and said, “Get up, and don’t be afraid!” "},{"num":8,"verse":"As they raised their heads, they saw no one but Jesus."},{"num":9,"verse":"On their way down the mountain, Jesus ordered them, “Don’t tell anyone what you have seen. Wait until the Son of Man has been brought back to life.”"},{"num":10,"verse":"So the disciples asked him, “Why do the experts in Moses’ Teachings say that Elijah must come first?”"},{"num":11,"verse":"Jesus answered, “Elijah is coming and will put everything in order again. "},{"num":12,"verse":"Actually, I can guarantee that Elijah has already come. Yet, people treated him as they pleased because they didn’t recognize him. In the same way they’re going to make the Son of Man suffer.”"},{"num":13,"verse":"Then the disciples understood that he was talking about John the Baptizer."},{"header":"Jesus Cures a Demon-Possessed Boy(B)"},{"num":14,"verse":"When they came to a crowd, a man came up to Jesus, knelt in front of him, "},{"num":15,"verse":"and said, “Sir, have mercy on my son. He suffers from seizures. Often he falls into fire or water. "},{"num":16,"verse":"I brought him to your disciples, but they couldn’t cure him.”"},{"num":17,"verse":"Jesus replied, “You unbelieving and corrupt generation! How long must I be with you? How long must I put up with you? Bring him here to me!”"},{"num":18,"verse":"Jesus ordered the demon to come out of the boy. At that moment the boy was cured."},{"num":19,"verse":"Then the disciples came to Jesus privately and asked, “Why couldn’t we force the demon out of the boy?”"},{"num":20,"verse":"He told them, “Because you have so little faith. I can guarantee this truth: If your faith is the size of a mustard seed, you can say to this mountain, ‘Move from here to there,’ and it will move. Nothing will be impossible for you.” "},{"header":"Jesus Again Foretells That He Will Die and Come Back to Life(C)"},{"num":22,"verse":"While they were traveling together in Galilee, Jesus told them, “The Son of Man will be betrayed and handed over to people. "},{"num":23,"verse":"They will kill him, but on the third day he will be brought back to life.” Then the disciples became very sad."},{"header":"Paying the Temple Tax"},{"num":24,"verse":"When they came to Capernaum, the collectors of the temple tax came to Peter. They asked him, “Doesn’t your teacher pay the temple tax?”"},{"num":25,"verse":"“Certainly,” he answered."},{"num":26,"verse":"“From other people,” Peter answered."},{"num":27,"verse":"However, so that we don’t create a scandal, go to the sea and throw in a hook. Take the first fish that you catch. Open its mouth, and you will find a coin. Give that coin to them for you and me.”"}]