[{"header":"The Transfiguration"},{"num":17,"verse":"After six days Jesus took Peter, James, and his brother John and led them up on a high mountain by themselves. "},{"num":2,"verse":"He was transformed in front of them, and His face shone like the sun. Even His clothes became as white as the light. "},{"num":3,"verse":"Suddenly, Moses and Elijah appeared to them, talking with Him."},{"num":4,"verse":"Then Peter said to Jesus, “Lord, it’s good for us to be here! If You want, I will make three tabernacles here: one for You, one for Moses, and one for Elijah.”"},{"num":5,"verse":"While he was still speaking, suddenly a bright cloud covered them, and a voice from the cloud said:"},{"num":6,"verse":"When the disciples heard it, they fell facedown and were terrified."},{"num":7,"verse":"Then Jesus came up, touched them, and said, “Get up; don’t be afraid.” "},{"num":8,"verse":"When they looked up they saw no one except Him—Jesus alone. "},{"num":9,"verse":"As they were coming down from the mountain, Jesus commanded them, “Don’t tell anyone about the vision until the Son of Man is raised from the dead.”"},{"num":10,"verse":"So the disciples questioned Him, “Why then do the scribes say that Elijah must come first?”"},{"num":13,"verse":"Then the disciples understood that He spoke to them about John the Baptist."},{"header":"The Power of Faith over a Demon"},{"num":14,"verse":"When they reached the crowd, a man approached and knelt down before Him. "},{"num":15,"verse":"“Lord,” he said, “have mercy on my son, because he has seizures and suffers severely. He often falls into the fire and often into the water. "},{"num":16,"verse":"I brought him to Your disciples, but they couldn’t heal him.”"},{"num":17,"verse":"Jesus replied, “You unbelieving and rebellious generation! How long will I be with you? How long must I put up with you? Bring him here to Me.” "},{"num":18,"verse":"Then Jesus rebuked the demon, and it came out of him, and from that moment the boy was healed."},{"num":19,"verse":"Then the disciples approached Jesus privately and said, “Why couldn’t we drive it out?”"},{"header":"The Second Prediction of His Death"},{"num":22,"verse":"As they were meeting in Galilee, Jesus told them, “The Son of Man is about to be betrayed into the hands of men. "},{"header":"Paying the Temple Tax"},{"num":24,"verse":"When they came to Capernaum, those who collected the double-drachma tax approached Peter and said, “Doesn’t your Teacher pay the double-drachma tax?”"},{"num":25,"verse":"“Yes,” he said."},{"num":26,"verse":"“From strangers,” he said."}]