[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They had looked into the ark.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Some commentators consider that the words here should be rendered, “because they had looked at the Ark” with a foolish irreverent staring, which dishonoured the holiness of the sacred mercy-seat; but it is better far to preserve the rendering of our English Version, which is also the favourite Rabbinical explanation of the original. It seems probable that the chief men of the city, most of whom were priests and Levites, after the festive rejoicings which accompanied the sacrificial feast celebrating the Ark’s joyful return, heated with wine, lost all sense of reverence, and determined to use this opportunity of gazing into that sacred chest of which they had heard so much, and into which no profane eye in Israel had ever peered, since the golden Cover—on which the glory of the Eternal loved to rest—had sealed up the sacred treasures in the wilderness. Perhaps they wished to see those grey Sinai tablets on which the finger of God had traced His ten solemn commandments; perhaps they excused themselves by a desire to learn if the Philistines had violated the secrets of the holy chest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Even he smote of the people fifty thousand and threescore and ten men.—Here it is perfectly clear that the present Hebrew text, which the English Version literally renders, is corrupt. The system of writing letters for numbers, as we have seen, constantly has occasioned great discrepancies in the several versions, &c. Here the arrangement of the letters which express this enormous number is quite unusual, and taken by itself would be sufficient to excite grave doubts as to the accuracy of this text. The number of stricken ones, 50,070, is simply inconceivable. Beth-shemesh was never a large or important place; there were, in fact, no great cities in Israel, the population was always a scattered one, the people living generally on their farms. Dean Payne Smith computes the population of Jerusalem in its best days as under 70,000. The various versions, LXX., Chaldee, &c, vary in their rendering of these astounding figures. Josephus, Antt. vi. 1, § 4, in his account of this occurrence speaks of the smitten as numbering seventy. This is probably the correct number. A strange reading, which the LXX. inserts here, deserves to be quoted; it is another proof of the uncertainty of the text at the close of this sixth chapter: “And the children of Jechoniah among the Beth-shemites were not pleased with the men of Beth-shemesh because they saw the Ark, and he smote them, &c.” Erdmann, in Lange, is inclined to believe the LXX. Version represents the true text, and thus comments on it: “The reason of the sudden death of the seventy of the race of Jechoniah is their unsympathising and, therefore, unholy bearing towards the symbols of God’s presence among His people, which showed a mind wholly estranged from the living God—a symptom of the religious moral degeneracy which had spread among the people, though piety was still to be found.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Even he smote of the people fifty thousand and threescore and ten men.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Here it is perfectly clear that the present Hebrew text, which the English Version literally renders, is corrupt. The system of writing letters for numbers, as we have seen, constantly has occasioned great discrepancies in the several versions, &c. Here the arrangement of the letters which express this enormous number is quite unusual, and taken by itself would be sufficient to excite grave doubts as to the accuracy of this text. The number of stricken ones, 50,070, is simply inconceivable. Beth-shemesh was never a large or important place; there were, in fact, no ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "great ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "cities in Israel, the population was always a scattered one, the people living generally on their farms. Dean Payne Smith computes the population of Jerusalem in its best days as under 70,000. The various versions, LXX., Chaldee, &c, vary in their rendering of these astounding figures. Josephus, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Antt. vi.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 1, § 4, in his account of this occurrence speaks of the smitten as numbering seventy. This is probably the correct number. A strange reading, which the LXX. inserts here, deserves to be quoted; it is another proof of the uncertainty of the text at the close of this sixth chapter: “And the children of Jechoniah among the Beth-shemites were not pleased with the men of Beth-shemesh because they saw the Ark, and he smote them, &c.” Erdmann, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Lange, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is inclined to believe the LXX. Version represents the true text, and thus comments on it: “The reason of the sudden death of the seventy of the race of Jechoniah is their unsympathising and, therefore, unholy bearing towards the symbols of God’s presence among His people, which showed a mind wholly estranged from the living God—a symptom of the religious moral degeneracy which had spread among the people, though piety was still to be found.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 6:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 6:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because they had looked into the ark ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Which God had forbidden, not only to the common people, but to the sons of Levi also, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 4:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But the people, having now an opportunity which they had not had before, were moved with a vehement curiosity to see the contents of the ark, forgetting the divine prohibition and their duty. Perhaps they were desirous to see whether the Philistines had taken out the tables of the covenant; or to have a view of such an ancient, sacred monument, written with God’s own hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Even he smote of the people — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In and near Beth-shemesh, and coming from all parts on this occasion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fifty thousand threescore and ten men — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This translation is made by an unaccountable transposition of the words; which, in the Hebrew, lie exactly thus. He ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "smote of the people threescore and ten men, fifty thousand men; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the most probable sense of which is this: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He smote threescore and ten men, fifty out of a thousand men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, God was so merciful as not to slay all that were guilty, but only seventy of them, observing this proportion, that out of a thousand offenders he smote only fifty persons, or a twentieth part. And this interpretation is very easy, by only supplying the letter ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "מ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mem ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "before ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Š",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eleph, a thousand, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "making the sense to be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of a thousand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And there are many passages of Scripture where this particle is manifestly wanting to make out the true meaning. This translation was long ago proposed by Bochart, and approved by Dr. Waterland, who renders the passage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He smote of the people threescore and ten men out of fifty thousand: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which, he says, “is a juster rendering of the Hebrew, and is well defended by Le Clerc upon the place.” Josephus, it must be observed, mentions only seventy Beth-shemites as smitten on this occasion; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Antiq., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "book 6, cap. 2. And Dr. Kennicott appeals to three Hebrew MSS., in confirmation of this sense of the clause. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A great slaughter — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It was a great slaughter, considering the smallness of this place, probably only a village.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:19-21 It is a great affront to God, for vain men to pry into, and meddle with the secret things which belong not to them, De 29:29; Col 2:18. Man was ruined by desiring forbidden knowledge. God will not suffer his ark to be profaned. Be not deceived, God is not mocked. Those that will not fear his goodness, and reverently use the tokens of his grace, shall be made to feel his justice. The number smitten is expressed in an unusual manner in the original, and it is probable that it means 1170. They desire to be rid of the ark. Foolish men run from one extreme to the other. They should rather have asked, How may we have peace with God, and recover his favor? Mic 6:6,7. Thus, when the word of God works with terror on sinners' consciences, they, instead of taking the blame and shame to themselves, quarrel with the word, and put that from them. Many stifle their convictions, and put salvation away from them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Fifty thousand and three score and ten - Read \"three\" score and \"ten\", omitting \"fifty thousand\", which appears to have crept into the text from the margin. It is not improbable that in their festive rejoicing priests, Levites, and people may have fallen into intemperance, and hence, into presumptuous irreverence (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). God had just vindicated His own honor against the Philistines; it must now be seen that He would be sanctified in them that come near Him ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is obvious to observe how the doctrine of atonement, and its necessity in the case of sinners, is taught in this and similar lessons as to the awesome HOLINESS of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. he smote the men of Beth-shemesh, because they had looked into the ark—In the ecstasy of delight at seeing the return of the ark, the Beth-shemesh reapers pried into it beneath the wagon cover; and instead of covering it up again, as a sacred utensil, they let it remain exposed to common inspection, wishing it to be seen, in order that all might enjoy the triumph of seeing the votive offerings presented to it, and gratify curiosity with the sight of the sacred shrine. This was the offense of those Israelites (Levites, as well as common people), who had treated the ark with less reverence than the Philistines themselves.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he smote of the people fifty thousand and threescore and ten men—Beth-shemesh being only a village, this translation must be erroneous, and should be, \"he smote fifty out of a thousand,\" being only fourteen hundred in all who indulged this curiosity. God, instead of decimating, according to an ancient usage, slew only a twentieth part; that is, according to Josephus, seventy out of fourteen hundred (see Nu 4:18-22).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They had looked into the ark of the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " having now an opportunity which they never yet had, nor were ever like to have, it is not strange they had a vehement curiosity and desire to see the contents of the ark; or whether the Philistines had taken them away, and put other things in their place; and they thought they might now presume the more, because the ark had been polluted by the Philistines, and was now exposed to open view, and not yet put into that most holy place, which they were forbidden to approach. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of the people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. of the people living in and near Beth-shemesh, or coming thither from all parts upon this great and glorious occasion. Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "also, he smote of the people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, of or belonging to other places, though now here; so these are distinguished from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men of Beth-shemesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of whom he speaks only in general and indefinitely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he smote the men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. some or many of them, and then sets down the number of the persons smitten or slain, either excluding the Beth-shemites, or including them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Fifty thousand and threescore and ten men:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this may seem an incredible relation, both because that place could not afford so great a number, and because it seems an act of great rigour, that God should so severely punish those people who came with so much zeal and joy to congratulate the return of the ark, and that for so inconsiderable an error. For the latter branch of the objection, it may be said: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. That God always used to be most severe in punishing his own people, as sinning against more knowledge and warning than others; especially for such sins as immediately concern his own worship and service. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. That men are very incompetent judges of these matters, because they do not understand all the reasons and causes of God’s judgments. For although God took this just occasion to punish them for that crime which was so severely forbidden even to the common Levites under pain of death; of which see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 4:18-20",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 4:18-20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; yet it is apparent that the people were at this time guilty of many other and greater miscarriages, for which God might justly inflict the present punishment upon them; and moreover, there are many secret sins which escape man’s observation, but are seen by God, before whom many persons may be deeply guilty, whom men esteem innocent and virtuous. And therefore men should take heed of censuring the judgments of God, of which it is most truly said, that they are oft secret, but never unrighteous. And for the former branch of the objection, many things are or may be said: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. That the land of Israel was strangely populous. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Samuel 24:9 2 Chronicles 13:3",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 24:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. That all these were not the settled inhabitants of this place, but most of them such as did, and in all probability would, resort thither in great numbers upon so illustrious an occasion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. That all these were not struck dead in the very fact, and upon the place, which would have terrified others from following their example; but were secretly struck with some disease or plague, which killed them in a little time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. That divers learned men translate and understand the place otherwise, and make the number much smaller. Josephus the Jew, and the Hebrew doctors, and many others, contend that only seventy persons were slain; which though it seem but a small number, yet might justly be called a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great slaughter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", either for the quality of the persons slain, or for the greatness and extraordinariness of the stroke; or because it was a great number, considering the smallness of the place, and the sadness of the occasion. The words in the Hebrew are these, and thus placed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he smote of or among the people seventy men, fifty thousand men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; whereas, say they, the words should have been otherwise placed, and the greater number put before the less, if this had been meant, that he smote fifty thousand and seventy men. And one very learned man renders the words thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He smote of the people seventy men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", even ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fifty of a thousand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mem, of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", being here understood, as it is very frequently. So the meaning is, that God smote every twentieth man of the transgressors, as the Romans used to cut off every tenth man in case of the general guilt of an army. Or the words may be rendered thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He smote of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the people seventy men out of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fifty thousand men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mem, of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", being understood before the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fifty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which Bochart puts before a thousand; and it may be thus expressed, to show that God did temper his severity with great clemency; and whereas there were many thousands of transgressors, (every one following his brother’s example, as is usual in such cases,) God only singled out seventy of the principal offenders, who either sinned most against their light or office, or were the ringleaders or chief encouragers of the rest. To which may be added, that the ancient translators, the Syriac and Arabic, read the place ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "five thousand and seventy men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", being supposed to have read in their Hebrew copies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chamesh, five",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chamishim, fifty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is no great alteration in the word. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he smote the men of Bethshemesh,.... That is, God smote them, though they had received the ark with such expressions of joy, and had offered sacrifices on account of it; yet sinning in one particular after mentioned, which was highly resented, they were smitten by him with a thunderbolt, as Josephus says (z): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because they had looked into the ark of the Lord; which was forbidden the Levites, Numbers 4:20 out of curiosity these men opened the ark, to see whether the Philistines had taken anything out of it, or put anything into it; and this, when in the tabernacle, being only to be seen by the high priest; and supposing they should never have the like opportunity again, to look upon the tables of the law which were in it, took it; and the rather they might be emboldened to this action, since it had been in the hands of the uncircumcised Philistines, who had profaned it; and as yet not restored to its pristine purity, holiness, and place: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because they had looked into the ark of the Lord; which was forbidden the Levites, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 4:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " out of curiosity these men opened the ark, to see whether the Philistines had taken anything out of it, or put anything into it; and this, when in the tabernacle, being only to be seen by the high priest; and supposing they should never have the like opportunity again, to look upon the tables of the law which were in it, took it; and the rather they might be emboldened to this action, since it had been in the hands of the uncircumcised Philistines, who had profaned it; and as yet not restored to its pristine purity, holiness, and place: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "even he smote of the people fifty thousand and seventy men; but as Bethshemesh was but a small place, a village, as Josephus (a) calls it, and it seems not likely that there should be such a number of persons in it, and especially that should look into the ark; or that God, who is good and merciful, should destroy so large a number for this offence, however he might think fit to make an example of some, it is thought that the case was not as our version represents it. Some who think there were so many slain, yet distinguish them, seventy of the elders of the people, and 50,000 of the congregation, or common people, as the Targum; which accounts not for the difficulty at all: others think that only seventy of the men of Bethshemesh died, and that 50,000 were such as flocked out of the country on this occasion; but as this was on the same day the ark came into those parts, it can hardly be thought that so great a number should be got together so soon; and still less that they should all of them open the ark, and look into it. Abarbinel is of opinion that only seventy men of Bethshemesh were slain, and that the other 50,000 were the Philistines that died on account of the ark while it was among them; and reads the words, \"with the men of Bethshemesh he smote--even he smote of the people seventy\"; that is, of the men of Bethshemesh; 50,000, that is, of the Philistines, and so this gives the sum of all that died on account of the ark, both while it was in the hands of the Philistines, and when returned to Bethshemesh, which is not an improbable sense: but others, and perhaps more truly, think that only seventy persons were smitten with death; for the order in which this account is given is different from all others in the Hebrew text, the lesser number being put first with a considerable distinguishing accent upon it, whereas the greater number is always expressed first; it stands thus, \"of the people seventy men; 50,000 men\": 5000, according to the Syriac and Arabic versions. Josephus (b) is express for it that only seventy men were slain, and so some of the ancient Jews (c); who say that these seventy were equal to 50,000, because of their superior excellency and dignity, as Ben Gersom observes, being the priests of the Lord, or the sanhedrim; but Bochart's (d) sense seems to be preferable to all others, that there is a defect of the particle  \"out of\"; and so to be read, either seventy men out of fifty thousand; that out of the 50,000 that flocked on this occasion from various parts, seventy were smitten for the reason before given; or rather seventy men, fifty out of 1000 men; that is, a twentieth part of the number of them, so that, out of 1400, seventy men were struck with death for their curiosity (e). Something of this story seems to be retained by tradition among the Heathens; we are told (f) that when Troy was taken an ark was found, in which was the image of Bacchus; which being opened by Eurypylus, he was struck with madness as soon as he saw the image: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the people lamented, because the Lord had smitten many of the people with a great slaughter; I see no occasion for the supplement \"many\"; it was a great slaughter, if we consider the awful manner in which it was made, by thunder and lightning, as may be supposed; however, by an immediate stroke from heaven; and the persons on whom it was made, men of a sacred character, priests and Levites; and a great number, considering it was but a small city. Hence the place was called Abel, which signifies weeping, mourning, lamentation, 1 Samuel 6:18. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the people lamented, because the Lord had smitten many of the people with a great slaughter; I see no occasion for the supplement \"many\"; it was a great slaughter, if we consider the awful manner in which it was made, by thunder and lightning, as may be supposed; however, by an immediate stroke from heaven; and the persons on whom it was made, men of a sacred character, priests and Levites; and a great number, considering it was but a small city. Hence the place was called Abel, which signifies weeping, mourning, lamentation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 6:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Antiqu. l. 6. c. 1. sect. 4. (a) Antiqu. l. 6. c. 1. sect. 3.((b) Antiqu. l. 6. c. 1. sect. 3.((c) T. Bab. Sotah, fol. 35. 2. T. Hieros. Sanhedrin, fol. 20. 2. Bemidbar Rabba, sect. 5. fol. 186. 2.((d) Hierozoic. par. 1. l. 2. c. 36. col. 370. (e) So Noldius, No. 779. (f) Pausan. Achaica, sive, l. 7. p. 435. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Antiqu. l. 6. c. 1. sect. 4. (a) Antiqu. l. 6. c. 1. sect. 3.((b) Antiqu. l. 6. c. 1. sect. 3.((c) T. Bab. Sotah, fol. 35. 2. T. Hieros. Sanhedrin, fol. 20. 2. Bemidbar Rabba, sect. 5. fol. 186. 2.((d) Hierozoic. par. 1. l. 2. c. 36. col. 370. (e) So Noldius, No. 779. (f) Pausan. Achaica, sive, l. 7. p. 435. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he smote the men of Bethshemesh, because they {k} had looked into the ark of the LORD, even he smote of the people fifty thousand and threescore and ten men: and the people lamented, because the LORD had smitten many of the people with a great slaughter.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he smote the men of Bethshemesh, because they ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " had looked into the ark of the LORD, even he smote of the people fifty thousand and threescore and ten men: and the people lamented, because the LORD had smitten ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "many",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the people with a great slaughter.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) For it was not lawful for anyone either to touch or to see it, only to Aaron and his sons Nu 4:15,20.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Penalty of Irreverence. Removal of the Ark to Kirjath-jearim",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because they had looked into the ark",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "because they had gazed upon the ark.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The rendering of the E. V. follows the explanation given by Rabbinic commentators, but the expression used signifies rather “to gaze upon with profane curiosity.” The priests of Beth-shemesh must have known that even the Levites were forbidden to look upon the furniture of the Holy of Holies upon pain of death (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 4:19-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but instead of hastening to cover it with befitting reverence, they left it exposed to the public gaze, and brought down a judgment which was intended to vindicate the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holiness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Jehovah. Certainly they were not punished for the unavoidable sight of the Ark as it approached them, at which they justly rejoiced (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Samuel 6:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 6:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It seems not improbable, however, that there is some corruption in the Heb. text here. The repetition “and he smote,” “even he smote,” is somewhat strange, and the Sept. has the following entirely different reading, which may possibly represent an earlier text. “And the sons of Jechonias rejoiced not among the men of Bethsamus because they saw the ark of the Lord: and he smote among them, &c.” i.e. either from indifference or irreligion they took no part in the general rejoicing and were punished for their impiety.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fifty thousand and threescore and ten men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It is generally agreed that there is some mistake in the text here. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The anomalous order of the numerals in the Hebrew (70 men 50,000 men), and the absence of the conjunction ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mark corruption, (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The village of Beth-shemesh cannot possibly have contained such a number of inhabitants. It seems best with Josephus and some Heb. MSS. to omit 50,000 altogether. Possibly the number was originally expressed by a letter used as a numerical sign, and explained once rightly and once wrongly in marginal notes, both of which eventually crept into the text. “A like instance of the intrusion of a number into the text is found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 7:70",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the number 500 is erroneously added to the 30 (or 33) Priests’ garments given by Nehemiah, to make up 100 with the 67 given by the congregation. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 2:69",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 7:72",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Speaker’s Comm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 274.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Many explanations of the passage with the retention of the number 50,000 have been attempted. The only one deserving of notice is that 50,000 is the number of the people, 70 the number of those that were smitten among them. But apart from the improbability that the village contained so many inhabitants, (and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Samuel 6:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 6:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " implies that the news of the return of the Ark had not spread so as to bring in others from a distance), this meaning can only be imposed upon the Hebrew and not fairly extracted from it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Such errors as this, to which the text of any ancient book is liable in the process of transmission, do not affect the general historical trust-worthiness of the narrative, and the freest acknowledgment of them in no way precludes a full belief in the Inspiration of Scripture.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "had smitten many of the people with a great slaughter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit., “had smitten the people with a great smiting.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He emote the men of Beth-shemesh,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. In this verse also the text is undoubtedly corrupt. The Septuagint ascribes the sin not to all the people, but to \"the sons of Jeconiah, who were not glad when they saw the ark, and he smote them.\" But as this reading is not supported by the other versions we may pass it by. The numbers, however, are evidently wrong. Fifty thousand men would imply a population of 250,000 people, whereas Jerusalem itself in its palmiest days never had a population of even 70,000. There were no large cities among the Israelites, but a scattered population living upon their fields, and with a few small walled towns here and there to protect them and their cattle in any sudden emergency. Kennicott, however, has satisfactorily explained the mistake. In the old way of denoting numbers by the letters of the alphabet an ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ain   =  ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 70 had been mistaken for a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nun",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with two dots   =   50,000. The Syriac has 5000, that is, a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nun",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with one dot. We must add that the Hebrew is not ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "fifty thousand and threescore and ten men,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but \"seventy men, fifty thousand men,\" without any article between, and with the smaller number first, contrary to Hebrew rule. The occasion of the calamity was probably as follows: - As the news of the return of the ark spread from mouth to mouth, the people flocked together to take part in the sacrifice. which would of course be followed by a feast. Heated thereat by wine, perhaps, and merriment, they lost all sense of reverence, and encouraged one another to look into the ark and examine its contents, though the words need not absolutely mean more than that \"they looked at the ark.\" Even so the men of Beth-shemesh, as a city of priests, must have known that death was the penalty of unhallowed gazing at holy things (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 4:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and it is more than probable that those who were smitten were priests, because in them it would be a heinous sin; for it was a repetition of that contempt for religion and its symbols which had been condemned so sternly in Eli's sons. The mere seeing of the ark was no sin, and had given the people only joy (ver. 13), but as soon as they had received it the priests ought to have covered it with a vail (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To leave it without a vail was neglectful, to pry into it was sacrilege. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Because Jehovah had smitten many of the people,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. This clause should be translated, \"because Jehovah had smitten the people with a great smiting.\" The sudden death even of seventy men in an agricultural district, especially if they were the heads of the priestly families there, would be a great and terrible calamity, enough to fill the whole place with grief. 1 Samuel 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Disposal of the Ark of God. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As the ark had brought evil upon the Philistines, so the inhabitants of Bethshemesh were also to be taught that they could not stand in their unholiness before the holy God: \"And He (God) smote among the men of Bethshemesh, because they had looked at the ark of Jehovah, and smote among the people seventy men, fifty thousand men.\" In this statement of numbers we are not only struck by the fact that the 70 stands before the 50,000, which is very unusual, but even more by the omission of the copula ו before the second number, which is altogether unparalleled. When, in addition to this, we notice that 50,000 men could not possibly live either in or round Bethshemesh, and that we cannot conceive of any extraordinary gathering having taken place out of the whole land, or even from the immediate neighbourhood; and also that the words אישׁ אלף חמשּׁים are wanting in several Hebrew MSS, and that Josephus, in his account of the occurrence, only speaks of seventy as having been killed (Ant. vi. 1, 4); we cannot come to any other conclusion than that the number 50,000 is neither correct nor genuine, but a gloss which has crept into the text through some oversight, though it is of great antiquity, since the number stood in the text employed by the Septuagint and Chaldee translators, who attempted to explain them in two different ways, but both extremely forced. Apart from this number, however, the verse does not contain anything either in form or substance that could furnish occasion for well-founded objections to its integrity. The repetition of ויּך simply resumes the thought that had been broken off by the parenthetical clause יי בּארון ראוּ כּי; and בּעם is only a general expression for שׁ בּאנשׁי ב. The stroke which fell upon the people of Bethshemesh is sufficiently accounted for in the words, \"because they had looked,\" etc. There is no necessity to understand these words, however, as many Rabbins do, as signifying \"they looked into the ark,\" i.e., opened it and looked in; for if this had been the meaning, the opening would certainly not have been passed over without notice. ראה with ב means to look upon or at a thing with lust or malicious pleasure; and here it no doubt signifies a foolish staring, which was incompatible with the holiness of the ark of God, and was punished with death, according to the warning expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 4:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This severe judgment so alarmed the people of Bethshemesh, that they exclaimed, \"Who is able to stand before Jehovah, this holy God!\" Consequently the Bethshemeshites discerned correctly enough that the cause of the fatal stroke, which had fallen upon them, was the unholiness of their own nature, and not any special crime which had been committed by the persons slain. They felt that they were none of them any better than those who had fallen, and that sinners could not approach the holy God. Inspired with this feeling, they added, \"and to whom shall He go away from us?\" The subject to יעלה is not the ark, but Jehovah who had chosen the ark as the dwelling-place of His name. In order to avert still further judgments, they sought to remove the ark from their town. They therefore sent messengers to Kirjath-jearim to announce to the inhabitants the fact that the ark had been sent back by the Philistines, and to entreat them to fetch it away. ",
        "children": []
      }
    ]
  }
]