[{"num":9,"verse":"O Israel, rejoice no more as others do, for you have deserted your God and sacrificed to other gods on every threshing floor."},{"num":2,"verse":"Therefore your harvests will be small; your grapes will blight upon the vine."},{"num":3,"verse":"You may no longer stay here in this land of God; you will be carried off to Egypt and Assyria and live there on scraps of food. "},{"num":4,"verse":"There, far from home, you are not allowed to pour out wine for sacrifice to God. For no sacrifice that is offered there can please him; it is polluted, just as food of mourners is; all who eat such sacrifices are defiled. They may eat this food to feed themselves, but may not offer it to God. "},{"num":5,"verse":"What then will you do on holy days, on days of feasting to the Lord, "},{"num":6,"verse":"when you are carried off to Assyria as slaves? Who will inherit your possessions left behind? Egypt will! She will gather your dead; Memphis will bury them. And thorns and thistles will grow up among the ruins."},{"num":7,"verse":"The time of Israel’s punishment has come; the day of recompense is almost here, and soon Israel will know it all too well. “The prophets are crazy”; “The inspired men are mad.” Yes, so they mock, for the nation is weighted with sin and shows only hatred for those who love God."},{"num":8,"verse":"“I appointed the prophets to guard my people, but the people have blocked them at every turn and publicly declared their hatred, even in the Temple of the Lord. "},{"num":9,"verse":"The things my people do are as depraved as what they did in Gibeah long ago. The Lord does not forget. He will surely punish them."},{"num":10,"verse":"“O Israel, how well I remember those first delightful days when I led you through the wilderness! How refreshing was your love! How satisfying, like the early figs of summer in their first season! But then you deserted me for Baal-peor, to give yourselves to other gods, and soon you were as foul as they. "},{"num":11,"verse":"The glory of Israel flies away like a bird, for your children will die at birth, or perish in the womb, or never even be conceived. "},{"num":12,"verse":"And if your children grow, I will take them from you; all are doomed. Yes, it will be a sad day when I turn away and leave you alone.”"},{"num":13,"verse":"In my vision I have seen the sons of Israel doomed. The fathers are forced to lead their sons to slaughter. "},{"num":14,"verse":"O Lord, what shall I ask for your people? I will ask for wombs that don’t give birth, for breasts that cannot nourish."},{"num":15,"verse":"“All their wickedness began at Gilgal; there I began to hate them. I will drive them from my land because of their idolatry. I will love them no more, for all their leaders are rebels. "},{"num":16,"verse":"Ephraim is doomed. The roots of Israel are dried up; she shall bear no more fruit. And if she gives birth, I will slay even her beloved child.”"},{"num":17,"verse":"My God will destroy the people of Israel because they will not listen or obey. They will be wandering Jews, homeless among the nations."}]