[{"header":"Apostles of Christ"},{"num":4,"verse":"You should think of us as Christ's servants, who have been put in charge of God's secret truths. "},{"num":2,"verse":"The one thing required of such servants is that they be faithful to their master. "},{"num":3,"verse":"Now, I am not at all concerned about being judged by you or by any human standard; I don't even pass judgment on myself. "},{"num":4,"verse":"My conscience is clear, but that does not prove that I am really innocent. The Lord is the one who passes judgment on me. "},{"num":5,"verse":"So you should not pass judgment on anyone before the right time comes. Final judgment must wait until the Lord comes; he will bring to light the dark secrets and expose the hidden purposes of people's minds. And then all will receive from God the praise they deserve."},{"num":6,"verse":"For your sake, my friends, I have applied all this to Apollos and me, using the two of us as an example, so that you may learn what the saying means, “Observe the proper rules.” None of you should be proud of one person and despise another. "},{"num":7,"verse":"Who made you superior to others? Didn't God give you everything you have? Well, then, how can you boast, as if what you have were not a gift?"},{"num":8,"verse":"Do you already have everything you need? Are you already rich? Have you become kings, even though we are not? Well, I wish you really were kings, so that we could be kings together with you. "},{"num":9,"verse":"For it seems to me that God has given the very last place to us apostles, like people condemned to die in public as a spectacle for the whole world of angels and of human beings. "},{"num":10,"verse":"For Christ's sake we are fools; but you are wise in union with Christ! We are weak, but you are strong! We are despised, but you are honored! "},{"num":11,"verse":"To this very moment we go hungry and thirsty; we are clothed in rags; we are beaten; we wander from place to place; "},{"num":12,"verse":"we wear ourselves out with hard work. When we are cursed, we bless; when we are persecuted, we endure; "},{"num":13,"verse":"when we are insulted, we answer back with kind words. We are no more than this world's garbage; we are the scum of the earth to this very moment!"},{"num":14,"verse":"I write this to you, not because I want to make you feel ashamed, but to instruct you as my own dear children. "},{"num":15,"verse":"For even if you have ten thousand guardians in your Christian life, you have only one father. For in your life in union with Christ Jesus I have become your father by bringing the Good News to you. "},{"num":16,"verse":"I beg you, then, to follow my example. "},{"num":17,"verse":"For this purpose I am sending to you Timothy, who is my own dear and faithful son in the Christian life. He will remind you of the principles which I follow in the new life in union with Christ Jesus and which I teach in all the churches everywhere."},{"num":18,"verse":"Some of you have become proud because you have thought that I would not be coming to visit you. "},{"num":19,"verse":"If the Lord is willing, however, I will come to you soon, and then I will find out for myself the power which these proud people have, and not just what they say. "},{"num":20,"verse":"For the Kingdom of God is not a matter of words but of power. "},{"num":21,"verse":"Which do you prefer? Shall I come to you with a whip, or in a spirit of love and gentleness?"}]