[{"header":"Servants of Christ"},{"num":4,"verse":"Think of us as servants who are owned by Christ. It is our job to share the secrets of God. "},{"num":2,"verse":"A servant must be faithful to his owner. This is expected of him. "},{"num":3,"verse":"It is not the most important thing to me what you or any other people think of me. Even what I think of myself does not mean much. "},{"num":4,"verse":"As for me, my heart tells me I am not guilty of anything. But that does not prove I am free from guilt. It is the Lord Who looks into my life and says what is wrong. "},{"num":5,"verse":"Do not be quick to say who is right or wrong. Wait until the Lord comes. He will bring into the light the things that are hidden in men’s hearts. He will show why men have done these things. Every man will receive from God the thanks he should have."},{"num":6,"verse":"Christian brothers, I have used Apollos and myself to show you what I am talking about. This is to help you so you will not think more of men than what God’s Word will allow. Never think more of one of God’s servants than another. "},{"num":7,"verse":"Who made you better than your brother? Or what do you have that has not been given to you? If God has given you everything, why do you have pride? Why do you act as if He did not give it to you? "},{"num":8,"verse":"You are full. You are rich. You live like kings and we do not. I wish you were kings and we could be leaders with you. "},{"num":9,"verse":"I think that God has made a show of us missionaries. We are the last and the least among men. We are like men waiting to be put to death. The whole world, men and angels alike, are watching us. "},{"num":10,"verse":"We are thought of as fools because of Christ. But you are thought of as wise Christians! We are weak. You are strong. People respect you. They have no respect for us. "},{"num":11,"verse":"To this hour we are hungry and thirsty, and our clothes are worn out. People hurt us. We have no homes."},{"num":12,"verse":"We work with our hands to make a living. We speak kind words to those who speak against us. When people hurt us, we say nothing. "},{"num":13,"verse":"When people say bad things about us, we answer with kind words. People think of us as dirt that is worth nothing and as the worst thing on earth to this day."},{"header":"Follow Paul’s Way of Life"},{"num":14,"verse":"I do not write these things to shame you. I am doing this to help you know what you should do. You are my much-loved children. "},{"num":15,"verse":"You may have 10,000 Christian teachers. But remember, I am the only father you have. You became Christians when I preached the Good News to you. "},{"num":16,"verse":"So I ask you with all my heart to follow the way I live. "},{"num":17,"verse":"For this reason I have sent Timothy to you. He is my much-loved child and a faithful Christian. He will tell you how I act as a Christian. This is the kind of life I teach in the churches wherever I go."},{"num":18,"verse":"Some of you are full of pride. You think that I am not coming to visit you. "},{"num":19,"verse":"If the Lord wants me to, I will come soon. I will find out when I come if these proud people have God’s power, or if they just use a lot of big words. "},{"num":20,"verse":"The holy nation of God is not made up of words. It is made up of power. "},{"num":21,"verse":"What do you want? Do you want me to come with a stick to whip you? Or do you want me to come with love and a gentle spirit?"}]