[{"num":4,"verse":"So Apollos and I should be looked upon as Christ’s servants who distribute God’s blessings by explaining God’s secrets. "},{"num":2,"verse":"Now the most important thing about a servant is that he does just what his master tells him to. "},{"num":3,"verse":"What about me? Have I been a good servant? Well, I don’t worry over what you think about this or what anyone else thinks. I don’t even trust my own judgment on this point. "},{"num":4,"verse":"My conscience is clear, but even that isn’t final proof. It is the Lord himself who must examine me and decide."},{"num":5,"verse":"So be careful not to jump to conclusions before the Lord returns as to whether someone is a good servant or not. When the Lord comes, he will turn on the light so that everyone can see exactly what each one of us is really like, deep down in our hearts. Then everyone will know why we have been doing the Lord’s work. At that time God will give to each one whatever praise is coming to him."},{"num":6,"verse":"I have used Apollos and myself as examples to illustrate what I have been saying: that you must not have favorites. You must not be proud of one of God’s teachers more than another. "},{"num":7,"verse":"What are you so puffed up about? What do you have that God hasn’t given you? And if all you have is from God, why act as though you are so great, and as though you have accomplished something on your own?"},{"num":8,"verse":"You seem to think you already have all the spiritual food you need. You are full and spiritually contented, rich kings on your thrones, leaving us far behind! I wish you really were already on your thrones, for when that time comes you can be sure that we will be there, too, reigning with you. "},{"num":9,"verse":"Sometimes I think God has put us apostles at the very end of the line, like prisoners soon to be killed, put on display at the end of a victor’s parade, to be stared at by men and angels alike."},{"num":10,"verse":"Religion has made us foolish, you say, but of course you are all such wise and sensible Christians! We are weak, but not you! You are well thought of, while we are laughed at. "},{"num":11,"verse":"To this very hour we have gone hungry and thirsty, without even enough clothes to keep us warm. We have been kicked around without homes of our own. "},{"num":12,"verse":"We have worked wearily with our hands to earn our living. We have blessed those who cursed us. We have been patient with those who injured us. "},{"num":13,"verse":"We have replied quietly when evil things have been said about us. Yet right up to the present moment we are like dirt underfoot, like garbage."},{"num":14,"verse":"I am not writing about these things to make you ashamed, but to warn and counsel you as beloved children. "},{"num":15,"verse":"For although you may have ten thousand others to teach you about Christ, remember that you have only me as your father. For I was the one who brought you to Christ when I preached the Gospel to you. "},{"num":16,"verse":"So I beg you to follow my example and do as I do."},{"num":17,"verse":"That is the very reason why I am sending Timothy—to help you do this. For he is one of those I won to Christ, a beloved and trustworthy child in the Lord. He will remind you of what I teach in all the churches wherever I go."},{"num":18,"verse":"I know that some of you will have become proud, thinking that I am afraid to come to deal with you. "},{"num":19,"verse":"But I will come, and soon, if the Lord will let me, and then I’ll find out whether these proud men are just big talkers or whether they really have God’s power. "},{"num":20,"verse":"The Kingdom of God is not just talking; it is living by God’s power. "},{"num":21,"verse":"Which do you choose? Shall I come with punishment and scolding, or shall I come with quiet love and gentleness?"}]