[{"num":35,"verse":"The word of Adonai came to me: "},{"num":2,"verse":"“Human being, turn your face against Mount Se‘ir; prophesy against it, "},{"num":3,"verse":"and say that Adonai Elohim says, ‘I am against you, Mount Se‘ir. I will stretch out my hand against you and make you utterly desolate. "},{"num":4,"verse":"I will make your cities ruins and make you an utter waste, and you will know that I am Adonai. "},{"num":5,"verse":"Because of your long-standing hatred, you put the people of Isra’el to the sword at their time of calamity, at the time of final iniquity. "},{"num":6,"verse":"Therefore, as I live,’ Adonai Elohim swears, ‘I will prepare you for blood. Blood will pursue you. You intensely hate your own blood [relatives]; therefore blood will pursue you. "},{"num":7,"verse":"Yes, I will make Mount Se‘ir utterly desolate, cutting off from it anyone passing through or returning. "},{"num":8,"verse":"I will fill his mountains with his slain; in your hills and valleys and in all your ravines will fall those slain by the sword. "},{"num":9,"verse":"I will turn you into perpetual ruins; your cities will not return; and you will know that I am Adonai."},{"num":10,"verse":"“‘Because you say, “These two nations, these two countries, will be mine; we will take possession of them,” even though Adonai is there; "},{"num":11,"verse":"therefore, as I live,’ swears Adonai Elohim, ‘I will deal with you as your anger and envy arising from your hatred deserve; and I will make myself known among them when I judge you. "},{"num":12,"verse":"You will know that I, Adonai, have heard all your blasphemous talk against the mountains of Isra’el, such as, “They are desolated, they are given to us to devour.” "},{"num":13,"verse":"Moreover, you have boasted against me with your mouths, speaking more and more against me — I have heard it.’ "},{"num":14,"verse":"Here is what Adonai Elohim says: ‘To the joy of all the land, I will desolate you. "},{"num":15,"verse":"Since you rejoiced over possessing the house of Isra’el, because it was desolate, that is what I will do to you — you will be desolate, Mount Se‘ir and all Edom, all of it. Then they will know that I am Adonai.’"}]