[[],[{"type":"header","content":"The Flying Scroll"},{"type":"prose","content":"Again I looked up, and I saw a scroll flying ! "}],[{"type":"prose","content":"And the angel said to me, “What do you see?” And I answered, “I see a flying scroll; its length is twenty cubits (thirty feet) and its width is ten cubits (fifteen feet).” "}],[{"type":"prose","content":"Then he said to me, “This is the curse that is going out over the face of the whole land; for everyone who steals will be cut off according to the writing on one side, and everyone who swears [oaths falsely] shall be cut off according to the writing on the other side. "}],[{"type":"prose","content":"I will send the curse out,” declares the  of hosts, “and it will enter the house of the thief and the house of the one who swears falsely by My name; and it will spend the night in that house and consume it, both its timber and its stones.”"}],[{"type":"prose","content":"Then the angel who was speaking with me came forward and said to me, “Now look up and see what this is going forth.” "}],[{"type":"prose","content":"And I said, “What is it?” And he said, “This is the ephah (grain basket) going forth. This,” he continued, “is their appearance throughout the land "}],[{"type":"prose","content":"and behold, a [round, flat] lead cover was lifted up; and there sat a woman inside the ephah.” "}],[{"type":"prose","content":"Then he said, “This is Wickedness (Godlessness)!” And he threw her back down into the middle of the ephah and threw the lead cover on its opening. "}],[{"type":"prose","content":"Then I looked up, and there were two women coming out with the wind in their wings; and they had wings like the wings of a stork, and they lifted up the ephah between the earth and the heavens. "}],[{"type":"prose","content":"I said to the angel who was speaking with me, “Where are they taking the ephah?” "}],[{"type":"prose","content":"And he said to me, “To the land of Shinar (Babylon) to build a temple for her; and when it is prepared, she shall be set there on her own pedestal.”"}]]