[[],[{"type":"header","content":"The Flying Scroll"},{"type":"prose","content":"Then I raised my eyes again and looked, and behold,  a flying scroll."}],[{"type":"prose","content":"And he said to me, “What do you see?” And I said, “I see a flying scroll; its length is twenty cubits, and its width ten cubits.”"}],[{"type":"prose","content":"Then he said to me, “This is the curse that is going forth over the face of the entire land; everyone who steals certainly will be purged away according to the writing on one side, and everyone who swears  will be purged away according to the writing on the other side."}],[{"type":"prose","content":"I will make it go forth,” declares the LORD of armies, “and it will enter the house of the thief and the house of the one who swears falsely by My name; and it will spend the night within that house and destroy it with its timber and stones.”"}],[{"type":"prose","content":"Then the angel who had been speaking with me went out and said to me, “Now raise your eyes and see what this is that is going forth.”"}],[{"type":"prose","content":"And I said, “What is it?” Then he said, “This is the ephah going forth.” Again he said, “This is their appearance in all the land."}],[{"type":"prose","content":"And behold, a lead cover was lifted up.” , “And this is a woman sitting inside the ephah.”"}],[{"type":"prose","content":"Then he said, “This is Wickedness!” And he thrust her into the middle of the ephah and threw the lead weight on its opening."}],[{"type":"prose","content":"Then I raised my eyes and looked, and there two women were coming out with the wind in their wings; and they had wings like the wings of the stork, and they lifted up the ephah between the earth and the heavens."}],[{"type":"prose","content":"So I said to the angel who was speaking with me, “Where are they taking the ephah?”"}],[{"type":"prose","content":"Then he said to me, “To build a temple for her in the land of Shinar; and when it is prepared, she will be set there on her own pedestal.”"}]]