[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The sheepcotes.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Thomson (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Land and the Book",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") saw, he says, hundreds of these sheepcotes around the mouth of the caves, of which there are so many in Palestine. In that land and among these Eastern peoples, whose customs change so little, they are as common now as they were then. “These sheepcotes are generally made by piling up loose stones in front of the cave’s entrance in a circular wall, which is covered with thorns as a further protection against thieves and wild animals who would prey on the sheep. During cold storms and in the night the flocks retreat into the cave, but at other times they remain in the enclosed cote. . . . These caverns are as dark as midnight, and the keenest eye cannot see four paces ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inward; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but one who has been long within, and looking ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "outward ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "toward the entrance, can observe with perfect distinctness all that takes place in that direction. David, therefore, could watch Saul as he came in . . . but Saul could see nothing but impenetrable darkness.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From this thorny fence, so universal in the countless sheepcotes of Palestine, was very possibly derived a quaint simile in the strange passage on “Death” in the Talmud:—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“The hardest of all deaths is by a disease (some suppose quinsey), which is like the forcible extraction of prickly thorns from wool. . . . The easiest of all deaths is the Divine kiss, which is like the extracting of hair from milk. Moses, Aaron, and Miriam died by this Divine kiss.”—Treatise Berachoth, fol. 8, col.1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "“The hardest of all deaths is by a disease (some suppose quinsey), which is like the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "forcible extraction of prickly thorns from wool. . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The easiest of all deaths is the Divine kiss, which is like the extracting of hair from milk. Moses, Aaron, and Miriam died by this Divine kiss.”—Treatise ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Berachoth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "fol. 8, col.1.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Where was a cave.—The well-known traveller Van de Velde wishes to identify the cave in question with an immense cavern in a rock with many side vaults, near the ruins of Chareitum; the difficulty is, however, that this vast cavern is fifteen or twenty miles from Ain-jedy. In this cave all David’s band could well have been gathered: not only his 600 fighting men, but the camp followers and women also. In Pocock we read that the Arabs call this cavern Elmaama (hiding-place), and relate how on one occasion thirty thousand people hid themselves in it to escape an evil wind (the simoom). It is, however, quite possible that the incident about to be related, connected with Saul and David, took place in one of the much smaller caves close to En-gedi. It is not necessary to assume that all David’s band were with him in one cave. A hundred or so of his more special companions were probably with him on this occasion, the remainder of the little army being dispersed in other similar refuges in the immediate neighbourhood.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Where was a cave.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The well-known traveller Van de Velde wishes to identify the cave in question with an immense cavern in a rock with many side vaults, near the ruins of Chareitum; the difficulty is, however, that this vast cavern is fifteen or twenty miles from Ain-jedy. In this cave all David’s band could well have been gathered: not only his 600 fighting men, but the camp followers and women also. In Pocock we read that the Arabs call this cavern Elmaama (hiding-place), and relate how on one occasion thirty thousand people hid themselves in it to escape an evil wind (the simoom). It is, however, quite possible that the incident about to be related, connected with Saul and David, took place in one of the much smaller caves close to En-gedi. It is not necessary to assume that ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "all ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "David’s band were with him in one cave. A hundred or so of his more special companions were probably with him on this occasion, the remainder of the little army being dispersed in other similar refuges in the immediate neighbourhood.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And Saul went in to cover his feet.—The meaning of this disputed passage is quite simple. Saul, fatigued with the morning’s march, some time about midday withdrew—probably with a very few attendants composing his personal staff—to take a short siesta, or sleep, in one of those dark, silent caves on the hill-side, which offered a cool resting-place after the glare and heat of a long and fatiguing march along the precipitous paths of the region. He lay down, no doubt, near the cave’s mouth, and one of his faithful attendants threw lightly over the king’s feet the royal many coloured mantle (m’il). The king and his attendants little suspected that in the dark recesses of their midday resting-place were concealed the dreaded freebooter and a great company of his devoted armed followers. As explained in the Note above, in these great rock recesses, coming from outside, from the glare of daylight, not five paces forward can be seen, but those already inside, and accustomed to the darkness, can, at a considerable distance within the cave, see distinctly all that takes place in the neighbourhood of the cavern mouth. The sharp eyes of David’s sentinels, no doubt, far in the cave, quickly saw the little party of intruders. The tall form of the king, his jewelled armour, and perhaps his many-coloured brightly-tinted cloak, betrayed to the amazed watchmen of David the rank of the wearied sleeper.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And Saul went in to cover his feet.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The meaning of this disputed passage is quite simple. Saul, fatigued with the morning’s march, some time about midday withdrew—probably with a very few attendants composing his personal staff—to take a short siesta, or sleep, in one of those dark, silent caves on the hill-side, which offered a cool resting-place after the glare and heat of a long and fatiguing march along the precipitous paths of the region. He lay down, no doubt, near the cave’s mouth, and one of his faithful attendants threw lightly over the king’s feet the royal many coloured mantle (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "m’il",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The king and his attendants little suspected that in the dark recesses of their midday resting-place were concealed the dreaded freebooter and a great company of his devoted armed followers. As explained in the Note above, in these great rock recesses, coming from ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "outside, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "from the glare of daylight, not five paces forward can be seen, but those already ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "inside, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and accustomed to the darkness, can, at a considerable distance within the cave, see distinctly all that takes place in the neighbourhood of the cavern mouth. The sharp eyes of David’s sentinels, no doubt, far in the cave, quickly saw the little party of intruders. The tall form of the king, his jewelled armour, and perhaps his many-coloured brightly-tinted cloak, betrayed to the amazed watchmen of David the rank of the wearied sleeper.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "This interpretation of the words. “Saul went in to cover his feet”—namely, “to sleep”—is adopted by the Peshito Syriac Version, Michaelis, and of late, very positively, Ewald. The ordinary interpretation of the words, besides being an unusual statement, by no means suits the narrative; for it must be remembered that considerable time was necessary for the sentinel to inform David, and for David to have approached and cut off the hem of the royal garment, and again to have retired into the recesses of the cave.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This interpretation of the words. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "“",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Saul went in to cover his feet”—namely, “to sleep”—is adopted by the Peshito Syriac Version, Michaelis, and of late, very positively, Ewald. The ordinary interpretation of the words, besides being an unusual statement, by no means suits the narrative; for it must be remembered that considerable time was necessary for the sentinel to inform David, and for David to have approached and cut off the hem of the royal garment, and again to have retired into the recesses of the cave.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the sides of the cave.—That is, in the side vaults and passages which exist in the largest of these natural refuges.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "In the sides of the cave.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—That is, in the side vaults and passages which exist in the largest of these natural refuges.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 24:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 24:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Where was a cave — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This cave being near the highway, and in the most frequented place of the wilderness, namely, near the sheep-cotes, to which the shepherds and herdsmen resorted to feed and milk their flocks, it is likely David made choice of it as being a place most unlikely to be suspected. Or, perhaps, he was pressed so near by Saul that he had no other way of escaping. That his distress and danger were very great, may be gathered from the 57th and 142d Psalms, which, it is supposed, he composed in commemoration of his deliverance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saul went in to cover his feet — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To take some rest in sleep. Being a military man, it is probable he used to sleep with his soldiers upon the ground. And it is not improbable that, being weary with his eager and almost incessant pursuit, first of David, then of the Philistines, and now of David again, he both needed and desired some sleep; God also disposing him thereto, that David might have this eminent occasion to demonstrate his integrity to Saul, and to all Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the sides of the cave — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For that there were vast caves in those parts is affirmed, not only by Josephus, but also by heathen authors; Strabo writes of one which could receive four thousand men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:1-7 God delivered Saul into David's hand. It was an opportunity given to David to exercise faith and patience. He had a promise of the kingdom, but no command to slay the king. He reasons strongly, both with himself and with his men, against doing Saul any hurt. Sin is a thing which it becomes us to startle at, and to resist temptations thereto. He not only would not do this bad thing himself, but he would not suffer those about him to do it. Thus he rendered good for evil, to him from whom he received evil for good; and was herein an example to all who are called Christians, not to be overcome of evil, but to overcome evil with good.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Remained in the sides - Rather, \"were in the sides of the cave dwelling or abiding there.\" Some of these caverns are very deep and spacious. Any one near the mouth of the cave would be visible, but those in the recesses would be quite in the dark and invisible, especially if the incident occurred at night. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 67:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to the title, was composed on this occasion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. he came to the sheepcotes—most probably in the upper ridge of Wady Chareitun. There a large cave—I am quite disposed to say the cave—lies hardly five minutes to the east of the village ruin, on the south side of the wady. It is high upon the side of the calcareous rock, and it has undergone no change since David's time. The same narrow natural vaulting at the entrance; the same huge natural chamber in the rock, probably the place where Saul lay down to rest in the heat of the day; the same side vaults, too, where David and his men were concealed. There, accustomed to the obscurity of the cavern, they saw Saul enter, while, blinded by the glare of the light outside, he saw nothing of him whom he so bitterly persecuted.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Some think ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the sheep cotes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to have been caves into which they used to drive their sheep for shelter in tempestuous weather. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To cover his feet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. to ease his belly, as this phrase is thought to be used, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Judges 3:24",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 3:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reason whereof is, because the eastern and some other nations of old wore no breeches, but loose and long coats or gowns, like those which women with us wear; but shorter, whence their feet and legs were in a great part uncovered; and sometimes other parts, which also in Scripture are designed by the name of the feet, (of which ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole \"Genesis 49:10\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole \"Deu 28:57\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 28:57",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole \"2 Kings 18:27\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole \"Isaiah 7:20\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ",) were exposed to view. But when they went to perform this office of nature, which obliged them first to lift up their garments, they afterwards disposed them so decently, that all those parts might be covered and kept out of the sight of others. But possibly the words may have another meaning, and it is not to be despised that those ancient and venerable interpreters, the Syriac and Arabic, interpret this place and phrase quite otherwise, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saul went in to sleep there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which was no uncouth thing to Saul, who being a military man, used to sleep with his soldiers upon the bare ground, as he did ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 26:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 26:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And it is not improbable that Saul, being exceeding weary with his eager and almost incessant pursuit, first of David, then of the Philistines, and now of David again, both needed and desired some sleep God also disposing him thereunto, that David might have this eminent occasion to demonstrate his integrity to Saul, and to all Israel; and, the season possibly being hot, he might choose to sleep in the cave, for the benefit of the shade. But all the question is, how it may appear that this is the meaning of this phrase, and what is the reason and ground of it? To which many things may be said. First, That this phrase is but twice used in Scripture, as far as I remember, here, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Judges 3:24",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 3:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and this sense may conveniently enough agree to both of them; nay, this sense may seem better to agree with that place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " Jud 3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for that summer parlour or summer chamber (for both seem to be the same place, and were apparently for the same use, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Judges 3:24,25",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") seems to be a place far more convenient for sleeping than for easing of nature. And the servants’ long stay and waiting for their lord seems to imply that they judged him gone to sleep, (which might take up a considerable time,) rather than to that other work, which requires but a little time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole \"Judges 3:24\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Secondly, That there are many Hebrew phrases which do confessedly signify several things, albeit the reason of such significations be now utterly unknown to us, though it was doubtless known to the ancient Hebrews. Nor need I instance in particulars, seeing it is so in all languages, and particularly in the English tongue at this day, in which the use of many proverbs and phrases is well understood, though the reason of them be now lost; which if our modern infidels, who scoff at some passages of Scripture, which they either do not or will not understand, would consider, they would lose much of their sport. Thirdly, Although there be not that clear and full proof of this sense which some may require, (though indeed it cannot be reasonably expected in a thing so ancient, and in a phrase of so concise and narrow a language as the Hebrew is, and in an expression so rarely used in Scripture,) yet there are some intimations in Scripture which may seem to favour this interpretation. For persons composing themselves to sleep in this manner, are not only noted in the general to have been ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "covered with a mantle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as is said of Sisera, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Judges 4:18,19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; but particularly they are said to have their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "feet covered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as is expressly observed concerning Boaz, when he lay down to sleep in the threshing-floor, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Ruth 3:4,7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reason whereof may possibly be this, that when they lay down to sleep in their garments, they were secured as to the other parts of their body, only their feet were open and visible; and therefore it was convenient to cover their feet, partly to prevent the inconveniences of cold, (for which reason we here take special care to cover our feet in such cases,) and partly for decency sake, lest their garments being loose and large below, should be disordered, and so their nakedness should appear, as it happened to Noah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 9:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 20:26",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 20:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And therefore it cannot seem strange or forced, if in this place Saul’s covering of his feet design his composing himself to his rest. And if this be so, then the following difficulties of this history will appear to be plain and easy. For if Saul were fast asleep, which might easily be perceived by David and his men within; then it is not strange that Saul neither heard David and his men talking of him, nor felt David when he came to cut off’ his lap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "David and his men remained in the sides of the cave; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for that there were vast caves in those parts is affirmed not only by Josephus, but also by heathen authors; and Strabo, in his 16th book, writes of one which could receive four thousand men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he came to the sheepcotes by the way, where was a cave,.... For the sheep to be led into at noon, to shelter them from the heat: such was the cave of Polyphemus, observed by Bochart (z), in which sheep and goats lay down and slept; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Saul went in to cover his feet; the Targum is, to do his necessaries; and so Josephus (a); and the Jewish commentators generally understand it of easing nature; and as the eastern people used to wear long and loose garments, these, when they performed such an action, they used in modesty to gather them close about them, that no part of the body, their feet, and especially the parts of nature which should be concealed, might be seen; but the Syriac and Arabic versions render it, \"and there he lay\" or \"slept\"; which suggest, that his going into the cave was in order to take some sleep and rest, when it was usual to cover the feet, both to prevent taking cold, and the private parts of the body being exposed to view; and this accounts better for Saul not hearing David's men in the cave, and for his being insensible of David's cuttings off the skirt of his garment, and best agrees with the use of the phrase in Judges 3:24; the only place besides this in which it is used; See Gill on Judges 3:24, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Saul went in to cover his feet; the Targum is, to do his necessaries; and so Josephus (a); and the Jewish commentators generally understand it of easing nature; and as the eastern people used to wear long and loose garments, these, when they performed such an action, they used in modesty to gather them close about them, that no part of the body, their feet, and especially the parts of nature which should be concealed, might be seen; but the Syriac and Arabic versions render it, \"and there he lay\" or \"slept\"; which suggest, that his going into the cave was in order to take some sleep and rest, when it was usual to cover the feet, both to prevent taking cold, and the private parts of the body being exposed to view; and this accounts better for Saul not hearing David's men in the cave, and for his being insensible of David's cuttings off the skirt of his garment, and best agrees with the use of the phrase in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the only place besides this in which it is used; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and David and his men remained in the sides of the cave; unseen and unobserved by Saul, even six hundred of them; nor need this seem strange, since in those parts of the world there were caves exceeding large, made so either by nature or art. Vansleb (b) speaks of a cave in Egypt so extraordinary large, that, without hyperbole, a thousand horses might there draw up in battle array, and of another larger than that; and Strabo says (c), that towards Arabia and Iturea are mountains difficult to be passed, and in which are deep caves, one of which would hold four thousand men: and as the mouths of these caves were generally narrow, and the further parts of them large, and also dark, persons at the entrance of them could be seen, when those in the more remote parts could not; and this cave is said to be extremely dark (d); which accounts for Saul's being seen when he came into the cave, whereas David and his men could not be seen by him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Hierozoic. par. 1. l. 2. c. 45. col. 467, 468. (a) Antiqu. l. 6. c. 13. sect. 4. (b) Relation of a Voyage, p. 227. (c) Geograph. l. 16. p. 520. (d) Le Bruyn's Voyage to the Levant, ch. 51. p. 199. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Hierozoic. par. 1. l. 2. c. 45. col. 467, 468. (a) Antiqu. l. 6. c. 13. sect. 4. (b) Relation of a Voyage, p. 227. (c) Geograph. l. 16. p. 520. (d) Le Bruyn's Voyage to the Levant, ch. 51. p. 199. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he came to the sheepcotes by the way, where was a cave; and Saul went in to cover his feet: and David and his men remained in the sides of the cave.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the sheepcotes by the way",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Sheepfolds are still formed in the East by building a wall of loose stones round the mouth of a cave, which serves for shelter in case of bad weather. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Land and the Book",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 603.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to cover his feet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] An euphemism for performing the necessities of nature.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "remained",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Were abiding in the recesses of the cave.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Large caves with numerous side passages are found in the district. “They are as dark as midnight, and the keenest eye cannot see five paces ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": but one who has been long within, and is looking ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "outward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " toward the entrance, can observe with perfect distinctness all that takes place in that direction.” Hence David and his men could watch Saul without being seen.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He came to the sheepcotes.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rather, \"to sheepcotes,\" there being no article in the Hebrew. Such sheepcotes were common in Palestine; for Thomson (p. 603) says, \"I have seen hundreds of these sheepcotes around the mouth of caverns, and indeed there is scarcely a cave in the land, whose location will admit of being thus occupied (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the flocks), but has such a \"cote\" in front of it, generally made by piling up loose stones into a circular wall, which is covered with thorns, as a further protection against robbers and wild beasts. During cold storms, and in the night, the flocks retreat into the cave, but at other times they remain in this enclosed cote .... These caverns are as dark as  midnight, and the keenest eye cannot see five paces ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "inward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but one who has been long within, and is looking ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "outward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " toward the entrance, can observe with perfect distinctness all that takes place in that direction. David, therefore, could watch Saul as he came in, and notice the exact place where he \"covered his feet,\" while Saul could see nothing but \"impenetrable darkness.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To cover his feet.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Syriac understands this of sleeping; more correctly the Vulgate and Chaldee take it as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", margin. 1 Samuel 24:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Saul came to the sheep-folds by the way, where there was a cave, he entered it to cover his feet, whilst David and his men sat behind in the cave. V. de Velde (R. ii. p. 74) supposes the place, where the sheep-folds by the roadside were, to have been the Wady Chareitun, on the south-west of the Frank mountain, and to the north-east of Tekoah, a very desolate and inaccessible valley. \"Rocky, precipitous walls, which rise up one above another for many hundred feet, form the sides of this defile. Stone upon stone, and cliff above cliff, without any sign of being habitable, or of being capable of affording even a halting-place to anything but wild goats.\" Near the ruins of the village of Chareitun, hardly five minutes' walk to the east, there is a large cave or chamber in the rock, with a very narrow entrance entirely concealed by stones, and with many side vaults in which the deepest darkness reigns, at least to any one who has just entered the limestone vaults from the dazzling light of day. It may be argued in favour of the conjecture that this is the cave which Saul entered, and at the back of which David and his men were concealed, that this cave is on the road from Bethlehem to Ain-jidy, and one of the largest caves in that district, if not the largest of all, and that, according to Pococke (Beschr. des Morgenl. ii. p. 61), the Franks call it a labyrinth, the Arabs Elmaama, i.e., hiding-place, whilst the latter relate how at one time thirty thousand people hid themselves in it \"to escape an evil wind,\" in all probability the simoom. The only difficulty connected with this supposition is the distance from Ain-jidy, namely about four or five German miles (fifteen or twenty English), and the nearness of Tekoah, according to which it belongs to the desert of Tekoah rather than to that of Engedi. \"To cover his feet\" is a euphemism according to most of the ancient versions, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for performing the necessities of nature, as it is a custom in the East to cover the feet. It does not mean \"to sleep,\" as it is rendered in this passage in the Peschito, and also by Michaelis and others; for although what follows may seem to favour this, there is apparently no reason why any such euphemistic expression should have been chosen for sleep. \"The sides of the cave:\" i.e., the outermost or farthest sides.",
        "children": []
      }
    ]
  }
]