[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold the day of which the Lord said unto thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This was the version by David’s men of such predictions as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 15:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 16:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jonathan’s words (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 20:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") show clearly that these predictions were known; and the version of them here given was a very natural one in the mouth of David’s men (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Speaker’s Commentary",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is, however, quite possible that a prophet such as Gad had predicted publicly, in the hearing of David’s band of followers, that the days would come when their now outlawed captain, the son of Jesse, the “Anointed of Jehovah”—all his enemies being overthrown—would reign in peace and glory over all the land.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Then David arose.—For a moment the “king to be” listened to the seductive voice of the tempter; and we may imagine him, with the sword of Goliath naked in his hand, advancing towards his unconscious adversary, sleeping in the cave’s mouth, resolved with one good blow to end the long, cruel war, and then, his great rival being gone, to seat himself at once on the empty throne which he knew the Eternal meant him one day to occupy—but only for a moment; for through the soul of David rapidly passed the thought that the helpless sleeping one was, after all, the “Anointed of Jehovah.” How could he, himself “an anointed king,” touch another of the same order to do him harm? So with a matchless generosity, unequalled, indeed, in those rough days, he spared the man who so ruthlessly and so often had sought his life, and even at that moment, with all the power of the land, was trying to do him to death; and David the outlaw bent over the sleeping king who hated him with so deep a hate, and deftly cut off the skirt, perhaps some of the golden fringe which edged the royal m’il, and as he bent over him, and saw once more the face of Saul—from whose brow so often his minstrelsy had chased the dark clouds of madness—we can fancy the son of Jesse once more loving the great hero of his boyhood: loving him as he did in the old days when he played in the king’s dark hours.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Then David arose.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—For a moment the “king to be” listened to the seductive voice of the tempter; and we may imagine him, with the sword of Goliath naked in his hand, advancing towards his unconscious adversary, sleeping in the cave’s mouth, resolved with one good blow to end the long, cruel war, and then, his great rival being gone, to seat himself at once on the empty throne which he knew the Eternal meant him one day to occupy—but only for a moment; for through the soul of David rapidly passed the thought that the helpless sleeping one was, after all, the “Anointed of Jehovah.” How could he, himself “an anointed king,” touch another of the same order to do him harm? So with a matchless generosity, unequalled, indeed, in those rough days, he spared the man who so ruthlessly and so often had sought ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "his ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "life, and even at that moment, with all the power of the land, was trying to do him to death; and David the outlaw bent over the sleeping king who hated him with so deep a hate, and deftly cut off the skirt, perhaps some of the golden fringe which edged the royal ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "m’il, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and as he bent over him, and saw once more the face of Saul—from whose brow so often his minstrelsy had chased the dark clouds of madness—we can fancy the son of Jesse once more loving the great hero of his boyhood: loving him as he did in the old days when he played in the king’s dark hours.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There is no doubt but that one of the most beautiful characteristics of David’s many-sided nature, was this enduring loyalty to Saul and to Saul’s house. No jealousy, or even bitter injuries done in after years could affect the old love, the old feeling of loyal reverence, the more than filial affection; it was even proof against time. Years after Saul was in his grave. David gave the most conspicuous proof of his faithful memory of his old, devoted friendship for Saul and his house, when he pardoned Mephibosheth, the grandson of Saul, for his more than suspected treason, in the matter of the revolt of Absalom, and restored to him a large portion of his forfeited lands (2Samuel 19:24-29).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There is no doubt but that one of the most beautiful characteristics of David’s many-sided nature, was this enduring loyalty to Saul and to Saul’s house. No jealousy, or even bitter injuries done in after years could affect the old love, the old feeling of loyal reverence, the more than filial affection; it was even proof against time. Years after Saul was in his grave. David gave the most conspicuous proof of his faithful memory of his old, devoted friendship for Saul and his house, when he pardoned Mephibosheth, the grandson of Saul, for his more than suspected treason, in the matter of the revolt of Absalom, and restored to him a large portion of his forfeited lands (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Samuel 19:24-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "LOVE FOR HATE, THE TRUE QUID PRO QUO1 Samuel 24:4 - 1 Samuel 24:17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "LOVE FOR HATE, THE TRUE QUID PRO QUO",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 24:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 24:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " A sudden Philistine invasion had saved David, when hard pressed by Saul, and had given him the opportunity of flight to the wild country on the west of the Dead Sea, near the place where En-Gedi {‘the Fountain of the Wild Goat’} sparkles into light on the hill above the weird lake. In these savage gorges Saul’s three thousand men would be of little use against the light-footed outlaw and his troop. The whole district is seamed with ravines, and these are honeycombed with great caverns, where dangerous outcasts still lurk and defy capture. Travellers go into raptures over the beauty of some of these ‘fairy grottoes’ draped with maiden-hair fern, cool and moist, and blessedly dark after the fierce light outside. In some one of these the beautiful story which makes our lesson occurred.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. We have the scene in the cave. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The interior would be black as night to one looking inward with eyes fresh from the blinding glare of such sunlight upon limestone, but it would hold a glimmering twilight for one looking outward, with eyes accustomed to the gloom. David and his men, keeping close to the walls and hiding behind angles, might well be unobserved by Saul at the mouth, and probably never looking in at all. How vividly the whispered eagerness of the outcasts round David is reproduced! They think it would be ‘tempting Providence’ to let such a chance slip. They put a religious varnish on their advice. It would be almost impious not to kill Saul, for here was the hand of God evidently fulfilling a prophecy! There may have been some unrecorded prediction of the sort which they seem to quote; but more probably they are only referring to David’s designation to the crown, which they had come to know. It never struck them as possible that it could ‘seem good’ to a wise man not to cut his enemy’s throat when he could do it without danger to himself. So they would watch David stealing down quietly to the place where the unconscious king was crouching, and getting close behind him, knife in hand. How disgusted they must have been when the blade, that flashed for a moment in the light at the cave’s mouth, was not buried in Saul’s great back, but only hacked off the end of his robe spread out behind him! No personal animosity was in David. However he had been driven to consort with outlaws, and to live a kind of freebooter’s life, his natural sweetness was unspoiled, and was reinforced by solemn veneration for the sanctity of the Lord’s anointing, which he reverenced all the more because himself had received it. He clambered back to his disappointed men, and, as soon as he was up in the dark again, his chivalry and his religion made him ashamed of his coarse practical jest. The humour of the thing had tempted him to do it; but it was a rude insult, which lowered him more than it did Saul, and, like a true man, he blushes there in the gloom at what he has done. Then he has to defend himself to his men for not coming up to their expectations, and he does it by insisting on the sacredness which still surrounded Saul as ‘the Lord’s anointed.’ David knew that the unhappy king had been rejected and forsaken by ‘the Spirit of the Lord,’ and that he himself was the true bearer of the regal unction; but he will not take the law into his own hands, and still regards Saul as his ‘lord.’ He sets the example, much needed by us all, of leaving God to carry out His purposes at His own time, and patiently waiting till that time comes. He had hard work to keep his men from rushing down on the king; but, having commanded himself, is able to restrain them. How many virtues may be in exercise in one action! Here we have generosity, clemency, sensitiveness of conscience, reverence, self-abnegation, patience, loyalty, firmness, sway over lower natures for high ends,-a whole constellation shining star-like in the dark cavern.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We have, next, David’s pathetic remonstrance.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Saul was alone, and David could easily escape among the cliffs, if the king summoned his men; but he risks capture, in the gush of ancient friendship. His words are full of nobleness, and his silence is no less so. He has no reproaches, no anger nor hate. He will not even suppose that Saul has followed his own impulses in his persecution, but assumes that he has been led astray by calumnies. He points to the fragment of Saul’s robe in his hand as the disproof of the lie that he had designs against him, and passionately asserts his innocence now and in all the past. He compares himself to some timid wild thing, like one of the goats among the cliffs, and Saul to a hunter. He solemnly calls God to judge between them, and appeals from the slanders and misjudgings of men to the perfect tribunal of God, to whom he commits his cause. He abjures all intention of striking at Saul in his own defence. He quotes, in true Eastern manner, a scrap of proverbial wisdom, which contains the homely truth that character determines action; for it needs a wicked man to do a wicked thing, and he implies that he is not wicked, and that Saul knows that well enough,-by what has just happened, if by nothing else. Then he puts his own insignificance and the disproportion between him and his ragged band and the imposing force of Saul in vivid light by his half-humorous and wholly humble description of himself as a ‘dead dog,’ and a ‘flea’; as harmless as the one, as hard to catch as the other, as little important as either. Finally, he reiterates his devout reference of the whole cause to God, and his fixed resolution to take no steps to right himself, but to leave all to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So ought we to deal with slanders and enmity. The eternal law for us in all opposition and hostility is enshrined in David’s noble words and deeds. To repay evil with benefits, to abstain from retaliation when it is in our power, to keep our tongues from bitter and wounding words, to appeal to the adversary’s better self, even at the cost of our own ‘dignity,’-all that is not easy nor usual among professing Christians. But it ought to be. David’s Lord, ‘when He suffered, threatened not; but committed Himself to Him that judgeth righteously.’ We are poor followers of Him, if David surpasses us in patience and magnanimity. It has taken nineteen hundred years to teach us that passive endurance is more heroic than fighting for our own hand, and that repaying scorn and hate with their like is less noble than meeting them with endless forgiveness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is all but universally regarded as David’s, and as belonging to this period. In it we find a clause, ‘I have delivered him that without cause was mine enemy,’ which may fairly he supposed to refer to the scene in the cave, and we read the same vehement protestations of innocence, the same figure of himself as a hunted wild animal, the same appeal to God’s judgment, as in his remonstrance with Saul. The psalm is the poetic echo of our lesson.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. We have the momentary melting of Saul’s heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He breaks into passionate weeping. With that sudden flashing out into vehement emotion, so characteristic of him throughout, and, in these latter days of his life, so significant of enfeebled self-control, he recognises David’s generous forbearance in its contrast to his own hate, which, for the moment, he feels to be causeless. There is a piteous remembrance of the days when David soothed him by song, in his mention of the sweet ‘voice,’ and some rekindling of ancient love in his calling him ‘My son.’ Then follow the sad words which confess the hopelessness of his struggle against the divine purpose, and his appeal for mercy to his house. The picture may well move solemn thoughts and pity for that scathed and solitary soul, seeing for a moment, as by a lightning flash, the madness of his course, and yet held so fast in the grip of his dark passions that he cannot shake off their tyranny.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Two great lessons are taught by that tragic figure of the weeping and yet unchanged king. One is of the power of forbearing gentleness to exorcise hate. The true way to ‘overcome evil’ is to melt it by fiery coals of gentleness. That is God’s way. An iceberg may be crushed to powder, but every fragment is still ice. Only sunshine that melts it will turn it into sweet water. Love is conqueror, and the only conqueror, and its conquest is to transform hate into love. The other lesson is the worthlessness of mere feeling, which by its very nature passes away, and, like unstored rain, leaves the rock in its obstinate hardness more exposed. Saul only increased his guilt by reason of the fleeting glimpse of his folly which he did not follow up; and our gleams of insight into some sin and madness of ours but add to our responsibility. Emotion which does not lead to action hardens the heart, and adds to our guilt and condemnation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 24:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 24:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The men of David said unto him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The cave being very large, and David and his men at the further end of it, they might see Saul by the light of the entrance, without his seeing them, and might whisper together what follows without being heard. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord said unto thee, Behold, I will deliver, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — We do not read anywhere that God said these very words, or made a promise to deliver Saul into David’s hands. But they put this construction on what Samuel had said about taking the kingdom from Saul and giving it to David, and on those promises which God had made to him of delivering him from all his enemies, and carrying him through all difficulties to the throne. These promises, they conceived, laid him under an obligation of taking all opportunities which God put into his hands for their accomplishment. Add to this, that, having a desire to return to their own habitations, and also to have preferment under David, they wished him to seize this occasion which now presented itself of destroying his enemy, and advancing himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then David arose and cut off the skirt of Saul’s robe privily — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which he might easily do, as he was asleep.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:1-7 God delivered Saul into David's hand. It was an opportunity given to David to exercise faith and patience. He had a promise of the kingdom, but no command to slay the king. He reasons strongly, both with himself and with his men, against doing Saul any hurt. Sin is a thing which it becomes us to startle at, and to resist temptations thereto. He not only would not do this bad thing himself, but he would not suffer those about him to do it. Thus he rendered good for evil, to him from whom he received evil for good; and was herein an example to all who are called Christians, not to be overcome of evil, but to overcome evil with good.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The day of which the Lord said ... - This was the version by David's men of such divine predictions as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 16:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jonathan's words ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 20:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " show clearly that these predictions were known. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4-7. the men of David said … Behold the day of which the Lord said unto thee, Behold, I will deliver thine enemy into thine hand—God had never made any promise of delivering Saul into David's hand; but, from the general and repeated promises of the kingdom to him, they concluded that the king's death was to be effected by taking advantage of some such opportunity as the present. David steadily opposed the urgent instigations of his followers to put an end to his and their troubles by the death of their persecutor (a revengeful heart would have followed their advice, but David rather wished to overcome evil with good, and heap coals of fire upon his head); he, however, cut off a fragment from the skirt of the royal robe. It is easy to imagine how this dialogue could be carried on and David's approach to the king's person could have been effected without arousing suspicion. The bustle and noise of Saul's military men and their beasts, the number of cells or divisions in these immense caverns (and some of them far interior) being enveloped in darkness, while every movement could be seen at the cave's mouth—the probability that the garment David cut from might have been a loose or upper cloak lying on the ground, and that Saul might have been asleep—these facts and presumptions will be sufficient to account for the incidents detailed.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Quest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How came it to pass that Saul did not hear his debates of David and his men? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " First, The greater noise of Saul’s men and horses, just by the cave’s mouth, might easily drown the lesser. Secondly, There were in these large and capacious caves several cells or parts, whereof some were more inward and remote from the cave’s mouth, in which they might freely converse and discourse, and yet neither be heard nor seen by Saul, though they could easily see him, and observe all his postures and actions, because he was in the mouth of the cave. Thirdly, Saul might be asleep, as hath been discoursed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold the day of which the Lord said unto thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not that either said these words, or made any such particular promise. as some apprehend; but they put this construction upon those confessed and known promises which God had made to him, of delivering him from all his enemies, and carrying him through all hinderances and difficulties to the throne and kingdom; which promise they conceived put him under an obligation of watching and taking all opportunities which God by his providence should put into his hand for their accomplishment, whereof this was an eminent instance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "David arose, and cut off the skirt of Saul’s robe privily.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Quest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How could David do thus, and Saul not perceive it? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " First, This might be some loose and upper garment, which Saul might then lay at some distance from him, as we oft do on the same occasion. Secondly, In those vast caves there were divers particular cells and rooms, which were distinct one from another, yet so as there were secret passages from one to another, as may be gathered from the relations of historians and travellers. At the mouth of one of these, Saul might lay his upper garment; which David perceiving, and very well knowing all the cells and passages of that cave, might go some secret way to it, and cut off a little part of it. Thirdly, The noise which David’s motion might be supposed to make was but small, and that he well knew would be perfectly drowned with the far greater noise of Saul’s army, which lay at the mouth of the cave. Fourthly, The heroical actions of great men in Scripture are not to be measured by common rules. And as divers of the prophets and saints of old were in some of their actions, so David might be in this, moved to it by a secret and Divine impulse, which also gave him confidence of God’s assistance therein, and of the success of his enterprise. Fifthly, This difficulty doth perfectly vanish, if Saul was now asleep. And as no man can prove that he was not, so that he was may seem probable from what is said on ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 24:3",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 24:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the men of David said unto him,.... Some of his principal men, who were about him, and near him, such as Joab and Abishai: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "behold the day of which the Lord said unto thee: now the time was come that he spoke of to him by Samuel, or Gad, or to himself directly: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "behold, I will deliver thine enemy into thine hand; and such was Saul, as appeared by his seeking to take away his life; and now he was in the hand of David to take away his life, if he pleased: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou mayest do to him as it shall seem good unto thee; an opportunity of this kind now offered: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then David arose; from that part of the cave in which he was, the further part of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and cut off the skirt of Saul's robe privily; unawares to him, and unobserved by him, which might be easily done, if Saul was asleep, and it is probable he was; and by the same way it may be accounted for that he did not hear the discourse that passed between David and his men. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and cut off the skirt of Saul's robe privily; unawares to him, and unobserved by him, which might be easily done, if Saul was asleep, and it is probable he was; and by the same way it may be accounted for that he did not hear the discourse that passed between David and his men. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the men of David said unto him, {c} Behold the day of which the LORD said unto thee, Behold, I will deliver thine enemy into thine hand, that thou mayest do to him as it shall seem good unto thee. Then David arose, and cut off the skirt of Saul's robe privily.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the men of David said unto him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Behold the day of which the LORD said unto thee, Behold, I will deliver thine enemy into thine hand, that thou mayest do to him as it shall seem good unto thee. Then David arose, and cut off the skirt of Saul's robe privily.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Here we see how ready we are to hasten God's promise, if the occasion serve never so little.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of which the Lord said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] David may have received from Samuel and Gad assurances of his ultimate deliverance from Saul’s persecutions, which his followers interpret in their own way. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:28-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the skirt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He wished to have some proof to convince Saul that his life had been in his power.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 4, 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Behold the day of which Jehovah said unto thee,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. David's men regard this deliverance of Saul into their band as providential, and the fulfilment of the promises made in David's favour, with which, no doubt, they were well acquainted. But with a noble self-control he refuses to take the matter into his own hand, and leaves unto God in trusting faith the execution of his purposes. To prove, nevertheless, to Saul his innocence, to soften his bitterness, and refute the suspicion that he was lying in wait to murder him, he cuts off the corner - Hebrew, wing - of his ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "meil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Even for this his ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "heart smote him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So tender was his conscience that he condemned himself for even deviating so slightly from the respect due to the anointed king. 1 Samuel 24:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then David's men said to him, \"See, this is the day of which Jehovah hath said to thee, Behold, I give thine enemy into thy hand, and do to him what seemeth good to thee.\" Although these words might refer to some divine oracle which David had received through a prophet, Gad for example, what follows clearly shows that David had received no such oracle; and the meaning of his men was simply this, \"Behold, to-day is the day when God is saying to thee:\" that is to say, the speakers regarded the leadings of providence by which Saul had been brought into David's power as a divine intimation to David himself to take this opportunity of slaying his deadly enemy, and called this intimation a word of Jehovah. David then rose, up, and cut off the edge of Saul's cloak privily. Saul had probably laid the meil on one side, which rendered it possible for David to cut off a piece of it unobserved.",
        "children": []
      }
    ]
  }
]