[{"num":15,"verse":"And straightway in the morning, the chief priests holding a consultation with the ancients and the scribes and the whole council, binding Jesus, led him away, and delivered him to Pilate."},{"num":2,"verse":"And Pilate asked him: Art thou the king of the Jews? But he answering, saith to him: Thou sayest it."},{"num":3,"verse":"And the chief priests accused him in many things."},{"num":4,"verse":"And Pilate again asked him, saying: Answerest thou nothing? behold in how many things they accuse thee."},{"num":5,"verse":"But Jesus still answered nothing; so that Pilate wondered."},{"num":6,"verse":"Now on the festival day he was wont to release unto them one of the prisoners, whomsoever they demanded."},{"num":7,"verse":"And there was one called Barabbas, who was put in prison with some seditious men, who in the sedition had committed murder."},{"num":8,"verse":"And when the multitude was come up, they began to desire that he would do, as he had ever done unto them."},{"num":9,"verse":"And Pilate answered them, and said: Will you that I release to you the king of the Jews?"},{"num":10,"verse":"For he knew that the chief priests had delivered him up out of envy."},{"num":11,"verse":"But the chief priests moved the people, that he should rather release Barabbas to them."},{"num":12,"verse":"And Pilate again answering, saith to them: What will you then that I do to the king of the Jews?"},{"num":13,"verse":"But they again cried out: Crucify him."},{"num":14,"verse":"And Pilate saith to them: Why, what evil hath he done? But they cried out the more: Crucify him."},{"num":15,"verse":"And so Pilate being willing to satisfy the people, released to them Barabbas, and delivered up Jesus, when he had scourged him, to be crucified."},{"num":16,"verse":"And the soldiers led him away into the court of the palace, and they called together the whole band:"},{"num":17,"verse":"And they clothe him with purple, and platting a crown of thorns, they put it upon him."},{"num":18,"verse":"And they began to salute him: Hail, king of the Jews."},{"num":19,"verse":"And they struck his head with a reed: and they did spit on him. And bowing their knees, they adored him."},{"num":20,"verse":"And after they had mocked him, they took off the purple from him, and put his own garments on him, and they led him out to crucify him."},{"num":21,"verse":"And they forced one Simon a Cyrenian who passed by, coming out of the country, the father of Alexander and of Rufus, to take up his cross."},{"num":22,"verse":"And they bring him into the place called Golgotha, which being interpreted is, The place of Calvary."},{"num":23,"verse":"And they gave him to drink wine mingled with myrrh; but he took it not."},{"num":24,"verse":"And crucifying him, they divided his garments, casting lots upon them, what every man should take."},{"num":25,"verse":"And it was the third hour, and they crucified him."},{"num":26,"verse":"And the inscription of his cause was written over: THE KING OF THE JEWS."},{"num":27,"verse":"And with him they crucify two thieves; the one on his right hand, and the other on his left."},{"num":28,"verse":"And the scripture was fulfilled, which saith: And with the wicked he was reputed."},{"num":29,"verse":"And they that passed by blasphemed him, wagging their heads, and saying: Vah, thou that destroyest the temple of God, and in three days buildest it up again;"},{"num":30,"verse":"Save thyself, coming down from the cross."},{"num":31,"verse":"In like manner also the chief priests mocking, said with the scribes one to another: He saved others; himself he cannot save."},{"num":32,"verse":"Let Christ the king of Israel come down now from the cross, that we may see and believe. And they that were crucified with him reviled him."},{"num":33,"verse":"And when the sixth hour was come, there was darkness over the whole earth until the ninth hour."},{"num":34,"verse":"And at the ninth hour, Jesus cried out with a loud voice, saying: Eloi, Eloi, lamma sabacthani? Which is, being interpreted, My God, my God, why hast thou forsaken me?"},{"num":35,"verse":"And some of the standers by hearing, said: Behold he calleth Elias."},{"num":36,"verse":"And one running and filling a sponge with vinegar, and putting it upon a reed, gave him to drink, saying: Stay, let us see if Elias come to take him down."},{"num":37,"verse":"And Jesus having cried out with a loud voice, gave up the ghost."},{"num":38,"verse":"And the veil of the temple was rent in two, from the top to the bottom."},{"num":39,"verse":"And the centurion who stood over against him, seeing that crying out in this manner he had given up the ghost, said: Indeed this man was the son of God."},{"num":40,"verse":"And there were also women looking on afar off: among whom was Mary Magdalen, and Mary the mother of James the less and of Joseph, and Salome:"},{"num":41,"verse":"Who also when he was in Galilee followed him, and ministered to him, and many other women that came up with him to Jerusalem."},{"num":42,"verse":"And when evening was now come, (because it was the Parasceve, that is, the day before the sabbath,)"},{"num":43,"verse":"Joseph of Arimathea, a noble counsellor, who was also himself looking for the kingdom of God, came and went in boldly to Pilate, and begged the body of Jesus."},{"num":44,"verse":"But Pilate wondered that he should be already dead. And sending for the centurion, he asked him if he were already dead."},{"num":45,"verse":"And when he had understood it by the centurion, he gave the body to Joseph."},{"num":46,"verse":"And Joseph buying fine linen, and taking him down, wrapped him up in the fine linen, and laid him in a sepulchre which was hewed out of a rock. And he rolled a stone to the door of the sepulchre."},{"num":47,"verse":"And Mary Magdalen, and Mary the mother of Joseph, beheld where he was laid."}]