[{"header":"Jesus Before Pilate"},{"num":15,"verse":"As soon as morning came, the chief priests held a council meeting with the elders, the legal experts, and the whole Sanhedrin. They bound Jesus, took him off to Pilate, and handed him over."},{"num":2,"verse":"‘Are you the king of the Jews?’ asked Pilate."},{"num":3,"verse":"The chief priests laid many accusations against him."},{"num":4,"verse":"Pilate again interrogated him: ‘Aren’t you going to make any reply? Look how many things they’re accusing you of!’"},{"num":5,"verse":"But Jesus gave no reply at all, which astonished Pilate."},{"num":6,"verse":"The custom was that at festival time he used to release for them a single prisoner, whoever they would ask for. "},{"num":7,"verse":"There was a man in prison named Barabbas, one of the revolutionaries who had committed murder during the uprising. "},{"num":8,"verse":"So the crowd came up and began to ask Pilate to do what he normally did."},{"num":9,"verse":"‘Do you want me’, answered Pilate, ‘to release for you “the king of the Jews”?’"},{"num":10,"verse":"He said this because he knew that the chief priests had handed him over out of envy. "},{"num":11,"verse":"The chief priests stirred up the crowd to ask for Barabbas instead to be released to them. So Pilate once again asked them, "},{"num":12,"verse":"‘What then do you want me to do with the one you call “the king of the Jews”?’"},{"num":13,"verse":"‘Crucify him!’ they shouted again."},{"num":14,"verse":"‘Why?’ asked Pilate. ‘What has he done wrong?’"},{"num":15,"verse":"Pilate wanted to satisfy the crowd; so he released Barabbas for them. He had Jesus flogged, and handed him over to be crucified."},{"header":"The Crucifixion"},{"num":16,"verse":"The soldiers took Jesus into the courtyard, that is, the Praetorium, and called together the whole squad. "},{"num":17,"verse":"They dressed Jesus up in purple; then, weaving together a crown of thorns, they stuck it on him. "},{"num":18,"verse":"They began to salute him: ‘Greetings, King of the Jews!’ "},{"num":19,"verse":"And they hit him over the head with a staff, and spat at him, and knelt down to do him homage. "},{"num":20,"verse":"Then, when they had mocked him, they took the purple robe off him, and put his own clothes back on."},{"num":21,"verse":"They compelled a man called Simon to carry Jesus’ cross. He was from Cyrene, and was coming in from out of town. He was the father of Alexander and Rufus."},{"num":22,"verse":"They took Jesus to the place called Golgotha, which in translation means ‘Skull’s Place’. "},{"num":23,"verse":"They gave him a mixture of wine and myrrh, but he didn’t drink it."},{"num":24,"verse":"So they crucified him; they ‘parted his clothing between them, casting lots’ to see who would get what. "},{"num":25,"verse":"It was about nine o’clock in the morning when they crucified him. "},{"num":26,"verse":"The inscription, giving the charge, read: ‘The King of the Jews’. "},{"num":27,"verse":"They also crucified two bandits alongside him, one on his right and one on his left."},{"num":29,"verse":"People who were passing by abused him. They shook their heads at him."},{"num":30,"verse":"Why don’t you rescue yourself, and come down from the cross?’"},{"num":31,"verse":"The chief priests and the lawyers were mocking him in the same way among themselves."},{"num":32,"verse":"Messiah, is he? King of Israel, did he say? Well, let’s see him come down from the cross! We’ll believe him when we see that!’"},{"header":"The Death of Jesus"},{"num":33,"verse":"At midday there was darkness over all the land until three in the afternoon. "},{"num":34,"verse":"At three o’clock Jesus shouted out in a powerful voice, ‘Eloi, Eloi, lema sabachthani?’ which means, ‘My God, my God, why did you abandon me?’"},{"num":35,"verse":"When the bystanders heard it, some of them said, ‘He’s calling for Elijah!’"},{"num":36,"verse":"One of them ran and filled a sponge with sour wine, put it on a pole, and gave it him to drink."},{"num":37,"verse":"But Jesus, with another loud shout, breathed his last."},{"num":38,"verse":"The Temple veil was torn in two, from top to bottom. "},{"num":39,"verse":"When the centurion who was standing facing him saw that he died in this way, he said, ‘This fellow really was God’s son.’"},{"header":"The Burial of Jesus"},{"num":40,"verse":"Some women were watching from a distance. They included Mary Magdalene, Mary the mother of the younger James and of Joses, and Salome. "},{"num":41,"verse":"They had followed Jesus in Galilee, and had attended to his needs. There were several other women, too, who had come up with him to Jerusalem."},{"num":42,"verse":"It was already getting towards evening, and it was the day of Preparation, that is, the day before the sabbath. "},{"num":43,"verse":"Joseph of Arimathea, a reputable member of the Council who was himself eagerly awaiting God’s kingdom, took his courage in both hands, went to Pilate, and requested the body of Jesus."},{"num":44,"verse":"Pilate was surprised that he was already dead. He summoned the centurion, and asked whether he had been dead for some time. "},{"num":45,"verse":"When he learned the facts from the centurion, he conceded the body to Joseph."},{"num":46,"verse":"So Joseph bought a linen cloth, took the body down, wrapped it in the cloth, and laid it in a tomb cut out of the rock. He rolled a stone against the door of the tomb. "},{"num":47,"verse":"Mary Magdalene and Mary the mother of Joses saw where he was buried."}]