[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the first day there shall be an holy convocation.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The Passover was to be kept on the fourteenth day of Abib, at even. The seven following days were to be “days of unleavened bread.” On the first of these, the fifteenth of Abib (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), there was to be a “holy convocation,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a general gathering of the people to the door of the sanctuary for sacrifice, worship, and perhaps instruction. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The term “convocation” implies that the people were summoned to attend; and the actual summons appears to have been made by the blowing of the silver trumpets (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). On the seventh day, the twenty-first of Abib, was to be another similar meeting. “No manner of work” was to be done on either of these two days; or rather, as explained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “no servile work.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-20 The Lord makes all things new to those whom he delivers from the bondage of Satan, and takes to himself to be his people. The time when he does this is to them the beginning of a new life. God appointed that, on the night wherein they were to go out of Egypt, each family should kill a lamb, or that two or three families, if small, should kill one lamb. This lamb was to be eaten in the manner here directed, and the blood to be sprinkled on the door-posts, to mark the houses of the Israelites from those of the Egyptians. The angel of the Lord, when destroying the first-born of the Egyptians, would pass over the houses marked by the blood of the lamb: hence the name of this holy feast or ordinance. The passover was to be kept every year, both as a remembrance of Israel's preservation and deliverance out of Egypt, and as a remarkable type of Christ. Their safety and deliverance were not a reward of their own righteousness, but the gift of mercy. Of this they were reminded, and by this ordinance they were taught, that all blessings came to them through the shedding and sprinkling of blood. Observe, 1. The paschal lamb was typical. Christ is our passover, 1Co 5:7. Christ is the Lamb of God, Joh 1:29; often in the Revelation he is called the Lamb. It was to be in its prime; Christ offered up himself in the midst of his days, not when a babe at Bethlehem. It was to be without blemish; the Lord Jesus was a Lamb without spot: the judge who condemned Christ declared him innocent. It was to be set apart four days before, denoting the marking out of the Lord Jesus to be a Saviour, both in the purpose and in the promise. It was to be slain, and roasted with fire, denoting the painful sufferings of the Lord Jesus, even unto death, the death of the cross. The wrath of God is as fire, and Christ was made a curse for us. Not a bone of it must be broken, which was fulfilled in Christ, Joh 19:33, denoting the unbroken strength of the Lord Jesus. 2. The sprinkling of the blood was typical. The blood of the lamb must be sprinkled, denoting the applying of the merits of Christ's death to our souls; we must receive the atonement, Ro 5:11. Faith is the bunch of hyssop, by which we apply the promises, and the benefits of the blood of Christ laid up in them, to ourselves. It was to be sprinkled on the door-posts, denoting the open profession we are to make of faith in Christ. It was not to be sprinkled upon the threshold; which cautions us to take heed of trampling under foot the blood of the covenant. It is precious blood, and must be precious to us. The blood, thus sprinkled, was a means of preserving the Israelites from the destroying angel, who had nothing to do where the blood was. The blood of Christ is the believer's protection from the wrath of God, the curse of the law, and the damnation of hell, Ro 8:1. 3. The solemn eating of the lamb was typical of our gospel duty to Christ. The paschal lamb was not to be looked upon only, but to be fed upon. So we must by faith make Christ our own; and we must receive spiritual strength and nourishment from him, as from our food, see Joh 6:53,55. It was all to be eaten; those who by faith feed upon Christ, must feed upon a whole Christ; they must take Christ and his yoke, Christ and his cross, as well as Christ and his crown. It was to be eaten at once, not put by till morning. To-day Christ is offered, and is to be accepted while it is called to-day, before we sleep the sleep of death. It was to be eaten with bitter herbs, in remembrance of the bitterness of their bondage in Egypt; we must feed upon Christ with sorrow and brokenness of heart, in remembrance of sin. Christ will be sweet to us, if sin be bitter. It was to be eaten standing, with their staves in their hands, as being ready to depart. When we feed upon Christ by faith, we must forsake the rule and the dominion of sin; sit loose to the world, and every thing in it; forsake all for Christ, and reckon it no bad bargain, Heb 13:13,14. 4. The feast of unleavened bread was typical of the Christian life, 1Co 5:7,8. Having received Christ Jesus the Lord, we must continually delight ourselves in Christ Jesus. No manner of work must be done, that is, no care admitted and indulged, which does not agree with, or would lessen this holy joy. The Jews were very strict as to the passover, so that no leaven should be found in their houses. It must be a feast kept in charity, without the leaven of malice; and in sincerity, without the leaven of hypocrisy. It was by an ordinance for ever; so long as we live we must continue feeding upon Christ, rejoicing in him always, with thankful mention of the great things he has done for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "An holy convocation - An assembly called by proclamation for a religious solemnity. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the East the proclamation is made by the Muezzins from the minarets of the mosques.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Save that ... - In this the observance of the festival differed from the Sabbath, when the preparation of food was prohibited. The same word for \"work\" is used here and in the fourth commandment: it is very general, and includes all laborious occupation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Save that ... - In this the observance of the festival differed from the Sabbath, when the preparation of food was prohibited. The same word for \"work\" is used here and in the fourth commandment: it is very general, and includes all laborious occupation. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. there shall be an holy convocation—literally, calling of the people, which was done by sound of trumpets (Nu 10:2), a sacred assembly—for these days were to be regarded as Sabbaths—excepting only that meat might be cooked on them (Ex 16:23).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "An holy convocation; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a solemn day for the people to assemble together, and to attend upon the public worship and service of God in hearing his word, prayers, praises, and sacrifices. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And in the seventh day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because then Pharaoh and his host were drowned in the sea. As on the first day the first-born were killed; so their deliverance was begun on the first, and completed on the seventh day, and therefore those days deserved a special character of honour. And indeed that there were seven days between those two miracles, the Jews unanimously affirm, and it seems probable from the account of their journeys. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "No manner of work, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. of servile work, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 23:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Save that which every man must eat:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " herein, as many think, these days were inferior to the sabbath, in which that was forbidden. But of this ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Exodus 16:23\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And in the first day there shall be an holy convocation,.... An holy day, in which the people be called to holy exercises, and wholly abstain from worldly business, done on other days: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the seventh day there shall be an holy convocation unto you; observed in a festival way, and in the like religious manner the first day was, the day of their going out of Egypt; and the seventh was the day in which Pharaoh and his host were drowned in the Red sea, as Aben Ezra observes; for which reason those days are distinguished from the rest, and appointed to be holy convocations, and which appear from the journeying of the children of Israel, as computed by Junius: they came to Succoth on the fifteenth, to Etham the seventeenth, to Pihahiroth the eighteenth, where they were ordered to stay, and wait the coming of their enemies, on the twentieth the army of Pharaoh came up to them, and the night following the Israelites passed through the sea and the Egyptians were drowned: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "no manner of work shall be done in them; as used to be done on other days, and as were on the other five days of this festival: the Jewish canons are,\"it is forbidden to do any work on the evening of the passover, from the middle of the day and onward, and whoever does work from the middle of the day and onward, they excommunicate him; even though, he does it for nothing, it is forbidden (n): R. Meir says, whatever work anyone begins before the fourteenth (of Nisan) he may finish it on the fourteenth, but he may not begin it on the beginning of the fourteenth, though he could finish it: the wise men say, three workmen may work on the evening of the passover unto the middle of the day, and they are these, tailors, barbers, and fullers: R. Jose bar Judah says, also shoemakers (o),''but in the text no exception is made but the following: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "save that which every man must eat, that only may be done of you; so that kindling fire and preparing food might be done on those days, which might not be done on sabbath days; and the prohibition of work was not so strict on those days as on that. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Lebush, par. 1. No. 468. sect. 1. Schulcan Aruch, par. 1. No. 468. sect. 1.((o) Misn. Pesach. c. 4. sect. 6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) Lebush, par. 1. No. 468. sect. 1. Schulcan Aruch, par. 1. No. 468. sect. 1.((o) Misn. Pesach. c. 4. sect. 6. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And in the first day there shall be an holy convocation, and in the seventh day there shall be an holy convocation to you; no manner of work shall be done in them, save that which every man must eat, that only may be done of you.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the first and seventh day there was also to be a ‘holy convocation,’ i.e. an assembly at the sanctuary for religious purposes. The expression occurs besides only in the two calendars of P, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:2-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:35-37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:25-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and, without ‘holy,’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (EVV., each time, ‘assemblies’). The assembly was ‘called’ together by silver trumpets (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [where ‘calling’ is in the Heb. the same as ‘convocation’ here], ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:3; Num 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): Kalisch reminds us how in Mohammedan countries festivals are announced by heralds from conspicuous places, especially the towers of mosques.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "save that which",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The prohibition of work was thus not as strict as for the sabbath (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or the day of atonement (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "On the first day there shall be an holy convocation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After the Paschal meal on the evening of the 14th of Abib, there was to be a solemn assembly of the people on the  next day for religions worship. The name \"convocation;\" applied to these gatherings, seems to show that originally the people were ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "summoned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to such meetings, as they still are by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "muezzin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the minarets of mosques in Mahommedan countries, and by bells from the steeples of churches in Christian ones. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And on the seventh day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the 22nd of Abib - the seventh day after the first holy convocation on the 15th (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:4-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Only two of the Jewish festivals were of this duration - the feast of unleavened bread, and the feast of tabernacles (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ib",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 39-42). The Christian Church has adopted the usage for Christmas, Easter, Ascension, and Whitsuntide, where the last day of the week is known technically as \"the octave.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "No manner of work shall be done in them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Festival-days were in all countries days of abstention from the ordinary business of life, which could not conveniently be carried on conjointly with attendance at the services, meetings, processions, etc., wherein the festival consisted. But absolute cessation from all work was nowhere strictly commanded except among the Hebrews, where it appears to have been connected with the belief in God's absolute rest after the six days of creation. The command here given was solemnly repeated in the law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:6 8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Exodus 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the first and seventh days, a holy meeting was to be held, and labour to be suspended. מקרא־קדשׁ is not indictio sancti, proclamatio sanctitatis (Vitringa), but a holy assembly, i.e., a meeting of the people for the worship of Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 46:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 46:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). מקרא, from קרא to call, is that which is called, i.e., the assembly (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). No work was to be done upon these days, except what was necessary for the preparation of food; on the Sabbath, even this was prohibited (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Hence in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the \"work\" is called \"servile work,\" ordinary handicraft.",
        "children": []
      }
    ]
  }
]