[{"num":12,"verse":"¶ Now these are those that came to David to Ziklag, while he was yet restrained because of Saul, the son of Kish; and they were among the mighty men, helpers of the war."},{"num":2,"verse":"They were armed with bows and could use both the right hand and the left in hurling stones and shooting arrows out of a bow, even of Saul’s brethren of Benjamin."},{"num":3,"verse":"The chief was Ahiezer, then Joash, the sons of Shemaah, the Gibeathite; and Jeziel and Pelet, the sons of Azmaveth; and Berachah and Jehu, the Antothite,"},{"num":4,"verse":"and Ismaiah, the Gibeonite, a mighty man among the thirty, and more than the thirty; and Jeremiah, Jahaziel, Johanan, Josabad, the Gederathite,"},{"num":5,"verse":"Eluzai, Jerimoth, Bealiah, Shemariah, Shephatiah, the Haruphite;"},{"num":6,"verse":"Elkanah, Jesiah, Azareel, Joezer, Jashobeam, the Korhites,"},{"num":7,"verse":"and Joelah and Zebadiah, the sons of Jeroham of Gedor."},{"num":8,"verse":"And of the Gadites there separated themselves unto David in the fortress in the wilderness, men of might of war fit for the battle, put in order with shield and buckler, whose faces were like the faces of lions and were as swift as the roes upon the mountains;"},{"num":9,"verse":"Ezer, the chief, Obadiah, the second, Eliab, the third,"},{"num":10,"verse":"Mishmannah, the fourth, Jeremiah, the fifth,"},{"num":11,"verse":"Attai, the sixth, Eliel, the seventh,"},{"num":12,"verse":"Johanan, the eighth, Elzabad, the ninth,"},{"num":13,"verse":"Jeremiah, the tenth, Machbanai, the eleventh."},{"num":14,"verse":"These were of the sons of Gad, captains of the host. One of the least was over one hundred men, and the greatest over a thousand."},{"num":15,"verse":"These went over the Jordan in the first month, when it had overflown all its banks, and they put to flight all those of the valleys to the east and to the west."},{"num":16,"verse":"Likewise, some of the sons of Benjamin and Judah came to David, to the fortress."},{"num":17,"verse":"And David went out to meet them and answered and said unto them, If you are come peaceably unto me to help me, my heart shall be knit unto you; but if you are come to betray me to my enemies, seeing there is no violence in my hands, let the God of our fathers look thereon and rebuke it."},{"num":18,"verse":"Then the spirit clothed himself in Amasai, who was chief of the thirty, and he said, For thee, O David, and with thee, thou son of Jesse. Peace, peace be unto thee, and peace be to thy helpers; for thy God helps thee. Then David received them and put them among the captains of the band."},{"num":19,"verse":"And some of Manasseh passed over to David, when he came with the Philistines against Saul to battle, although they did not help them, for the cardinals of the Philistines, upon counsel, sent him away, saying, He will pass over to his master Saul with our heads."},{"num":20,"verse":"As he went to Ziklag, there passed over to him of Manasseh, Adnah, Jozabad, Jediael, Michael, Jozabad, Elihu, and Zilthai, heads of the thousands that were of Manasseh."},{"num":21,"verse":"And they helped David with a band; for they were all mighty men of valour and were captains in the host."},{"num":22,"verse":"For at that time help came every day to David until it was a great camp, like the camp of God."},{"num":23,"verse":"¶ And this is the number of the heads of those that were ready armed for war and came to David in Hebron, to turn the kingdom of Saul to him, according to the word of the LORD."},{"num":24,"verse":"Of the sons of Judah that bore shield and spear, six thousand eight hundred, ready armed for war."},{"num":25,"verse":"Of the sons of Simeon, mighty men of valour for the war, seven thousand one hundred."},{"num":26,"verse":"Of the sons of Levi four thousand six hundred."},{"num":27,"verse":"Likewise Jehoiada, prince of those of the lineage of Aaron, and with him three thousand seven hundred;"},{"num":28,"verse":"and Zadok, a young man mighty of valour, and of his father’s house twenty-two captains."},{"num":29,"verse":"Of the sons of Benjamin, the kindred of Saul, three thousand; for in that time many of them had the charge of the house of Saul."},{"num":30,"verse":"And of the sons of Ephraim twenty thousand eight hundred, mighty men of valour, famous throughout the houses of their fathers."},{"num":31,"verse":"And of the half tribe of Manasseh eighteen thousand, who were designated by name, to come and make David king."},{"num":32,"verse":"And of the sons of Issachar, two hundred chief men, who had understanding of the times and were wise to know what Israel ought to do; and all their brethren followed their word."},{"num":33,"verse":"Of Zebulun, such as went forth to battle, expert in war, with all weapons of war, fifty thousand, who could keep rank; they were not of double heart."},{"num":34,"verse":"And of Naphtali a thousand captains and with them with shield and spear thirty-seven thousand."},{"num":35,"verse":"And of those of Dan expert in war twenty-eight thousand six hundred."},{"num":36,"verse":"And of Asher, such as went forth to battle, expert in war, forty thousand."},{"num":37,"verse":"And of the other side of the Jordan, of those of Reuben and those of Gad and of the half tribe of Manasseh, with all manner of instruments of war for the battle, one hundred and twenty thousand."},{"num":38,"verse":"All these men of war, that could keep rank, came with a perfect heart to Hebron, to make David king over all Israel; and likewise, all the rest also of Israel were of one heart to make David king."},{"num":39,"verse":"And there they were with David three days, eating and drinking, for their brethren had prepared for them."},{"num":40,"verse":"And likewise, those that were near them, even unto Issachar and Zebulun and Naphtali, brought bread on asses and on camels and on mules and on oxen, and food, meal, cakes of figs, and bunches of raisins, and wine and oil, and oxen, and sheep abundantly; for there was joy in Israel."}]