[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Abimelech. . . . gave them unto Abraham.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Pharaoh’s presents were given when he took Sarah, and though he did not exact them back, yet he bade Abraham ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "“go ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "his way” in displeasure. More generously, the Philistine gives presents on restoring Sarah, and grants her husband permission to dwell in his land wherever it pleased him. He also acknowledges thereby that he had done Abraham a wrong.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:14-18 We often trouble ourselves, and even are led into temptation and sin, by groundless suspicions; and find the fear of God where we expected it not. Agreements to deceive generally end in shame and sorrow; and restraints from sin, though by suffering, should be thankfully acknowledged. Though the Lord rebuke, yet he will pardon and deliver his people, and he will give them favour in the sight of those with whom they sojourn; and overrule their infirmities, when they are humbled for them, so that they shall prove useful to themselves and others.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abimelek seems to have accepted his apology, as he probably felt that there was truth in the character Abraham gave of his people, and was precluded from resenting it by the salutary impression of his dream; while at the same time Abraham's mode of avoiding danger appeared warrantable according to his own and the common code of morals. He therefore hastens to make honorable amends for his conduct. He makes Abraham a valuable present, restores his wife, and makes him free to dwell in any part of his dominions. He then accosts Sarah in respectful terms, informing her that he had presented her brother with one thousand silver pieces, probably shekels, on her account. He does not offer this directly to herself, that it may be distinctly understood that her honor was unstained. This may refer either to Abraham or to the sum of money. The latter is more natural, as the sentence then affords a reason for addressing Sarah, and mentioning this particular gift. \"A covering of the eyes\" does not mean a veil, the proper word for which is צעיף  tsā‛ı̂yp, but is a figurative phrase for a recompense or pacificatory offering, in consideration of which an offence is overlooked. \"Unto all that are with thee.\" All her family were concerned in this public vindication of her character. \"And all this that thou mayest be righted.\" The original of this is most naturally taken as a part of Abimelek's speech, and then it is to be translated as above. All this has been done or given that the injury to Sarah may be redressed. If the original be regarded as a part of the narrative, it must be rendered, \"And all this (was done) that she might be righted.\" The sense is the same in substance. In the former case the verb is in the second person, in the latter in the third.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. yet indeed she is my sister—(See on [8]Ge 11:31). What a poor defense Abraham made. The statement absolved him from the charge of direct and absolute falsehood, but he had told a moral untruth because there was an intention to deceive (compare Ge 12:11-13). \"Honesty is always the best policy.\" Abraham's life would have been as well protected without the fraud as with it: and what shame to himself, what distrust to God, what dishonor to religion might have been prevented! \"Let us speak truth every man to his neighbor\" [Zec 8:16; Eph 4:25].   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Abimelech took sheep, and oxen, and menservants, and womenservants, and gave them unto Abraham,.... In a good measure satisfied with what Abraham had said to excuse himself; and these gifts he gave unto him, that he might, as Jarchi observes, pray and intercede for him, that he and his family might be healed, having understood by the divine oracle that he was a prophet, and if he prayed for him he would be restored to health: and these were not given to bribe him to give his consent that Sarah might be continued with him, since it follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and restored him Sarah his wife; untouched by him, as he was directed by God to do. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and restored him Sarah his wife; untouched by him, as he was directed by God to do. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Abimelech took sheep, and oxen, and menservants, and womenservants, and gave them unto Abraham, and restored him Sarah his wife.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Abimelech took",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Abimelech’s gift is intended to compensate Abraham for injury to his honour. The head of the household is regarded as embodying the rights of all who belong to him. The LXX and Heb. Sam. insert “a thousand pieces of silver and” before “sheep and oxen.” This is due to a misunderstanding of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 20:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 20:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Abimelech",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - as Pharaoh did (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but with a different motive - to",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "ok sheep, and oxen, and men-servants, and women-servants",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The LXX. and Samaritan insert \"a thousand didrachmas\" after \"took,\" in order to include Sarah's present, mentioned in Ver. 16; but the two donations are separated in order to distinguish them as Abraham's gift and Sarah's respectively (Rosenmüller, Delitzsch), or the sum of money may indicate the value of the sheep and oxen, &c. which Abraham received (Keil, Knobel, Lange, 'Speaker's Commentary'). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And gave them unto Abraham.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " To propitiate his favor for the wrong he had suffered. Pharaoh's gifts were \"for the sake of Sarah\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And restored him Sarah his wife.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 20:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abimelech then gave him back his wife with a liberal present of cattle and slaves, and gave him leave to dwell wherever he pleased in his land. To Sarah he said, \"Behold, I have given a thousand shekele of silver to thy brother; behold, it is to thee a covering of the eyes (i.e., an expiatory gift) with regard to all that are with thee (\"because in a mistress the whole family is disgraced,\" Del.), and with all - so art thou justified.\" The thousand shekels (about 131) were not a special present made to Sarah, but indicate the value of the present made to Abraham, the amount of which may be estimated by this standard, that at a later date (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a slave was reckoned at 30 shekels. By the \"covering of the eyes\" we are not to understand a veil, which Sarah was to procure for 1000 shekels; but it is a figurative expression for an atoning gift, and is to be explained by the analogy of the phrase פּני פ כּפּר \"to cover any one's face,\" so that he may forget a wrong done (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"he covereth the faces of the judges,\" i.e., he bribes them). ונוכחת can only be the 2 pers. fem. sing. perf. Niphal, although the Dagesh lene is wanting in the ת; for the rules of syntax will hardly allow us to regard this form as a participle, unless we imagine the extremely harsh ellipsis of נוכחת for אתּ נוכחת. The literal meaning is \"so thou art judged,\" i.e., justice has been done thee. ",
        "children": []
      }
    ]
  }
]