[{"num":3,"verse":"¶ Behold, I send my messenger, and he shall prepare the way before me; and the Lord, whom ye seek, shall suddenly come to his temple, and the angel of the covenant, whom ye desire: behold, he comes, said the LORD of the hosts."},{"num":2,"verse":"But who may abide the time of his coming? and who shall stand when he appears? for he shall be like a refiner’s fire and like fullers’ soap:"},{"num":3,"verse":"And he shall sit to refine and to purify the silver: for he shall purify the sons of Levi and purge them as gold and silver that they may offer unto the LORD an offering in righteousness."},{"num":4,"verse":"Then the offering of Judah and Jerusalem shall be pleasant unto the LORD as in the days of old and as in former years."},{"num":5,"verse":"And I will come near unto you for judgment; and I will be a swift witness against the sorcerers and against the adulterers and against false swearers and against those that oppress the hireling in his wages, the widow, and the fatherless, and that turn aside the stranger from his right, and do not fear me, said the LORD of the hosts."},{"num":6,"verse":"For I am the LORD, I have not changed; therefore, ye sons of Jacob have not been consumed."},{"num":7,"verse":"¶ Even from the days of your fathers, ye had departed from my ordinances and had never kept them. Return unto me, and I will return unto you, said the LORD of the hosts. But ye said, In what shall we return?"},{"num":8,"verse":"Will a man rob God? Yet ye have robbed me. But ye say, In what have we robbed thee? In the tithes and the offerings."},{"num":9,"verse":"Ye are cursed with a curse: for ye, even this whole nation, have robbed me."},{"num":10,"verse":"Bring ye all the tithes into the storehouse, and there shall be food in my house, and prove me now in this, said the LORD of the hosts, if I will not open you the windows of heaven and pour you out a blessing that there shall not be room enough to receive it."},{"num":11,"verse":"And I will reprehend the devourer for your sakes, and he shall not destroy the fruits of the ground; neither shall the vine in the field abort, said the LORD of the hosts."},{"num":12,"verse":"And all the Gentiles shall call you blessed: for ye shall be a delightsome land, said the LORD of the hosts."},{"num":13,"verse":"¶ Your words have prevailed against me, saith the LORD. Yet ye say, What have we spoken against thee?"},{"num":14,"verse":"Ye have said, It is vain to serve God, and what profit is it that we have kept his law and that we walk mournfully before the LORD of the hosts?"},{"num":15,"verse":"We say, therefore, now, that blessed are the proud and even that those that work wickedness are prospered; those that tempted God have escaped."},{"num":16,"verse":"Then those that feared the LORD spoke one to another, and the LORD hearkened and heard it, and a book of remembrance was written before him for those that feared the LORD and for those that think in his name."},{"num":17,"verse":"And they shall be mine, said the LORD of the hosts, in that day when I make up my jewels; and I will spare them, as a man spares his own son that serves him."},{"num":18,"verse":"Therefore become ye converted, and ye shall make a difference between the just and the wicked, between him that serves God and him that did not serve him."}]