[{"header":"Chapter 10"},{"num":1,"verse":"Tola. After Abimelech, Tola, son of Puah, son of Dodo, a man of Issachar, rose up to save Israel; he lived in Shamir in the mountain region of Ephraim. "},{"num":2,"verse":"When he had judged Israel twenty-three years, he died and was buried in Shamir."},{"num":3,"verse":"Jair. Jair the Gileadite came after him and judged Israel twenty-two years. "},{"num":4,"verse":"He had thirty sons who rode on thirty donkeys and possessed thirty cities in the land of Gilead (these are called Havvoth-jair to the present day). "},{"num":5,"verse":"Jair died and was buried in Kamon."},{"num":6,"verse":"Oppression by the Ammonites. The Israelites again did what was evil in the sight of the Lord, serving the Baals and Ashtarts, the gods of Aram, the gods of Sidon, the gods of Moab, the gods of the Ammonites, and the gods of the Philistines. Since they had abandoned the Lord and would not serve him, "},{"num":7,"verse":"the Lord became angry with Israel and he sold them into the power of the Philistines and the Ammonites. "},{"num":8,"verse":"For eighteen years they afflicted and oppressed the Israelites in Bashan, and all the Israelites in the Amorite land beyond the Jordan in Gilead. "},{"num":9,"verse":"The Ammonites also crossed the Jordan to fight against Judah, Benjamin and the house of Ephraim, so that Israel was in great distress."},{"num":10,"verse":"Then the Israelites cried out to the Lord, “We have sinned against you, for we have abandoned our God and served the Baals.” "},{"num":11,"verse":"The Lord answered the Israelites: Did not the Egyptians, the Amorites, the Ammonites, the Philistines, "},{"num":12,"verse":"the Sidonians, the Amalekites, and the Midianites oppress you? Yet when you cried out to me, and I saved you from their power, "},{"num":13,"verse":"you still abandoned me and served other gods. Therefore I will save you no more. "},{"num":14,"verse":"Go and cry out to the gods you have chosen; let them save you in your time of distress. "},{"num":15,"verse":"But the Israelites said to the Lord, “We have sinned. Do to us whatever is good in your sight. Only deliver us this day!” "},{"num":16,"verse":"And they cast out the foreign gods from their midst and served the Lord, so that he grieved over the misery of Israel."},{"num":17,"verse":"The Ammonites were called out for war and encamped in Gilead, while the Israelites assembled and encamped at Mizpah. "},{"num":18,"verse":"The captains of the army of Gilead said to one another, “The one who begins the war against the Ammonites shall be leader of all the inhabitants of Gilead.”"}]