[[],[{"type":"header","content":"Tola Becomes Israel’s Judge"},{"type":"prose","content":"After Abimelech died, Tola son of Puah, son of Dodo, was the next person to rescue Israel. He was from the tribe of Issachar but lived in the town of Shamir in the hill country of Ephraim."}],[{"type":"prose","content":"He judged Israel for twenty-three years. When he died, he was buried in Shamir."}],[{"type":"header","content":"Jair Becomes Israel’s Judge"},{"type":"prose","content":"After Tola died, Jair from Gilead judged Israel for twenty-two years."}],[{"type":"prose","content":"His thirty sons rode around on thirty donkeys, and they owned thirty towns in the land of Gilead, which are still called the Towns of Jair."}],[{"type":"prose","content":"When Jair died, he was buried in Kamon."}],[{"type":"header","content":"The Ammonites Oppress Israel"},{"type":"prose","content":"Again the Israelites did evil in the LORD’s sight. They served the images of Baal and Ashtoreth, and the gods of Aram, Sidon, Moab, Ammon, and Philistia. They abandoned the LORD and no longer served him at all."}],[{"type":"prose","content":"So the LORD burned with anger against Israel, and he turned them over to the Philistines and the Ammonites,"}],[{"type":"prose","content":"who began to oppress them that year. For eighteen years they oppressed all the Israelites east of the Jordan River in the land of the Amorites (that is, in Gilead)."}],[{"type":"prose","content":"The Ammonites also crossed to the west side of the Jordan and attacked Judah, Benjamin, and Ephraim.The Israelites were in great distress."}],[{"type":"prose","content":"Finally, they cried out to the LORD for help, saying, “We have sinned against you because we have abandoned you as our God and have served the images of Baal.”"}],[{"type":"prose","content":"The LORD replied, “Did I not rescue you from the Egyptians, the Amorites, the Ammonites, the Philistines,"}],[{"type":"prose","content":"the Sidonians, the Amalekites, and the Maonites? When they oppressed you, you cried out to me for help, and I rescued you."}],[{"type":"prose","content":"Yet you have abandoned me and served other gods. So I will not rescue you anymore."}],[{"type":"prose","content":"Go and cry out to the gods you have chosen! Let them rescue you in your hour of distress!”"}],[{"type":"prose","content":"But the Israelites pleaded with the LORD and said, “We have sinned. Punish us as you see fit, only rescue us today from our enemies.”"}],[{"type":"prose","content":"Then the Israelites put aside their foreign gods and served the LORD. And he was grieved by their misery."}],[{"type":"prose","content":"At that time the armies of Ammon had gathered for war and were camped in Gilead, and the people of Israel assembled and camped at Mizpah."}],[{"type":"prose","content":"The leaders of Gilead said to each other, “Whoever attacks the Ammonites first will become ruler over all the people of Gilead.”"}]]