[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Swear unto me, that ye will not fall upon me yourselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It seems as if Samson were parleying with them from some point of vantage which he could easily have defended for a time.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:9-17 Sin dispirits men, it hides from their eyes the things that belong to their peace. The Israelites blamed Samson for what he had done against the Philistines, as if he had done them a great injury. Thus our Lord Jesus did many good works, and for those the Jews were ready to stone him. When the Spirit of the Lord came upon Samson, his cords were loosed: where the Spirit of the Lord is, there is liberty, and those are free indeed who are thus set free. Thus Christ triumphed over the powers of darkness that shouted against him, as if they had him in their power. Samson made great destruction among the Philistines. To take the bone of an ass for this, was to do wonders by the foolish things of the world, that the excellency of the power might be of God, not of man. This victory was not in the weapon, was not in the arm; but it was in the Spirit of God, which moved the weapon by the arm. We can do all things through Him that strengtheneth us. Seest thou a poor Christian, who is enabled to overcome a temptation by weak, feeble counsel, there is the Philistine vanquished by a sorry jaw-bone.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The dispirited men of Judah were prepared to give up their champion, in order to conciliate their masters. This shows how hard was the task of the Judge, whose office it was to restore his countrymen to freedom and independence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jud 15:9-13. He Is Bound by the Men of Judah, and Delivered to the Philistines.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "9-17. Then the Philistines went up—to the high land of Judah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and spread themselves in Lehi—now El-Lekieh, abounding with limestone cliffs; the sides of which are perforated with caves. The object of the Philistines in this expedition was to apprehend Samson, in revenge for the great slaughter he had committed on their people. With a view of freeing his own countrymen from all danger from the infuriated Philistines, he allowed himself to be bound and surrendered a fettered prisoner into their power. Exulting with joy at the near prospect of riddance from so formidable an enemy, they went to meet him. But he exerted his superhuman strength, and finding a new (or moist) jawbone of an ass, he laid hold of it, and with no other weapon, slew a thousand men at a place which he called Ramath-lehi—that is, \"the hill of the jawbone.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Not that he feared them, or could not as easily have conquered them, as he did the whole host of the Philistines; but because he would be free from all obligation or temptation of doing them any harm, though it were in his own just and necessary defence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they said unto him, we are come down to bind thee,.... That is, they were come down into the cave where he was; otherwise more properly they were come up to the top of the rock: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that we may deliver thee into the hands of the Philistines; they own what was their intention in binding him, and what put them upon it was not ill will to him, but fear of the Philistines: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Samson said unto them, swear unto me that ye will not fall upon me yourselves; which shows he did not fear them, though they were 3000; and that if they attempted to take away his life, he should defend himself, but he chose not to shed the blood of any of them; and rather than they should come into any distress through the Philistines, consented to be bound by them, and delivered into their hands; which he was a type of Christ, who was betrayed by the Jews, and delivered by them into the hands of the Romans; and though he could have delivered himself by his great strength, would not, but suffered himself to be taken and bound, and given into the hands of his enemies, that his own people might go free; see John 18:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Samson said unto them, swear unto me that ye will not fall upon me yourselves; which shows he did not fear them, though they were 3000; and that if they attempted to take away his life, he should defend himself, but he chose not to shed the blood of any of them; and rather than they should come into any distress through the Philistines, consented to be bound by them, and delivered into their hands; which he was a type of Christ, who was betrayed by the Jews, and delivered by them into the hands of the Romans; and though he could have delivered himself by his great strength, would not, but suffered himself to be taken and bound, and given into the hands of his enemies, that his own people might go free; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 18:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they said unto him, We are come down to bind thee, that we may deliver thee into the hand of the Philistines. And Samson said unto them, Swear unto me, that ye will not fall upon me yourselves.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 12, 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "We are come down to bind thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is something very base in this deliberate agreement with their Philistine masters to deliver up Samson bound into their hands. But it is not very unlike the spirit in which the Hebrews looked upon Moses when he first began to work to rescue them from their Egyptian bondage (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:25-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Samson's forbearance towards his own countrymen is commendable. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Brought him up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - from the deep ravine or cleft in which he was hid. His place of concealment was probably unknown to the Philistines, or may be they had quite a superstitious fear of Samson from their experience of his prowess. Judges 15:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the Judaeans learned what was the object of this invasion on the part of the Philistines, three thousand of them went down to the cleft in the rock Etam, to bind Samson and deliver him up to the Philistines. Instead of recognising in Samson a deliverer whom the Lord had raised up for them, and crowding round him that they might smite their oppressors with his help and drive them out of the land, the men of Judah were so degraded, that they cast this reproach at Samson: \"Knowest thou not that the Philistines rule over us? Wherefore hast thou done this (the deed described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")? We have come down to bind thee, and deliver thee into the hand of the Philistines.\" Samson replied, \"Swear to me that ye will not fall upon me yourselves.\" פּגע with בּ, to thrust at a person, fall upon him, including in this case, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the intention of killing.",
        "children": []
      }
    ]
  }
]