[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Into the standing corn of the Philistines.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—He probably did this at night, when his actions would be unobserved, and no one would be at hand to quench the flames. We may imagine him watching the trails of fire from his rocky fastness, and exulting as the conflagration reddened the night. The heat of a tropical country makes everything so dry that his plan would be certain to succeed. To burn the crops of an Arab is to this day the deadliest of all injuries (Burckhardt). This was the method adopted by Absalom, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 14:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to gain an interview with Joab. It is needless to point out that the adoption of these rough, coarse, and cruel expedients must be as little judged by a later and better standard as his thirst for the revenge of personal wrongs. There can be no ground to question the literal truth of the narrative. It is in entire accordance with the custom of the East, and it finds curious confirmation from the story in Ovid’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fasti, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that every year, at the Cerealia, torches were tied to the tails of foxes, and they were let loose in the Roman circus, to commemorate the incident that on one occasion a young man at Carseoli, to punish a fox for depredations on his hen-coops, had wrapped it up in straw, and set it on fire, and that the creature had escaped into the corn-fields and burnt down the standing crops (Ovid, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fasti, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "iv. 681-711). The attempt of Bochart to establish any connection between this custom and the revenge of Samson is quite untenable, but the incident itself throws light on the possibility of the narrative. Ewald refers to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mêghadûta, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "liv. 4; Babrius, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fab., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "11",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Both the shocks, and also the standing corn.—Literally, from the heap, even up to the standing. The extent of the vengeance and its terrible future consequences would be fully, and we fear ruthlessly, estimated by Samson, as he saw the rivers of fire running and spreading through that vast plain of corn-land in harvest-time. (Comp. Exodus 22:6.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Both the shocks, and also the standing corn.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "from the heap, even up to the standing. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The extent of the vengeance and its terrible future consequences would be fully, and we fear ruthlessly, estimated by Samson, as he saw the rivers of fire running and spreading through that vast plain of corn-land in harvest-time. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 22:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "With the vineyards and olives.—Literally, and to vineyard, to olive. There may be some slight corruption in the text, or it may be an abbreviation of “from vineyard to vineyard, and from olive to olive.” (Comp. Micah 7:12.) The low vines festooning the trees and trellis-work, and the olives with their dry trunks, would be sure to suffer injury.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "With the vineyards and olives.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and to vineyard, to olive. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "There may be some slight corruption in the text, or it may be an abbreviation of “from vineyard to vineyard, and from olive to olive.” (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 7:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) The low vines festooning the trees and trellis-work, and the olives with their dry trunks, would be sure to suffer injury.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jdg 15:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 15:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He let them go, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Successively at several times, and in divers places, so that they might not hinder one another, nor all run into the same field; but, being dispersed in all parts, might spread the plague further. But it will be asked, Why did he not employ some of the Israelites to set their corn on fire? The answer is easy: Because he wished to preserve them from the hatred and mischief to which this would have exposed them, and also to mortify the pride of the Philistines by making brute creatures, and particularly foxes, the instruments of bringing this calamity upon them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:1-8 When there are differences between relations, let those be reckoned the wisest and best, who are most forward to forgive or forget, and most willing to stoop and yield for the sake of peace. In the means which Samson employed, we must look at the power of God supplying them, and making them successful, to mortify the pride and punish the wickedness of the Philistines. The Philistines threatened Samson's wife that they would burn her and her father's house. She, to save herself and oblige her countrymen, betrayed her husband; and the very thing that she feared, and by sin sought to avoid, came upon her! She, and her father's house, were burnt with fire, and by her countrymen, whom she thought to oblige by the wrong she did to her husband. The mischief we seek to escape by any unlawful practices, we often pull down upon our own heads.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Foxes - Rather, \"jackals,\" which are still very common in Palestine, especially about Joppa and Gaza. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 19:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are indications of the abundance of foxes or jackals giving names to places, especially in the country of the Phililstines. It belongs to Samson's character, and agrees with the incident about the lion, that he should be an expert hunter. Ovid relates a very curious custom at Rome of letting loose foxes with lighted torches fastened to their tails in the circus at the Cerealia, in commemoration of the damage once done to the standing grain by a fox which a rustic had wrapped in hay and straw and set on fire, and which, running away, put the grain-fields in a blaze. This custom, which may have had a Phoenician origin, is a curious illustration of the narrative. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4, 5. went and caught three hundred foxes—rather, \"jackals\"; an animal between a wolf and a fox, which, unlike our fox, a solitary creature, prowls in large packs or herds and abounds in the mountains of Palestine. The collection of so great a number would require both time and assistance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "took firebrands—torches or matches which would burn slowly, retaining the fire, and blaze fiercely when blown by the wind. He put two jackals together, tail by tail, and fastened tightly a fire match between them. At nightfall he lighted the firebrand and sent each pair successively down from the hills, into the \"Shefala,\" or plain of Philistia, lying on the borders of Dan and Judah, a rich and extensive corn district. The pain caused by the fire would make the animals toss about to a wide extent, kindling one great conflagration. But no one could render assistance to his neighbor: the devastation was so general, the panic would be so great.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He let them go, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, successively at several times, and in divers places, with great care and discretion, so as they might not hinder one another, nor all run into the same field; but being dispersed in all parts, might spread the plague further; and withal might be kept at a distance from the fields and vineyards of the Israelites. It is not worthy of our inquiry what became of these foxes afterward, whether they were burnt by the firebrands, or run into holes, or were taken and killed by the Philistines. The truth of this history is notably attested by a custom of the Romans, which it is very probable they had from the Phoenicians, upon this occasion; for every year they had a solemnity in April, the very time of Canaan’s wheat harvest, wherein foxes were let loose with burning torches fastened to their backsides, &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he had set the brands on fire,.... Disposed as before related; and foxes being naturally fearful of, and frightened with fire, and especially so near them as at their tails, would run into the first place they could for shelter: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he let them go into the standing corn of the Philistines; which being ripe, as it was now wheat harvest, would soon take fire; and taking fire, this would in course cause the foxes to run still further to other parts of standing corn, and set fire to them also; besides, it is reasonable to suppose that Samson did not let them go all at once on one spot, but disposed of them, some here, and some there, to do the greater and more speedy execution: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and burnt up both the shocks, and also the standing corn, with the vineyards and olives; for as it was in the time of harvest, in some places the corn was standing, and in other places it was cut down, and put into shocks or heaps; and to these the foxes would naturally run to shelter themselves, and so set fire to them, as well as they would make their way to the vineyards or oliveyards, either for shelter also, or for the sake of the grapes and olives, to satisfy their hunger, after having been detained long for this purpose; and thus by one means or another they destroyed the corn, the vines, and olives of the Philistines in those parts. Some would have it, in order to shun the difficulties objected by the enemies of revelation, that the word for \"foxes\" should be rendered \"sheaves\" or shocks of corn, set end to end (y), which the word for \"tail\" is said to signify; and firebrands or torches being set on fire, communicated it to standing corn, shocks of corn, vineyards, and oliveyards; but there is no need to put such a sense upon the words, as already observed; nor is the word translated \"foxes\" ever used in Scripture in any form for \"sheaves\" or shocks of corn, but always others; nor in any Jewish writings, nor in the sister dialects, Arabic, Chaldee, or Ethiopic; and in any place of Scripture where it is translated \"fox\" or \"foxes\", should the word \"sheaves\" or \"shocks\" be put, the sense would appear most ridiculous; nor is the word for \"tail\" ever used in Scripture, in a literal sense, but for the tail of a living creature; nor is the word for \"took\" or \"caught\" ever used of taking anything in common, but either of taking men or cities by force, or of creatures in nets, traps, and snares: and the sense which such a version of the words would give is not only contrary to the Hebrew text, and to the Chaldee paraphrase, but to all the ancient versions, Arabic, Syriac, Septuagint, and Vulgate Latin, and to Josephus. The memory of this great event was kept up, or a custom borrowed from it, as some learned men have observed in the Vulpinaria of the Romans, mentioned by Ovid (z), and others, which bore a great resemblance to this, and which was observed at the same time of the year, about the middle of April, or calends of May; which exactly agrees with the time of wheat harvest in Palestine; when in the Circus they used to send out foxes with burning torches fixed to their backs. Nor need this affair of Samson's seem more strange or incredible than the great number of creatures brought into the Circus at Rome, to be seen there together. Sylla first introduced one hundred lions, after him Pompey the great three hundred, and Julius Caesar, when he was dictator, four hundred, as Pliny (a) relates. Probus (b) sent into the amphitheatre at one time, which he made like a wood full of trees, 1000 ostriches, a like number of harts, does, boars, and other creatures each; and at another time one hundred lions, as many lionesses and leopards each, and three hundred bears; Heliogabalus (c) got together 1000 weasels, 10,000 mice, 10,000 weight of spiders and flies. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) Observ. Halens. apud Stockium in voc.  p. 1126. & Hardtius apud Marck. Dissertat. Philolog. Exercitat. 5. sect. 7. p. 196. (z) Fasti, l. 4. Vid. Alex. ab Alex. Genial. Dier. l. 5. c. 26. (a) Nat. Hist. l. 8. c. 16. (b) Vopiscus in Vita Probi. (c) Ib. in \"Vita ejus\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) Observ. Halens. apud Stockium in voc.  p. 1126. & Hardtius apud Marck. Dissertat. Philolog. Exercitat. 5. sect. 7. p. 196. (z) Fasti, l. 4. Vid. Alex. ab Alex. Genial. Dier. l. 5. c. 26. (a) Nat. Hist. l. 8. c. 16. (b) Vopiscus in Vita Probi. (c) Ib. in \"Vita ejus\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when he had set the brands on fire, he let them go into the standing corn of the Philistines, and burnt up both the {c} shocks, and also the standing corn, with the vineyards and olives.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And when he had set the brands on fire, he let ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "them",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " go into the standing corn of the Philistines, and burnt up both the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shocks, and also the standing corn, with the vineyards ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " olives.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Or, that which was reaped and gathered.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "oliveyards",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vineyard of oliveyard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which cannot be right; read ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vineyard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "oliveyard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with LXX, Vulgate; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The shocks and the standing corn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ver. 1, note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "With the vineyards and olives",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Hebrew text has ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the orchards of olive trees - the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "cherem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", usually translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vineyard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", meaning also any ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "orchard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the Septuagint in both codices supplies and, as does the A. Y., which gives the more probable sense, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vineyards and olives.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is unlikely that the vineyards should not be mentioned, in a district abounding in them. Judges 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He therefore went and caught three hundred shualim, i.e., jackals, animals which resemble foxes and are therefore frequently classed among the foxes even by the common Arabs of the present day (see Niebuhr, Beschr. v. Arab. p. 166). Their European name is derived from the Persian schaghal. These animals, which are still found in great quantities at Joppa, Gaza, and in Galilee, herd together, and may easily be caught (see Rosenmller, Bibl. Althk. iv. 2, pp. 155ff.). He then took torches, turned tail to tail, i.e., coupled the jackals together by their tails, putting a torch between the two tails, set the torches on fire, and made the animals run into the fields of standing corn belonging to the Philistines. Then he burned \"from the shocks of wheat to the standing grain and to the olive gardens,\" i.e., the shocks of wheat as well as the standing corn and the olive plantations. זית מרךּ are joined together in the construct state. ",
        "children": []
      }
    ]
  }
]