[{"num":1,"verse":"He exhorteth the people to return to the Lord, and to eschew the wickedness of their fathers. 16 He signifieth the restitution of Jerusalem and the Temple."},{"num":1,"verse":"In the eighth month of the second year of Darius, came the word of the Lord unto Zechariah the son of Berechiah, the son of Iddo the Prophet, saying,"},{"num":2,"verse":"The Lord hath been sore displeased with your fathers."},{"num":3,"verse":"Therefore say thou unto them, Thus saith the Lord of hosts, Turn ye unto me, saith the Lord of hosts, and I will turn unto you, saith the Lord of hosts."},{"num":4,"verse":"Be ye not as your fathers, unto whom the former Prophets have cried, saying, Thus saith the Lord of hosts, Turn you now from your evil ways, and from your wicked works: but they would not hear, nor hearken unto me, saith the Lord."},{"num":5,"verse":"Your fathers, where are they? and do the Prophets live forever?"},{"num":6,"verse":"But did not my words and my statutes, which I commanded by my servants the Prophets, take hold of your fathers? and they returned, and said, As the Lord of hosts hath determined to do unto us according to our own ways, and according to our works, so hath he dealt with us."},{"num":7,"verse":"Upon the four and twentieth day of the eleventh month, which is the month Shebat, in the second year of Darius, came the word of the Lord unto Zechariah the son of Berechiah, the son of Iddo the Prophet, saying,"},{"num":8,"verse":"I saw by night, and behold a man riding upon a red horse, and he stood among the myrtle trees that were in a bottom, and behind him were there red horses speckled and white."},{"num":9,"verse":"Then said I, O my Lord, what are these? And the Angel that talked with me, said unto me, I will show thee what these be."},{"num":10,"verse":"And the man that stood among the myrtle trees, answered and said, These are they whom the Lord hath sent to go through the world."},{"num":11,"verse":"And they answered the Angel of the Lord that stood among the myrtle trees, and said, We have gone through the world: and behold, all the world sitteth still and is at rest."},{"num":12,"verse":"Then the Angel of the Lord answered and said, O Lord of hosts, how long wilt thou be unmerciful to Jerusalem, and to the cities of Judah, with whom thou hast been displeased now these threescore and ten years?"},{"num":13,"verse":"And the Lord answered the Angel that talked with me, with good words and comfortable words."},{"num":14,"verse":"So the Angel that communed with me, said unto me, Cry thou, and speak, thus saith the Lord of hosts, I am jealous over Jerusalem and Zion with a great zeal,"},{"num":15,"verse":"And am greatly angry against the careless heathen: for I was angry but a little, and they helped forward the affliction."},{"num":16,"verse":"Therefore thus saith the Lord, I will return unto Jerusalem with tender mercy: mine house shall be built in it, saith the Lord of hosts, and a line shall be stretched upon Jerusalem."},{"num":17,"verse":"Cry yet, and speak, Thus saith the Lord of hosts, My cities shall yet be broken with plenty: the Lord shall yet comfort Zion, and shall yet choose Jerusalem."},{"num":18,"verse":"Then lifted I up mine eyes and saw, and behold, four horns."},{"num":19,"verse":"And I said unto the Angel that talked with me, What be these? And he answered me, These are the horns which have scattered Judah, Israel, and Jerusalem."},{"num":20,"verse":"And the Lord showed me four carpenters."},{"num":21,"verse":"Then said I, What come these to do? And he answered, and said, These are the horns, which have scattered Judah, so that a man durst not lift up his head: but these are come to fray them, and to cast out the horns of the Gentiles, which lifted up their horn over the land of Judah to scatter it."}]