[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(33) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whosoever shall deny me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As with all other eternal laws, the blessing on those who fulfil the conditions to which it is attached has its counterpart of woe on those who do not fulfil them. To deny Christ on earth by word or deed, to live as if His work were nothing to us, must lead to His denying us in the last great day.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:16-42 Our Lord warned his disciples to prepare for persecution. They were to avoid all things which gave advantage to their enemies, all meddling with worldly or political concerns, all appearance of evil or selfishness, and all underhand measures. Christ foretold troubles, not only that the troubles might not be a surprise, but that they might confirm their faith. He tells them what they should suffer, and from whom. Thus Christ has dealt fairly and faithfully with us, in telling us the worst we can meet with in his service; and he would have us deal so with ourselves, in sitting down and counting the cost. Persecutors are worse than beasts, in that they prey upon those of their own kind. The strongest bonds of love and duty, have often been broken through from enmity against Christ. Sufferings from friends and relations are very grievous; nothing cuts more. It appears plainly, that all who will live godly in Christ Jesus must suffer persecution; and we must expect to enter into the kingdom of God through many tribulations. With these predictions of trouble, are counsels and comforts for a time of trial. The disciples of Christ are hated and persecuted as serpents, and their ruin is sought, and they need the serpent's wisdom. Be ye harmless as doves. Not only, do nobody any hurt, but bear nobody any ill-will. Prudent care there must be, but not an anxious, perplexing thought; let this care be cast upon God. The disciples of Christ must think more how to do well, than how to speak well. In case of great peril, the disciples of Christ may go out of the way of danger, though they must not go out of the way of duty. No sinful, unlawful means may be used to escape; for then it is not a door of God's opening. The fear of man brings a snare, a perplexing snare, that disturbs our peace; an entangling snare, by which we are drawn into sin; and, therefore, it must be striven and prayed against. Tribulation, distress, and persecution cannot take away God's love to them, or theirs to him. Fear Him, who is able to destroy both soul and body in hell. They must deliver their message publicly, for all are deeply concerned in the doctrine of the gospel. The whole counsel of God must be made known, Ac 20:27. Christ shows them why they should be of good cheer. Their sufferings witnessed against those who oppose his gospel. When God calls us to speak for him, we may depend on him to teach us what to say. A believing prospect of the end of our troubles, will be of great use to support us under them. They may be borne to the end, because the sufferers shall be borne up under them. The strength shall be according to the day. And it is great encouragement to those who are doing Christ's work, that it is a work which shall certainly be done. See how the care of Providence extends to all creatures, even to the sparrows. This should silence all the fears of God's people; Ye are of more value than many sparrows. And the very hairs of your head are all numbered. This denotes the account God takes and keeps of his people. It is our duty, not only to believe in Christ, but to profess that faith, in suffering for him, when we are called to it, as well as in serving him. That denial of Christ only is here meant which is persisted in, and that confession only can have the blessed recompence here promised, which is the real and constant language of faith and love. Religion is worth every thing; all who believe the truth of it, will come up to the price, and make every thing else yield to it. Christ will lead us through sufferings, to glory with him. Those are best prepared for the life to come, that sit most loose to this present life. Though the kindness done to Christ's disciples be ever so small, yet if there be occasion for it, and ability to do no more, it shall be accepted. Christ does not say that they deserve a reward; for we cannot merit any thing from the hand of God; but they shall receive a reward from the free gift of God. Let us boldly confess Christ, and show love to him in all things.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Whosoever therefore shall confess me ... - The same word in the original is translated \"confess\" and \"profess,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 John 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It means to acknowledge the Lord Jesus Christ, and our dependence on him for salvation, and our attachment to him, in every proper manner. This profession may be made in uniting with a church, at the communion, in conversation, and in conduct. The Scriptures mean, by a profession of religion, an exhibition of it in every circumstance of the life and before all people. It is not merely in one act that we must do it, but in every act. We must be ashamed neither of the person, the character, the doctrines, nor the requirements of Christ. If we are; if we deny him in these things before people; if we are unwilling to express our attachment to him in every way possible, then it is right that he should \"disown all connection with us,\" or deny us before God, and he will do it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "33. But whosoever shall deny me before men, him will I also deny before my Father which is in heaven—before that same assembly: \"He shall have from Me his own treatment of Me on the earth.\" (But see on [1258]Mt 16:27).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " As this is a time for you publicly to own me, so there will be a time (in the day of judgment) for me to confess and publicly own you, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before the angels of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which Luke addeth to this sentence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 12:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "): as men deal with me in this life, so I shall deal with them in that day. Our Saviour speaketh much the same thing, as repeated by ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 8:38 Luke 9:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 8:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 9:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; only there instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whosoever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall deny me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whosoever shall be ashamed of me and my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "words.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ requireth of us not only a believing on him, but an external profession: nor that only, but a confession of him, which signifieth a profession of him and his gospel in the face of opposition and enemies: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 10:10 2 Timothy 2:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 10:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 2:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is dangerous, either through shame or fear, to withhold our public owning and acknowledgment of Christ, and his truths, when we are called to it; much more to deny them; but the guilt is greater when it is through shame, for where fear is the cause the temptation is more high. This text must be understood of those who persist in such denial, for Peter denied his Master, yet was graciously upon his repentance received by him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But whosoever shall deny me before men,.... Deny that he is a disciple of Christ, and that Christ is his Lord and master, act contrary to him, deliver things repugnant to his mind and will; which for a disciple to do to his master was a very heinous crime with the Jews: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"if (say they (n)) Rabbi Jochanan,  \"deny\" Rabbi Eleazar, his disciple, he will not \"deny\" Rabbi Jannai, his \"master\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Some regard may be had here to Peter's after denial of Christ; and this proviso be supposed, \"except he repent\", as he did. Moreover, to deny Christ, is to drop, or oppose any of those truths which regard his person, office, and grace; or to hide and conceal them from men, through fear, shame, or cowardice of mind: and even not to confess him, through fear of men, is interpreted, by Christ, a denial of him; and such who deny him in any form and shape, either by words or deeds, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "him, says he, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "will I also deny before my Father which is heaven; he will deny them to be disciples, or that they belong to him; he will deny that he ever knew them, loved or approved of them; he will declare in the presence of his Father, his disapprobation of them, his indignation against them, that they are workers of iniquity; yea, he will do more, he will banish them from his presence, and send them into everlasting burnings. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Juchasin, fol. 80. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) Juchasin, fol. 80. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But whosoever shall deny me before men, him will I also deny before my Father which is in heaven.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀρνήσομαι κᾀγὼ αὐτὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",[500] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I also will deny him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This order of the words, sc. “I-will-deny even-I-also him,” which expresses more exactly the law of retribution, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jus talionis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is supported by the Latin and Gothic versions,[501] by the Codex Byzantinus, and perhaps by other MSS. Such matters have been generally neglected by the collators of Codices. Others read ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρνήσομαι αὐτὸν κᾀγώ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[502]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[500] E. M. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρνήσομαι αὐτὸν κἀγὼ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—(I. B.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[501] The Gothic version of the Bible was made from the Greek, both in the Old and in the New Testament, by Ulphilas, a celebrated bishop of the Mæso-Goths, who assisted at the Council of Constantinople in 359, and was sent on an embassy to the Emperor Valens, about the year 378. He is said to have embraced Arianism, and to have propagated Arian tenets among his countrymen. Besides translating the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "entire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Bible into the Gothic language, Ulphilas is said to have conferred on the Mæso-Goths the invention of the Gothic characters. The character, however, in which this version of the New Testament is written, is, in fact, the Latin character of that age; and the degree of perfection which the Gothic language had obtained during the time of Ulphilas, is a proof that it had then been written for some time. The translation of Ulphilas (who had been educated among the Greeks) was executed from the Greek; but, from its coincidence in many instances with the Latin, there is reason to suspect that it has been interpolated, though at a remote period, from the Vulgate. Its unquestionable antiquity, however, and its general fidelity, have concurred to give this version a high place in the estimation of biblical critics; but, unfortunately, it has not come down to us entire. The only parts extant in print are, a fragment of the book of Nehemiah. a considerable portion of the four Gospels, and some portions of the apostolic epistles. The most distinguished manuscript of the Gothic version of Ulphilas is the justly celebrated CODEX ARGENTEUS, now preserved in the Library of the University of Upsal, in Sweden.”—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hartwell Horne",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", vol. ii. p. 240.—(I. B.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[502] The order ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κἀγὼ αὐτὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is supported by BDΔ Vulg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Orig. 1, 298",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "d",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 3,543",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Hil. 985, Cypr. But Rec. Text ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτὸν κἀγὼ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with Orig. 1,296",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Orig. 3,543",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " puts the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρνήσομαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " after.—ED.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 33.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Besides the parallel passage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. the similar thought in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (parallel passages: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But whosoever shall deny me before men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Kubel compares St. Peter's words, \"I know not the man\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:74",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Him will I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "also deny.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The emphasis is on \"deny\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Ign., 'Smyrn.,' § 5). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Before my Father which is in heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Matthew 10:33",
        "children": []
      }
    ]
  }
]