[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(35) The words are partly, as the marginal reference shows, an echo of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the selection of the special relationships as typical instances suggests the thought of some personal application. Had Zebedee looked with displeasure on the calling of his two sons? or was there variance between the daughter-in-law and the mother-in-law in the household of Peter? Were the brethren of the Lord, who as yet believed not, as the foes of a man’s own household?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:16-42 Our Lord warned his disciples to prepare for persecution. They were to avoid all things which gave advantage to their enemies, all meddling with worldly or political concerns, all appearance of evil or selfishness, and all underhand measures. Christ foretold troubles, not only that the troubles might not be a surprise, but that they might confirm their faith. He tells them what they should suffer, and from whom. Thus Christ has dealt fairly and faithfully with us, in telling us the worst we can meet with in his service; and he would have us deal so with ourselves, in sitting down and counting the cost. Persecutors are worse than beasts, in that they prey upon those of their own kind. The strongest bonds of love and duty, have often been broken through from enmity against Christ. Sufferings from friends and relations are very grievous; nothing cuts more. It appears plainly, that all who will live godly in Christ Jesus must suffer persecution; and we must expect to enter into the kingdom of God through many tribulations. With these predictions of trouble, are counsels and comforts for a time of trial. The disciples of Christ are hated and persecuted as serpents, and their ruin is sought, and they need the serpent's wisdom. Be ye harmless as doves. Not only, do nobody any hurt, but bear nobody any ill-will. Prudent care there must be, but not an anxious, perplexing thought; let this care be cast upon God. The disciples of Christ must think more how to do well, than how to speak well. In case of great peril, the disciples of Christ may go out of the way of danger, though they must not go out of the way of duty. No sinful, unlawful means may be used to escape; for then it is not a door of God's opening. The fear of man brings a snare, a perplexing snare, that disturbs our peace; an entangling snare, by which we are drawn into sin; and, therefore, it must be striven and prayed against. Tribulation, distress, and persecution cannot take away God's love to them, or theirs to him. Fear Him, who is able to destroy both soul and body in hell. They must deliver their message publicly, for all are deeply concerned in the doctrine of the gospel. The whole counsel of God must be made known, Ac 20:27. Christ shows them why they should be of good cheer. Their sufferings witnessed against those who oppose his gospel. When God calls us to speak for him, we may depend on him to teach us what to say. A believing prospect of the end of our troubles, will be of great use to support us under them. They may be borne to the end, because the sufferers shall be borne up under them. The strength shall be according to the day. And it is great encouragement to those who are doing Christ's work, that it is a work which shall certainly be done. See how the care of Providence extends to all creatures, even to the sparrows. This should silence all the fears of God's people; Ye are of more value than many sparrows. And the very hairs of your head are all numbered. This denotes the account God takes and keeps of his people. It is our duty, not only to believe in Christ, but to profess that faith, in suffering for him, when we are called to it, as well as in serving him. That denial of Christ only is here meant which is persisted in, and that confession only can have the blessed recompence here promised, which is the real and constant language of faith and love. Religion is worth every thing; all who believe the truth of it, will come up to the price, and make every thing else yield to it. Christ will lead us through sufferings, to glory with him. Those are best prepared for the life to come, that sit most loose to this present life. Though the kindness done to Christ's disciples be ever so small, yet if there be occasion for it, and ability to do no more, it shall be accepted. Christ does not say that they deserve a reward; for we cannot merit any thing from the hand of God; but they shall receive a reward from the free gift of God. Let us boldly confess Christ, and show love to him in all things.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Think not that I am come ... - This is taken from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Christ did not here mean to say that the object of his coming was to produce discord and contention, for he was the Prince of Peace, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but he means to say that such would be one of the effects of his coming. One part of a family that was opposed to Him would set themselves against those who believed in him. The wickedness of men, and not the religion of the gospel, is the cause of this hostility. It is unnecessary to say that no prophecy has been more strikingly fulfilled; and it will continue to be fulfilled until all unite in obeying his commandments. Then his religion will produce universal peace. Compare the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But a sword - The sword is an instrument of death, and to send a sword is the same as to produce hostility and war. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But a sword - The sword is an instrument of death, and to send a sword is the same as to produce hostility and war. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "35. For I am come to set a man at variance against his father, and the daughter against her mother, and the daughter-in-law against her mother-in-law—(See on [1259]Lu 12:51-53).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 34,35. Luke hath much the same with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 10:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", in ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 12:51",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 12:51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". As the Jews were much mistaken in their notion of the Messiah, as if he were to be a temporal prince, to restore the kingdom to Israel, and as the kingdom, so a peaceful kingdom; so many persons think still that where true religion comes, there must be forthwith peace and union. And indeed so it should be, and so it would be if the gospel were cordially and universally received. It is impossible that a system of laws should be compiled better fitted to human society, or conducible to peace, the great end of it, than the laws of the gospel are: but eventually it is not so, nor was such a civil peace the end of Christ’s coming. Accidentally, through the corruption of men’s hearts, the consequent of Christ’s coming into the world, and of his gospel coming into and prevailing in any part of the world, is (as Luke phrases it) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rather division, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is here called a sword. Through men’s fondness of their idolatry, superstition, and lusts, and madness on them, their impatience of being outdone in religion and righteousness of conversation, the event of Christ’s coming was division, wars, variances, like the times prophesied of by Micah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Micah 7:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 7:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; God either stirring up wars to revenge the contempt of the gospel, (as it happened to the Jews), or men taking up arms to compel all others to their idolatries and superstitions. And that natural antipathy which men have to holiness, setting them at variance with those who, embracing the gospel, live a life as becometh the sgospel of the Lord Jesus Christ, worketh so far, that men will have no respect to their nearest relations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For I am come to set a man at variance against,.... Or \"to divide a man from his father\". Here our Lord opens and explains what he means by the sword, intestine divisions, domestic broils, family differences, as well as such as appear in towns, cities, and kingdoms, which are exemplified by other instances following; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the daughter against her mother, and the daughter-in-law against her mother-in-law: the case is this, a father believing in Christ, embracing his Gospel, and submitting to his institutions, is contradicted, opposed, and persecuted by his own son, and a mother by her own daughter; in both which relations, natural affection knit them together; and the mother-in-law by her daughter-in-law, who before lived together in the most peaceable, kind, and tender manner: which must be imputed, not to Christ, and the doctrines of Christ, and the natural tendency of them, embraced by the father, the mother, and mother-in-law; but to the natural enmity of the son, the daughter, and the daughter-in-law, to everything divine, spiritual, and evangelical, or \"vice versa\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the daughter against her mother, and the daughter-in-law against her mother-in-law: the case is this, a father believing in Christ, embracing his Gospel, and submitting to his institutions, is contradicted, opposed, and persecuted by his own son, and a mother by her own daughter; in both which relations, natural affection knit them together; and the mother-in-law by her daughter-in-law, who before lived together in the most peaceable, kind, and tender manner: which must be imputed, not to Christ, and the doctrines of Christ, and the natural tendency of them, embraced by the father, the mother, and mother-in-law; but to the natural enmity of the son, the daughter, and the daughter-in-law, to everything divine, spiritual, and evangelical, or \"vice versa\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For I am come to set a man at variance against his father, and the daughter against her mother, and the daughter in law against her mother in law.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:35-36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Involuntary recollection of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. also Sota xlix. 2, in Schoettgen.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἦλθον γάρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] solemn repetition.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διχάσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to separate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Plat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Polit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 264 D), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e. to place",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a man ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in that attitude of party hostility",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διχοστασία",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") toward his father ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which results in their separation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so on.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "νύμφη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "young wife",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (common in classical writers), specially in the sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "daughter-in-law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (in the LXX.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ἐχθροὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] imminent, as if already present: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and a man’s enemies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (are) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the members of his own family!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐχθροί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a predicate.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". escription of the discord.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διχάσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to divide in two (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δίχα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to separate in feeling and interest, here only in N.T.; verifies the truth of Grotius’ comment as to the “sword”.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄνθρωπον κατὰ τοῦ πατρὸς αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this and the following clauses it is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "young",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that are set against the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "old",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “In all great revolutions of thought the change begins from the young” (Carr, Cambridge Gr. T.).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "νύμφην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a young wife, here as opposed to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πενθερᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a daughter-in-law.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to set … at variance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Greek word occurs here only in the New Testament, and is rare elsewhere. The root is the same as that of the word translated to “cut asunder.” The word is used by Plato of a scientific distinction. Here the thought of the dividing sword is carried on. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where see Dr Pusey’s note, who quotes Tertullian to shew how true Christ’s words proved in the second century.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Διχάσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to separate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A necessary consequence of what precedes.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄνθρωπον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") sc. a son ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "who loves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Me: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "against",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") In this passage those are put in opposition, who are otherwise naturally most attached, to each other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 35.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Parallel passage: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "supra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", vers. 21, 22). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "am come;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I came",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). Notice the threefold ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "η΅λθον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Christ would leave in his hearers' minds no room for thinking that he was ignorant of what the immediate result of his coming would be. To. A mere infinitive, not even with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", much less ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἵνα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with subject. The result is not in any sense the final cause of his coming. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Set a man at variance against",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "διχάσαι...",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κατὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). By the preposition is implied enmity, by the verb complete severance. For relation to God is the great line of cleavage, and that not only in God's sight, but in outcome of character. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "His father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From this word till the end of ver. 36 our Lord adopts Micah's (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") description of a general time of distrust for his own picture of the discord introduced by his coming. The wording is hardly taken from the LXX. Matthew 10:35",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Set at variance (διχάσαι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., part asunder. Wyc., to depart  equals  part.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Daughter-in-law (νύμφην)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So A. Y. and Rev.; but the full force is lost in this rendering. The word means bride, and though sometimes used in classical Greek of any married woman, it carries a notion of comparative youth. Thus in Homer, \"Odyssey,\" iv., 74:3, the aged nurse, Euryclea, addresses Penelope (certainly not a bride) as νύμφα φίλη (dear bride), of course as a term of affection or petting. Compare \"Iliad,\" iii., 130, where Iris addresses Helen in the same way. The radical and bitter character of the division brought into households by the Gospel is shown by the fact of its affecting domestic relations in their very freshness, The newly-married wife shall be set at variance with her mother-in-law. Wycliffe's rendering is peculiar: And the son's wife against the wife's or husband's mother. ",
        "children": []
      }
    ]
  }
]