[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(41) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the name of a prophet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the sake of that which the name connotes—the prophet’s work as a messenger of God, the righteousness of which the living righteous man is the concrete example. The distinction between the two involves the higher inspiration of the prophet as a messenger of God, and perhaps implies that that inspiration belonged to some, and not to all the Twelve, while those who were not to receive that special gift were at all events called to set forth the pattern of a righteous life. The “reward,” and the time of its being received, belong to the future glory of the kingdom; and the words of the promise throw the gate wide open, so as to admit not only those whose gifts and characters command the admiration of mankind, but all those who show in action that they are in sympathy with the work for which the gifts have been bestowed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Matthew",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE GREATEST IN THE KINGDOM, AND THEIR REWARDMatthew 10:41 - Matthew 10:42",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE GREATEST IN THE KINGDOM, AND THEIR REWARD",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:42",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is nothing in these words to show whether they refer to the present or to the future. We shall probably not go wrong if we regard them as having reference to both. For all godliness has ‘promise of the life that now is, as well as of that which is to come,’ and ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " keeping God’s commandments,’ as well as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " keeping them, ‘there is great reward,’ a reward realised in the present, even although Death holds the keys of the treasure-house in which the richest rewards are stored. No act of holy obedience is here left without foretastes of joy, which, though they be but ‘brooks by the way,’ contain the same water of life which hereafter swells to an ocean.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Some people tell us that it is defective morality in Christianity to bribe men to be good by promising them Heaven, and that he who is actuated by such a motive is selfish. Now that fantastic and overstrained objection may be very simply answered by two considerations: self-regard is not selfishness, and Christianity does not propose the future reward as the motive for goodness. The motive for goodness is love to Jesus Christ; and if ever there was a man who did acts of Christian goodness only for the sake of what he would get by them, the acts were not Christian goodness, because the motive was wrong. But it is a piece of fastidiousness to forbid us to reinforce the great Christian motive, which is love to Jesus Christ, by the thought of the recompense of reward. It is a stimulus and an encouragement of, not the motive for, goodness. This text shows us that it is a subordinate motive, for it says that the reception of a prophet, or of a righteous man, or of ‘one of these little ones,’ which is rewardable, is the reception ‘in the name of’ a prophet, a disciple, and so on, or, in other words, is the recognising of the prophet, or the righteous man, or the disciple for what he is, and because he is that, and not because of the reward, receiving him with sympathy and solace and help.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, with that explanation, let us look at these very remarkable words of our text.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The first thing which I wish to observe in them is the three classes of character which are dealt with-’prophet,’ ‘righteous man,’ ‘these little ones.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The first thing which I wish to observe in them is the three classes of character which are dealt with-’prophet,’ ‘righteous man,’ ‘these little ones.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now the question that I would suggest is this: Is there any meaning in the order in which these are arranged? If so, what is it? Do we begin at the bottom, or at the top? Have we to do with an ascending or with a descending scale? Is the prophet thought to be greater than the righteous man, or less? Is the righteous man thought to be higher than the little one, or to be lower? The question is an important one, and worth considering.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, at first sight, it certainly does look as if we had here to do with a descending scale, as if we began at the top and went downwards. A prophet, a man honoured with a distinct commission from God to declare His will, is, in certain very obvious respects, loftier than a man who is not so honoured, however pure and righteous he may be. The dim and venerable figures, for instance, of Isaiah and Jeremiah, tower high above all their contemporaries; and godly men who hung upon their lips, like Baruch on Jeremiah’s, felt themselves to be, and were, inferior to them. And, in like manner, the little child who believes in Christ may seem to be insignificant in comparison with the prophet with his God-touched lips, or the righteous man of the old dispensation with his austere purity; as a humble violet may seem by the side of a rose with its heart of fire, or a white lily regal and tall. But one remembers that Jesus Christ Himself declared that ‘the least of the little ones’ was greater than the greatest who had gone before; and it is not at all likely that He who has just been saying that whosoever received His followers received Himself, should classify these followers beneath the righteous men of old. The Christian type of character is distinctly higher than the Old Testament type; and the humblest believer is blessed above prophets and righteous men because his eyes behold and his heart welcomes the Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Therefore I am inclined to believe that we have here an ascending series-that we begin at the bottom and not at the top; that the prophet is less than the righteous man, and the righteous man less than the little one who believes in Christ. For, suppose there were a prophet who was not righteous, and a righteous man who was not a prophet. Suppose the separation between the two characters were complete, which of them would be the greater? Balaam was a prophet; Balaam was not a righteous man; Balaam was immeasurably inferior to the righteous whose lives he did not emulate, though he could not but envy their deaths. In like manner the humblest believer in Jesus Christ has something that a prophet, if he is not a disciple, does not possess; and that which he has, and the prophet has not, is higher than the endowment that is peculiar to the prophet alone.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " May we say the same thing about the difference between the righteous man and the disciple? Can there be a righteous man that is not a disciple? Can there be a disciple that is not a righteous man? Can the separation between these two classes be perfect and complete? No! in the profoundest sense, certainly not. But then at the time when Christ spoke there were some men standing round Him, who, ‘as touching the righteousness which is of the law,’ were ‘blameless.’ And there are many men to-day, with much that is noble and admirable in their characters, who stand apart from the faith that is in Jesus Christ; and if the separation be so complete as that, then it is to be emphatically and decisively pronounced that, if we have regard to all that a man ought to be, and if we estimate men in the measure in which they approximate to that ideal in their lives and conduct, ‘the Christian is the highest style of man.’ The disciple is above the righteous men adorned with many graces of character, who, if they are not Christians, have a worm at the root of all their goodness, because it lacks the supreme refinement and consecration of faith; and above the fiery-tongued prophet, if he is not a disciple.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, brethren, this thought is full of very important practical inferences. Faith is better than genius. Faith is better than brilliant gifts. Faith is better than large acquirements. The poet’s imagination, the philosopher’s calm reasoning, the orator’s tongue of fire, even the inspiration of men that may have their lips touched to proclaim God to their brethren, are all less than the bond of living trust that knits a soul to Jesus Christ, and makes it thereby partaker of that indwelling Saviour. And, in like manner, if there be men, as there are, and no doubt some of them among my hearers, adorned with virtues and graces of character, but who have not rested their souls on Jesus Christ, then high above these, too, stands the lowliest person who has set his faith and love on that Saviour. Neither intellectual endowments nor moral character are the highest, but faith in Jesus Christ. A man may be endowed with all brilliancy of intellect and fair with many beauties of character, and he may be lost; and on the other hand simple faith, rudimentary and germlike as it often is, carries in itself the prophecy of all goodness, and knits a man to the source of all blessedness. ‘Whether there be tongues, they shall cease; whether there be knowledge, it shall vanish away. Now abideth these three, faith, hope, charity.’ ‘Rejoice not that the spirits are subject unto you, but rather rejoice because your names are written in Heaven.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah! brethren, if we believed in Christ’s classification of men, and in the order of importance and dignity in which He arranges them, it would make a wonderful practical difference to the lives, to the desires, and to the efforts of a great many of us. Some of you students, young men and women that are working at college or your classes, if you believed that it was better to trust in Jesus Christ than to be wise, and gave one-tenth, ay! one-hundredth part of the attention and the effort to secure the one which you do to secure the other, would be different people. ‘Not many wise men after the flesh,’ but humble trusters in Jesus Christ, are the victors in the world. Believe you that, and order your lives accordingly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh! what a reversal of this world’s estimates is coming one day, when the names that stand high in the roll of fame shall pale, like photographs that have been shut up in a portfolio, and when you take them out have faded off the paper. ‘The world knows nothing of its greatest men,’ but there is a time coming when the spurious mushroom aristocracy that the world has worshipped will be forgotten, like the nobility of some conquered land, who are brushed aside and relegated to private life by the new nobility of the conquerors, and when the true nobles, God’s aristocrats, the righteous, who are righteous because they have trusted in Christ, shall shine forth like the sun ‘in the Kingdom of My Father.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Here is the climax: gifts and endowments at the bottom, character and morality in the middle, and at the top faith in Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now notice briefly in the second place the variety of the reward according to the character. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now notice briefly in the second place the variety of the reward according to the character.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The prophet has his, the righteous man has his, the little one has his. That is to say, each level of spiritual or moral stature receives its own prize. There is no difficulty in seeing that this is so in regard to the rewards of this life. Every faithful message delivered by a prophet increases that prophet’s own blessedness, and has joys in the receiving of it from God, in the speaking of it to men, in the marking of its effects as it spreads through the world, which belong to him alone. In all these, and in many other ways, the ‘prophet’ has rewards that no stranger can intermeddle with. All courses of obedient conduct have their own appropriate consequences and satisfaction. Every character is adapted to receive, and does receive, in the measure of its goodness, certain blessings and joys, here and now. ‘Surely the righteous shall be recompensed in the earth.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And the same principle, of course, applies if we think of the reward as altogether future. It must be remembered, however, that Christianity does not teach, as I believe, that if there be a prophet or a righteous man who is not a disciple, that prophet or righteous man will get rewards in the future life. It must be remembered, too, that every disciple is righteous in the measure of his faith. Discipleship being presupposed, then the disciple who is a prophet will have one reward, and the disciple who is a righteous man shall have another; and where all three characteristics coincide, there shall be a triple crown of glory upon his head.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is all plain and obvious enough, if only we get rid of the prejudice that the rewards of a future life are merely bestowed upon men by God’s arbitrary good pleasure. What is the reward of Heaven? ‘Eternal life,’ people say. Yes! ‘Blessedness.’ Yes! But where does the life come from, and where does the blessedness come from? They are both derived, they come from God in Christ; and in the deepest sense, and in the only true sense, God is Heaven, and God is the reward of Heaven. ‘I am thy shield,’ so long as dangers need to be guarded against, and then, thereafter, ‘I am thine exceeding great Reward.’ It is the possession of God that makes all the Heaven of Heaven, the immortal life which His children receive, and the blessedness with which they are enraptured. We are heirs of immortality, we are heirs of life, we are heirs of blessedness, because, and in the measure in which, we become heirs of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And if that be so, then there is no difficulty in seeing that in Heaven, as on earth, men will get just as much of God as they can hold; and that in Heaven, as on earth, capacity for receiving God is determined by character. The gift is one, the reward is one, and yet the reward is infinitely various. It is the same light which glows in all the stars, but ‘star differeth from star in glory.’ It is the same wine, the new wine of the Kingdom, that is poured into all the vessels, but the vessels are of divers magnitudes, though each be full to the brim.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so in those two sister parables of our Master’s, which are so remarkably discriminated and so remarkably alike, we have both these aspects of the Heavenly reward set forth-both that which declares its identity in all cases, and the other which declares its variety according to the recipient’s character. All the servants receive the same welcome, the same prize, the same entrance into the same joy; although one of them had ten talents, and another five, and another two. But the servants who were each sent out to trade with one poor pound in their hands, and by their varying diligence reaped varying profits, were rewarded according to the returns that they had brought; and one received ten, and the other five, and the other two, cities over which to have authority and rule. So the reward is one, and yet infinitely diverse. It is not the same thing whether a man or a woman, being a Christian, is an earnest, and devoted, and growing Christian here on earth, or a selfish, and an idle, and a stagnant one. It is not the same thing whether you content yourselves with simply laying hold on Christ, and keeping a tremulous and feeble hold of Him for the rest of your lives, or whether you grow in the grace and knowledge of our Lord and Saviour. There is such a fate as being saved, yet so as by fire, and going into the brightness with the smell of the fire on your garments. There is such a fate as having just, as it were, squeezed into Heaven, and got there by the skin of your teeth. And there is such a thing as having an abundant entrance ministered, when its portals are thrown wide open. Some imperfect Christians die with but little capacity for possessing God, and therefore their heaven will not be as bright, nor studded with as majestic constellations, as that of others. The starry vault that bends above us so far away, is the same in the number of its stars when gazed on by the savage with his unaided eye, and by the astronomer with the strongest telescope; and the Infinite God, who arches above us, but comes near to us, discloses galaxies of beauty and oceans of abysmal light in Himself, according to the strength and clearness of the eye that looks upon Him. So, brethren, remember that the one glory has infinite degrees; and faith, and conduct, and character here determine the capacity for God which we shall have when we go to receive our reward.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The last point that is here is the substantial identity of the reward to all that stand on the same level, however different may be the form of their lives. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The last point that is here is the substantial identity of the reward to all that stand on the same level, however different may be the form of their lives.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He that receiveth a prophet in the name of a prophet shall receive a prophet’s reward.’ And so in the case of the others. The active prophet, righteous man, or disciple, and the passive recogniser of each in that character, who receives each as a prophet, or righteous man, or disciple, stand practically and substantially on the same level, though the one of them may have his lips glowing with the divine inspiration and the other may never have opened his mouth for God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is beautiful and deep. The power of sympathising with any character is the partial possession of that character for ourselves. A man who is capable of having his soul bowed by the stormy thunder of Beethoven, or lifted to Heaven by the ethereal melody of Mendelssohn, is a musician, though he never composed a bar. The man who recognises and feels the grandeur of the organ music of ‘Paradise Lost’ has some fibre of a poet in him, though he be but ‘a mute, inglorious Milton.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " All sympathy and recognition of character involve some likeness to that character. The poor woman who brought the sticks and prepared food for the prophet entered into the prophet’s mission and shared in the prophet’s work and reward, though his task was to beard Ahab, and hers was only to bake Elijah’s bread. The old knight that clapped Luther on the back when he went into the Diet of Worms, and said to him, ‘Well done, little monk!’ shared in Luther’s victory and in Luther’s crown. He that helps a prophet because he is a prophet, has the making of a prophet in himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " As all work done from the same motive is the same in God’s eyes, whatever be the outward shape of it, so the work that involves the same type of spiritual character will involve the same reward. You find the Egyptian medal on the breasts of the soldiers that kept the base of communication as well as on the breasts of the men that stormed the works at Tel-el-Kebir. It was a law in Israel, and it is a law in Heaven: ‘As his part is that goeth down into the battle, so shall his part be that tarrieth by the stuff, they shall part alike.’ ‘I am going down into the pit, you hold the ropes,’ said Carey, the pioneer missionary. They that hold the ropes, and the daring miner that swings away down in the blackness, are one in the work, may be one in the motive, and, if they are, shall be one in the reward. So, brethren, though no coal of fire may be laid upon your lips, if you sympathise with the workers that are trying to serve God, and do what you can to help them, and identify yourself with them, and so hold the ropes, my text will be true about you. ‘He that receiveth a prophet in the name of a prophet shall receive a prophet’s reward.’ They who by reason of circumstances, by deficiency of power, or by the weight of other tasks and duties, can only give silent sympathy, and prayer, and help, are one with the men whom they help.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear brethren! remember that this awful, mystical life of ours is full everywhere of consequences that cannot be escaped. What we sow we reap, and we grind it, and we bake it, and we live upon it. We have to drink as we have brewed; we have to lie on the beds that we have made. ‘Be not deceived: God is not mocked.’ The doctrine of reward has two sides to it. ‘Nothing human ever dies.’ All our deeds drag after them inevitable consequences; but if you will put your trust in Jesus Christ, He will not deal with you according to your sins, nor reward you according to your iniquities; and the darkest features of the recompense of your evil will all be taken away by the forgiveness which we have in His blood. If you will trust yourselves to Him you will have that eternal life, which is not wages, but a gift; which is not reward, but a free bestowment of God’s love. And then, if we build upon that Foundation on which alone men can build their hopes, their thoughts, their characters, their lives, however feeble may be our efforts, however narrow may be our sphere,-though we be neither prophets nor sons of prophets, and though our righteousness may be all stained and imperfect, yet, to our own amazement and to God’s glory, we shall find, when the fire is kindled which reveals and tests our works, that, by the might of humble faith in Christ, we have built upon that Foundation, gold and silver and precious stones; and shall receive the reward given to every man whose work abides that trial by fire.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:16-42 Our Lord warned his disciples to prepare for persecution. They were to avoid all things which gave advantage to their enemies, all meddling with worldly or political concerns, all appearance of evil or selfishness, and all underhand measures. Christ foretold troubles, not only that the troubles might not be a surprise, but that they might confirm their faith. He tells them what they should suffer, and from whom. Thus Christ has dealt fairly and faithfully with us, in telling us the worst we can meet with in his service; and he would have us deal so with ourselves, in sitting down and counting the cost. Persecutors are worse than beasts, in that they prey upon those of their own kind. The strongest bonds of love and duty, have often been broken through from enmity against Christ. Sufferings from friends and relations are very grievous; nothing cuts more. It appears plainly, that all who will live godly in Christ Jesus must suffer persecution; and we must expect to enter into the kingdom of God through many tribulations. With these predictions of trouble, are counsels and comforts for a time of trial. The disciples of Christ are hated and persecuted as serpents, and their ruin is sought, and they need the serpent's wisdom. Be ye harmless as doves. Not only, do nobody any hurt, but bear nobody any ill-will. Prudent care there must be, but not an anxious, perplexing thought; let this care be cast upon God. The disciples of Christ must think more how to do well, than how to speak well. In case of great peril, the disciples of Christ may go out of the way of danger, though they must not go out of the way of duty. No sinful, unlawful means may be used to escape; for then it is not a door of God's opening. The fear of man brings a snare, a perplexing snare, that disturbs our peace; an entangling snare, by which we are drawn into sin; and, therefore, it must be striven and prayed against. Tribulation, distress, and persecution cannot take away God's love to them, or theirs to him. Fear Him, who is able to destroy both soul and body in hell. They must deliver their message publicly, for all are deeply concerned in the doctrine of the gospel. The whole counsel of God must be made known, Ac 20:27. Christ shows them why they should be of good cheer. Their sufferings witnessed against those who oppose his gospel. When God calls us to speak for him, we may depend on him to teach us what to say. A believing prospect of the end of our troubles, will be of great use to support us under them. They may be borne to the end, because the sufferers shall be borne up under them. The strength shall be according to the day. And it is great encouragement to those who are doing Christ's work, that it is a work which shall certainly be done. See how the care of Providence extends to all creatures, even to the sparrows. This should silence all the fears of God's people; Ye are of more value than many sparrows. And the very hairs of your head are all numbered. This denotes the account God takes and keeps of his people. It is our duty, not only to believe in Christ, but to profess that faith, in suffering for him, when we are called to it, as well as in serving him. That denial of Christ only is here meant which is persisted in, and that confession only can have the blessed recompence here promised, which is the real and constant language of faith and love. Religion is worth every thing; all who believe the truth of it, will come up to the price, and make every thing else yield to it. Christ will lead us through sufferings, to glory with him. Those are best prepared for the life to come, that sit most loose to this present life. Though the kindness done to Christ's disciples be ever so small, yet if there be occasion for it, and ability to do no more, it shall be accepted. Christ does not say that they deserve a reward; for we cannot merit any thing from the hand of God; but they shall receive a reward from the free gift of God. Let us boldly confess Christ, and show love to him in all things.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He that receiveth you ... - In all these three illustrations Christ meant to teach substantially the same thing - that he that would entertain kindly or treat with hospitality himself, his disciples, a prophet, or a righteous man, would show that he approved their character, and should not fail of proper reward. To receive in the \"name\" of a prophet is to receive \"as\" a prophet; to do proper honour to his character, and to evince attachment to the cause in which he was engaged.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41. He that receiveth a prophet—one divinely commissioned to deliver a message from heaven. Predicting future events was no necessary part of a prophet's office, especially as the word is used in the New Testament.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in the name of a prophet—for his office's sake and love to his master. (See 2Ki 4:9 and see on [1260]2Ki 4:10).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall receive a prophet's reward—What an encouragement to those who are not prophets! (See Joh 3:5-8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he that receiveth a righteous man in the name of a righteous man—from sympathy with his character and esteem for himself as such",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall receive a righteous man's reward—for he must himself have the seed of righteousness who has any real sympathy with it and complacency in him who possesses it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 10:42\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He that receiveth a prophet in the name of a prophet,.... By \"a prophet\" is meant, not one that foretells things to come, but a preacher of the Gospel; for as prophesying sometimes signifies preaching, so a prophet designs a minister of the word: and to \"receive\" him, is not only to embrace his doctrine, but to entertain him in a kind, and generous manner; and he that does this, \"in the name of a prophet\", not as coming in the name of another prophet, but upon this account, and for this consideration, because he himself is a prophet; so the phrase,  \"in the name\", or on the account of anything, is often used in the Misnic writings (s): he that regards such a person, and shows him respect, by an hospitable entertainment of him; not because he may be related to him after the flesh; or because he may be a man of good behaviour, of a singular disposition and temper, of much learning and eloquence, of great natural parts and abilities; but because he is a faithful minister of the Gospel; he ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall receive a prophet's reward: either a reward from the prophet himself, who shall interpret the Scriptures to him, preach the Gospel to him, lead him more fully into the truths of it, and guide him to the true, and more clear and distinct sense of the sacred writings; which is an ample reward for his kind entertainment of him: or else, that reward which God has appointed, prepared, and promised, to them who receive his prophets; and which indeed is no other, than what the prophets themselves shall receive, even the reward of the inheritance, the kingdom prepared from the foundation of the world, a reward of grace, and not of debt; since both, in their way, serve the Lord Christ. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he that receiveth a righteous man, in the name of a righteous man. He that is kind and liberal to any good man, whether he is a minister of the Gospel or not, who appears to have the work of grace upon his soul, and is justified by the righteousness of Christ, and expects eternal life on that account; if he shows respect to him, purely because he has the image of Christ stamped on him, and the righteousness of Christ imputed to him, and not on any natural, worldly, or civil accounts, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he shall receive a righteous man's reward; either from the good man himself, who will not fail to pray for his benefactor, to wish him well, and give him all the assistance he can in his Christian course; to exhort, comfort, instruct him as much, and as far as his Christian experience will furnish him with; or else the same reward of grace the righteous man himself shall have, namely, eternal life, as God's gift, through Jesus Christ our Lord. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) Misn. Zebachim, c. 1. sect. 1. 2, 3, 4. & 4. 6. &. 6. 7. & 7. 1, 2, 3, 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s) Misn. Zebachim, c. 1. sect. 1. 2, 3, 4. & 4. 6. &. 6. 7. & 7. 1, 2, 3, 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{11} He that receiveth a prophet in {q} the name of a prophet shall receive a prophet's reward; and he that receiveth a righteous man in the name of a righteous man shall receive a righteous man's reward.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{11}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " He that receiveth a prophet in ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the name of a prophet shall receive a prophet's reward; and he that receiveth a righteous man in the name of a righteous man shall receive a righteous man's reward.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(11) We will lose nothing that is bestowed on Christ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) As a Prophet.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A general expression, the special reference of which to the disciples is found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς ὄνομα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from a regard to that which the name implies",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to the prophetic ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "character;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διʼ αὐτὸ τὸ ὀνομάζεσθαι καὶ εἶναι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Euth. Zigabenus. In Rabbinical writers we find ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "לְשֵׁם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Schoettgen, p. 107; Buxtorf, Lex. Talm. p. 2431. Therefore; for the sake of the cause which stamps them with their distinguishing characteristics, for sake of the divine truth which the prophet interprets from the revelation that has been made to him, and for sake of the integrity which the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δίκαιος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " exhibits in his life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δίκαιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] an upright man, correct parallel to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προφήτην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The apostles, however, belong to both categories, inasmuch as they receive and preach the revelation (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προφῆται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") communicated by God through Christ, and seeing that, through their faith in the Lord, they are characterized by true and holy righteousness of life (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δίκαιοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The reward of a prophet and of a righteous man is the same reward, which they will receive (in the Messianic kingdom).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". hen in two distinct forms the law is stated that to befriend the representative of Christ and God ensures the reward belonging to that representative.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς ὄνομα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", having regard to the fact that he is a prophet or righteous man. The prophet is the principal object of thought, naturally, in connection with a mission to preach truth. But Christ knows (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that there are false prophets as well as true; therefore from vocation He falls back on personal character. Here as everywhere we see how jealously He made the ethical interest supreme. “See,” says Chrys., commenting on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “how He cares for their morals, not less than for the miracles, showing that the miracles without the morals are nought” (Hom. 32). So here He says in effect: let the prophet be of no account unless he be a just, good man. The fundamental matter is character, and the next best thing is sincere respect for it. To the latter Christ promises the reward of the former.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ δεχόμενος δίκαιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μισθὸν δ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λήψετοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": a strong, bold statement made to promote friendly feeling towards the moral heroes of the world in the hearts of ordinary people; not the utterance of a didactic theologian scientifically measuring his words. Yet there is a great principle underlying, essentially the same as that involved in St. Paul’s doctrine of justification by faith. The man who has goodness enough to reverence the ideal of goodness approximately or perfectly realised in another, though not in himself, shall, in the moral order of the world, be counted as a good man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the name of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "]=for the sake of, out of regard to the prophet’s character.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a prophet’s reward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Such reward as a prophet or preacher of the gospel hath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Those who fulfil the requirements of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Christian",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " law (comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), true members of the Christian Church—the saints.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Εἰς ὄνομα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on this ground, and on no other.[503]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προφήτην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δίκαιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a prophet—a righteous man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A prophet is one who speaks, a righteous man one who acts, in the name of God, and is distinguished for his remarkable righteousness; see ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 23:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μισθὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hire, reward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") for he shows himself as obedient to God as if he were a prophet himself. It may be asked how he who is not righteous himself can receive a righteous man as a righteous man? The reply is easy: Such a man, by the very act, abandons his evil way, and ceases to be the enemy of righteousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[503] So the French Version, published in Geneva in 1744 A.D., “En qualitè de Prophete.” The Latin expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Prophetœ nomine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is similar.—E. B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 41.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Matthew only. The whole verso recalls Jewish Christianity; it was hardly likely to have been remembered outside Jewish Christian circles. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He that receiveth a prophet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". One upon whom the mantle of the old prophets might in any sense he said to have fallen. The saying was probably ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "recorded",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with special thought of the Christian peripatetic \"prophets,\" who are brought before us so vividly in the 'Didache.' ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the name of a prophet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἰς ὄνομα προφήτου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In late Hebrew and in Aramaic the word for \"name\" passed into little more than a preposition, just as the word for \"face \"had already passed (and so the Greek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐν ὀνόματι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Here, however, this is hardly the case, the word appearing to retain its idea of both name and corresponding position. The preposition may mean ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "either",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " receive him into the position of a prophet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into the treatment with which a prophet should be received; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "or",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", simply, receive him at the rank and standing of a prophet (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Anyhow, it is in contrast to receiving him out of mere human compassion or ordinary friendliness. The reception is to have regard to that which the name implies, for the sake of the cause that the prophet represents. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall receive a prophet's reward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall share in the reward of that work in which by his kindness to the prophet he so tar takes part. Thus the widow of Sarepta shared in the blessing given to Elijah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 17:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sqq.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). (On ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "reward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note.) Observe that not the action, but the motive for the action, is made all-important. It is a matter of faith, not of works (cf Nosgen). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "he that receiveth a righteous man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "A righteous man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " one who is punctilious in performing all the details of the revealed will of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This word also is used in a quasi-Jewish sense, and points back to the time when Jewish Christians performed, not only the law as expounded in the sermon on the mount, but also those external rites and observances which had been commanded them as Jews (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Among such Jewish Christians some would he especially noticeable for their regard to these things (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " James the \"Just,\" or \"Righteous\"), and it is to one of these that the epithet here refers. Matthew 10:41",
        "children": []
      }
    ]
  }
]