[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A feast of the Lord in Shiloh.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is unlikely that the reference is to a local feast; but it is impossible to say which of the three yearly feasts is meant. The most natural would be the Feast of Tabernacles. We see from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that even among pious families the trying custom of going up to the Tabernacle three times a year had fallen into complete abeyance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A place which is on the north side of Beth-el . . .—This elaborate description of the site of Shiloh, a place which is so often mentioned elsewhere without any addition, is extremely curious. There can be little doubt that it is due to the marginal gloss of some Masoretic scribe, perhaps in the editing of the sacred books by Ezra. That it is a gloss seems clear, because it comes in as a parenthesis in the speech of the elders, and, of course, in their day such a description was needless. Indeed, it was spoken at Shiloh itself, and the site was well known to all Israel. But by the time that the story was committed to writing in the days of the kings, or finally edited in the days of Ezra, Shiloh had long been desolate, and probably the very site was unknown to thousands. Hence this very valuable and interesting description was added, which has alone enabled us to identify Shiloh in the modern Seilûn.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "A place which is on the north side of Beth-el . . .—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This elaborate description of the site of Shiloh, a place which is so often mentioned elsewhere without any addition, is extremely curious. There can be little doubt that it is due to the marginal gloss of some Masoretic scribe, perhaps in the editing of the sacred books by Ezra. That it is a gloss seems clear, because it comes in as a parenthesis in the speech of the elders, and, of course, in their day such a description was needless. Indeed, it was spoken at Shiloh itself, and the site was well known to all Israel. But by the time that the story was committed to writing in the days of the kings, or finally edited in the days of Ezra, Shiloh had long been desolate, and probably the very site was unknown to thousands. Hence this very valuable and interesting description was added, which has alone enabled us to identify Shiloh in the modern ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Seilûn.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "South of Lebonah.—Lebonah, now Lubban, is not mentioned elsewhere.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "South of Lebonah.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Lebonah, now ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Lubban, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is not mentioned elsewhere.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jdg 21:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 21:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A feast — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Probably it was the feast of tabernacles, which they celebrated with more than ordinary joy. And that feast was the only season at which the Jewish virgins were allowed to dance. But even this was not mixed dancing. No men danced with these daughters of Shiloh. Nor did the married women so forget their gravity as to join with them. However, their dancing thus in public made them an easy prey: whence Bishop Hall observes, “The ambushes of evil spirits carry away many souls from dancing to a fearful desolation.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:7-13 Micah thought it was a sign of God's favour to him and his images, that a Levite should come to his door. Thus those who please themselves with their own delusions, if Providence unexpectedly bring any thing to their hands that further them in their evil way, are apt from thence to think that God is pleased with them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Feast was probably the Passover, or one of the three great Jewish Feasts. In these unsettled times men went up to Shiloh (Seilun) only once a year ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " instead of thrice; only the males kept the Feasts, and therefore the virgins of Shiloh would naturally be the only maidens present, and the public festival would be a likely occasion for their festive dances. It is, however, possible that some particular feast unique to Shiloh is meant, like the yearly sacrifice of David's family in Bethlehem ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 20:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. on the east side of the highway that goeth up from Beth-el to Shechem—The exact site of the place was described evidently for the direction of the Benjamites.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Yearly; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on the three solemn feasts, in which they used some honest and holy recreations; among which dancing was one, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 15:20 1 Samuel 18:6 2 Samuel 6:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 6:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and probably it was the feast of tabernacles, which they did celebrate with more than ordinary joy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 16:13-15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 16:13-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which is on the north side of Beth-el, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which is on the north of Beth-el",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Which doth not relate to ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shiloh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which was so known a place, that it was frivolous to describe it by such circumstances, even by places much less known than itself; but to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "feast, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which as to that part or exercise of the feast here especially concerned and mentioned, to wit, the dancing of the virgins, was not celebrated in Shiloh, but in a neighboring place more convenient for that purpose. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then they said,.... Some of the elders that sat in council debating this matter, and considering of ways and means to assist their brethren the Benjaminites, and preserve their tribe from being lost: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "behold, there is a feast of the Lord in Shiloh yearly; where the tabernacle then was, and before which the males of Israel were obliged to appear three times of the year; and this was one of them, as is clear by its being called a feast of the Lord; and therefore cannot design any civil festival or fair kept for trade and commerce. Some have thought of the feast of the passover, but it is most likely to be the feast of tabernacles, as Abarbinel takes it to be; which in Jewish writings is emphatically called \"the feast\"; and the time of year when that was kept was a time of great rejoicing, on account of the fruits of the earth being gathered in, and the reading of the law and especially at the tithe of drawing of water at this feast; insomuch that it is said (e) that he who never saw the rejoicing at drawing of water never saw rejoicing in his life, which was attended with piping, and dancing, and singing. It is pretty strange what Kimchi notes, that this may be either one of the above feasts, or the day of atonement, at which, he says, the daughters of Israel used to go and dance in the vineyards, according to the words of the Rabbins; when though that is reckoned among the feasts, Leviticus 23:1 it was properly a fast, as it is called, Acts 27:9 and all tokens of festivity and joy were forbidden on it; and where these words of their Rabbins are to be met with, he says not: in a place ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "behold, there is a feast of the Lord in Shiloh yearly; where the tabernacle then was, and before which the males of Israel were obliged to appear three times of the year; and this was one of them, as is clear by its being called a feast of the Lord; and therefore cannot design any civil festival or fair kept for trade and commerce. Some have thought of the feast of the passover, but it is most likely to be the feast of tabernacles, as Abarbinel takes it to be; which in Jewish writings is emphatically called \"the feast\"; and the time of year when that was kept was a time of great rejoicing, on account of the fruits of the earth being gathered in, and the reading of the law and especially at the tithe of drawing of water at this feast; insomuch that it is said (e) that he who never saw the rejoicing at drawing of water never saw rejoicing in his life, which was attended with piping, and dancing, and singing. It is pretty strange what Kimchi notes, that this may be either one of the above feasts, or the day of atonement, at which, he says, the daughters of Israel used to go and dance in the vineyards, according to the words of the Rabbins; when though that is reckoned among the feasts, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it was properly a fast, as it is called, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 27:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and all tokens of festivity and joy were forbidden on it; and where these words of their Rabbins are to be met with, he says not: in a place ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "which is on the north side of Bethel; we rightly supply \"in a place\": for the intention is not to describe the situation of Shiloh, which was well known, but a place not far from it, where at this festival the daughters of Shiloh used to dance: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "on the east side of the highway that goeth up from Bethel to Shechem; this place lay to the east of a public road, that led from Bethel to Shechem: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and on the south of Lebonah; which Mr. Maundrell (f) takes to be a place now called Kane Leban, which stands on the east side of a delightful vale, having a village of the same name standing opposite to it on the other side of the vale; one of these places, either that Kane or the village, is supposed to be the Lebonah mentioned Judges 21:19 to which both the name and situation seem to agree. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and on the south of Lebonah; which Mr. Maundrell (f) takes to be a place now called Kane Leban, which stands on the east side of a delightful vale, having a village of the same name standing opposite to it on the other side of the vale; one of these places, either that Kane or the village, is supposed to be the Lebonah mentioned ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 21:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to which both the name and situation seem to agree. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Misn. Succah, c. 5. sect. 1, 4. Vid. Maimon. Hilchot Lulab, c. 8. sect. 13. (f) Journey from Aleppo, p. 63. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Misn. Succah, c. 5. sect. 1, 4. Vid. Maimon. Hilchot Lulab, c. 8. sect. 13. (f) Journey from Aleppo, p. 63. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then they said, Behold, there is a feast of the LORD in Shiloh yearly in a place which is on the {h} north side of Bethel, on the east side of the highway that goeth up from Bethel to Shechem, and on the south of Lebonah.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then they said, Behold, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a feast of the LORD in Shiloh yearly ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "in a place",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " on the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " north side of Bethel, on the east side of the highway that goeth up from Bethel to Shechem, and on the south of Lebonah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) He describes the place where the maids used to dance yearly, and sing psalms and songs of God's works among them, as the custom was then.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there is a feast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "feast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (marg.). The word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "feast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ḥag",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") strictly implies a pilgrimage to a sanctuary; the three chief ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ḥaggim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were festivals at which every male Israelite was required to appear before Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:14-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); cf. also the Mohammedan ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ḥaj",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = the pilgrimage to Mecca. What the particular feast here was we are not told; most probably it was a vintage festival to celebrate the ingathering; for this was an occasion of special rejoicing, cf. the Canaanite feast at Shechem ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and marked the end of the year (September); note that the vines were still in leaf, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jdg 21:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 21:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of the Lord … in Shiloh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Shiloh was a centre of Jehovah-worship at this early period, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 18:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A topographical gloss (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jdg 21:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 21:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 20:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") defines the situation in such a way as to leave no doubt that Shiloh is to be identified with the modern ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Seilûn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", some 2 miles E.S.E. of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lubbân",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = Lebonah; in later times, after the exile, it was probably necessary to tell readers where the ancient sites were. Obviously this addition cannot come from the author of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jdg 21:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 21:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Shiloh is first mentioned. 19a may be taken as addressed to the Benjamites: 20b gives the rest of the speech.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "There is a feast of the Lord in Shiloh yearly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare the exactly similar description, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 1:3, 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is a great difference of opinion among commentators as to what feast is here meant. Hengstenberg, Keil, Delitzsch, and others think it was the passover; Bishop Patrick and others think it was the feast of tabernacles, a more joyous feast; Rosenmuller and others think it was a festival peculiar to Shiloh, after the analogy of the yearly sacrifice of the family of Jesse at Bethlehem (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 20:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and more or less in accordance with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:10-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is not easy to say which view is right, but the last seems not improbable, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In a place which is on the north side",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The words ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in a place",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are not in the Hebrew, and do not seem to be implied by the context. But the description is that of the situation of Shiloh itself, which is very exact (see 'Palestine Exploration Fund,' Map of West Palestine). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Lebonah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " survives in el-Lubbun, about two miles north-west of Seilun, and to the west of the road to Shechem or Nablus. It seems strange that so particular a description of the situation of Shiloh should be given; but it may probably indicate that the writer lived after the tabernacle had been moved to Jerusalem, and Shiloh had relapsed into an obscure village (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 20:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note). The situation of the descriptive words in the Hebrew, with the pronoun ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "which",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", separated from ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Shiloh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "yearly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", indicates that they are an explanation added by the narrator. Judges 21:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Still Benjamin must be preserved as a tribe. The elders therefore said, \"Possession of the saved shall be for Benjamin,\" i.e., the tribe-land of Benjamin shall remain an independent possession for the Benjaminites who have escaped the massacre, so that a tribe may not be destroyed out of Israel. It was necessary therefore, that they should take steps to help the remaining Benjaminites to wives. The other tribes could not give them their daughters, on account of the oath which has already been mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 21:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 21:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and is repeated here (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 21:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Consequently there was hardly any other course open, than to let the Benjaminites seize upon wives for themselves. And the elders lent them a helping hand by offering them this advice, that at the next yearly festival at Shiloh, at which the daughters of Shiloh carried on dances in the open air (outside the town), they should seize upon wives for themselves from among these daughters, and promising them that when the thing was accomplished they would adjust it peaceably (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 21:19-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The \"feast of Jehovah,\" which the Israelites kept from year to year, was one of the three great annual festivals, probably one which lasted seven days, either the passover or the feast of tabernacles-most likely the former, as the dances of the daughters of Shiloh were apparently an imitation of the dances of the Israelitish women at the Red Sea under the superintendence of Miriam (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The minute description of the situation of Shiloh (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 21:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), viz., \"to the north of Bethel, on the east of the road which rises from Bethel to Shechem, and on the south of Lebonah\" (the present village of Lubban, on the north-west of Seilun: see Rob. Pal. iii. p. 89), serves to throw light upon the scene which follows, i.e., to show how the situation of Shiloh was peculiarly fitted for the carrying out of the advice given to the Benjaminites; since, as soon as they had issued from their hiding-places in the vineyards at Shiloh, and seized upon the dancing virgins, they could easily escape into their own land by the neighbouring high-road which led from Bethel to Shechem, without being arrested by the citizens of Shiloh. ",
        "children": []
      }
    ]
  }
]