[{"num":3,"verse":"The war between the house of Sha’ul and the house of David dragged on, but David grew stronger, while the house of Sha’ul became weaker."},{"num":2,"verse":"Sons were born to David in Hevron. His firstborn was Amnon, whose mother was Achino‘am from Yizre‘el; "},{"num":3,"verse":"his second, Kil’av, whose mother was Avigayil the widow of Naval from Karmel; the third, Avshalom, whose mother was Ma‘akhah the daughter of Talmai king of G’shur; "},{"num":4,"verse":"the fourth, Adoniyah the son of Haggit; the fifth, Sh’fatyah the son of Avital; "},{"num":5,"verse":"and the sixth, Yitre‘am, whose mother was ‘Eglah David’s wife. These were born to David in Hevron."},{"num":6,"verse":"During the war that was going on between the house of Sha’ul and the house of David, Avner strengthened his position in the house of Sha’ul. "},{"num":7,"verse":"Sha’ul had had a concubine named Ritzpah, the daughter of Ayah; and [Ish-Boshet] challenged Avner: “Why did you go and sleep with my father’s concubine?” "},{"num":8,"verse":"These words of Ish-Boshet’s enraged Avner. “What am I,” he shouted, “[that you treat me with such contempt]? A dog’s head in Y’hudah? Till this moment I have shown only kindness to the house of Sha’ul your father, and to his brothers and to his friends; and I haven’t handed you over to David. Yet you choose today to pick a fight with me over this woman! "},{"num":9,"verse":"May God bring terrible curses on Avner and worse ones yet if I don’t accomplish what Adonai swore to David — "},{"num":10,"verse":"to transfer the kingdom from the house of Sha’ul and set up the throne of David over Isra’el and Y’hudah, from Dan all the way to Be’er-Sheva!” "},{"num":11,"verse":"Ish-Boshet couldn’t answer Avner a word, because he was afraid of him."},{"num":12,"verse":"Avner immediately sent envoys to David with this message: “Who is going to control the land? If you make yourself my ally, I will use my power to bring all Isra’el over to you.” "},{"num":13,"verse":"David sent this reply: “Very well, I will be your ally — on one condition: you will not come into my presence unless at the same time you bring with you Mikhal Sha’ul’s daughter.” "},{"num":14,"verse":"David sent messengers to say to Ish-Boshet the son of Sha’ul, “Give me back my wife Mikhal. I betrothed her to myself for 100 foreskins of the P’lishtim.” "},{"num":15,"verse":"Ish-Boshet sent and took her from her husband Palti’el the son of Layish. "},{"num":16,"verse":"Her husband went with her, crying as he went, and followed her to Bachurim. But when Avner told him, “Go back,” he returned."},{"num":17,"verse":"Then Avner conferred with the leaders of Isra’el. He said, “In the past, you wanted David to be king over you. "},{"num":18,"verse":"So now, do it. For Adonai has said of David, ‘Through my servant David I will rescue my people Isra’el from the power of the P’lishtim and from the power of all their enemies.’” "},{"num":19,"verse":"Avner also spoke with the people of Binyamin."},{"num":20,"verse":"When Avner came to David in Hevron he brought twenty men with him. David held a feast for Avner and his men. "},{"num":21,"verse":"Avner said to David, “I must get up and go to gather all Isra’el to my lord the king, so that they can make a covenant with you. Then you will be able to rule over everything your heart desires.” David sent Avner off, giving him safe conduct."},{"num":22,"verse":"Just then David’s men and Yo’av returned from a raid, bringing a lot of plunder with them. But Avner was not with David in Hevron, because he had sent him off under safe conduct. "},{"num":23,"verse":"When Yo’av and all his army had arrived, Yo’av was told, “Avner the son of Ner came to the king, but he sent him off, and he has left under safe conduct.” "},{"num":24,"verse":"Yo’av went to the king and said, “What have you done? Here, Avner came to you, and you sent him away, and now he’s gone! Why? "},{"num":25,"verse":"You know Avner the son of Ner — he came only to deceive you, to learn what campaigns you’re planning and to find out everything you’re doing!”"},{"num":26,"verse":"After leaving David, Yo’av sent messengers after Avner, and they brought him back from the water cistern at Sirah without David’s knowledge. "},{"num":27,"verse":"Upon Avner’s return to Hevron, Yo’av took him aside into the space between the outer and inner city gates as if to speak with him privately; and there he struck him in the groin, so that he died — thus avenging the death of ‘Asah’el his brother."},{"num":28,"verse":"Afterwards, when David heard of it, he said, “I and my kingdom are forever innocent of the death of Avner the son of Ner. "},{"num":29,"verse":"Let it fall on the head of Yo’av and all his father’s family. May Yo’av’s family always have someone with a hemorrhage or tzara‘at, or who has to walk with a cane, or who dies by the sword or who lacks food.” "},{"num":30,"verse":"Thus Yo’av and Avishai his brother killed Avner, because he had killed their brother ‘Asah’el during the battle in Giv‘on. "},{"num":31,"verse":"But David said to Yo’av and all those with him, “Tear your clothes, put on sackcloth, and mourn over Avner.” King David himself walked behind the body as it was carried. "},{"num":32,"verse":"They buried Avner at Hevron; the king wept aloud at Avner’s grave, and all the people wept. "},{"num":33,"verse":"The king sang this lament over Avner:"},{"num":35,"verse":"All the people came to David and tried to make him eat some bread while it was still daytime; but David swore, “May God bring terrible curses on me and worse ones yet if I taste bread or anything else until the sun goes down.” "},{"num":36,"verse":"All the people took note of this, and it pleased them; whatever the king did pleased all the people. "},{"num":37,"verse":"So that day, all the people and all Isra’el understood that the king had had no part in the killing of Avner the son of Ner. "},{"num":38,"verse":"The king said to his servants, “You realize that a leader, a great man, has fallen today in Isra’el. "},{"num":39,"verse":"Even though I have just been anointed king, I feel weak today; and these men, the sons of Tz’ruyah, are too brutal for me. May Adonai repay the criminal as his crime deserves!”"}]