[{"header":"Chapter 3"},{"num":1,"verse":"A lengthy war ensued between the house of Saul and the house of David. As time went on, David grew steadily stronger, while the house of Saul became notably weaker."},{"num":2,"verse":"Sons Born in Hebron. Sons were born to David at Hebron. His firstborn was Amnon, whose mother was Ahinoam of Jezreel;"},{"num":3,"verse":"his second was Chileab, whose mother was Abigail, the widow of Nabal of Carmel; his third was Absalom, whose mother was Maacah, the daughter of Talmai, the king of Geshur;"},{"num":4,"verse":"the fourth was Adonijah, whose mother was Haggith; the fifth was Shephatiah, the son of Abital;"},{"num":5,"verse":"the sixth was Ithream, the son of David’s wife Eglah. These were born to David in Hebron."},{"num":6,"verse":"Ishbaal and Abner Quarrel. During the war between the house of Saul and the house of David, Abner had gradually been gaining power in the house of Saul."},{"num":7,"verse":"Now Saul had had a concubine whose name was Rizpah, the daughter of Aiah. And Ishbaal said to Abner: “Why have you slept with my father’s concubine?”"},{"num":8,"verse":"Abner became enraged at this insult of Ishbaal, and he said: “Am I nothing more than a dog’s head in Judah? I have continued to be loyal to the house of your father Saul and to his brothers and friends, and I have not betrayed you into the hands of David. Yet now you charge me with a crime involving a woman."},{"num":9,"verse":"“May God punish Abner severely, and inflict even greater ills, if I fail to accomplish for David what the Lord swore to him."},{"num":10,"verse":"I shall take the kingdom from the house of Saul and establish the throne of David over Israel and over Judah, from Dan to Beer-sheba.”"},{"num":11,"verse":"And Ishbaal did not dare to say another word in response, because he was afraid of him."},{"num":12,"verse":"Abner and David Reconciled. Abner sent messengers on his own behalf to say to David: “Who should control the land? If you come to an agreement with me, I will give you my support in bringing all Israel over to you.”"},{"num":13,"verse":"David replied: “Good! I will negotiate an agreement with you. However, I will impose one condition. You will not be allowed to appear in my presence unless you bring back Saul’s daughter, Michal, when you come to see me.”"},{"num":14,"verse":"Then David also sent messengers to Ishbaal, the son of Saul, with this demand: “Return to me my wife Michal whom I espoused after paying the ransom of one hundred foreskins of the Philistines.”"},{"num":15,"verse":"Therefore, Ishbaal summoned Michal and took her away from her husband Paltiel, the son of Laish."},{"num":16,"verse":"However, her husband, weeping copiously, followed her as far as Horonaim, at which time Abner commanded him: “Go back,” and he returned home."},{"num":17,"verse":"Abner then proceeded to confer with the elders of Israel. “For a long time now,” he said, “you have wanted David to be your king."},{"num":18,"verse":"Now is the time for you to make that wish a reality, for the Lord has said of David: ‘By means of my servant David I will deliver my people Israel from the hand of the Philistines and from all their enemies.’ ”"},{"num":19,"verse":"Abner also spoke personally to the Benjaminites. After that he went to Hebron to notify David about everything that the people of Israel and the house of Benjamin had agreed to do."},{"num":20,"verse":"When Abner, accompanied by twenty men, came to David at Hebron, David prepared a feast for Abner and the men who were with him."},{"num":21,"verse":"Abner then said to David: “Allow me now to go and assemble all Israel for my lord the king, in order that they may make a covenant with you, and thus you will reign over all that your heart desires.” Therefore, David dismissed Abner, who went away in peace."},{"num":22,"verse":"The Death of Abner. Just then, David’s men returned with Joab from a raid, bringing with them a large amount of plunder. By then Abner had been dismissed by David and was no longer in Hebron, for he had gone his way in peace."},{"num":23,"verse":"When Joab and all of the soldiers with him arrived, Joab was informed that Abner, the son of Ner, had come to the king, and that the king had sent him on his way in peace."},{"num":24,"verse":"Then Joab went to the king and said: “What have you done? Abner came to you. What motivated you to dismiss him and allow him to go away as an innocent man?"},{"num":25,"verse":"You must be aware that Abner, the son of Ner, came here with the purpose of deceiving you, in order to learn about your movements and to find out what you are doing.”"},{"num":26,"verse":"When Joab left David’s presence, he sent messengers to pursue Abner, and they brought him back from the cistern of Sirah. However, David knew nothing at all about this."},{"num":27,"verse":"When Abner returned to Hebron, Joab pretended that he wanted to speak to him privately and took him aside at the city gate, where he stabbed him fatally in the stomach. Thus Abner died in retaliation for the murder of Asahel, the brother of Joab."},{"num":28,"verse":"Later, when David heard the news, he said: “Before the Lord, I and my kingdom are forever innocent of the blood of Abner, the son of Ner."},{"num":29,"verse":"May the guilt for this act fall on the head of Joab and his entire family. May the house of Joab never be unafflicted by men who suffer from running sores or leprosy or effeminacy or who are doomed to die by the sword or are in need of bread.” ("},{"num":30,"verse":"Joel and his brother Abishai had murdered Abner because he had killed their brother Asahel at the battle of Gibeon.)"},{"num":31,"verse":"David Mourns Abner. Then David said to Joab and all the people who were with him: “Tear off your clothes, put on sackcloth, and mourn over Abner.” King David himself walked behind the bier."},{"num":32,"verse":"After they buried Abner at Hebron, the king wept aloud at the grave of Abner, and all the people also wept."},{"num":33,"verse":"Then the king sang this lament for Abner:"},{"num":35,"verse":"After that, the people tried to persuade David to eat something while it was still day, but David swore: “May God deal with me severely, and even more terribly, if I eat bread or anything else prior to sunset.”"},{"num":36,"verse":"All the people took note of his pledge with approval, just as everything that the king did truly pleased them."},{"num":37,"verse":"Therefore, on that day the people and all Israel were fully convinced that the king had no part in the killing of Abner, the son of Ner."},{"num":38,"verse":"Then the king said to his servants: “You surely must realize that a prince and a great warrior has fallen this day in Israel."},{"num":39,"verse":"And today, even though I have been anointed as the king, I feel weak and powerless with the realization that these men, the sons of Zeruiah, are too strong for me. May the Lord repay the evildoer as his evil crimes deserve.”"}]