[{"header":"Betrayal of Abner"},{"num":3,"verse":"Now the war between the house of Saul and the house of David lasted a long time. While David grew steadily stronger, the house of Saul grew steadily weaker. "},{"num":2,"verse":"Sons were born to David in Hebron: his firstborn was Amnon by Ahinoam of Jezreel; "},{"num":3,"verse":"his second was Chileab by Abigail the widow of Nabal the Carmelite; the third was Absalom son of Maacah daughter of King Talmai of Geshur; "},{"num":4,"verse":"the fourth was Adonijah son of Haggith; the fifth was Shephatiah son of Abital; "},{"num":5,"verse":"and the sixth, Ithream, by David’s wife Eglah. These were born to David in Hebron."},{"num":6,"verse":"During the war between the house of Saul and the house of David, Abner strengthened his position in the house of Saul. "},{"num":7,"verse":"Now Saul had a concubine, whose name was Rizpah daughter of Aiah; and Ish-bosheth said to Abner, “Why have you slept with my father’s concubine?”"},{"num":8,"verse":"But Abner became very angry over Ish-bosheth’s words and said, “Am I a dog’s head from Judah? To this day I’ve been loyal to the house of Saul your father, to his kinsmen, and to his friends, and I haven’t handed you over to David—yet today you are accusing me of wrongdoing with this woman. "},{"num":9,"verse":"May God do so to Abner and even more if, as Adonai has sworn to David, I don’t accomplish this for him—"},{"num":10,"verse":"to transfer the kingdom from the house of Saul and establish the throne of David over Israel and Judah, from Dan to Beersheba!” "},{"num":11,"verse":"But Ish-bosheth could not respond to Abner another word, because he was afraid of him."},{"num":12,"verse":"Then Abner sent messengers to David on his behalf saying, “Whose is the land? Make your covenant with me, and see, my hand will be with you to bring all Israel over to you.”"},{"num":13,"verse":"“Good!” said David. “I will cut a covenant with you. But one thing I require of you: you will not see my face unless you first bring Saul’s daughter Michal when you come to see my face.”"},{"num":14,"verse":"Then David sent messengers to Saul’s son Ish-bosheth demanding, “Give me my wife Michal, whom I betrothed to myself for 100 Philistine foreskins.” "},{"num":15,"verse":"So Ish-bosheth sent and took her from her husband, Paltiel son of Laish. "},{"num":16,"verse":"But her husband accompanied her, weeping as he went, and followed her as far as Bahurim. Then Abner said to him, “Go, return!” So he returned."},{"num":17,"verse":"Now Abner had a word with the elders of Israel saying, “In times past you wanted David to be king over you. "},{"num":18,"verse":"So now do it! For Adonai has spoken of David saying, ‘By the hand of My servant David I will deliver My people Israel from the hand of the Philistines and from the hand of all their enemies.’” "},{"num":19,"verse":"Abner also spoke in the hearing of Benjamin. Then Abner went to Hebron to speak in the hearing of David about all that was agreeable to Israel and to the whole house of Benjamin."},{"num":20,"verse":"When Abner came to David in Hebron along with 20 other men, David held a banquet for Abner and the men with him. "},{"num":21,"verse":"Abner said to David, “Let me get up and go rally all Israel to my lord the king, so that they may cut a covenant with you, and you may reign over all that your soul desires.” So David sent Abner away, and he departed in shalom."},{"num":22,"verse":"Just then, David’s soldiers and Joab came from a raid, bringing with them much spoil. By then Abner was no longer with David in Hebron, for he had sent him away, and he departed in shalom. "},{"num":23,"verse":"When Joab and all the soldiers with him arrived, they told Joab, saying, “Abner son of Ner came to the king, and he has sent him away, and he has gone in shalom.”"},{"num":24,"verse":"Then Joab came to the king and said, “What have you done? Look here, Abner came to you—why did you send him away? Now he is getting away! "},{"num":25,"verse":"You know Abner son of Ner—surely he came to deceive you, to spy on your goings and comings, and to find out all that you are doing.”"},{"num":26,"verse":"When Joab left David, he sent messengers after Abner, so they brought him back from the well of Sirah, though David knew nothing about it. "},{"num":27,"verse":"Now when Abner returned to Hebron, Joab took him aside within the gate to speak with him privately, and there stabbed him in the groin, so that he died—on account of the blood of his brother Asahel. "},{"num":28,"verse":"When David heard about it afterward, he said, “I and my kingdom are innocent before Adonai forever from the blood of Abner son of Ner. "},{"num":29,"verse":"May it whirl on Joab’s head and on all his father’s house. May the house of Joab never be without someone with discharge or tza’arat, lame or one fallen by the sword or one who lacks food.” "},{"num":30,"verse":"So Joab and Abishai his brother killed Abner because he had killed their brother Asahel at Gibeon in battle."},{"num":31,"verse":"Then David said to Joab and to all the people who were with him, “Rend your clothes, gird with sackcloth, and lament before Abner.” King David walked behind the platform. "},{"num":32,"verse":"When they buried Abner in Hebron, the king lifted up his voice and wept aloud at Abner’s grave, and all the people wept. "},{"num":33,"verse":"Then the king chanted a lament for Abner and said,"},{"num":35,"verse":"Then all the people came to urge David to eat some food while it was still day, but David vowed saying, “May God do so to me and even more if I taste food or anything else before the sun sets.” "},{"num":36,"verse":"All the people took note of it and it pleased them, just as everything the king did pleased all the people. "},{"num":37,"verse":"So all the people and all Israel understood that day that it was not the king’s will to kill Abner son of Ner. "},{"num":38,"verse":"Then the king said to his soldiers, “Don’t you realize that a prince and a great man has fallen in Israel today? "},{"num":39,"verse":"So today I am vulnerable, even though anointed king. These men, the sons of Zeruiah, are too hard for me to handle. May Adonai reward the evildoer according to his wickedness.”"}]