[{"num":3,"verse":"This was the beginning of a long war between the forces loyal to David and the forces loyal to Saul’s son Ish-bosheth. David’s forces continued to grow in strength, while the forces of Saul’s son Ish-bosheth grew ever weaker."},{"num":2,"verse":"While David was king at Hebron, he fathered these sons: the first was Amnon, whose mother was Ahinoam of Jezreel; "},{"num":3,"verse":"his second was Chileab, whose mother was Abigail, the widow of Nabal of Carmel; his third was Absalom, whose mother was Maacah, daughter of King Talmai of Geshur; "},{"num":4,"verse":"his fourth was Adonijah, whose mother was Haggith; his fifth was Shephatiah, whose mother was Abital; "},{"num":5,"verse":"his sixth was Ithream, whose mother was David’s wife Eglah. All of these sons were born at Hebron."},{"num":6,"verse":"During the war between David and the house of Saul, Abner was carving out a place of power among those who supported Saul’s family. "},{"num":7,"verse":"Earlier Saul had a mistress named Rizpah, who was the daughter of Aiah. Ish-bosheth went to Abner and accused him."},{"num":8,"verse":"This accusation of disloyalty made Abner very angry."},{"num":11,"verse":"Ish-bosheth didn’t dare to say anything else to Abner after this; he was afraid of him."},{"num":12,"verse":"Abner sent this message on his own behalf to David at Hebron:"},{"num":14,"verse":"At the same time, David sent Ish-bosheth, Saul’s son, this message:"},{"num":15,"verse":"So Ish-bosheth sent for Michal and had her taken away from her husband Paltiel, the son of Laish. "},{"num":16,"verse":"Paltiel followed the party, weeping, all the way to Bahurim in Benjamin. Finally Abner ordered him to stop following them, and he returned home."},{"num":17,"verse":"Abner sent a message to the leaders of Israel."},{"num":19,"verse":"Abner also communicated directly with the people of Benjamin, Saul’s tribe, to enlist their support; and at last he went to Hebron to tell David that the people of Israel—all of them, including Benjamin—were ready to support him."},{"num":20,"verse":"Abner came with 20 of his men to meet with David at Hebron, and David held a great feast for them."},{"num":22,"verse":"But after he left, Joab and some of David’s warriors returned with the spoils of a raid. "},{"num":23,"verse":"Joab and his forces arrived and heard that Abner, the son of Ner, had met with the king, and that he had gone his way in peace. "},{"num":24,"verse":"Joab went to David."},{"num":26,"verse":"When Joab left David’s presence, he sent for messengers to find Abner. They caught up to him at the cistern of Sirah; and without David’s knowledge, "},{"num":27,"verse":"Abner returned to Hebron. Then, under the pretext of speaking to Abner privately, Joab took him inside the gateway and stabbed him in the stomach. Joab had his revenge on Abner for killing his brother Asahel, and Abner died."},{"num":28,"verse":"When David heard this news, he wanted it understood:"},{"num":30,"verse":"This was the curse King David pronounced because Joab and his brother Abishai murdered Abner in revenge for their brother Asahel, whom Abner killed at the battle at Gibeon. "},{"num":31,"verse":"Then David gave an order to Joab and his followers."},{"num":32,"verse":"They buried Abner at Hebron. At the graveside, David lifted his voice and wept for Abner; and the people wept with him."},{"num":33,"verse":"The king sang a song of lament for Abner."},{"num":35,"verse":"After the ceremony, the people came to David and tried to convince him to eat something that day, but he turned them away because fasting until evening was part of the mourning ritual."},{"num":36,"verse":"The people noticed that he honored Abner by fasting, and they approved—as they approved of everything their king did. "},{"num":37,"verse":"So everyone believed it was not David’s intention, nor did he have any part in the murder of Abner, the son of Ner."}]