[{"header":"The Lord Calls Samuel"},{"num":3,"verse":"Meanwhile the boy Samuel was serving the Lord before Eli. A word from the Lord was rare in those days, and visions were infrequent. "},{"num":2,"verse":"At that time Eli, whose vision was growing dim, was lying down in his bedroom. "},{"num":3,"verse":"The lamp of God had not yet been extinguished, and Samuel was lying down in the tent of the Lord where the Ark of God was. "},{"num":4,"verse":"The Lord called out to Samuel, who answered, “Here I am.”"},{"num":5,"verse":"He ran to Eli and said, “Here I am! You called me.”"},{"num":6,"verse":"Then the Lord again called out, “Samuel!”"},{"num":7,"verse":"Now Samuel did not yet know the Lord and had not yet had the word of the Lord revealed to him."},{"num":8,"verse":"Then the Lord called out to Samuel again a third time, and he got up, went to Eli, and said, “Here I am! You called me.”"},{"num":9,"verse":"so Eli told Samuel, “Go lie down, and then if he calls you, answer, ‘Speak, Lord, because your servant is listening.’” Then Samuel went and lay down."},{"num":10,"verse":"Later, the Lord came and stood there, calling out, “Samuel! Samuel!” as he had before."},{"num":11,"verse":"“Look,” the Lord told Samuel. “I’m about to do something in Israel that will make both ears of anyone who hears it tingle. "},{"num":12,"verse":"I’ll fulfill every promise that I’ve spoken concerning Eli’s family, from beginning to end. "},{"num":13,"verse":"I’ve told him that I’m about to judge his family forever because of the iniquity that he knew about. His sons committed blasphemy and he did not rebuke them. "},{"num":14,"verse":"Therefore I’ve sworn concerning Eli’s family that the iniquity of his family is not to be atoned for by sacrifice or offering forever.”"},{"header":"Samuel Delivers God’s Message"},{"num":15,"verse":"Samuel lay down until morning and then opened the doors of the house of the Lord, but he was afraid to report the vision to Eli. "},{"num":16,"verse":"Then Eli called Samuel: “Samuel, my son.”"},{"num":17,"verse":"Eli said, “What did the Lord say to you? Please don’t conceal anything from me. May God do this to you and even more if you conceal from me one word of all that he spoke to you.” "},{"num":18,"verse":"So Samuel told him everything—he did not conceal anything from him. Eli said, “He is the Lord. May he do what seems good to him.”"},{"num":19,"verse":"As Samuel grew, the Lord was with him and did not let any of Samuel’s predictions fail. "},{"num":20,"verse":"All Israel from Dan to Beer-sheba knew that Samuel was confirmed as the Lord’s prophet. "},{"num":21,"verse":"The Lord continued to appear at Shiloh, because he revealed himself to Samuel at Shiloh by means of messages from the Lord."}]