[{"header":"Israel at Sinai"},{"num":19,"verse":"In the third month after the Israelites had left the land of Egypt, on that same day of the month, they came to the Wilderness of Sinai. "},{"num":2,"verse":"After they set out from Rephidim and came to the Wilderness of Sinai, they camped in the wilderness. Israel camped there in front of the mountain."},{"num":3,"verse":"Moses went up to God, and the Lord called to him from the mountain, “This is what you are to say to the house of Jacob and to tell the people of Israel: "},{"num":4,"verse":"‘You have seen what I did to the Egyptians and how I carried you on eagles’ wings and brought you to myself. "},{"num":5,"verse":"Now if you will carefully listen to my voice and keep my covenant, then you will be my special treasure out of all the nations, although the entire earth is mine. "},{"num":6,"verse":"You will be my kingdom of priests and my holy nation.’ These are the words that you are to speak to the Israelites.”"},{"num":7,"verse":"Moses went and summoned the elders of the people, and he set before them all these words that the Lord had commanded him. "},{"num":8,"verse":"All the people answered together, “Everything that the Lord has said, we will do.”"},{"num":9,"verse":"The Lord said to Moses, “Look, I will come to you in a dense cloud so that the people will hear when I speak with you, and then they will always believe you.” Moses told the people’s words to the Lord."},{"num":10,"verse":"The Lord said to Moses, “Go to the people. Consecrate them today and tomorrow, and have them wash their clothes. "},{"num":11,"verse":"Be ready by the third day, for on the third day the Lord will come down on Mount Sinai in the sight of all the people. "},{"num":12,"verse":"You shall set boundaries for the people all around the mountain. Tell them: ‘Be careful that you do not go up onto the mountain or touch the edge of it.’ Whoever touches the mountain must certainly be put to death. "},{"num":13,"verse":"No one’s hand is to touch such a person, but that person is to be stoned to death or shot with arrows. No such animal or person shall be allowed to live. But when the special ram’s horn sounds a long blast, the people may come up to the mountain.”"},{"num":14,"verse":"Moses went down from the mountain to the people. He consecrated the people, and they washed their clothes. "},{"num":15,"verse":"He said to the people, “Be ready by the third day. Do not come near a woman.”"},{"num":16,"verse":"On the third day, when morning came, there was thunder and lightning. A thick cloud was over the mountain, and there was a very loud blast of a ram’s horn. All the people in the camp trembled. "},{"num":17,"verse":"Moses brought the people out of the camp to meet God, and they stood at the foot of the mountain. "},{"num":18,"verse":"All of Mount Sinai was covered with smoke, because the Lord descended on it in fire. Its smoke went up like the smoke from a kiln, and the whole mountain trembled violently. "},{"num":19,"verse":"When the sound of the ram’s horn grew louder and louder, Moses spoke, and God answered him in the thunder. "},{"num":20,"verse":"The Lord came down on Mount Sinai, at the top of the mountain. The Lord then called Moses to the top of the mountain, and Moses went up."},{"num":21,"verse":"The Lord said to Moses, “Go down and warn the people not to break through to see the Lord. If they do, many of them will fall. "},{"num":22,"verse":"Even the priests, who approach the Lord, must consecrate themselves so that the Lord does not break out against them.”"},{"num":23,"verse":"Moses said to the Lord, “The people cannot come up to Mount Sinai, because you warned, ‘Set boundaries around the mountain and treat it as holy.’”"},{"num":24,"verse":"The Lord said to him, “Go down and bring Aaron up with you, but the priests and the people must not break through to come up to the Lord, so that the Lord will not break out against them.”"},{"num":25,"verse":"So Moses went down to the people and told them these things."}]