[[],[{"type":"header","content":"The Slaughter of the Idolaters"},{"type":"prose","content":"Then he cried in my hearing with a loud voice, saying, “Draw near, you executioners of the city, each with his destroying weapon in his hand.” "}],[{"type":"prose","content":"And six men came from the direction of the upper gate, which faces north, each with his weapon for slaughter in his hand; among them was a man clothed in linen, with a writing case at his side. They went in and stood beside the bronze altar."}],[{"type":"prose","content":"Now the glory of the God of Israel had gone up from the cherub on which it rested to the threshold of the house. The  called to the man clothed in linen, who had the writing case at his side; "}],[{"type":"prose","content":"and said to him, “Go through the city, through Jerusalem, and put a mark on the foreheads of those who sigh and groan over all the abominations that are committed in it.” "}],[{"type":"prose","content":"To the others he said in my hearing, “Pass through the city after him, and kill; your eye shall not spare, and you shall show no pity. "}],[{"type":"prose","content":"Cut down old men, young men and young women, little children and women, but touch no one who has the mark. And begin at my sanctuary.” So they began with the elders who were in front of the house. "}],[{"type":"prose","content":"Then he said to them, “Defile the house, and fill the courts with the slain. Go!” So they went out and killed in the city. "}],[{"type":"prose","content":"While they were killing, and I was left alone, I fell prostrate on my face and cried out, “Ah Lord ! will you destroy all who remain of Israel as you pour out your wrath upon Jerusalem?” "}],[{"type":"prose","content":"He said to me, “The guilt of the house of Israel and Judah is exceedingly great; the land is full of bloodshed and the city full of perversity; for they say, ‘The  has forsaken the land, and the  does not see.’ "}],[{"type":"prose","content":"As for me, my eye will not spare, nor will I have pity, but I will bring down their deeds upon their heads.”"}],[{"type":"prose","content":"Then the man clothed in linen, with the writing case at his side, brought back word, saying, “I have done as you commanded me.”"}]]