[{"num":42,"verse":"While they were at Geruth Kimham, Johanan son of Kareah and Jezaniah son of Hoshaiah went to Jeremiah the prophet. All the army officers went with Johanan and Jezaniah. All the people, from the least important to the most important, went to Jeremiah."},{"num":2,"verse":"They said to him, “Jeremiah, please listen to what we ask. Pray to the Lord your God for all those who are survivors from the family of Judah. Jeremiah, you can see that there are not many of us left. At one time there were many of us."},{"num":3,"verse":"Jeremiah, pray that the Lord your God will tell us where we should go and what we should do.”"},{"num":4,"verse":"Then Jeremiah the prophet answered, “I understand what you want me to do. I will pray to the Lord your God, as you asked me to do. I will tell you everything the Lord says. I will not hide anything from you.”"},{"num":5,"verse":"Then the people said to Jeremiah, “If we don’t do everything the Lord your God tells us, then we hope the Lord will be a true and faithful witness against us. We know he will send you to tell us what to do."},{"num":6,"verse":"It doesn’t matter if we like the message or if we don’t like the message. We will obey the Lord our God. We are sending you to the Lord for a message from him. We will obey what he says. Then good things will happen to us. Yes, we will obey the Lord our God.”"},{"num":7,"verse":"At the end of ten days, the message from the Lord came to Jeremiah."},{"num":8,"verse":"Then Jeremiah called together Johanan son of Kareah and the army officers who were with him. He also called all the other people together, from the least important to the most important."},{"num":9,"verse":"Then Jeremiah said to them, “You sent me to the Lord, the God of Israel, and I asked him what you wanted me to ask. This is what he says:"},{"num":10,"verse":"‘If you will stay in Judah, I will make you strong—I will not destroy you. I will plant you, and I will not pull you up. I will do this because I am sad about the terrible things that I made happen to you."},{"num":11,"verse":"Now you are afraid of the king of Babylon. But don’t be afraid of him. Don’t be afraid of the king of Babylon,’ says the Lord, ‘because I am with you. I will save you. I will rescue you. He will not get his hands on you."},{"num":12,"verse":"I will be kind to you, and the king of Babylon will also treat you with mercy. He will bring you back to your land.’"},{"num":13,"verse":"But you might say, ‘We will not stay in Judah.’ If you say that, you will disobey the Lord your God."},{"num":14,"verse":"And you might say, ‘No, we will go and live in Egypt. We will not be bothered with war there. We will not hear the trumpets of war, and in Egypt we will not be hungry.’"},{"num":15,"verse":"If you say that, listen to this message from the Lord, you survivors from Judah. This is what the Lord All-Powerful, the God of the people of Israel, says: ‘If you decide to go and live in Egypt, this will happen:"},{"num":16,"verse":"You are afraid of the sword of war, but it will defeat you there. And you are worried about hunger, but you will be hungry in Egypt. You will die there."},{"num":17,"verse":"Everyone who decides to go live in Egypt will die by war, hunger, or disease. Not one person who goes to Egypt will survive. Not one of them will escape the terrible things that I will bring to them.’"},{"num":18,"verse":"“This is what the Lord All-Powerful, the God of the people of Israel, says: ‘I showed my anger against Jerusalem. I punished the people who lived there. In the same way I will show my anger against everyone who goes to Egypt. People will use you as an example when they ask for bad things to happen to other people. You will become like a curse word. People will be ashamed of you, and they will insult you. And you will never see Judah again.’"},{"num":19,"verse":"“Survivors of Judah, the Lord told you: ‘Don’t go to Egypt.’ I warn you right now,"},{"num":20,"verse":"you are making a mistake that will cause your deaths. You sent me to the Lord your God. You said to me, ‘Pray to the Lord our God for us. Tell us everything the Lord our God says to do. We will obey him.’"},{"num":21,"verse":"So today I have told you the message from the Lord. But you have not obeyed the Lord your God. You have not done all that he sent me to tell you to do."},{"num":22,"verse":"So now be sure you understand this: You want to go live in Egypt. But these things will happen to you in Egypt: You will die by a sword, or hunger, or terrible sickness.”"}]