[{"header":"Help Carry Each Other’s Burdens"},{"num":6,"verse":"Brothers and sisters, if a person gets trapped by wrongdoing, those of you who are spiritual should help that person turn away from doing wrong. Do it in a gentle way. At the same time watch yourself so that you also are not tempted. "},{"num":2,"verse":"Help carry each other’s burdens. In this way you will follow Christ’s teachings. "},{"num":3,"verse":"So if any one of you thinks you’re important when you’re really not, you’re only fooling yourself. "},{"num":4,"verse":"Each of you must examine your own actions. Then you can be proud of your own accomplishments without comparing yourself to others. "},{"num":5,"verse":"Assume your own responsibility."},{"header":"We Will Harvest What We Plant"},{"num":6,"verse":"The person who is taught God’s word should share all good things with his teacher. "},{"num":7,"verse":"Make no mistake about this: You can never make a fool out of God. Whatever you plant is what you’ll harvest. "},{"num":8,"verse":"If you plant in ⌞the soil of⌟ your corrupt nature, you will harvest destruction. But if you plant in ⌞the soil of⌟ your spiritual nature, you will harvest everlasting life. "},{"num":9,"verse":"We can’t allow ourselves to get tired of living the right way. Certainly, each of us will receive ⌞everlasting life⌟ at the proper time, if we don’t give up. "},{"num":10,"verse":"Whenever we have the opportunity, we have to do what is good for everyone, especially for the family of believers."},{"header":"Paul Summarizes His Teachings about Circumcision"},{"num":11,"verse":"Look at how large the letters ⌞in these words⌟ are because I’m writing this myself."},{"num":12,"verse":"These people who want to make a big deal out of a physical thing are trying to force you to be circumcised. Their only aim is to avoid persecution because of the cross of Christ. "},{"num":13,"verse":"It’s clear that not even those who had themselves circumcised did this to follow Moses’ laws. Yet, they want you to be circumcised so that they can brag about what was done to your body. "},{"num":14,"verse":"But it’s unthinkable that I could ever brag about anything except the cross of our Lord Jesus Christ. By his cross my relationship to the world and its relationship to me have been crucified. "},{"num":15,"verse":"Certainly, it doesn’t matter whether a person is circumcised or not. Rather, what matters is being a new creation. "},{"num":16,"verse":"Peace and mercy will come to rest on all those who conform to this principle. They are the Israel of God."},{"num":17,"verse":"From now on, don’t make any trouble for me! After all, I carry the scars of Jesus on my body."},{"num":18,"verse":"May the good will  of our Lord Jesus Christ be with your spirit, brothers and sisters! Amen."}]