[{"num":5,"verse":"Christ has set us free in freedom; stand fast therefore, and be not held again in a yoke of bondage."},{"num":2,"verse":"Behold, I, Paul, say to you, that if ye are circumcised, Christ shall profit you nothing."},{"num":3,"verse":"And I witness again to every man [who is] circumcised, that he is debtor to do the whole law."},{"num":4,"verse":"Ye are deprived of all profit from the Christ as separated [from him], as many as are justified by law; ye have fallen from grace."},{"num":5,"verse":"For we, by [the] Spirit, on the principle of faith, await the hope of righteousness."},{"num":6,"verse":"For in Christ Jesus neither circumcision has any force, nor uncircumcision; but faith working through love."},{"num":7,"verse":"Ye ran well; who has stopped you that ye should not obey the truth?"},{"num":8,"verse":"The persuasibleness [is] not of him that calls you."},{"num":9,"verse":"A little leaven leavens the whole lump."},{"num":10,"verse":"*I* have confidence as to you in [the] Lord, that ye will have no other mind; and he that is troubling you shall bear the guilt [of it], whosoever he may be."},{"num":11,"verse":"But *I*, brethren, if I yet preach circumcision, why am I yet persecuted? Then the scandal of the cross has been done away."},{"num":12,"verse":"I would that they would even cut themselves off who throw you into confusion."},{"num":13,"verse":"For *ye* have been called to liberty, brethren; only [do] not [turn] liberty into an opportunity to the flesh, but by love serve one another."},{"num":14,"verse":"For the whole law is fulfilled in one word, in Thou shalt love thy neighbour as thyself;"},{"num":15,"verse":"but if ye bite and devour one another, see that ye are not consumed one of another."},{"num":16,"verse":"But I say, Walk in [the] Spirit, and ye shall no way fulfil flesh's lust."},{"num":17,"verse":"For the flesh lusts against the Spirit, and the Spirit against the flesh: and these things are opposed one to the other, that ye should not do those things which ye desire;"},{"num":18,"verse":"but if ye are led by the Spirit, ye are not under law."},{"num":19,"verse":"Now the works of the flesh are manifest, which are fornication, uncleanness, licentiousness,"},{"num":20,"verse":"idolatry, sorcery, hatred, strifes, jealousies, angers, contentions, disputes, schools of opinion,"},{"num":21,"verse":"envyings, murders, drunkennesses, revels, and things like these; as to which I tell you beforehand, even as I also have said before, that they who do such things shall not inherit God's kingdom."},{"num":22,"verse":"But the fruit of the Spirit is love, joy, peace, long-suffering, kindness, goodness, fidelity,"},{"num":23,"verse":"meekness, self-control: against such things there is no law."},{"num":24,"verse":"But they that [are] of the Christ have crucified the flesh with the passions and the lusts."},{"num":25,"verse":"If we live by the Spirit, let us walk also by the Spirit."},{"num":26,"verse":"Let us not become vain-glorious, provoking one another, envying one another."}]