[{"header":"Live in the Freedom That Christ Gives You"},{"num":5,"verse":"Christ has freed us so that we may enjoy the benefits of freedom. Therefore, be firm in this freedom, and don’t become slaves again."},{"num":2,"verse":"I, Paul, can guarantee that if you allow yourselves to be circumcised, Christ will be of no benefit to you. "},{"num":3,"verse":"Again, I insist that everyone who allows himself to be circumcised must realize that he obligates himself to do everything Moses’ Teachings demand. "},{"num":4,"verse":"Those of you who try to earn God’s approval by obeying his laws have been cut off from Christ. You have fallen out of God’s favor. "},{"num":5,"verse":"However, in our spiritual nature, faith causes us to wait eagerly for the confidence that comes with God’s approval. "},{"num":6,"verse":"As far as our relationship to Christ Yeshua is concerned, it doesn’t matter whether we are circumcised or not. But what matters is a faith that expresses itself through love."},{"num":7,"verse":"You were doing so well. Who stopped you from being influenced by the truth? "},{"num":8,"verse":"The arguments of the person who is influencing you do not come from the one who is calling you. "},{"num":9,"verse":"A little yeast spreads through the whole batch of dough. "},{"num":10,"verse":"The Lord gives me confidence that you will not disagree with this. However, the one who is confusing you will suffer God’s judgment regardless of who he is. "},{"num":11,"verse":"Brothers and sisters, if I am still preaching that circumcision is necessary, why am I still being persecuted? In that case the cross wouldn’t be offensive anymore. "},{"num":12,"verse":"I wish those troublemakers would castrate themselves."},{"num":13,"verse":"You were indeed called to be free, brothers and sisters. Don’t turn this freedom into an excuse for your corrupt nature to express itself. Rather, serve each other through love. "},{"num":14,"verse":"All of Moses’ Teachings are summarized in a single statement, “Love your neighbor as you love yourself.” "},{"num":15,"verse":"But if you criticize and attack each other, be careful that you don’t destroy each other."},{"num":16,"verse":"Let me explain further. Live your life as your spiritual nature directs you. Then you will never follow through on what your corrupt nature wants. "},{"num":17,"verse":"What your corrupt nature wants is contrary to what your spiritual nature wants, and what your spiritual nature wants is contrary to what your corrupt nature wants. They are opposed to each other. As a result, you don’t always do what you intend to do. "},{"num":18,"verse":"If your spiritual nature is your guide, you are not subject to Moses’ laws."},{"num":19,"verse":"Now, the effects of the corrupt nature are obvious: illicit sex, perversion, promiscuity, "},{"num":20,"verse":"idolatry, drug use, hatred, rivalry, jealousy, angry outbursts, selfish ambition, conflict, factions, "},{"num":21,"verse":"envy, drunkenness, wild partying, and similar things. I’ve told you in the past and I’m telling you again that people who do these kinds of things will not inherit the kingdom of God."},{"num":22,"verse":"But the spiritual nature produces love, joy, peace, patience, kindness, goodness, faithfulness, "},{"num":23,"verse":"gentleness, and self-control. There are no laws against things like that. "},{"num":24,"verse":"Those who belong to Christ Yeshua have crucified their corrupt nature along with its passions and desires. "},{"num":25,"verse":"If we live by our spiritual nature, then our lives need to conform to our spiritual nature. "},{"num":26,"verse":"We can’t allow ourselves to act arrogantly and to provoke or envy each other."}]