[{"num":5,"verse":"For this “zman cheruteinu” (Pesach Haggadah Kiddush), Moshiach freed us; stand fast, therefore, and be not again bound by an ol (yoke) of avdut (slavery)."},{"num":2,"verse":"Hinei, I Sha’ul say to you, that if you Goyim undergo the bris milah, Moshiach will profit you nothing [3:12-14]."},{"num":3,"verse":"And I testify again to every one of you undergoing bris milah that such is chal (placed under obligation) to do the whole Torah."},{"num":4,"verse":"You who want to be YITZDAK IM HASHEM (\"justified with G-d\") by chumra (legalism), [i.e., legal justification] by chukim of the Torah, are estranged from Moshiach, you at that point fall from the Chen v’Chesed Hashem."},{"num":5,"verse":"For we by the Ruach Hakodesh eagerly await by emunah that for which we have tikvah, the Tzidkat Hashem (DANIEL 9:24)."},{"num":6,"verse":"For in Rebbe, Melech HaMoshiach Yehoshua neither bris milah is of any force nor the lack of it, but emunah working through ahavah (agape)."},{"num":7,"verse":"You [Goyim] were running well: who hindered you from being persuaded by HaEmes?"},{"num":8,"verse":"This persuasion is not of the One calling you."},{"num":9,"verse":"A little chametz leavens all habatzek (the dough, T.N. see Pesach Haggadah)."},{"num":10,"verse":"I have bitachon, (confidence) in you in Adoneinu that you will think nothing other, but the one troubling you will bear the judgment, whoever he may be."},{"num":11,"verse":"But if I preach [to Goyim] the bris milah, Achim B’Moshiach, why am I still being persecuted? In that case, the michshol (stumbling block) of [Moshiach’s] Etz (3:12-14; DEVARIM 21:23) has been abolished."},{"num":12,"verse":"O if the ones (the mohalim of Goyim) troubling you would castrate themselves!"},{"num":13,"verse":"For, Achim B’Moshiach, you were called for “zman Cheruteinu” (5:1); only use not the Cherut for a pretext for the basar, but, through ahavah (agape), minister to one another as avadim (servants)."},{"num":14,"verse":"For the entire Torah has been summed up in one word: V’AHAVTA L’RE’ACHA KAMOCHA (\"Love your neighbor as yourself\" VAYIKRA 19:18)."},{"num":15,"verse":"But if you bite and devour one another, beware lest you be consumed by one another."},{"num":16,"verse":"But I say, let your halakhah be by the Ruach HaKodesh, and by no means will you carry out the ta’avot (lusts) of the basar."},{"num":17,"verse":"For the basar desires against the Ruach HaKodesh, and the Ruach HaKodesh desires against the basar—for these oppose each other—with the result that the things you wish you cannot do (Ro chp 7)."},{"num":18,"verse":"But if by the Ruach HaKodesh you are led, you are not under [epoch of] Torah."},{"num":19,"verse":"Now the ma’asei habasar are manifest, dehainu (being:) zenut (fornication), tum’ah (impurity), zimmah (licentiousness),"},{"num":20,"verse":"Avodah zarah (idolatry), kashefanut (sorcery, witchcraft), eivot (enmities), merivah (strife), kinah (jealousy), rogez (anger), anochiyut (selfishness), machalokot (dissensions), kitot (sects),"},{"num":21,"verse":"Tzarut ayin (envyings), shichrut (drunkenness), holelut (carousing) and things like these, of which I tell you beforehand, as I said previously, that the ones practicing such things will not receive the nachalah (inheritance) of the Malchut Hashem."},{"num":22,"verse":"But the p’ri of the Ruach HaKodesh is ahavah (agape), simcha (joy), shalom (peace), zitzfleisch (patience), nedivut (generosity, kindness), chesed (loving-kindness), ne’emanut (faithfulness),"},{"num":23,"verse":"Anavah (meekness, shiflut, lowliness), shlitah atzmi (self-control)...would you not agree?—against these things there is no isser (proscription in the Torah)."},{"num":24,"verse":"But the ones who are mekabel Moshiach Yehoshua have put to be talui al HaEtz (hanging on the Tree, DEVARIM 21:23) the basar with its teshukot (desires) and its ta’avot (lusts)."},{"num":25,"verse":"If we live by the Ruach HaKodesh, we should stay in line with the Derech HaYashar (Straight Way) of the Ruach HaKodesh."},{"num":26,"verse":"Let us not become ba’alei ga’avah (conceited, haughty persons), provoking one another, envying one another."}]