[{"num":8,"verse":"(iv) Adonai said to Moshe, "},{"num":2,"verse":"“Take Aharon and his sons with him, the garments, the anointing oil, the bull for the sin offering, the two rams and the basket of matzah; "},{"num":3,"verse":"and assemble the entire community at the entrance to the tent of meeting.” "},{"num":4,"verse":"Moshe did as Adonai ordered him, and the community was assembled at the entrance to the tent of meeting. "},{"num":5,"verse":"Moshe said to the community, “This is what Adonai has ordered to be done.”"},{"num":6,"verse":"Moshe brought Aharon and his sons, washed them with water, "},{"num":7,"verse":"put the tunic on him, wrapped the sash around him, clothed him with the robe, put the ritual vest on him, wrapped around him the decorated belt and fastened the vest to him with it. "},{"num":8,"verse":"He put the breastplate on him, and on the breastplate he put the urim and tumim. "},{"num":9,"verse":"He set the turban on his head, and on the front of the turban he affixed the gold plate, the holy ornament, as Adonai had ordered Moshe."},{"num":10,"verse":"Then Moshe took the anointing oil and anointed the tabernacle and everything in it, thus consecrating them. "},{"num":11,"verse":"He sprinkled some on the altar seven times, anointing the altar with all its utensils and the basin with its base, to consecrate them. "},{"num":12,"verse":"He poured some of the anointing oil on Aharon’s head and anointed him, to consecrate him. "},{"num":13,"verse":"Moshe brought Aharon’s sons, clothed them with tunics, wrapped sashes on them and put headgear on them, as Adonai had ordered Moshe."},{"num":14,"verse":"(v) Then the young bull for the sin offering was brought, and Aharon and his sons laid their hands on the head of the bull for the sin offering. "},{"num":15,"verse":"After it had been slaughtered, Moshe took the blood and put it on the horns of the altar all the way around with his finger, thus purifying the altar. The remaining blood he poured out at the base of the altar and consecrated it, to make atonement for it. "},{"num":16,"verse":"Moshe took all the fat on the inner organs, the covering of the liver, the two kidneys and their fat, and made it go up in smoke on the altar. "},{"num":17,"verse":"But the bull, its hide, its flesh and its dung were taken outside the camp and burned up completely, as Adonai had ordered Moshe."},{"num":18,"verse":"Next, the ram for the burnt offering was presented. Aharon and his sons laid their hands on the head of the ram; "},{"num":19,"verse":"and after it had been slaughtered, Moshe splashed the blood on all sides of the altar. "},{"num":20,"verse":"When the ram had been cut in pieces, Moshe made the head, the pieces and the fat go up in smoke. "},{"num":21,"verse":"When the inner organs and the lower parts of the legs had been washed with water, Moshe made the entire ram go up in smoke on the altar; it was a burnt offering giving a fragrant aroma, an offering made by fire to Adonai — as Adonai had ordered Moshe."},{"num":22,"verse":"(vi) Then the other ram was presented, the ram of consecration; Aharon and his sons laid their hands on the head of the ram. "},{"num":23,"verse":"After it had been slaughtered, Moshe took some of its blood and put it on the tip of Aharon’s right ear, on the thumb of his right hand, and on the big toe of his right foot. "},{"num":24,"verse":"Next Aharon’s sons were brought, and Moshe put some of the blood on the tips of their right ears, on the thumbs of their right hands, and on the big toes of their right feet; then Moshe splashed the blood on all sides of the altar. "},{"num":25,"verse":"He took the fat, the fat tail, all the fat covering the inner organs, the covering of the liver, the two kidneys with their fat, and the right thigh. "},{"num":26,"verse":"From the basket of matzah that was before Adonai he took one piece of matzah, one cake of oiled bread, and one wafer, and placed them on the fat and on the right thigh. "},{"num":27,"verse":"Then he put it all in Aharon’s hands and in the hands of his sons and waved them as a wave offering before Adonai. "},{"num":28,"verse":"Moshe took them out of their hands and made them go up in smoke on the altar on top of the burnt offering; they were a consecration offering giving a fragrant aroma; an offering made by fire to Adonai. "},{"num":29,"verse":"Moshe took the breast and waved it as a wave offering before Adonai; it was Moshe’s portion of the ram of consecration — as Adonai had ordered Moshe."},{"num":30,"verse":"(vii) Moshe took some of the anointing oil and some of the blood which was on the altar and sprinkled it on Aharon and his clothing, and on his sons with him and their clothing, and consecrated Aharon and his clothing together with his sons and their clothing."},{"num":31,"verse":"Moshe said to Aharon and his sons, “Boil the meat at the door of the tent of meeting; and eat it there with the bread that is in the basket of consecration, as I ordered when I said that Aharon and his sons are to eat it. "},{"num":32,"verse":"Whatever is left over of the meat and bread you are to burn up completely. "},{"num":33,"verse":"(Maftir) You are not to go out from the entrance to the tent of meeting for seven days, until the days of your consecration are over; since Adonai will be consecrating you for seven days. "},{"num":34,"verse":"He ordered done what has been done today, in order to make atonement for you. "},{"num":35,"verse":"You are to remain at the entrance to the tent of meeting day and night for seven days, thereby obeying what Adonai ordered done, so that you may not die. For this is what I was ordered.” "},{"num":36,"verse":"Aharon and his sons did all the things which Adonai ordered through Moshe."}]