[{"num":14,"verse":"1 Job describeth the shortness and misery of the life of man. 14 Hope sustaineth the godly. 21 The condition of man’s life."},{"num":1,"verse":"Man that is born of woman, is of short continuance and full of trouble."},{"num":2,"verse":"He shooteth forth as a flower, and is cut down: he vanisheth also as a shadow, and continueth not."},{"num":3,"verse":"And yet thou openest thine eyes upon such one, and causest me to enter into judgment with thee."},{"num":4,"verse":"Who can bring a clean thing out of filthiness? there is not one."},{"num":5,"verse":"Are not his days determined? the number of his months are with thee: thou hast appointed his bound, which he cannot pass."},{"num":6,"verse":"Turn from him that he may cease until his desired day, as an hireling."},{"num":7,"verse":"For there is hope of a tree, if it be cut down, that it will yet sprout, and the branches thereof will not cease."},{"num":8,"verse":"Though the root of it wax old in the earth, and the stock thereof be dead in the ground,"},{"num":9,"verse":"Yet by the scent of water it will bud, and bring forth boughs like a plant."},{"num":10,"verse":"But man is sick, and dieth, and man perisheth, and where is he?"},{"num":11,"verse":"As the waters pass from the sea, and as the flood decayeth and drieth up,"},{"num":12,"verse":"So man sleepeth and riseth not: for he shall not wake again, nor be raised from his sleep till the heaven be no more."},{"num":13,"verse":"Oh that thou wouldest hide me in the grave, and keep me secret, until thy wrath were past, and wouldest give me term, and remember me!"},{"num":14,"verse":"If a man die, shall he live again? All the days of mine appointed time will I wait, till my changing shall come."},{"num":15,"verse":"Thou shalt call me, and I will answer thee: thou lovest the work of thine own hands."},{"num":16,"verse":"But now thou numberest my steps, and doest not delay my sins."},{"num":17,"verse":"Mine iniquity is sealed up, as in a bag, and thou addest unto my wickedness."},{"num":18,"verse":"And surely as the mountain that falleth, cometh to nought, and the rock that is removed from his place:"},{"num":19,"verse":"As the water breaketh the stones, when thou overflowest the things which grow in the dust of the earth: so thou destroyest the hope of man."},{"num":20,"verse":"Thou prevailest always against him, so that he passeth away: he changeth his face when thou castest him away."},{"num":21,"verse":"And he knoweth not if his sons shall be honorable, neither shall he understand concerning them, whether they shall be of low degree,"},{"num":22,"verse":"But while his flesh is upon him, he shall be sorrowful, and while his soul is in him, it shall mourn."}]