[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(40) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let all things be done decently.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The former verse reiterates in a condensed sentence the principles laid down regarding the gifts in the first part of the chapter (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Corinthians 14:1-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This verse similarly deals with the general principle laid down in the latter part of the chapter regarding the style and order of public worship. The object of all church assemblies is to be the building up of the Body of Christ, which is His Church; and therefore seemliness and ordered regularity are absolutely necessary to this end. Here again, as in so many other instances in this Epistle, while the particular and unique circumstances which called forth the apostolic instructions have for centuries passed away, the writings of St. Paul are of permanent and abiding application, because of the general and eternal principles on which his instructions are based. The strange outbursts of incoherent fanaticism which have occurred from time to time in the after-history of the Church are condemned by the principle with which St. Paul combatted the disorder of the gift of tongues in Corinth; and the practice of the Roman Church, in performing her public services in a tongue not “understanded of the people,” is at variance with the principle which in this chapter he reiterates with varied emphasis—that all public utterance of prayer and praise should be such as those present can join in, not only with emotional heart but with clear and understanding intellect.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:34-40 When the apostle exhorts Christian women to seek information on religious subjects from their husbands at home, it shows that believing families ought to assemble for promoting spiritual knowledge. The Spirit of Christ can never contradict itself; and if their revelations are against those of the apostle, they do not come from the same Spirit. The way to keep peace, truth, and order in the church, is to seek that which is good for it, to bear with that which is not hurtful to its welfare, and to keep up good behaviour, order, and decency.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let all things be done decently and in order - Let all things be done in an \"appropriate\" and \"becoming\" manner; \"decorously,\" as becomes the worship of God. Let all be done in \"order, regularly;\" without confusion, discord, tumult. The word used here (κατὰ τάξιν  kata taxin) is properly a military term, and denotes the order and regularity with which an army is drawn up. This is a general rule, which was to guide them. It was simple, and easily applied. There might be a thousand questions started about the modes and forms of worship, and the customs in the churches, and much difficulty might occur in many of these questions; but here was a simple and plain rule, which might be easily applied. Their good sense would tell them what became the worship of God; and their pious feelings would restrain them from excesses and disorders. This rule is still applicable, and is safe in guiding us in many things in regard to the worship of God. There are many things which cannot be subjected to \"rule,\" or exactly prescribed; there are many things which may and must be left to pious feeling, to good sense, and to the views of Christians themselves, about what will promote their edification and the conversion of sinners. The rule in such questions is plain. Let all be done \"decorously,\" as becomes the worship of the great and holy God; let all be without confusion, noise, and disorder.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In view of this chapter, we may remark:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That public worship should be in a language understood by the people; the language which they commonly employ. Nothing can be clearer than the sentiments of Paul on this. The whole strain of the chapter is to demonstrate this, in opposition to making use of a foreign and unintelligible language in any part of public worship. Paul specifics in the course of the discussion every part of public worship; \"public preaching\" 1 Corinthians 14:2-3, 1 Corinthians 14:5,1 Corinthians 14:13, 1 Corinthians 14:19; \"prayer\" 1 Corinthians 14:14-15; \"singing\" 1 Corinthians 14:15; and insists that all should be in a language that should be understood by the people. It would almost seem that he had anticipated the sentiments and practice of the Roman Catholic denomination. It is remarkable that a practice should have grown up, and have been defended, in a church professedly Christian, so directly in opposition to the explicit meaning of the New Testament. Perhaps there is not even in the Roman Catholic denomination, a more striking instance of a custom or doctrine in direct contradiction to the Bible. If anything is plain and obvious, it is that worship, in order to be edifying, should be in a language that is understood by the people.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) That public worship should be in a language understood by the people; the language which they commonly employ. Nothing can be clearer than the sentiments of Paul on this. The whole strain of the chapter is to demonstrate this, in opposition to making use of a foreign and unintelligible language in any part of public worship. Paul specifics in the course of the discussion every part of public worship; \"public preaching\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"prayer\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:14-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"singing\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and insists that all should be in a language that should be understood by the people. It would almost seem that he had anticipated the sentiments and practice of the Roman Catholic denomination. It is remarkable that a practice should have grown up, and have been defended, in a church professedly Christian, so directly in opposition to the explicit meaning of the New Testament. Perhaps there is not even in the Roman Catholic denomination, a more striking instance of a custom or doctrine in direct contradiction to the Bible. If anything is plain and obvious, it is that worship, in order to be edifying, should be in a language that is understood by the people.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor can that service be accepable to God which is not understood by those who offer it; which conveys no idea to their minds, and which cannot, therefore, be the homage of the heart. Assuredly, God does not require the offering of unmeaningful words. Yet, this has been a grand device of the great enemy of man. It has contributed to keep the people in ignorance and superstition; it has prevented the mass of the people from seeing how utterly unlike the New Testament are the sentiments of the papists; and it has, in connection with the kindred doctrine that the Scripture should be withheld from the people, contributed to perpetuate that dark system, and to bind the human mind in chains. Well do the Roman Catholics know, that if the Bible were given to the people, and public worship conducted in a language which they could understand, the system would soon fall. It could not live in the midst of light. It is a system which lives and thrives only in darkness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) preaching should be simple and intelligible. There is a great deal of preaching which might as well be in a foreign tongue as in the language which is actually employed. It is dry, abstruse, metaphysical, remote from the common manner of expression, and the common habits of thought among people. It may be suited to schools of philosophy, but it cannot be suited to the pulpit. The preaching of the Lord Jesus was simple, and intelligible even to a child. And nothing can be a greater error, than for the ministers of the gospel to adopt a dry and metaphysical manner of preaching. The most successful preachers have been those who have been most remarkable for their simplicity and clearness. Nor is simplicity and intelligibleness of manner inconsistent with bright thought and profound sentiments. A diamond is the most pure of all minerals; a river may be deep, and yet its water so pure that the bottom may be seen at a great depth; and glass in the window is most valuable the clearer and purer it is, when it is itself least seen, and when it gives no obstruction to the light. If the purpose is that the glass may be itself an ornament, it may be well to stain it; if to give light, it should be pure. A very shallow stream may be very muddy; and because the bottom cannot be seen, it is no evidence that it is deep. So it is with style. If the purpose is to convey thought, to enlighten and save the soul, the style should be plain, simple, pure. If it be to bewilder and confound, or to be admired as unintelligible, or perhaps as profound, then an abstruse and metaphysical, or a flowery manner may be adopted in the pulpit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) we should learn to value \"useful\" talent more than that which is splendid and showy; 1 Corinthians 14:3. The whole scope of this chapter goes to demonstrate that we should more highly prize and desire that talent which may be \"useful\" to the church, or which may be useful in convincing unbelievers 1 Corinthians 14:24-25, than that which merely dazzles, or excites admiration. Ministers of the gospel who preach as they should do, engage in their work to win souls to Christ, not to induce them to admire eloquence; they come to teach people to adore the great and dreadful God, not to be loud in their praises of a mortal man.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) we should learn to value \"useful\" talent more than that which is splendid and showy; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The whole scope of this chapter goes to demonstrate that we should more highly prize and desire that talent which may be \"useful\" to the church, or which may be useful in convincing unbelievers ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:24-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", than that which merely dazzles, or excites admiration. Ministers of the gospel who preach as they should do, engage in their work to win souls to Christ, not to induce them to admire eloquence; they come to teach people to adore the great and dreadful God, not to be loud in their praises of a mortal man.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) ministers of the gospel should not aim to be admired. They should seek to be useful. Their aim should not be to excite admiration of their acute and profound talent for reasoning; of their clear and striking power of observation; of their graceful manner; of their glowing and fervid eloquence; of the beauty of their words, or the eloquence of their well-turned periods. They should seek to build up the people of God in holy faith, and so to present truth as that it shall make a deep impression on mankind. No work is so important, and so serious in its nature and results, as the ministry of the gospel; and in no work on earth should there be more seriousness, simplicity, exactness, and correctness of statement, and invincible and unvarying adherence to simple and unvarnished truth. Of all places, the pulpit is the last, in which to seek to excite admiration, or where to display profound learning, or the powers of an abstract and subtle argumentation, \"for the sake\" of securing a reputation. Cowper has drawn the character of what a minister of the gospel should be. in the wellknown and most beautiful passage in the \"Task.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Would I describe a preacher, such as Paul.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Were he on earth, would hear, approve, and own,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Paul should himself direct me. I would trace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His master-strokes, and draw from his design.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I would express him simple, grave, sincere;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In doctrine uncorrupt; in language plain;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And plain in manner; decent, solemn, chaste,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "40. Let, &c.—The oldest manuscripts read, \"But let,\" &c. This verse is connected with 1Co 14:39, \"But (while desiring prophecy, and not forbidding tongues) let all things be done decently.\" \"Church government is the best security for Christian liberty\" [J. Newton]. (Compare 1Co 14:23, 26-33).   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He forbade them not to speak with tongues, provided they did it decently and orderly, as all other things ought to be done in so grave an assembly as that of the church, and so grave an action as the worship of God. For women to prophesy in the public assemblies, was an indecent thing; he had said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 14:35",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:35",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that it was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shame.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " For many of them to speak together, confusedly, making a noise, that was disorderly. Nor did this decency or indecency, order or disorder, arise from obeying or disobeying the apostolical constitution, but from the law of God, the light of nature, the common usage of all the churches of Christians, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 14:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". All things ought so to be done, (especially in religious assemblies and actions), as they may not be judged by the law of God, or the light of nature, or the common custom of other churches, to be done indecently or confusedly, without order. It is very observable, that though the apostle, in these things, hath given rules, yet he hath determined nothing shameful or uncomely, but what he hath made to appear so, either from the Divine law, (as in the case of the women’s prophesying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 14:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), or from nature and reason, (as in the case of many speaking at the same time), it being useless to the end, which was teaching and instructing those to whom they spake, and what unbelievers would count the effect of madness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 14:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let all things be done decently and in order. Which may refer not only to what is said in this chapter, but in the foregoing part of the epistle; go not to law before the unbelievers; let not a believing yokefellow depart from an unbelieving one; let not him that has knowledge sit in an idol's temple, and eat meat there; let not a man pray with his head covered, and a woman with hers uncovered; come not to the house of God to eat and drink intemperately, thereby reflecting dishonour and scandal on the ordinance of the Lord's supper; let not any speak in an unknown tongue in the church, without an interpreter, as if he was a madman, nor suffer women to teach in public; all which are very unbecoming, and contrary to the rules of decency: do not encourage animosities, factions, and parties; despise not the faithful ministers of the word, but honour and obey them in the Lord; neglect not the discipline of the church, lay on censures, and pass the sentence of excommunication on such as deserve them; keep the ordinances as they have been delivered, particularly that of the Lord's supper; observe the rules prescribed for prophesying and speaking with tongues, and so all these things will be done according to the order of the Gospel: and the words may be considered as a general rule for the decent and orderly management of all things relating to the worship of God, and discipline of his house; that in all things a good decorum, and strict order, be observed, that nothing be done contrary to the rules of decency, and the laws and commandments of Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Let all things be done decently and in order.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let all things be done decently and in order",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "only let",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ &c. For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "decently",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 13:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same word is translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "honestly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where a word of similar derivation occurs, and is translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "comeliness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 7:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the adjective of the same derivation is rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "comely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; in St ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 15:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "honourable",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Its original meaning is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "well formed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare the Latin ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forma",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for beauty, and the English ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shapely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in order",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Corinthians 14:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 14:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Christian assembly should be a reflection of the universe, where ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "form",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "order",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " reign supreme.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 14:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Εὐσχημόνως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "decently",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") which applies to individuals.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατὰ τάξιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in order",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in turns, [after one another.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 40.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Let all things.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The \"but\" of the original should not be omitted. It is a final caution against the abuse of the permission accorded in the last clause. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Decently",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that is, \"with decorum.\" Thus Milton uses the term — ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"... and heldBefore his decent steps a silver wand.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"... and held",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Before his decent steps a silver wand.\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 13:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is translated \"honestly,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " honourably. In order. Time, proportion, regulation, self suppression, are as necessary in worship as in \"the music of men's lives.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 1 Corinthians 14:40",
        "children": []
      }
    ]
  }
]