[{"header":"Joseph Mourns for His Father"},{"num":50,"verse":"Then Joseph embraced his father, cried over him, and kissed him. "},{"num":2,"verse":"After this, he issued orders to his physician servants to embalm his father. So they embalmed Israel. "},{"num":3,"verse":"It took 40 days to complete the process, the normal period required for embalming. Meanwhile, the Egyptians mourned for him for 70 days. "},{"num":4,"verse":"At the conclusion of the mourning period, Joseph addressed Pharaoh’s household. “If you’re satisfied with me, would you please take this message to Pharaoh for me? Tell him, "},{"num":5,"verse":"‘My father told me, “Look! I’m about to die. Bury me in my grave that I dug for myself in the land of Canaan.” So please let me travel to bury my father. I’ll be right back.’”"},{"num":6,"verse":"“Please go,” Pharaoh replied. “Bury your father, as he asked you to do.”"},{"header":"Joseph Mourns in Canaan"},{"num":7,"verse":"So Joseph got up and went to bury his father, accompanied by all of Pharaoh’s servants, all of the elders of Egypt, "},{"num":8,"verse":"all of Joseph’s household, his brothers, and his father’s household. They left behind in the territory of Goshen only their youngest children, their flocks, and their herds. "},{"num":9,"verse":"Chariots and horsemen also accompanied Joseph, so there were a lot of people. "},{"num":10,"verse":"When they arrived at Atad’s threshing floor, which is located beyond the Jordan River, they held a great and mournful memorial service, during which Joseph spent seven days mourning for his father. "},{"num":11,"verse":"As soon as the Canaanites who lived in the land observed the mourning going on at Atad’s threshing floor, they commented “This is a significant time of mourning for the Egyptians.” That’s why the place, which is located beyond the Jordan River, became known as Abel-mizraim."},{"header":"The Burial at Machpelah"},{"num":12,"verse":"And so Israel’s sons did what he had instructed them to do: "},{"num":13,"verse":"they carried him to the territory of Canaan and buried him in the cave in Machpelah field near Mamre that Abraham had purchased as a cemetery from Ephron the Hittite. "},{"num":14,"verse":"After he had buried his father, Joseph and his brothers returned to Egypt, along with everyone who had gone with him to attend the burial."},{"num":15,"verse":"Later, after Joseph’s brothers faced the reality of their father’s death, they asked themselves, “What happens if Joseph decides to hold a grudge against us? What if he pays us back in full for all the wrong things we did to him?”"},{"num":16,"verse":"So they sent this message to Joseph: "},{"num":17,"verse":"“Before he died, your father left some instructions. He told us, ‘Tell Joseph, “Please forgive your brothers’ offenses. I beg you, forgive their sins, because they wronged you.”’ So please forgive the transgression of the servants of your father’s God.”"},{"num":18,"verse":"So Joseph’s brothers went to visit him, fell prostrate in front of him, and declared, “Look! We’re your servants.”"},{"num":19,"verse":"“Don’t be afraid,” Joseph responded. “Am I sitting in God’s place? "},{"num":20,"verse":"As far as you’re concerned, you were planning evil against me, but God intended it for good, planning to bring about the present result so that many people would be preserved alive. "},{"num":21,"verse":"So don’t be afraid! I’ll take care of you and your little ones.” So Joseph kept on comforting them, speaking to the needs of their hearts."},{"header":"Joseph’s Death and Burial"},{"num":22,"verse":"Joseph continued to live in Egypt, along with his father’s household, until he was 110 years old. "},{"num":23,"verse":"Joseph saw the third generation of Ephraim’s children, as well as the children who had been born to Manasseh’s son Machir, whom he adopted as his own. "},{"num":24,"verse":"Later, Joseph told his brothers, “I’m going to die soon, but God will certainly provide for you and bring you up from this land to the land that he promised with an oath to give to Abraham, Isaac, and Jacob.” "},{"num":25,"verse":"So Joseph made all of Israel’s other children make this promise: “Because God is certainly going to take care of you, you are to carry my bones up from here.”"},{"num":26,"verse":"Some time later, Joseph died at the age of 110 years, and he was embalmed and placed in a coffin in Egypt."}]