[{"header":"Chapter 50"},{"num":1,"verse":"Joseph threw himself on the face of his father. He wept upon him and kissed him."},{"num":2,"verse":"Then Joseph ordered his doctors to embalm Israel."},{"num":3,"verse":"This took forty days, the time it takes to embalm. The Egyptians mourned for him for seventy days."},{"num":4,"verse":"When the days of mourning were over, Joseph spoke to the household of Pharaoh. He said, “If I have found favor in your sight, I wish to speak these words into the ears of Pharaoh:"},{"num":5,"verse":"My father made me take an oath: ‘Behold, I am about to die. Bury me in the tomb I prepared for myself in the land of Canaan.’ May I go to bury my father and return?”"},{"num":6,"verse":"Pharaoh answered, “Go and bury your father as you have vowed to do.”"},{"num":7,"verse":"Joseph went to bury his father, and all the ministers of Pharaoh, the elders of his household, and all the elders of the land of Egypt,"},{"num":8,"verse":"as well as the household of Joseph and his brothers and the household of his father went with him. Only the children, flocks, and herds were left in the land of Goshen."},{"num":9,"verse":"Even the war chariots and the charioteers formed an imposing caravan."},{"num":10,"verse":"When they arrived at the threshing floor of Atad, which is on the other side of the Jordan, they performed a great and solemn ritual mourning, and Joseph did seven days of mourning for his father."},{"num":11,"verse":"The Canaanites living in that land saw the mourning at the threshing floor of Atad and said, “It is a solemn funeral for the Egyptians.” Because of this they called the place Abel-mizraim, and it is on the other side of the Jordan."},{"num":12,"verse":"Jacob’s sons did what he had commanded them to do for him."},{"num":13,"verse":"They brought him into the land of Canaan and buried him in the cave of the field of Machpelah, the field that Abraham had bought from Ephron the Hittite to be his burial place and that faces Mamre."},{"num":14,"verse":"After he had buried his father, Joseph returned to Egypt together with his brothers and those who had gone with him to bury his father."},{"num":15,"verse":"Joseph’s Mission and His Death. Now the brothers of Joseph began to be afraid because their father was dead, and they said, “Who knows if Joseph will not treat us like enemies and pay us back for the evil things we have done to him?”"},{"num":16,"verse":"So they sent word to Joseph, saying, “Your father, before he died, gave this command:"},{"num":17,"verse":"‘Say to Joseph: Forgive the offense of your brothers and their sin for the evil that they have done against you. Forgive the trespass of the servants of the God of your father.’ ” Joseph cried while they were speaking to him."},{"num":18,"verse":"His brothers went up and bowed to the ground before him and said, “Behold your slaves.”"},{"num":19,"verse":"But Joseph said to them, “Do not fear. Am I God?"},{"num":20,"verse":"You intended to do evil to me, but God decided to make it serve a good, to fulfill that which today has come true: to keep alive a numerous people."},{"num":21,"verse":"Therefore, do not fear. I will provide food for you and your children.” In this way, he consoled them and encouraged them."},{"num":22,"verse":"Joseph and the family of his father lived in Egypt. He lived for one hundred and ten years."},{"num":23,"verse":"Thus, Joseph saw the sons of Ephraim up to the third generation and also the sons of Machir, the son of Manasseh, who was born upon the knees of Joseph."},{"num":24,"verse":"Then Joseph said to his brothers, “I am about to die, but God will come to visit you and will bring you out of this land to the land that he promised with an oath to Abraham, to Isaac, and to Jacob."},{"num":25,"verse":"Joseph had the sons of Israel swear an oath saying, “God will surely come to visit you, and then you are to carry my bones away with you.”"},{"num":26,"verse":"Joseph died when he was one hundred and ten years old. He was embalmed and placed in a coffin in Egypt."}]