[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have sent to Babylon.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—For the first time in 2 Isaiah, the place of exile is named. For “have brought down all their nobles” read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will bring them all down as fugitives. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The marginal “bars” represents a various reading, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "defences, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "defenders.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Chaldeans, whose cry is in the ships.—Better, into the ships of their shouting—i.e., the ships which used to echo with the exulting joy of sailors. The word for “shouting” is purposely chosen to suggest the thought that there will be a shout of another kind, even the wailing cry of despair. The commerce of Babylon, and its position on the Euphrates, made it, as it were, the Venice of the earlier East (Herod., 1:194). The prophet sees the inhabitants of Babylon fleeing in their ships from the presence of their conqueror.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The Chaldeans, whose cry is in the ships.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "into the ships of their shouting—i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the ships which used to echo with the exulting joy of sailors. The word for “shouting” is purposely chosen to suggest the thought that there will be a shout of another kind, even the wailing cry of despair. The commerce of Babylon, and its position on the Euphrates, made it, as it were, the Venice of the earlier East (Herod., 1:194). The prophet sees the inhabitants of Babylon fleeing in their ships from the presence of their conqueror.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 43:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For your sake I have sent to Babylon — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I have sent Cyrus, and the Medes and Persians with him, to war against Babylon, to this very end, that he might deliver you out of captivity, and restore you to your land, according to my promise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have brought down ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— From that height of power and glory to which they were advanced; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all their nobles ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Their princes and great commanders. Bishop Lowth prefers the reading of the margin, (the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "בריחים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "properly signifying ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bars,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and renders the next clauses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will bring down all her strong bars, and the Chaldeans exulting in their ships. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "On which he observes, “Babylon was very advantageously situated, both in respect to commerce, and as a naval power. It was open to the Persian gulf by the Euphrates, which was navigable by large vessels; and, being joined to the Tigris above Babylon, by the canal called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Naharmalca, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the royal river, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "supplied the city with the produce of the whole country to the north of it, as far as the Euxine and Caspian seas. — Herod, 1., 194. We are not to wonder that in later times we hear little of the commerce and naval power of Babylon: for, after the taking of the city by Cyrus, the Euphrates was not only rendered less fit for navigation by being, on that occasion, diverted from its course, and left to spread over the country; but the Persian monarchs, residing in their own country, to prevent any invasion by sea on that part of their empire, purposely obstructed the navigation of both rivers, by making cataracts in them, that is, by raising dams across the channel, and making artificial falls in them; that no vessel, of any size or force, could possibly come up. — Strabo, lib. 16. Alexander began to restore the navigation of the river by demolishing the cataracts upon the Tigris, as far up as Seleucia; but he did not live to finish his great designs: those upon the Euphrates still continued.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "43:14-21 The deliverance from Babylon is foretold, but there is reference to greater events. The redemption of sinners by Christ, the conversion of the Gentiles, and the recall of the Jews, are described. All that is to be done to rescue sinners, and to bring the believer to glory, is little, compared with that wondrous work of love, the redemption of man.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus saith the Lord your Redeemer - This verse commences another argument for the safety of his people. It is the assurance to the Jews in Babylon that he had sent to them a deliverer, and would bring down the pride of the Chaldeans, and demolish their city.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Your Redeemer - (See the note at Isaiah 43:1).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Your Redeemer - (See the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "I have sent to Babylon - That is, the Persians and Medes, under the command of Cyrus (compare the note at Isaiah 13:3). This implies that God had command over all their armies and had the power of sending them where he pleased (compare the notes at Isaiah 10:5-6). This is to be understood as seen by the prophet in vision. He sees the armies of Cyrus encompass Babylon and the haughty city fall, and then says that God had sent or directed them there.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I have sent to Babylon - That is, the Persians and Medes, under the command of Cyrus (compare the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This implies that God had command over all their armies and had the power of sending them where he pleased (compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This is to be understood as seen by the prophet in vision. He sees the armies of Cyrus encompass Babylon and the haughty city fall, and then says that God had sent or directed them there.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And have brought down all their nobles - Margin, 'Bars.' But the word in this place probably means neither, but rather fugitives (compare the notes at Isaiah 27:1). The word used (בריח  bârı̂yach), means sometimes bar, cross-bar, that which passed from one side of the tabernacle to the other through rings, in order to carry it; thou a harbor bolt of any kind Judges 16:3; Nehemiah 3:3. But the word may also denote one who flies; a fugitive; and is properly used in that sense here. The verb ברח  bârach, from which the word is derived, means often to break away, to flee Genesis 16:8; Genesis 35:1, Genesis 35:7; 1 Samuel 19:12; Job 27:22; Jonah 1:3. Here it means those who endeavored to escape from the impending calamity and destruction; or it may refer to those who had taken refuge in Babylon from other lands, as Babylon was doubtless composed in part of those who had sought a refuge there from other nations - a conflux of strangers. But the former is the more probable interpretation; and the idea seems to be, that Yahweh had brought them down to their ships, or had led them to take refuge in their ships from the impending judgments. Jerome, however, understands it of removing the strong bars with which the prisoners of the exile Jews were protected, so that they would be permitted to go forth in peace and safety. Lowth renders it, 'I will bring down all her strong bars.' The Septuagint renders it, φεύγοντες πάντας  pheugontes pantas - 'All that fly.' So the Syriac.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And have brought down all their nobles - Margin, 'Bars.' But the word in this place probably means neither, but rather fugitives (compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 27:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The word used (בריח  bârı̂yach), means sometimes bar, cross-bar, that which passed from one side of the tabernacle to the other through rings, in order to carry it; thou a harbor bolt of any kind ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 16:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 3:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But the word may also denote one who flies; a fugitive; and is properly used in that sense here. The verb ברח  bârach, from which the word is derived, means often to break away, to flee ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 16:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here it means those who endeavored to escape from the impending calamity and destruction; or it may refer to those who had taken refuge in Babylon from other lands, as Babylon was doubtless composed in part of those who had sought a refuge there from other nations - a conflux of strangers. But the former is the more probable interpretation; and the idea seems to be, that Yahweh had brought them down to their ships, or had led them to take refuge in their ships from the impending judgments. Jerome, however, understands it of removing the strong bars with which the prisoners of the exile Jews were protected, so that they would be permitted to go forth in peace and safety. Lowth renders it, 'I will bring down all her strong bars.' The Septuagint renders it, φεύγοντες πάντας  pheugontes pantas - 'All that fly.' So the Syriac.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And the Chaldeans - The inhabitants of Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Whose cry is in the ships - Lowth renders this, 'Exulting in their ships.' Noyes, 'Ships of their delight.' The Vulgate, 'Glorying in their ships.' The Septuagint, 'The Chaldeans shall be bound (δεθήσονται  dethēsontai) in ships.' The Syriac, 'Who glory in their ships.' The sense is, probably, that the Chaldeans, when their city was taken, would seek to take refuge in their ships in which they would raise a shout (Rosenmuller). Or it may be, as Lowth supposes, that it was one of the characteristics of the Chaldeans, that they boasted of their ships, and of their commerce. Babylon was, as he remarks, favorably situated to be a commercial and naval power. It was on the large river Euphrates, and hence, had access to the Persian Gulf and the ocean; and there can be no doubt that it was engaged, in the height of its power, in commercial enterprises. On the north of the city, the Euphrates was united to the Tigris by the canal called Nahar Malca or the Royal River, and thus a large part of the produce of the northern countries, as far as the Euxine and Caspian seas, naturally descended to Babylon (Herod. i.194).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Semiramis, the founder of Babylon, is said to have had a fleet of three thousand galleys. After the taking of the city by Cyrus, we hear indeed little of the commerce of Babylon. The Euphrates was diverted from its course, and spread over the adjacent country; and the Persian monarchs, in order to prevent the danger of invasion from that quarter, purposely obstructed the navigation, by making dams across both the Tigris and the Euphrates (Strabo xvi.) It is not to be deemed remarkable, therefore, that, in the times of its prosperity, the city of Babylon should be noted for its commerce; or as a city exulting in its shipping, or raising the sailor's cry - a cry such as is heard in any port now where shipping abounds. The word rendered 'cry' (רנה  rinnâh) denotes properly a shout of rejoicing or joy 1 Kings 22:36; Psalm 31:6; Psalm 42:5; and then also a mournful cry, an outcry, wailing Psalm 17:1; Psalm 61:2. Here it may mean the joyful cry of commerce; the shout of the mariner as he leaves the port, or as he returns to his home - the shout, the clamor, which is heard at the wharfs of a commercial city. Such a cry is alluded to by Virgil in the naval games which AEneas celebrated:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Semiramis, the founder of Babylon, is said to have had a fleet of three thousand galleys. After the taking of the city by Cyrus, we hear indeed little of the commerce of Babylon. The Euphrates was diverted from its course, and spread over the adjacent country; and the Persian monarchs, in order to prevent the danger of invasion from that quarter, purposely obstructed the navigation, by making dams across both the Tigris and the Euphrates (Strabo xvi.) It is not to be deemed remarkable, therefore, that, in the times of its prosperity, the city of Babylon should be noted for its commerce; or as a city exulting in its shipping, or raising the sailor's cry - a cry such as is heard in any port now where shipping abounds. The word rendered 'cry' (רנה  rinnâh) denotes properly a shout of rejoicing or joy ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and then also a mournful cry, an outcry, wailing ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 17:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 61:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here it may mean the joyful cry of commerce; the shout of the mariner as he leaves the port, or as he returns to his home - the shout, the clamor, which is heard at the wharfs of a commercial city. Such a cry is alluded to by Virgil in the naval games which AEneas celebrated:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": " - ferit athera clamor",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nauticus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "AEneid, v. 140, 1.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sense here is, that God had sent to bring down that exulting city, and to destroy all the indications of its commercial importance and prosperity. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The sense here is, that God had sent to bring down that exulting city, and to destroy all the indications of its commercial importance and prosperity. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. sent—namely, the Medes and Persians (Isa 10:5, 6; 13:3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "brought down—\"made to go down\" to the sea (Isa 42:10), in order to escape the impending destruction of Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "nobles—rather, \"fugitives,\" namely, the foreigners who sojourned in populous Babylon (Isa 13:14), distinct from the Chaldeans [Maurer].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whose cry is in the ships—exulting in their ships with the joyous sailors—cry, boastingly; their joy heretofore in their ships contrasts sadly with their present panic in fleeing to them (Isa 22:2; Zep 2:15). Babylon was on the Euphrates, which was joined to the Tigris by a canal, and flowed into the Persian Gulf. Thus it was famed for ships and commerce until the Persian monarchs, to prevent revolt or invasion, obstructed navigation by dams across the Tigris and Euphrates.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have sent to Babylon; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I have sent Cyrus, and the Medes and Persians with him, to war against Babylon, to this very end and purpose, that he might deliver you out of captivity, and restore you to your land according to promise. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Have brought down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from that height of power and glory to which they were advanced. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All their nobles; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their princes and great commanders, who as they are called shields, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 47:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 47:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", so here they are called bars, for the same reason, because of that strength and defence which they give to their people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Chaldeans; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the common people of Chaldea, together with their great men who had palaces in Babylon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whose cry is in the ships; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who make fearful outcries, as they flee away from the Persians in ships; which they had opportunity to do, because of their two great and famous rivers Euphrates and Tigris, and the several branches of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus saith the Lord, your Redeemer,.... That redeemed Israel out of Egypt, and would redeem the Jews from Babylon in a short time, and be the author of a greater redemption to his people than either of these, even a spiritual and eternal one: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the Holy One of Israel; see Isaiah 43:3, holy in himself, holiness to Israel, and faithful to his promises: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the Holy One of Israel; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", holy in himself, holiness to Israel, and faithful to his promises: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for your sake I have sent to Babylon: Cyrus and his army to take it, in order to deliver the Jews from their captivity in it. The Targum wrongly paraphrases it to the sense quite contrary, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"for your sins have I carried you captive unto Babylon:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and have brought down all their nobles; from their seats of honour and glory, stripped them of all their grandeur and dignity, and reduced them to a low and mean estate. This is to be understood of the princes and nobles of Babylon, who fell with the city, as their king did: or, \"their bars\" (l); for what bars are to houses and cities, that princes should be to the people, the defence and protection of them. Though some think this refers to the gates of Babylon, and the strong bars of them now broken; see Isaiah 45:2. The Septuagint, Syriac, and Arabic versions render it \"fugitives\"; and which some understand of the Jews, who were as such in Babylon, but now should be brought out of it; which sense is countenanced by the above versions, which render it, I will raise up, bring, or bring back, \"all the fugitives\" (m); others of the Chaldeans, who should be forced to fly upon the taking of their city; but the first sense seems best, which distinguishes them from the common people in the next clause: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and have brought down all their nobles; from their seats of honour and glory, stripped them of all their grandeur and dignity, and reduced them to a low and mean estate. This is to be understood of the princes and nobles of Babylon, who fell with the city, as their king did: or, \"their bars\" (l); for what bars are to houses and cities, that princes should be to the people, the defence and protection of them. Though some think this refers to the gates of Babylon, and the strong bars of them now broken; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Septuagint, Syriac, and Arabic versions render it \"fugitives\"; and which some understand of the Jews, who were as such in Babylon, but now should be brought out of it; which sense is countenanced by the above versions, which render it, I will raise up, bring, or bring back, \"all the fugitives\" (m); others of the Chaldeans, who should be forced to fly upon the taking of their city; but the first sense seems best, which distinguishes them from the common people in the next clause: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Chaldeans, whose cry is in their ships; who used to glory in their shipping they had in the river Euphrates, as the Vulgate Latin and Syriac versions render it; and so the Targum calls their ships, \"ships of their praise\"; where, and of which, they used to make their ovations and triumphs; and the word (n) used has the signification of shouting for joy: or rather, \"whose cry is to the ships\" (o); as it might be, when they found Cyrus and his army had got into the city, then their cry was, to the ships, to the ships, that lay in the river hard by, in order to make their escape; or their cry was, when they were \"in\" the ships, even in a way of lamentation and distress, because they could not get them off, Cyrus having drained the river; or it refers to their cry, when put aboard the ships that belonged to the Medes and Persians, in order to the transporting them into other countries. Such a howling there will be when mystical Babylon is destroyed, Revelation 18:17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the Chaldeans, whose cry is in their ships; who used to glory in their shipping they had in the river Euphrates, as the Vulgate Latin and Syriac versions render it; and so the Targum calls their ships, \"ships of their praise\"; where, and of which, they used to make their ovations and triumphs; and the word (n) used has the signification of shouting for joy: or rather, \"whose cry is to the ships\" (o); as it might be, when they found Cyrus and his army had got into the city, then their cry was, to the ships, to the ships, that lay in the river hard by, in order to make their escape; or their cry was, when they were \"in\" the ships, even in a way of lamentation and distress, because they could not get them off, Cyrus having drained the river; or it refers to their cry, when put aboard the ships that belonged to the Medes and Persians, in order to the transporting them into other countries. Such a howling there will be when mystical Babylon is destroyed, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l)  \"vectes omnes\", Julius & Tremellius; \"vectes universos\", Piscator. (m) \"Fugitivos universos\", Vatablus, Paginus, Montanus; \"fugientes omnes\", Vitringa (n)  \"in navibus ovatio eorum\", Forerius; \"cumu avibus ob quas jubilant\", Piscator; \"in naves ovationis ipsorum\", Vitringa. (o) \"Ad naves clamor eorum\", Grotius, Gataker. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l)  \"vectes omnes\", Julius & Tremellius; \"vectes universos\", Piscator. (m) \"Fugitivos universos\", Vatablus, Paginus, Montanus; \"fugientes omnes\", Vitringa (n)  \"in navibus ovatio eorum\", Forerius; \"cumu avibus ob quas jubilant\", Piscator; \"in naves ovationis ipsorum\", Vitringa. (o) \"Ad naves clamor eorum\", Grotius, Gataker. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thus saith the LORD, your redeemer, the Holy One of Israel; For your sake I have sent to Babylon, and have {n} brought down all their nobles, and the Chaldeans, whose cry is in {o} the ships.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus saith the LORD, your redeemer, the Holy One of Israel; For your sake I have sent to Babylon, and have ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " brought down all their nobles, and the Chaldeans, whose cry ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the ships.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) By Darius and Cyrus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) They will cry when they would escape by my water, seeing that the course of the Euphrates is turned another way by the enemy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14, 15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A new section (14–21) commences here with a brief but explicit announcement of the fall of Babylon.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord, your redeemer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have sent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or perhaps, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will send",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to Babylon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As object of the verb we must supply, the Persian army, the “consecrated ones” of ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 13:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and have brought … ships",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This sentence is somewhat peculiar in its structure and phraseology, and many emendations have been proposed. Accepting the text as it stands, the best translation is no doubt that of R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and I will bring down all of them as fugitives, even the Chaldeans in the ships of their rejoicing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Since the verb “bring down” cannot be understood in two different senses in the two members, the idea must be that they shall all be sent down the Euphrates as fugitives in ships, which was precisely the manner in which Merodach-baladan made his escape from Sennacherib (see Schrader, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cuneiform Inscriptions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", E. T. vol. II. p. 36). A description of the ships on the Euphrates is to be found in Herod. I. 194; they are here called “ships of rejoicing” as having formerly been used for pleasure. The rendering, however, is not altogether convincing. The “and” before “Chaldæans” seems to make a distinction between them and the fugitives, which is hardly to be explained by supposing that the latter are the foreign merchants referred to in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 13:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The probability is that the difficulties are due to somewhat extensive omissions in the text. The word for “fugitives” might (with the change of one vowel) be read as “bolts,” and this is taken by A.V., though without any justification, as a metaphor for “nobles.” It might, however, be a metaphor for the defences of Babylon, or a symbol of Israel’s captivity; “I will bring down the bolts” gives a good enough sense so far as it goes. Another slight emendation which naturally suggests itself is to change “ships” into “lamentations”: “and the shouting of the Chaldæans into lamentations.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 14-21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - A DECLARATION AGAINST BABYLON, AND A PROMISE OF ISRAEL'S RESTORATION. Having wound up the preceding \"controversy\" with a reference to his own power to work great results (ver. 13), Jehovah now brings forward two  examples - the discomfiture of Babylon (vers. 14, 15), and the recovery and restoration of Israel (vers. 16-21), both of which he is about to accomplish. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For your sake I have sent to Babylon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For Israel's sake God has already, in his counsels, sent to Babylon the instruments of his vengeance - Cyrus and his soldiers - and by their instrumentality has brought down all their nobles; or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "has brought them all down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "fugitives",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and the Chaldeans",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "even the Chaldeans.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Chaldeans are not in Isaiah, as in Daniel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), a special class of Babylonians, but, as elsewhere commonly in Scripture, the Babylonians generally (see Isaiah 12:19; 47:1). In the native inscriptions the term is especially applied to the inhabitants of the tract upon the sea-coast. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Whose cry is in the ships",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "into their ships of wailing.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Chaldeans, flying from the Persian attack, betake themselves to their ships with cries of grief, the ships thereby becoming \"ships of wailing.\" The nautical character of the Babylonians is strongly marked in the inscriptions, where \"the ships of Ur are celebrated at a very remote period, and the native kings, when hard pressed by the Assyrians, are constantly represented as going on ship-board, and crossing the Persian Gulf to Susiana, or to some of the islands (see 'Records of the Past,' vol. 1. pp. 40, 43, 73; vol. 7. p. 63; vol. 9. p. 60). The abundant traffic and the numerous merchants of Babylon are mentioned by Ezekiel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 17:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). AEsehylus, moreover, notes that the Babylonians of his day were \"navigators of ships\" ('Persae,' 11. 52-55). Isaiah 43:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In close connection with the foregoing prophecy, the present one commences with the dissolution of the Chaldean empire. \"Thus saith Jehovah, your Redeemer, the Holy One of Israel, For your sake I have sent to Babel, and will hurl them all down as fugitives, and the Chaldeans into the ships of their rejoicing. I, Jehovah, am your Holy One; (I) Israel's Creator, your King.\" Hitzig reads באניות, and adopts the rendering, \"and drowned the shouting of the Chaldeans in groaning.\" Ewald also corrects ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thus: \"And plunge their guitars into groanings, and the rejoicing of the Chaldeans into sighs.\" We cannot see any good taste in this un-Hebraic bombast. Nor is there any more reason for altering ברייחם (lxx φεύγοντας) into ברייחם (Jerome, vectes), as Umbreit proposes: \"and make all their bolts",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: This would require כּל־בּריחיה.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fall down, and the Chaldeans, who rejoice in ships\" (bāŏniyōth). None of these alterations effect any improvement. For your sakes, says Jehovah, i.e., for the purpose of releasing you, I have sent to Babylon (sc., the agents of my judgments, Isaiah 13:3), and will throw them all down (viz., the πάμιμκτος ὄχλος of this market of the world; see Isaiah 13:14; Isaiah 47:15) as fugitives (bârı̄chı̄m with a fixed kametz, equivalent to barrı̄chı̄m), i.e., into a hurried flight; and the Chaldeans, who have been settled there from a hoary antiquity, even they shall be driven into the ships of their rejoicing (bŏŏniyōth, as in Proverbs 31:14), i.e., the ships which were previously the object of their jubilant pride and their jubilant rejoicing. והורדתּי stands in the perf. consec., as indicating the object of all the means already set in motion. The ships of pleasure are not air-balloons, as Hitzig affirms. Herodotus (i. 194) describes the freight ships discharging in Babylon; and we know from other sources that the Chaldeans not only navigated the Euphrates, but the Persian Gulf as well, and employed vessels built by Phoenicians for warlike purposes also.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "fall down, and the Chaldeans, who rejoice in ships\" (bāŏniyōth). None of these alterations effect any improvement. For your sakes, says Jehovah, i.e., for the purpose of releasing you, I have sent to Babylon (sc., the agents of my judgments, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and will throw them all down (viz., the πάμιμκτος ὄχλος of this market of the world; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 47:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") as fugitives (bârı̄chı̄m with a fixed kametz, equivalent to barrı̄chı̄m), i.e., into a hurried flight; and the Chaldeans, who have been settled there from a hoary antiquity, even they shall be driven into the ships of their rejoicing (bŏŏniyōth, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 31:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., the ships which were previously the object of their jubilant pride and their jubilant rejoicing. והורדתּי stands in the perf. consec., as indicating the object of all the means already set in motion. The ships of pleasure are not air-balloons, as Hitzig affirms. Herodotus (i. 194) describes the freight ships discharging in Babylon; and we know from other sources that the Chaldeans not only navigated the Euphrates, but the Persian Gulf as well, and employed vessels built by Phoenicians for warlike purposes also.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: See G. Rawlinson, Monarchies, i. 128, ii.448.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "הוריד itself might indeed signify \"to hurl to the ground\" (Psalm 56:8; Psalm 59:12); but the allusion to ships shows that בּ הוריד are to be connected (cf., Isaiah 63:14), and that a general driving down both by land and water to the southern coast is intended. By thus sweeping away both foreigners and natives out of Babylon into the sea, Jehovah proves what He is in Himself, according to Isaiah 43:15, and also in His relation to Israel; we must supply a repetition of אני here (Isaiah 43:15), as in Isaiah 43:3. The congregation which addresses Him as the Holy One, the people who suffer Him to reign over them as their King, cannot remain permanently despised and enslaved. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "הוריד itself might indeed signify \"to hurl to the ground\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 59:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but the allusion to ships shows that בּ הוריד are to be connected (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 63:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and that a general driving down both by land and water to the southern coast is intended. By thus sweeping away both foreigners and natives out of Babylon into the sea, Jehovah proves what He is in Himself, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and also in His relation to Israel; we must supply a repetition of אני here (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The congregation which addresses Him as the Holy One, the people who suffer Him to reign over them as their King, cannot remain permanently despised and enslaved. ",
            "children": []
          }
        ]
      }
    ]
  }
]