[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord appeared",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—This direct communication to Solomon by a dream—standing in contrast with the indirect knowledge of the Lord’s will by David through the prophets Nathan and Gad (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 7:2-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 12:1-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 24:11-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and by “enquiring of the Lord” through the priest (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 23:9-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 30:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")—is perhaps the first indication of some temporary abeyance of the prophetic office, and (as appears still more clearly from the history of the consecration of the Temple), of a loss of leadership in the priesthood. At the same time it is to be noted that the vision of the Lord through dreams, being of a lower type than the waking vision, is mostly recorded as given to those outside the Covenant, as Abimelech (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:3-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Laban (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Pharaoh and his servants (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 40:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the Midianite (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Nebuchadnezzar (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:10-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); as belonging to the early stages of revelation, to Abraham (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Jacob (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:12-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Joseph (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:5-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and as marking the time of cessation of the regular succession of the prophets during the Captivity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Kings",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A YOUNG MAN’S WISE CHOICE OF WISDOM1 Kings 3:5 - 1 Kings 3:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A YOUNG MAN’S WISE CHOICE OF WISDOM",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The new king was apparently some nineteen or twenty years old on his accession. He stepped at once out of seclusion and idleness to bear the whole weight of the kingdom. The glories of David’s reign, his brother Adonijah’s pretensions to the crown, the smouldering hostility of Saul’s old partisans, made his position difficult and his throne unsteady. No doubt, ‘the weight of too much dignity’ pressed on the youth, and this dream found a point of origin in his waking thoughts. God does not thus reveal Himself to men who seek Him not; and the offer in the vision is but the repetition of what Solomon felt in many a waking moment of meditation that God was saying to him, and the choice he makes in it is the choice that he had already made. He who seeks wisdom first is already wise.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Note the wide possibilities opened by the divine offer.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Our narrative brings that gracious offer into connection with Solomon’s lavish sacrifice before the Tabernacle at Gibeon. ‘God loveth a cheerful giver’ and because these thousand burnt offerings meant devotion and thankfulness, therefore He who lets no man be the poorer for what he gives to Him, and is honoured most, not by our givings to, but by our takings from Him, comes in the quiet night, and puts the key of all His treasures into the young king’s hands. In a very real sense this divine voice is but the putting into words of the fact as to every young life. The all but boundless possibilities before every young man and woman give solemnity to their position, which they too often do not recognise till youth is past. The future lies blank before them, ready to receive what they choose to write on its page. Once written, it is indelible. They are still free from the limitations of habit and associations. They have still the capacity and the opportunity of choice. There are limits, of course, but still it is scarcely exaggeration to say that a man may become almost anything he likes, if he strongly wills it when young, and sticks to his resolve. When the liquid iron flows from the blast furnace, it may be run into any mould; but it soon cools and hardens, and obstinately keeps its shape, in spite of hammers.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If young men and women could but see the possibilities of their youth, and the issues that hang on early choice, as clearly as they will see them some day, there would be fewer wasted mornings of life and fewer gloomy sunsets. But the misery is that so many do not choose at all, but just let things slide, and allow themselves to be moulded by whatever influence happens to be strongest. For one man who goes wrong by deliberate choice, with open eyes, there are twenty who simply drift. Unfortunately, there is more evil than good in the world; and if a lad takes his colour from his surroundings, the chances are terribly against his coming to anything high, noble, or pure. This world is no place for a man who cannot say ‘No.’ If we are like the weeds in a stream, and let it decide which way we shall point, we shall be sure to point downwards. It would do much to secure the choice of the Good, if there were a clear recognition by all young persons of the fact that they have the choice to make, and are really making it unconsciously. If they could be brought, like Solomon, to put their ruling wish into plain words, many who are not ashamed to yield to unworthy desires would be ashamed to speak them out baldly. Let each ask himself, ‘Suppose that I had to say out what I want most, dare I avow before my own conscience, to say nothing of God, what it is?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Looked at from a somewhat different point of view, God’s offer to Solomon presupposes God’s knowledge and approval of his wishes. He does not give blank cheques to those whom He cannot trust to fill them up rightly. When James and John tried to commit Jesus to a blind promise ‘that Thou shouldest do for us whatsoever we shall ask of Thee,’ their answer was a question as to what they wished. ‘Delight thyself also in the Lord, and He shall give thee the desires of thine heart.’ God loves us too well to let us have ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "carte blanche",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " unless our wills run parallel with His. He is a foolish and cruel father who promises compliance with all his child’s unknown wishes. Not such is our Father’s loving discipline. It is to those who ‘abide in Christ,’ and have Him abiding in them, moulding their longings and prayers, that the great promise is sealed: ‘Ye shall ask what ye will, and it shall be done unto you.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Note next the wise choice of wisdom. ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Had not Solomon been wise before, he had not known the worth of wisdom. The dunghill cocks of this world cannot know the price of this pearl; those that have it know that all other excellencies are but trash and rubbish unto it.’ Solomon’s prayer shows the temper with which he entered on his reign. There is no exultation; his serious and clear-eyed spirit sees in rule a heavy task. He contrasts his inexperienced rawness with the ‘truth and righteousness’ and veteran maturity of his great predecessor, and trembles to think that he, a mere lad, sits on David’s throne. But he pleads with God that He has made him king, and implies that therefore God is bound to fit him for his office. That is the boldness permitted to faith,-to remind God of His own past acts, which pledge Him to give what He has put us into circumstances to need. With beautiful humility, Solomon dwells on his youth and inexperience, and on the vastness of the charge laid on him. All these considerations are the motives for his choice of a gift, and also pleas with God to grant his request.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He asks for the practical wisdom needed for ruling in these old days, when the king was judge as well as ruler and captain. Was this the highest gift that he could have asked or received? Surely the deep longings of his father for communion with God were yet better. No doubt the ‘wisdom’ of the Book of Proverbs is religion and morality as well as true thinking, but the ‘understanding heart to judge Thy people’ which Solomon asked and received is narrower and more secular in its meaning. There is no sign in his biography that he ever had the deep inward devotion of his father. After the poet-psalmist came the prosaic and keen-sighted shrewd man of affairs. The one breathed his ardent soul into psalms, which feed devotion to-day; the other crystallised his discernment in ‘three thousand proverbs,’ and, though his ‘songs were one thousand and five’ they touched a lower range, both of poetry and religious feeling, than his father’s, as may be expressed by calling them ‘songs,’ not ‘psalms.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But though the request is not the highest, it may well be taken as a pattern by the young. Note the view of his position from which it rises. To Solomon dignity meant duty; and his crown was not a toy, but a task. The responsibilities, not the enjoyments, of his station were uppermost in his mind. That is the only right view to take. Youth is meant to be enthusiastic, and to feed its aspirations on noble ideals, and if, instead of that, it does as too many do, especially in countries where wealth abounds, namely, regards life as a garden of delights, or sometimes as a sty where young men may wallow in ‘pleasures,’ then farewell to all hopes of high achievements or of an honourable career. Youthful ideals will fade fast enough; but alas for the life which had none to begin with! Note the sense of insufficiency for his task. Youth is prone to be over-confident, and to think that it can do better than its fathers, who were as confident in their time. There is a false humility which flattens the spirit and keeps from plain duty; and there is a true lowliness which feels that the task must be attempted, though the heart may shrink, and which impels to prayer for fitness not its own. He who tells God his consciousness of impotence, and asks Him to supply His strength to its weakness and His wisdom to its inexperience, will never shirk work because it is too great, nor ever fail to find power according to his need.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Note God’s answer.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Solomon gets his wish, and much which he had not asked besides. The divine answer is in two parts. First, the reasons for the large gift; and second, the details of the gift. His not wishing material good was the very reason why he obtained it. That is not always so; for often enough a man whose whole nature is sharpened to one point, in the intensity of his desire to make money, will succeed. But what then? He will be none the better, but the poorer, for his wealth. But this is always true,-that the people who do not make worldly good their first object are the people who can be most safely trusted with it, and who get most enjoyment out of it. Whether in the precise form of the gift to Solomon or not, outward good does attend a life which sets duty before pleasure, and desires most to be able to do it. All earthly good is exalted by being put second, and degraded as well as corrupted by being put first. The water lapped up in the palm, as the soldier marches, is sweeter than the abundant draughts swilled down by self-indulgence. ‘Seek ye first the kingdom of God, . . . and all these things shall be added unto you.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Note the largeness of the gift. When God is pleased with a man’s prayers, He gives more than was asked, and so teaches us to be ashamed of the smallness of our expectations, and widens our desires by His overlapping bestowments. First, He gives the wisdom asked. Dependence on God, rising from the sense of our own ignorance, has a wonderful power of bringing illumination, even as to small matters of practical duty. Solomon asked it, to guide him in his judicial decisions; and the first case to which it was applied, when received, was a miserable quarrel between two disreputable women. A devout heart, purged from self-conceit, is often gifted with a piercing wisdom before which the crafty shrewdness of the world is abashed. We cannot be ‘wise as serpents’ unless we are ‘harmless as doves.’ The world may think such ‘wisdom’ folly, but she will be ‘justified of her children.’ Is the saying of James’s Epistle a reminiscence of Solomon’s dream, ‘If any of you lack wisdom, let him ask of God, . . . and it shall be given him’?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then follows the grant of the unasked goods,-riches, honour, and length of days. Surely we hear an echo of these promises in that magnificent description of Wisdom in the Book of Proverbs: ‘Length of days is in her right hand; in her left hand are riches and honour’ These and similar gifts may or may not follow our choice of divine wisdom as our truest good If we have really chosen it, we shall regard them as make-weights, to be thankfully received and rightly used, but not as indispensable. If we pursue wisdom for the sake of getting these, we shall lose both it and them. If we have set our desires most earnestly on the most worthy things, which are God’s love and a character hallowed by His grace, we shall be rich indeed, whether what the world calls wealth be ours or no; and our days will be long enough if in them we have been prepared for the fuller wisdom and undying life of heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Solomon realised his youthful aspirations. The only way to be sure of getting what we wish, is to wish what God desires to give,-even Himself,-and to ask it of Him. Solomon, like many a young man, outgrew his early ‘dream.’ Was he happier or wiser when he was a worn-out voluptuary, smiling with cynical scorn at his young self, or when, with generous enthusiasm, he felt the solemnity of life and the awfulness of duty, and asked God to help his insufficiency? Was not the dream truer and more real than the waking hours of profligacy and unreal ‘enjoyment’?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 3:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord appeared to Solomon in a dream — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As he had done to Jacob at Bethel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and to others on different occasions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 26:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Sleep is like a state of death to the soul; wherein the senses are locked up, and the understanding and will deprived of the free exercise of their functions. And yet this is no impediment to God in communicating his will to mankind; for no doubt he has power, not only to awaken our intellectual faculties, but to advance them above their ordinary measure of perception, even while the body is asleep. Solomon had prayed the day before with great fervency, and desired of God the gift of wisdom: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Wis 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the night-time God appeared unto him in a dream, and bade him ask whatever he would. Solomon, having his mind still full of the desire of wisdom, asked and obtained it: so that the prayer or desire he uttered in his dream was but the consequence of the option he had made the day before, when he was awake. In a word, though we should allow that the soul of man, when the body is asleep, is in a state of rest and inactivity; yet we cannot but think that God can approach it many different ways; can move and actuate it just as he pleases; and, when he is inclined to make a discovery of any thing, can set such a lively representation of it before the understanding, as shall make a man not doubt of the reality of the vision. See Calmet and Dodd.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:5-15 Solomon's dream was not a common one. While his bodily powers were locked up in sleep, the powers of his soul were strengthened; he was enabled to receive the Divine vision, and to make a suitable choice. God, in like manner, puts us in the ready way to be happy, by assuring us we shall have what we need, and pray for. Solomon's making such a choice when asleep, and the powers of reason least active, showed it came from the grace of God. Having a humble sense of his own wants and weakness, he pleads, Lord, I am but a little child. The more wise and considerate men are, the better acquainted they are with their own weakness, and the more jealous of themselves. Solomon begs of God to give him wisdom. We must pray for it, Jas 1:5, that it may help us in our particular calling, and the various occasions we have. Those are accepted of God, who prefer spiritual blessings to earthly good. It was a prevailing prayer, and prevailed for more than he asked. God gave him wisdom, such as no other prince was ever blessed with; and also gave him riches and honour. If we make sure of wisdom and grace, these will bring outward prosperity with them, or sweeten the want of it. The way to get spiritual blessings, is to wrestle with God in prayer for them. The way to get earthly blessings, is to refer ourselves to God concerning them. Solomon has wisdom given him, because he did ask it, and wealth, because he did not.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord appeared unto Solomon in a dream - Compare the marginal references and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. In Gibeon the Lord appeared to Solomon in a dream—It was probably at the close of this season, when his mind had been elevated into a high state of religious fervor by the protracted services. Solomon felt an intense desire, and he had offered an earnest petition, for the gift of wisdom. In sleep his thoughts ran upon the subject of his prayer, and he dreamed that God appeared to him and gave him the option of every thing in the world—that he asked wisdom, and that God granted his request (1Ki 3:9-12). His dream was but an imaginary repetition of his former desire, but God's grant of it was real.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Quest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How could Solomon pray in his dream, or that prayer be acceptable to God, as this was, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Kings 3:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The dreams of men are not such insignificant things as many imagine. That good dreams are oftentimes praiseworthy, and evil dreams blameworthy, is not only the opinion of the Jews and Christians, but of divers of the wiser and better heathens; and the reason hereof is evident, because men’s dreams are commonly the images of their minds and tempers, and do only reflect and represent, though but faintly and imperfectly, those very things which are most imprinted upon their hearts by their waking meditations and daily conversation; and therefore it is not unreasonable, that either the sinful dreams of evil-minded men should be imputed to them, and punished in them, or the virtuous dreams of good men be imputed to and rewarded in them: which was Solomon’s case; for his heart having been daily and constantly employed in passionate longings and prayers for the wisdom which here he begs, it was a natural and likely thing that his heart should, as it did, work that way even in his dreams. Although, to speak truly and strictly, Solomon’s prayer made in his dream would have been no way pleasing to God, nor profitable to himself, if it had not been the result of his daily and most serious practice; and though God signified his mind in a dream, yet it was Solomon’s waking prayers (which were shadowed by this dark representation) which God accepted and requited; and this acceptance of God was signified to him in an extraordinary manner, and by a Divine dream, which was one of those ways whereby God oft used to communicate his will to his prophets and people. So the whole business lies thus: Solomon dreamed that God bid him ask what he would, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Kings 3:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and that he did ask wisdom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Kings 3:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., and that God accepted his desire, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Kings 3:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and gave him that gracious answer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Kings 3:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". &c. And all this was done in a dream, but with this difference; Solomon’s prayer was but imaginary, but God’s answer was real, though conveyed in a dream. And when he awoke, he knew by Divine inspiration that this was a dream sent from God to assure him that he would give him wisdom, and riches, and honour, and this with respect unto his frequent, constant, and fervent waking desires, which his dream of his prayers did sufficiently intimate. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole \"1 Kings 3:6\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. he dreamed that God said so. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In Gibeon the Lord appeared to Solomon in a dream by night,.... This was not a common natural dream, but an extraordinary, divine, and supernatural one, a prophetic dream, a night vision, such as God used to speak in to his prophets; in which he had the full use of his reasoning powers, was under divine impressions, and in a spiritual frame of mind, and in the exercise of grace; it was not a mere dream that the Lord did appear to him, but he really did appear to him while sleeping and dreaming, by some display of his glory in some way or another: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and God said, ask what I shall give thee; he did not hereby dream that God said to him, but he really did say this; bid him ask what he would and it should be given him; he knew what he designed to give, but he would have it asked of him, as he will be inquired of by all his people to do that for them which he has intended and provided for them; and it is encouragement enough for them to ask, since he has promised to give. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and God said, ask what I shall give thee; he did not hereby dream that God said to him, but he really did say this; bid him ask what he would and it should be given him; he knew what he designed to give, but he would have it asked of him, as he will be inquired of by all his people to do that for them which he has intended and provided for them; and it is encouragement enough for them to ask, since he has promised to give. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "In Gibeon the LORD appeared to Solomon in a dream by night: and God said, Ask what I shall give thee.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5–15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God appears to Solomon in a dream at Gibeon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 1:7-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In Gibeon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The narrative which follows shews that God accepted the sacrifice of the king, though from want of a proper temple, it was offered on the high place.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in a dream",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The frequent way in which God is said to have made known His will. Thus the angel of God spake unto Jacob in a dream (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Joseph speaks of Pharaoh’s dream (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as sent from God. Hence it came to pass that men expected divine guidance through this channel. So Saul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") when he had inquired of the Lord, was distressed because he was not answered either ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by dreams",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or by Urim, or by prophets. It is to be noted that it is Jehovah (the Lord) that appears, but Elohim (God) who speaks to Solomon.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In Glbeon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the Lord appeared unto Solomon in a dream",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A vision is not necessarily implied (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. 15:12), though he may have seen some angelic form (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "angelus in Dei nomine ei apparuit loquens.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Grotius) - of course, only in his dream. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Probably \"appeared\" is the equivalent of \"revealed Himself.\" Bahr]  ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "by night; and God said, Ask what I shall give thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was the answer to the sacrifices. The night was probably that which followed the last day on which they were offered (ver. 15).] 1 Kings 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The one thing wanting in the place of sacrifice at Gibeon, viz., the ark of the covenant with the gracious presence of Jehovah, was supplied by the Lord in the case of this sacrifice by a direct revelation in a dream, which Solomon received in the night following the sacrifice. There is a connection between the question which God addressed to Solomon in the dream, \"What shall I give thee?\" and the object of the sacrifice, viz., to seek the help of God for his reign. Solomon commences his prayer in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with an acknowledgment of the great favour which the Lord had shown to his father David, and had continued till now by raising his son to his throne (הזּה כּיּום, as it is this day: cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 22:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.); and then, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:7-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the consciousness of his incapacity for the right administration of government over so numerous a people, he asks the Lord for an obedient heart and for wisdom to rule His people. ועתּה introduces the petition, the reasons assigned for which are, (1) his youth and inexperience, and (2) the greatness or multitude of the nation to be governed. I am, says he, קטן נער, i.e., an inexperienced youth (Solomon was only about twenty years old): \"I know not to go out and in,\" i.e., how to behave myself as king, or govern the people (for ובא צאת compare the note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 27:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). At ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he describes the magnitude of the nation in words which recall to mind the divine promises in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to indicate how gloriously the Lord has fulfilled the promises which He made to the patriarchs.",
        "children": []
      }
    ]
  }
]