[{"num":11,"verse":"When Athaliah the mother of [King] Ahaziah [of Judah] saw that her son was dead, she arose and destroyed all the royal descendants."},{"num":2,"verse":"But Jehosheba, the daughter of King Jehoram, [half] sister of Ahaziah, stole Joash son of Ahaziah from among the king’s sons, who were to be slain, even him and his nurse, and hid them from Athaliah in an inner storeroom for beds; so he was not slain."},{"num":3,"verse":"Joash was with his nurse hidden in the house of the Lord for six years. And Athaliah reigned over the land."},{"num":4,"verse":"In the seventh year Jehoiada [the priest, Jehosheba’s husband] sent for the captains over hundreds of the Carites and of the guards or runners and brought them to him to the house of the Lord and made a covenant with them and took an oath from them in the house of the Lord and showed them the king’s [hidden] son."},{"num":5,"verse":"And he commanded them, saying, This is the thing you shall do: a third of you who come in on the Sabbath shall keep watch of the king’s house,"},{"num":6,"verse":"A third shall be at the gate Sur, and a third at the gate behind the guard. So you shall keep watch of the palace [from three places] and be a barrier."},{"num":7,"verse":"And two divisions of all you who should go off duty on the Sabbath shall keep the watch of the house of the Lord to [protect] the king."},{"num":8,"verse":"You shall surround the [little] king, every man with his weapons in his hand. And let anyone who breaks through the ranks be put to death. You be with the king when he goes out and when he comes in."},{"num":9,"verse":"The captains over the hundreds did all that Jehoiada the priest commanded; and they took every man his men who were to come on duty on the Sabbath with those who should go off duty on the Sabbath, and came to Jehoiada the priest."},{"num":10,"verse":"To the captains over hundreds the priest gave the spears and shields that had been King David’s, which were in the house of the Lord."},{"num":11,"verse":"And the guards stood, every man with his weapons in his hand, from the right corner to the left corner of the temple area, along by the altar [in the court] and the temple proper."},{"num":12,"verse":"And Jehoiada brought out the king’s son and put the crown on him and gave him the Testimony [the Mosaic Law]; and they proclaimed him king and anointed him, and they clapped their hands and said, Long live the king!"},{"num":13,"verse":"When Athaliah heard the noise of the guards and the people, she went into the house of the Lord to the people."},{"num":14,"verse":"When she looked, there stood the king [on the platform] by the pillar, as was customary [on such occasions], and the captains and the trumpeters beside the king, with all the people of the land rejoicing and blowing trumpets. And Athaliah rent her clothes and cried, Treason! Treason!"},{"num":15,"verse":"Then Jehoiada the priest commanded the captains of hundreds set over the army and said to them, Take her forth outside the ranks, and him who follows her kill with the sword. For the priest had said, Let her not be slain in the house of the Lord."},{"num":16,"verse":"They seized her, and she went through the horses’ entrance to the king’s house, and there she was slain."},{"num":17,"verse":"And Jehoiada made a covenant between the Lord, the king, and the people that they would be the Lord’s people—and also between the king and the people."},{"num":18,"verse":"Then all the people of the land went to the house of Baal and destroyed it. His altar and his images they broke completely in pieces, and Mattan the priest of Baal they slew before the altars. And [Jehoiada] the priest appointed watchmen to guard the house of the Lord."},{"num":19,"verse":"Then he took the rulers over hundreds, the captains, the guard, and all the people of the land, and they brought the king down from the house of the Lord and came by way of the guards’ gate to the king’s house. And [little] Joash was seated on the throne of the kings."},{"num":20,"verse":"So all the people of the land rejoiced, and the city was quiet after Athaliah had been slain with the sword beside the king’s house."},{"num":21,"verse":"Joash was seven years old when he began to reign."}]