[{"header":"Athaliah Seizes Control"},{"num":11,"verse":"When Athaliah, the mother of Ahaziah, saw that her son was dead, she went into action and destroyed all the royal heirs. "},{"num":2,"verse":"But Jehosheba, King Joram’s daughter and Ahaziah’s sister, took Joash, the son of Ahaziah. She stole him away from among the king’s sons, who were to be killed. She put him and his nurse in a bedroom. He was kept hidden from Athaliah so that he was not killed. "},{"num":3,"verse":"He was kept hidden with her in the House of the Lord for six years while Athaliah was ruling over the land."},{"header":"Jehoiada Makes Joash King"},{"num":4,"verse":"In the seventh year, Jehoiada sent a message and summoned the officers in charge of the units of the Carians and the guards to meet him at the House of the Lord. He made a covenant with them and had them swear an oath in the House of the Lord. Then he showed them the king’s son."},{"num":5,"verse":"He commanded them, “This is how you will deploy: A third of you who are coming on duty on the Sabbath are to guard the palace of the king. "},{"num":6,"verse":"Another third will be stationed at the Sur Gate, and the final third at the gate behind the guards who take turns protecting this temple. "},{"num":7,"verse":"The two divisions of you who are going off duty on the Sabbath will protect the House of the Lord, together with the king. "},{"num":8,"verse":"You will surround the king on all sides, every man with his weapons in his hand. Anyone who comes into the ranks will be put to death. You will accompany the king when he goes out and when he comes in.”"},{"num":9,"verse":"So the officers of the companies did just as Jehoiada the priest commanded. Each one took his men, those coming on duty on the Sabbath with those going off duty on the Sabbath, and they came to Jehoiada the priest. "},{"num":10,"verse":"The priest gave the officers in charge of the units the spears and shields which had belonged to King David and which were in the House of the Lord. "},{"num":11,"verse":"So the guards, each one with his weapon in his hand, stood around the king from the south side of the temple to the north side, near the altar of the temple. "},{"num":12,"verse":"Then Jehoiada brought out the king’s son and set the crown on him and gave him the Testimony, and they made him king. They anointed him and clapped their hands and said, “Long live the king!”"},{"header":"Athaliah’s Death"},{"num":13,"verse":"When Athaliah heard the noise of the guards and the people, she went to them in the House of the Lord. "},{"num":14,"verse":"She looked, and there was the king standing beside the pillar according to the custom, and the officers and the trumpeters were in front of the king, and all the people of the land were celebrating and blowing trumpets. Then Athaliah tore her clothes and cried, “Treason! Treason!”"},{"num":15,"verse":"Then Jehoiada the priest commanded the officers in charge of the units of the army, “Bring her out between the ranks! Anyone who follows her is to be put to death with the sword!”"},{"num":16,"verse":"they laid hands on her as she was going through the passageway where the horses enter the king’s palace, and they killed her there."},{"num":17,"verse":"Then Jehoiada made a covenant between the Lord and the king and people that they would be the Lord’s people. He also made a covenant between the king and the people. "},{"num":18,"verse":"Then all the people of the land went to the temple of Baal and tore it down. They smashed its altar and its idols till they were dust. They also killed Mattan the priest of Baal in front of the altars. Then the priest posted a watch over the House of the Lord."},{"num":19,"verse":"Then he took the officers of the companies and the Carians and the guards and all the people of the land, and they brought the king down from the House of the Lord. They entered the king’s palace through the gate of the guards. Then he sat on the throne of the kings. "},{"num":20,"verse":"All the people of the land rejoiced, and the city was quiet. Athaliah had been put to death with the sword in the king’s palace."},{"num":21,"verse":"Joash was seven years old when he became king."}]