[{"header":"Athaliah and Joash"},{"num":11,"verse":"When Ahaziah’s mother, Athaliah, saw that her son was dead, she killed all the royal family. "},{"num":2,"verse":"But Jehosheba, King Jehoram’s daughter and Ahaziah’s sister, took Joash, Ahaziah’s son. She stole him from among the other sons of the king who were about to be murdered. She put Joash and his nurse in a bedroom to hide him from Athaliah, so he was not killed. "},{"num":3,"verse":"He hid with her in the Temple of the Lord for six years. During that time Athaliah ruled the land."},{"num":4,"verse":"In the seventh year Jehoiada sent for the commanders of groups of a hundred men, as well as the Carites. He brought them together in the Temple of the Lord and made an agreement with them. There, in the Temple of the Lord, he made them promise loyalty, and then he showed them the king’s son. "},{"num":5,"verse":"He commanded them, “This is what you must do. A third of you who go on duty on the Sabbath will guard the king’s palace. "},{"num":6,"verse":"A third of you will be at the Sur Gate, and another third will be at the gate behind the guard. This way you will guard the Temple. "},{"num":7,"verse":"The two groups who go off duty on the Sabbath must protect the Temple of the Lord for the king. "},{"num":8,"verse":"All of you must stand around the king, with weapons in hand. Kill anyone who comes near. Stay close to the king when he goes out and when he comes in.”"},{"num":9,"verse":"The commanders over a hundred men obeyed everything Jehoiada the priest had commanded. Each one took his men who came on duty on the Sabbath and those who went off duty on the Sabbath, and they came to Jehoiada the priest. "},{"num":10,"verse":"He gave the commanders the spears and shields that had belonged to King David and that were kept in the Temple of the Lord."},{"header":"Joash Becomes King"},{"num":11,"verse":"Then each guard took his place with his weapons in his hand. There were guards from the south side of the Temple to the north side. They stood by the altar and the Temple and around the king. "},{"num":12,"verse":"Jehoiada brought out the king’s son and put the crown on him and gave him a copy of the agreement. They appointed him king and poured olive oil on him. Then they clapped their hands and said, “Long live the king!”"},{"num":13,"verse":"When Athaliah heard the noise of the guards and the people, she went to them at the Temple of the Lord. "},{"num":14,"verse":"She looked, and there was the king, standing by the pillar, as the custom was. The officers and trumpeters were standing beside him, and all the people of the land were very happy and were blowing trumpets. Then Athaliah tore her clothes and screamed, “Traitors! Traitors!”"},{"num":15,"verse":"Jehoiada the priest gave orders to the commanders of a hundred men, who led the army. He said, “Surround her with soldiers and kill with a sword anyone who follows her.” He commanded this because he had said, “Don’t put Athaliah to death in the Temple of the Lord.” "},{"num":16,"verse":"So they caught her when she came to the horses’ entrance near the palace. There she was put to death."},{"num":17,"verse":"Then Jehoiada made an agreement between the Lord and the king and the people that they would be the Lord’s special people. He also made an agreement between the king and the people. "},{"num":18,"verse":"All the people of the land went to the temple of Baal and tore it down, smashing the altars and idols. They also killed Mattan, the priest of Baal, in front of the altars."},{"num":19,"verse":"He took with him the commanders of a hundred men and the Carites, the royal bodyguards, as well as the guards and all the people of the land. Together they took the king out of the Temple of the Lord and went into the palace through the gate of the guards. Then the king sat on the royal throne. "},{"num":20,"verse":"So all the people of the land were very happy, and Jerusalem had peace, because Athaliah had been put to death with the sword at the palace."},{"num":21,"verse":"Joash was seven years old when he became king."}]