[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-10 The call which Divine grace designs shall be made effectual; will be repeated till it is so, till we come to the call. Eli, perceiving that it was the voice of God that Samuel heard, instructed him what to say. Though it was a disgrace to Eli, for God's call to be directed to Samuel, yet he told him how to meet it. Thus the elder should do their utmost to assist and improve the younger that are rising up. Let us never fail to teach those who are coming after us, even such as will soon be preferred before us, Joh 1:30. Good words should be put into children's mouths betimes, by which they may be prepared to learn Divine things, and be trained up to regard them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The passage should be rendered thus: \"And it came to pass at that time that Eli was sleeping in his place; and his eyes had begun to grow dim; he could not see. And the lamp of God was not yet gone out, and Samuel was sleeping in the temple of the Lord where the ark of God was; and the Lord called Samuel, etc.\" Eli's old age and dimness of sight is probably mentioned as the reason why Samuel thought Eli had called him. Being a blind and feeble old man, he was likely to do so if he wanted anything, either for himself, or for the service of the temple. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5-18. he ran unto Eli, and said, Here am I; for thou calledst me—It is evident that his sleeping chamber was close to that of the aged high priest and that he was accustomed to be called during the night. The three successive calls addressed to the boy convinced Eli of the divine character of the speaker, and he therefore exhorted the child to give a reverential attention to the message. The burden of [the Lord's message] was an extraordinary premonition of the judgments that impended over Eli's house; and the aged priest, having drawn the painful secret from the child, exclaimed, \"It is the Lord; let him do what seemeth him good.\" Such is the spirit of meek and unmurmuring submission in which we ought to receive the dispensations of God, however severe and afflictive. But, in order to form a right estimate of Eli's language and conduct on this occasion, we must consider the overwhelming accumulation of judgments denounced against his person, his sons, his descendants—his altar, and nation. With such a threatening prospect before him, his piety and meekness were wonderful. In his personal character he seems to have been a good man, but his sons' conduct was flagrantly bad; and though his misfortunes claim our sympathy, it is impossible to approve or defend the weak and unfaithful course which, in the retributive justice of God, brought these adversities upon him.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He ran; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " showing his great faithfulness and diligence in the service, either of the Lord, or of his master Eli. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he ran unto Eli, and said here am I,.... He got out of his bed as fast as he could, and put on his clothes, and ran with all haste to the apartment where Eli lay, supposing he wanted some immediate assistance, which he was there ready to give him to the utmost of his ability; and he made the more haste, as knowing his age and infirmities, and being desirous, out of affection to him, to help him as soon as possible: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for thou calledst me; he took it to be the voice of Eli, partly because there was no other man in the tabernacle, it being in the middle of the night, or early in the morning, before the doors were opened, or any of the priests were come in to minister, and partly because the voice might be very much like Eli's, and which was done to direct him to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he said, I called not, lie down again; he signified he wanted nothing, and so had no occasion to call him, nor had he, but bid him go to bed again, and sleep quietly: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he went and lay down; and very probably fell asleep again. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he went and lay down; and very probably fell asleep again. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he ran unto Eli, and said, Here am I; for thou calledst me. And he said, I called not; lie down again. And he went and lay down.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he ran",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Note Samuel’s alacrity to serve the aged priest, his spiritual father.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As soon as Samuel heard his name called out, he hastened to Eli to receive his commands. But Eli bade him lie down again, as he had not called him. At first, no doubt, he thought the call which Samuel had heard was nothing more than a false impression of the youth, who had been fast asleep. But the same thing was repeated a second and a third time; for, as the historian explains in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Samuel had not yet known Jehovah, and (for) the word of Jehovah was not yet revealed to him.\" (The perfect ידע after טרם, though very rare, is fully supported by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 90:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 8:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and therefore is not to be altered into ידע, as Dietrich and Bttcher propose.) He therefore imagined again that Eli had called him. But when he came to Eli after the third call, Eli perceived that the Lord was calling, and directed Samuel, if the call were repeated, to answer, \"Speak, Lord; for Thy servant heareth.\" ",
        "children": []
      }
    ]
  }
]