[{"num":36,"verse":"To victory, to David, the servant of the Lord. The unjust man said, that he trespass in himself; the dread of God is not before his eyes. (To the victory of David, the servant of the Lord. The wicked man said, My sin, or my trespass, is my concern alone; and so the fear of God is not in his heart/and so reverence for God is not in his heart.)"},{"num":2,"verse":"For he did guilefully in the sight of God; that his wickedness be found to (be) hatred. (But he did deceitfully before God; until his wickedness was found to be hateful.)"},{"num":3,"verse":"The words of his mouth be wickedness and guile; he would not understand to do well. (The words of his mouth be wicked and deceitful; he desireth not to understand, or to do good.)"},{"num":4,"verse":"He thought wickedness in his bed; he stood nigh (to) all way(s) (that be) not good; forsooth he hated not malice."},{"num":5,"verse":"Lord, thy mercy is in heaven; and thy truth is unto [the] clouds. (Lord, thy love reacheth up to the heavens; and thy faithfulness up to the clouds.)"},{"num":6,"verse":"Thy rightfulness is as the hills of God; thy dooms be (as) much depth of waters. Lord, thou shalt save men and beasts; (Thy righteousness is as high as the mountains; thy judgements, or thy just acts, be as deep as the water. Lord, thou shalt save people and beasts;)"},{"num":7,"verse":"as thou, God, hast multiplied thy mercy. But the sons of men shall hope in the covering of thy wings. (for thou, God, hast multiplied thy love. And so the sons and daughters of men shall hope for/shall trust in the covering of thy wings.)"},{"num":8,"verse":"They shall be (ful)filled greatly of the plenty of thine house; and thou shalt give drink to them of the stiff stream of thy liking. (They shall be filled from the rich plenty of thy House; and thou shalt give drink to them out of the flowing stream of thy delights, or of thy goodness.)"},{"num":9,"verse":"For the well of life is with thee; and in thy light we shall see light."},{"num":10,"verse":"Lord, set forth thy mercy to them that know thee; and thy rightfulness to them that be of rightful heart. (Lord, continue to show thy love to those who know thee; and thy righteousness to those who have an upright heart.)"},{"num":11,"verse":"The foot of pride come not to me; and the hand of the sinner move me not. (Let not the foot of pride come against me; nor let the hand of the sinner upset me.)"},{"num":12,"verse":"There they have fallen down, that work wickedness; they be cast out, and might not stand. (See where those who do evil have fallen; yea, they be thrown down, and be not able to stand up again.)"}]