[{"header":"Conditions for Restoration and Blessing"},{"num":30,"verse":"“I have now given you a choice between a blessing and a curse. When all these things have happened to you, and you are living among the nations where the Lord your God has scattered you, you will remember the choice I gave you. "},{"num":2,"verse":"If you and your descendants will turn back to the Lord and with all your heart obey his commands that I am giving you today, "},{"num":3,"verse":"then the Lord your God will have mercy on you. He will bring you back from the nations where he has scattered you, and he will make you prosperous again. "},{"num":4,"verse":"Even if you are scattered to the farthest corners of the earth, the Lord your God will gather you together and bring you back, "},{"num":5,"verse":"so that you may again take possession of the land where your ancestors once lived. And he will make you more prosperous and more numerous than your ancestors ever were. "},{"num":6,"verse":"The Lord your God will give you and your descendants obedient hearts, so that you will love him with all your heart, and you will continue to live in that land. "},{"num":7,"verse":"He will turn all these curses against your enemies, who hated you and oppressed you, "},{"num":8,"verse":"and you will again obey him and keep all his commands that I am giving you today. "},{"num":9,"verse":"The Lord will make you prosperous in all that you do; you will have many children and a lot of livestock, and your fields will produce abundant crops. He will be as glad to make you prosperous as he was to make your ancestors prosperous, "},{"num":10,"verse":"but you will have to obey him and keep all his laws that are written in this book of his teachings. You will have to turn to him with all your heart."},{"num":11,"verse":"“The command that I am giving you today is not too difficult or beyond your reach. "},{"num":12,"verse":"It is not up in the sky. You do not have to ask, ‘Who will go up and bring it down for us, so that we can hear it and obey it?’ "},{"num":13,"verse":"Nor is it on the other side of the ocean. You do not have to ask, ‘Who will go across the ocean and bring it to us, so that we may hear it and obey it?’ "},{"num":14,"verse":"No, it is here with you. You know it and can quote it, so now obey it."},{"num":15,"verse":"“Today I am giving you a choice between good and evil, between life and death. "},{"num":16,"verse":"If you obey the commands of the Lord your God, which I give you today, if you love him, obey him, and keep all his laws, then you will prosper and become a nation of many people. The Lord your God will bless you in the land that you are about to occupy. "},{"num":17,"verse":"But if you disobey and refuse to listen, and are led away to worship other gods, "},{"num":18,"verse":"you will be destroyed—I warn you here and now. You will not live long in that land across the Jordan that you are about to occupy. "},{"num":19,"verse":"I am now giving you the choice between life and death, between God's blessing and God's curse, and I call heaven and earth to witness the choice you make. Choose life. "},{"num":20,"verse":"Love the Lord your God, obey him and be faithful to him, and then you and your descendants will live long in the land that he promised to give your ancestors, Abraham, Isaac, and Jacob.”"}]