[{"header":"The Lord Will Bless His People"},{"num":30,"verse":"I have told you about all these blessings and curses. The Lord your God will bring them on you. Then you will think carefully about the blessings and curses. You will think about them everywhere the Lord your God scatters you among the nations. "},{"num":2,"verse":"You and your children will return to the Lord your God. You will obey him with all your heart and with all your soul. That will be according to everything I’m commanding you today. "},{"num":3,"verse":"When all that happens, the Lord your God will bless you with great success again. He will be very kind to you. He’ll bring you back from all the nations where he scattered you. "},{"num":4,"verse":"Suppose you have been forced to go away to the farthest land on earth. The Lord your God will bring you back even from there. "},{"num":5,"verse":"He will bring you to the land that belonged to your people of long ago. You will take it over. He’ll make you better off than your people were. He’ll cause there to be more of you than there were of them. "},{"num":6,"verse":"The Lord your God will keep you from being stubborn. He’ll do the same thing for your children and their children. Then you will love him with all your heart and with all your soul. And you will live. "},{"num":7,"verse":"The Lord your God will put all these curses on your enemies. They hated you and hunted you down. "},{"num":8,"verse":"You will obey the Lord again. You will obey all his commands that I’m giving you today. "},{"num":9,"verse":"Then the Lord your God will give you great success in everything you do. You will have many children. Your livestock will have many little ones. Your crops will do very well. The Lord will take delight in you again. He’ll give you success. That’s what he did for your people of long ago. "},{"num":10,"verse":"But you must obey the Lord your God. You must keep his commands and rules. They are written in this Book of the Law. You must turn to the Lord your God with all your heart and with all your soul."},{"header":"Choose Life, Not Death"},{"num":11,"verse":"What I’m commanding you today is not too hard for you. It isn’t beyond your reach. "},{"num":12,"verse":"It isn’t up in heaven. So you don’t have to ask, “Who will go up into heaven to get it? Who will announce it to us so we can obey it?” "},{"num":13,"verse":"And it isn’t beyond the ocean. So you don’t have to ask, “Who will go across the ocean to get it? Who will announce it to us so we can obey it?” "},{"num":14,"verse":"No, the message isn’t far away at all. In fact, it’s really near you. It’s in your mouth and in your heart so that you can obey it."},{"num":15,"verse":"Today I’m giving you a choice. You can have life and success. Or you can have death and harm. "},{"num":16,"verse":"I’m commanding you today to love the Lord your God. I’m commanding you to live exactly as he wants you to live. You must obey his commands, rules and laws. Then you will live. There will be many of you. The Lord your God will bless you in the land you are entering to take as your own."},{"num":17,"verse":"Don’t let your hearts turn away from the Lord. Instead, obey him. Don’t let yourselves be drawn away to other gods. And don’t bow down to them and worship them. "},{"num":18,"verse":"If you do, I announce to you this day that you will certainly be destroyed. You are about to go across the Jordan River and take over the land. But you won’t live there very long."},{"num":19,"verse":"I’m calling for the heavens and the earth to be witnesses against you this very day. I’m offering you the choice of life or death. You can choose either blessings or curses. But I want you to choose life. Then you and your children will live. "},{"num":20,"verse":"And you will love the Lord your God. You will obey him. You will remain true to him. The Lord is your very life. He will give you many years in the land. He promised to give that land to your fathers, to Abraham, Isaac and Jacob."}]