[{"num":30,"verse":"All these blessings and curses I have spoken about will happen to you. Take them to heart when you are among all the nations where Yahweh your Elohim will scatter you. "},{"num":2,"verse":"If you and your children return to Yahweh your Elohim and obey him with all your heart and with all your soul, doing everything I command you today, "},{"num":3,"verse":"he will restore your fortunes. He will have mercy on you and gather you from all the nations of the world where Yahweh your Elohim will scatter you. "},{"num":4,"verse":"Even if you are scattered to the most distant country in the world, Yahweh your Elohim will gather you and bring you back from there. "},{"num":5,"verse":"Yahweh your Elohim will bring you to the land your ancestors owned. You will take possession of it, and Yahweh will make you more prosperous and numerous than your ancestors were."},{"num":6,"verse":"Yahweh your Elohim will circumcise your hearts and the hearts of your descendants. You will love Yahweh your Elohim with all your heart and with all your soul, and you will live. "},{"num":7,"verse":"Then Yahweh your Elohim will put all these curses on your enemies, those who hate you and persecute you. "},{"num":8,"verse":"You will again obey Yahweh and follow all his commands that I’m giving you today. "},{"num":9,"verse":"Yahweh your Elohim will give you many blessings in everything you do: You will have many children. Your animals will have many offspring. Your soil will produce many crops. Yahweh will again delight in making you as prosperous as he made your ancestors. "},{"num":10,"verse":"He will do this if you obey Yahweh your Elohim and follow his commands and laws that are written in this Book of Teachings and return to Yahweh your Elohim with all your heart and with all your soul."},{"num":11,"verse":"This command I’m giving you today isn’t too hard for you or beyond your reach. "},{"num":12,"verse":"It’s not in heaven. You don’t have to ask, “Who will go to heaven to get this command for us so that we can hear it and obey it?” "},{"num":13,"verse":"This command isn’t on the other side of the sea. You don’t have to ask, “Who will cross the sea to get it for us so that we can hear it and obey it?” "},{"num":14,"verse":"No, these words are very near you. They’re in your mouth and in your heart so that you will obey them."},{"header":"Choose between Life and Death"},{"num":15,"verse":"Today I offer you life and prosperity or death and destruction. "},{"num":16,"verse":"This is what I’m commanding you today: Love Yahweh your Elohim, follow his directions, and obey his commands, laws, and rules. Then you will live, your population will increase, and Yahweh your Elohim will bless you in the land that you’re about to enter and take possession of."},{"num":17,"verse":"But your hearts might turn away, and you might not listen. You might be tempted to bow down to other gods and worship them. "},{"num":18,"verse":"If you do, I tell you today that you will certainly be destroyed. You will not live for a long time in the land that you’re going to take possession of when you cross the Jordan River."},{"num":19,"verse":"I call on heaven and earth as witnesses today that I have offered you life or death, blessings or curses. Choose life so that you and your descendants will live. "},{"num":20,"verse":"Love Yahweh your Elohim, obey him, and be loyal to him. This will be your way of life, and it will mean a long life for you in the land that Yahweh swore to give to your ancestors Abraham, Isaac, and Jacob."}]