[{"header":"Up to Jerusalem"},{"num":7,"verse":"After this, Jesus moved around in Galilee. He did not want to travel in Judea because the Jews were trying to find a way to kill him."},{"num":2,"verse":"Now the Jewish Festival of Shelters was near. "},{"num":3,"verse":"So his brothers said to him, “You should leave here and go to Judea so your disciples there can also see the works you are doing. "},{"num":4,"verse":"Indeed, no one acts in secret who wants to be known in public. If you are doing these things, show yourself to the world.” "},{"num":5,"verse":"For even his own brothers did not believe in him."},{"num":6,"verse":"So Jesus told them, “The right time for me has not arrived yet, but any time is the right time for you. "},{"num":7,"verse":"The world cannot hate you, but it hates me, because I testify about it, that its works are evil. "},{"num":8,"verse":"You go up to the festival. I am not going up to this festival yet, because the right time for me has not yet arrived.”"},{"num":9,"verse":"After he said this, he stayed in Galilee. "},{"num":10,"verse":"However, after his brothers had gone up to the festival, then he also went up, not openly but in a private way."},{"header":"At the Festival of Shelters[c]"},{"num":11,"verse":"At the festival, the Jews kept looking for him. They asked, “Where is he?” "},{"num":12,"verse":"And there was widespread whispering about him in the crowds. Some were saying, “He’s a good man.” Others were saying, “No, he deceives the people.” "},{"num":13,"verse":"Yet no one spoke openly about him for fear of the Jews."},{"num":14,"verse":"When the festival was already half over, Jesus went up to the temple courts and began to teach. "},{"num":15,"verse":"The Jews were amazed and asked, “How does this man know what is written without being instructed?”"},{"num":16,"verse":"Jesus answered them, “My teaching is not mine, but it comes from him who sent me. "},{"num":17,"verse":"If anyone wants to do his will, he will know whether my teaching is from God or if I speak on my own. "},{"num":18,"verse":"The one who speaks on his own is seeking his own glory. But he who seeks the glory of the one who sent him—that is the one who is true, and there is no unrighteousness in him. "},{"num":19,"verse":"Didn’t Moses give you the law? Yet none of you does what the law tells you. Why are you trying to kill me?”"},{"num":20,"verse":"“You have a demon!” the crowd answered. “Who is trying to kill you?”"},{"num":21,"verse":"Jesus answered them, “I did one work, and you are all amazed. "},{"num":22,"verse":"Consider this: Because Moses has given you circumcision (not that it comes from Moses, but from the fathers), you circumcise a man even on the Sabbath. "},{"num":23,"verse":"If a man receives circumcision on the Sabbath so that the law of Moses may not be broken, are you angry at me because I made a man completely well on the Sabbath? "},{"num":24,"verse":"Stop judging by outward appearance. Instead make a right judgment.”"},{"num":25,"verse":"Some of the people from Jerusalem were saying, “Isn’t this the man they want to kill? "},{"num":26,"verse":"Yet, look! He’s speaking openly, and they don’t say a thing to him. Certainly the rulers have not concluded that he is the Christ, have they? "},{"num":27,"verse":"But we know where this man is from. When the Christ comes, no one will know where he is from.”"},{"num":28,"verse":"Then Jesus called out as he was teaching in the temple courts, “Yes, you know me, and you know where I am from. Yet I have not come on my own, but the one who sent me is real. You do not know him. "},{"num":29,"verse":"I know him because I am from him, and he sent me.”"},{"num":30,"verse":"So they tried to arrest him, but no one laid a hand on him, because his time had not yet come."},{"num":31,"verse":"But many in the crowd believed in him and asked, “When the Christ comes, he won’t do more miraculous signs than this man, will he?”"},{"num":32,"verse":"The Pharisees heard the crowd whispering these things about him, so the chief priests and the Pharisees sent guards to arrest him."},{"num":33,"verse":"Then Jesus said, “I am going to be with you only a little while longer. Then I am going away to the one who sent me. "},{"num":34,"verse":"You will be looking for me and will not find me, and where I am going to be, you cannot come.”"},{"num":35,"verse":"Then the Jews said to one another, “Where does this man intend to go that we will not find him? He does not intend to go to the Jews scattered among the Greeks and teach the Greeks, does he? "},{"num":36,"verse":"What does he mean by saying, ‘You will be looking for me and will not find me, and where I am going to be, you cannot come’?”"},{"num":37,"verse":"On the last and most important day of the festival, Jesus stood up and called out, “If anyone is thirsty, let him come to me and drink! "},{"num":38,"verse":"As the Scripture has said, streams of living water will flow from deep within the person who believes in me.” "},{"num":39,"verse":"By this he meant the Spirit, whom those who believed in him were going to receive. For the Holy Spirit had not yet come, because Jesus had not yet been glorified."},{"num":40,"verse":"After hearing his words, some of the people said, “This is truly the Prophet.” "},{"num":41,"verse":"Others said, “This is the Christ.” But some said, “Surely the Christ does not come from Galilee, does he? "},{"num":42,"verse":"Doesn’t the Scripture say that the Christ comes from David’s descendants and from the little town of Bethlehem where David lived?” "},{"num":43,"verse":"So the people were divided because of him. "},{"num":44,"verse":"Some of them wanted to arrest him, but no one laid hands on him."},{"num":45,"verse":"Then the guards came to the chief priests and Pharisees, who asked them, “Why didn’t you bring him in?”"},{"num":46,"verse":"The guards answered, “No one ever spoke the way this man does!”"},{"num":47,"verse":"So the Pharisees answered them, “You have not been deceived too, have you? "},{"num":48,"verse":"Have any of the rulers or Pharisees believed in him? "},{"num":49,"verse":"But this crowd, which does not know the law, is cursed!”"},{"num":50,"verse":"One of them, Nicodemus, who had come to Jesus earlier, asked, "},{"num":51,"verse":"“Does our law condemn a man before we hear from him and find out what he’s doing?”"},{"num":52,"verse":"“You are not from Galilee too, are you?” they replied. “Search and you will see that a prophet does not come from Galilee.”"},{"num":53,"verse":"Then each of them went home."}]