[[],[],[{"type":"prose","content":"Later Jesus was going about his business in Galilee. He didn’t want to travel in Judea because the Jews there were looking for a chance to kill him. It was near the time of Tabernacles, a feast observed annually by the Jews."}],[{"type":"prose","content":"His brothers said, “Why don’t you leave here and go up to the Feast so your disciples can get a good look at the works you do? No one who intends to be publicly known does everything behind the scenes. If you’re serious about what you are doing, come out in the open and show the world.” His brothers were pushing him like this because they didn’t believe in him either."}],[{"type":"prose","content":"Jesus came back at them, “Don’t pressure me. This isn’t my time. It’s your time—it’s  your time; you have nothing to lose. The world has nothing against you, but it’s up in arms against me. It’s against me because I expose the evil behind its pretensions. You go ahead, go up to the Feast. Don’t wait for me. I’m not ready. It’s not the right time for me.”"}],[{"type":"prose","content":"He said this and stayed on in Galilee. But later, after his family had gone up to the Feast, he also went. But he kept out of the way, careful not to draw attention to himself. The Jews were already out looking for him, asking around, “Where is that man?”"}],[{"type":"prose","content":"There was a lot of contentious talk about him circulating through the crowds. Some were saying, “He’s a good man.” But others said, “Not so. He’s selling snake oil.” This kind of talk went on in guarded whispers because of the intimidating Jewish leaders."}],[{"type":"header","content":"Could It Be the Messiah?"},{"type":"prose","content":"With the Feast already half over, Jesus showed up in the Temple, teaching. The Jews were impressed, but puzzled: “How does he know so much without being schooled?”"}],[{"type":"prose","content":"Jesus said, “I didn’t make this up. What I teach comes from the One who sent me. Anyone who wants to do his will can test this teaching and know whether it’s from God or whether I’m making it up. A person making things up tries to make himself look good. But someone trying to honor the one who sent him sticks to the facts and doesn’t tamper with reality. It was Moses, wasn’t it, who gave you God’s Law? But none of you are living it. So why are you trying to kill me?”"}],[{"type":"prose","content":"The crowd said, “You’re crazy! Who’s trying to kill you? You’re demon-possessed.”"}],[{"type":"prose","content":"Jesus said, “I did one miraculous thing a few months ago, and you’re still standing around getting all upset, wondering what I’m up to. Moses prescribed circumcision—originally it came not from Moses but from his ancestors—and so you circumcise a man, dealing with one part of his body, even if it’s the Sabbath. You do this in order to preserve one item in the Law of Moses. So why are you upset with me because I made a man’s whole body well on the Sabbath? Don’t be hypercritical; use your head—and heart!—to discern what is right, to test what is authentically right.”"}],[{"type":"prose","content":"That’s when some of the people of Jerusalem said, “Isn’t this the one they were out to kill? And here he is out in the open, saying whatever he pleases, and no one is stopping him. Could it be that the rulers know that he is, in fact, the Messiah? And yet we know where this man came from. The Messiah is going to come out of nowhere. Nobody is going to know where he comes from.”"}],[{"type":"prose","content":"That provoked Jesus, who was teaching in the Temple, to cry out, “Yes, you think you know me and where I’m from, but that’s not where I’m from. I didn’t set myself up in business. My true origin is in the One who sent me, and you don’t know him at all. I come from him—that’s how I know him. He sent me here.”"}],[{"type":"prose","content":"They were looking for a way to arrest him, but not a hand was laid on him because it wasn’t yet God’s time. Many from the crowd committed themselves in faith to him, saying, “Will the Messiah, when he comes, provide better or more convincing evidence than this?”"}],[{"type":"prose","content":"The Pharisees, alarmed at this seditious undertow going through the crowd, teamed up with the high priests and sent their police to arrest him. Jesus rebuffed them: “I am with you only a short time. Then I go on to the One who sent me. You will look for me, but you won’t find me. Where I am, you can’t come.”"}],[{"type":"prose","content":"The Jews put their heads together. “Where do you think he is going that we won’t be able to find him? Do you think he is about to travel to the Greek world to teach the Jews? What is he talking about, anyway: ‘You will look for me, but you won’t find me,’ and ‘Where I am, you can’t come’?”"}],[{"type":"prose","content":"On the final and climactic day of the Feast, Jesus took his stand. He cried out, “If anyone thirsts, let him come to me and drink. Rivers of living water will brim and spill out of the depths of anyone who believes in me this way, just as the Scripture says.” (He said this in regard to the Spirit, whom those who believed in him were about to receive. The Spirit had not yet been given because Jesus had not yet been glorified.)"}],[{"type":"prose","content":"Those in the crowd who heard these words were saying, “This has to be the Prophet.” Others said, “He is the Messiah!” But others were saying, “The Messiah doesn’t come from Galilee, does he? Don’t the Scriptures tell us that the Messiah comes from David’s line and from Bethlehem, David’s village?” So there was a split in the crowd over him. Some went so far as wanting to arrest him, but no one laid a hand on him."}],[{"type":"prose","content":"That’s when the Temple police reported back to the high priests and Pharisees, who demanded, “Why didn’t you bring him with you?”"}],[{"type":"prose","content":"The police answered, “Have you heard the way he talks? We’ve never heard anyone speak like this man.”"}],[{"type":"prose","content":"The Pharisees said, “Are you carried away like the rest of the rabble? You don’t see any of the leaders believing in him, do you? Or any from the Pharisees? It’s only this crowd, ignorant of God’s Law, that is taken in by him—and damned.”"}],[{"type":"prose","content":"Nicodemus, the man who had come to Jesus earlier and was both a ruler and a Pharisee, spoke up. “Does our Law decide about a man’s guilt without first listening to him and finding out what he is doing?”"}],[{"type":"prose","content":"But they cut him off. “Are you also campaigning for the Galilean? Examine the evidence. See if any prophet ever comes from Galilee.”[Then they all went home."}]]