[{"header":"Jesus Goes to the Festival of Booths"},{"num":7,"verse":"Yeshua later traveled throughout Galilee. He didn’t want to travel in Judea because Jews there wanted to kill him."},{"num":2,"verse":"The time for the Jewish Festival of Booths was near. "},{"num":3,"verse":"So Yeshua’s brothers told him, “Leave this place, and go to Judea so that your disciples can see the things that you’re doing. "},{"num":4,"verse":"No one does things secretly when he wants to be known publicly. If you do these things, you should let the world see you.” "},{"num":5,"verse":"Even his brothers didn’t believe in him."},{"num":6,"verse":"Yeshua told them, “Now is not the right time for me to go. Any time is right for you. "},{"num":7,"verse":"The world cannot hate you, but it hates me because I say that what everyone does is evil. "},{"num":8,"verse":"Go to the festival. I’m not going to this festival right now. Now is not the right time for me to go.”"},{"num":9,"verse":"After saying this, Yeshua stayed in Galilee. "},{"num":10,"verse":"But after his brothers had gone to the festival, Yeshua went. He didn’t go publicly but secretly."},{"num":11,"verse":"The Jews were looking for Yeshua in the crowd at the festival. They kept asking, “Where is that man?” "},{"num":12,"verse":"The crowds argued about Yeshua. Some people said, “He’s a good man,” while others said, “No he isn’t. He deceives the people.” "},{"num":13,"verse":"Yet, no one would talk openly about him because they were afraid of the Jews."},{"num":14,"verse":"When the festival was half over, Yeshua went to the temple courtyard and began to teach. "},{"num":15,"verse":"The Jews were surprised and asked, “How can this man be so educated when he hasn’t gone to school?”"},{"num":16,"verse":"Yeshua responded to them, “What I teach doesn’t come from me but from the one who sent me. "},{"num":17,"verse":"Those who want to follow the will of God will know if what I teach is from God or if I teach my own thoughts. "},{"num":18,"verse":"Those who speak their own thoughts are looking for their own glory. But the man who wants to bring glory to the one who sent him is a true teacher and doesn’t have dishonest motives. "},{"num":19,"verse":"Didn’t Moses give you his teachings? Yet, none of you does what Moses taught you. So why do you want to kill me?”"},{"num":20,"verse":"The crowd answered, “You’re possessed by a demon! Who wants to kill you?”"},{"num":21,"verse":"Yeshua answered them, “I performed one miracle, and all of you are surprised by it. "},{"num":22,"verse":"Moses gave you the teaching about circumcision (although it didn’t come from Moses but from our ancestors). So you circumcise a male on a day of worship. "},{"num":23,"verse":"If you circumcise a male on the day of worship to follow Moses’ Teachings, why are you angry with me because I made a man entirely well on the day of worship? "},{"num":24,"verse":"Stop judging by outward appearance! Instead, judge correctly.”"},{"num":25,"verse":"Some of the people who lived in Jerusalem said, “Isn’t this the man they want to kill? "},{"num":26,"verse":"But look at this! He’s speaking in public, and no one is saying anything to him! Can it be that the rulers really know that this man is the Messiah? "},{"num":27,"verse":"However, we know where this man comes from. When the Christ comes, no one will know where he is from.”"},{"num":28,"verse":"Then, while Yeshua was teaching in the temple courtyard, he said loudly, “You know me, and you know where I come from. I didn’t decide to come on my own. The one who sent me is true. He’s the one you don’t know. "},{"num":29,"verse":"I know him because I am from him and he sent me.”"},{"num":30,"verse":"The Jews tried to arrest him but couldn’t because his time had not yet come."},{"num":31,"verse":"However, many people in the crowd believed in him. They asked, “When the Messiah comes, will he perform more miracles than this man has?”"},{"num":32,"verse":"The Pharisees heard the crowd saying things like this about him. So the chief priests and the Pharisees sent temple guards to arrest Yeshua."},{"num":33,"verse":"Yeshua said, “I will still be with you for a little while. Then I’ll go to the one who sent me. "},{"num":34,"verse":"You will look for me, but you won’t find me. You can’t go where I’m going.”"},{"num":35,"verse":"The Jews said among themselves, “Where does this man intend to go so that we won’t find him? Does he mean that he’ll live with the Jews who are scattered among the Greeks and that he’ll teach the Greeks? "},{"num":36,"verse":"What does he mean when he says, ‘You will look for me, but you won’t find me,’ and ‘You can’t go where I’m going’?”"},{"num":37,"verse":"On the last and most important day of the festival, Yeshua was standing in the temple courtyard. He said loudly, “Whoever is thirsty must come to me to drink. "},{"num":38,"verse":"As Scripture says, ‘Streams of living water will flow from deep within the person who believes in me.’” "},{"num":39,"verse":"Yeshua said this about the Spirit, whom his believers would receive. The Spirit was not yet evident, as it would be after Yeshua had been glorified."},{"num":40,"verse":"After some of the crowd heard Yeshua say these words, they said, “This man is certainly the prophet.” "},{"num":41,"verse":"Other people said, “This man is the Messiah.” Still other people asked, “How can the Messiah come from Galilee? "},{"num":42,"verse":"Doesn’t Scripture say that the Messiah will come from the descendants of David and from the village of Bethlehem, where David lived?” "},{"num":43,"verse":"So the people were divided because of Yeshua. "},{"num":44,"verse":"Some of them wanted to arrest him, but they couldn’t."},{"num":45,"verse":"When the temple guards returned, the chief priests and Pharisees asked them, “Why didn’t you bring Yeshua?”"},{"num":46,"verse":"The temple guards answered, “No human has ever spoken like this man.”"},{"num":47,"verse":"The Pharisees asked the temple guards, “Have you been deceived too? "},{"num":48,"verse":"Has any ruler or any Pharisee believed in him? "},{"num":49,"verse":"This crowd is cursed because it doesn’t know Moses’ Teachings.”"},{"num":50,"verse":"One of those Pharisees was Nicodemus, who had previously visited Yeshua. Nicodemus asked them, "},{"num":51,"verse":"“Do Moses’ Teachings enable us to judge a person without first hearing that person’s side of the story? We can’t judge a person without finding out what that person has done.”"},{"num":52,"verse":"They asked Nicodemus, “Are you saying this because you’re from Galilee? Study the Scriptures, and you’ll see that no prophet comes from Galilee.”"},{"num":53,"verse":"Then each of them went home."}]