[{"num":7,"verse":"And Jesus was walking after these things in Galilee, for he did not wish to walk in Judea, because the Jews were seeking to kill him,"},{"num":2,"verse":"and the feast of the Jews was nigh -- that of tabernacles --"},{"num":3,"verse":"his brethren, therefore, said unto him, `Remove hence, and go away to Judea, that thy disciples also may behold thy works that thou dost;"},{"num":4,"verse":"for no one in secret doth anything, and himself seeketh to be in public; if thou dost these things -- manifest thyself to the world;'"},{"num":5,"verse":"for not even were his brethren believing in him."},{"num":6,"verse":"Jesus, therefore, saith to them, `My time is not yet present, but your time is always ready;"},{"num":7,"verse":"the world is not able to hate you, but me it doth hate, because I testify concerning it that its works are evil."},{"num":8,"verse":"Ye -- go ye up to this feast; I do not yet go up to this feast, because my time hath not yet been fulfilled;'"},{"num":9,"verse":"and saying these things to them, he remained in Galilee."},{"num":10,"verse":"And when his brethren went up, then also he himself went up to the feast, not manifestly, but as in secret;"},{"num":11,"verse":"the Jews, therefore, were seeking him, in the feast, and said, `Where is that one?'"},{"num":12,"verse":"and there was much murmuring about him among the multitudes, some indeed said -- `He is good;' and others said, `No, but he leadeth astray the multitude;'"},{"num":13,"verse":"no one, however, was speaking freely about him, through fear of the Jews."},{"num":14,"verse":"And it being now the middle of the feast, Jesus went up to the temple, and he was teaching,"},{"num":15,"verse":"and the Jews were wondering, saying, `How hath this one known letters -- not having learned?'"},{"num":16,"verse":"Jesus answered them and said, `My teaching is not mine, but His who sent me;"},{"num":17,"verse":"if any one may will to do His will, he shall know concerning the teaching, whether it is of God, or -- I do speak from myself."},{"num":18,"verse":"`He who is speaking from himself his own glory doth seek, but he who is seeking the glory of him who sent him, this one is true, and unrighteousness is not in him;"},{"num":19,"verse":"hath not Moses given you the law? and none of you doth the law; why me do ye seek to kill?'"},{"num":20,"verse":"The multitude answered and said, `Thou hast a demon, who doth seek to kill thee?'"},{"num":21,"verse":"Jesus answered and said to them, `One work I did, and ye all wonder,"},{"num":22,"verse":"because of this, Moses hath given you the circumcision -- not that it is of Moses, but of the fathers -- and on a sabbath ye circumcise a man;"},{"num":23,"verse":"if a man doth receive circumcision on a sabbath that the law of Moses may not be broken, are ye wroth with me that I made a man all whole on a sabbath?"},{"num":24,"verse":"judge not according to appearance, but the righteous judgment judge.'"},{"num":25,"verse":"Certain, therefore, of the Jerusalemites said, `Is not this he whom they are seeking to kill?"},{"num":26,"verse":"and, lo, he doth speak freely, and they say nothing to him; did the rulers at all know truly that this is truly the Christ?"},{"num":27,"verse":"but this one -- we have known whence he is; and the Christ, when he doth come, no one doth know whence he is.'"},{"num":28,"verse":"Jesus cried, therefore, in the temple, teaching and saying, `Ye have both known me, and ye have known whence I am; and I have not come of myself, but He who sent me is true, whom ye have not known;"},{"num":29,"verse":"and I have known Him, because I am from Him, and He did send me.'"},{"num":30,"verse":"They were seeking, therefore, to seize him, and no one laid the hand on him, because his hour had not yet come,"},{"num":31,"verse":"and many out of the multitude did believe in him, and said -- `The Christ -- when he may come -- will he do more signs than these that this one did?'"},{"num":32,"verse":"The Pharisees heard the multitude murmuring these things concerning him, and the Pharisees and the chief priests sent officers that they may take him;"},{"num":33,"verse":"Jesus, therefore, said to them, `Yet a little time I am with you, and I go away unto Him who sent me;"},{"num":34,"verse":"ye will seek me, and ye shall not find; and where I am, ye are not able to come.'"},{"num":35,"verse":"The Jews, therefore, said among themselves, `Whither is this one about to go that we shall not find him? -- to the dispersion of the Greeks is he about to go? and to teach the Greeks;"},{"num":36,"verse":"what is this word that he said, Ye will seek me, and ye shall not find? and, Where I am, ye are not able to come?'"},{"num":37,"verse":"And in the last, the great day of the feast, Jesus stood and cried, saying, `If any one doth thirst, let him come unto me and drink;"},{"num":38,"verse":"he who is believing in me, according as the Writing said, Rivers out of his belly shall flow of living water;'"},{"num":39,"verse":"and this he said of the Spirit, which those believing in him were about to receive; for not yet was the Holy Spirit, because Jesus was not yet glorified."},{"num":40,"verse":"Many, therefore out of the multitude, having heard the word, said, `This is truly the Prophet;'"},{"num":41,"verse":"others said, `This is the Christ;' and others said, `Why, out of Galilee doth the Christ come?"},{"num":42,"verse":"Did not the Writing say, that out of the seed of David, and from Bethlehem -- the village where David was -- the Christ doth come?'"},{"num":43,"verse":"A division, therefore, arose among the multitude because of him."},{"num":44,"verse":"And certain of them were willing to seize him, but no one laid hands on him;"},{"num":45,"verse":"the officers came, therefore, unto the chief priests and Pharisees, and they said to them, `Wherefore did ye not bring him?'"},{"num":46,"verse":"The officers answered, `Never so spake man -- as this man.'"},{"num":47,"verse":"The Pharisees, therefore, answered them, `Have ye also been led astray?"},{"num":48,"verse":"did any one out of the rulers believe in him? or out of the Pharisees?"},{"num":49,"verse":"but this multitude, that is not knowing the law, is accursed.'"},{"num":50,"verse":"Nicodemus saith unto them -- he who came by night unto him -- being one of them,"},{"num":51,"verse":"`Doth our law judge the man, if it may not hear from him first, and know what he doth?'"},{"num":52,"verse":"They answered and said to him, `Art thou also out of Galilee? search and see, that a prophet out of Galilee hath not risen;'"},{"num":53,"verse":"and each one went on to his house, but Jesus went on to the mount of the Olives."}]