[[],[{"type":"prose","content":"Jacob went on his way and the angels of God met him; "}],[{"type":"prose","content":"and when Jacob saw them he said, “This is God’s camp!” So he called that place Mahanaim."}],[{"type":"header","content":"Jacob Sends Presents to Appease Esau"},{"type":"prose","content":"Jacob sent messengers before him to his brother Esau in the land of Seir, the country of Edom, "}],[{"type":"prose","content":"instructing them, “Thus you shall say to my lord Esau: Thus says your servant Jacob, ‘I have lived with Laban as an alien, and stayed until now; "}],[{"type":"prose","content":"and I have oxen, donkeys, flocks, male and female slaves; and I have sent to tell my lord, in order that I may find favor in your sight.’”"}],[{"type":"prose","content":"The messengers returned to Jacob, saying, “We came to your brother Esau, and he is coming to meet you, and four hundred men are with him.” "}],[{"type":"prose","content":"Then Jacob was greatly afraid and distressed; and he divided the people that were with him, and the flocks and herds and camels, into two companies, "}],[{"type":"prose","content":"thinking, “If Esau comes to the one company and destroys it, then the company that is left will escape.”"}],[{"type":"prose","content":"And Jacob said, “O God of my father Abraham and God of my father Isaac, O LORD who said to me, ‘Return to your country and to your kindred, and I will do you good,’ "}],[{"type":"prose","content":"I am not worthy of the least of all the steadfast love and all the faithfulness that you have shown to your servant, for with only my staff I crossed this Jordan; and now I have become two companies. "}],[{"type":"prose","content":"Deliver me, please, from the hand of my brother, from the hand of Esau, for I am afraid of him; he may come and kill us all, the mothers with the children. "}],[{"type":"prose","content":"Yet you have said, ‘I will surely do you good, and make your offspring as the sand of the sea, which cannot be counted because of their number.’”"}],[{"type":"prose","content":"So he spent that night there, and from what he had with him he took a present for his brother Esau, "}],[{"type":"prose","content":"two hundred female goats and twenty male goats, two hundred ewes and twenty rams, "}],[{"type":"prose","content":"thirty milch camels and their colts, forty cows and ten bulls, twenty female donkeys and ten male donkeys. "}],[{"type":"prose","content":"These he delivered into the hand of his servants, every drove by itself, and said to his servants, “Pass on ahead of me, and put a space between drove and drove.” "}],[{"type":"prose","content":"He instructed the foremost, “When Esau my brother meets you, and asks you, ‘To whom do you belong? Where are you going? And whose are these ahead of you?’ "}],[{"type":"prose","content":"then you shall say, ‘They belong to your servant Jacob; they are a present sent to my lord Esau; and moreover he is behind us.’” "}],[{"type":"prose","content":"He likewise instructed the second and the third and all who followed the droves, “You shall say the same thing to Esau when you meet him, "}],[{"type":"prose","content":"and you shall say, ‘Moreover your servant Jacob is behind us.’” For he thought, “I may appease him with the present that goes ahead of me, and afterwards I shall see his face; perhaps he will accept me.” "}],[{"type":"prose","content":"So the present passed on ahead of him; and he himself spent that night in the camp."}],[{"type":"header","content":"Jacob Wrestles at Peniel"},{"type":"prose","content":"The same night he got up and took his two wives, his two maids, and his eleven children, and crossed the ford of the Jabbok. "}],[{"type":"prose","content":"He took them and sent them across the stream, and likewise everything that he had. "}],[{"type":"prose","content":"Jacob was left alone; and a man wrestled with him until daybreak. "}],[{"type":"prose","content":"When the man saw that he did not prevail against Jacob, he struck him on the hip socket; and Jacob’s hip was put out of joint as he wrestled with him. "}],[{"type":"prose","content":"Then he said, “Let me go, for the day is breaking.” But Jacob said, “I will not let you go, unless you bless me.” "}],[{"type":"prose","content":"So he said to him, “What is your name?” And he said, “Jacob.” "}],[{"type":"prose","content":"Then the man said, “You shall no longer be called Jacob, but Israel, for you have striven with God and with humans, and have prevailed.” "}],[{"type":"prose","content":"Then Jacob asked him, “Please tell me your name.” But he said, “Why is it that you ask my name?” And there he blessed him. "}],[{"type":"prose","content":"So Jacob called the place Peniel, saying, “For I have seen God face to face, and yet my life is preserved.” "}],[{"type":"prose","content":"The sun rose upon him as he passed Penuel, limping because of his hip. "}],[{"type":"prose","content":"Therefore to this day the Israelites do not eat the thigh muscle that is on the hip socket, because he struck Jacob on the hip socket at the thigh muscle."}]]