[{"num":32,"verse":"Jacob went on his way as well. As he went, messengers of God met him along the way. "},{"num":2,"verse":"When Jacob saw them, he acknowledged that this was God’s camp, so he named that place Mahanaim, which means “two camps.” "},{"num":3,"verse":"Jacob knew he had to pass by the territory of Edom where his brother Esau lived in the land of Seir. He sent messengers ahead with a message for Esau."},{"num":6,"verse":"The messengers went out to Esau and then returned to Jacob with a troubling report."},{"num":7,"verse":"When Jacob heard their report, he was afraid and extremely distressed. He divided up the people who were with him, the flocks, the herds, and the camels into two camps, "},{"num":8,"verse":"thinking, “If Esau comes to one camp and crushes it, at least then the other might escape.” "},{"num":9,"verse":"Then Jacob prayed."},{"num":13,"verse":"He spent the night there, and from his possessions he prepared a gift for his brother Esau: "},{"num":14,"verse":"200 female goats and 20 male goats, 200 female sheep and 20 rams, "},{"num":15,"verse":"30 milk camels and their colts, 40 cows and 10 bulls, 20 female donkeys and 10 male donkeys. "},{"num":16,"verse":"When he had rounded them up, he made various servants responsible for driving each herd. He gave them instructions."},{"num":19,"verse":"Jacob instructed those responsible for the second and third herds, as well as those who followed behind to help:"},{"num":21,"verse":"So the gifts were driven on ahead, and he stayed the night in the camp, waiting."},{"num":22,"verse":"Later that same night, Jacob got up and took his two wives, his two female servants, and his 11 children; and he crossed the Jabbok River. "},{"num":23,"verse":"He sent them all ahead across the stream along with everything he had; "},{"num":24,"verse":"but Jacob stayed behind, left alone in his distress and doubt. In the twilight of his anguish, an unknown man wrestled with him until daybreak. "},{"num":25,"verse":"When the man saw he was not winning the battle with Jacob, he struck him on the hip socket, and Jacob’s hip was thrown out of joint as he continued to wrestle with him."},{"num":30,"verse":"So Jacob called the place Peniel because as he said, “I have come face to face with God, and yet my life was spared.” "},{"num":31,"verse":"The sun began to rise as Jacob passed by Penuel, limping because of his dislocated hip. "},{"num":32,"verse":"And to this day, the Israelites do not eat the tendon attached near the hip socket of any animal, since that is where God struck Jacob when He dislocated his hip."}]