[{"header":"Curtains and Coverings for the Sacred Tent"},{"num":26,"verse":"Furnish the sacred tent with curtains made from ten pieces of the finest linen. They must be woven with blue, purple, and red wool and embroidered with figures of winged creatures. "},{"num":2,"verse":"Make each piece fourteen yards long and two yards wide "},{"num":3,"verse":"and sew them together into two curtains with five sections each. "},{"num":4,"verse":"Put fifty loops of blue cloth along one of the wider sides of each curtain, then fasten the two curtains at the loops with fifty gold hooks."},{"num":7,"verse":"As the material for the tent, use goat hair to weave eleven sections fifteen yards by two yards each. "},{"num":9,"verse":"Sew five of the sections together to make one panel. Then sew the other six together to make a second panel, and fold the sixth section double over the front of the tent. "},{"num":10,"verse":"Put fifty loops along one of the wider sides of each panel "},{"num":11,"verse":"and fasten the two panels at the loops with fifty bronze hooks. "},{"num":12,"verse":"The panel of goat hair will be a yard longer than the tent itself, so fold half a yard of the material behind the tent and on each side as a protective covering. "},{"num":14,"verse":"Make two more coverings—one with ram skins dyed red and the other with fine leather."},{"header":"The Framework for the Sacred Tent"},{"num":15,"verse":"Build a framework of acacia wood for the walls of the sacred tent. "},{"num":16,"verse":"Each frame is to be fifteen feet high and twenty-seven inches wide "},{"num":17,"verse":"with two wooden pegs near the bottom. "},{"num":18,"verse":"Place two silver stands under each frame with sockets for the pegs, so the frames can be joined together. Twenty of these frames are to be used along the south side and twenty more along the north. "},{"num":22,"verse":"For the back wall along the west side use six frames "},{"num":23,"verse":"with two more at the southwest and northwest corners. Make certain that these corner frames are joined from top to bottom. "},{"num":25,"verse":"Altogether, this back wall will have eight frames with two silver stands under each one."},{"num":26,"verse":"Make five crossbars for each of the wooden frames, "},{"num":28,"verse":"with the center crossbar running the full length of the wall. "},{"num":29,"verse":"Cover the frames and the crossbars with gold and attach gold rings to the frames to run the crossbars through. "},{"num":30,"verse":"Then set up the tent in the way I showed you on the mountain."},{"header":"The Curtain inside the Sacred Tent"},{"num":31,"verse":"Make a curtain to separate the holy place from the most holy place. Use fine linen woven with blue, purple, and red wool, and embroidered with figures of winged creatures. Cover four acacia wood posts with gold and set them each on a silver stand. Then fasten gold hooks to the posts and hang the curtain there."},{"num":34,"verse":"Inside the most holy place, you must put the sacred chest that has the place of mercy on its lid. "},{"num":35,"verse":"Outside the curtain put the table for the sacred bread on the right side and the gold lampstand on the left."},{"num":36,"verse":"For the entrance to the tent, use a piece of fine linen woven with blue, purple, and red wool and embroidered with fancy needlework. "},{"num":37,"verse":"Cover five acacia wood posts with gold and set them each on a bronze stand. Then put gold hooks on the posts and hang the curtain there."}]