[{"header":"The Holy Tent"},{"num":26,"verse":"“Make ten curtains out of finely twisted linen for the holy tent. Make them with blue, purple and bright red yarn. Have a skilled worker sew cherubim into the pattern. "},{"num":2,"verse":"Make all the curtains the same size. They must be 42 feet long and six feet wide. "},{"num":3,"verse":"Join five of the curtains together. Do the same thing with the other five. "},{"num":4,"verse":"Make loops out of blue strips of cloth along the edge of the end curtain in one set. Do the same thing with the end curtain in the other set. "},{"num":5,"verse":"Make 50 loops on the end curtain of the one set. Do the same thing on the end curtain of the other set. Put the loops across from each other. "},{"num":6,"verse":"Make 50 gold hooks. Use them to join the curtains together so that the holy tent is all one piece."},{"num":7,"verse":"“Make a total of 11 curtains out of goat hair to put over the holy tent. "},{"num":8,"verse":"Make all 11 curtains the same size. They must be 45 feet long and six feet wide. "},{"num":9,"verse":"Join five of the curtains together into one set. Do the same thing with the other six. Fold the sixth curtain in half at the front of the tent. "},{"num":10,"verse":"Make 50 loops along the edge of the end curtain in the one set. Do the same thing with the other set. "},{"num":11,"verse":"Then make 50 bronze hooks. Put them in the loops to join the tent together all in one piece. "},{"num":12,"verse":"Let the extra half curtain hang down at the rear of the holy tent. "},{"num":13,"verse":"The tent curtains will be 18 inches longer on both sides. What is left over will hang over the sides of the holy tent and cover it. "},{"num":14,"verse":"Make a covering for the tent. Make it out of ram skins that are dyed red. Put a covering of the other strong leather over that."},{"num":15,"verse":"“Make frames out of acacia wood for the holy tent. "},{"num":16,"verse":"Make each frame 15 feet long and two feet three inches wide. "},{"num":17,"verse":"Add two small wooden pins to each frame. Make the pins stick out so that they are even with each other. Make all the frames for the holy tent in the same way. "},{"num":18,"verse":"Make 20 frames for the south side of the holy tent. "},{"num":19,"verse":"And make 40 silver bases to go under them. Make two bases for each frame. Put one under each pin that sticks out. "},{"num":20,"verse":"For the north side of the holy tent make 20 frames "},{"num":21,"verse":"and 40 silver bases. Put two bases under each frame. "},{"num":22,"verse":"Make six frames for the west end of the holy tent. "},{"num":23,"verse":"Make two frames for the corners at the far end. "},{"num":24,"verse":"At those two corners the frames must be double from top to bottom. They must be fitted into a single ring. Make both of them the same. "},{"num":25,"verse":"There will be eight frames and 16 silver bases. There will be two bases under each frame."},{"num":26,"verse":"“Also make crossbars out of acacia wood. Make five for the frames on one side of the holy tent. "},{"num":27,"verse":"Make five for the frames on the other side. And make five for the frames on the west, at the far end of the holy tent. "},{"num":28,"verse":"The center crossbar must reach from end to end at the middle of the frames. "},{"num":29,"verse":"Cover the frames with gold. Make gold rings to hold the crossbars. Also cover the crossbars with gold."},{"num":30,"verse":"“Set up the holy tent in keeping with the plan I showed you on the mountain."},{"num":31,"verse":"“Make a curtain out of blue, purple and bright red yarn and finely twisted linen. Have a skilled worker sew cherubim into the pattern. "},{"num":32,"verse":"Hang the curtain with gold hooks on four posts that are made out of acacia wood. Cover the posts with gold. Stand them on four silver bases. "},{"num":33,"verse":"Hang the curtain from the hooks. Place the ark of the covenant law behind the curtain. The curtain will separate the Holy Room from the Most Holy Room. "},{"num":34,"verse":"Put the cover on the ark of the covenant law in the Most Holy Room. The cover will be the place where sin is paid for. "},{"num":35,"verse":"Place the table outside the curtain on the north side of the holy tent. And put the lampstand across from it on the south side."},{"num":36,"verse":"“Make a curtain for the entrance to the tent. Make it out of blue, purple and bright red yarn and finely twisted linen. Have a person who sews skillfully make it. "},{"num":37,"verse":"Make gold hooks for the curtain. Make five posts out of acacia wood. Cover them with gold. And make five bronze bases for them."}]