[{"header":"Plans for the Tabernacle"},{"num":26,"verse":"“Make the Tabernacle from ten curtains of finely woven linen. Decorate the curtains with blue, purple, and scarlet thread and with skillfully embroidered cherubim."},{"num":2,"verse":"These ten curtains must all be exactly the same size—42 feet long and 6 feet wide."},{"num":3,"verse":"Join five of these curtains together to make one long curtain, then join the other five into a second long curtain."},{"num":4,"verse":"Put loops of blue yarn along the edge of the last curtain in each set."},{"num":5,"verse":"The fifty loops along the edge of one curtain are to match the fifty loops along the edge of the other curtain."},{"num":6,"verse":"Then make fifty gold clasps and fasten the long curtains together with the clasps. In this way, the Tabernacle will be made of one continuous piece."},{"num":7,"verse":"“Make eleven curtains of goat-hair cloth to serve as a tent covering for the Tabernacle."},{"num":8,"verse":"These eleven curtains must all be exactly the same size—45 feet long and 6 feet wide."},{"num":9,"verse":"Join five of these curtains together to make one long curtain, and join the other six into a second long curtain. Allow 3 feet of material from the second set of curtains to hang over the front of the sacred tent."},{"num":10,"verse":"Make fifty loops for one edge of each large curtain."},{"num":11,"verse":"Then make fifty bronze clasps, and fasten the loops of the long curtains with the clasps. In this way, the tent covering will be made of one continuous piece."},{"num":12,"verse":"The remaining 3 feet of this tent covering will be left to hang over the back of the Tabernacle."},{"num":13,"verse":"Allow 18 inches of remaining material to hang down over each side, so the Tabernacle is completely covered."},{"num":14,"verse":"Complete the tent covering with a protective layer of tanned ram skins and a layer of fine goatskin leather."},{"num":15,"verse":"“For the framework of the Tabernacle, construct frames of acacia wood."},{"num":16,"verse":"Each frame must be 15 feet high and 27 inches wide,"},{"num":17,"verse":"with two pegs under each frame. Make all the frames identical."},{"num":18,"verse":"Make twenty of these frames to support the curtains on the south side of the Tabernacle."},{"num":19,"verse":"Also make forty silver bases—two bases under each frame, with the pegs fitting securely into the bases."},{"num":20,"verse":"For the north side of the Tabernacle, make another twenty frames,"},{"num":21,"verse":"with their forty silver bases, two bases under each frame."},{"num":22,"verse":"Make six frames for the rear—the west side of the Tabernacle—"},{"num":23,"verse":"along with two additional frames to reinforce the rear corners of the Tabernacle."},{"num":24,"verse":"These corner frames will be matched at the bottom and firmly attached at the top with a single ring, forming a single corner unit. Make both of these corner units the same way."},{"num":25,"verse":"So there will be eight frames at the rear of the Tabernacle, set in sixteen silver bases—two bases under each frame."},{"num":26,"verse":"“Make crossbars of acacia wood to link the frames, five crossbars for the north side of the Tabernacle"},{"num":27,"verse":"and five for the south side. Also make five crossbars for the rear of the Tabernacle, which will face west."},{"num":28,"verse":"The middle crossbar, attached halfway up the frames, will run all the way from one end of the Tabernacle to the other."},{"num":29,"verse":"Overlay the frames with gold, and make gold rings to hold the crossbars. Overlay the crossbars with gold as well."},{"num":30,"verse":"“Set up this Tabernacle according to the pattern you were shown on the mountain."},{"num":31,"verse":"“For the inside of the Tabernacle, make a special curtain of finely woven linen. Decorate it with blue, purple, and scarlet thread and with skillfully embroidered cherubim."},{"num":32,"verse":"Hang this curtain on gold hooks attached to four posts of acacia wood. Overlay the posts with gold, and set them in four silver bases."},{"num":33,"verse":"Hang the inner curtain from clasps, and put the Ark of the Covenant in the room behind it. This curtain will separate the Holy Place from the Most Holy Place."},{"num":34,"verse":"“Then put the Ark’s cover—the place of atonement—on top of the Ark of the Covenant inside the Most Holy Place."},{"num":35,"verse":"Place the table outside the inner curtain on the north side of the Tabernacle, and place the lampstand across the room on the south side."},{"num":36,"verse":"“Make another curtain for the entrance to the sacred tent. Make it of finely woven linen and embroider it with exquisite designs, using blue, purple, and scarlet thread."},{"num":37,"verse":"Craft five posts from acacia wood. Overlay them with gold, and hang the curtain from them with gold hooks. Cast five bronze bases for the posts."}]