[{"header":"The East Gate Is Sealed Shut"},{"num":44,"verse":"Then the man took me back to the outer east gate of the holy place, and the gate was shut. "},{"num":2,"verse":"Yahweh said to me, “This gate will stay shut and will not be opened. No one may enter through it because Yahweh Elohim of Israel entered through it. It must be kept shut. "},{"num":3,"verse":"Only the prince may sit there and eat food in the presence of Yahweh. He will enter through the entrance hall of the gateway and leave the same way.”"},{"num":4,"verse":"The man brought me through the north gate in front of the temple. When I looked, I saw Yahweh’s glory fill Yahweh’s temple. I immediately bowed down."},{"header":"The People Serving in the New Temple"},{"num":5,"verse":"Yahweh said to me, “Son of man, pay close attention. Look, and listen to everything I’m going to tell you. Listen to all the rules and regulations for Yahweh’s temple. Pay close attention to everyone who enters the temple and leaves from the holy place. "},{"num":6,"verse":"Tell the rebellious people of Israel, ‘This is what Adonay Yahweh says: I’ve had enough of all the disgusting things that you have done, people of Israel. "},{"num":7,"verse":"You brought godless foreigners into my holy place. You dishonored my temple when you offered fat and blood to me. You rejected my promise so that you could do all your disgusting things. "},{"num":8,"verse":"You didn’t take care of my holy things. You put foreigners in charge of my temple. "},{"num":9,"verse":"So this is what Adonay Yahweh says: Any godless foreigner who lives among the Israelites may not enter my holy place."},{"num":10,"verse":"“‘Some Levites went far away from me when Israel wandered off to follow their idols. They must be punished for their sins. "},{"num":11,"verse":"They could have served in my holy place. They could have guarded the gates of the temple. They could have served in the temple by slaughtering the animals for the burnt offerings and the sacrifices for the people. They could have stood in front of the people and served them. "},{"num":12,"verse":"But they served the people by standing in front of their idols and by making Israel fall into sin. So I raised my hand and swore that they would be punished for their sins, declares Adonay Yahweh. "},{"num":13,"verse":"They must not come near me and serve me as priests. They must not come near any of my holy things or my most holy things. They must suffer disgrace because of the disgusting things that they have done. "},{"num":14,"verse":"I will assign them all of the less important work in the temple."},{"num":15,"verse":"“‘But the priests who are Levites and descendants of Zadok took care of my holy place when the Israelites wandered away from me. They may come near me and serve me, and they may stand in my presence. They may bring fat and blood to me, declares Adonay Yahweh. "},{"num":16,"verse":"They may enter my holy place, come near my table to serve me, and take care of everything I gave them. "},{"num":17,"verse":"When they enter the gateways to the inner courtyard, they must wear linen clothes. They must have no wool on them while they serve in the gateways to the inner courtyard and in the temple. "},{"num":18,"verse":"They must wear linen turbans on their heads and linen undergarments. They must not wear anything that makes them sweat. "},{"num":19,"verse":"When they go out among the people in the outer courtyard, they must take off the clothes that they wore as they served. They must leave their clothes in the side rooms of the holy place and put on other clothes so that they do not transfer the holiness from their clothes to the people."},{"num":20,"verse":"“‘They must not shave their heads or let their hair grow long. They must keep the hair on their heads trimmed. "},{"num":21,"verse":"None of the priests may drink wine when they enter the inner courtyard. "},{"num":22,"verse":"They must not marry widows or women who have been divorced. They may marry only virgins from the nation of Israel or widows of priests. "},{"num":23,"verse":"They must teach my people the difference between what is holy and what is unholy. They must show the people how to tell the difference between what is clean and what is unclean. "},{"num":24,"verse":"In all disputes the priests must act as judges and make decisions based on my laws. They must obey my rules and my regulations at all my festivals. They must observe holy days to worship me."},{"num":25,"verse":"“‘A priest must not make himself unclean by going near a dead body. But a priest may become unclean if the dead person is his father, mother, son, daughter, brother, or unmarried sister. "},{"num":26,"verse":"After a priest is made clean, he must wait seven days. "},{"num":27,"verse":"When he enters the inner courtyard of the holy place to serve in the holy place, he must bring his offering for sin, declares Adonay Yahweh."},{"num":28,"verse":"“‘The priests will have no inheritance. I am their inheritance. Don’t give them any possessions in Israel. The priests belong to me. "},{"num":29,"verse":"They will eat grain offerings, offerings for sin, and guilt offerings. Everything in Israel that is devoted to the Lord will belong to them. "},{"num":30,"verse":"The priests should have the best of all the first ripened fruits. The best of every gift from all your contributions must go to the priests. The best of your dough must go to the priests. This will cause a blessing to rest on your home. "},{"num":31,"verse":"The priests must never eat any bird or animal that has died naturally or was killed by other wild animals."}]