[[],[{"type":"header","content":"The Family of Israel (Jacob)"}],[{"type":"prose","content":"Israel’s (that is, Jacob’s) sons: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."}],[{"type":"prose","content":"Judah had Er, Onan, and Shelah; their mother was Bathshua the Canaanite. Er, Judah’s firstborn, was so bad before  that  killed him. Judah also had Perez and Zerah by his daughter-in-law Tamar—a total of five sons. Perez had Hezron and Hamul; Zerah had Zimri, Ethan, Heman, Calcol, and Darda—five sons. Carmi had Achar, who brought doom on Israel when he violated a holy ban. Ethan’s son was Azariah. And Hezron had Jerahmeel, Ram, and Chelubai."}],[{"type":"prose","content":"Ram had Amminadab and Amminadab had Nahshon, a prominent leader in the Judah family. Nahshon had Salmon and Salmon had Boaz. Boaz had Obed and Obed had Jesse. Jesse’s firstborn was Eliab, followed by Abinadab, Shimea, Nethanel, Raddai, Ozem, and finally David; David was the seventh. Their sisters were Zeruiah and Abigail. Zeruiah gave birth to three sons: Abishai, Joab, and Asahel; Abigail was the mother of Amasa (the father was Jether the Ishmaelite)."},{"type":"header","content":"The Family of Caleb"}],[{"type":"prose","content":"Caleb son of Hezron had children by his wife Azubah and also by Jerioth. Azubah’s sons were Jesher, Shobab, and Ardon. After Azubah died, Caleb married Ephrath, who gave birth to Hur. Hur had Uri and Uri had Bezalel. Some time later Hezron married the daughter of Makir the father of Gilead; he was sixty years old when he married her; she gave birth to Segub. Then Segub had Jair who owned twenty-three cities in the land of Gilead. Geshur and Aram captured the nomadic villages of Jair and Kenath and their satellite settlements—sixty towns. These all belonged to Makir the father of Gilead. After the death of Hezron, Caleb married Ephrathah the wife of his father Hezron; she then gave birth to Ashhur the father of Tekoa."},{"type":"header","content":"The Family of Jerahmeel"}],[{"type":"prose","content":"The sons of Jerahmeel, Hezron’s firstborn: Ram his firstborn, followed by Bunah, Oren, Ozem, and Ahijah. Jerahmeel had another wife whose name was Atarah; she gave birth to Onam."}],[{"type":"prose","content":"The sons of Ram, Jerahmeel’s firstborn: Maaz, Jamin, and Eker."}],[{"type":"prose","content":"The sons of Onam: Shammai and Jada.The sons of Shammai: Nadab and Abishur. Abishur’s wife was Abihail; she gave birth to Ahban and Molid."}],[{"type":"prose","content":"Nadab had Seled and Appaim. Seled died leaving no sons."}],[{"type":"prose","content":"Appaim had Ishi; Ishi had Sheshan; and Sheshan had Ahlai."}],[{"type":"prose","content":"Jada, Shammai’s brother, had Jether and Jonathan. Jether died leaving no sons."}],[{"type":"prose","content":"Jonathan had Peleth and Zaza.This is the family tree of the sons of Jerahmeel.* * *"}],[{"type":"prose","content":"Sheshan had no sons, only daughters. But Sheshan had an Egyptian servant, Jarha. Sheshan married his daughter to Jarha and she gave birth to Attai. Attai had Nathan, Nathan had Zabad, Zabad had Ephlal, Ephlal had Obed, Obed had Jehu, Jehu had Azariah, Azariah had Helez, Helez had Eleasah, Eleasah had Sismai, Sismai had Shallum, Shallum had Jekamiah, and Jekamiah had Elishama.* * *"}],[{"type":"prose","content":"Jerahmeel’s brother Caleb had a son, his firstborn, named Mesha; Mesha had Ziph; Ziph’s son was Mareshah the father of Hebron."}],[{"type":"prose","content":"The sons of Hebron: Korah, Tappuah, Rekem, and Shema. Shema had Raham the father of Jorkeam; Rekem had Shammai."}],[{"type":"prose","content":"Shammai’s son was Maon and Maon was the father of Beth Zur."}],[{"type":"prose","content":"Caleb’s concubine Ephah gave birth to Haran, Moza, and Gazez; Haran had Gazez."}],[{"type":"prose","content":"The sons of Jahdai: Regem, Jotham, Geshan, Pelet, Ephah, and Shaaph."}],[{"type":"prose","content":"Another concubine of Caleb, Maacah, gave birth to Sheber and Tirhanah. She also bore Shaaph the father of Madmannah and Sheva the father of Macbenah and Gibea. Caleb’s daughter was Acsah. These made up the Caleb branch of the family tree."}],[{"type":"prose","content":"The sons of Hur, Ephrathah’s firstborn: Shobal who had Kiriath Jearim, Salma who had Bethlehem, and Hareph father of Beth Gader."}],[{"type":"prose","content":"The family of Shobal, father of Kiriath Jearim: Haroeh, half of the population of Manahath, the families of Kiriath Jearim, the Ithrites, the Puthites, the Shumathites, and the Mishraites. The Zorathites and Eshtaolites also came from this line."}],[{"type":"prose","content":"The sons of Salma: Bethlehem, the Netophathites, Atroth Beth Joab, half of the Manahathites, the Zorites, and the families of Sopherim who lived at Jabez—the Tirathites, the Shimeathites, and the Sucathites. They made up the Kenites who came from Hammath the father of the house of Recab."}]]