[[],[{"type":"header","content":"Israel’s Descendants"},{"type":"prose","content":"These were the sons of Israel: Reuben, Simeon, Levi, and Judah; Issachar and Zebulun;"}],[{"type":"prose","content":"Dan, Joseph, and Benjamin;Naphtali, Gad, and Asher."}],[{"type":"header","content":"Judah’s Descendants"},{"type":"prose","content":"The sons of Judah: Er, Onan, and Shelah. These three were born to him by Bathshua, a Canaanite woman. Er, Judah’s firstborn, displeased the LORD, so the LORD killed him."}],[{"type":"prose","content":"Tamar, Judah’s daughter-in-law, bore to him Perez and Zerah. Judah had five sons in all."}],[{"type":"prose","content":"The sons of Perez: Hezron and Hamul."}],[{"type":"prose","content":"The sons of Zerah: Zimri, Ethan, Heman, Kalkol, Dara—five in all."}],[{"type":"prose","content":"The son of Carmi: Achan, who brought the disaster on Israel when he stole what was devoted to God."}],[{"type":"prose","content":"The son of Ethan: Azariah."}],[{"type":"prose","content":"The sons born to Hezron: Jerahmeel, Ram, and Caleb."}],[{"type":"header","content":"Ram’s Descendants"},{"type":"prose","content":"Ram was the father of Amminadab, and Amminadab was the father of Nahshon, the tribal chief of Judah. "}],[{"type":"prose","content":"Nahshon was the father of Salma, and Salma was the father of Boaz. "}],[{"type":"prose","content":"Boaz was the father of Obed, and Obed was the father of Jesse."}],[{"type":"prose","content":"Jesse was the father of Eliab, his firstborn; Abinadab was born second, Shimea third, "}],[{"type":"prose","content":"Nethanel fourth, Raddai fifth, "}],[{"type":"prose","content":"Ozem sixth, and David seventh. "}],[{"type":"prose","content":"Their sisters were Zeruiah and Abigail. Zeruiah’s three sons were Abshai, Joab, and Asahel. "}],[{"type":"prose","content":"Abigail bore Amasa, whose father was Jether the Ishmaelite."}],[{"type":"header","content":"Caleb’s Descendants"},{"type":"prose","content":"Caleb son of Hezron fathered sons by his wife Azubah (also known as Jerioth). Her sons were Jesher, Shobab, and Ardon. "}],[{"type":"prose","content":"When Azubah died, Caleb married Ephrath, who bore him Hur. "}],[{"type":"prose","content":"Hur was the father of Uri, and Uri was the father of Bezalel."}],[{"type":"prose","content":"Later Hezron slept with the daughter of Makir, the father of Gilead. (He had married her when he was sixty years old.) She bore him Segub. "}],[{"type":"prose","content":"Segub was the father of Jair, who owned twenty-three cities in the land of Gilead. "}],[{"type":"prose","content":"(Geshur and Aram captured the towns of Jair, along with Kenath and its sixty surrounding towns.) All these were descendants of Makir, the father of Gilead."}],[{"type":"prose","content":"After Hezron’s death, Caleb slept with Ephrath, his father Hezron’s widow, and she bore to him Ashhur the father of Tekoa."}],[{"type":"header","content":"Jerahmeel’s Descendants"},{"type":"prose","content":"The sons of Jerahmeel, Hezron’s firstborn, were Ram, the firstborn, Bunah, Oren, Ozem, and Ahijah. "}],[{"type":"prose","content":"Jerahmeel had another wife named Atarah; she was Onam’s mother."}],[{"type":"prose","content":"The sons of Ram, Jerahmeel’s firstborn, were Maaz, Jamin, and Eker."}],[{"type":"prose","content":"The sons of Onam were Shammai and Jada.The sons of Shammai: Nadab and Abishur."}],[{"type":"prose","content":"Abishur’s wife was Abihail, who bore him Ahban and Molid. "}],[{"type":"prose","content":"The sons of Nadab: Seled and Appaim. (Seled died without having sons.)"}],[{"type":"prose","content":"The son of Appaim: Ishi.The son of Ishi: Sheshan.The son of Sheshan: Ahlai."}],[{"type":"prose","content":"The sons of Jada, Shammai’s brother: Jether and Jonathan. (Jether died without having sons.)"}],[{"type":"prose","content":"The sons of Jonathan: Peleth and Zaza.These were the descendants of Jerahmeel."}],[{"type":"prose","content":"Sheshan had no sons, only daughters. Sheshan had an Egyptian servant named Jarha. "}],[{"type":"prose","content":"Sheshan gave his daughter to his servant Jarha as a wife; she bore him Attai."}],[{"type":"prose","content":"Attai was the father of Nathan, and Nathan was the father of Zabad. "}],[{"type":"prose","content":"Zabad was the father of Ephlal, and Ephlal was the father of Obed. "}],[{"type":"prose","content":"Obed was the father of Jehu, and Jehu was the father of Azariah. "}],[{"type":"prose","content":"Azariah was the father of Helez, and Helez was the father of Eleasah. "}],[{"type":"prose","content":"Eleasah was the father of Sismai, and Sismai was the father of Shallum. "}],[{"type":"prose","content":"Shallum was the father of Jekamiah, and Jekamiah was the father of Elishama."}],[{"type":"header","content":"More of Caleb’s Descendants"},{"type":"prose","content":"The sons of Caleb, Jerahmeel’s brother: His firstborn Mesha, the father of Ziph, and his second son Mareshah, the father of Hebron."}],[{"type":"prose","content":"The sons of Hebron: Korah, Tappuah, Rekem, and Shema."}],[{"type":"prose","content":"Shema was the father of Raham, the father of Jorkeam. Rekem was the father of Shammai. "}],[{"type":"prose","content":"Shammai’s son was Maon, who was the father of Beth Zur."}],[{"type":"prose","content":"Caleb’s concubine Ephah bore Haran, Moza, and Gazez. Haran was the father of Gazez."}],[{"type":"prose","content":"The sons of Jahdai: Regem, Jotham, Geshan, Pelet, Ephah, and Shaaph."}],[{"type":"prose","content":"Caleb’s concubine Maacah bore Sheber and Tirhanah. "}],[{"type":"prose","content":"She also bore Shaaph the father of Madmannah and Sheva the father of Machbenah and Gibea. Caleb’s daughter was Achsah."}],[{"type":"prose","content":"These were the descendants of Caleb.The sons of Hur, the firstborn of Ephrath: Shobal, the father of Kiriath Jearim, "}],[{"type":"prose","content":"Salma, the father of Bethlehem, and Hareph, the father of Beth Gader."}],[{"type":"prose","content":"The sons of Shobal, the father of Kiriath Jearim, were Haroeh, half the Manahathites, "}],[{"type":"prose","content":"the clans of Kiriath Jearim—the Ithrites, Puthites, Shumathites, and Mishraites. (The Zorathites and Eshtaolites descended from these groups.)"}],[{"type":"prose","content":"The sons of Salma: Bethlehem, the Netophathites, Atroth Beth Joab, half the Manahathites, the Zorites, "}],[{"type":"prose","content":"and the clans of the scribes who lived in Jabez: the Tirathites, Shimeathites, and Sucathites. These are the Kenites who descended from Hammath, the father of Beth Rechab."}]]