[{"num":2,"verse":"These [are] sons of Israel: Reuben, Simeon, Levi, and Judah, Issachar, and Zebulun,"},{"num":2,"verse":"Dan, Joseph, and Benjamin, Naphtali, Gad, and Asher."},{"num":3,"verse":"Sons of Judah: Er, and Onan, and Shelah, three have been born to him of a daughter of Shua the Canaanitess. And Er, first-born of Judah, is evil in the eyes of Jehovah, and He putteth him to death."},{"num":4,"verse":"And Tamar his daughter-in-law hath borne to him Pharez and Zerah. All the sons of Judah [are] five."},{"num":5,"verse":"Sons of Pharez: Hezron, and Hamul."},{"num":6,"verse":"And sons of Zerah: Zimri, and Ethan, and Heman, and Calcol, and Dara; all of them five."},{"num":7,"verse":"And sons of Carmi: Achar, troubler of Israel, who trespassed in the devoted thing."},{"num":8,"verse":"And sons of Ethan: Azariah."},{"num":9,"verse":"And sons of Hezron who were born to him; Jerahmeel, and Ram, and Chelubai."},{"num":10,"verse":"And Ram begat Amminadab, and Amminadab begat Nahshon, prince of the sons of Judah;"},{"num":11,"verse":"and Nahshon begat Salma, and Salma begat Boaz,"},{"num":12,"verse":"and Boaz begat Obed, and Obed begat Jesse;"},{"num":13,"verse":"and Jesse begat his first-born Eliab, and Abinadab the second, and Shimea the third,"},{"num":14,"verse":"Nethaneel the fourth, Raddai the fifth,"},{"num":15,"verse":"Ozem the sixth, David the seventh,"},{"num":16,"verse":"and their sisters Zeruiah and Abigail. And sons of Zeruiah: Abishai, and Joab, and Asah-El -- three."},{"num":17,"verse":"And Abigail hath borne Amasa, and the father of Amasa [is] Jether the Ishmeelite."},{"num":18,"verse":"And Caleb son of Hezron hath begotten Azubah, Isshah, and Jerioth; and these [are] her sons: Jesher, and Shobab, and Ardon."},{"num":19,"verse":"And Azubah dieth, and Caleb taketh to him Ephrath, and she beareth to him Hur."},{"num":20,"verse":"And Hur begat Uri, and Uri begat Bezaleel."},{"num":21,"verse":"And afterwards hath Hezron gone in unto a daughter of Machir father of Gilead, and he hath taken her, and he [is] a son of sixty years, and she beareth to him Segub."},{"num":22,"verse":"And Segub begat Jair, and he hath twenty and three cities in the land of Gilead,"},{"num":23,"verse":"and he taketh Geshur and Aram, the small villages of Jair, from them, with Kenath and its small towns, sixty cities -- all these [belonged to] the sons of Machir father of Gilead."},{"num":24,"verse":"And after the death of Hezron in Caleb-Ephratah, then the wife of Hezron, Abijah, even beareth to him Asshur, father of Tekoa."},{"num":25,"verse":"And sons of Jerahmeel, first-born of Hezron, are: the first-born Ram, and Bunah, and Oren, and Ozem, Ahijah."},{"num":26,"verse":"And Jerahmeel hath another wife, and her name [is] Atarah, she [is] mother of Onam."},{"num":27,"verse":"And sons of Ram, first-born of Jerahmeel, are Maaz, and Jamin, and Eker."},{"num":28,"verse":"And sons of Onam are Shammai and Jada. And sons of Shammai: Nadab and Abishur."},{"num":29,"verse":"And the name of the wife of Abishur [is] Abihail, and she beareth to him Ahban and Molid."},{"num":30,"verse":"And sons of Nadab: Seled, and Appaim; and Seled dieth without sons."},{"num":31,"verse":"And sons of Appaim: Ishi. And sons of Ishi: Sheshan. And sons of Sheshan: Ahlai."},{"num":32,"verse":"And sons of Jada, brother of Shammai: Jether, and Jonathan: and Jether dieth without sons."},{"num":33,"verse":"And sons of Jonathan: Peleth, and Zaza. These were sons of Jerahmeel."},{"num":34,"verse":"And Sheshan had no sons, but daughters, and Sheshan hath a servant, an Egyptian, and his name [is] Jarha,"},{"num":35,"verse":"and Sheshan giveth his daughter to Jarha his servant for a wife, and she beareth to him Attai;"},{"num":36,"verse":"and Attai begat Nathan, and Nathan begat Zabad,"},{"num":37,"verse":"and Zabad begat Ephlal, and Ephlal begat Obed,"},{"num":38,"verse":"and Obed begat Jehu,"},{"num":39,"verse":"and Jehu begat Azariah, and Azariah begat Helez, and Helez begat Eleasah,"},{"num":40,"verse":"and Eleasah begat Sismai, and Sismai begat Shallum,"},{"num":41,"verse":"and Shallum begat Jekamiah, and Jekamiah begat Elishama."},{"num":42,"verse":"And sons of Caleb brother of Jerahmeel: Mesha his first-born, he [is] father of Ziph; and sons of Mareshah: Abi-Hebron."},{"num":43,"verse":"And sons of Hebron: Korah, and Tappuah, and Rekem, and Shema."},{"num":44,"verse":"And Shema begat Raham father of Jorkoam, and Rekem begat Shammai."},{"num":45,"verse":"And a son of Shammai [is] Maon, and Maon [is] father of Beth-Zur."},{"num":46,"verse":"And Ephah concubine of Caleb bare Haran, and Moza, and Gazez; and Haran begat Gazez."},{"num":47,"verse":"And sons of Jahdai: Regem, and Jotham, and Geshem, and Pelet, and Ephah, and Shaaph."},{"num":48,"verse":"The concubine of Caleb, Maachah, bare Sheber and Tirhanah;"},{"num":49,"verse":"and she beareth Shaaph father of Madmannah, Sheva father of Machbenah, and father of Gibea; and a daughter of Caleb [is] Achsa."},{"num":50,"verse":"These were sons of Caleb son of Hur, first-born of Ephrathah: Shobal father of Kirjath-Jearim,"},{"num":51,"verse":"Salma father of Beth-Lehem, Hareph father of Beth-Gader."},{"num":52,"verse":"And there are sons to Shobal father of Kirjath-Jearim: Haroeh, half of the Menuhothite;"},{"num":53,"verse":"and the families of Kirjath-Jearim: the Ithrite, and the Puhite, and the Shumathite, and the Mishraite: from these went out the Zareathite, and the Eshtaulite."},{"num":54,"verse":"Sons of Salma: Beth-Lehem, and the Netophathite, Atroth, Beth-Joab, and half of the Menuhothite, the Zorite;"},{"num":55,"verse":"and the families of the scribes the inhabitants of Jabez: Tirathites, Shimeathites, Suchathites. They [are] the Kenites, those coming of Hammath father of the house of Rechab."}]