[[],[],[{"type":"header","content":"The Spirit Carried Me in Visions"},{"type":"prose","content":"In the sixth year, in the sixth month and the fifth day, while I was sitting at home meeting with the leaders of Judah, it happened that the hand of my Master, , gripped me. When I looked, I was astonished. What I saw looked like a man—from the waist down like fire and from the waist up like highly burnished bronze. He reached out what looked like a hand and grabbed me by the hair. The Spirit swept me high in the air and carried me in visions of God to Jerusalem, to the entrance of the north gate of the Temple’s inside court where the image of the sex goddess that makes God so angry had been set up. Right before me was the Glory of the God of Israel, exactly like the vision I had seen out on the plain."}],[{"type":"prose","content":"He said to me, “Son of man, look north.” I looked north and saw it: Just north of the entrance loomed the altar of the sex goddess, Asherah, that makes God so angry."}],[{"type":"prose","content":"Then he said, “Son of man, do you see what they’re doing? Outrageous obscenities! And doing them right here! It’s enough to drive me right out of my own Temple. But you’re going to see worse yet.”* * *"}],[{"type":"prose","content":"He brought me to the door of the Temple court. I looked and saw a gaping hole in the wall."}],[{"type":"prose","content":"He said, “Son of man, dig through the wall.”I dug through the wall and came upon a door."}],[{"type":"prose","content":"He said, “Now walk through the door and take a look at the obscenities they’re engaging in.”"}],[{"type":"prose","content":"I entered and looked. I couldn’t believe my eyes: Painted all over the walls were pictures of reptiles and animals and monsters—the whole pantheon of Egyptian gods and goddesses—being worshiped by Israel. In the middle of the room were seventy of the leaders of Israel, with Jaazaniah son of Shaphan standing in the middle. Each held his censer with the incense rising in a fragrant cloud."}],[{"type":"prose","content":"He said, “Son of man, do you see what the elders are doing here in the dark, each one before his favorite god-picture? They tell themselves, ‘ doesn’t see us.  has forsaken the country.’”"}],[{"type":"prose","content":"Then he said, “You’re going to see worse yet.”* * *"}],[{"type":"prose","content":"He took me to the entrance at the north gate of the Temple of . I saw women sitting there, weeping for Tammuz, the Babylonian fertility god. He said, “Have you gotten an eyeful, son of man? You’re going to see worse yet.”* * *"}],[{"type":"prose","content":"Finally, he took me to the inside court of the Temple of . There between the porch and the altar were about twenty-five men. Their backs were to ’s Temple. They were facing east, bowing in worship to the sun."}],[{"type":"prose","content":"He said, “Have you seen enough, son of man? Isn’t it bad enough that Judah engages in these outrageous obscenities? They fill the country with violence and now provoke me even further with their obscene gestures. That’s it. They have an angry God on their hands! From now on, no mercy. They can shout all they want, but I’m not listening.”"}]]