[[],[{"type":"header","content":"Vision of Abominations in Jerusalem"},{"type":"prose","content":"Now it came about in the sixth year, on the fifth  of the sixth month, as I was sitting in my house with the elders of Judah sitting before me, that the hand of the Lord  fell upon me there."}],[{"type":"prose","content":"Then I looked, and behold, something like the appearance of a man; from His waist and downward  the appearance of fire, and from His waist and upward like the appearance of a glow, like gleaming metal."}],[{"type":"prose","content":"And He extended the form of a hand and took me by the hair of my head; and the Spirit lifted me up between earth and heaven and brought me in the visions of God to Jerusalem, to the entrance of the north gate of the inner , where the seat of the idol of jealousy, which provokes to jealousy, ."}],[{"type":"prose","content":"And behold, the glory of the God of Israel  there, like the appearance which I saw in the plain."}],[{"type":"prose","content":"Then He said to me, “Son of man, raise your eyes now toward the north.” So I raised my eyes toward the north, and behold, to the north of the altar gate  this idol of jealousy at the entrance."}],[{"type":"prose","content":"And He said to me, “Son of man, do you see what they are doing, the great abominations which the house of Israel are committing here, so that I would be far from My sanctuary? But yet you will see still greater abominations!”"}],[{"type":"prose","content":"Then He brought me to the entrance of the courtyard, and when I looked, behold, a hole in the wall."}],[{"type":"prose","content":"And He said to me, “Son of man, now dig through the wall.” So I dug through the wall, and behold, an entrance."}],[{"type":"prose","content":"Then He said to me, “Go in and see the wicked abominations that they are committing here.”"}],[{"type":"prose","content":"So I entered and looked, and behold, every form of crawling things and animals  detestable things, with all the idols of the house of Israel, were carved on the wall all around."}],[{"type":"prose","content":"And standing in front of them were seventy elders of the house of Israel, with Jaazaniah the son of Shaphan standing among them, each man  his censer in his hand; and the fragrance of the cloud of incense was rising."}],[{"type":"prose","content":"Then He said to me, “Do you see, son of man, what the elders of the house of Israel are doing in the dark, each man in the rooms of his carved images? For they say, ‘The  does not see us; the  has abandoned the land.’”"}],[{"type":"prose","content":"And He said to me, “Yet you will see still greater abominations which they are committing!”"}],[{"type":"prose","content":"Then He brought me to the entrance of the gate of the ’ house which  toward the north; and behold, women were sitting there weeping for Tammuz."}],[{"type":"prose","content":"And He said to me, “Do you see , son of man? Yet you will see still greater abominations than these!”"}],[{"type":"prose","content":"Then He brought me into the inner courtyard of the ’ house. And behold, at the entrance to the temple of the , between the porch and the altar,  about twenty-five men  their backs to the temple of the  while their faces were toward the east; and they were prostrating themselves eastward toward the sun."}],[{"type":"prose","content":"And He said to me, “Do you see , son of man? Is it a trivial thing for the house of Judah to commit the abominations which they have committed here, that they have filled the land with violence and provoked Me to anger repeatedly? Yet behold, they are putting the twig to their nose!"}],[{"type":"prose","content":"Therefore, I indeed will deal in wrath. My eye will have no pity nor will I spare; and though they cry out in My ears with a loud voice, yet I will not listen to them.”"}]]