[{"header":"Chapter 24[a]"},{"num":1,"verse":"The Good and Bad Figs. The Lord showed me two baskets of figs placed in front of the temple of the Lord. This occurred after King Nebuchadnezzar of Babylon had exiled from Jerusalem Jeconiah, the son of Jehoiakim, the king of Judah, and the princes of Judah, the artisans, and the skilled workers, and brought them to Babylon."},{"num":2,"verse":"One basket contained excellent figs that tend to ripen early; the other basket had figs of an extremely poor quality, so bad that they could not be eaten."},{"num":3,"verse":"The Lord said to me, “What do you see, Jeremiah?” “Figs,” I answered. “The good figs are superb, but the poor ones are so bad that they are not fit to eat.”"},{"num":4,"verse":"Then the word of the Lord came to me:"},{"num":5,"verse":"Thus says the Lord, the God of Israel: Just as these figs are good, so I will regard as good the exiles from Judah whom I have sent away from this place to the land of the Chaldeans."},{"num":6,"verse":"I will watch over them carefully to ensure their welfare, and I will bring them back to this land. I will build them up and not tear them down. I will plant them and not uproot them."},{"num":7,"verse":"I will give them a heart that will enable them to know that I am the Lord. They will be my people and I will be their God, for they will return to me with their whole heart."},{"num":8,"verse":"As for the bad figs that are so dreadful that they cannot be eaten, thus says the Lord: In the same way I will treat King Zedekiah of Judah and his princes, the remnant of Jerusalem remaining in this land, and those who live in the land of Egypt."},{"num":9,"verse":"I will make them an object of horror to all the kingdoms of the earth, a reproach and a byword, a taunt and a curse, in all the places where I will drive them."},{"num":10,"verse":"And I will send against them the sword, famine, and pestilence, until they have completely vanished from the land that I gave to them and their ancestors."}]