[{"num":24,"verse":"Hashem showed me, and, hinei, two baskets of figs were set in front of the Heikhal Hashem; after that Nevuchadretzar Melech Bavel had carried away into the Golus Melech Yehudah Yechanyah ben Y’hoyakim, and the sarim (princes) of Yehudah, with the craftsmen and artisans, from Yerushalayim, and had brought them to Babylon."},{"num":2,"verse":"One basket had figs tovot me’od, even like the figs that are early ripening; and the other basket had figs ra’ot me’od, which could not be eaten, they were so bad."},{"num":3,"verse":"Then said Hashem unto me, What seest thou, Yirmeyah? And I answered, Figs; the good figs, very good; and the bad, very bad, that cannot be eaten they are so bad."},{"num":4,"verse":"Again the Devar Hashem came unto me, saying,"},{"num":5,"verse":"Thus saith Hashem Elohei Yisroel; Like these good figs, so will I acknowledge them that of Yehudah are carried away unto the Golus, whom I have sent out of this place into the Eretz Kasdim (Chaldeans) for their good."},{"num":6,"verse":"For I will set mine eyes over them for tovah, and I will bring them again to ha’aretz hazot; and I will build them up, and not tear them down; and I will plant them, and not uproot them."},{"num":7,"verse":"And I will give them a lev to have da’as of me, that I am Hashem; and they shall be My people, and I will be their Elohim; for they shall return unto Me with all their lev."},{"num":8,"verse":"And as the bad figs, which cannot be eaten, they are so bad, surely thus saith Hashem, So will I give Tzidkiyah Melech Yehudah, and his sarim (princes), and the she’erit Yerushalayim, that remain in ha’aretz hazot, and them that dwell in Eretz Mitzrayim;"},{"num":9,"verse":"And I will deliver them for abhorrence, for an offense to kol mamlechot ha’aretz to be a reproach and a byword, a taunt and a kelalah (curse) in all places where I shall drive them."},{"num":10,"verse":"And I will send the cherev, the ra’av (famine), and the dever (pestilence), among them, until they are consumed from off ha’aretz that I gave unto them and to their avot."}]