[{"header":"Reaffirm Your Love"},{"num":2,"verse":"But I made up my mind not to grieve you with another painful visit. "},{"num":2,"verse":"For if I cause you grief [by a well-deserved rebuke], who then provides me enjoyment but the very one whom I have made sad? "},{"num":3,"verse":"And I wrote this same thing to you, so that when I came, I would not be filled with sorrow by those who ought to make me glad, for I trusted in you and felt confident that my joy would be shared by all of you. "},{"num":4,"verse":"For I wrote to you out of great distress and with an anguished heart, and with many tears, not to cause you sorrow but to make you realize the [overflowing] love which I have especially for you."},{"num":5,"verse":"But if someone has caused [all this] sorrow, he has caused it not to me, but in some degree—not to put it too severely—[he has distressed and grieved] all of you. "},{"num":6,"verse":"For such a one this punishment by the majority is sufficient, "},{"num":7,"verse":"so instead [of further rebuke, now] you should rather [graciously] forgive and comfort and encourage him, to keep him from being overwhelmed by excessive sorrow. "},{"num":8,"verse":"Therefore I urge you to reinstate him in your affections and reaffirm your love for him. "},{"num":9,"verse":"For this was my purpose in writing, to see if you would stand the test, whether you are obedient and committed to following my instruction in all things. "},{"num":10,"verse":"If you forgive anyone anything, I too forgive [that one]; and what I have forgiven, if I have forgiven anything, has been for your sake in the presence of [and with the approval of] Christ, "},{"num":11,"verse":"to keep Satan from taking advantage of us; for we are not ignorant of his schemes."},{"num":12,"verse":"Now when I arrived at Troas to preach the good news of Christ, even though a door [of opportunity] opened for me in the Lord, "},{"num":13,"verse":"my spirit could not rest because I did not find my brother Titus there; so saying goodbye to them, I left for Macedonia."},{"num":14,"verse":"But thanks be to God, who always leads us in triumph in Christ, and through us spreads and makes evident everywhere the sweet fragrance of the knowledge of Him. "},{"num":15,"verse":"For we are the sweet fragrance of Christ [which ascends] to God, [discernible both] among those who are being saved and among those who are perishing; "},{"num":16,"verse":"to the latter one an aroma from death to death [a fatal, offensive odor], but to the other an aroma from life to life [a vital fragrance, living and fresh]. And who is adequate and sufficiently qualified for these things? "},{"num":17,"verse":"For we are not like many, [acting like merchants] peddling God’s word [shortchanging and adulterating God’s message]; but from pure [uncompromised] motives, as [commissioned and sent] from God, we speak [His message] in Christ in the sight of God."}]