[{"num":2,"verse":"So I made up my mind not to come to you again to make you sad. "},{"num":2,"verse":"For if I were to make you sad, who would be left to cheer me up? Only the very persons I had made sad. "},{"num":3,"verse":"That is why I wrote that letter to you—I did not want to come to you and be made sad by the very people who should make me glad. For I am convinced that when I am happy, then all of you are happy too. "},{"num":4,"verse":"I wrote you with a greatly troubled and distressed heart and with many tears; my purpose was not to make you sad, but to make you realize how much I love you all."},{"header":"Forgiveness for the Offender"},{"num":5,"verse":"Now, if anyone has made somebody sad, he has not done it to me but to all of you—in part, at least. (I say this because I do not want to be too hard on him.) "},{"num":6,"verse":"It is enough that this person has been punished in this way by most of you. "},{"num":7,"verse":"Now, however, you should forgive him and encourage him, in order to keep him from becoming so sad as to give up completely. "},{"num":8,"verse":"And so I beg you to let him know that you really do love him. "},{"num":9,"verse":"I wrote you that letter because I wanted to find out how well you had stood the test and whether you are always ready to obey my instructions. "},{"num":10,"verse":"When you forgive people for what they have done, I forgive them too. For when I forgive—if, indeed, I need to forgive anything—I do it in Christ's presence because of you, "},{"num":11,"verse":"in order to keep Satan from getting the upper hand over us; for we know what his plans are."},{"header":"Paul's Anxiety in Troas"},{"num":12,"verse":"When I arrived in Troas to preach the Good News about Christ, I found that the Lord had opened the way for the work there. "},{"num":13,"verse":"But I was deeply worried, because I could not find our brother Titus. So I said good-bye to the people there and went on to Macedonia."},{"header":"Victory through Christ"},{"num":14,"verse":"But thanks be to God! For in union with Christ we are always led by God as prisoners in Christ's victory procession. God uses us to make the knowledge about Christ spread everywhere like a sweet fragrance. "},{"num":15,"verse":"For we are like a sweet-smelling incense offered by Christ to God, which spreads among those who are being saved and those who are being lost. "},{"num":16,"verse":"For those who are being lost, it is a deadly stench that kills; but for those who are being saved, it is a fragrance that brings life. Who, then, is capable for such a task? "},{"num":17,"verse":"We are not like so many others, who handle God's message as if it were cheap merchandise; but because God has sent us, we speak with sincerity in his presence, as servants of Christ."}]