[{"header":"Chapter 2"},{"num":1,"verse":"Therefore, I made up my mind not to have you endure another painful visit."},{"num":2,"verse":"For if I cause you pain, then who would be there to cheer me up aside from you whom I offended?"},{"num":3,"verse":"And I wrote as I did, so that when I came I would not suffer distress from those who should have made me rejoice. I know all of you well enough to be certain that we both share the same joy."},{"num":4,"verse":"It was with great distress and anguish of heart and many tears that I wrote to you, not to grieve you but to let you know how abundant is the love I have for you."},{"num":5,"verse":"Forgiveness for the Offender. If anyone has caused distress, he has done so not only to me but to some extent—not to exaggerate—to all of you."},{"num":6,"verse":"The punishment that was imposed by the majority was appropriate."},{"num":7,"verse":"But now you should forgive and encourage him so that he may not be overwhelmed by the burden of his distress."},{"num":8,"verse":"Therefore, I urge you to reassure him of your love."},{"num":9,"verse":"I wrote to you to test your obedience in all matters."},{"num":10,"verse":"Anyone whom you forgive I forgive as well. Whatever I have forgiven, if I have forgiven anything, I have done for your sake in the presence of Christ,"},{"num":11,"verse":"so that we may avoid being outwitted by Satan, for we are not unaware of his schemes."},{"num":12,"verse":"Paul’s Anguish. When I came to Troas to proclaim the gospel of Christ, and a door of opportunity was opened for me in the Lord,"},{"num":13,"verse":"my mind knew no relief because I could not find my brother Titus in that place. And so I said farewell to them and moved on to Macedonia."},{"header":"Greatness and Weakness of the Apostles[b]"},{"num":14,"verse":"Ambassadors of God. But thanks be to God, for he brings us to victory in Christ and through us he manifests the fragrance of the knowledge of him throughout the world."},{"num":15,"verse":"We are indeed the aroma of Christ to God both among those who are being saved and among those who are perishing:"},{"num":16,"verse":"to the latter, the odor of death that leads to death; to the former, a fragrance of life leading to life."}]