[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "XVI.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "THE SEVEN VIALS.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) And I heard . . .—A great voice is heard out of the temple; it bids the angels pour out their vials “into the earth;” later on (Revelation 16:17) the voice is heard saying, “It is done.” The voice is then said to come from the throne; it seems likely that the voice of the first verse is the same—the divine voice from the throne itself.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And I heard . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—A great voice is heard out of the temple; it bids the angels pour out their vials “into the earth;” later on (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the voice is heard saying, “It is done.” The voice is then said to come from the throne; it seems likely that the voice of the first verse is the same—the divine voice from the throne itself.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 16:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I heard a great voice out of the temple ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— All things being prepared, the angels having received their instructions from the oracle, and the vials being filled with the wrath of God, by one of the four living creatures, (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 15:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) I heard the word of command given to the seven angels to pour out their vials in their order, the inhabitants of the earth being ripe for those judgments which the justice of God had appointed for their punishment. The epistles to the seven churches are divided into three and four; the seven seals, and so the trumpets and vials, into four and three. The trumpets gradually, and in a long tract of time, overthrow the kingdoms of the world; the vials destroy chiefly the beast and his followers, and that with a more swift and impetuous force. The four former affect the earth, the sea, the rivers, the sun: the rest fall elsewhere, and are much more terrible.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:1-7 We are to pray that the will of God may be done on earth as it is done in heaven. Here is a succession of terrible judgments of Providence; and there seems to be an allusion to several of the plagues of Egypt. The sins were alike, and so were the punishments. The vials refer to the seven trumpets, which represented the rise of antichrist; and the fall of the enemies of the church shall bear some resemblance to their rise. All things throughout their earth, their air, their sea, their rivers, their cities, all are condemned to ruin, all accursed for the wickedness of that people. No wonder that angels, who witness or execute the Divine vengeance on the obstinate haters of God, of Christ, and of holiness, praise his justice and truth; and adore his awful judgments, when he brings upon cruel persecutors the tortures they made his saints and prophets suffer.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I heard a great voice out of the temple - A loud voice out of the temple as seen in heaven (notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that came, therefore, from the very presence of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Saying to the seven angels - That had the seven vials of wrath. See the notes on Revelation 15:1, Revelation 15:7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Saying to the seven angels - That had the seven vials of wrath. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 15:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 15:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Go your ways - Your respective ways, to the fulfillment of the task assigned to each.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And pour out the vials of the wrath of God - Empty those vials; cause to come upon the earth the plagues indicated by their contents. The order in which this was to be done is not intimated. It seems to be supposed that that would be understood by each.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Upon the earth - The particular part of the earth is not here specified, but it should not be inferred that it was to be upon the earth in general, or that there were any calamities, in consequence of this pouring out of the vials of wrath, to spread over the whole world. The subsequent statements show what parts of the earth were particularly to be affected. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Upon the earth - The particular part of the earth is not here specified, but it should not be inferred that it was to be upon the earth in general, or that there were any calamities, in consequence of this pouring out of the vials of wrath, to spread over the whole world. The subsequent statements show what parts of the earth were particularly to be affected. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 16",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Re 16:1-21. The Seven Vials and the Consequent Plagues.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The trumpets shook the world kingdoms in a longer process; the vials destroy with a swift and sudden overthrow the kingdom of \"the beast\" in particular who had invested himself with the world kingdom. The Hebrews thought the Egyptian plagues to have been inflicted with but an interval of a month between them severally [Bengel, referring to Seder Olam]. As Moses took ashes from an earthly common furnace, so angels, as priestly ministers in the heavenly temple, take holy fire in sacred vials or bowls, from the heavenly altar to pour down (compare Re 8:5). The same heavenly altar which would have kindled the sweet incense of prayer bringing down blessing upon earth, by man's sin kindles the fiery descending curse. Just as the river Nile, which ordinarily is the source of Egypt's fertility, became blood and a curse through Egypt's sin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. a great voice—namely, God's. These seven vials (the detailed expansion of the vintage, Re 14:18-20) being called \"the last,\" must belong to the period just when the term of the beast's power has expired (whence reference is made in them all to the worshippers of the beast as the objects of the judgments), close to the end or coming of the Son of man. The first four are distinguished from the last three, just as in the case of the seven seals and the seven trumpets. The first four are more general, affecting the earth, the sea, springs, and the sun, not merely a portion of these natural bodies, as in the case of the trumpets, but the whole of them; the last three are more particular, affecting the throne of the beast, the Euphrates, and the grand consummation. Some of these particular judgments are set forth in detail in the seventeenth through twentieth chapters.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "out of the temple—B and Syriac omit. But A, C, Vulgate, and Andreas support the words.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the vials—so Syriac and Coptic. But A, B, C, Vulgate, and Andreas read, \"the seven vials.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "upon—Greek, \"into.\"Revelation 16:1 The seven angels are commanded to pour out theirvials on the earth.Revelation 16:2-14 Great plagues follow thereupon.Revelation 16:15-21 Christ cometh suddenly as a thief: blessed are theythat watch.Chapter Summary God having showed unto his servant John in the vision of the first six seals, the fate of the church under the pagan emperors of Rome, Revelation 5:1-6:17, and its fate under antichrist, in the vision of the six first trumpets, under the seventh seal, Revelation 8:1-9:21, and diverted him by the vision of the little book opened, Revelation 10:1-11, and by the contents of it, Revelation 12:1-14:20, and instructed him concerning the affairs of the church during all the time of the reign of the dragon, and antichrist, who was the image of the dragon, comes now to instruct him particularly how and by what means he would ruin antichrist, and restore peace to his church. And I heard a great voice out of the temple;  either out of the church triumphant, Christ, the Head of it, commanding the executioners of his justice to go and do their office; or out of the church militant, by their prayers soliciting God to execute vengeance upon the beast. All the beast’s territories, or the several parts of his kingdom, are expressed in this chapter, under the notions of the earth, the sea, the rivers and fountains, the sun,  and the seat of the beast. The first command to the executioners of God’s justice, is, to pour out his wrath on the earth. By the earth;  Pareus understands some parts of the earth; others, the common people; others, the Roman empire; but others, considering the earth as the firmest part of the universe, say, that by the earth is meant the popish clergy, the basis of the papacy; and I am very much inclined to judge that the most probable sense of it, not only because there is little of heaven in them, and their whole frame and model is the product of earthly policy, but because experience hath told us that the pope here received his first wound, in the diminution of their power and authority, and a contempt of them. God hath used many instruments to pour out this vial, even so many (whether princes or ministers) as he hath made use of to root out monasteries and abbeys, and to expose mass priests to scorn and contempt. Mr. Mede seemeth to be of another mind, thinking, that by earth is meant the commonalty of the people, whose defection from the pope was his first plague: but that which is to be understood by the earth,  being the affected part of antichrist, I cannot agree with that learned man; for though the beast suffered by the defection of the commonalty, yet I cannot see how those that made the defection suffered at all by it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "upon—Greek, \"into.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 16:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The seven angels are commanded to pour out their",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "vials on the earth.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 16:2-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Great plagues follow thereupon.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 16:15-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Christ cometh suddenly as a thief: blessed are they",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "that watch.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Chapter Summary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "God having showed unto his servant John in the vision of the first six seals, the fate of the church under the pagan emperors of Rome, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 5:1-6:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and its fate under antichrist, in the vision of the six first trumpets, under the seventh seal, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 8:1-9:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and diverted him by the vision of the little book opened, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 10:1-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and by the contents of it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Revelation 12:1-14:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and instructed him concerning the affairs of the church during all the time of the reign of the dragon, and antichrist, who was the image of the dragon, comes now to instruct him particularly how and by what means he would ruin antichrist, and restore peace to his church. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And I heard a great voice out of the temple; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " either out of the church triumphant, Christ, the Head of it, commanding the executioners of his justice to go and do their office; or out of the church militant, by their prayers soliciting God to execute vengeance upon the beast. All the beast’s territories, or the several parts of his kingdom, are expressed in this chapter, under the notions of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the earth, the sea, the rivers and fountains, the sun, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the seat of the beast.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The first command to the executioners of God’s justice, is, to pour out his wrath on ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the earth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " By ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the earth; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Pareus understands some parts of the earth; others, the common people; others, the Roman empire; but others, considering the earth as the firmest part of the universe, say, that by ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the earth",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is meant the popish clergy, the basis of the papacy; and I am very much inclined to judge that the most probable sense of it, not only because there is little of heaven in them, and their whole frame and model is the product of earthly policy, but because experience hath told us that the pope here received his first wound, in the diminution of their power and authority, and a contempt of them. God hath used many instruments to pour out this vial, even so many (whether princes or ministers) as he hath made use of to root out monasteries and abbeys, and to expose mass priests to scorn and contempt. Mr. Mede seemeth to be of another mind, thinking, that by ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "earth",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is meant the commonalty of the people, whose defection from the pope was his first plague: but that which is to be understood by ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the earth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " being the affected part of antichrist, I cannot agree with that learned man; for though the beast suffered by the defection of the commonalty, yet I cannot see how those that made the defection suffered at all by it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I heard a great voice out of the temple,.... The church, which in the preceding chapter is said to be opened; this was either the voice of God, whose temple the church is, and where he dwells, and who, has power over these plagues, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and who, when he is about to bring judgments on the earth, is said to roar out of Zion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or of Christ, who is always in the midst of his church and people, and whose voice is as the voice of many waters; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or it may be of one of the four living creatures, the ministers of the word, in and by whom Christ often speaks; and the rather, since one of these gave the seven angels the golden vials of the wrath of God, they are now bid to pour out. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Saying to the seven angels, go your ways and pour out the vials of the wrath of God upon the earth; for though these angels had the seven last plagues to inflict, and the seven vials of God's wrath to pour out, and were in a readiness to do it, yet they did not move without an order, which is here given them; and they are bid to go their ways, from the temple, the church, where they were, and of which they were members, to the several parts of the antichristian empire; and there pour out all the wrath and vengeance of God upon his enemies, and theirs, and leave nothing behind, but give them the dregs of every cup of his fury: the earth here is to be taken in a larger sense than in the following verse, and includes the land and sea, the fountains and rivers, and even the ambient air, and also the sun in the firmament, as the pouring out of these vials upon them show; and designs the whole apostate church, consisting of earthly men, all the inhabitants of the earth, that worship the beast. The Alexandrian copy, the Vulgate Latin, Syriac, and Arabic versions, and the Complutensian edition, read, \"the seven vials of the wrath of God\"; these seven vials are not contemporary, much less the same with the seven trumpets; there is indeed a likeness between them in some things, especially in the first four; for as the first four trumpets affect the earth, the sea, the fountains, and rivers of water, and the sun, so the first four vials are poured out on the same, and that in the same order; first on the earth, and then on the sea, &c. and which will give some light, and be a direction to observe the several parts of the antichristian empire, which will suffer by these vials, and the in which their ruin will proceed; and as the trumpets were so many gradual steps to the ruin of the Roman empire, eastern and western, when become Christian, so these vials are so many gradual steps to, and which issue in the ruin of, both the eastern and western antichrist; though they do not respect the same things, nor the same times: the trumpets respect the Roman empire as Christian, under the government of emperors, after the downfall of Paganism in it; and the vials respect the antichristian powers in their several branches, under the pope and Turk. Antichrist did not appear until the fifth trumpet sounded, whereas the first vial is poured out upon his followers and worshippers, Revelation 16:2 from whence it is a clear point, that the first trumpet and the first vial cannot be contemporary; and the same judgment may be made of the rest: and it may be further observed, that these vials are only poured out on the enemies of God and of Christ, and of his church and people; for no wrath can be poured out upon the saints, not the least drop of it can fall upon them; this would not be consistent with God's everlasting love to them, with the satisfaction of Christ made for them, nor with the blessings of justification, pardon, adoption, &c. bestowed on them; not but that they may meet with trouble in the of these vials, through the wars that will be in the world, and through the struggles of the beast of Rome, especially its last, which will be the hour of temptation, and that time of trouble than which never was the like; yet all will work for, and issue in their good, and they will rejoice in God's righteous judgments; the blow will be upon antichrist, the vengeance of God will fall upon those that have the mark of the beast, and the worshippers of his image, upon the seat of the beast, even upon Babylon, and the whole Romish jurisdiction, as appears from Revelation 16:2 and also upon the Turkish empire, and all the nations engaged in the interest of both pope and Turk, Revelation 16:12 and it is easy to observe, that there is in many of these vials an allusion to the plagues of Egypt; in the first, Revelation 16:2 to the plague of boils, Exodus 9:8 in the second and third, Revelation 16:3 to that of turning the waters of Egypt into blood, Exodus 7:19 in the fourth, Revelation 16:10 to the darkness that was over all the land of Egypt, Exodus 10:21 and in the fifth there is a manifest reference to the frogs that distressed the Egyptians, Exodus 8:5 and in the seventh, to the plague of hail, Exodus 9:23 and they have much the same effect, even the hardening of those on whom they fall, being far from being brought to repentance by them, Revelation 16:9 and this confirms the application of the vials to the destruction of Rome, which is spiritually called Egypt, Revelation 11:8 and may assure that they will issue in the ruin of antichrist, and in the salvation of God's people, as the plagues of Egypt did in the destruction of Pharaoh, and in the deliverance of the children of Israel; and may also lead us to conclude, that there will be a like quick execution of the one as of the other; for as the plagues of Egypt came very quick one after another, so it seems as if the pouring out of these vials would be in like manner; the angels receive them together, and have their orders at the same time; and they go forth immediately, one after another, if not together, to the respective parts where they are to pour them forth, and which they do directly; see Revelation 16:8. Moreover, these vials will affect antichrist both with respect to his civil and ecclesiastic capacity, or both in temporals and spirituals, and, both antichrists, eastern and western: whether they are begun to be poured out or not, is a question. I am ready to think they are not, because they seem to me to refer to the seventh trumpet, which as yet has not sounded, and are the same with the wrath of God, and the time of the judging the dead, or avenging the blood of the saints, which will be come when that sounds, Revelation 11:18. Besides, the outer court is not entirely given to the Gentiles, nor the witnesses slain, which must be before this time of wrath upon antichrist; not but that there has been some manifest marks of the divine displeasure upon the whore of Rome, and she has been sinking ever since the Reformation, at which time some begin these vials, or before; and she is reduced to a low estate; yet I think not to such a degree as these vials express. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Saying to the seven angels, go your ways and pour out the vials of the wrath of God upon the earth; for though these angels had the seven last plagues to inflict, and the seven vials of God's wrath to pour out, and were in a readiness to do it, yet they did not move without an order, which is here given them; and they are bid to go their ways, from the temple, the church, where they were, and of which they were members, to the several parts of the antichristian empire; and there pour out all the wrath and vengeance of God upon his enemies, and theirs, and leave nothing behind, but give them the dregs of every cup of his fury: the earth here is to be taken in a larger sense than in the following verse, and includes the land and sea, the fountains and rivers, and even the ambient air, and also the sun in the firmament, as the pouring out of these vials upon them show; and designs the whole apostate church, consisting of earthly men, all the inhabitants of the earth, that worship the beast. The Alexandrian copy, the Vulgate Latin, Syriac, and Arabic versions, and the Complutensian edition, read, \"the seven vials of the wrath of God\"; these seven vials are not contemporary, much less the same with the seven trumpets; there is indeed a likeness between them in some things, especially in the first four; for as the first four trumpets affect the earth, the sea, the fountains, and rivers of water, and the sun, so the first four vials are poured out on the same, and that in the same order; first on the earth, and then on the sea, &c. and which will give some light, and be a direction to observe the several parts of the antichristian empire, which will suffer by these vials, and the in which their ruin will proceed; and as the trumpets were so many gradual steps to the ruin of the Roman empire, eastern and western, when become Christian, so these vials are so many gradual steps to, and which issue in the ruin of, both the eastern and western antichrist; though they do not respect the same things, nor the same times: the trumpets respect the Roman empire as Christian, under the government of emperors, after the downfall of Paganism in it; and the vials respect the antichristian powers in their several branches, under the pope and Turk. Antichrist did not appear until the fifth trumpet sounded, whereas the first vial is poured out upon his followers and worshippers, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from whence it is a clear point, that the first trumpet and the first vial cannot be contemporary; and the same judgment may be made of the rest: and it may be further observed, that these vials are only poured out on the enemies of God and of Christ, and of his church and people; for no wrath can be poured out upon the saints, not the least drop of it can fall upon them; this would not be consistent with God's everlasting love to them, with the satisfaction of Christ made for them, nor with the blessings of justification, pardon, adoption, &c. bestowed on them; not but that they may meet with trouble in the of these vials, through the wars that will be in the world, and through the struggles of the beast of Rome, especially its last, which will be the hour of temptation, and that time of trouble than which never was the like; yet all will work for, and issue in their good, and they will rejoice in God's righteous judgments; the blow will be upon antichrist, the vengeance of God will fall upon those that have the mark of the beast, and the worshippers of his image, upon the seat of the beast, even upon Babylon, and the whole Romish jurisdiction, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and also upon the Turkish empire, and all the nations engaged in the interest of both pope and Turk, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and it is easy to observe, that there is in many of these vials an allusion to the plagues of Egypt; in the first, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the plague of boils, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 9:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in the second and third, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to that of turning the waters of Egypt into blood, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 7:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in the fourth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the darkness that was over all the land of Egypt, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 10:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and in the fifth there is a manifest reference to the frogs that distressed the Egyptians, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 8:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and in the seventh, to the plague of hail, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 9:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and they have much the same effect, even the hardening of those on whom they fall, being far from being brought to repentance by them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and this confirms the application of the vials to the destruction of Rome, which is spiritually called Egypt, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and may assure that they will issue in the ruin of antichrist, and in the salvation of God's people, as the plagues of Egypt did in the destruction of Pharaoh, and in the deliverance of the children of Israel; and may also lead us to conclude, that there will be a like quick execution of the one as of the other; for as the plagues of Egypt came very quick one after another, so it seems as if the pouring out of these vials would be in like manner; the angels receive them together, and have their orders at the same time; and they go forth immediately, one after another, if not together, to the respective parts where they are to pour them forth, and which they do directly; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Moreover, these vials will affect antichrist both with respect to his civil and ecclesiastic capacity, or both in temporals and spirituals, and, both antichrists, eastern and western: whether they are begun to be poured out or not, is a question. I am ready to think they are not, because they seem to me to refer to the seventh trumpet, which as yet has not sounded, and are the same with the wrath of God, and the time of the judging the dead, or avenging the blood of the saints, which will be come when that sounds, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Besides, the outer court is not entirely given to the Gentiles, nor the witnesses slain, which must be before this time of wrath upon antichrist; not but that there has been some manifest marks of the divine displeasure upon the whore of Rome, and she has been sinking ever since the Reformation, at which time some begin these vials, or before; and she is reduced to a low estate; yet I think not to such a degree as these vials express. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And {1} I heard a great voice out of the temple saying to the seven angels, Go your ways, and pour out the vials of the wrath of God upon the earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{1}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I heard a great voice out of the temple saying to the seven angels, Go your ways, and pour out the vials of the wrath of God upon the earth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) In the former chapter was set down the preparation to the work of God: here is delivered the execution of it. In this discourse of the execution, is a general commandment, in this verse, then a particular recital in order of the execution done by every of the seven angels, in the rest of the chapter. This special execution against Antichrist and his crew does in manner agree to that which was generally done on the whole world, chapters eight and nine and belongs (if my conjecture fail me not) to the same time. Yet in here they differ from one another, that this was particularly effected on the princes and ringleaders of the wickedness of the world, the other generally against the whole world being wicked. Therefore these judgments are more grievous than those.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μεγάλης φωνῆς ἐκ τοῦ ναοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the voice sounding from the heavenly temple can belong only to God himself.[3668] This is not expressed, because John with all fidelity limits himself to that which he recognized, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he actually recognizes it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ʼΥπάγετε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cf. the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἈΠῆΛΘΕΝ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἈΠῆΛΘΕΝ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is understood of itself in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The angels have possibly held themselves in readiness, standing at the gate of the temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq.); now they come to a place in heaven, whence they can pour forth the destructive contents of their vials.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τ. ἘΠΤᾺ ΦΙΆΛΑς ΤΟῦ ΘΥΜΟῪ Τ. Θ.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Τ. ἘΠΤᾺ ΦΙΆΛΑς ΤΟῦ ΘΥΜΟῪ Τ. Θ.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 15:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Targum, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “The vials of the cup of my wrath.”[3669]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΕἸς ΤῊΝ ΓῆΝ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΕἸς ΤῊΝ ΓῆΝ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". As ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[3668] Beng., Züll., Hengstenb.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[3669] In Wetst.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The First Vial. Chap. 16 ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the vials",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the seven vials",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "into the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here and in the next verse. Here “the earth” seems to mean the lower world generally, there the dry land only.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τὰς ἑπτὰ φιάλας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the seven vials",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The Epistles to the VII. Churches are distributed into III. and IV. The VII. Seals are divided into IV. and III., and likewise the VII. Trumpets, as we have seen: and now also the VII. Vials. The Trumpets have shaken the kingdom of the world in a long circuit; the vials with swift and sharp violence break to pieces the beast in particular, which had clothed himself with the kingdom of the world, and his followers and resources. Therefore the trumpets and the vials advance in the same order. The former set of four touch ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the earth, the sea, the rivers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the sun:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the remaining set of three fall in other quarters, and are much more violent.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And I heard a great voice.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Characteristic of all the heavenly utterances (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:7, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). We have now the narration in full of the events of which ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". has given us a summary. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Out of the temple.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ναός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", shrine of God, mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and which no one could enter; the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "voice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " must, therefore, be the voice of God himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Saying to the seven angels (see on Revelation 15:1). Go your ways, and pour out the vials of the wrath of God upon the earth;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "go ye and pour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The seven vials",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is read in ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "א",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A, B, C, Andreas, Arethas, Primasius, and others. So, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the angel casts fire on the earth. Revelation 16:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The vials",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Add seven. ",
        "children": []
      }
    ]
  }
]