[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "is he . . .?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—For the emphatic question compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 34:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The way that he shall choose.—Rather, the way that he should choose—i.e., the way of right choice. The LXX. and Vulg., however, refer it to God—“the way in which He took delight.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The way that he shall choose",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".—Rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the way that he ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "should ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "choose",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the way of right choice. The LXX. and Vulg., however, refer it to God—“the way in which He took delight.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 25:12-13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:12-13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What man is he that feareth the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Whosoever he be, whether Jew or Gentile, whether comparatively innocent or a great sinner, which is my case: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him shall he teach in the way he shall choose — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The way which God chooseth, or appointeth and approveth, or which the good man ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "should, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ought ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to choose. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His soul shall dwell at ease — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "בשׂוב תלין",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "betob talin, shall lodge, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, continue ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in good, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the possession and enjoyment of the true good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His seed shall inherit the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the land, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "namely, Canaan; which was promised and given as an earnest of the whole covenant of grace and all its promises.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:8-14 We are all sinners; and Christ came into the world to save sinners, to teach sinners, to call sinners to repentance. We value a promise by the character of him that makes it; we therefore depend upon God's promises. All the paths of the Lord, that is, all his promises and all his providences, are mercy and truth. In all God's dealings his people may see his mercy displayed, and his word fulfilled, whatever afflictions they are now exercised with. All the paths of the Lord are mercy and truth; and so it will appear when they come to their journey's end. Those that are humble, that distrust themselves, and desire to be taught and to follow Divine guidance, these he will guide in judgment, that is, by the rule of the written word, to find rest for their souls in the Saviour. Even when the body is sick, and in pain, the soul may be at ease in God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "What man is he - Who is he. The statement in this verse is intended to include every man; or to be universal. Wherever one is found who has the character here referred to, or whoever he may be, of him what is here affirmed will be true, that God will lead him in the way that he shall choose.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That feareth the Lord - That is, a true worshipper of Yahweh, or that is truly a pious man: Psalm 5:7. \"Him shall he teach.\" He will guide, or instruct him. See Psalm 25:9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That feareth the Lord - That is, a true worshipper of Yahweh, or that is truly a pious man: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Him shall he teach.\" He will guide, or instruct him. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the way that he shall choose - The way that the person ought to choose; or, in other words, in the right way. It is not the way that God shall choose, but the way that the pious person ought to choose: God will so instruct him that he shall find the true path. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the way that he shall choose - The way that the person ought to choose; or, in other words, in the right way. It is not the way that God shall choose, but the way that the pious person ought to choose: God will so instruct him that he shall find the true path. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12, 13. What he asks for himself is the common lot of all the pious.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12 What man is he that feareth the Lord? him shall he teach in the way that he shall choose.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "13 His soul shall dwell at ease; and his seed shall inherit the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14 The secret of the Lord is with them that fear him; and he will shew them his covenant.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15 Mine eyes are ever toward the Lord; for he shall pluck my feet out of the net.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 25:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:12",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"What man is he that feareth the Lord?\" Let the question provoke self-examination. Gospel privileges are not for every pretender. Art thou of the seed royal or no? \"Him shall he teach in the way that he shall choose.\" Those whose hearts are right shall not err for want of heavenly direction. Where God sanctifies the heart he enlightens the head. We all wish to choose our way; but what a mercy is it when the Lord directs that choice, and makes free-will to be good-will! If we make our will God's will, God will let us have our will. God does not violate our will, but leaves much to our choice; nevertheless, he instructs our wills, and so we choose that which is well-pleasing in his sight. The will should be subject to law; there is a way which we should choose, but so ignorant are we that we need to be taught, and so wilful that none but God himself can teach us effectually.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 25:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:13",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He who fears God has nothing else to fear. \"His soul shall dwell at ease.\" He shall lodge in the chamber of content. One may sleep as soundly in the little bed in the corner as in the Great Bed of Ware; it is not abundance but content that gives true ease. Even here, having learned by grace both to abound and to be empty, the believer dwells at ease; but how profound will be the ease of his soul for ever! There he will enjoy the \"otium cum dignitate;\" ease and glory shall go together. Like a warrior whose battles are over, or a husbandman whose barns are full, his soul shall take its ease, and be merry for ever. \"His seed shall inherit the earth.\" God remembers, Isaac for the sake of Abraham, and Jacob for the sake of Isaac. Good men's sons have a goodly portion to begin the world with, but many of them, alas! turn a father's blessing into a curse. The promise is not broken because in some instances men wilfully refuse to receive it; moreover, it is in its spiritual meaning that it now holds good; our spiritual seed do inherit all that was meant by \"the earth,\" or Canaan; they receive the blessing of the new covenant. May the Lord make us the joyful parents of many spiritual children, and we shall have no fears about their maintenance, for the Lord will make each one of them princes in all the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 25:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:14",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The secret of the Lord is with them that fear him.\" Some read it \"the friendship:\" it signifies familiar intercourse, confidential intimacy, and select fellowship. This is a great secret. Carnal minds cannot guess what is intended by it, and even believers cannot explain it in words, for it must be felt to be known. The higher spiritual life is necessarily a path which the eagle's eye hath not known, and which the lion's whelp has not travelled; neither natural wisdom nor strength can force a door into this inner chamber. Saints have the key of heaven's hieroglyphics; they can unriddle celestial enigmas. They are initiated into the fellowship of the skies; they have heard words which it is not possible for them to repeat to their fellows. \"And he will shew them his covenant.\" Its antiquity, security, righteousness, fulness, graciousness and excellence shall be revealed to their hearts and understandings, and above all, their own part in it shall be sealed to their souls by the witness of the Holy Spirit. The designs of love which the Lord has to his people in the covenant of grace, he has been pleased to show to believers in the Book of Inspiration, and by his Spirit he leads us into the mystery, even the hidden mystery of redemption. He who does not know the meaning of this verse, will never learn it from a commentary; let him look to the cross for the secret lies there.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 25:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:15",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Mine eyes are ever toward the Lord.\" The writer claims to be fixed in his trust, and constant in his expectation; he looks in confidence and waits in hope. We may add to this look of faith and hope the obedient look of service, the humble look of reverence, the admiring look of wonder, the studious look of meditation and the tender look of affection. Happy are those whose eyes are never removed from their God. \"The eye,\" says Solomon, \"is never satisfied with seeing,\" but this sight is the most satisfying in the world. \"For he shall pluck my feet out of the net.\" Observe the conflicting condition in which a gracious soul may be placed, his eyes are in heaven and yet his feet are sometimes in a net; his nobler nature ceases not to behold the glories of God, while his baser parts are enduring the miseries of the world. A net is the common metaphor for temptation. The Lord often keeps his people from falling into it, and if they have fallen he rescues them. The word \"pluck\" is a rough word, and saints who have fallen into sin find that the means of their restoration are not always easy to the flesh; the Lord plucks at us sharply to let us feel that sin is an exceeding bitter thing. But what a mercy is here! Believer, be very grateful for it. The Lord will deliver us from the cunning devices of our cruel enemy, and even if through infirmity we have fallen into sin, he will not leave us to be utterly destroyed but will pluck us out of our dangerous state; though our feet are in the net, if our eyes are up unto God, mercy certainly will interpose. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What man is he, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. whosoever he be, whether Jew or Gentile, whether more innocent, or a greater sinner, which is my case. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That he shall choose, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. which God appointeth or approveth. Or, which ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. such person, should choose; for the future tense is oft put potentially, and so as to express a man’s duty, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 20:9 Malachi 1:6 2:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 20:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 2:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "What man is he that feareth the Lord? That is, how happy a man is he! and one that fears the Lord is one that has the fear of God put into his heart, as a blessing of the covenant of grace before spoken of; who fears the Lord, not on account of the punishment of sin, but under the influence of the pardon of it, and for his goodness's sake; who loves the Lord, trusts in him, is careful not to offend him, hates sin, and avoids it, and has a strict regard to the worship of God in all its parts and branches, and performs it in fear; or who serves the Lord with reverence and godly fear. The description of this man's happiness follows in this verse and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "him shall he teach in the way that he shall choose; either which the man that fears God shall choose, which is the way of truth and duty, Psalm 119:30; or the way which God prescribes to him, and is well pleasing in his sight, who teaches to profit, and leads in the way his people should go; and a great happiness it is for a man to have his steps ordered by the Lord and his goings directed by him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "him shall he teach in the way that he shall choose; either which the man that fears God shall choose, which is the way of truth and duty, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or the way which God prescribes to him, and is well pleasing in his sight, who teaches to profit, and leads in the way his people should go; and a great happiness it is for a man to have his steps ordered by the Lord and his goings directed by him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "What {i} man is he that feareth the LORD? him shall he teach in the way that he shall {k} choose.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "What ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " man ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he that feareth the LORD? him shall he teach in the way ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " choose.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Meaning, the number is very small.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) He will direct such with his spirit to follow the right way.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] A rhetorical question, equivalent to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whosoever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 34:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him shall he teach",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V., him shall he Instruct, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 25:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the way",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he shall choose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In the course of life which His Providence chooses for him: or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the way that he should choose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; what course to take in circumstances of doubt or difficulty; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the way that he chooseth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; he chooses ‘the fear of the Lord’ which is ‘the way of truth,’ and Jehovah instructs him in it. This is most in accordance with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:173",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 1:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 3:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "What man is he that feareth the Lord?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Once more we have a series of reflections (vers. 12-15) - first, with respect to the God-fearing man. Every such man shall have favour shown him by God - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "teach in the way that he shall choose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is, of course, the right way - the way of God's commandments (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:30, 173",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). God shall make his way plain to the God-fearing man. Psalm 25:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The question: quisnam est vir, which resembles ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 34:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 50:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is only propounded in order to draw attention to the person who bears the character described, and then to state what such an one has to expect. In prose we should have a relative antecedent clause instead, viz., qui (quisquis) talis est qui Dominum vereatur.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The verb ver-eri, which signifies \"to guard one's self, defend one's self from anything\" according to its radical notion, has nothing to do with ירא (ורא).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The attributive יבהר, (viam) quam eligat (cf. Isaiah 48:17), might also be referred to God: in which He takes delight (lxx); but parallels like Psalm 119:30, Psalm 119:173, favour the rendering: which he should choose. Among all the blessings which fall to the lot of him who fears God, the first place is given to this, that God raises him above the vacillation and hesitancy of human opinion. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The attributive יבהר, (viam) quam eligat (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 48:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), might also be referred to God: in which He takes delight (lxx); but parallels like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:173",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", favour the rendering: which he should choose. Among all the blessings which fall to the lot of him who fears God, the first place is given to this, that God raises him above the vacillation and hesitancy of human opinion. ",
            "children": []
          }
        ]
      }
    ]
  }
]