[[],[{"type":"header","content":"The Great Commandment"},{"type":"prose","content":"Now this is the commandment—the statutes and the ordinances—that the  your God charged me to teach you to observe in the land that you are about to cross into and occupy, "}],[{"type":"prose","content":"so that you and your children and your children’s children may fear the  your God all the days of your life, and keep all his decrees and his commandments that I am commanding you, so that your days may be long. "}],[{"type":"prose","content":"Hear therefore, O Israel, and observe them diligently, so that it may go well with you, and so that you may multiply greatly in a land flowing with milk and honey, as the , the God of your ancestors, has promised you."}],[{"type":"prose","content":"Hear, O Israel: The  is our God, the  alone. "}],[{"type":"prose","content":"You shall love the  your God with all your heart, and with all your soul, and with all your might. "}],[{"type":"prose","content":"Keep these words that I am commanding you today in your heart. "}],[{"type":"prose","content":"Recite them to your children and talk about them when you are at home and when you are away, when you lie down and when you rise. "}],[{"type":"prose","content":"Bind them as a sign on your hand, fix them as an emblem on your forehead, "}],[{"type":"prose","content":"and write them on the doorposts of your house and on your gates."},{"type":"header","content":"Caution against Disobedience"}],[{"type":"prose","content":"When the  your God has brought you into the land that he swore to your ancestors, to Abraham, to Isaac, and to Jacob, to give you—a land with fine, large cities that you did not build, "}],[{"type":"prose","content":"houses filled with all sorts of goods that you did not fill, hewn cisterns that you did not hew, vineyards and olive groves that you did not plant—and when you have eaten your fill, "}],[{"type":"prose","content":"take care that you do not forget the , who brought you out of the land of Egypt, out of the house of slavery. "}],[{"type":"prose","content":"The  your God you shall fear; him you shall serve, and by his name alone you shall swear. "}],[{"type":"prose","content":"Do not follow other gods, any of the gods of the peoples who are all around you, "}],[{"type":"prose","content":"because the  your God, who is present with you, is a jealous God. The anger of the  your God would be kindled against you and he would destroy you from the face of the earth."}],[{"type":"prose","content":"Do not put the  your God to the test, as you tested him at Massah. "}],[{"type":"prose","content":"You must diligently keep the commandments of the  your God, and his decrees, and his statutes that he has commanded you. "}],[{"type":"prose","content":"Do what is right and good in the sight of the , so that it may go well with you, and so that you may go in and occupy the good land that the  swore to your ancestors to give you, "}],[{"type":"prose","content":"thrusting out all your enemies from before you, as the  has promised."}],[{"type":"prose","content":"When your children ask you in time to come, “What is the meaning of the decrees and the statutes and the ordinances that the  our God has commanded you?” "}],[{"type":"prose","content":"then you shall say to your children, “We were Pharaoh’s slaves in Egypt, but the  brought us out of Egypt with a mighty hand. "}],[{"type":"prose","content":"The  displayed before our eyes great and awesome signs and wonders against Egypt, against Pharaoh and all his household. "}],[{"type":"prose","content":"He brought us out from there in order to bring us in, to give us the land that he promised on oath to our ancestors. "}],[{"type":"prose","content":"Then the  commanded us to observe all these statutes, to fear the  our God, for our lasting good, so as to keep us alive, as is now the case. "}],[{"type":"prose","content":"If we diligently observe this entire commandment before the  our God, as he has commanded us, we will be in the right.”"}]]