[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I pray thee therefore, father.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The re iterated appeal to Abraham as “father” is suggestive in many ways: (1) as speaking out that in which too many of the rich man’s class put an undue trust, resting on the fatherhood of Abraham rather than on that of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); (2) as showing that the refusal of the previous verse had been accepted, as it were, submissively. There is no rebellious defiance, no blasphemous execration, such as men have pictured to themselves as resounding ever more in the realms of darkness. Abraham is the sufferer’s father still, and he yet counts on his sympathy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:19-31 Here the spiritual things are represented, in a description of the different state of good and bad, in this world and in the other. We are not told that the rich man got his estate by fraud, or oppression; but Christ shows, that a man may have a great deal of the wealth, pomp, and pleasure of this world, yet perish for ever under God's wrath and curse. The sin of this rich man was his providing for himself only. Here is a godly man, and one that will hereafter be happy for ever, in the depth of adversity and distress. It is often the lot of some of the dearest of God's saints and servants to be greatly afflicted in this world. We are not told that the rich man did him any harm, but we do not find that he had any care for him. Here is the different condition of this godly poor man, and this wicked rich man, at and after death. The rich man in hell lifted up his eyes, being in torment. It is not probable that there are discourses between glorified saints and damned sinners, but this dialogue shows the hopeless misery and fruitless desires, to which condemned spirits are brought. There is a day coming, when those who now hate and despise the people of God, would gladly receive kindness from them. But the damned in hell shall not have the least abatement of their torment. Sinners are now called upon to remember; but they do not, they will not, they find ways to avoid it. As wicked people have good things only in this life, and at death are for ever separated from all good, so godly people have evil things only in this life, and at death they are for ever put from them. In this world, blessed be God, there is no gulf between a state of nature and grace, we may pass from sin to God; but if we die in our sins, there is no coming out. The rich man had five brethren, and would have them stopped in their sinful course; their coming to that place of torment, would make his misery the worse, who had helped to show them the way thither. How many would now desire to recall or to undo what they have written or done! Those who would make the rich man's praying to Abraham justify praying to saints departed, go far to seek for proofs, when the mistake of a damned sinner is all they can find for an example. And surely there is no encouragement to follow the example, when all his prayers were made in vain. A messenger from the dead could say no more than what is said in the Scriptures. The same strength of corruption that breaks through the convictions of the written word, would triumph over a witness from the dead. Let us seek to the law and to the testimony, Isa 8:19,20, for that is the sure word of prophecy, upon which we may rest, 2Pe 1:19. Circumstances in every age show that no terrors, or arguments, can give true repentance without the special grace of God renewing the sinner's heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Five brethren - The number \"five\" is mentioned merely to preserve the appearance of verisimilitude in the story. It is not to be spiritualized, nor are we to suppose that it has any hidden or inscrutable meaning.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "May testify unto them - May bear \"witness\" to them, or may inform them of what is my situation, and the dreadful consequences of the life that I have led. It is remarkable that he did not ask to go himself. He knew that he could not be released, even for so short a time. His condition was fixed. Yet he had no wish that his friends should suffer, and he supposed that if one went from the dead they would hear him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "May testify unto them - May bear \"witness\" to them, or may inform them of what is my situation, and the dreadful consequences of the life that I have led. It is remarkable that he did not ask to go himself. He knew that he could not be released, even for so short a time. His condition was fixed. Yet he had no wish that his friends should suffer, and he supposed that if one went from the dead they would hear him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27-31. Then he said—now abandoning all hope for himself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "send him to my father's house, &c.—no waking up of good in the heart of the lost, but bitter reproach against God and the old economy, as not warning him sufficiently [Trench]. The answer of Abraham is, They are sufficiently warned.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 27,28. Him that the rich man would not hear, when he lay at his gate full of sores, exhorting him to do good and to distribute, to give alms of all that he had, and to make himself friends of the mammon of unrighteousness, he would now have restored to the earth again, his soul before the general resurrection reunited to His body, that he might go unto his father’s house, and give them warning, that they might not come into the misery which he felt. But is there any charity in hell? Is there any there that wish well to souls upon earth? Or rather, are not damned souls, like persons infected with the plague, desirous that others might be made as miserable as themselves? A grave and acute author saith, he prayeth not for them, but for himself, that he might not be the note miserable by the company of those who upon the earth were his near relations, and dear unto him. But we must remember that our Saviour here speaketh all in a figure, and that which our Saviour by these expressions designs to instruct us in is no more than this, That although atheistical and proud and haughty souls in this life make a mock at hell, and at the wrath of God to be revealed after this life, and despise the poor servants of God, who by their doctrine, or holy life and example, would teach them better things, yet they shall find the fire of hell so hot, the wrath of God so terrible and intolerable, that if you could imagine that souls under those miseries could have the least dram of charity and good nature left it, them, though they apprehend themselves past all hopes of recovery to a better state, yet they would beg that some of those faithful ministers, or godly people, whom they have rejected, despised, and abused, might be sent to every friend they have in the world, to warn them from doing as they have done, and running the hazard of those torments they feel for doing of such things. The papists, who idly go about from hence to prove a sense in departed souls of the state of their friends that are yet alive upon the earth, can derive very little comfort from that speculation out of this text; which if it could prove any thing of that nature could prove no more than that damned souls have such a sense, and might by the same argument also evince their charity. But figurative expressions must not be so closely applied. I have showed what I judge to be the true instruction from this passage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then he said, I pray thee therefore father,.... The Cambridge, copy of Beza's, and the Ethiopic version read, \"father Abraham\"; finding he could have no redress of his misery, nor any relief for himself, he applies for others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou wouldst send him to my father's house; the house of Israel and Jacob, the surviving Jews: and this agrees also with a notion of theirs, that the dead seek for mercy for them (l). The Persic and Ethiopic versions read, \"that thou wouldst send Lazarus\", &c. whom the one calls Gazarus, and the other Eleazar. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) T. Bab. Taanith, fol. 16. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) T. Bab. Taanith, fol. 16. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{7} Then he said, I pray thee therefore, father, that thou wouldest send him to my father's house:",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{7}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Then he said, I pray thee therefore, father, that thou wouldest send him to my father's house:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(7) Seeing that we have a most sure rule to live by, laid forth for us in the word of God, men seek rashly and vainly for other revelations.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:27-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". What riches lead to when they are not applied according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is shown ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:19-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In order, however, to escape from this perdition while there is still time, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "repentance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is necessary, and for this ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the law and the prophets",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are the appointed means (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and, indeed, these are so perfectly sufficient that even the return of a dead person to life would not be more effectual.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅπως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Purpose of the sending; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔχω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀδελφ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". is a parenthetic clause; his style is pathetic.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διαμαρτύρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that he may testify to them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, of the situation in which I am placed, because I have not repented. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὅρα πῶς ὑπὸ τῆς κολάσεως εἰς συναίσθησιν ἦλθεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Theophylact.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀκουσάτωσαν αὐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they should give heed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (listen) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐχί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nay",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "! they will not hear them. The echo of his own experience gained in the position of secure obduracy!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ νεκρῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] belongs to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πορευθῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐδὲ ἐάν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not even",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (not at all), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πεισθήσονται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] not immediately ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πιστεύσουσιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Vulg. Euthymius Zigabenus, Luther, and others), but: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they will be moved, will be won over",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", namely, to repent.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A reference to the resurrection of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Olshausen), or to the manifestation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Elias",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Baumgarten-Crusius), is altogether remote, although the word of Abraham has certainly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "approved itself historically",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " even in reference to the risen Christ. The illustration, moreover, by the example of Lazarus of Bethany, who brought intelligence from Hades, and whom the Jews would have killed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is not to the point (Chrysostom, Theophylact, Euthymius Zigabenus).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:27-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dives intercedes for his brethren",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that thou wouldest send him to my father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "s house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It is difficult not to see in this request the dawn of a less selfish spirit in the rich man’s heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 27, 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then he said, I pray thee therefore, father, that thou wouldest send him to my father's house: for I have five brethren; that he may testify unto them; lest they also come into this place of torment",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The condemned acquiesces in this dread fact; convinced of the utter impossibility of any interchange of sympathy between him and the dwellers in the realms of bliss, he ceases to pray for any alleviation of his own sad and wretched state. But another wail of woe quickly rises from the awful solitude. What means this second prayer of the doomed man? Are we to read in it the first signs of a new and noble purpose in the lost soul, the first dawning of loving thoughts and tender care for others? It seems, perhaps, unkind not to recognize this; but the Divine Speaker evidently had another purpose here when he put these words into the mouth of the lost rich man - he would teach the great lesson to the living that a selfish life is inexcusable. On first thoughts, the rich man's request to Abraham appears prompted alone by his anxiety for the future of his brothers who were still alive; but on examination it would seem, to use the striking words of Professor Bruce, that he wished rather to justify his own sad past by some such. reflection as this: \"Had only some one come from the dead with the calm, clear light of eternity shining in his eyes, to inform me that this life beyond is no table, that Paradise is a place or state of unspeakable bliss, and Gehenna a place or state of unspeakable woe, I should have renounced my voluptuous, selfish ways, and entered on the path of piety and charity. If one had come to me from the dead, I had surely repented, and so should not have come to this place of torment.\" Luke 16:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Send him to my father's house",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare Dante, where Ciacco, the glutton, says to Dante:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"But when thou art again in the sweet world,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I pray thee to the mind of others bring me.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Inferno, vi., 88. ",
        "children": []
      }
    ]
  }
]