[{"num":9,"verse":"Then Jesus called together the Twelve [apostles] and gave them power and authority over all demons, and to cure diseases,"},{"num":2,"verse":"And He sent them out to announce and preach the kingdom of God and to bring healing."},{"num":3,"verse":"And He said to them, Do not take anything for your journey—neither walking stick, nor wallet [for a collection bag], nor food of any kind, nor money, and do not have two undergarments (tunics)."},{"num":4,"verse":"And whatever house you enter, stay there until you go away [from that place]."},{"num":5,"verse":"And wherever they do not receive and accept and welcome you, when you leave that town shake off [even] the dust from your feet, as a testimony against them."},{"num":6,"verse":"And departing, they went about from village to village, preaching the Gospel and restoring the afflicted to health everywhere."},{"num":7,"verse":"Now Herod the tetrarch heard of all that was being done by [Jesus], and he was [thoroughly] perplexed and troubled, because it was said by some that John [the Baptist] had been raised from the dead,"},{"num":8,"verse":"And by others that Elijah had appeared, and by others that one of the prophets of old had come back to life."},{"num":9,"verse":"But Herod said, John I beheaded; but Who is this about Whom I [learn] such things by hearsay? And he sought to see Him."},{"num":10,"verse":"Upon their return, the apostles reported to Jesus all that they had done. And He took them [along with Him] and withdrew into privacy near a town called Bethsaida."},{"num":11,"verse":"But when the crowds learned of it, [they] followed Him; and He welcomed them and talked to them about the kingdom of God, and healed those who needed restoration to health."},{"num":12,"verse":"Now the day began to decline, and the Twelve came and said to Him, Dismiss the crowds and send them away, so that they may go to the neighboring hamlets and villages and the surrounding country and find lodging and get a supply of provisions, for we are here in an uninhabited (barren, solitary) place."},{"num":13,"verse":"But He said to them, You [yourselves] give them [food] to eat. They said, We have no more than five loaves and two fish—unless we are to go and buy food for all this crowd,"},{"num":14,"verse":"For there were about 5,000 men. And [Jesus] said to His disciples, Have them [sit down] reclining in table groups (companies) of about fifty each."},{"num":15,"verse":"And they did so, and made them all recline."},{"num":16,"verse":"And taking the five loaves and the two fish, He looked up to heaven and [praising God] gave thanks and asked Him to bless them [to their use]. Then He broke them and gave them to the disciples to place before the multitude."},{"num":17,"verse":"And all the people ate and were satisfied. And they gathered up what remained over—twelve [small hand] baskets of broken pieces."},{"num":18,"verse":"Now it occurred that as Jesus was praying privately, the disciples were with Him, and He asked them, Who do men say that I am?"},{"num":19,"verse":"And they answered, John the Baptist; but some say, Elijah; and others, that one of the ancient prophets has come back to life."},{"num":20,"verse":"And He said to them, But who do you [yourselves] say that I am? And Peter replied, The Christ of God!"},{"num":21,"verse":"But He strictly charged and sharply commanded them [under penalty] to tell this to no one [no one, whoever he might be],"},{"num":22,"verse":"Saying, The Son of Man must suffer many things and be [deliberately] disapproved and repudiated and rejected on the part of the elders and chief priests and scribes, and be put to death and on the third day be raised [again]."},{"num":23,"verse":"And He said to all, If any person wills to come after Me, let him deny himself [disown himself, forget, lose sight of himself and his own interests, refuse and give up himself] and take up his cross daily and follow Me [cleave steadfastly to Me, conform wholly to My example in living and, if need be, in dying also]."},{"num":24,"verse":"For whoever would preserve his life and save it will lose and destroy it, but whoever loses his life for My sake, he will preserve and save it [from the penalty of eternal death]."},{"num":25,"verse":"For what does it profit a man, if he gains the whole world and ruins or forfeits (loses) himself?"},{"num":26,"verse":"Because whoever is ashamed of Me and of My teachings, of him will the Son of Man be ashamed when He comes in the [threefold] glory (the splendor and majesty) of Himself and of the Father and of the holy angels."},{"num":27,"verse":"However I tell you truly, there are some of those standing here who will not taste death before they see the kingdom of God."},{"num":28,"verse":"Now about eight days after these teachings, Jesus took with Him Peter and John and James and went up on the mountain to pray."},{"num":29,"verse":"And as He was praying, the appearance of His countenance became altered (different), and His raiment became dazzling white [flashing with the brilliance of lightning]."},{"num":30,"verse":"And behold, two men were conversing with Him—Moses and Elijah,"},{"num":31,"verse":"Who appeared in splendor and majesty and brightness and were speaking of His exit [from life], which He was about to bring to realization at Jerusalem."},{"num":32,"verse":"Now Peter and those with him were weighed down with sleep, but when they fully awoke, they saw His glory (splendor and majesty and brightness) and the two men who stood with Him."},{"num":33,"verse":"And it occurred as the men were parting from Him that Peter said to Jesus, Master, it is delightful and good that we are here; and let us construct three booths or huts—one for You and one for Moses and one for Elijah! not noticing or knowing what he was saying."},{"num":34,"verse":"But even as he was saying this, a cloud came and began to overshadow them, and they were seized with alarm and struck with fear as they entered into the cloud."},{"num":35,"verse":"Then there came a voice out of the cloud, saying, This is My Son, My Chosen One or My Beloved; listen to and yield to and obey Him!"},{"num":36,"verse":"And when the voice had died away, Jesus was found there alone. And they kept still, and told no one at that time any of these things that they had seen."},{"num":37,"verse":"Now it occurred the next day, when they had come down from the mountain, that a great multitude met Him."},{"num":38,"verse":"And behold, a man from the crowd shouted out, Master, I implore You to look at my son, for he is my only child;"},{"num":39,"verse":"And behold, a spirit seizes him and suddenly he cries out; it convulses him so that he foams at the mouth; and he is sorely shattered, and it will scarcely leave him."},{"num":40,"verse":"And I implored Your disciples to drive it out, but they could not."},{"num":41,"verse":"Jesus answered, O [faithless ones] unbelieving and without trust in God, a perverse (wayward, crooked and warped) generation! Until when and how long am I to be with you and bear with you? Bring your son here [to Me]."},{"num":42,"verse":"And even while he was coming, the demon threw him down and [completely] convulsed him. But Jesus censured and severely rebuked the unclean spirit and healed the child and restored him to his father."},{"num":43,"verse":"And all were astounded at the evidence of God’s mighty power and His majesty and magnificence. But [while] they were all marveling at everything Jesus was doing, He said to His disciples,"},{"num":44,"verse":"Let these words sink into your ears: the Son of Man is about to be delivered into the hands of men [whose conduct is opposed to God]."},{"num":45,"verse":"However, they did not comprehend this saying; and it was kept hidden from them, so that they should not grasp it and understand, and they were afraid to ask Him about the statement."},{"num":46,"verse":"But a controversy arose among them as to which of them might be the greatest [surpassing the others in excellence, worth, and authority]."},{"num":47,"verse":"But Jesus, as He perceived the thoughts of their hearts, took a little child and put him at His side"},{"num":48,"verse":"And told them, Whoever receives and accepts and welcomes this child in My name and for My sake receives and accepts and welcomes Me; and whoever so receives Me so also receives Him Who sent Me. For he who is least and lowliest among you all—he is [the one who is truly] great."},{"num":49,"verse":"John said, Master, we saw a man driving out demons in Your name and we commanded him to stop it, for he does not follow along with us."},{"num":50,"verse":"But Jesus told him, Do not forbid [such people]; for whoever is not against you is for you."},{"num":51,"verse":"Now when the time was almost come for Jesus to be received up [to heaven], He steadfastly and determinedly set His face to go to Jerusalem."},{"num":52,"verse":"And He sent messengers before Him; and they reached and entered a Samaritan village to make [things] ready for Him;"},{"num":53,"verse":"But [the people] would not welcome or receive or accept Him, because His face was [set as if He was] going to Jerusalem."},{"num":54,"verse":"And when His disciples James and John observed this, they said, Lord, do You wish us to command fire to come down from heaven and consume them, even as Elijah did?"},{"num":55,"verse":"But He turned and rebuked and severely censured them. He said, You do not know of what sort of spirit you are,"},{"num":56,"verse":"For the Son of Man did not come to destroy men’s lives, but to save them [from the penalty of eternal death]. And they journeyed on to another village."},{"num":57,"verse":"And it occurred that as they were going along the road, a man said to Him, Lord, I will follow You wherever You go."},{"num":58,"verse":"And Jesus told him, Foxes have lurking holes and the birds of the air have roosts and nests, but the Son of Man has no place to lay His head."},{"num":59,"verse":"And He said to another, Become My disciple, side with My party, and accompany Me! But he replied, Lord, permit me first to go and bury (await the death of) my father."},{"num":60,"verse":"But Jesus said to him, Allow the dead to bury their own dead; but as for you, go and publish abroad throughout all regions the kingdom of God."},{"num":61,"verse":"Another also said, I will follow You, Lord, and become Your disciple and side with Your party; but let me first say good-bye to those at my home."},{"num":62,"verse":"Jesus said to him, No one who puts his hand to the plow and looks back [to the things behind] is fit for the kingdom of God."}]