[{"header":"Commissioning the Twelve"},{"num":9,"verse":"Summoning the Twelve, He gave them power and authority over all the demons, and power to heal diseases. "},{"num":2,"verse":"Then He sent them to proclaim the kingdom of God and to heal the sick."},{"num":6,"verse":"So they went out and traveled from village to village, proclaiming the good news and healing everywhere."},{"header":"Herod’s Desire to See Jesus"},{"num":7,"verse":"Herod the tetrarch heard about everything that was going on. He was perplexed, because some said that John had been raised from the dead, "},{"num":8,"verse":"some that Elijah had appeared, and others that one of the ancient prophets had risen. "},{"num":9,"verse":"“I beheaded John,” Herod said, “but who is this I hear such things about?” And he wanted to see Him."},{"header":"Feeding 5,000"},{"num":10,"verse":"When the apostles returned, they reported to Jesus all that they had done. He took them along and withdrew privately to a town called Bethsaida. "},{"num":11,"verse":"When the crowds found out, they followed Him. He welcomed them, spoke to them about the kingdom of God, and cured those who needed healing."},{"num":12,"verse":"Late in the day, the Twelve approached and said to Him, “Send the crowd away, so they can go into the surrounding villages and countryside to find food and lodging, because we are in a deserted place here.”"},{"num":14,"verse":"(For about 5,000 men were there.)"},{"num":15,"verse":"They did so, and had them all sit down. "},{"num":16,"verse":"Then He took the five loaves and the two fish, and looking up to heaven, He blessed and broke them. He kept giving them to the disciples to set before the crowd. "},{"num":17,"verse":"Everyone ate and was filled. Then they picked up 12 baskets of leftover pieces."},{"header":"Peter’s Confession of the Messiah"},{"num":18,"verse":"While He was praying in private and His disciples were with Him, He asked them, “Who do the crowds say that I am?”"},{"num":19,"verse":"They answered, “John the Baptist; others, Elijah; still others, that one of the ancient prophets has come back.”"},{"header":"His Death and Resurrection Predicted"},{"num":21,"verse":"But He strictly warned and instructed them to tell this to no one, "},{"num":22,"verse":"saying, “The Son of Man must suffer many things and be rejected by the elders, chief priests, and scribes, be killed, and be raised the third day.”"},{"header":"Take Up Your Cross"},{"num":23,"verse":"Then He said to them all, “If anyone wants to come with Me, he must deny himself, take up his cross daily, and follow Me. "},{"header":"The Transfiguration"},{"num":28,"verse":"About eight days after these words, He took along Peter, John, and James and went up on the mountain to pray. "},{"num":29,"verse":"As He was praying, the appearance of His face changed, and His clothes became dazzling white. "},{"num":30,"verse":"Suddenly, two men were talking with Him—Moses and Elijah. "},{"num":31,"verse":"They appeared in glory and were speaking of His death, which He was about to accomplish in Jerusalem."},{"num":32,"verse":"Peter and those with him were in a deep sleep, and when they became fully awake, they saw His glory and the two men who were standing with Him. "},{"num":33,"verse":"As the two men were departing from Him, Peter said to Jesus, “Master, it’s good for us to be here! Let us make three tabernacles: one for You, one for Moses, and one for Elijah”—not knowing what he said."},{"num":34,"verse":"While he was saying this, a cloud appeared and overshadowed them. They became afraid as they entered the cloud. "},{"num":35,"verse":"Then a voice came from the cloud, saying:"},{"num":36,"verse":"After the voice had spoken, only Jesus was found. They kept silent, and in those days told no one what they had seen."},{"header":"The Power of Faith over a Demon"},{"num":37,"verse":"The next day, when they came down from the mountain, a large crowd met Him. "},{"num":38,"verse":"Just then a man from the crowd cried out, “Teacher, I beg You to look at my son, because he’s my only child. "},{"num":39,"verse":"Often a spirit seizes him; suddenly he shrieks, and it throws him into convulsions until he foams at the mouth; wounding him, it hardly ever leaves him. "},{"num":40,"verse":"I begged Your disciples to drive it out, but they couldn’t.”"},{"num":41,"verse":"Jesus replied, “You unbelieving and rebellious generation! How long will I be with you and put up with you? Bring your son here.”"},{"num":42,"verse":"As the boy was still approaching, the demon knocked him down and threw him into severe convulsions. But Jesus rebuked the unclean spirit, cured the boy, and gave him back to his father. "},{"num":43,"verse":"And they were all astonished at the greatness of God."},{"header":"The Second Prediction of His Death"},{"num":45,"verse":"But they did not understand this statement; it was concealed from them so that they could not grasp it, and they were afraid to ask Him about it."},{"header":"Who Is the Greatest?"},{"num":46,"verse":"Then an argument started among them about who would be the greatest of them. "},{"num":47,"verse":"But Jesus, knowing the thoughts of their hearts, took a little child and had him stand next to Him. "},{"num":48,"verse":"He told them, “Whoever welcomes this little child in My name welcomes Me. And whoever welcomes Me welcomes Him who sent Me. For whoever is least among you—this one is great.”"},{"header":"In His Name"},{"num":49,"verse":"John responded, “Master, we saw someone driving out demons in Your name, and we tried to stop him because he does not follow us.”"},{"header":"The Journey to Jerusalem"},{"num":51,"verse":"When the days were coming to a close for Him to be taken up, He determined to journey to Jerusalem. "},{"num":52,"verse":"He sent messengers ahead of Him, and on the way they entered a village of the Samaritans to make preparations for Him. "},{"num":53,"verse":"But they did not welcome Him, because He determined to journey to Jerusalem. "},{"num":54,"verse":"When the disciples James and John saw this, they said, “Lord, do You want us to call down fire from heaven to consume them?”"},{"num":55,"verse":"But He turned and rebuked them, "},{"num":56,"verse":"and they went to another village."},{"header":"Following Jesus"},{"num":57,"verse":"As they were traveling on the road someone said to Him, “I will follow You wherever You go!”"},{"num":58,"verse":"Jesus told him, “Foxes have dens, and birds of the sky have nests, but the Son of Man has no place to lay His head.” "},{"num":59,"verse":"Then He said to another, “Follow Me.”"},{"num":60,"verse":"But He told him, “Let the dead bury their own dead, but you go and spread the news of the kingdom of God.”"},{"num":61,"verse":"Another also said, “I will follow You, Lord, but first let me go and say good-bye to those at my house.”"},{"num":62,"verse":"But Jesus said to him, “No one who puts his hand to the plow and looks back is fit for the kingdom of God.”"}]