[[],[],[{"type":"header","content":"Keep It Simple"},{"type":"prose","content":"Jesus now called the Twelve and gave them authority and power to deal with all the demons and cure diseases. He commissioned them to preach the news of God’s kingdom and heal the sick. He said, “Don’t load yourselves up with equipment. Keep it simple;  are the equipment. And no luxury inns—get a modest place and be content there until you leave. If you’re not welcomed, leave town. Don’t make a scene. Shrug your shoulders and move on.”"}],[{"type":"prose","content":"Commissioned, they left. They traveled from town to town telling the latest news of God, the Message, and curing people everywhere they went."}],[{"type":"prose","content":"Herod, the ruler, heard of these goings on and didn’t know what to think. There were people saying John had come back from the dead, others that Elijah had appeared, still others that some prophet of long ago had shown up. Herod said, “But I killed John—took off his head. So who is this that I keep hearing about?” Curious, he looked for a chance to see him in action."}],[{"type":"prose","content":"The apostles returned and reported on what they had done. Jesus took them away, off by themselves, near the town called Bethsaida. But the crowds got wind of it and followed. Jesus graciously welcomed them and talked to them about the kingdom of God. Those who needed healing, he healed."}],[{"type":"header","content":"Bread and Fish for Five Thousand"},{"type":"prose","content":"As the sun set, the Twelve said, “Dismiss the crowd so they can go to the farms or villages around here and get a room for the night and a bite to eat. We’re out in the middle of nowhere.”"}],[{"type":"prose","content":"“You feed them,” Jesus said.They said, “We couldn’t scrape up more than five loaves of bread and a couple of fish—unless, of course, you want us to go to town ourselves and buy food for everybody.” (There were more than five thousand people in the crowd.)"}],[{"type":"prose","content":"But he went ahead and directed his disciples, “Sit them down in groups of about fifty.” They did what he said, and soon had everyone seated. He took the five loaves and two fish, lifted his face to heaven in prayer, blessed, broke, and gave the bread and fish to the disciples to hand out to the crowd. After the people had all eaten their fill, twelve baskets of leftovers were gathered up."}],[{"type":"header","content":"Don’t Run from Suffering"},{"type":"prose","content":"One time when Jesus was off praying by himself, his disciples nearby, he asked them, “What are the crowds saying about me, about who I am?”"}],[{"type":"prose","content":"They said, “John the Baptizer. Others say Elijah. Still others say that one of the prophets from long ago has come back.”"}],[{"type":"prose","content":"He then asked, “And you—what are you saying about me? Who am I?”Peter answered, “The Messiah of God.” Jesus then warned them to keep it quiet. They were to tell no one what Peter had said."}],[{"type":"prose","content":"He went on, “It is necessary that the Son of Man proceed to an ordeal of suffering, be tried and found guilty by the religious leaders, high priests, and religion scholars, be killed, and on the third day be raised up alive.”"}],[{"type":"prose","content":"Then he told them what they could expect for themselves: “Anyone who intends to come with me has to let me lead. You’re not in the driver’s seat—I am. Don’t run from suffering; embrace it. Follow me and I’ll show you how. Self-help is no help at all. Self-sacrifice is the way,  way, to finding yourself, your true self. What good would it do to get everything you want and lose you, the real you? If any of you is embarrassed with me and the way I’m leading you, know that the Son of Man will be far more embarrassed with you when he arrives in all his splendor in company with the Father and the holy angels. This isn’t, you realize, pie in the sky by and by. Some who have taken their stand right here are going to see it happen, see with their own eyes the kingdom of God.”"}],[{"type":"header","content":"Jesus in His Glory"},{"type":"prose","content":"About eight days after saying this, he climbed the mountain to pray, taking Peter, John, and James along. While he was in prayer, the appearance of his face changed and his clothes became blinding white. At once two men were there talking with him. They turned out to be Moses and Elijah—and what a glorious appearance they made! They talked over his exodus, the one Jesus was about to complete in Jerusalem."}],[{"type":"prose","content":"Meanwhile, Peter and those with him were slumped over in sleep. When they came to, rubbing their eyes, they saw Jesus in his glory and the two men standing with him. When Moses and Elijah had left, Peter said to Jesus, “Master, this is a great moment! Let’s build three memorials: one for you, one for Moses, and one for Elijah.” He blurted this out without thinking."}],[{"type":"prose","content":"While he was babbling on like this, a light-radiant cloud enveloped them. As they found themselves buried in the cloud, they became deeply aware of God. Then there was a voice out of the cloud: “This is my Son, the Chosen! Listen to him.”"}],[{"type":"prose","content":"When the sound of the voice died away, they saw Jesus there alone. They were speechless. And they continued speechless, said not one thing to anyone during those days of what they had seen.* * *"}],[{"type":"prose","content":"When they came down off the mountain the next day, a big crowd was there to meet them. A man called from out of the crowd, “Please, please, Teacher, take a look at my son. He’s my only child. Often a spirit seizes him. Suddenly he’s screaming, thrown into convulsions, his mouth foaming. And then it beats him black-and-blue before it leaves. I asked your disciples to deliver him but they couldn’t.”"}],[{"type":"prose","content":"Jesus said, “What a generation! No sense of God! No focus to your lives! How many times do I have to go over these things? How much longer do I have to put up with this? Bring your son here.”"}],[{"type":"prose","content":"While he was coming, the demon slammed him to the ground and threw him into convulsions. Jesus stepped in, ordered the foul spirit gone, healed the boy, and handed him back to his father. They all shook their heads in wonder, astonished at God’s greatness, God’s majestic greatness."}],[{"type":"header","content":"Your Business Is Life"},{"type":"prose","content":"While they continued to stand around exclaiming over all the things he was doing, Jesus said to his disciples, “Treasure and ponder each of these next words: The Son of Man is about to be betrayed into human hands.”"}],[{"type":"prose","content":"They didn’t get what he was saying. It was like he was speaking a foreign language and they couldn’t make heads or tails of it. But they were embarrassed to ask him what he meant."}],[{"type":"prose","content":"They started arguing over which of them would be most famous. When Jesus realized how much this mattered to them, he brought a child to his side. “Whoever accepts this child as if the child were me, accepts me,” he said. “And whoever accepts me, accepts the One who sent me. You become great by accepting, not asserting. Your spirit, not your size, makes the difference.”"}],[{"type":"prose","content":"John spoke up, “Master, we saw a man using your name to expel demons and we stopped him because he wasn’t of our group.”"}],[{"type":"prose","content":"Jesus said, “Don’t stop him. If he’s not an enemy, he’s an ally.”"}],[{"type":"prose","content":"When it came close to the time for his Ascension, he gathered up his courage and steeled himself for the journey to Jerusalem. He sent messengers on ahead. They came to a Samaritan village to make arrangements for his hospitality. But when the Samaritans learned that his destination was Jerusalem, they refused hospitality. When the disciples James and John learned of it, they said, “Master, do you want us to call a bolt of lightning down out of the sky and incinerate them?”"}],[{"type":"prose","content":"Jesus turned on them: “Of course not!” And they traveled on to another village."}],[{"type":"prose","content":"On the road someone asked if he could go along. “I’ll go with you, wherever,” he said."}],[{"type":"prose","content":"Jesus was curt: “Are you ready to rough it? We’re not staying in the best inns, you know.”Jesus said to another, “Follow me.”"}],[{"type":"prose","content":"He said, “Certainly, but first excuse me for a couple of days, please. I have to make arrangements for my father’s funeral.”"}],[{"type":"prose","content":"Jesus refused. “First things first. Your business is life, not death. And life is urgent: Announce God’s kingdom!”"}],[{"type":"prose","content":"Then another said, “I’m ready to follow you, Master, but first excuse me while I get things straightened out at home.”"}],[{"type":"prose","content":"Jesus said, “No procrastination. No backward looks. You can’t put God’s kingdom off till tomorrow. Seize the day.”"}]]