[{"header":"Jesus Sends Out the Apostles"},{"num":9,"verse":"Jesus called the twelve apostles together and gave them power and authority over all demons and the ability to heal sicknesses. "},{"num":2,"verse":"He sent the apostles out to tell about God’s kingdom and to heal the sick. "},{"num":3,"verse":"He said to them, “Take nothing for your trip, neither a walking stick, bag, bread, money, or extra clothes. "},{"num":6,"verse":"So the apostles went out and traveled through all the towns, preaching the Good News and healing people everywhere."},{"header":"Herod Is Confused About Jesus"},{"num":7,"verse":"Herod, the governor, heard about all the things that were happening and was confused, because some people said, “John the Baptist has risen from the dead.” "},{"num":8,"verse":"Others said, “Elijah has come to us.” And still others said, “One of the prophets who lived long ago has risen from the dead.” "},{"num":9,"verse":"Herod said, “I cut off John’s head, so who is this man I hear such things about?” And Herod kept trying to see Jesus."},{"header":"More than Five Thousand Fed"},{"num":10,"verse":"When the apostles returned, they told Jesus everything they had done. Then Jesus took them with him to a town called Bethsaida where they could be alone together. "},{"num":11,"verse":"But the people learned where Jesus went and followed him. He welcomed them and talked with them about God’s kingdom and healed those who needed to be healed."},{"num":12,"verse":"Late in the afternoon, the twelve apostles came to Jesus and said, “Send the people away. They need to go to the towns and countryside around here and find places to sleep and something to eat, because no one lives in this place.”"},{"num":13,"verse":"But Jesus said to them, “You give them something to eat.”"},{"num":14,"verse":"(There were about five thousand men there.)"},{"num":15,"verse":"So the followers did this, and all the people sat down. "},{"num":16,"verse":"Then Jesus took the five loaves of bread and two fish, and looking up to heaven, he thanked God for the food. Then he divided the food and gave it to the followers to give to the people. "},{"num":17,"verse":"They all ate and were satisfied, and what was left over was gathered up, filling twelve baskets."},{"header":"Jesus Is the Christ"},{"num":18,"verse":"One time when Jesus was praying alone, his followers were with him, and he asked them, “Who do the people say I am?”"},{"num":19,"verse":"They answered, “Some say you are John the Baptist. Others say you are Elijah. And others say you are one of the prophets from long ago who has come back to life.”"},{"num":20,"verse":"Then Jesus asked, “But who do you say I am?”"},{"num":21,"verse":"Jesus warned them not to tell anyone, saying, "},{"num":23,"verse":"Jesus said to all of them, “If people want to follow me, they must give up the things they want. They must be willing to give up their lives daily to follow me. "},{"header":"Jesus Talks with Moses and Elijah"},{"num":28,"verse":"About eight days after Jesus said these things, he took Peter, John, and James and went up on a mountain to pray. "},{"num":29,"verse":"While Jesus was praying, the appearance of his face changed, and his clothes became shining white. "},{"num":30,"verse":"Then two men, Moses and Elijah, were talking with Jesus. "},{"num":31,"verse":"They appeared in heavenly glory, talking about his departure which he would soon bring about in Jerusalem. "},{"num":32,"verse":"Peter and the others were very sleepy, but when they awoke fully, they saw the glory of Jesus and the two men standing with him. "},{"num":33,"verse":"When Moses and Elijah were about to leave, Peter said to Jesus, “Master, it is good that we are here. Let us make three tents—one for you, one for Moses, and one for Elijah.” (Peter did not know what he was talking about.)"},{"num":34,"verse":"While he was saying these things, a cloud came and covered them, and they became afraid as the cloud covered them. "},{"num":35,"verse":"A voice came from the cloud, saying, “This is my Son, whom I have chosen. Listen to him!”"},{"num":36,"verse":"When the voice finished speaking, only Jesus was there. Peter, John, and James said nothing and told no one at that time what they had seen."},{"header":"Jesus Heals a Sick Boy"},{"num":37,"verse":"The next day, when they came down from the mountain, a large crowd met Jesus. "},{"num":38,"verse":"A man in the crowd shouted to him, “Teacher, please come and look at my son, because he is my only child. "},{"num":39,"verse":"An evil spirit seizes my son, and suddenly he screams. It causes him to lose control of himself and foam at the mouth. The evil spirit keeps on hurting him and almost never leaves him. "},{"num":40,"verse":"I begged your followers to force the evil spirit out, but they could not do it.”"},{"num":41,"verse":"Jesus answered, “You people have no faith, and your lives are all wrong. How long must I stay with you and put up with you? Bring your son here.”"},{"num":42,"verse":"While the boy was coming, the demon threw him on the ground and made him lose control of himself. But Jesus gave a strong command to the evil spirit and healed the boy and gave him back to his father. "},{"num":43,"verse":"All the people were amazed at the great power of God."},{"header":"Jesus Talks About His Death"},{"num":45,"verse":"But the followers did not understand what this meant; the meaning was hidden from them so they could not understand. But they were afraid to ask Jesus about it."},{"header":"Who Is the Greatest?"},{"num":46,"verse":"Jesus’ followers began to have an argument about which one of them was the greatest. "},{"num":47,"verse":"Jesus knew what they were thinking, so he took a little child and stood the child beside him. "},{"num":48,"verse":"Then Jesus said, “Whoever accepts this little child in my name accepts me. And whoever accepts me accepts the One who sent me, because whoever is least among you all is really the greatest.”"},{"header":"Anyone Not Against Us Is for Us"},{"num":49,"verse":"John answered, “Master, we saw someone using your name to force demons out of people. We told him to stop, because he does not belong to our group.”"},{"num":50,"verse":"But Jesus said to him, “Don’t stop him, because whoever is not against you is for you.”"},{"header":"A Town Rejects Jesus"},{"num":51,"verse":"When the time was coming near for Jesus to depart, he was determined to go to Jerusalem. "},{"num":52,"verse":"He sent some messengers ahead of him, who went into a town in Samaria to make everything ready for him. "},{"num":53,"verse":"But the people there would not welcome him, because he was set on going to Jerusalem. "},{"num":54,"verse":"When James and John, followers of Jesus, saw this, they said, “Lord, do you want us to call fire down from heaven and destroy those people?”"},{"num":55,"verse":"But Jesus turned and scolded them. [And Jesus said, “You don’t know what kind of spirit you belong to. "},{"header":"Following Jesus"},{"num":57,"verse":"As they were going along the road, someone said to Jesus, “I will follow you any place you go.”"},{"num":58,"verse":"Jesus said to them, “The foxes have holes to live in, and the birds have nests, but the Son of Man has no place to rest his head.”"},{"num":59,"verse":"Jesus said to another man, “Follow me!”"},{"num":60,"verse":"But Jesus said to him, “Let the people who are dead bury their own dead. You must go and tell about the kingdom of God.”"},{"num":61,"verse":"Another man said, “I will follow you, Lord, but first let me go and say good-bye to my family.”"},{"num":62,"verse":"Jesus said, “Anyone who begins to plow a field but keeps looking back is of no use in the kingdom of God.”"}]