[[],[{"type":"header","content":"The Mission of the Twelve"},{"type":"prose","content":"Then Jesus called the twelve together and gave them power and authority over all demons and to cure diseases, "}],[{"type":"prose","content":"and he sent them out to proclaim the kingdom of God and to heal. "}],[{"type":"prose","content":"He said to them, “Take nothing for your journey, no staff, nor bag, nor bread, nor money—not even an extra tunic. "}],[{"type":"prose","content":"Whatever house you enter, stay there, and leave from there. "}],[{"type":"prose","content":"Wherever they do not welcome you, as you are leaving that town shake the dust off your feet as a testimony against them.” "}],[{"type":"prose","content":"They departed and went through the villages, bringing the good news and curing diseases everywhere."}],[{"type":"header","content":"Herod’s Perplexity"},{"type":"prose","content":"Now Herod the ruler heard about all that had taken place, and he was perplexed, because it was said by some that John had been raised from the dead, "}],[{"type":"prose","content":"by some that Elijah had appeared, and by others that one of the ancient prophets had arisen. "}],[{"type":"prose","content":"Herod said, “John I beheaded; but who is this about whom I hear such things?” And he tried to see him."}],[{"type":"header","content":"Feeding the Five Thousand"},{"type":"prose","content":"On their return the apostles told Jesus all they had done. He took them with him and withdrew privately to a city called Bethsaida. "}],[{"type":"prose","content":"When the crowds found out about it, they followed him; and he welcomed them, and spoke to them about the kingdom of God, and healed those who needed to be cured."}],[{"type":"prose","content":"The day was drawing to a close, and the twelve came to him and said, “Send the crowd away, so that they may go into the surrounding villages and countryside, to lodge and get provisions; for we are here in a deserted place.” "}],[{"type":"prose","content":"But he said to them, “You give them something to eat.” They said, “We have no more than five loaves and two fish—unless we are to go and buy food for all these people.” "}],[{"type":"prose","content":"For there were about five thousand men. And he said to his disciples, “Make them sit down in groups of about fifty each.” "}],[{"type":"prose","content":"They did so and made them all sit down. "}],[{"type":"prose","content":"And taking the five loaves and the two fish, he looked up to heaven, and blessed and broke them, and gave them to the disciples to set before the crowd. "}],[{"type":"prose","content":"And all ate and were filled. What was left over was gathered up, twelve baskets of broken pieces."}],[{"type":"header","content":"Peter’s Declaration about Jesus"},{"type":"prose","content":"Once when Jesus was praying alone, with only the disciples near him, he asked them, “Who do the crowds say that I am?” "}],[{"type":"prose","content":"They answered, “John the Baptist; but others, Elijah; and still others, that one of the ancient prophets has arisen.” "}],[{"type":"prose","content":"He said to them, “But who do you say that I am?” Peter answered, “The Messiah of God.”"}],[{"type":"header","content":"Jesus Foretells His Death and Resurrection"},{"type":"prose","content":"He sternly ordered and commanded them not to tell anyone, "}],[{"type":"prose","content":"saying, “The Son of Man must undergo great suffering, and be rejected by the elders, chief priests, and scribes, and be killed, and on the third day be raised.”"}],[{"type":"prose","content":"Then he said to them all, “If any want to become my followers, let them deny themselves and take up their cross daily and follow me. "}],[{"type":"prose","content":"For those who want to save their life will lose it, and those who lose their life for my sake will save it. "}],[{"type":"prose","content":"What does it profit them if they gain the whole world, but lose or forfeit themselves? "}],[{"type":"prose","content":"Those who are ashamed of me and of my words, of them the Son of Man will be ashamed when he comes in his glory and the glory of the Father and of the holy angels. "}],[{"type":"prose","content":"But truly I tell you, there are some standing here who will not taste death before they see the kingdom of God.”"}],[{"type":"header","content":"The Transfiguration"},{"type":"prose","content":"Now about eight days after these sayings Jesus took with him Peter and John and James, and went up on the mountain to pray. "}],[{"type":"prose","content":"And while he was praying, the appearance of his face changed, and his clothes became dazzling white. "}],[{"type":"prose","content":"Suddenly they saw two men, Moses and Elijah, talking to him. "}],[{"type":"prose","content":"They appeared in glory and were speaking of his departure, which he was about to accomplish at Jerusalem. "}],[{"type":"prose","content":"Now Peter and his companions were weighed down with sleep; but since they had stayed awake, they saw his glory and the two men who stood with him. "}],[{"type":"prose","content":"Just as they were leaving him, Peter said to Jesus, “Master, it is good for us to be here; let us make three dwellings, one for you, one for Moses, and one for Elijah”—not knowing what he said. "}],[{"type":"prose","content":"While he was saying this, a cloud came and overshadowed them; and they were terrified as they entered the cloud. "}],[{"type":"prose","content":"Then from the cloud came a voice that said, “This is my Son, my Chosen; listen to him!” "}],[{"type":"prose","content":"When the voice had spoken, Jesus was found alone. And they kept silent and in those days told no one any of the things they had seen."}],[{"type":"header","content":"Jesus Heals a Boy with a Demon"},{"type":"prose","content":"On the next day, when they had come down from the mountain, a great crowd met him. "}],[{"type":"prose","content":"Just then a man from the crowd shouted, “Teacher, I beg you to look at my son; he is my only child. "}],[{"type":"prose","content":"Suddenly a spirit seizes him, and all at once he shrieks. It convulses him until he foams at the mouth; it mauls him and will scarcely leave him. "}],[{"type":"prose","content":"I begged your disciples to cast it out, but they could not.” "}],[{"type":"prose","content":"Jesus answered, “You faithless and perverse generation, how much longer must I be with you and bear with you? Bring your son here.” "}],[{"type":"prose","content":"While he was coming, the demon dashed him to the ground in convulsions. But Jesus rebuked the unclean spirit, healed the boy, and gave him back to his father. "}],[{"type":"prose","content":"And all were astounded at the greatness of God."},{"type":"header","content":"Jesus Again Foretells His Death"},{"type":"prose","content":"While everyone was amazed at all that he was doing, he said to his disciples, "}],[{"type":"prose","content":"“Let these words sink into your ears: The Son of Man is going to be betrayed into human hands.” "}],[{"type":"prose","content":"But they did not understand this saying; its meaning was concealed from them, so that they could not perceive it. And they were afraid to ask him about this saying."}],[{"type":"header","content":"True Greatness"},{"type":"prose","content":"An argument arose among them as to which one of them was the greatest. "}],[{"type":"prose","content":"But Jesus, aware of their inner thoughts, took a little child and put it by his side, "}],[{"type":"prose","content":"and said to them, “Whoever welcomes this child in my name welcomes me, and whoever welcomes me welcomes the one who sent me; for the least among all of you is the greatest.”"}],[{"type":"header","content":"Another Exorcist"},{"type":"prose","content":"John answered, “Master, we saw someone casting out demons in your name, and we tried to stop him, because he does not follow with us.” "}],[{"type":"prose","content":"But Jesus said to him, “Do not stop him; for whoever is not against you is for you.”"}],[{"type":"header","content":"A Samaritan Village Refuses to Receive Jesus"},{"type":"prose","content":"When the days drew near for him to be taken up, he set his face to go to Jerusalem. "}],[{"type":"prose","content":"And he sent messengers ahead of him. On their way they entered a village of the Samaritans to make ready for him; "}],[{"type":"prose","content":"but they did not receive him, because his face was set toward Jerusalem. "}],[{"type":"prose","content":"When his disciples James and John saw it, they said, “Lord, do you want us to command fire to come down from heaven and consume them?” "}],[{"type":"prose","content":"But he turned and rebuked them. "}],[{"type":"prose","content":"Then they went on to another village."}],[{"type":"header","content":"Would-Be Followers of Jesus"},{"type":"prose","content":"As they were going along the road, someone said to him, “I will follow you wherever you go.” "}],[{"type":"prose","content":"And Jesus said to him, “Foxes have holes, and birds of the air have nests; but the Son of Man has nowhere to lay his head.” "}],[{"type":"prose","content":"To another he said, “Follow me.” But he said, “Lord, first let me go and bury my father.” "}],[{"type":"prose","content":"But Jesus said to him, “Let the dead bury their own dead; but as for you, go and proclaim the kingdom of God.” "}],[{"type":"prose","content":"Another said, “I will follow you, Lord; but let me first say farewell to those at my home.” "}],[{"type":"prose","content":"Jesus said to him, “No one who puts a hand to the plow and looks back is fit for the kingdom of God.”"}]]