[{"num":9,"verse":"And having called together the Shneym Asar, Rebbe Melech HaMoshiach gave to them koach (power) and samchut (authority) over all the shedim and to give refuah (healing) to their illnesses."},{"num":2,"verse":"Rebbe Melech HaMoshiach sent them out as his Shlichim to preach the Malchut Hashem and to give refuah to the cholim,"},{"num":3,"verse":"And Rebbe Melech HaMoshiach said to them, Take nothing for the journey, neither walking stick nor a schnorrer’s (beggar’s) sack nor lechem nor kesef, nor an extra kaftan."},{"num":4,"verse":"And into whatever bais you may enter, remain there, and from there go out."},{"num":5,"verse":"And as many as do not receive you, going out from that shtetl, shake off the dust from your feet for an edut against them."},{"num":6,"verse":"And they departed and were itinerating throughout the shtetlach, preaching the Besuras HaGeulah and healing everywhere."},{"num":7,"verse":"Now Herod the Tetrarch heard all the things happening and he was perplexed because it was said by some that Yochanan had experienced his Techiyah from HaMesim and come back;"},{"num":8,"verse":"by some also that Eliyahu Hanavi had appeared; but by others that some navi of the ancients arose."},{"num":9,"verse":"But Herod said, Yochanan I beheaded. Who then is this about whom I hear such things? And he was seeking to see him."},{"num":10,"verse":"And having returned, Rebbe Melech HaMoshiach’s Shlichim told him what things they did. And having taken them for a yechidus, Rebbe Melech HaMoshiach withdrew to a shtetl being called Beit-Tzaidah."},{"num":11,"verse":"But the multitudes, having realized this, followed him. And having given them a kabbalat panim (welcome), Rebbe Melech HaMoshiach was speaking to them about the Malchut Hashem, and to the ones having need of it, Rebbe Melech HaMoshiach was giving refuah."},{"num":12,"verse":"Now the day began to decline. And having approached, the Shneym Asar said to Rebbe Melech HaMoshiach, Send away the multitude, so that having gone into the surrounding shtetlach and farms, they may find lodging and may find provisions, for here we are in a desolate place."},{"num":13,"verse":"And Rebbe Melech HaMoshiach said to them, You give them [something] to eat. But they said, There are not to us more than chamesh kikrot (loaves) and dagim, shenayim, unless we go and buy for all this people okhel (food)."},{"num":14,"verse":"For there were about chamesh elafim anashim (five thousand). But Rebbe Melech HaMoshiach said to his talmidim, Have them recline [as at a farbrengen (inspirational gathering)], and chamishim (fifty) in a group. [TEHILLIM 23:2]"},{"num":15,"verse":"And Rebbe Melech HaMoshiach’s talmidim did so, and all reclined [as at tish]."},{"num":16,"verse":"And having taken the chamesh kikrot and the shnei hadagim, and having looked up to Shomayim, Rebbe Melech HaMoshiach said a bracha over them, and offered the betziat halechem, and was giving to the talmidim to set before the multitude."},{"num":17,"verse":"And they ate and all were satisfied, and they picked up shirayim, shneym asar baskets full."},{"num":18,"verse":"And it came about while he was davening alone, with only his talmidim with him, he questioned them, saying, Whom do the multitudes declare me to be?"},{"num":19,"verse":"And in reply they said, Yochanan of the tevilah of teshuva; but others, Eliyahu Hanavi; and others, that a certain navi of the ancients has come back to life."},{"num":20,"verse":"And he said to them, And you, who do you declare me to be? And in reply, Kefa said, The Rebbe, Melech HaMoshiach of Hashem."},{"num":21,"verse":"And having warned them, he gave orders to tell no one this,"},{"num":22,"verse":"Saying, It is necessary for the Ben HaAdam [Moshiach, DANIEL 7:13-14] to suffer much and to be rejected by the Ziknei HaAm and Rashei Hakohanim and Sofrim and to be killed, and after his histalkus (passing), on Yom HaShelishi to undergo the Techiyas HaMoshiach."},{"num":23,"verse":"And Rebbe Melech HaMoshiach was saying to all, If anyone wishes to come after me, let him deny himself and lift up his etz shel hakarav atzmo yom yom and let him follow me."},{"num":24,"verse":"For whoever wishes to save his nefesh will lose it. But whoever loses his nefesh on my account will save it."},{"num":25,"verse":"For what is the revach (profit) to a ben Adam who has gained the whole of the Olam Hazeh, but has lost his own self, forfeited his neshamah?"},{"num":26,"verse":"For whoever has bushah (shame) toward me and my dvarim, this one the Ben HaAdam (Moshiach, DANIEL 7:13-14) will be ashamed of, when Moshiach comes in his Kavod and the Kavod of HaAv of him and of the malachim hakedoshim (holy angels)."},{"num":27,"verse":"But I say to you, Omein, there are some standing here who will by no means taste mavet until they see the Malchut Hashem."},{"num":28,"verse":"And it came to pass, about a week after these divrei Moshiach, that when he had taken Kefa and Yochanan and Yaakov, Rebbe Melech HaMoshiach went up to the har to daven."},{"num":29,"verse":"And it came about that while Rebbe Melech HaMoshiach davens, the appearance of his face became different and his kaftan and all his clothing became dazzling white."},{"num":30,"verse":"And two men were conversing with Rebbe Melech HaMoshiach, and these two men were Moshe Rabbeinu and Eliyahu HaNavi,"},{"num":31,"verse":"Who appeared in kavod and were speaking of Moshiach’s Litziat Exodus, which he was about to fulfill in Yerushalayim."},{"num":32,"verse":"But Kefa and the ones with him had been weighed down with sleep. And having awakened fully, they saw his kavod and the two men standing with him."},{"num":33,"verse":"And it came about, just as the men departed from Rebbe Melech HaMoshiach, Kefa said, Adoni, it is good for us to be here; let us make shalosh sukkot, one for you and one for Moshe Rabbeinu and one for Eliyahu HaNavi. (Kefa did not know what he was saying.)"},{"num":34,"verse":"And while Kefa was saying these things, an anan (cloud) came and was overshadowing them, and while they entered into the anan they were afraid."},{"num":35,"verse":"And a bat kol came from the anan (cloud), saying ZEH BENI BECHIRI, ELAV TISHMAUN (This is my Son the Chosen One, listen to him. [YESHAYAH 42:1; TEHILLIM 2:7]"},{"num":36,"verse":"When the bat kol became silent, Rebbe Melech HaMoshiach was found alone. And they were silent, and reported to no one in those yamim anything of what they had seen."},{"num":37,"verse":"And it came about on the following day, when they had descended from the har (mountain), a large throng met Rebbe Melech HaMoshiach."},{"num":38,"verse":"And an ish from the multitude cried out, saying, Rabbi, I beg you to look at beni (my son), for to me he is a ben yachid (only son),"},{"num":39,"verse":"And a shed seizes him and suddenly shrieking and lets out a shrai and throws the bocher into a convulsion with foam at the mouth and it mauls him and will scarcely depart from him."},{"num":40,"verse":"And I begged your talmidim that they might cast out the shed, and they were not able."},{"num":41,"verse":"And in reply, Rebbe Melech HaMoshiach said, O perverse dor (generation) without emunah, until when will I be with you, and until when will I put up with you? Bring your ben here. [DEVARIM 32:5]"},{"num":42,"verse":"Even now as the bocher was approaching Rebbe Melech HaMoshiach, the shed threw him down and convulsed him. But Rebbe Melech HaMoshiach rebuked the shed (the ruach hatumah) and gave refuah to the bocher, and gave him back to his abba."},{"num":43,"verse":"And all were amazed at the gedulat Hashem. And while all were beholding the peledike way he was doing everything, he said to his talmidim,"},{"num":44,"verse":"Let these divrei Hashem lodge in your ears: for the Ben HaAdam [Moshiach, DANIEL 7:13] is about to be delivered into the hands of Bnei Adam."},{"num":45,"verse":"But they had no binah concerning this dvar of Rebbe Melech HaMoshiach, and it had been nistar from them in order that they might not have binah, and they were afraid to ask him about this dvar."},{"num":46,"verse":"Now an argument arose among his talmidim, as to who would be the greatest."},{"num":47,"verse":"And Moshiach, having perceived the machshavah of their levavot, took a yeled into his arms and stood the yeled next to him."},{"num":48,"verse":"And Rebbe Melech HaMoshiach said to them, Whoever receives this yeled in ha-Shem of me [Moshiach], is mekabel (receiving, accepting) of me. And whoever is mekabel of me is mekabel of the One [Hashem] who sent me. For whoever is the least among all of you, this one is the Gadol."},{"num":49,"verse":"And in reply Yochanan said, Adoni, we saw someone casting out shedim bShem of you and we were trying to stop him, because he is not following as one of the anshei shlomeinu (men of our fraternity)."},{"num":50,"verse":"But Rebbe Melech HaMoshiach said to him, Do not stop him. For whoever is not against you, is for you."},{"num":51,"verse":"And it came about that as the Yom of Rebbe Melech HaMoshiach’s aliyah ascent to Shomayim approaches, he set his face bedavka (deliberately) and resolutely to go up to Yerushalayim."},{"num":52,"verse":"And Rebbe Melech HaMoshiach sent messengers ahead of him. And having gone, they entered into a village of Shomron in order to make arrangements for him."},{"num":53,"verse":"And the people of Shomron were not mekabel Rebbe Melech HaMoshiach, because his face was set to go to Yerushalayim."},{"num":54,"verse":"And when Rebbe Melech HaMoshiach’s talmidim, Yaakov and Yochanan, witnessed this, they said, Adoneinu, do you want that we should call eish to come down from Shomayim to consume them? [MELACHIM BAIS 1:10,12]"},{"num":55,"verse":"And, having turned around, Rebbe Melech HaMoshiach rebuked them."},{"num":56,"verse":"And they went to another village."},{"num":57,"verse":"And as they were going baderech (on the road), a certain one said to Rebbe Melech HaMoshiach, I will follow you wherever you go."},{"num":58,"verse":"And Rebbe Melech HaMoshiach said to him, Foxes have dens, and the OPH HASHOMAYIM (birds of heaven, IYOV 7:13-14) have nests, but the Ben HaAdam (Moshiach, DANIEL 7:13-14) does not have a place where he may lay down his head."},{"num":59,"verse":"And he said to another, Follow me. But the ish said, Adoni, allow me to go first and bury the Av of me."},{"num":60,"verse":"But Rebbe Melech HaMoshiach said to him, Leave the mesim (dead ones, spiritually unregenerate ones without hitkhadshut) to bury their mesim (dead ones), but you go and proclaim the Malchut Hashem."},{"num":61,"verse":"And another said also, I will follow you, Adoni. But first allow me to say lhitraot to the ones in my bais. [MELACHIM ALEF 19:20]"},{"num":62,"verse":"But Rebbe Melech HaMoshiach said to him, No one having put his hand upon the plow yet looking back to the things behind is fit for the Malchut Hashem. [BERESHIS 19:26]"}]