[{"num":9,"verse":"Jesus called his twelve disciples together. He gave them power over all the bad spirits, and power to heal sick people."},{"num":2,"verse":"He sent them out to tell people about the kingdom of God and to heal sick people."},{"num":3,"verse":"He said, `Take nothing with you for your trip. Do not take a walking stick, or a bag, or food, or money. And do not take two shirts."},{"num":4,"verse":"When you go into a certain house, stay there until you leave the town."},{"num":5,"verse":"Some people might not take you in. When you leave that town, shake the dust off your feet. That will be a sign to them.'"},{"num":6,"verse":"The disciples left and went through the towns. They told the good news and healed people everywhere."},{"num":7,"verse":"Herod the ruler heard about all that was happening. He did not know what to think. Some people said John the Baptizer had risen from death."},{"num":8,"verse":"Some people said Elijah had come back. And other people said that one of the old prophets of God had risen from death."},{"num":9,"verse":"Herod said, `I cut off John's head. Now who is this man of whom I hear such things?' He wanted to see Jesus."},{"num":10,"verse":"When the apostles came back, they told Jesus all they had done. He took them away with him and they went by themselves to a town called Bethsaida."},{"num":11,"verse":"But the people found out and they followed him. He was glad to see them and talked to them about God's kingdom. He healed those who were sick."},{"num":12,"verse":"When it was late in the day, the twelve disciples came to him. They said, `Send the people away so they can go to the towns and the farms to sleep and get something to eat. This is a lonely place.'"},{"num":13,"verse":"But Jesus said to them, `You give them food to eat.' They said, `All we have is five loaves of bread and two fish. Shall we go and buy food for all these people?'"},{"num":14,"verse":"There were about five thousand men. He said to his disciples, `Tell the people to sit down in groups of fifty.'"},{"num":15,"verse":"They did what he said, and they made all the people sit down."},{"num":16,"verse":"He took the five loaves of bread and the two fish. He looked up to heaven and thanked God for them. Then he broke the bread. He gave it to the disciples to give to the people."},{"num":17,"verse":"They all ate and had enough. They picked up twelve baskets full of pieces that were left."},{"num":18,"verse":"One day Jesus was alone talking to God. His disciples were there too. He asked them, `Who do people say I am?'"},{"num":19,"verse":"They answered, `Some people say you are John the Baptizer. Others say you are Elijah. And others say that one of the old prophets of God has risen from death.'"},{"num":20,"verse":"Jesus said, `But who do you say I am?' Peter answered, `You are the Christ sent by God.'"},{"num":21,"verse":"Jesus said to them, `Do not tell this to anyone.'"},{"num":22,"verse":"Then he went on to say, `The Son of Man will have much trouble. The leaders of the people, the chief priests, and the scribes will not believe him. He will be killed. On the third day he will be raised from death.'"},{"num":23,"verse":"And He said to all the people, `If anyone wants to come with me, he must leave what he himself wants to do. Every day he must take up his cross [be ready to die] and come with me."},{"num":24,"verse":"Anyone who tries to keep his life will lose it. And anyone who gives up his life for my sake will find it."},{"num":25,"verse":"What good will it do a man if he gets the whole world for himself but loses his life or spoils it?"},{"num":26,"verse":"If anyone is ashamed of me and the things I say, the Son of man will be ashamed of that person when he comes. The Son of man will come with his holy angels and be great like his Father."},{"num":27,"verse":"I tell you the truth. Some people are standing here who will not die before they see the kingdom of God.'"},{"num":28,"verse":"About eight days after saying these things, Jesus went up on a hill to talk with God. He took Peter, John, and James with him."},{"num":29,"verse":"As he was talking with God, he was changed. His face was different. His clothes became very white and shining."},{"num":30,"verse":"And then two men were talking with Jesus. They were Moses and Elijah."},{"num":31,"verse":"Light was shining from them. They talked about his leaving this world. That would happen when he was in Jerusalem."},{"num":32,"verse":"Peter and the others were very sleepy. They woke up and saw the light shining from Jesus. And they saw the two men standing with him."},{"num":33,"verse":"When the men were leaving Jesus, Peter said to him, `Master, it is good for us to be here. Let us make three places here, one for you, one for Moses, and one for Elijah.' Peter did not know what he was saying."},{"num":34,"verse":"As he said this, a cloud came over them. They were very much afraid when the cloud came around them."},{"num":35,"verse":"A voice in the cloud said, `This is my dear Son. Listen to him!'"},{"num":36,"verse":"The talking stopped. Then Jesus was left alone. The disciples did not say anything. They did not tell anyone at that time what they had seen."},{"num":37,"verse":"The next day they came down the hill. Many people met him."},{"num":38,"verse":"One man among them called out, `Teacher, I beg you, look at my son. He is my only child."},{"num":39,"verse":"A bad spirit takes hold of him and he screams. It throws him around and makes him foam at his mouth. It beats him badly and does not want to leave him."},{"num":40,"verse":"I begged your disciples to drive the bad spirit out, but they could not do it.'"},{"num":41,"verse":"Jesus said, `You people today do not believe. You have turned away from God. How long must I be with you? How long must I put up with you? Bring the boy here to me.'"},{"num":42,"verse":"While he was coming, the bad spirit knocked him down and threw him around. Jesus told the spirit to stop. He healed the boy and gave him back to his father."},{"num":43,"verse":"All the people were surprised to see that God has so much power. While the people were wondering about everything Jesus did, he talked to his disciples."},{"num":44,"verse":"He said, `Listen well to what I say. The Son of Man will be given over to men,'"},{"num":45,"verse":"But they did not understand what he said. The meaning was hidden from them so they would not understand it. And they were afraid to ask him about it."},{"num":46,"verse":"The disciples started talking among themselves. They quarrelled about which of them was the greatest person."},{"num":47,"verse":"Jesus knew what they were thinking. So he took a child and put him by his side."},{"num":48,"verse":"Then he said, `If anyone takes in a child like this for my sake, he takes in me. And if anyone takes in me, he takes in the one who sent me. The one who takes the least or lowest place among you is the greatest.'"},{"num":49,"verse":"John answered, `Master, we saw a man driving bad spirits out of people. He was using your name. We told him to stop because he is not one of us.'"},{"num":50,"verse":"But Jesus said, `Do not stop him. Anyone who is not against you is on your side.'"},{"num":51,"verse":"The time was near for Jesus to be taken up to heaven. Then he started off for Jerusalem. He sent messengers ahead of him."},{"num":52,"verse":"They went to one of the towns of the Samaritan people to get ready for him."},{"num":53,"verse":"But the people would not take him in because he was going to Jerusalem."},{"num":54,"verse":"When the disciples James and John saw that, they said, `Lord, do you want us to ask for fire to come down from the sky and burn them up?'"},{"num":55,"verse":"But he turned and said to them, `Stop that! You do not think about what kind of spirit you are showing."},{"num":56,"verse":"The Son of Man did not come to kill people, but to save them.' And they went on to another town."},{"num":57,"verse":"As they went along on the road, a man said to him, `I will go anywhere you go.'"},{"num":58,"verse":"Jesus said, `Foxes have holes to live in. Birds have nests. But the Son of Man has no place to lie down to rest.'"},{"num":59,"verse":"Jesus said to another man who followed him, `Come with me.' But the man said, `Lord, let me go first and bury my father.'"},{"num":60,"verse":"Jesus said to him, `Let those who are dead bury their own dead people. As for you, go and tell people about God's kingdom.'"},{"num":61,"verse":"Another man said to Jesus, `Sir, I will go with you. But let me go first to my home and tell them I am going.'"},{"num":62,"verse":"Jesus said to him, `Any person who starts doing something and then keeps looking back is not fit for the kingdom of God.'"}]