[{"num":27,"verse":"Jotham was of five and twenty years (Jotham was twenty-five years old), when he began to reign, and he reigned sixteen years in Jerusalem; the name of his mother was Jerushah, the daughter of Zadok."},{"num":2,"verse":"He did that, that was rightful before the Lord, by all things which Uzziah, his father, had done; except that he entered not into the temple of the Lord, and the people trespassed yet. (And he did what was right before the Lord, as by all the things which his father Uzziah had done; but he did not enter into the Temple of the Lord like his father did, and the people still continued to trespass.)"},{"num":3,"verse":"He builded the high gate of the house of the Lord, and he builded many things in the wall of Ophel; (He built the Upper Gate of the House of the Lord, and he built many things on the wall of Ophel;)"},{"num":4,"verse":"also he builded cities in the hills of Judah, and he builded castles and towers in forests. (and he built cities in the hill country of Judah, and forts and towers in the forests.)"},{"num":5,"verse":"He fought against the king of the sons of Ammon, and overcame him; and the sons of Ammon gave to him in that time an hundred talents of silver, and ten thousand cors of barley, and so many of wheat; the sons of Ammon gave these things to him in the second, and the third years. (He fought against the king of the Ammonites, and overcame him; and the Ammonites gave him at that time a hundred talents of silver, and ten thousand cors of barley, and as many cors of wheat; the Ammonites gave these things to him in the second, and the third years.)"},{"num":6,"verse":"And Jotham was made strong, for he had (ad)dressed his ways before the Lord his God. (And Jotham was made strong, for he had directed his ways before the Lord his God, that is, he obeyed him.)"},{"num":7,"verse":"Forsooth the residue of [the] words of Jotham, and all his battles, and works, be written in the book of the kings of Israel and of Judah. (And the rest of the deeds of Jotham, and all his battles, and works, be written in The Book of the Kings of Judah and of Israel.)"},{"num":8,"verse":"He was of five and twenty years (He was twenty-five years old), when he began to reign, and he reigned sixteen years in Jerusalem."},{"num":9,"verse":"And Jotham slept with his fathers, and they buried him in the city of David; and Ahaz, his son, reigned for him."}]