[{"num":10,"verse":"5 The second Tables put in the Ark. 8 The tribe of Levi is dedicated to the service of the Tabernacle. 12 What the Lord requireth of his. 16 The circumcision of the heart. 17 God regardeth not the person. 21The Lord is the praise of Israel."},{"num":1,"verse":"In the same time the Lord said unto me, Hew thee two tables of stone like unto the first, and come up unto me into the mount, and make thee an Ark of wood,"},{"num":2,"verse":"And I will write upon the tables, the words that were upon the first Tables, which thou breakest, and thou shalt put them in the Ark."},{"num":3,"verse":"And I made an Ark of Shittim wood, and hewed two tables of stone like unto the first, and went up into the mountain, and the two Tables in mine hand."},{"num":4,"verse":"Then he wrote upon the Tables according to the first writing, (the ten commandments, which the Lord spake unto you in the mount out of the midst of the fire, in the day of the assembly) and the Lord gave them unto me."},{"num":5,"verse":"And I departed and came down from the Mount, and put the Tables in the Ark which I had made: and there they be, as the Lord commanded me."},{"num":6,"verse":"¶ And the children of Israel took their journey from Beeroth of the children of Jaakan, to Moserah, where Aaron died, and was buried, and Eleazar his son became Priest in his stead."},{"num":7,"verse":"¶ From thence they departed unto Gudgodah, and from Gudgodah to Jotbathah, a land of running waters."},{"num":8,"verse":"¶ The same time the Lord separated the tribe of Levi to bear the Ark of the Covenant of the Lord, and to stand before the Lord, to minister unto him, and to bless in his Name unto this day."},{"num":9,"verse":"Wherefore Levi hath no part nor inheritance with his brethren: for the Lord is his inheritance, as the Lord thy God hath promised him."},{"num":10,"verse":"And I tarried in the mount, as at the first time, forty days and forty nights, and the Lord heard me at that time also, and the Lord would not destroy thee."},{"num":11,"verse":"But the Lord said unto me, Arise, go forth in the journey before the people, that they may go in and possess the land, which I sware unto their fathers to give unto them."},{"num":12,"verse":"¶ And now, Israel, what doth the Lord thy God require of thee, but to fear the Lord thy God, to walk in all his ways, and to love him, and to serve the Lord thy God with all thine heart, and with all thy soul?"},{"num":13,"verse":"That thou keep the commandments of the Lord and his ordinances, which I command thee this day, for thy wealth?"},{"num":14,"verse":"Behold, heaven, and the heaven of heavens is the Lord’s thy God, and the earth, with all that therein is."},{"num":15,"verse":"Notwithstanding, the Lord set his delight in thy fathers to love them, and did choose their seed after them, even you above all people, as appeareth this day."},{"num":16,"verse":"Circumcise therefore the foreskin of your heart, and harden your necks no more."},{"num":17,"verse":"For the Lord your God is God of gods, and Lord of lords, a great God, mighty and terrible, which accepteth no persons, nor taketh reward:"},{"num":18,"verse":"Who doeth right unto the fatherless and widow, and loveth the stranger, giving him food and raiment."},{"num":19,"verse":"Love ye therefore the stranger: for ye were strangers in the land of Egypt."},{"num":20,"verse":"Thou shalt fear the Lord thy God: thou shalt serve him, and thou shalt cleave unto him, and shalt swear by his Name."},{"num":21,"verse":"He is thy praise, and he is thy God, that hath done for thee these great and terrible things, which thine eyes have seen."},{"num":22,"verse":"Thy fathers went down into Egypt with seventy persons, and now the Lord thy God hath made thee, as the stars of the heaven in multitude."}]