[{"num":10,"verse":"¶ At that time the LORD said unto me, Hew thee two tables of stone like unto the first and come up unto me into the mount and make thee an ark of wood,"},{"num":2,"verse":"and I will write on the tables the words that were in the first tables which thou didst brake, and thou shalt put them in the ark."},{"num":3,"verse":"And I made an ark of cedar wood and hewed two tables of stone like unto the first, and went up into the mount, having the two tables in my hand."},{"num":4,"verse":"And he wrote on the tables, according to the first writing, the ten words which the LORD spoke unto you in the mount out of the midst of the fire in the day of the assembly; and the LORD gave them unto me."},{"num":5,"verse":"And I turned and came down from the mount and put the tables in the ark which I had made; and there they are, as the LORD commanded me."},{"num":6,"verse":"(After this, the sons of Israel took their journey from Beeroth of the sons of Jaakan to Mosera; there Aaron died, and there he was buried; and Eleazar, his son, received the priesthood in his stead."},{"num":7,"verse":"From there they journeyed unto Gudgodah and from Gudgodah to Jotbath, a land of rivers of waters."},{"num":8,"verse":"At that time the LORD separated the tribe of Levi to bear the ark of the covenant of the LORD, to stand before the LORD to minister unto him, and to bless in his name, unto this day."},{"num":9,"verse":"Therefore, Levi had no part nor inheritance with his brethren; the LORD is his inheritance, according as the LORD thy God said unto him.)"},{"num":10,"verse":"And I stayed in the mount, like the first time, forty days and forty nights; and the LORD hearkened unto me at that time also, and the LORD did not desire to destroy thee."},{"num":11,"verse":"And the LORD said unto me, Arise, take thy journey before the people that they may enter in and inherit the land, which I swore unto their fathers to give unto them."},{"num":12,"verse":"¶ And now, Israel, what does the LORD thy God require of thee, but to fear the LORD thy God, to walk in all his ways and to love him and to serve the LORD thy God with all thy heart and with all thy soul,"},{"num":13,"verse":"to keep the commandments of the LORD and his statutes, which I command thee this day for thy good?"},{"num":14,"verse":"Behold, the heavens and the heaven of heavens are of the LORD thy God, the earth also, with all that is therein."},{"num":15,"verse":"The LORD delighted only in thy fathers to love them, and he chose their seed after them, even you from among all the peoples, as it is this day."},{"num":16,"verse":"Circumcise, therefore, the foreskin of your heart, and no longer be stiffnecked."},{"num":17,"verse":"For the LORD your God is God of gods and Lord of lords, a great God, mighty, and terrible, who makes no exception of persons, nor takes a bribe;"},{"num":18,"verse":"he executes the rights of the fatherless and the widow and also loves the stranger, giving him food and clothing."},{"num":19,"verse":"Ye shall love, therefore, the stranger, for ye were strangers in the land of Egypt."},{"num":20,"verse":"Thou shalt fear the LORD thy God; him shalt thou serve, and to him shalt thou cleave and swear by his name."},{"num":21,"verse":"He shall be thy praise, and he shall be thy God, that has done with thee these great and terrible things, which thine eyes have seen."},{"num":22,"verse":"Thy fathers went down into Egypt with seventy souls, and now the LORD thy God has made thee as the stars of heaven in multitude."}]