[[],[{"type":"header","content":"The Opportunity to Begin Again"},{"type":"prose","content":"At that same time the  said to me, “Carve out for yourself two stone tablets like the first ones and come up the mountain to me; also make for yourself a wooden ark. "}],[{"type":"prose","content":"I will write on the tablets the same words that were on the first tablets you broke, and you must put them into the ark.” "}],[{"type":"prose","content":"So I made an ark of acacia wood and carved out two stone tablets just like the first ones. Then I went up the mountain with the two tablets in my hands. "}],[{"type":"prose","content":"The  then wrote on the tablets the same words, the Ten Commandments, which he had spoken to you at the mountain from the middle of the fire at the time of that assembly, and he gave them to me. "}],[{"type":"prose","content":"Then I turned, went down the mountain, and placed the tablets into the ark I had made—they are still there, just as the  commanded me."},{"type":"header","content":"Conclusion of the Historical Résumé"}],[{"type":"prose","content":"During those days the Israelites traveled from Beeroth Bene Jaakan to Moserah. There Aaron died and was buried, and his son Eleazar became priest in his place. "}],[{"type":"prose","content":"From there they traveled to Gudgodah, and from Gudgodah to Jotbathah, a place of flowing streams. "}],[{"type":"prose","content":"At that time the  set apart the tribe of Levi to carry the ark of the ’s covenant, to stand before the  to serve him, and to formulate blessings in his name, as they do to this very day. "}],[{"type":"prose","content":"Therefore Levi has no allotment or inheritance among his brothers; the  is his inheritance just as the  your God told him. "}],[{"type":"prose","content":"As for me, I stayed at the mountain as I did the first time, forty days and nights. The  listened to me that time as well and decided not to destroy you. "}],[{"type":"prose","content":"Then he said to me, “Get up, set out leading the people so they may go and possess the land I promised to give to their ancestors.”"},{"type":"header","content":"An Exhortation to Love Both God and People"}],[{"type":"prose","content":"Now, Israel, what does the  your God require of you except to revere him, to obey all his commandments, to love him, to serve him with all your mind and being, "}],[{"type":"prose","content":"and to keep the ’s commandments and statutes that I am giving you today for your own good? "}],[{"type":"prose","content":"The heavens—indeed the highest heavens—belong to the  your God, as does the earth and everything in it. "}],[{"type":"prose","content":"However, only to your ancestors did he show his loving favor, and he chose you, their descendants, from all peoples—as is apparent today. "}],[{"type":"prose","content":"Therefore, cleanse your hearts and stop being so stubborn! "}],[{"type":"prose","content":"For the  your God is God of gods and Lord of lords, the great, mighty, and awesome God who is unbiased and takes no bribe, "}],[{"type":"prose","content":"who justly treats the orphan and widow, and who loves resident foreigners, giving them food and clothing. "}],[{"type":"prose","content":"So you must love the resident foreigner because you were foreigners in the land of Egypt. "}],[{"type":"prose","content":"Revere the  your God, serve him, be loyal to him, and take oaths only in his name. "}],[{"type":"prose","content":"He is the one you should praise; he is your God, the one who has done these great and awesome things for you that you have seen. "}],[{"type":"prose","content":"When your ancestors went down to Egypt, they numbered only seventy, but now the  your God has made you as numerous as the stars of the sky."}]]