[{"header":"A Prophecy about the Future"},{"num":4,"verse":"Now the Spirit says clearly that in the last times some people will abandon the faith by following deceitful spirits, the teachings of demons, "},{"num":2,"verse":"and the hypocrisy of liars, whose consciences have been burned by a hot iron. "},{"num":3,"verse":"They will try to stop people from marrying and from eating certain foods, which God created to be received with thanksgiving by those who believe and know the truth. "},{"num":4,"verse":"For everything God created is good, and nothing should be rejected if it is received with thanksgiving, "},{"num":5,"verse":"because it is sanctified by the word of God and prayer."},{"header":"How to be a Good Servant of the Messiah Jesus"},{"num":6,"verse":"If you continue to point these things out to the brothers, you will be a good servant of the Messiah Jesus, nourished by the words of the faith and the healthy teaching that you have followed closely. "},{"num":7,"verse":"Do not have anything to do with godless myths and fables of old women. Instead, train yourself to be godly. "},{"num":8,"verse":"Physical exercise is of limited value, but"},{"num":9,"verse":"This is a trustworthy saying that deserves complete acceptance. "},{"num":10,"verse":"To this end we work hard and struggle, because we have set our hope on the living God, who is the Savior of all people, that is, of those who believe."},{"num":11,"verse":"These are the things you must insist on and teach. "},{"num":12,"verse":"Do not let anyone look down on you because you are young, but be an example for other believers in your speech, behavior, love, faithfulness, and purity. "},{"num":13,"verse":"Until I arrive, give your full concentration to the public reading of Scripture, to exhorting, and to teaching. "},{"num":14,"verse":"Do not neglect the gift that is in you, which was given to you through prophecy when the elders laid their hands on you. "},{"num":15,"verse":"Think on these things. Devote your life to them so that everyone can see your progress. "},{"num":16,"verse":"Pay close attention to your life and your teaching. Persevere in these things, because if you do so, you will save both yourself and those who listen to you."}]