[{"num":4,"verse":"The Spirit speaks clearly that in the latter times some will depart from the faith, and will give heed to spirits of error, and to devilish teaching "},{"num":2,"verse":"by those who speak falsely through hypocrisy, who have their consciences marked with an hot iron, "},{"num":3,"verse":"forbidding to marry, and commanding to abstain from foods that God has created to be received with thanksgiving by those who believe and know the truth. "},{"num":4,"verse":"For everything God created is good, and nothing to be refused, if it be received with thanksgiving. "},{"num":5,"verse":"For it is sanctified by the word of God and prayer. "},{"num":6,"verse":"If you put the brethren in mind of these things, you will be a good minister of Jesus Christ, who has been nourished up in the words of the faith and good teaching, which teaching you have continually followed. "},{"num":7,"verse":"But cast away unspiritual and old wives’ tales."},{"num":8,"verse":"For bodily exercise is of some benefit, but godliness is fruitful in all things, having promises for the life that is now and for the life to come. "},{"num":9,"verse":"This is a sure saying, and worthy to be received by all. "},{"num":10,"verse":"It is for this that we labour and suffer rebuke – because we believe in the living God, who is the saviour of all men, but especially of those who believe. "},{"num":11,"verse":"Such things command and teach."},{"num":12,"verse":"Let no one dishonour your youth, but be to those who believe an example, in word, in conduct, in love, in spirit, in faith, and in pureness."},{"num":13,"verse":"Until I come, attend to reading, to exhortation, and to teaching. "},{"num":14,"verse":"Do not neglect the gift that is in you, which was given to you through prophecy and with the laying on of the hands of an elder. "},{"num":15,"verse":"Be diligent in these things, and give yourself to them, so that it may be seen how you bring profit in all things. "},{"num":16,"verse":"Take heed to yourself and to the doctrine, and continue therein. For if you will so do, you will preserve yourself and those who hear you."}]