[{"num":4,"verse":"The Spirit of God says very plainly that in later times some people will stop believing. They will listen to other spirits that fool them, and to the teaching of bad spirits."},{"num":2,"verse":"Men will tell lies and make people believe they are something when they are not. These men will have made their hearts so hard that they will not know they are doing wrong."},{"num":3,"verse":"They will teach people that they should not marry. They will teach them not to eat some kinds of food. God made the food and he wanted people to take it and thank him for it. Those who believe and know what is true do this."},{"num":4,"verse":"Everything that God has made for food is good. It is all right to eat it if people thank God for it."},{"num":5,"verse":"God's word and asking him to bless the food makes it good for people to eat."},{"num":6,"verse":"Tell the Christian brothers and sisters these things and you will do the work of Christ Jesus well. Your own heart will be fed by the things you have believed and the good teaching you have followed."},{"num":7,"verse":"Have nothing to do with foolish stories. Make yourself strong in the things that please God."},{"num":8,"verse":"`To make the body strong helps a little, but the things of God help us in all ways. The things of God promise us life now and life in heaven.'"},{"num":9,"verse":"These are true words and everyone should believe them."},{"num":10,"verse":"That is why we work hard and put up with troubles. We trust in the living God who came to save all people. He makes a way for those who believe in him."},{"num":11,"verse":"Tell people these things and teach them to do them."},{"num":12,"verse":"Do not let anyone despise you because you are a young man. Show those who believe how they should live. Show them by the way you talk. Show them by the way you live. Show them by the way you love. Show them how to believe by the way you believe. Show them how to live a clean life by the way you live a clean life."},{"num":13,"verse":"Until I come, read the holy writings to people. Talk to them and teach them."},{"num":14,"verse":"Use the gift you have. It was given to you when the church leaders put their hands on your head and gave you a message from God."},{"num":15,"verse":"Take time to think about these things. Then everybody will see how well you are going ahead in your work."},{"num":16,"verse":"Take care of yourself and what you teach. Keep on doing this. If you do, you will save yourself and those who listen to you."}]