[{"header":"Hannah Is Childless"},{"num":1,"verse":"There was a man from Ramathaim Zophim, from the hill country of Ephraim. His name was Elkanah. He was the son of Jeroham, the son of Elihu, the son of Tohu, the son of Zuph, an Ephraimite. "},{"num":2,"verse":"He had two wives; the name of the first was Hannah and the name of the second was Peninnah. Peninnah had children, but Hannah had no children. "},{"num":3,"verse":"This man would go up from his city year after year to worship and to sacrifice to the Lord of Heaven’s Armies at Shiloh. (It was there that the two sons of Eli, Hophni and Phinehas, served as the Lord’s priests.) "},{"num":4,"verse":"The day came, and Elkanah sacrificed."},{"num":5,"verse":"But to Hannah he would give a double portion because he loved Hannah, although the Lord had not enabled her to have children. "},{"num":6,"verse":"Her rival used to aggravate her to the point of exasperation, just to irritate her, since the Lord had not enabled her to have children. "},{"num":7,"verse":"This is how it would go year after year. As often as she went up to the Lord’s house, Peninnah would offend her in that way.)"},{"num":8,"verse":"Then her husband Elkanah said to her, “Hannah, why are you crying and why won’t you eat? Why are you so upset? Am I not better to you than ten sons?” "},{"num":9,"verse":"So Hannah got up after they had finished eating and drinking in Shiloh."},{"num":10,"verse":"As for Hannah, she was very distressed. She prayed to the Lord and was, in fact, weeping. "},{"num":11,"verse":"She made a vow saying, “O Lord of Heaven’s Armies, if you would truly look on the suffering of your servant, and would keep me in mind and not neglect your servant, and give your servant a male child, then I will dedicate him to the Lord all the days of his life. His hair will never be cut.”"},{"num":12,"verse":"It turned out that she did a great deal of praying before the Lord. Meanwhile Eli was watching her mouth. "},{"num":13,"verse":"As for Hannah, she was speaking in her mind. Only her lips were moving; her voice could not be heard. So Eli thought she was a drunkard."},{"num":14,"verse":"Then he said to her, “How much longer do you intend to get drunk? Put away your wine!” "},{"num":15,"verse":"But Hannah replied, “Not so, my lord! I am a woman under a great deal of stress. I haven’t drunk wine or beer. But I have poured out my soul before the Lord. "},{"num":16,"verse":"Don’t consider your servant a wicked woman. It’s just that, to this point, I have spoken from my deep pain and anguish.”"},{"num":17,"verse":"Eli replied, “Go in peace, and may the God of Israel grant the request that you have asked of him.” "},{"num":18,"verse":"She said, “May I, your servant, find favor in your sight.” So the woman went her way and got something to eat. Her face no longer looked sad."},{"num":19,"verse":"They got up early the next morning. Then they worshiped the Lord and returned to their home at Ramathaim. Elkanah was intimate with his wife Hannah, and the Lord called her to mind. "},{"num":20,"verse":"Then Hannah became pregnant."},{"header":"Hannah Dedicates Samuel to the Lord"},{"num":21,"verse":"Then the man Elkanah and all his family went up to make the yearly sacrifice to the Lord and to keep his vow. "},{"num":22,"verse":"But Hannah did not go up with them, because she had told her husband, “Not until the boy is weaned. Then I will bring him so that he may appear before the Lord. And he will remain there from then on.”"},{"num":23,"verse":"Then her husband Elkanah said to her, “Do what you think best. Stay until you have weaned him. Only may the Lord fulfill his promise.”"},{"num":24,"verse":"Then she took him up with her as soon as she had weaned him, along with three bulls, an ephah of flour, and a container of wine. She came to the Lord’s house at Shiloh, and the boy was with them. "},{"num":25,"verse":"They slaughtered the bull, then brought the boy to Eli. "},{"num":26,"verse":"She said, “My lord. Just as surely as you are alive, my lord, I am the woman who previously stood here with you in order to pray to the Lord. "},{"num":27,"verse":"For this boy I prayed, and the Lord has given me the request that I asked of him. "},{"num":28,"verse":"So I also dedicate him to the Lord. For all the days of his life he is dedicated to the Lord.” Then he bowed down there in worship to the Lord."}]