[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And when a man shall sanctify his house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That is, devotes it to the service of God by a vow, when it has to be sold and the money used by the authorities for the maintenance and repair of the sanctuary, unless it is required as a dwelling for the priests, or for some other purpose connected with the duties of the Temple. The sale, however, can only take place after the priest has carefully examined it, ascertained and fixed its value, according to the condition of the house. It then can be bought by any one at the price so fixed. The expression “house” the authorities during the second Temple interpreted to mean not only the building itself but anything belonging to it, or any article of furniture in it which the owner could vow to the sanctuary separately, whilst from the expression “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "house” they concluded that the house or the things therein must be absolutely his own, and that he has the exclusive right of disposal. Hence any house or property obtained by fraud neither the defrauder nor the defrauded could vow to the sanctuary, since the property was not properly in the possession of either, and could not be called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Moreover, if anyone vowed a thing by mistake, it could not be claimed for the sanctuary, the vow under such circumstances was regarded as null and void. From these considerations, as well as from the fact that any article that was vowed could be redeemed, it is evident that the Mosaic vow of consecration to the sanctuary imparted no sacramental and inalienable sanctity to the objects themselves in our ecclesiastical sense of consecration. It is not the gift, but its money value which had to be devoted to the holy cause.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 27:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 27:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When a man shall sanctify his house — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By a vow; for of that way and manner of sanctification he speaks in this whole chapter. This is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "third ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "case, and was to be regulated by the same law as the last- mentioned. It was to be justly valued by the priest; and if the party chose rather to pay the price than part with the house, he was to submit to the law made in the foregoing case.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:14-25 Our houses, lands, cattle, and all our substance, must be used to the glory of God. It is acceptable to him that a portion be given to support his worship, and to promote his cause. But God would not approve such a degree of zeal as ruined a man's family.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sanctify - i. e. vow to devote. This law relates to houses in the country ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which were under the same general law as the land itself, with a right of redemption for the inheritor until the next Jubilee. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 27:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For houses in walled towns the right of redemption lasted for only one year ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14, 15. when a man shall sanctify his house to be holy unto the Lord, &c.—In this case, the house having been valued by the priest and sold, the proceeds of the sale were to be dedicated to the sanctuary. But if the owner wished, on second thought, to redeem it, he might have it by adding a fifth part to the price.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sanctify his house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, by a vow, for of that way and manner of sanctification he speaks in this whole chapter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Holy uno the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in which case the benefit of it redounded either to the priests, for their maintenance, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 18:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or to the sanctuary, for its reparations or expenses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "So shall it stand; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " supposing that the priest’s estimation doth not notoriously swerve from the rules of valuation prescribed by God. For if the priest determined most unrighteously and unreasonably, as suppose a hundred times more than the true value of it, I presume no man is so void of sense as to say they were all bound to stand to the priest’s determination in that case. Even as in case a man’s leprosy was notorious and unquestionable, if a priest should through partiality pronounce him clean, this did not make him clean. And therefore all those passages of Scripture which leave things to, and command men to acquiesce in, the determination of the priest or priests, are to be understood with this exception, that their determinations be not evidently contrary to the revealed will of God, to whom priests are subject and accountable. Otherwise, if the priests had commanded men to profane the sabbath, this would have acquitted them from the obligation of God’s command of keeping it holy, which is impious and absurd to affirm. And this consideration will give light to many scriptures. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when a man shall sanctify his house to be holy unto the Lord,.... Shall set it apart for sacred service, devote it to holy uses, so that it may be sold, and the money laid out in sacrifices, the repairs of the temple, &c. under this any other goods are comprehended, concerning which the Jews say,\"he that sanctifieth his goods, and his wife's dowry is upon him, or he is a debtor; his wife cannot demand her, dowry out of that which is sanctified, nor a creditor his debt; but if he will redeem he may redeem, on condition that he gives the dowry to the wife, and the debt to the creditor; if he has set apart ninety pounds and his debt is an hundred, he may add a penny more, and with it redeem those goods, on condition he gives the wife her dowry and the creditor his debt: whether he sanctifies or estimates his goods, he has no power over his wife's or children's clothes, nor over coloured things, died on their account, nor on new, shoes he has bought for them (z), &c.''again it is said (a),\"if anyone sanctified his goods, and there were among them things fit for the altar; wine, oil, and fowls, R. Eliezer says, they might be sold to those that need any of, that kind, and with the price of them burnt offerings might be bought, and the rest of the goods fell to the repair of the temple:\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then the priest shall estimate it whether it be good or bad; shall examine it of what size and in what condition it is, whether a large well built house or not, and whether in good repair or not, and accordingly set a price upon it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as the priest shall estimate it, so shall it stand; according to the price he shall set upon it, it may be sold; whoever will give it may purchase it, excepting the owner or he that has sanctified it, he must pay a fifth part more, as follows. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Misn. Eracin, c. 6. sect. 2, 5. (a) Misn. Shekalim, c. 4. sect. 8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Misn. Eracin, c. 6. sect. 2, 5. (a) Misn. Shekalim, c. 4. sect. 8. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when a man shall sanctify his house to be holy unto the LORD, then the priest shall estimate it, whether it be good or bad: as the priest shall estimate it, so shall it stand.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14, 15. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The case of houses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 16–25. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The case of lands",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The case of lands",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The vow, as regards its duration, is thus limited to a maximum of 50 years, being determined by the distance of the year of Jubile. When that year arrives, the field shall return to the owner, to be disposed of as he pleases. But even in the meantime, on payment of a defined sum of redemption-money, the field shall remain in the enjoyment of the owner, and the estimate for the purpose shall be at the rate of fifty shekels of silver for the amount of land (about 3 8/4 acres, according to Kennedy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad loc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") which would yield one homer (about eleven bushels) of barley, with an abatement in proportion to the number of years to run before the next Jubile. In order to obtain the enjoyment of the field, however, the owner must pay a further sum amounting to one-fifth of the redemption-money. In case the owner do not desire to redeem, or have alienated the land by selling it to another, the law of Jubile is not to operate; the land shall become the possession of the priest. In the case of a man’s vowing land which is his by purchase and not by inheritance, that purchase shall not hold good beyond the Jubile, the purchaser redeeming it in the meantime by a payment calculated on the same principle as above.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 14, 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The rule as to the redemption of houses is the same as that regarding the redemption of unclean animals. The ordinary practice was to redeem. Leviticus 27:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When a house was vowed, the same rules applied as in the case of unclean cattle. Knobel's supposition, that the person making the vow was to pay the valuation price if he did not wish to redeem the house, is quite a groundless supposition. The house that was not redeemed was sold, of course, for the good of the sanctuary. ",
        "children": []
      }
    ]
  }
]