[{"header":"A Cry of Fear and a Song of Praise"},{"num":22,"verse":"My God, my God, why have You left me alone? Why are You so far from helping me, and from the words I cry inside myself? "},{"num":2,"verse":"O my God, I cry during the day, but You do not answer. I cry during the night, but I find no rest. "},{"num":3,"verse":"Yet You are holy. The praises Israel gives You are Your throne. "},{"num":4,"verse":"Our fathers trusted in You, and You saved them. "},{"num":5,"verse":"They cried to You and were set free. They trusted in You and were not ashamed."},{"num":6,"verse":"But I am a worm and not a man. I am put to shame by men, and am hated by the people. "},{"num":7,"verse":"All who see me make fun of me. They open their mouths and shake their heads, and say, "},{"num":8,"verse":"“He trusts in the Lord. Let the Lord help him. Let the Lord take him out of trouble, because he is happy in Him.”"},{"num":9,"verse":"But You brought me out when I was born. You made me trust when I drank my mother’s milk. "},{"num":10,"verse":"I was in Your care from birth. Since my mother gave birth to me, You have been my God."},{"num":11,"verse":"Do not be far from me, for trouble is near. And there is no one to help. "},{"num":12,"verse":"Many bulls have gathered all around me. Strong bulls of Bashan stand around me. "},{"num":13,"verse":"They open their mouths wide against me, like a loud, hungry lion. "},{"num":14,"verse":"I am poured out like water. And all my bones are out of joint. My heart is like a melted candle within me. "},{"num":15,"verse":"My strength is dried up like a piece of a broken clay pot. My tongue sticks to the roof of my mouth. And You lay me in the dust of death. "},{"num":16,"verse":"For dogs have gathered around me. A group of sinful men stand around me. They have cut through my hands and feet. "},{"num":17,"verse":"I can tell how many bones I have. The people look at me with wide eyes. "},{"num":18,"verse":"They divide my clothes among them by drawing names to see who would get them."},{"num":19,"verse":"But You, O Lord, be not far from me! O my Strength, hurry to help me! "},{"num":20,"verse":"Take me away from the sword. Save my life from the power of the dog. "},{"num":21,"verse":"Save me from the lion’s mouth, and from the horns of the wild bulls You answer me."},{"num":22,"verse":"I will make Your name known to my brothers. In the center of the meeting of worship I will praise You. "},{"num":23,"verse":"You who fear the Lord, give Him praise. All you children of Jacob, honor Him. Fear Him, all you children of Israel. "},{"num":24,"verse":"For He has not turned away from the suffering of the one in pain or trouble. He has not hidden His face from him. But He has heard his cry for help."},{"num":25,"verse":"My praise will be from You in the big meeting of worship. I will keep my promises to Him in front of those who fear Him. "},{"num":26,"verse":"Those who suffer will eat and have enough. Those who look for the Lord will praise Him. May your heart live forever! "},{"num":27,"verse":"All the ends of the earth will remember and turn to the Lord. All the families of the nations will worship before Him. "},{"num":28,"verse":"For the holy nation is the Lord’s, and He rules over the nations. "},{"num":29,"verse":"All the proud ones of the earth will eat and worship. All who go down to the dust will fall to their knees before Him, even he who cannot keep his soul alive. "},{"num":30,"verse":"Future children will serve Him. They will tell of the Lord to their children. "},{"num":31,"verse":"They will come and tell about His saving power to a people yet to be born. For He has done it."}]