[{"num":22,"verse":"(For the one directing. To the Deer of the Dawn. Mizmor Dovid.) Eli, Eli, lamah azavtani? [See Mt 27:46 OJBC] Why art Thou so far from my yeshuah, and from the words of my groaning?"},{"num":3,"verse":"Elohai, I cry yomam, but Thou hearest not; and v’lailah, and am not silent."},{"num":4,"verse":"But Atah Kadosh, O Thou enthroned on the tehillot Yisroel."},{"num":5,"verse":"Avoteinu trusted in Thee; they had bitachon, and Thou didst deliver them."},{"num":6,"verse":"They cried unto Thee, and were delivered; they had bitachon in Thee, and were not disappointed."},{"num":7,"verse":"But I am a tola’at, and no ish; a reproach of men, and despised of the people [see Yeshayah 53:3 on the despised Moshiach]."},{"num":8,"verse":"All they that see me mock me; they shoot out the lip, they shake the rosh, saying,"},{"num":9,"verse":"He trusted in Hashem; let Hashem rescue him; let Him deliver him, since He delights in him."},{"num":10,"verse":"But Thou art He that took me out of the womb; Thou didst make me trust when I was upon the breasts of immi."},{"num":11,"verse":"I was cast upon Thee from the womb; Thou art Eli from the womb of immi."},{"num":12,"verse":"Be not far from me; for tzoros is near; and there is none to help."},{"num":13,"verse":"Parim rabbim (many bulls) have encompassed me; strong bulls of Bashan have beset me round about."},{"num":14,"verse":"They opened wide their mouths upon me, like an aryeh roaring and tearing prey."},{"num":15,"verse":"I am poured out like mayim, and all my atzmot are out of joint; my lev is like wax; it is melted away within me."},{"num":16,"verse":"My ko’ach is dried up like baked clay; and my leshon cleaveth to my jaws; and Thou layest me in the aphar mavet (dust of death)."},{"num":17,"verse":"For kelavim have surrounded me; the Adat Mere’im (congregation of evil men) have enclosed me; ka’aru yadai v’ragelai (they pierced my hands and my feet; see Isa 53:5; Zech 12:10 and medieval Hebrew Scripture manuscripts as well as the Targum HaShivim)."},{"num":18,"verse":"I can count all my atzmot; the people stare and gloat at me."},{"num":19,"verse":"They divide up my garments among them, and for my clothing they cast goral (lots) [Mt 27:35; Lk 23:34; Yn 19:24]."},{"num":20,"verse":"But be not Thou far from me, Hashem; O my strength, hasten Thee to help me."},{"num":21,"verse":"Deliver my nefesh from the cherev, my yechid (only one, only [nefesh]) from the power of the kelev (dog)."},{"num":22,"verse":"Hoshieini from the mouth of the aryeh; for Thou hast heard me from the karnayim of the wild bulls."},{"num":23,"verse":"I will declare Thy Shem unto my Achim; in the midst of the Kahal will I praise Thee."},{"num":24,"verse":"Ye that fear Hashem, praise Him; all ye Zera Ya’akov, give Him kavod; and fear Him, all ye Zera Yisroel."},{"num":25,"verse":"For He hath not despised nor disdained the enut ani (affliction of the afflicted); neither hath He hid His face from him; but when he cried unto Him, He heard."},{"num":26,"verse":"My tehillah shall be from Thee in the Kahal Rav; I will fulfill my nedar before them that fear Him."},{"num":27,"verse":"The anavim (meek) shall eat and be satisfied; they that seek Him shall praise Hashem. Let your levav live forever!"},{"num":28,"verse":"All the ends of HaAretz shall remember and turn unto Hashem; and all the mishpechot of the Goyim shall bow down in worship before Thee."},{"num":29,"verse":"For the Meluchah is Hashem’s: and He is the Moshel over the Goyim."},{"num":30,"verse":"All they that thrive upon HaAretz shall eat and worship; all they that go down to the aphar (dust) shall bow before Him; even he who cannot keep alive his own nefesh."},{"num":31,"verse":"Zera shall serve Him; it shall be told to the generation [to come] concerning Adonoi."},{"num":32,"verse":"They shall come, and shall declare His tzedek unto an Am Nolad (a [future] people that shall be born), that He hath done this."}]