[{"num":10,"verse":"In the third year of Koresh king of Persia, a word was revealed to Dani’el, also called Belt’shatzar. The word was certain: a great war. He understood the word, having gained understanding in the vision."},{"num":2,"verse":"At that time I, Dani’el, had been mourning for three whole weeks. "},{"num":3,"verse":"I hadn’t eaten any food that satisfied me — neither meat nor wine had entered my mouth, and I didn’t anoint myself once, until three full weeks had passed."},{"num":4,"verse":"On the twenty-fourth day of the first month, I was on the bank of the great river, the Tigris, "},{"num":5,"verse":"when I looked up, and there before me was a man dressed in linen wearing a belt made of fine Ufaz gold. "},{"num":6,"verse":"His body was like beryl, his face looked like lightning and his eyes like fiery torches; his arms and feet were the color of burnished bronze; and when he spoke, it sounded like the roar of a crowd. "},{"num":7,"verse":"Only I, Dani’el, saw the vision; the men who were with me did not see the vision; however, a great trembling fell over them; so that they rushed to hide themselves. "},{"num":8,"verse":"Thus I was left alone; and when I saw this great vision, there was no strength left in me — my face, normally pleasant-looking, became disfigured; and I had no strength."},{"num":9,"verse":"I heard his voice speaking; and when I heard him speaking, I fell down in a faint, with my face to the ground. "},{"num":10,"verse":"Then a hand touched me and raised me, tottering, to my hands and knees. "},{"num":11,"verse":"He said to me, “Dani’el, you are a greatly loved man. Now pay attention to the words I am saying to you, and stand upright; for it is to you that I have been sent now.” After he had said this to me, I stood up, trembling. "},{"num":12,"verse":"Then he said to me, “Don’t be afraid, Dani’el; because since the first day that you determined to understand and to humble yourself before your God, your words have been heard; and I have come because of what you said. "},{"num":13,"verse":"The prince of the kingdom of Persia prevented me from coming for twenty-one days; but Mikha’el, one of the chief princes, came to assist me; so that I was no longer needed there with the kings of Persia. "},{"num":14,"verse":"So I have come to make you understand what will happen to your people in the acharit-hayamim; for there is still another vision which will relate to those days.”"},{"num":15,"verse":"After he had said these things to me, I looked down at the ground and couldn’t speak. "},{"num":16,"verse":"Then someone who looked like a human being touched my lips, after which I could open my mouth and speak; I said to the one standing in front of me, “My lord, it is because of the vision that I am seized with such anguish; I don’t have any strength. "},{"num":17,"verse":"For how can this servant of my lord speak with my lord, when my strength and breath have failed me?” "},{"num":18,"verse":"Then, again someone who looked human touched me and revived me. "},{"num":19,"verse":"He said, “You man so greatly loved, don’t be afraid. Shalom to you; and be strong, yes, truly strong.” His speaking to me strengthened me, and I said, “My lord, keep speaking; because you’ve given me strength.” "},{"num":20,"verse":"Then he said, “Do you know why I came to you? Although now I must return to fight the prince of Persia; and when I leave, the prince of Greece will come; "},{"num":21,"verse":"nevertheless, I will tell you what is written in the Book of Truth. There is no one standing with me against them except Mikha’el your prince;"}]