[[],[{"type":"header","content":"Conflict of Nations and Heavenly Powers"},{"type":"prose","content":"In the third year of King Cyrus of Persia a word was revealed to Daniel, who was named Belteshazzar. The word was true, and it concerned a great conflict. He understood the word, having received understanding in the vision."}],[{"type":"prose","content":"At that time I, Daniel, had been mourning for three weeks. "}],[{"type":"prose","content":"I had eaten no rich food, no meat or wine had entered my mouth, and I had not anointed myself at all, for the full three weeks. "}],[{"type":"prose","content":"On the twenty-fourth day of the first month, as I was standing on the bank of the great river (that is, the Tigris), "}],[{"type":"prose","content":"I looked up and saw a man clothed in linen, with a belt of gold from Uphaz around his waist. "}],[{"type":"prose","content":"His body was like beryl, his face like lightning, his eyes like flaming torches, his arms and legs like the gleam of burnished bronze, and the sound of his words like the roar of a multitude. "}],[{"type":"prose","content":"I, Daniel, alone saw the vision; the people who were with me did not see the vision, though a great trembling fell upon them, and they fled and hid themselves. "}],[{"type":"prose","content":"So I was left alone to see this great vision. My strength left me, and my complexion grew deathly pale, and I retained no strength. "}],[{"type":"prose","content":"Then I heard the sound of his words; and when I heard the sound of his words, I fell into a trance, face to the ground."}],[{"type":"prose","content":"But then a hand touched me and roused me to my hands and knees. "}],[{"type":"prose","content":"He said to me, “Daniel, greatly beloved, pay attention to the words that I am going to speak to you. Stand on your feet, for I have now been sent to you.” So while he was speaking this word to me, I stood up trembling. "}],[{"type":"prose","content":"He said to me, “Do not fear, Daniel, for from the first day that you set your mind to gain understanding and to humble yourself before your God, your words have been heard, and I have come because of your words. "}],[{"type":"prose","content":"But the prince of the kingdom of Persia opposed me twenty-one days. So Michael, one of the chief princes, came to help me, and I left him there with the prince of the kingdom of Persia, "}],[{"type":"prose","content":"and have come to help you understand what is to happen to your people at the end of days. For there is a further vision for those days.”"}],[{"type":"prose","content":"While he was speaking these words to me, I turned my face toward the ground and was speechless. "}],[{"type":"prose","content":"Then one in human form touched my lips, and I opened my mouth to speak, and said to the one who stood before me, “My lord, because of the vision such pains have come upon me that I retain no strength. "}],[{"type":"prose","content":"How can my lord’s servant talk with my lord? For I am shaking, no strength remains in me, and no breath is left in me.”"}],[{"type":"prose","content":"Again one in human form touched me and strengthened me. "}],[{"type":"prose","content":"He said, “Do not fear, greatly beloved, you are safe. Be strong and courageous!” When he spoke to me, I was strengthened and said, “Let my lord speak, for you have strengthened me.” "}],[{"type":"prose","content":"Then he said, “Do you know why I have come to you? Now I must return to fight against the prince of Persia, and when I am through with him, the prince of Greece will come. "}],[{"type":"prose","content":"But I am to tell you what is inscribed in the book of truth. There is no one with me who contends against these princes except Michael, your prince. "}]]