[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Appearance of a man.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it appears that this was the angel Gabriel. The “man’s voice” mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " proceeded from Him Who alone has authority to command angels. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 8:15-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:15-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When I had seen the vision, and sought for the meaning — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Here we are informed of Daniel’s earnest desire to have the vision explained to him. For those that rightly know the things of God, cannot but desire to be led still further into the mystery of them. And those who desire to know the meaning of what they have seen or heard from God, must seek it, and that diligently, namely, by earnest prayer and close meditation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then there stood before me as the appearance of a man — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Scriptures frequently represent the angels as appearing in human forms, which it is likely they do, because, perhaps, there is nothing visible to us that so much resembles what they really are, as the human form does. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I heard a man’s voice between the banks of Ulai — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, between me and the river Ulai. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Which said, Gabriel, make this man understand the vision — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Explain it more clearly to him, if there be any thing in it which he does not perfectly understand. He who spake this seems to be the same angel who is spoken of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and called there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that certain saint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "by way of distinction; for he here speaks as one that had authority over the angel Gabriel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:15-27 The eternal Son of God stood before the prophet in the appearance of a man, and directed the angel Gabriel to explain the vision. Daniel's fainting and astonishment at the prospect of evils he saw coming on his people and the church, confirm the opinion that long-continued calamities were foretold. The vision being ended, a charge was given to Daniel to keep it private for the present. He kept it to himself, and went on to do the duty of his place. As long as we live in this world we must have something to do in it; and even those whom God has most honoured, must not think themselves above their business. Nor must the pleasure of communion with God take us from the duties of our callings, but we must in them abide with God. All who are intrusted with public business must discharge their trust uprightly; and, amidst all doubts and discouragements, they may, if true believers, look forward to a happy issue. Thus should we endeavour to compose our minds for attending to the duties to which each is appointed, in the church and in the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it came to pass ... - Daniel saw the vision, but was unable to explain it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And sought for the meaning - Evidently by meditating on it, or endeavoring in his own mind to make it out.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There stood before me as the appearance of a man - One having the appearance of a man. This was evidently Gabriel Daniel 8:16, who now assumed a human form, and who was addressed by the voice from between the banks of the Ulai, and commenced to make known the meaning of the vision. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There stood before me as the appearance of a man - One having the appearance of a man. This was evidently Gabriel ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", who now assumed a human form, and who was addressed by the voice from between the banks of the Ulai, and commenced to make known the meaning of the vision. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. unto me—The answer is to Daniel, not to the inquirer, for the latter had asked in Daniel's name; as vice versa the saint or angel (Job 15:15; Ps 89:6, 7) speaks of the vision granted to Daniel, as if it had been granted to himself. For holy men are in Scripture represented as having attendant angels, with whom they are in a way identified in interests. If the conversation had been limited to the angels, it could have been of no use to us. But God conveys it to prophetical men, for our good, through the ministry of angels.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "two thousand … three hundred days—literally, \"mornings and evenings,\" specified in connection with the morning and evening sacrifice. Compare Ge 1:5. Six years and a hundred ten days. This includes not only the three and a half years during which the daily sacrifice was forbidden by Antiochus [Josephus, Wars of the Jews, 1:1.1], but the whole series of events whereby it was practically interrupted: beginning with the \"little horn waxing great toward the pleasant land,\" and \"casting down some of the host\" (Da 8:9, 10); namely, when in 171 B.C., or the month Sivan in the year 142 of the era of the Seleucidæ, the sacrifices began to be neglected, owing to the high priest Jason introducing at Jerusalem Grecian customs and amusements, the palæstra and gymnasium; ending with the death of Antiochus, 165 B.C., or the month Shebath, in the year 148 of the Seleucid era. Compare 1 Maccabees 1:11-15; 2 Maccabees 4:9, &c. The reason for the greater minuteness of historical facts and dates, given in Daniel's prophecies, than in those of the New Testament, is that Israel, not having yet the clear views which Christians have of immortality and the heavenly inheritance, could only be directed to the earthly future: for it was on earth the looked-for Messiah was to appear, and the sum and subject of Old Testament prophecy was the kingdom of God upon earth. The minuteness of the revelation of Israel's earthly destiny was to compensate for the absence, in the Old Testament, of views of heavenly glory. Thus, in Da 9:24-27, the times of Messiah are foretold to the very year; in Da 8:14 the times of Antiochus, even to the day; and in Da 11:5-20 the Syro-Egyptian struggles in most minute detail. Tregelles thinks the twenty-three hundred \"days\" answer to the week of years (Da 9:27), during which the destroying prince (Da 9:26) makes a covenant, which he breaks in the midst of the week (namely, at the end of three and a half years). The seven years exceed the twenty-three hundred days by considerably more than a half year. This period of the seven years' excess above the twenty-three hundred days may be allotted to the preparations needed for setting up the temple-worship, with Antichrist's permission to the restored Jews, according to his \"covenant\" with them; and the twenty-three hundred days may date from the actual setting up of the worship. But, says Auberlen, the more accurate to a day the dates as to Antiochus are given, the less should we say the 1290, or 1335 days (Da 12:11, 12) correspond to the half week (roughly), and the twenty-three hundred to the whole. The event, however, may, in the case of Antichrist, show a correspondence between the days here given and Da 9:27, such as is not yet discernible. The term of twenty-three hundred days cannot refer twenty-three hundred years of the treading down of Christianity by Mohammedanism, as this would leave the greater portion of the time yet future. If the twenty-three hundred days mean years, dating from Alexander's conquests, 334 B.C. to 323, we should arrive at about the close of the sixth thousand years of the world, just as the 1260 years (Da 7:25) from Justinian's decree arrive at the same terminus. The Jews' tradition represents the seventh thousand as the millennium. Cumming remarks, 480 B.C. is the date of the waning of the Persian empire before Greece; deducting 480 from 2300, we have 1820; and in 1821, Turkey, the successor of the Greek empire, began to wane, and Greece became a separate kingdom. See on [1095]Da 12:11.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "cleansed—literally, \"justified,\" vindicated from profanation. Judas Maccabeus celebrated the feast of dedication after the cleansing, on the twenty-fifth of the ninth month, Kisleu (1 Maccabees 4:51-58; 2 Maccabees 10:1-7; Joh 10:22). As to the antitypical dedication of the new temple, see Eze 43:1-27, &c.; also Am 9:11, 12.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Having obtained the favour of knowing something, he longed for a more clear discovery of those things; and he had his desire granted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As the appearance of a man; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either the angel Gabriel or Michael, who appeared often in the shape of men, and are the messengers of God in the great things concerning his church, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 1:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; others will have this angel to be Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it came to pass, when I, even I Daniel, had seen the vision,.... The whole of the preceding vision, concerning the ram, he goat, and little horn, and what were done by them; the prophet not only affirms he saw this vision, but repeats the affirmation, expressing his own name, partly for the sake of emphasis, and partly for the greater confirmation of his words; wherefore it was a most impudent thing Porphyry to say, that the true Daniel never saw this vision; but what is here related was written after Antiochus's reign, and falsely ascribed to him. It being so clear a prophecy concerning Alexander, and the destruction of the Persian empire by him, this acute spiteful Heathen had no other way of evading the evidence of it in favour of true religion but by this false and lying assertion: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I sought for the meaning; that is, of the vision; for a more perfect, clear, and explicit meaning of it; something he had learnt concerning the latter part of it, relating to the desolation of the temple, and the continuance of it, from what passed between the two saints or angels; but he was desirous of knowing more; which he either signified by making application to the angel that stood near him; or rather by secret ejaculations in prayer to God; and he, who is afterwards described as a man, though the eternal God that knows all things, knew the secret desires of his soul, and immediately took care they should be answered: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then, behold, there stood before me as the appearance of a man: not really a man, but in form and appearance; not Gabriel, or any created angel in human form, in which angels sometimes appeared but the eternal Son of God, who was to be incarnate, and was often seen in the form of a man before his incarnation; in like manner he was now seen by Daniel, right ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "over against (k) whom he stood; this is the same with the speaking saint, or Paimoni the wonderful One, in Daniel 8:13. Jacchiades says, this is the holy blessed God; as it is indeed the Immanuel, God that was to be manifested in the flesh. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "over against (k) whom he stood; this is the same with the speaking saint, or Paimoni the wonderful One, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jacchiades says, this is the holy blessed God; as it is indeed the Immanuel, God that was to be manifested in the flesh. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) \"ex adverso mei\", Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k) \"ex adverso mei\", Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it came to pass, when I, even I Daniel, had seen the vision, and sought for the meaning, then, behold, there stood before me {b} as the appearance of a man.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And it came to pass, when I, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "even",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I Daniel, had seen the vision, and sought for the meaning, then, behold, there stood before me ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the appearance of a man.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Who was Christ who in this manner declared himself to the old fathers, how he would be God manifest in flesh.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15–27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Daniel seeks to know the meaning of the vision, which is imparted to him, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., by an angel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "15 that I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sought",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to understand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (it), ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "behold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "was standing in front of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] appearing suddenly, some little way off (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 8:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘came near’).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as the appearance of a man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The expression ‘as the appearance of’ is borrowed from Ez. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:26-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 40:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 42:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and recurs below, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word for man (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "geber",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")—different from that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—is evidently chosen with allusion to the name ‘Gabriel,’ ‘man of God’ [not the word used in the common phrase, ‘man of God,’ for a prophet].",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And it came to pass, when I, even I Daniel, had seen the vision, and sought for the meaning, then, behold, there stood before me as the appearance of a man.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The versions here are unimportant. Daniel desires to understand the meaning of this vision. From this we see that, at the time when this book was written, it was understood that prophets might be ignorant of the meaning of the revelations made to them. This is at variance with the assumption of even believing critics, that if a prophecy were given to a prophet, he must have understood the reference of the message. On the accuracy of this assumption, they found the rejection of any interpretation of a prophecy which sees more in it than the prophet could have seen. This latest critical date of Daniel is separated by approximately two centuries and a half from prophecy in actual existence in Malachi. The tradition of the conditions of the phenomenon would still be vital. The phrase before us probably means that Daniel applied the various Babylonian formulae to the dream, to find the interpretation , but, suspicious of them, he still continued his search. In answer to Daniel's search, there stood before him one having \"the appearance of a man (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gaber",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")\" - an angelic being in human form. The H,.brew word translated \"man\" is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gaber",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which suggests the name given to the angel, \"Gabriel.\" Daniel 8:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The interpretation of the vision - The interpretation of Daniel's vision, as given by the angel, falls within the vision itself. When Daniel sought to understand the vision, viz., in his mind, not by prayer or by asking a question, he saw before him, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", one standing at some distance, who had the appearance of a man, but was not a man, but a supernatural being in human likeness. This person resembling a man is (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") named by the angel, Gabriel, i.e., man of God. The voice of another, whom Daniel did not see, hearing only a human voice proceeding from the Ulai, commanded this person to explain the vision to the prophet (להלּז, i.e., to Daniel). Nothing further is indicated of the person from whom the voice proceeded than what may be conjectured from אוּלי בּין (between the Ulai), whence the voice sounded. These words do not mean \"hither from Ulai\" (Bertholdt), but \"between the two banks of the Ulai\" (Chr. B. Mich., Hv., etc.); according to which, the being whose voice Daniel heard appears as if hovering over the waters of the river Ulai. This conjecture is confirmed by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Daniel sees a man hovering over the waters of the river of Ulai, who by the majesty of his appearance and his words shows himself to be a divine being, and is more minutely described according to the majesty of his appearance in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The question, who this man might be, is first answered in Daniel Dan 10:5. Gabriel is not a nomen proprium but appellativum. The angel who was described as an appearance like a גּבר (man) is named, for Daniel, Gabriel (\"man of God\"), that on subsequent occasions (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") he might recognise him again as the same (Hgst., Hofm., Kliefoth). As to his relation to other angels and archangels, the Scripture gives no information. If Lengerke and Maurer regard him, after the book of Enoch, along with Michael, and Raphael, and Uriel whose name does not occur in Scripture, as one of the four angels that stand before the throne of God, the Scripture affords no support for it; nor does it countenance the supposition of Hitzig, that the two angels in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are identical with those in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - that Gabriel who spake, and the unknown angel, was the angel of the \"rivers and fountains of waters,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Altogether groundless, also, is the identification of them with the Persian Amschaspands, since neither the doctrine of angels nor the names of angels of the O.T. are derived from Parsism. The most recent attempt by Dr. Al. Kohut, in his researches regarding Jewish angelology and demonology in their dependence on Parsism (Abhand. fr die Kunde des Morgen. iv. Bc., Nr. 3), to establish this connection, is extremely poor and superficial. The proof adduced in the first ten pages of his treatise is confined to these points: that in the writings of the O.T. after the Exile or during the Exile the appearance of the angels is altogether different from that presented in the portions written before the Exile. It is said that, as a rule, the angels in the period first named take the human form, and bear names corresponding to their properties - Michael, Daniel 10:13, Daniel 10:21; Daniel 12:1; Gabriel, Daniel 8:16; Daniel 9:21; and in the book of Tobit, 12:15, not much later in date (?), Raphael; - now also, in contrast to the period before the Exile, there is an order in rank among the angels; Michael, Daniel 10:12, is designated as one of the first angel-princes, and, Daniel 12:1, as the greatest angel-prince; moreover, the number of שׂרים (angel-princes) is spoken of as seven, corresponding to the Persian Amesha-pentas (Tob. 12:15, and Book of Enoch 90:21). But does this distinction between the pre-exilian and post-exilian doctrine of angels, even though it were allowed to be as great as Kohut supposes, furnish a proof for the derivation of the latter from Parsism? or does this derivation follow from the fact that the Jews in exile came into intercourse with the Persians and the Medes, and that about this time the Zend worship flourished? And do the angels in the post-exilian writings for the first time indeed assume the human form? Kohut seems to know nothing of the appearance of angels in Genesis 19:1., Judges 6:11., Judges 13:9. Then does the agreement, not of the doctrine of the O.T., but of the later Jewish apocryphal writings, Tobit and the Book of Enoch, with regard to the number of angel-princes and of the Amesha-penta, furnish a sufficient proof of this derivation? Dr. Kohut does not himself appear to think so, since he regards it as necessary, in addition to this, which is \"perhaps purely accidental,\" to furnish an etymological argument. Amesha-penta means \"non connivens sanctus  equals  the holy one not sleeping;\" \"thus,\" he says, \"it is a mere Chaldee rendering of the word Amesha-penta, when in Daniel 4:10,Daniel 4:14, Daniel 4:20; Daniel 8:13, the Jewish angel-princes are called עירין קדּשׁין  equals  holy watchers.\" But was, then, the Chaldean king Nebuchadnezzar, to whom in a dream a \"holy watcher\" appeared, a Jew? and in what edition of the Bible has Dr. Kohut found in Daniel 8:13 the angel name עיר? Nor is it any better proof that the demonology of the O.T. is a foreign production, resulting from the contact of the Jews with the Persians and Medes during the exile, because in Zechariah 3:1., Psalm 48:1-14 :49; 1 Chronicles 21:1, and especially in Job 1:6., Daniel 2:1, Satan \"is depicted as a plague-spirit, altogether corresponding to the Persian Agromainjus, the killing spirit.\" Such silly talk needs no refutation.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Altogether groundless, also, is the identification of them with the Persian Amschaspands, since neither the doctrine of angels nor the names of angels of the O.T. are derived from Parsism. The most recent attempt by Dr. Al. Kohut, in his researches regarding Jewish angelology and demonology in their dependence on Parsism (Abhand. fr die Kunde des Morgen. iv. Bc., Nr. 3), to establish this connection, is extremely poor and superficial. The proof adduced in the first ten pages of his treatise is confined to these points: that in the writings of the O.T. after the Exile or during the Exile the appearance of the angels is altogether different from that presented in the portions written before the Exile. It is said that, as a rule, the angels in the period first named take the human form, and bear names corresponding to their properties - Michael, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Gabriel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in the book of Tobit, 12:15, not much later in date (?), Raphael; - now also, in contrast to the period before the Exile, there is an order in rank among the angels; Michael, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 10:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is designated as one of the first angel-princes, and, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as the greatest angel-prince; moreover, the number of שׂרים (angel-princes) is spoken of as seven, corresponding to the Persian Amesha-pentas (Tob. 12:15, and Book of Enoch 90:21). But does this distinction between the pre-exilian and post-exilian doctrine of angels, even though it were allowed to be as great as Kohut supposes, furnish a proof for the derivation of the latter from Parsism? or does this derivation follow from the fact that the Jews in exile came into intercourse with the Persians and the Medes, and that about this time the Zend worship flourished? And do the angels in the post-exilian writings for the first time indeed assume the human form? Kohut seems to know nothing of the appearance of angels in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 13:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Then does the agreement, not of the doctrine of the O.T., but of the later Jewish apocryphal writings, Tobit and the Book of Enoch, with regard to the number of angel-princes and of the Amesha-penta, furnish a sufficient proof of this derivation? Dr. Kohut does not himself appear to think so, since he regards it as necessary, in addition to this, which is \"perhaps purely accidental,\" to furnish an etymological argument. Amesha-penta means \"non connivens sanctus  equals  the holy one not sleeping;\" \"thus,\" he says, \"it is a mere Chaldee rendering of the word Amesha-penta, when in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Jewish angel-princes are called עירין קדּשׁין  equals  holy watchers.\" But was, then, the Chaldean king Nebuchadnezzar, to whom in a dream a \"holy watcher\" appeared, a Jew? and in what edition of the Bible has Dr. Kohut found in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the angel name עיר? Nor is it any better proof that the demonology of the O.T. is a foreign production, resulting from the contact of the Jews with the Persians and Medes during the exile, because in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " :49; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 21:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and especially in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Satan \"is depicted as a plague-spirit, altogether corresponding to the Persian Agromainjus, the killing spirit.\" Such silly talk needs no refutation.)",
            "children": []
          }
        ]
      }
    ]
  }
]