[{"header":"False Prophets Condemned"},{"num":13,"verse":"The Lord spoke his word to me. He said, "},{"num":2,"verse":"“Son of man, prophesy against the prophets of Israel. Tell those who make up their prophecies, ‘Listen to the Lord’s word."},{"num":3,"verse":"“ ‘This is what the Almighty Lord says: How horrible it will be for the foolish prophets. They follow their own ideas, and they have seen nothing. "},{"num":4,"verse":"Israel, your prophets are like foxes among the ruins ⌞of a city⌟. "},{"num":5,"verse":"They haven’t repaired the gaps in the wall or rebuilt the wall for the nation of Israel. So Israel will not be protected in battle on the day of the Lord. "},{"num":6,"verse":"These foolish prophets see false visions, and their predictions don’t come true. They say, “The Lord said this.” But the Lord hasn’t sent them. Then they hope that their message will come true. "},{"num":7,"verse":"Prophets of Israel, haven’t you seen false visions and predicted things that don’t come true? Don’t you say, “The Lord said this,” even though I haven’t said anything?"},{"num":8,"verse":"“ ‘This is what the Almighty Lord says: Your predictions are false, and your visions are lies. That is why I’m against you, declares the Almighty Lord. "},{"num":9,"verse":"I will use my power against the prophets who see false visions and predict things that don’t come true. They will not help my people make decisions or be recorded in the records of the nation of Israel. They won’t even enter Israel. Then you will know that I am the Lord."},{"num":10,"verse":"“ ‘They have deceived my people by saying that everything is alright, but it’s not alright. When someone builds a flimsy wall, the prophets cover it up with paint. "},{"num":11,"verse":"Tell those who cover up the wall with paint that their wall will fall down. Rain will pour down, hailstones will fall on it, and stormy winds will break it to pieces. "},{"num":12,"verse":"When the wall falls down, people will ask them, “Where’s the paint that you used to cover the wall?”"},{"num":13,"verse":"“ ‘This is what the Almighty Lord says: In my fury I’ll cause a storm to break out. In my anger rain will pour down, and hailstones will destroy the wall. "},{"num":14,"verse":"I will tear down the wall that the prophets covered up with paint. I will level it and expose its foundation. When the wall falls, they will be destroyed by it. Then you will know that I am the Lord. "},{"num":15,"verse":"I will unleash my fury on the wall and on those who covered it up with paint."},{"num":16,"verse":"The prophets of Israel who prophesied to Jerusalem are gone. Those who said that everything was alright, when it wasn’t alright, are gone, declares the Almighty Lord.” ’"},{"num":17,"verse":"“Son of man, look at the women among your people who make up prophecies, and prophesy against them."},{"num":18,"verse":"“Tell them, ‘This is what the Almighty Lord says: How horrible it will be for women who sew magic charms for people’s wrists and make magic veils of every size for people’s heads. You want to trap people. You want to control the lives of my people for your own profit. "},{"num":19,"verse":"You dishonor me in front of my people for a few handfuls of barley and a few pieces of bread. You kill people who shouldn’t die, and you spare the lives of people who shouldn’t live. You lie to my people who are willing to listen."},{"num":20,"verse":"“ ‘This is what the Almighty Lord says: I’m against the magic charms that you use to trap people like birds. I will tear them from your arms and free the people that you have trapped. "},{"num":21,"verse":"I will tear off your magic veils and rescue my people from your power so that they will no longer be under your control. Then you will know that I am the Lord. "},{"num":22,"verse":"You have discouraged righteous people with your lies, even though I hadn’t brought them any grief. You encouraged wicked people not to turn from their wicked ways to save their lives. "},{"num":23,"verse":"That is why you will no longer see false visions or make predictions. I will rescue my people from your power. Then you will know that I am the Lord.’ ”"}]