[{"header":"A Prophecy against Prophets"},{"num":13,"verse":"This message came to me from the Lord: "},{"num":2,"verse":"“Son of Man, prophesy against the prophets of Israel, who even now are prophesying, and tell those prophets that keep on prophesying according to what they wish would happen, ‘Listen to what the Lord says.’”"},{"num":3,"verse":"“This is what the Lord God says, ‘How terrible it will be for the false prophets who walk according to their own wrong inclinations and see nothing. "},{"num":4,"verse":"Israel, your prophets have become like foxes among ruins. "},{"num":5,"verse":"You didn’t go up to repair the breaches in the walls and you didn’t build the walls so Israel’s house would be able to endure battle on the Day of the Lord. "},{"num":6,"verse":"Instead, they crafted false prophecies and divination."},{"num":7,"verse":"You’ve crafted a false prophesy and spoken deceptive divination, haven’t you? But then you say, “…declares the Lord,” although I haven’t spoken a single word."},{"num":8,"verse":"“‘Therefore this is what the Lord God says, “Because you’ve spoken falsehood and deceptions, I am therefore opposing you,” declares the Lord God. "},{"num":9,"verse":"My hand will oppose the prophets who see false visions and speak deceptive divinations. They won’t be included with the council of my people, nor will they be entered into the registry of Israel’s house or enter Israel’s land. Then you’ll know that I am the Lord God, "},{"num":10,"verse":"because they’ve truly caused my people to stray saying, “Peace,” but there’s no peace.’”"},{"header":"Metaphor of the Whitewashed Wall"},{"num":11,"verse":"Tell those who coat it with whitewash that it will fall. It will be washed off by the rain. Great hailstones will fall and a stormy wind will strip it off. "},{"num":12,"verse":"Look! When the wall collapses, won’t it be said of you, ‘Where’s the coat of paint that you spread all over the wall?’"},{"num":13,"verse":"“Therefore this is what the Lord God says, ‘In my burning anger, I’ll rip it open with a windstorm. In my anger, I’ll rinse it off with rain, and put an end to it with a hailstorm in my destructive rage. "},{"num":14,"verse":"I’ll tear down the wall that you’ve smeared with whitewash, level it to the ground, and tear out its foundation. Then it will collapse—and you’ll perish with it! Then you’ll know that I am the Lord."},{"num":15,"verse":"“‘That’s how I’ll vent my anger on the wall and on the ones who coated it with whitewash. And I’ll say to you, “The wall is gone and so are those who coated it.” "},{"num":16,"verse":"The prophets of Israel prophesied about Jerusalem and saw visions of peace concerning her, yet there’s no peace,’” declares the Lord God."},{"header":"A Rebuke to Israel’s Women"},{"num":17,"verse":"“And now, Son of Man, turn toward and oppose the women of your people who prophesy according to their own wrong inclinations and prophesy against them. "},{"num":18,"verse":"Tell them, ‘This is what the Lord God says, “How terrible it will be for those women who sew magical bracelets on all their wrists and make one-size-fits all headbands, in order to entrap their souls. Will you hunt for the souls of my people and remain alive? "},{"num":19,"verse":"You’ve profaned me among my people for a handful of barley and a morsel of bread. You’re causing people to die who shouldn’t have to die, and you’re causing people to live who shouldn’t survive, when you deceive my people who tend to listen to lies.”"},{"num":20,"verse":"“‘Therefore, this is what the Lord God says, “Watch out! I’m opposing your amulets with which you hunt souls as one would swat at a flying insect. I’ll tear them off your arms and then deliver those people, whom you’ve hunted like birds. "},{"num":21,"verse":"I’ll also tear off your headbands and deliver my people from your grip so that they won’t be under your control anymore. Then you’ll know that I am the Lord."},{"num":22,"verse":"“‘“Because you’ve dismayed the heart of the righteous—whom I never intended to dismay—with lies, and because you’ve encouraged the wicked so that he wouldn’t abandon his evil behavior and by doing so live, "},{"num":23,"verse":"you’ll no longer see false visions or again practice divination, because I’m going to deliver my people from your power. Then you’ll know that I am the Lord.”’”"}]