[{"num":18,"verse":"2 He showeth that every man shall bear his own sin. 21 To him that amendeth, salvation is promised. 24 Death is prophesied to the righteous, which turneth back from the right way."},{"num":1,"verse":"The word of the Lord came unto me again, saying,"},{"num":2,"verse":"What mean ye that ye speak this proverb concerning the land of Israel, saying, The fathers have eaten sour grapes, and the children’s teeth are set on edge?"},{"num":3,"verse":"As I live, saith the Lord God, ye shall use this proverb no more in Israel."},{"num":4,"verse":"Behold, all souls are mine, both the soul of the father, and also the soul of the son are mine: the soul that sinneth, it shall die."},{"num":5,"verse":"But if a man be just, and do that which is lawful and right,"},{"num":6,"verse":"And hath not eaten upon the mountains, neither hath lift up his eyes to the idols of the house of Israel, neither hath defiled his neighbor’s wife, neither hath lain with a menstruous woman,"},{"num":7,"verse":"Neither hath oppressed any, but hath restored the pledge to his debtor: he that hath spoiled none by violence, but hath given his bread to the hungry, and hath covered the naked with a garment,"},{"num":8,"verse":"And hath not given forth upon usury, neither hath taken any increase, but hath withdrawn his hand from iniquity, and hath executed true judgment between man and man,"},{"num":9,"verse":"And hath walked in my statutes, and hath kept my judgments to deal truly, he is just, he shall surely live, saith the Lord God."},{"num":10,"verse":"¶ If he beget a son, that is a thief, or a shedder of blood, if he do anyone of these things,"},{"num":11,"verse":"Though he do not all these things, but either hath eaten upon the mountains, or defiled his neighbor’s wife,"},{"num":12,"verse":"Or hath oppressed the poor and needy, or hath spoiled by violence, or hath not restored the pledge, or hath lifted up his eyes unto the idols, or hath committed abomination,"},{"num":13,"verse":"Or hath given forth upon usury, or hath taken increase, shall he live? he shall not live: seeing he hath done all these abominations, he shall die the death, and his blood shall be upon him."},{"num":14,"verse":"¶ But if he beget a son, that seeth all his father’s sins, which he hath done, and feareth, neither doeth such like,"},{"num":15,"verse":"That hath not eaten upon the mountains, neither hath lifted up his eyes to the idols of the house of Israel, nor hath defiled his neighbor’s wife,"},{"num":16,"verse":"Neither hath oppressed any, nor hath withheld the pledge, neither hath spoiled by violence, but hath given his bread to the hungry, and hath covered the naked with a garment,"},{"num":17,"verse":"Neither hath withdrawn his hand from the afflicted, nor received usury nor increase, but hath executed my judgments, and hath walked in my statutes, he shall not die in the iniquity of his father, but he shall surely live."},{"num":18,"verse":"His father, because he cruelly oppressed and spoiled his brother by violence, and hath not done good among his people, lo, even he dieth in his iniquity."},{"num":19,"verse":"Yet say ye, Wherefore shall not the son bear the iniquity of the father? because the son hath executed judgment and justice, and hath kept all my statutes, and done them, he shall surely live."},{"num":20,"verse":"The same soul that sinneth, shall die: the son shall not bear the iniquity of the father, neither shall the father bear the iniquity of the son, but the righteousness of the righteous shall be upon him, and the wickedness of the wicked shall be upon himself."},{"num":21,"verse":"But if the wicked will return from all his sins that he hath committed, and keep all my statutes, and do that which is lawful and right, he shall surely live, and shall not die."},{"num":22,"verse":"All his transgressions that he hath committed, they shall not be mentioned unto him, but in his righteousness that he hath done, he shall live."},{"num":23,"verse":"Have I any desire that the wicked should die, saith the Lord God? or shall he not live, if he return from his ways?"},{"num":24,"verse":"But if the righteous turn away from his righteousness, and commit iniquity, and do according to all the abominations that the wicked man doeth, shall he live? all his righteousness that he hath done, shall not be mentioned: but in his transgression that he hath committed, and in his sin that he hath sinned, in them shall he die."},{"num":25,"verse":"Yet ye say, The way of the Lord is not equal: hear now, O house of Israel. Is not my way equal? or are not your ways unequal?"},{"num":26,"verse":"For when a righteous man turneth away from his righteousness, and commiteth iniquity, he shall even die for the same, he shall even die for his iniquity that he hath done."},{"num":27,"verse":"Again, when the wicked turneth away from his wickedness that he hath committed, and doeth that which is lawful and right, he shall save his soul alive."},{"num":28,"verse":"Because he considereth, and turneth away from all his transgressions that he hath committed, he shall surely live, and shall not die."},{"num":29,"verse":"Yet saith the house of Israel, The way of the Lord is not equal. O house of Israel, are not my ways equal? or are not your ways unequal?"},{"num":30,"verse":"Therefore I will judge you, O house of Israel, everyone according to his ways, saith the Lord God: return therefore, and cause others to turn away from all your transgressions: so iniquity shall not be your destruction."},{"num":31,"verse":"Cast away from you all your transgressions, whereby ye have transgressed and make you a new heart and a new spirit: for why will ye die, O house of Israel?"},{"num":32,"verse":"For I desire not the death of him that dieth, saith the Lord God: cause therefore one another to return, and live ye."}]