[{"header":"God Is Fair"},{"num":18,"verse":"The Lord spoke his word to me. He said: "},{"num":2,"verse":"“What do you mean by using this saying about the land of Israel:"},{"num":3,"verse":"“As surely as I live, says the Lord God, this is true: You will not use this saying in Israel anymore. "},{"num":4,"verse":"Every living thing belongs to me. The life of the father is mine. And the life of the son is mine. The person who sins will die."},{"num":5,"verse":"“There may be a good person. This person does what is fair and right. "},{"num":6,"verse":"He does not eat at the mountain places of worship. He does not look to the idols of Israel for help. He does not commit adultery with his neighbor’s wife. He does not have physical relations with a woman during her time of monthly bleeding. "},{"num":7,"verse":"He does not mistreat anyone. But he returns what was given as a promise for a loan. He does not rob other people. He gives bread to hungry people. He gives clothes to those who have no clothes. "},{"num":8,"verse":"He does not lend money to get too much interest or profit. He keeps his hand from doing wrong. He judges fairly between men. "},{"num":9,"verse":"He lives by my rules and obeys my laws faithfully. The person who does all these things is good. He will surely live, says the Lord God."},{"num":10,"verse":"“But this person might have a wild son who murders people. This son may do any of these other bad things. "},{"num":11,"verse":"(But the father himself has not done any of these things.) This son eats at the mountain places of worship. He commits adultery with his neighbor’s wife. "},{"num":12,"verse":"He mistreats the poor and needy. He steals things. He refuses to return what was promised for a loan. He looks to idols for help. He does things which I hate. "},{"num":13,"verse":"He lends money for too much interest and profit. Will this son live? No, he will not live! He has done all these hated things. He will surely be put to death. He will be responsible for his own sins."},{"num":14,"verse":"“But this son might have a son who has seen the sins his father did. But after seeing them, he does not do those things. "},{"num":15,"verse":"He does not eat at the mountain places of worship. He does not look to the idols of Israel for help. He does not commit adultery with his neighbor’s wife. "},{"num":16,"verse":"He does not mistreat anyone. He does not keep something promised for a loan. He does not steal. But he gives bread to the hungry people. He gives clothes to people without clothes. "},{"num":17,"verse":"He keeps his hand from doing wrong. He does not take too much interest or profit when he lends money. He obeys my laws and lives by my rules. He will not die for his father’s sin. He will surely live. "},{"num":18,"verse":"But his father took other people’s money unfairly. He robbed his brother. He did what was wrong among his people. So he will die for his own sin."},{"num":19,"verse":"“But you ask, ‘Why is the son not punished for the father’s sin?’ The son has done what is fair and right. He obeys all my rules. So he will surely live. "},{"num":20,"verse":"It is the person who sins that will die. The son will not be punished for the father’s sin. The father will not be punished for the son’s sin. The person who does right is responsible for his own goodness. The evil person is responsible for his own evil."},{"num":21,"verse":"“But the evil person might stop doing all the sins he has done. And he might obey all my rules and do what is fair and right. Then he will surely live. He will not die. "},{"num":22,"verse":"His sins will be forgotten. Now he does what is right. So he will live. "},{"num":23,"verse":"I do not really want the evil person to die, says the Lord God. I want him to stop his bad ways and live."},{"num":24,"verse":"“But a person who does right might stop doing good and do wrong. And he might do the same hated things an evil person does. Will he live? All his good acts will be forgotten. This is because he became unfaithful. He has sinned. So he will die because of his sins."},{"num":25,"verse":"“But you say, ‘What the Lord does isn’t fair.’ Hear now, people of Israel. I am fair. It is what you do that is not fair! "},{"num":26,"verse":"A good person might stop doing good. He might do wrong and die because of it. He will die because he did wrong. "},{"num":27,"verse":"An evil person might stop doing the evil things he has done. And he might do what is fair and right. He will save his life. "},{"num":28,"verse":"He thought about it and stopped doing all the sins he had done. He will surely live. He will not die. "},{"num":29,"verse":"But the people of Israel still say, ‘What the Lord does isn’t fair.’ People of Israel, I am fair. It is what you do that is not fair."},{"num":30,"verse":"“So I will judge you, people of Israel. I will judge each person by what he does, says the Lord God. Change your hearts. Stop all your sinning. Then sin will not bring your ruin. "},{"num":31,"verse":"Get rid of all the sins you have done. And get for yourselves a new heart and a new way to think. Why do you want to die, people of Israel? "},{"num":32,"verse":"I do not want anyone to die. So change your hearts and lives so you may live."}]