[{"header":"Everyone Will Suffer for His Own Sins"},{"num":18,"verse":"Yahweh spoke his word to me. He said, "},{"num":2,"verse":"“What do you mean when you use this proverb about the land of Israel: ‘Fathers have eaten sour grapes, and their children’s teeth are set on edge’? "},{"num":3,"verse":"As I live, declares Adonay Yahweh, you will no longer use this proverb in Israel. "},{"num":4,"verse":"The life of every person belongs to me. Fathers and their children belong to me. The person who sins will die."},{"num":5,"verse":"“Suppose a righteous person does what is fair and right. "},{"num":6,"verse":"He doesn’t eat at the illegal mountain worship sites or look for help from the idols of the nation of Israel. He doesn’t dishonor his neighbor’s wife or have sexual intercourse with a woman while she is having her period. "},{"num":7,"verse":"He doesn’t oppress anyone. He returns what a borrower gives him as security for a loan. He doesn’t rob anyone. He gives food to people who are hungry, and he gives clothes to those who are naked. "},{"num":8,"verse":"He doesn’t lend money for interest or make an excessive profit. He refuses to do evil things, and he judges everyone fairly. "},{"num":9,"verse":"He lives by my rules and obeys my laws faithfully. This person is righteous. He will certainly live,” declares Adonay Yahweh."},{"num":10,"verse":"“But suppose this person has a son who robs and murders. The son does all the things "},{"num":11,"verse":"that his father never did. He eats at the illegal mountain worship sites. He dishonors his neighbor’s wife. "},{"num":12,"verse":"He oppresses the poor and needy. He robs. He doesn’t return the security for a loan. He looks to idols for help. He does disgusting things. "},{"num":13,"verse":"He lends money for interest and makes excessive profits. Will this person live? He will not live. He has done all these disgusting things. So he must die, and he will be responsible for his own death."},{"num":14,"verse":"“But suppose this person has a son. The son sees all the sins that his father does. He is afraid, so he doesn’t do such things. "},{"num":15,"verse":"He doesn’t eat at the illegal mountain worship sites or look for help from the idols of the nation of Israel. He doesn’t dishonor his neighbor’s wife. "},{"num":16,"verse":"He doesn’t oppress anyone. He doesn’t keep the security for a loan. He doesn’t rob anyone. He gives food to people who are hungry, and he gives clothes to those who are naked. "},{"num":17,"verse":"He refuses to hurt the poor. He doesn’t charge interest or make excessive profits. He obeys my rules and lives by my laws. He won’t die for his father’s sins. He will certainly live. "},{"num":18,"verse":"But his father has oppressed others, robbed his relative, and done what is wrong among his people. So the father will die because of his sin."},{"num":19,"verse":"“But you ask, ‘Why isn’t the son punished for his father’s sin?’ It is because the son has done what is fair and right. He obeyed my rules and followed them. He will certainly live. "},{"num":20,"verse":"The person who sins will die. A son will not be punished for his father’s sins, and a father will not be punished for his son’s sins. The righteousness of the righteous person will be his own, and the wickedness of the wicked person will be his own."},{"num":21,"verse":"“But suppose a wicked person turns away from all the sins that he has done. He obeys all my laws and does what is fair and right. He will certainly live. He will not die. "},{"num":22,"verse":"All the rebellious things that he did will not be remembered. He will live because of the right things that he did. "},{"num":23,"verse":"I don’t want wicked people to die.” declares Adonay Yahweh. “I want them to turn from their evil ways and live."},{"num":24,"verse":"“But suppose a righteous person turns away from doing right and he does evil things. He does all the disgusting things that the wicked person did. Will he live? All the right things that he has done will not be remembered because of his unfaithfulness and because of his sin. He will die because of them."},{"num":25,"verse":"“But you say, ‘Adonay’s way is unfair.’ Listen, nation of Israel, isn’t my way fair? Isn’t it your ways that are unfair? "},{"num":26,"verse":"When a righteous person turns away from doing right and does evil things, he will die. He will die because of the evil things he has done. "},{"num":27,"verse":"When a wicked person turns away from the wicked things that he has done and does what is fair and right, he will live. "},{"num":28,"verse":"He realized what he was doing and turned away from all the rebellious things that he had done. He will certainly live. He will not die."},{"num":29,"verse":"“But the nation of Israel says, ‘Adonay’s way is unfair.’ Isn’t my way fair, nation of Israel? Isn’t it your ways that are unfair?"},{"num":30,"verse":"“That is why I will judge each of you by what you have done, people of Israel,” declares Adonay Yahweh. “Change the way you think and act. Turn away from all the rebellious things that you have done so that you will not fall into sin. "},{"num":31,"verse":"Stop all the rebellious things that you are doing. Get yourselves new hearts and new spirits. Why do you want to die, nation of Israel? "},{"num":32,"verse":"I don’t want anyone to die,” declares Adonay Yahweh. “Change the way you think and act!”"}]