[{"num":20,"verse":"Now Pashhur son of Immer, the priest, who was [also] chief officer in the house of the Lord, heard Jeremiah prophesying these things."},{"num":2,"verse":"Then Pashhur beat Jeremiah the prophet and put him in the stocks that were at the upper Benjamin Gate by the house of the Lord."},{"num":3,"verse":"And the next day Pashhur brought Jeremiah out of the stocks. Then Jeremiah said to him, The Lord does not call your name Pashhur, but Magor-missabib [terror on every side]."},{"num":4,"verse":"For thus says the Lord: Behold, I will make you a terror to yourself and to all your friends; they will fall by the sword of their enemies while you look on. And I will give all Judah into the hand of the king of Babylon; he will carry them captive to Babylon and will slay them with the sword."},{"num":5,"verse":"Moreover, I will deliver all the riches of this city—all the results of its labors, all its precious things, and all the treasures of the kings of Judah—into the hand of their enemies, who will make them a prey and plunder them and seize them and carry them to Babylon."},{"num":6,"verse":"And you, Pashhur, and all who dwell in your house shall go into captivity; you shall go to Babylon, and there you shall die and be buried, you and all your friends to whom you have prophesied falsely."},{"num":7,"verse":"[But Jeremiah said] O Lord, You have persuaded and deceived me, and I was persuaded and deceived; You are stronger than I am and You have prevailed. I am a laughingstock all the day; everyone mocks me."},{"num":8,"verse":"For whenever I speak, I must cry out and complain; I shout, Violence and destruction! For the word of the Lord has become to me a reproach and a derision and has brought me insult all day long."},{"num":9,"verse":"If I say, I will not make mention of [the Lord] or speak any more in His name, in my mind and heart it is as if there were a burning fire shut up in my bones. And I am weary of enduring and holding it in; I cannot [contain it any longer]."},{"num":10,"verse":"For I have heard many whispering and defaming, [There is] terror on every side! Denounce him! Let us denounce him! Say all my familiar friends, they who watch for my fall, Perhaps he will be persuaded and deceived; then we will prevail against him, and we will get our revenge on him."},{"num":11,"verse":"But the Lord is with me as a mighty and terrible One; therefore my persecutors will stumble, and they will not overcome [me]. They will be utterly put to shame, for they will not deal wisely or prosper [in their schemes]; their eternal dishonor will never be forgotten."},{"num":12,"verse":"But, O Lord of hosts, You Who try the righteous, Who see the heart and the mind, let me see Your vengeance on them, for to You have I revealed and committed my cause."},{"num":13,"verse":"Sing to the Lord! Praise the Lord! For He has delivered the life of the poor and needy from the hands of evildoers."},{"num":14,"verse":"Cursed be the day on which I was born! Let not the day on which my mother bore me be blessed!"},{"num":15,"verse":"Cursed be the man who brought the tidings to my father, saying, A son is born to you!—making him very glad."},{"num":16,"verse":"And let that man be like the cities which the Lord overthrew, and did not relent. Let him hear the [war] cry in the morning and the shouting of alarm at noon,"},{"num":17,"verse":"Because he did not slay me in the womb, so that my mother might have been my grave, and her womb always great."},{"num":18,"verse":"Why did I come out of the womb to see labor and sorrow, that my days should be consumed in shame?"}]