[{"header":"David Spares Saul's Life Again"},{"num":26,"verse":"Some men from Ziph came to Saul at Gibeah and told him that David was hiding on Mount Hachilah at the edge of the Judean wilderness. "},{"num":2,"verse":"Saul went at once with three thousand of the best soldiers in Israel to the wilderness of Ziph to look for David, "},{"num":3,"verse":"and camped by the road on Mount Hachilah. David was still in the wilderness, and when he learned that Saul had come to look for him, "},{"num":4,"verse":"he sent spies and found out that Saul was indeed there. "},{"num":5,"verse":"He went at once and located the exact place where Saul and Abner son of Ner, commander of Saul's army, slept. Saul slept inside the camp, and his men camped around him."},{"num":6,"verse":"Then David asked Ahimelech the Hittite, and Abishai the brother of Joab (their mother was Zeruiah), “Which of you two will go to Saul's camp with me?”"},{"num":7,"verse":"So that night David and Abishai entered Saul's camp and found Saul sleeping in the center of the camp with his spear stuck in the ground near his head. Abner and the troops were sleeping around him. "},{"num":8,"verse":"Abishai said to David, “God has put your enemy in your power tonight. Now let me plunge his own spear through him and pin him to the ground with just one blow—I won't have to strike twice!”"},{"num":9,"verse":"But David said, “You must not harm him! The Lord will certainly punish whoever harms his chosen king. "},{"num":10,"verse":"By the living Lord,” David continued, “I know that the Lord himself will kill Saul, either when his time comes to die a natural death or when he dies in battle. "},{"num":11,"verse":"The Lord forbid that I should try to harm the one whom the Lord has made king! Let's take his spear and his water jar, and go.” "},{"num":12,"verse":"So David took the spear and the water jar from right beside Saul's head, and he and Abishai left. No one saw it or knew what had happened or even woke up—they were all sound asleep, because the Lord had sent a heavy sleep on them all."},{"num":13,"verse":"Then David crossed over to the other side of the valley to the top of the hill, a safe distance away, "},{"num":14,"verse":"and shouted to Saul's troops and to Abner, “Abner! Can you hear me?”"},{"num":15,"verse":"David answered, “Abner, aren't you the greatest man in Israel? So why aren't you protecting your master, the king? Just now someone entered the camp to kill your master. "},{"num":16,"verse":"You failed in your duty, Abner! I swear by the living Lord that all of you deserve to die, because you have not protected your master, whom the Lord made king. Look! Where is the king's spear? Where is the water jar that was right by his head?”"},{"num":17,"verse":"Saul recognized David's voice and asked, “David, is that you, my son?”"},{"num":18,"verse":"And he added, “Why, sir, are you still pursuing me, your servant? What have I done? What crime have I committed? "},{"num":19,"verse":"Your Majesty, listen to what I have to say. If it is the Lord who has turned you against me, an offering to him will make him change his mind; but if some people have done it, may the Lord's curse fall on them. For they have driven me out from the Lord's land to a country where I can only worship foreign gods. "},{"num":20,"verse":"Don't let me be killed on foreign soil, away from the Lord. Why should the king of Israel come to kill a flea like me? Why should he hunt me down like a wild bird?”"},{"num":21,"verse":"Saul answered, “I have done wrong. Come back, David, my son! I will never harm you again, because you have spared my life tonight. I have been a fool! I have done a terrible thing!”"},{"num":22,"verse":"David replied, “Here is your spear, Your Majesty. Let one of your men come over and get it. "},{"num":23,"verse":"The Lord rewards those who are faithful and righteous. Today he put you in my power, but I did not harm you, whom the Lord made king. "},{"num":24,"verse":"Just as I have spared your life today, may the Lord do the same to me and free me from all troubles!”"},{"num":25,"verse":"Saul said to David, “God bless you, my son! You will succeed in everything you do!”"}]