[{"num":15,"verse":"1 By the parable of the vine, 2 and the branches,  5, 6 he declareth how the disciples may bear fruit.  12, 17 He commendeth mutual love. 18 He exhorteth them to bear afflictions patiently, 20 by his own example."},{"num":1,"verse":"I am that true vine, and my Father is that husbandman. "},{"num":2,"verse":"Every branch that beareth not fruit in me, he taketh away: and everyone that beareth fruit, he purgeth it, that it may bring forth more fruit. "},{"num":3,"verse":"Now are ye clean through the word, which I have spoken unto you. "},{"num":4,"verse":"Abide in me, and I in you: as the branch cannot bear fruit of itself, except it abide in the vine, no more can ye, except ye abide in me. "},{"num":5,"verse":"I am that vine: ye are the branches: he that abideth in me, and I in him, the same bringeth forth much fruit: for without me can ye do nothing. "},{"num":6,"verse":"If a man abide not in me, he is cast forth as a branch, and withereth: and men gather them, and cast them into the fire, and they burn. "},{"num":7,"verse":"If ye abide in me, and my words abide in you, ask what ye will, and it shall be done to you. "},{"num":8,"verse":"Herein is my Father glorified, that ye bear much fruit, and be made my disciples. "},{"num":9,"verse":"As the father hath loved me, so have I loved you: continue in that my love. "},{"num":10,"verse":"If ye shall keep my commandments, ye shall abide in my love, as I have kept my Father’s commandments, and abide in his love. "},{"num":11,"verse":"These things have I spoken unto you, that my joy might remain in you, and that your joy might be full. "},{"num":12,"verse":"This is my commandment, that ye love one another, as I have loved you. "},{"num":13,"verse":"Greater love than this hath no man, when any man bestoweth his life for his friends. "},{"num":14,"verse":"Ye are my friends, if ye do whatsoever I command you. "},{"num":15,"verse":"Henceforth call I you not servants: for the servant knoweth not what his master doeth: but I have called you friends: for all things that I have heard of my Father, have I made known to you. "},{"num":16,"verse":"Ye have not chosen me, but I have chosen you, and ordained you, that ye go and bring forth fruits, and that your fruit remain, that whatsoever ye shall ask of the Father in my Name, he may give it you. "},{"num":17,"verse":"These things command I you, that ye love one another. "},{"num":18,"verse":"If the world hate you, ye know that it hated me before you. "},{"num":19,"verse":"If ye were of the world, the world would love his own: but because ye are not of the world, but I have chosen you out of the world, therefore the world hateth you. "},{"num":20,"verse":"Remember the word that I said unto you, The servant is not greater than his master. If they have persecuted me, they will persecute you also: if they have kept my word, they will also keep yours. "},{"num":21,"verse":"But all these things will they do unto you for my Name’s sake, because they have not known him that sent me. "},{"num":22,"verse":"If I had not come and spoken unto them, they should not have had sin: but now have they no cloak for their sin. "},{"num":23,"verse":"He that hateth me, hateth my Father also. "},{"num":24,"verse":"If I had not done works among them which none other man did, they had not had sin: but now have they both seen, and have hated both me, and my Father. "},{"num":25,"verse":"But it is that the word might be fulfilled, that is written in their Law, They hated me without a cause. "},{"num":26,"verse":"But when that Comforter shall come, whom I will send unto you from the Father, even the Spirit of truth, which proceedeth of the Father, he shall testify of me. "},{"num":27,"verse":"And ye shall witness also, because ye have been with me from the beginning. "}]