[{"header":"Jesus the True Vine"},{"num":15,"verse":"“I am the true vine, and my Father is the vintner. "},{"num":2,"verse":"He cuts off every branch that does not produce fruit in me, and he cuts back every branch that does produce fruit, so that it might produce more fruit. "},{"num":3,"verse":"You are already clean because of what I’ve spoken to you."},{"num":4,"verse":"“Abide in me, and I will abide in you. Just as the branch cannot produce fruit by itself unless it abides in the vine, neither can you unless you abide in me. "},{"num":5,"verse":"I am the vine, you are the branches. The one who abides in me while I abide in him produces much fruit, because apart from me you can do nothing. "},{"num":6,"verse":"Unless a person abides in me, he is thrown away like a pruned branch and dries up. People gather such branches, throw them into a fire, and they are burned up."},{"num":7,"verse":"“If you abide in me and my words abide in you, you can ask for anything you want, and you’ll receive it. "},{"num":8,"verse":"This is how my Father is glorified, when you produce a lot of fruit and so prove to be my disciples. "},{"num":9,"verse":"Just as the Father has loved me, so I have loved you. So abide in my love. "},{"num":10,"verse":"If you keep my commandments, you’ll abide in my love, just as I have kept my Father’s commandments and abide in his love. "},{"num":11,"verse":"I’ve told you this, so that my joy may be in you, and that your joy may be complete."},{"num":12,"verse":"“This is my commandment: that you love one another as I have loved you. "},{"num":13,"verse":"No one shows greater love than when he lays down his life for his friends. "},{"num":14,"verse":"You are my friends, if you do what I command you. "},{"num":15,"verse":"I don’t call you servants anymore, because a servant doesn’t know what his master is doing. But I’ve called you friends, because I’ve made known to you everything that I’ve heard from my Father."},{"num":16,"verse":"“You have not chosen me, but I have chosen you. I have appointed you to go and produce fruit that will last, so that whatever you ask the Father in my name, he will give it to you. "},{"num":17,"verse":"I am giving you these commandments so that you may love one another.”"},{"header":"The World’s Hatred"},{"num":18,"verse":"“If the world hates you, you should realize that it hated me before you. "},{"num":19,"verse":"If you belonged to the world, the world would love you as one of its own. But because you do not belong to the world and I have chosen you out of it, the world hates you. "},{"num":20,"verse":"Remember what I told you: ‘A servant is not greater than his master.’ If they persecuted me, they will also persecute you. If they kept my word, they will also keep yours. "},{"num":21,"verse":"They will do all these things to you on account of my name, because they do not know the one who sent me."},{"num":22,"verse":"“If I had not come and spoken to them, they would not have any sin. But now they have no excuse for their sin. "},{"num":23,"verse":"The person who hates me also hates my Father. "},{"num":24,"verse":"If I hadn’t done among them the actions that no one else did, they wouldn’t have any sin. But now they have seen and hated both me and my Father. "},{"num":25,"verse":"But this happened so that what has been written in their Law might be fulfilled: ‘They hated me for no reason.’"},{"num":26,"verse":"“When the Helper comes, whom I will send to you from the Father— the Spirit of Truth, who comes from the Father—he will testify on my behalf. "},{"num":27,"verse":"You will testify also, because you have been with me from the beginning."}]