[{"header":"Jesus teaches union with himself"},{"num":1,"verse":"“I am the real vine, my Father is the vine-dresser. He removes any of my branches which are not bearing fruit and he prunes every branch that does bear fruit to increase its yield. Now, you have already been pruned by my words. You must go on growing in me and I will grow in you. For just as the branch cannot bear any fruit unless it shares the life of the vine, so you can produce nothing unless you go on growing in me. I am the vine itself, you are the branches. It is the man who shares my life and whose life I share who proves fruitful. For the plain fact is that apart from me you can do nothing at all. The man who does not share my life is like a branch that is broken off and withers away. He becomes just like the dry sticks that men pick up and use for the firewood. But if you live your life in me, and my words live in your hearts, you can ask for whatever you like and it will come true for you. This is how my Father will be glorified—in your becoming fruitful and being my disciples."},{"num":9,"verse":"“I have loved you just as the Father has loved me. You must go on living in my love. If you keep my commandments you will live in my love just as I have kept my Father’s commandments and live in his love. I have told you this so that you can share my joy, and that your happiness may be complete. This is my commandment: that you love each other as I have loved you. There is no greater love than this—that a man should lay down his life for his friends. You are my friends if you do what I tell you to do. I shall not call you servants any longer, for a servant does not share his master’s confidence. No, I call you friends, now, because I have told you everything that I have heard from the Father."},{"num":16,"verse":"“It is not that you have chosen me; but it is I who have chosen you. I have appointed you to go and bear fruit that will be lasting; so that whatever you ask the Father in my name, he will give it to you."},{"header":"Jesus speaks of the world’s hatred"},{"num":17,"verse":"“This I command you, love one another! If the world hates you, you know that it hated me first. If you belonged to the world, the world would love its own. But because you do not belong to the world and I have chosen you out of it, the world will hate you. Do you remember what I said to you, ‘The servant is not greater than his master’? If they have persecuted me, they will persecute you as well, but if they have followed my teaching, they will also follow yours. They will do all these things to you as my disciples because they do not know the one who sent me. If I had not come and spoken to them, they would not have been guilty of sin, but now they have no excuse for their sin. The man who hates me, hates my Father as well. If I had not done among them things that no other man has ever done, they would not have been guilty of sin, but as it is they have seen and they have hated both me and my Father. Yet this only fulfils what is written in their Law—‘They hated me without a cause’."},{"num":26,"verse":"But when the helper comes, that is, the Spirit of truth, who comes from the Father and whom I myself will send to you from the Father, he will speak plainly about me. And you yourselves will also speak plainly about me for you have been with me from the first."}]