[{"num":26,"verse":"Then Agrippa said to Paul, `You may speak for yourself.' So Paul put out his hand and began to speak."},{"num":2,"verse":"`King Agrippa, I am happy to speak for myself before you today. I will talk about all the things the leaders of the Jews have said against me."},{"num":3,"verse":"You know all the ways of the Jews. You know what they believe. So please take time to listen to me."},{"num":4,"verse":"`All the Jews know the way I lived from the time I was young. From the beginning I lived with my own people at Jerusalem."},{"num":5,"verse":"They have known me for a long time. They know, if they would tell it, that I lived like the Pharisee group. They obey the law better than any others who worship God the way we do."},{"num":6,"verse":"I believe that God will keep the promise that he made to our fathers long ago. That is why I am standing here being judged today."},{"num":7,"verse":"All the people of our twelve tribes serve God faithfully day and night. They do this because they believe they will receive what he has promised. Because I believe this, king Agrippa, the Jewish leaders are talking against me."},{"num":8,"verse":"Why is it so hard for any of you to believe that God should raise the dead?"},{"num":9,"verse":"`I used to think that I must do many things against the name of Jesus of Nazareth."},{"num":10,"verse":"I did this in Jerusalem. The chief priests gave me power. I put many of God's people in prison. And when they were killed, I agreed to it."},{"num":11,"verse":"Often I punished them in all the meeting places. I tried to make them say wrong things about Christ. I was very, very angry. I even went to other cities to trouble them.'"},{"num":12,"verse":"`And so I was on my way to the city of Damascus. The chief priests had given me power and a letter."},{"num":13,"verse":"I was on the road at midday, king Agrippa, and I saw a bright light. It came from the sky and was brighter than the light of the sun. It shone all around me and the men who were travelling with me."},{"num":14,"verse":"We all fell to the ground. I heard someone say to me in the Jews' language, \"Saul, Saul, why are you troubling me? You hurt yourself when you kick against the sticks which guide you.\""},{"num":15,"verse":"`I said, \"Who are you, Lord?\" And the Lord said, \"I am Jesus, the one you are troubling."},{"num":16,"verse":"But get up. Stand on your feet. Here is why I have shown myself to you. I have chosen you to work for me. I have chosen you to tell people what you saw when you saw me today. You are to tell them also about the other times when I will show myself to you."},{"num":17,"verse":"I will keep you safe from your own people, the Jews. And I will keep you safe from those who are not Jews. I am sending you to them."},{"num":18,"verse":"I send you to them to open their eyes. Then they will turn from darkness to light. You are to take them out of Satan's power and turn them to God, to be forgiven of their wrong ways. Then they will be among those who are made clean and pure by believing in me.\" '"},{"num":19,"verse":"`So, king Agrippa, I obeyed what the one from heaven told me to do."},{"num":20,"verse":"I told the good news to the people of Damascus and Jerusalem. Then I told it all over Judea. I went to those who are not Jews. I told everyone that they must stop doing wrong things and turn to God. I told them they must show by the way they live that they have stopped doing wrong things."},{"num":21,"verse":"That is why the leaders of the Jews caught me in the temple and tried to kill me."},{"num":22,"verse":"God has always helped me up to today. I have stood and talked to both small people and great people. I have said nothing more than what the prophets and Moses said would happen."},{"num":23,"verse":"They said Christ must suffer. They said he would be the first person to rise from death. He would be the first person to bring news of light to the Jews and those who are not Jews.'"},{"num":24,"verse":"While Paul was saying these things Festus shouted, `Paul, you are crazy! All your book learning is making you crazy.'"},{"num":25,"verse":"Paul said, `No, great ruler Festus, I am not crazy. But what I say is true. It makes good sense."},{"num":26,"verse":"The king knows about these things. I am not afraid to talk to him about them. I am sure that not one of these things happened without his knowing about it. This did not happen in secret."},{"num":27,"verse":"King Agrippa do you believe the prophets? I know you believe them.'"},{"num":28,"verse":"Then Agrippa said to Paul, `You are trying to make me a Christian right away.'"},{"num":29,"verse":"`Right away or later,' said Paul. `I wish that all who hear me today might be what I am. That is, what I am without these chains.'"},{"num":30,"verse":"Then king Agrippa stood up. Festus and Bernice and those who were sitting there with them stood up also."},{"num":31,"verse":"They left the room and talked the matter over. They said, `This man is not doing anything wrong for which he ought to be in prison or die.'"},{"num":32,"verse":"Agrippa said to Festus, `We could let this man go free if he had not asked to go to Caesar.'"}]