[{"num":26,"verse":"Agrippa said to Paul, “You may speak for yourself.”"},{"num":2,"verse":"“I think myself happy, King Agrippa, that I am to make my defense before you today concerning all the things that I am accused by the Jews, "},{"num":3,"verse":"especially because you are expert in all customs and questions which are among the Jews. Therefore I beg you to hear me patiently."},{"num":4,"verse":"“Indeed, all the Jews know my way of life from my youth up, which was from the beginning among my own nation and at Jerusalem; "},{"num":5,"verse":"having known me from the first, if they are willing to testify, that after the strictest sect of our religion I lived a Pharisee. "},{"num":6,"verse":"Now I stand here to be judged for the hope of the promise made by God to our fathers, "},{"num":7,"verse":"which our twelve tribes, earnestly serving night and day, hope to attain. Concerning this hope I am accused by the Jews, King Agrippa! "},{"num":8,"verse":"Why is it judged incredible with you, if God does raise the dead?"},{"num":9,"verse":"“I myself most certainly thought that I ought to do many things contrary to the name of Jesus of Nazareth. "},{"num":10,"verse":"I also did this in Jerusalem. I both shut up many of the saints in prisons, having received authority from the chief priests, and when they were put to death I gave my vote against them. "},{"num":11,"verse":"Punishing them often in all the synagogues, I tried to make them blaspheme. Being exceedingly enraged against them, I persecuted them even to foreign cities."},{"num":12,"verse":"“Whereupon as I traveled to Damascus with the authority and commission from the chief priests, "},{"num":13,"verse":"at noon, O king, I saw on the way a light from the sky, brighter than the sun, shining around me and those who traveled with me. "},{"num":14,"verse":"When we had all fallen to the earth, I heard a voice saying to me in the Hebrew language, ‘Saul, Saul, why are you persecuting me? It is hard for you to kick against the goads.’"},{"num":15,"verse":"“I said, ‘Who are you, Lord?’"},{"num":16,"verse":"But arise, and stand on your feet, for I have appeared to you for this purpose: to appoint you a servant and a witness both of the things which you have seen, and of the things which I will reveal to you; "},{"num":17,"verse":"delivering you from the people, and from the Gentiles, to whom I send you, "},{"num":18,"verse":"to open their eyes, that they may turn from darkness to light and from the power of Satan to God, that they may receive remission of sins and an inheritance among those who are sanctified by faith in me.’"},{"num":19,"verse":"“Therefore, King Agrippa, I was not disobedient to the heavenly vision, "},{"num":20,"verse":"but declared first to them of Damascus, at Jerusalem, and throughout all the country of Judea, and also to the Gentiles, that they should repent and turn to God, doing works worthy of repentance. "},{"num":21,"verse":"For this reason the Jews seized me in the temple and tried to kill me. "},{"num":22,"verse":"Having therefore obtained the help that is from God, I stand to this day testifying both to small and great, saying nothing but what the prophets and Moses said would happen, "},{"num":23,"verse":"how the Christ must suffer, and how, by the resurrection of the dead, he would be first to proclaim light both to these people and to the Gentiles.”"},{"num":24,"verse":"As he thus made his defense, Festus said with a loud voice, “Paul, you are crazy! Your great learning is driving you insane!”"},{"num":25,"verse":"But he said, “I am not crazy, most excellent Festus, but boldly declare words of truth and reasonableness. "},{"num":26,"verse":"For the king knows of these things, to whom also I speak freely. For I am persuaded that none of these things is hidden from him, for this has not been done in a corner. "},{"num":27,"verse":"King Agrippa, do you believe the prophets? I know that you believe.”"},{"num":28,"verse":"Agrippa said to Paul, “With a little persuasion are you trying to make me a Christian?”"},{"num":29,"verse":"Paul said, “I pray to God, that whether with little or with much, not only you, but also all that hear me today, might become such as I am, except for these bonds.”"},{"num":30,"verse":"The king rose up with the governor, and Bernice, and those who sat with them. "},{"num":31,"verse":"When they had withdrawn, they spoke to one another, saying, “This man does nothing worthy of death or of bonds.” "},{"num":32,"verse":"Agrippa said to Festus, “This man might have been set free if he had not appealed to Caesar.”"}]