[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 13:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 13:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will make thy seed as the dust of the earth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, they shall increase incredibly, and, take them all together, shall be such a multitude as no man can number. When Moses wrote this history, these predictions had been in some measure fulfilled. But the increase of Abram’s seed at that time bore no proportion to what it was in the days of Solomon, when Israel and Judah, without taking his descendants by Ishmael, Esau, and the children he had by his second wife Keturah, into the account at all, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were as many as the sand which is by the sea in multitude. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Now what human foresight could have perceived that this would be the case? And who that was prudent, and professed to be a messenger of God to man, and to be intrusted with the revelation of his counsel, would have ventured to predict such a thing, and thereby to risk his character as a true prophet of the Lord on the accomplishment of the prediction, if he had not known, on the most solid grounds, that God had actually made such a promise? How thankful we ought to be for the demonstration this affords us, that Moses spake by inspiration of God, and that our faith in the divine revelation made by him is built on a firm foundation!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:14-18 Those are best prepared for the visits of Divine grace, whose spirits are calm, and not ruffled with passion. God will abundantly make up in spiritual peace, what we lose for preserving neighbourly peace. When our relations are separated from us, yet God is not. Observe also the promises with which God now comforted and enriched Abram. Of two things he assures him; a good land, and a numerous issue to enjoy it. The prospects seen by faith are more rich and beautiful than those we see around us. God bade him walk through the land, not to think of fixing in it, but expect to be always unsettled, and walking through it to a better Canaan. He built an altar, in token of his thankfulness to God. When God meets us with gracious promises, he expects that we should attend him with humble praises. In outward difficulties, it is very profitable for the true believer to mediate on the glorious inheritance which the Lord has for him at the last.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The man chosen of God now stands alone. He has evinced an humble and self-renouncing spirit. This presents a suitable occasion for the Lord to draw near and speak to His servant. His works are re-assuring. The Lord was not yet done with showing him the land. He therefore calls upon him to look northward and southward and eastward and westward. He then promises again to give all the land which he saw, as far as his eye could reach, to him and to his seed forever. Abram is here regarded as the head of a chosen seed, and hence, the bestowment of this fair territory on the race is an actual grant of it to the head of the race. The term \"forever,\" for a perpetual possession, means as long as the order of things to which it belongs lasts. The holder of a promise has his duties to perform, and the neglect of these really cancels the obligation to perpetuate the covenant. This is a plain point of equity between parties to a covenant, and regulates all that depends on the personal acts of the covenanter. Thirdly, He announces that He will make his seed \"as the dust of the earth.\" This multitude of seed, even when we take the ordinary sense which the form of expression bears in popular use, far transcends the productive powers of the promised land in its utmost extent. Yet to Abram, who was accustomed to the petty tribes that then roved over the pastures of Mesopotamia and Palestine, this disproportion would not be apparent. A people who should fill the land of Canaan, would seem to him innumerable. But we see that the promise begins already to enlarge itself beyond the bounds of the natural seed of Abram. He is again enjoined to walk over his inheritance, and contemplate it in all its length and breadth, with the reiterated assurance that it will be his.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14, 15. Lift up now thine eyes … all the land which thou seest—So extensive a survey of the country, in all directions, can be obtained from no other point in the neighborhood; and those plains and hills, then lying desolate before the eyes of the solitary patriarch, were to be peopled with a mighty nation \"like the dust of the earth in number,\" as they were in Solomon's time (1Ki 4:20).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will make thy seed as the dust of the earth,.... An hyperbolical expression denoting the great multitude of Abram's posterity, as they were in the days of Solomon, and as they will be in the latter day; and especially as this may respect all the spiritual seed of Abram, Jews and Gentiles, and as they will be in the spiritual reign of Christ, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so that if a man can number the dust of the earth, then shall thy seed be numbered; but as it is impossible to do the one, so the other is not practicable, see Numbers 23:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so that if a man can number the dust of the earth, then shall thy seed be numbered; but as it is impossible to do the one, so the other is not practicable, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 23:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I will make thy seed as the dust of the earth: so that if a man can number the dust of the earth, then shall thy seed also be numbered.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as the dust of the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For this simile cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is also from J. Abram’s descendants are elsewhere compared in number to the stars, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 26:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and to the sand which is upon the seashore, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And I will make thy seed as the dust of the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"As the land shall be great for thy people, thy posterity, so thy people shall be great or innumerable for the land\" (Lunge). Afterwards the seed of Abram is likened to the stars of heaven for multitude (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So that if a man can number the dust of the earth, then shall thy seed also be numbered.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After Lot's departure, Jehovah repeated to Abram (by a mental, inward assurance, as we may infer from the fact that אמר \"said\" is not accompanied by ויּרא \"he appeared\") His promise that He would give the land to him and to his seed in its whole extent, northward, and southward, and eastward, and westward, and would make his seed innumerable like the dust of the earth. From this we may see that the separation of Lot was in accordance with the will of God, as Lot had no share in the promise of God; though God afterwards saved him from destruction for Abram's sake. The possession of the land is promised עולם עד \"for ever.\" The promise of God is unchangeable. As the seed of Abraham was to exist before God for ever, so Canaan was to be its everlasting possession. But this applied not to the lineal posterity of Abram, to his seed according to the flesh, but to the true spiritual seed, which embraced the promise in faith, and held it in a pure believing heart. The promise, therefore, neither precluded the expulsion of the unbelieving seed from the land of Canaan, nor guarantees to existing Jews a return to the earthly Palestine after their conversion to Christ. For as Calvin justly says, \"quam terra in saeculum promittitur, non simpliciter notatur perpetuitas; sed quae finem accepit in Christo.\" Through Christ the promise has been exalted from its temporal form to its true essence; through Him the whole earth becomes Canaan (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). That Abram might appropriate this renewed and now more fully expanded promise, Jehovah directed him to walk through the land in the length of it and the breadth of it. In doing this he came in his \"tenting,\" i.e., his wandering through the land, to Hebron, where he settled by the terebinth of the Amorite Mamre (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and built an altar to Jehovah. The term ישׁב (set himself, settled down, sat, dwelt) denotes that Abram made this place the central point of his subsequent stay in Canaan (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). On Hebron, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]