[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Even in laughter the heart is sorrowful.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By this God would teach us that nothing can satisfy the soul of man but Himself, and so would urge us to seek Him, who is the only true object of our desires. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Proverbs",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "HOLLOW LAUGHTER, SOLID JOYProverbs 14:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "HOLLOW LAUGHTER, SOLID JOY",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 14:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " A poet, who used to be more fashionable than he is now, pronounces ‘happiness’ to be our being’s end and aim. That is not true, except under great limitations and with many explanations. It may be regarded as God’s end, but it is ruinous to make it man’s aim. It is by no means the highest conception of the Gospel to say that it makes men happy, however true it may be. The highest is that it makes them good. I put these two texts together, not only because they bring out the contrast between the laughter which is hollow and fleeting and the joy which is perfect and perpetual, but also because they suggest to us the difference in kind and object between earthly and heavenly joys; which difference underlies the other between the boisterous laughter in which is no mirth and no continuance and the joy which is deep and abiding.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In the comparison which I desire to make between these two texts we must begin with that which is deepest, and consider-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The respective objects of earthly and heavenly joy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The respective objects of earthly and heavenly joy.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Our Lord’s wonderful words suggest that they who accept His sayings, that they who have His word abiding in them, have in a very deep sense His joy implanted in their hearts, to brighten and elevate their joys as the sunshine flashes into silver the ripples of the lake. What then were the sources of the calm joys of ‘the Man of Sorrows’? Surely His was the perfect instance of ‘rejoicing in the Lord always’-an unbroken communion with the Father. The consciousness that the divine pleasure ever rested on Him, and that all His thoughts, emotions, purposes, and acts were in perfect harmony with the perfect will of the perfect God, filled His humanity up to the very brim with gladness which the world could not take away, and which remains for us for ever as a type to which all our gladness must be conformed if it is to be worthy of Him and of us. As one of the Psalmists says, God is to be ‘the gladness of our joy.’ It is in Him, gazed upon by the faith and love of an obedient spirit, sought after by aspiration and possessed inwardly in peaceful communion, confirmed by union with Him in the acts of daily obedience, that the true joy of every human life is to be realised. They who have drunk of this deep fountain of gladness will not express their joy in boisterous laughter, which is the hollower the louder it is, and the less lasting the more noisy, but will manifest itself ‘in the depth and not the tumult of the soul.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor must we forget that ‘My joy’ co-existed with a profound experience of sorrow to which no human sorrow was ever like. Let us not forget that, while His joy filled His soul to the brim, He was ‘acquainted with grief’; and let us not wonder if the strange surface contradiction is repeated in ourselves. It is more Christlike to have inexpressibly deep joy with surface sorrow, than to have a shallow laughter masking a hurtful sorrow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We have to set the sources of earthly gladness side by side with those of Christ’s joy to be aware of a contrast. His sprang from within, the world’s is drawn from without. His came from union with the Father, the world’s largely depends on ignoring God. His needed no supplies from the gratifications ministered by sense, and so independent of the presence or absence of such; the world’s need the constant contributions of outward good, and when these are cut off they droop and die. He who depends on outward circumstances for his joy is the slave of externals and the sport of time and chance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The Christian’s joy is full, the world’s partial. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The Christian’s joy is full, the world’s partial.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "All human joys touch but part of our nature, the divine fills and satisfies all. In the former there is always some portion of us unsatisfied, like the deep pits on the moon’s surface into which no light shines, and which show black on the silver face. No human joys wait to still conscience, which sits at the banquet like the skeleton that Egyptian feasters set at their tables. The old story told of a magician’s palace blazing with lighted windows, but there was always one dark;-what shrouded figure sat behind it? Is there not always a surly ‘elder brother’ who will not come in however the musicians may pipe and the servants dance? Appetite may be satisfied, but what of conscience, and reason, and the higher aspirations of the soul? The laughter that echoes through the soul is the hollower the louder it is, and reverberates most through empty spaces.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But when Christ’s joy remains in us our joy will be full. Its flowing tide will rush into and placidly occupy all the else oozy shallows of our hearts, even into the narrowest crannies its penetrating waters will pass, and everywhere will bring a flashing surface that will reflect in our hearts the calm blue above. We need nothing else if we have Christ and His joy within us. If we have everything else, we need His joy within us, else ours will never be full.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The heavenly joys are perpetual, the earthly joys transient. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The heavenly joys are perpetual, the earthly joys transient.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Many of our earthly joys die in the very act of being enjoyed. Those which depend on the gratification of some appetite expire in fruition, and at each recurrence are less and less complete. The influence of habit works in two ways to rob all such joys of their power to minister to us-it increases the appetite and decreases the power of the object to satisfy. Some are followed by swift revulsion and remorse; all soon become stale; some are followed by quick remorse; some are necessarily left behind as we go on in life. To the old man the pleasures of youth are but like children’s toys long since outgrown and left behind. All are at the mercy of externals. Those which we have not left we have to leave. The saddest lives are those of pleasure-seekers, and the saddest deaths are those of the men who sought for joy where it was not to be found, and sought for their gratification in a world which leaves them, and which they have to leave.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a realm where abide ‘fullness of joy and pleasures for ever more.’ Surely they order their lives most wisely who look for their joys to nothing that earth holds, and have taken for their own the ancient vow: ‘Though the fig-tree shall not blossom, neither shall fruit be in the vine. . .. Yet I will rejoice in the Lord, I will joy in the God of my salvation.’ If ‘My joy’ abides in us in its calm and changeless depth, our joy will be ‘full’ whatever our circumstances may be; and we shall hear at last the welcome: ‘Enter thou into the joy of thy Lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 14:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 14:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Even in laughter the heart is sorrowful ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Do not think that every one that laughs is happy, or that profuse and immoderate joy is true pleasure, for the outward signs of it are often mixed with, or end in, real sadness: nay, such is the vanity of this present life, that there is no joy without a mixture of sorrow, which often immediately follows upon it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1 A woman who has no fear of God, who is wilful and wasteful, and indulges her ease, will as certainly ruin her family, as if she plucked her house down. 2. Here are grace and sin in their true colours. Those that despise God's precepts and promises, despise God and all his power and mercy. 3. Pride grows from that root of bitterness which is in the heart. The root must be plucked up, or we cannot conquer this branch. The prudent words of wise men get them out of difficulties. 4. There can be no advantage without something which, though of little moment, will affright the indolent. 5. A conscientious witness will not dare to represent anything otherwise than according to his knowledge. 6. A scorner treats Divine things with contempt. He that feels his ignorance and unworthiness will search the Scriptures in a humble spirit. 7. We discover a wicked man if there is no savour of piety in his discourse. 8. We are travellers, whose concern is, not to spy out wonders, but to get to their journey's end; to understand the rules we are to walk by, also the ends we are to walk toward. The bad man cheats himself, and goes on in his mistake. 9. Foolish and profane men consider sin a mere trifle, to be made light of rather than mourned over. Fools mock at the sin-offering; but those that make light of sin, make light of Christ. 10. We do not know what stings of conscience, or consuming passions, torment the prosperous sinner. Nor does the world know the peace of mind a serious Christian enjoys, even in poverty and sickness. 11. Sin ruins many great families; whilst righteousness often raises and strengthens even mean families. 12. The ways of carelessness, of worldliness, and of sensuality, seem right to those that walk in them; but self-deceivers prove self-destroyers. See the vanity of carnal mirth. 14. Of all sinners backsliders will have the most terror when they reflect on their own ways. 15. Eager readiness to believe what others say, has ever proved mischievous. The whole world was thus ruined at first. The man who is spiritually wise, depends on the Saviour alone for acceptance. He is watchful against the enemies of his salvation, by taking heed to God's word. 16. Holy fear guards against every thing unholy. 17. An angry man is to be pitied as well as blamed; but the revengeful is more hateful.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sorrow of some kind either mingles itself with outward joy, or follows hard upon it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. The preceding sentiment illustrated by the disappointments of a wicked or untimely joy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The outward signs of joy are commonly mixed with or end in real and hearty sorrow. The design of the proverb is to declare the vanity of all worldly joys and comforts, and to teach men moderation in them, and to persuade us to seek for more solid and durable joys. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Even in laughter the heart is sorrowful,.... As Belshazzar's was in the midst of his feast and jollity, when he saw the writing on the wall; so sin may stare a man in the face, and guilt load his conscience and fill him with sorrow, amidst his merriment; a man may put on a merry countenance, and feign a laugh, when his heart is very sorrowful; and oftentimes this sorrow comes by sinful laughter, by mocking at sin and jesting at religion; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the end of that mirth is heaviness: sometimes in this life a sinner mourns at last, and mourns for his wicked mirth, or that he has made himself so merry with religious persons and things, and oftentimes when it is too late; so the end of that mirth the fool in the Gospel promised himself was heaviness, when his soul was required of him; this was the case of the rich man who had his good things here, and his evil things hereafter. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the end of that mirth is heaviness: sometimes in this life a sinner mourns at last, and mourns for his wicked mirth, or that he has made himself so merry with religious persons and things, and oftentimes when it is too late; so the end of that mirth the fool in the Gospel promised himself was heaviness, when his soul was required of him; this was the case of the rich man who had his good things here, and his evil things hereafter. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Even in laughter the heart is sorrowful; {h} and the end of that mirth is heaviness.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Even in laughter the heart is sorrowful; ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and the end of that mirth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " heaviness.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) He shows the allurement to sin, that it seems sweet, but the end of it is destruction.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that mirth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "mirth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The statement is general though not universal. “The bright talker, the merry jester, the singer of the gay song, goes home when the party separates, and on his threshold he meets the veiled sorrow of his life, and plunges into the chilly shadow in which his days are spent.” Horton.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Even in laughter the heart is sorrowful",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ver. 10). This recalls Lucretius's lines (4:1129) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "foreign",
        "text": "\"Medio de fonte leporumSurgit amari aliquid, quod in ipsis fioribus angat.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Medio de fonte leporum",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Surgit amari aliquid, quod in ipsis fioribus angat.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The text is scarcely to be taken as universally true, but either as specially applicable to those mentioned in the preceding verse, or as teaching that the outward mirth often cloaks hidden sorrow (comp. Virgil, 'AEneid,' 1:208, etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the end of that joy is bitterness;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it has in it no element of endurance, and when it is past, the real grief that it masked comes into prominence. In this mortal life also joy and sorrow are strangely intermingled; sorrow fellows closely on the steps of joy; as some one somewhere says, \"The sweetest waters at length find their way to the sea, and are embittered there.\" Lesetre refers to Pascal, 'Pensees,' 2:1: \"Tous se plaignent...de tout pays, de tout temps, de tous ages, et de toutes conditions. Une preuve si longue, si continuelle et si uniforme, devrait bien nous convaincre de l'impuissance ou nous sommes d'arriver au bien par nos efforts: mais l'exemple ne nous intruit point...  Le present ne nous satisfaisant jamais, l'esperance nous pipe, et, de malheur en malheur, nous meue jusqu'a la mort, qui en est le comble eternel. C'est une chose etrange, qu'il n'y a rien dans la nature qui n'ait ete capable de tenir la place de la fin et du bonheur de l'homme .... L'homme etant dechu de son etat naturel, il n'y arien a quoi il n'ait ete capable de so porter. Depuis qu'il a perdu le vrai bien, tout egalement peut lui paraitre tel, jusqu'a ea destruction propre, toute contraire qu'elle est a la raison et a la nature tout ensemble.\" This illustrates also ver. 12. Proverbs like \"There is no rose without a thorn\" are common enough in all languages. The Latins said, \"Ubi uber, ibi tuber;\" and \"Ubi mel, ibi fel.\" Greek experience produced the gnome - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Αρ ἐστὶ συγγενές τι λύπη καὶ βίος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"Sorrow and life are very near of kin.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Who Christian learns another lesson, \"Blessed are they that mourn: for they shall be comforted\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The LXX. has introduced a negative, which gives a sense exactly contrary to the Hebrew and to all the other versions: \"In joys there is no admixture of sorrow, but the final joy cometh unto grief.\" The negative has doubtless crept inadvertently into the text; if it were genuine, the sentence might be explained of the sinner's joy, which he finds for a time and exults in, but which does not last, and is felt to be a delusion as life closes. Proverbs 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13 Even in the midst of laughter the heart experiences sadness;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And to it, joy, the end is sorrow.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Every human heart carries the feeling of disquiet and of separation from its true home, and of the nothingness, the transitoriness of all that is earthly; and in addition to this, there is many a secret sorrow in every one which grows out of his own corporeal and spiritual life, and from his relation to other men; and this sorrow, which is from infancy onward the lot of the human heart, and which more and more depends and diversifies itself in the course of life, makes itself perceptible even in the midst of laughter, in spite of the mirth and merriment, without being able to be suppressed or expelled from the soul, returning always the more intensely, the more violently we may have for a time kept it under and sunk it in unconsciousness. Euchel cites here the words of the poet, according to which 13a is literally true:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"No, man is not made for joy;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Why weep his eyes when in heart he laughs?\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"Nein, der Mensch ist zur Freude nicht gemacht, Darum weint sein Aug' wenn er herzlich lacht.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From the fact that sorrow is the fundamental condition of humanity, and forms the background of laughter, it follows, 13b, that in general it is not good for man to give himself up to joy, viz., sensual (worldly), for to it, joy, the end (the issue) is sorrow. That is true also of the final end, which according to that saying, μακάριοι οἱ κλαίοντες νῦν ὅτι γελάσετε, changes laughter into weeping, and weeping into laughter. The correction אחרית השּׂמחה (Hitzig) presses upon the Mishle style an article in such cases rejected, and removes a form of expression of the Hebr. syntaxis ornata, which here, as at Isaiah 17:6, is easily obviated, but which is warranted by a multitude of other examples, vid., at Proverbs 13:4 (also Proverbs 5:22), and cf. Philippi's Status Const. p. 14f., who regards the second word, as here שׂמהה, after the Arab., as accus. But in cases like שׂנאי שׁקר, although not in cases such as Ezra 2:62, the accus. rendering is tenable, and the Arab. does not at all demand it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From the fact that sorrow is the fundamental condition of humanity, and forms the background of laughter, it follows, 13b, that in general it is not good for man to give himself up to joy, viz., sensual (worldly), for to it, joy, the end (the issue) is sorrow. That is true also of the final end, which according to that saying, μακάριοι οἱ κλαίοντες νῦν ὅτι γελάσετε, changes laughter into weeping, and weeping into laughter. The correction אחרית השּׂמחה (Hitzig) presses upon the Mishle style an article in such cases rejected, and removes a form of expression of the Hebr. syntaxis ornata, which here, as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is easily obviated, but which is warranted by a multitude of other examples, vid., at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 13:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 5:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and cf. Philippi's Status Const. p. 14f., who regards the second word, as here שׂמהה, after the Arab., as accus. But in cases like שׂנאי שׁקר, although not in cases such as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 2:62",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the accus. rendering is tenable, and the Arab. does not at all demand it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Regarding the supplying (ibdâl) of a foregoing genitive or accus. pronoun of the third person by a definite or indefinite following, in the same case as the substantive, Samachschar speaks in the Mufassal, p. 94ff., where, as examples, are found: raeituhu Zeidan, I have seen him, the Zeid; marartu bihi Zeidin, I have gone over with him, the Zeid; saraftu wugûhahâ awwalihâ, in the flight I smote the heads of the same, their front rank. Vid., regarding this anticipation of the definite idea by an indefinite, with explanations of it, Fleischer's Makkar, Additions et Corrections, p. xl. Colossians 2, and Dieterici's Mutanabbi, p. 341, l. 13.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Regarding the supplying (ibdâl) of a foregoing genitive or accus. pronoun of the third person by a definite or indefinite following, in the same case as the substantive, Samachschar speaks in the Mufassal, p. 94ff., where, as examples, are found: raeituhu Zeidan, I have seen him, the Zeid; marartu bihi Zeidin, I have gone over with him, the Zeid; saraftu wugûhahâ awwalihâ, in the flight I smote the heads of the same, their front rank. Vid., regarding this anticipation of the definite idea by an indefinite, with explanations of it, Fleischer's Makkar, Additions et Corrections, p. xl. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Dieterici's Mutanabbi, p. 341, l. 13.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the old Hebr. this solutio of the st. constr. belongs to the elegances of the language; it is the precursor of the vulgar post-bibl. אחרייהּ שׂל־שׂמחה. That the Hebr. may also retain a gen. where more or fewer parts of a sentence intervene between it and its governing word, is shown by such examples as Isaiah 48:9; Isaiah 49:7; Isaiah 61:7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the old Hebr. this solutio of the st. constr. belongs to the elegances of the language; it is the precursor of the vulgar post-bibl. אחרייהּ שׂל־שׂמחה. That the Hebr. may also retain a gen. where more or fewer parts of a sentence intervene between it and its governing word, is shown by such examples as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 48:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 61:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: These examples moreover do not exceed that which is possible in the Arab., vid., regarding this omission of the mudâf, where this is supplied from the preceding before a genitive, Samachschar's Mufassal, p. 34, l. 8-13. Perhaps לחמך, Obadiah 1:7, of thy bread  equals  the (men) of thy bread, is an example of the same thing.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: These examples moreover do not exceed that which is possible in the Arab., vid., regarding this omission of the mudâf, where this is supplied from the preceding before a genitive, Samachschar's Mufassal, p. 34, l. 8-13. Perhaps לחמך, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of thy bread  equals  the (men) of thy bread, is an example of the same thing.) ",
            "children": []
          }
        ]
      }
    ]
  }
]