[[],[{"type":"header","content":"Greetings from Paul"},{"type":"prose","content":"This letter is from Paul, a slave of God and an apostle of Jesus Christ. I have been sent to proclaim faith to those God has chosen and to teach them to know the truth that shows them how to live godly lives."}],[{"type":"prose","content":"This truth gives them confidence that they have eternal life, which God—who does not lie—promised them before the world began."}],[{"type":"prose","content":"And now at just the right time he has revealed this message, which we announce to everyone. It is by the command of God our Savior that I have been entrusted with this work for him."}],[{"type":"prose","content":"I am writing to Titus, my true son in the faith that we share.May God the Father and Christ Jesus our Savior give you grace and peace."}],[{"type":"header","content":"Titus’s Work in Crete"},{"type":"prose","content":"I left you on the island of Crete so you could complete our work there and appoint elders in each town as I instructed you."}],[{"type":"prose","content":"An elder must live a blameless life. He must be faithful to his wife, and his children must be believers who don’t have a reputation for being wild or rebellious."}],[{"type":"prose","content":"A church leader is a manager of God’s household, so he must live a blameless life. He must not be arrogant or quick-tempered; he must not be a heavy drinker, violent, or dishonest with money."}],[{"type":"prose","content":"Rather, he must enjoy having guests in his home, and he must love what is good. He must live wisely and be just. He must live a devout and disciplined life."}],[{"type":"prose","content":"He must have a strong belief in the trustworthy message he was taught; then he will be able to encourage others with wholesome teaching and show those who oppose it where they are wrong."}],[{"type":"prose","content":"For there are many rebellious people who engage in useless talk and deceive others. This is especially true of those who insist on circumcision for salvation."}],[{"type":"prose","content":"They must be silenced, because they are turning whole families away from the truth by their false teaching. And they do it only for money."}],[{"type":"prose","content":"Even one of their own men, a prophet from Crete, has said about them, “The people of Crete are all liars, cruel animals, and lazy gluttons.”"}],[{"type":"prose","content":"This is true. So reprimand them sternly to make them strong in the faith."}],[{"type":"prose","content":"They must stop listening to Jewish myths and the commands of people who have turned away from the truth."}],[{"type":"prose","content":"Everything is pure to those whose hearts are pure. But nothing is pure to those who are corrupt and unbelieving, because their minds and consciences are corrupted."}],[{"type":"prose","content":"Such people claim they know God, but they deny him by the way they live. They are detestable and disobedient, worthless for doing anything good."}]]