[{"num":1,"verse":"Paul the servant of God, and an apostle of Jesus Christ to preach the faith of God’s elect and the knowledge of the truth, which leads to godliness "},{"num":2,"verse":"in the hope of eternal life. Which life God, who cannot lie, promised before the world began, "},{"num":3,"verse":"but has declared his word openly at the time appointed through preaching, which preaching is committed to me by the commandment of God our Saviour."},{"num":4,"verse":"To Titus, his true-born son in the common faith."},{"num":5,"verse":"The reason I left you in Crete was in order that you should complete that which was lacking, and should ordain elders in every city as I directed you – "},{"num":6,"verse":"if any be faultless, the husband of one wife, having faithful children not known for running wild or disobedience. "},{"num":7,"verse":"For a bishop must be faultless, as it becomes the minister of God: not stubborn, not angry, no drunkard, no fighter; not given to the love of money, "},{"num":8,"verse":"but welcoming toward people and willing to take them in; one who loves goodness, sober-minded, righteous, holy, temperate; "},{"num":9,"verse":"and such as cleaves to the true word of doctrine, so that he may be able to exhort with wholesome teaching, and to refute those who speak against it."},{"num":10,"verse":"For there are many contrary, who speak vanity and beguile minds, namely they of the circumcision, "},{"num":11,"verse":"whose mouths must be stopped. They pervert whole houses, teaching things which they ought not, for easy money. "},{"num":12,"verse":"One of them, who was an author of their own, said, The Cretans are always liars, evil creatures and lazy gluttons. "},{"num":13,"verse":"This witness is true. Therefore rebuke them sharply, so that they may be sound in the faith, "},{"num":14,"verse":"and not paying heed to Jewish fables, and to commandments of men that turn from the truth."},{"num":15,"verse":"To the pure all things are pure, but to those who are defiled and unbelieving, nothing is pure, but even their very minds and consciences are defiled. "},{"num":16,"verse":"They confess that they know God, but with their deeds they deny him, and are abominable and obstinately self-willed, not to be trusted for any good works."}]