[{"header":"The Story of the Farmer"},{"num":13,"verse":"That same day Jesus left the house and sat by the Sea of Galilee. "},{"num":2,"verse":"Large crowds gathered around him. So he got into a boat and sat down. All the people stood on the shore. "},{"num":3,"verse":"Then he told them many things using stories. He said, “A farmer went out to plant his seed. "},{"num":4,"verse":"He scattered the seed on the ground. Some fell on a path. Birds came and ate it up. "},{"num":5,"verse":"Some seed fell on rocky places, where there wasn’t much soil. The plants came up quickly, because the soil wasn’t deep. "},{"num":6,"verse":"When the sun came up, it burned the plants. They dried up because they had no roots. "},{"num":7,"verse":"Other seed fell among thorns. The thorns grew up and crowded out the plants. "},{"num":8,"verse":"Still other seed fell on good soil. It produced a crop 100, 60 or 30 times more than what was planted. "},{"num":9,"verse":"Whoever has ears should listen.”"},{"num":10,"verse":"The disciples came to him. They asked, “Why do you use stories when you speak to the people?”"},{"num":11,"verse":"He replied, “Because you have been given the knowledge of the secrets of the kingdom of heaven. It has not been given to outsiders. "},{"num":12,"verse":"Everyone who has this kind of knowledge will be given more knowledge. In fact, they will have very much. If anyone doesn’t have this kind of knowledge, even what little they have will be taken away from them. "},{"num":13,"verse":"Here is why I use stories when I speak to the people. I say,"},{"num":14,"verse":"In them the words of the prophet Isaiah come true. He said,"},{"num":16,"verse":"But blessed are your eyes because they see. And blessed are your ears because they hear. "},{"num":17,"verse":"What I’m about to tell you is true. Many prophets and godly people wanted to see what you see. But they didn’t see it. They wanted to hear what you hear. But they didn’t hear it."},{"num":18,"verse":"“Listen! Here is the meaning of the story of the farmer. "},{"num":19,"verse":"People hear the message about the kingdom but do not understand it. Then the evil one comes. He steals what was planted in their hearts. Those people are like the seed planted on a path. "},{"num":20,"verse":"The seed that fell on rocky places is like other people. They hear the message and at once receive it with joy. "},{"num":21,"verse":"But they have no roots. So they last only a short time. They quickly fall away from the faith when trouble or suffering comes because of the message. "},{"num":22,"verse":"The seed that fell among the thorns is like others who hear the message. But then the worries of this life and the false promises of wealth crowd it out. They keep the message from producing fruit. "},{"num":23,"verse":"But the seed that fell on good soil is like those who hear the message and understand it. They produce a crop 100, 60 or 30 times more than the farmer planted.”"},{"header":"The Story of the Weeds"},{"num":24,"verse":"Jesus told the crowd another story. “Here is what the kingdom of heaven is like,” he said. “A man planted good seed in his field. "},{"num":25,"verse":"But while everyone was sleeping, his enemy came. The enemy planted weeds among the wheat and then went away. "},{"num":26,"verse":"The wheat began to grow and form grain. At the same time, weeds appeared."},{"num":27,"verse":"“The owner’s slaves came to him. They said, ‘Sir, didn’t you plant good seed in your field? Then where did the weeds come from?’"},{"num":28,"verse":"“ ‘An enemy did this,’ he replied."},{"num":29,"verse":"“ ‘No,’ the owner answered. ‘While you are pulling up the weeds, you might pull up the wheat with them. "},{"num":30,"verse":"Let both grow together until the harvest. At that time I will tell the workers what to do. Here is what I will say to them. First collect the weeds. Tie them in bundles to be burned. Then gather the wheat. Bring it into my storeroom.’ ”"},{"header":"The Stories of the Mustard Seed and the Yeast"},{"num":31,"verse":"Jesus told the crowd another story. He said, “The kingdom of heaven is like a mustard seed. Someone took the seed and planted it in a field. "},{"num":32,"verse":"It is the smallest of all seeds. But when it grows, it is the largest of all garden plants. It becomes a tree. Birds come and rest in its branches.”"},{"num":33,"verse":"Jesus told them still another story. “The kingdom of heaven is like yeast,” he said. “A woman mixed it into 60 pounds of flour. The yeast worked its way all through the dough.”"},{"num":34,"verse":"Jesus spoke all these things to the crowd using stories. He did not say anything to them without telling a story. "},{"num":35,"verse":"So the words spoken by the prophet came true. He had said,"},{"header":"Jesus Explains the Story of the Weeds"},{"num":36,"verse":"Then Jesus left the crowd and went into the house. His disciples came to him. They said, “Explain to us the story of the weeds in the field.”"},{"num":37,"verse":"He answered, “The one who planted the good seed is the Son of Man. "},{"num":38,"verse":"The field is the world. The good seed stands for the people who belong to the kingdom. The weeds are the people who belong to the evil one. "},{"num":39,"verse":"The enemy who plants them is the devil. The harvest is judgment day. And the workers are angels."},{"num":40,"verse":"“The weeds are pulled up and burned in the fire. That is how it will be on judgment day. "},{"num":41,"verse":"The Son of Man will send out his angels. They will weed out of his kingdom everything that causes sin. They will also get rid of all who do evil. "},{"num":42,"verse":"They will throw them into the blazing furnace. There people will weep and grind their teeth. "},{"num":43,"verse":"Then God’s people will shine like the sun in their Father’s kingdom. Whoever has ears should listen."},{"header":"The Stories of the Hidden Treasure and the Pearl"},{"num":44,"verse":"“The kingdom of heaven is like treasure that was hidden in a field. When a man found it, he hid it again. He was very happy. So he went and sold everything he had. And he bought that field."},{"num":45,"verse":"“Again, the kingdom of heaven is like a trader who was looking for fine pearls. "},{"num":46,"verse":"He found one that was very valuable. So he went away and sold everything he had. And he bought that pearl."},{"header":"The Story of the Net"},{"num":47,"verse":"“Again, the kingdom of heaven is like a net. It was let down into the lake. It caught all kinds of fish. "},{"num":48,"verse":"When it was full, the fishermen pulled it up on the shore. Then they sat down and gathered the good fish into baskets. But they threw the bad fish away. "},{"num":49,"verse":"This is how it will be on judgment day. The angels will come. They will separate the people who did what is wrong from those who did what is right. "},{"num":50,"verse":"They will throw the evil people into the blazing furnace. There the evil ones will weep and grind their teeth."},{"num":51,"verse":"“Do you understand all these things?” Jesus asked."},{"num":52,"verse":"He said to them, “Every teacher of the law who has become a disciple in the kingdom of heaven is like the owner of a house. He brings new treasures out of his storeroom as well as old ones.”"},{"header":"A Prophet Without Honor"},{"num":53,"verse":"Jesus finished telling these stories. Then he moved on from there. "},{"num":54,"verse":"He came to his hometown of Nazareth. There he began teaching the people in their synagogue. They were amazed. “Where did this man get this wisdom? Where did he get this power to do miracles?” they asked. "},{"num":55,"verse":"“Isn’t this the carpenter’s son? Isn’t his mother’s name Mary? Aren’t his brothers James, Joseph, Simon and Judas? "},{"num":56,"verse":"Aren’t all his sisters with us? Then where did this man get all these things?” "},{"num":57,"verse":"They were not pleased with him at all."},{"num":58,"verse":"He did only a few miracles in Nazareth because the people there had no faith."}]