[{"header":"Chapter 10"},{"num":1,"verse":"Saul Is Anointed. Samuel took a flask of oil, and he poured it upon his head. He kissed him and said, “Has not the Lord anointed you as leader over his inheritance?"},{"num":2,"verse":"When you leave me today, you will encounter two men near the Tomb of Rachel on the border of Benjamin. They will say to you, ‘The donkeys that you were looking for have been found. Your father has stopped worrying about the donkeys and has begun to worry about you saying, “What shall I do about my son?” ’"},{"num":3,"verse":"“From there you are to continue on until you arrive at the Terebinth of Tabor. Three men who are on their way to God in Bethel will meet you there. One will be bringing three young goats, another three loaves of bread, and the third a bottle of wine."},{"num":4,"verse":"They will greet you and give you two loaves of bread. Take them from them."},{"num":5,"verse":"Signs and Prophecies. “After that go to Gibeath-elohim where there is a Philistine outpost. As you approach the city, you will meet a band of prophets coming down from the high places with lyres, tambourines, flutes, and harps being played before them. They will be prophesying."},{"num":6,"verse":"The Spirit of the Lord will rush upon you, and you will prophesy with them, for you will be changed into another person."},{"num":7,"verse":"Once these signs occur, do whatever comes to hand, for God is with you."},{"num":8,"verse":"Precede me to Gilgal, and I will come down to be with you and to offer burnt offerings and to sacrifice peace offerings. You are to wait for seven days until I come to you and show you what to do.”"},{"num":9,"verse":"The Signs Fulfilled. When Saul turned around to leave Samuel, God changed his heart. All those signs were fulfilled that day."},{"num":10,"verse":"When they arrived at Gibeah, they were met by a band of prophets. The Spirit of the Lord rushed upon him and he prophesied among them."},{"num":11,"verse":"When all of those who had known him saw him prophesying among the prophets, they said to one another, “What has happened to the son of Kish? Is Saul also one of the prophets?”"},{"num":12,"verse":"A man who lived there asked, “Who is their father?” This is why it became a saying, “Is Saul also one of the prophets?”"},{"num":13,"verse":"After Saul stopped prophesying, he went up to the high places."},{"num":14,"verse":"Saul’s uncle asked him and his servant, “Where have you been?” He answered, “Looking for the donkeys. When we realized that we could not find them, we went to Samuel.”"},{"num":15,"verse":"Saul’s uncle said, “Tell me what Samuel said to you.”"},{"num":16,"verse":"Saul said to his uncle, “He informed us that the donkeys had been found.” He did not tell him about what Samuel had said concerning the kingdom."},{"num":17,"verse":"Saul Is Chosen King. Samuel summoned the people of Israel to Mizpah."},{"num":18,"verse":"He said to the Israelites, “Thus says the Lord, the God of Israel, ‘I brought Israel up from Egypt and delivered them out of the hands of the Egyptians and all of the nations that oppressed you.’"},{"num":19,"verse":"But today you have rejected your God who himself delivers you from all of your adversities and difficulties. You have said to him, ‘Appoint a king over us.’ Now present yourselves before the Lord by tribes and by clans.”"},{"num":20,"verse":"When Samuel had all of the tribes of Israel approach him, the tribe of Benjamin was chosen by lot."},{"num":21,"verse":"Then he had the tribe of Benjamin approach him clan by clan, and the clan of Matri was chosen. Finally Saul, the son of Kish, was chosen. But when they looked for him, he could not be found."},{"num":22,"verse":"They then asked the Lord, “Has the man arrived yet?” The Lord answered, “Yes, he has hidden himself among the baggage.”"},{"num":23,"verse":"They ran and brought him back from there. When he stood among the people he was a head taller than any of them."},{"num":24,"verse":"Samuel said to all the people, “Do you see whom the Lord has chosen? There is no one else like him among the people.” All the people cried out, “Long live the king.”"},{"num":25,"verse":"Samuel instructed the people concerning the ordinances of the kingdom. He wrote this in a book and placed it before the Lord. Then Samuel dismissed all of the people, each to his own home."},{"num":26,"verse":"Saul also went home to Gibeah, and he was accompanied by a group of brave men whose hearts God had touched."},{"num":27,"verse":"But some sons of Belial said, “How can this one save us?” They held him in contempt and brought him no gifts, but he held his peace."}]