[{"num":10,"verse":"Then Samuel took a flask of olive oil and poured it over Saul’s head, and kissed him on the cheek and said,"},{"num":2,"verse":"When you leave me, you will see two men beside Rachel’s tomb at Zelzah, in the land of Benjamin; they will tell you that the donkeys have been found and that your father is worried about you and is asking, ‘How am I to find my son?’ "},{"num":3,"verse":"And when you get to the oak of Tabor, you will see three men coming toward you who are on their way to worship God at the altar at Bethel; one will be bringing three young goats, another will have three loaves of bread, and the third will have a bottle of wine. "},{"num":4,"verse":"They will greet you and offer you two of the loaves, which you are to accept. "},{"num":5,"verse":"After that you will come to Gibeath-elohim, also known as “God’s Hill,” where the garrison of the Philistines is. As you arrive there you will meet a band of prophets coming down the hill playing a psaltery, a timbrel, a flute, and a harp, and prophesying as they come."},{"num":6,"verse":"“At that time the Spirit of the Lord will come mightily upon you and you will prophesy with them, and you will feel and act like a different person. "},{"num":7,"verse":"From that time on your decisions should be based on whatever seems best under the circumstances, for the Lord will guide you. "},{"num":8,"verse":"Go to Gilgal and wait there seven days for me, for I will be coming to sacrifice burnt offerings and peace offerings. I will give you further instructions when I arrive.”"},{"num":9,"verse":"As Saul said good-bye and started to go, God gave him a new attitude, and all of Samuel’s prophecies came true that day. "},{"num":10,"verse":"When Saul and the servant arrived at the Hill of God, they saw the prophets coming toward them, and the Spirit of God came upon him, and he too began to prophesy."},{"num":11,"verse":"When his friends heard about it, they exclaimed, “What? Saul a prophet?” "},{"num":12,"verse":"And one of the neighbors added, “With a father like his?” So that is the origin of the proverb, “Is Saul a prophet too?”"},{"num":13,"verse":"When Saul had finished prophesying he climbed the hill to the altar."},{"num":14,"verse":"“Where in the world did you go?” Saul’s uncle asked him."},{"num":15,"verse":"“Oh? And what did he say?” his uncle asked."},{"num":16,"verse":"“He said the donkeys had been found!” Saul replied. (But he didn’t tell him that he had been anointed as king!)"},{"num":17,"verse":"Samuel now called a convocation of all Israel at Mizpah "},{"num":18,"verse":"and gave them this message from the Lord God: “I brought you from Egypt and rescued you from the Egyptians and from all of the nations that were torturing you. But although I have done so much for you, you have rejected me and have said, ‘We want a king instead!’ All right, then, present yourselves before the Lord by tribes and clans.”"},{"num":20,"verse":"So Samuel called the tribal leaders together before the Lord, and the tribe of Benjamin was chosen by sacred lot. "},{"num":21,"verse":"Then he brought each family of the tribe of Benjamin before the Lord, and the family of the Matrites was chosen. And finally the sacred lot selected Saul, the son of Kish. But when they looked for him, he had disappeared!"},{"num":22,"verse":"So they asked the Lord, “Where is he? Is he here among us?”"},{"num":23,"verse":"So they found him and brought him out, and he stood head and shoulders above anyone else."},{"num":24,"verse":"Then Samuel said to all the people, “This is the man the Lord has chosen as your king. There isn’t his equal in all of Israel!”"},{"num":25,"verse":"Then Samuel told the people again what the rights and duties of a king were; he wrote them in a book and put it in a special place before the Lord. Then Samuel sent the people home again."},{"num":26,"verse":"When Saul returned to his home at Gibeah, a band of men whose hearts the Lord had touched became his constant companions. "},{"num":27,"verse":"There were, however, some bums and loafers who exclaimed, “How can this man save us?” And they despised him and refused to bring him presents, but he took no notice."}]