[{"num":21,"verse":"M’nasheh was twelve years old when he began his reign, and he ruled for fifty-five years in Yerushalayim. His mother’s name was Heftzibah. "},{"num":2,"verse":"He did what was evil from Adonai’s perspective, following the disgusting practices of the nations whom Adonai had expelled ahead of the people of Isra’el. "},{"num":3,"verse":"For he rebuilt the high places Hizkiyahu his father had destroyed; he erected altars for Ba‘al and made an asherah, as had Ach’av king of Isra’el; and he worshipped all the army of heaven and served them. "},{"num":4,"verse":"He erected altars in the house of Adonai, about which Adonai had said, “In Yerushalayim I will put my name.” "},{"num":5,"verse":"He erected altars for all the army of heaven in the two courtyards of the house of Adonai. "},{"num":6,"verse":"He made his son pass through the fire [as a sacrifice]. He practiced soothsaying and divination and appointed mediums and persons who used spirit guides. He did much that was evil from Adonai’s perspective, thus provoking him to anger. "},{"num":7,"verse":"He set the carved image for the asherah he had made in the house concerning which Adonai had told David and Shlomo his son, “In this house and in Yerushalayim, which I have chosen out of all the tribes of Isra’el, I will put my name forever. "},{"num":8,"verse":"Also I will not have the feet of Isra’el wander any longer out of the land which I gave their ancestors — if only they will take heed to obey every order I have given them and live in accordance with all the Torah that my servant Moshe ordered them to obey.” "},{"num":9,"verse":"But they did not take heed; and M’nasheh misled them into doing even worse things than the nations Adonai had destroyed ahead of the people of Isra’el."},{"num":10,"verse":"Adonai spoke this message through his servants the prophets: "},{"num":11,"verse":"“Because M’nasheh king of Y’hudah has done these disgusting things; because he has done things more wicked than anything the Emori, who were there before him, did; also because with his idols he made Y’hudah sin; "},{"num":12,"verse":"therefore here is what Adonai the God of Isra’el, says: ‘I am going to bring such calamity on Yerushalayim and Y’hudah that the ears of all who hear of it will tingle. "},{"num":13,"verse":"I will measure Yerushalayim with the same measuring cord that I used over Shomron, the same plumbline as for the house of Ach’av. I will scour Yerushalayim clean just as one scours a plate, scouring it and then turning it upside down. "},{"num":14,"verse":"I will abandon the remnant of my heritage, delivering them into the power of their enemies — they will become prey and plunder for all their enemies; "},{"num":15,"verse":"because they have done what is evil from my perspective and have provoked me to anger from the day their ancestors came out of Egypt to this very day.’”"},{"num":16,"verse":"Moreover, M’nasheh shed so much innocent blood that he flooded Yerushalayim from one end to the other — this in addition to his sin through which he caused Y’hudah to sin by doing what is evil from Adonai’s perspective."},{"num":17,"verse":"Other activities of M’nasheh, all his accomplishments and the sin he committed are recorded in the Annals of the Kings of Y’hudah. "},{"num":18,"verse":"Then M’nasheh slept with his ancestors and was buried in the garden of his own house, the Garden of ‘Uza; and Amon his son took his place as king."},{"num":19,"verse":"Amon was twenty-two years old when he began his reign, and he ruled for two years in Yerushalayim. His mother’s name was Meshulemet the daughter of Harutz from Yotvah. "},{"num":20,"verse":"He did what was evil from Adonai’s perspective, as had M’nasheh his father. "},{"num":21,"verse":"He followed entirely the manner of life of his father, serving the idols that his father served and worshipping them. "},{"num":22,"verse":"He abandoned Adonai, the God of his ancestors, and did not live in Adonai’s way."},{"num":23,"verse":"Amon’s servants conspired against him and put the king to death in his own palace. "},{"num":24,"verse":"But the people of the land put to death all those who had been part of the conspiracy against King Amon. Then the people of the land made Yoshiyahu his son king in place of him."},{"num":25,"verse":"Other activities of Amon and all he acomplished are recorded in the Annals of the Kings of Y’hudah. "},{"num":26,"verse":"Amon was buried in his tomb in the Garden of Uza, and Yoshiyahu his son took his place as king."}]