[{"num":2,"verse":"I am the flower of the field, and the lily of the valleys."},{"num":2,"verse":"As the lily among thorns, so is my love among the daughters."},{"num":3,"verse":"As the apple tree among the trees of the woods, so is my beloved among the sons. I sat down under his shadow, whom I desired: and his fruit was sweet to my palate."},{"num":4,"verse":"He brought me into the cellar of wine, he set in order charity in me."},{"num":5,"verse":"Stay me up with flowers, compass me about with apples: because I languish with love."},{"num":6,"verse":"His left hand is under my head, and his right hand shall embrace me."},{"num":7,"verse":"I adjure you, O ye daughters of Jerusalem, by the roes, and the harts of the, fields, that you stir not up, nor make the beloved to awake, till she please."},{"num":8,"verse":"The voice of my beloved, behold he cometh leaping upon the mountains, skipping over the hills."},{"num":9,"verse":"My beloved is like a roe, or a young hart. Behold he standeth behind our wall, looking through the windows, looking through the lattices."},{"num":10,"verse":"Behold my beloved speaketh to me: Arise, make haste, my love, my dove, my beautiful one, and come."},{"num":11,"verse":"For winter is now past, the rain is over and gone."},{"num":12,"verse":"The flowers have appeared in our land, the time of pruning is come: the voice of the turtle is heard in our land:"},{"num":13,"verse":"The fig tree hath put forth her green figs: the vines in flower yield their sweet smell. Arise, my love, my beautiful one, and come:"},{"num":14,"verse":"My dove in the clefts of the rock, in the hollow places of the wall, shew me thy face, let thy voice sound in my ears: for thy voice is sweet, and thy face comely."},{"num":15,"verse":"Catch us the little foxes that destroy the vines: for our vineyard hath flourished."},{"num":16,"verse":"My beloved to me, and I to him who feedeth among the lilies,"},{"num":17,"verse":"Till the day break, and the shadows retire. Return: be like, my beloved, to a roe, or to a young hart upon the mountains of Bether."}]