[{"num":2,"verse":"3 The Church desireth to rest under the shadow of Christ. 8 She heareth his voice. 14 She is compared to the dove. 15 And the enemies to the foxes."},{"num":1,"verse":"I am the rose of the field, and the lily of the valleys."},{"num":2,"verse":"Like a lily among the thorns, so is my love among the daughters."},{"num":3,"verse":"Like the apple tree among the trees of the forest, so is my well-beloved among the sons of men: under his shadow had I delight, and sat down: and his fruit was sweet unto my mouth."},{"num":4,"verse":"He brought me into the wine cellar, and love was his banner over me."},{"num":5,"verse":"Stay me with flagons, and comfort me with apples: for I am sick of love."},{"num":6,"verse":"His left hand is under mine head, and his right hand doth embrace me."},{"num":7,"verse":"I charge you, O daughters of Jerusalem, by the roes and by the hinds of the field, that ye stir not up, nor waken my love, until she please."},{"num":8,"verse":"It is the voice of my well-beloved: behold, he cometh leaping by the mountains, and skipping by the hills."},{"num":9,"verse":"My well-beloved is like a roe, or a young hart: lo, he standeth behind our wall, looking forth of the windows, showing himself through the grates."},{"num":10,"verse":"My well-beloved spake and said unto me, Arise, my love, my fair one, and come thy way."},{"num":11,"verse":"For behold, winter is past: the rain is changed, and is gone away."},{"num":12,"verse":"The flowers appear in the earth: the time of the singing of birds is come, and the voice of the turtle is heard in our land."},{"num":13,"verse":"The fig tree hath brought forth her young figs: and the vines with their small grapes have cast a savor: arise my love, my fair one, and come away."},{"num":14,"verse":"My dove, that art in the holes of the rock, in the secret places of the stairs, show me thy sight, let me hear thy voice: for thy voice is sweet, and thy sight comely."},{"num":15,"verse":"Take us the foxes, the little foxes, which destroy the vines: for our vines have small grapes."},{"num":16,"verse":"My well-beloved is mine, and I am his: he feedeth among the lilies,"},{"num":17,"verse":"Until the daybreak, and the shadows flee away: return, my well-beloved, and be like a roe, or a young hart upon the mountains of Bether."}]