[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And Moses made a serpent of brass.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The old serpent was the cause of death, temporal and spiritual. Christ Jesus, “in the likeness of sinful flesh” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), was made sin for us (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Corinthians 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and thus fulfilled, as He Himself explained to Nicodemus, the type of the brazen serpent (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The meaning of this type, or “sign of salvation,” is explained in the Book of Wisdom in these words, “He that turned himself toward it was not saved by the thing that he saw, but by Thee, that art the Saviour of all” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This serpent was preserved by the Israelites, and taken into Canaan, and was ultimately destroyed by King Hezekiah, after it had become an object of idolatrous worship (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Kings 18:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:4-9 The children of Israel were wearied by a long march round the land of Edom. They speak discontentedly of what God had done for them, and distrustfully of what he would do. What will they be pleased with, whom manna will not please? Let not the contempt which some cast on the word of God, make us value it less. It is the bread of life, substantial bread, and will nourish those who by faith feed upon it, to eternal life, whoever may call it light bread. We see the righteous judgment God brought upon them for murmuring. He sent fiery serpents among them, which bit or stung many to death. It is to be feared that they would not have owned the sin, if they had not felt the smart; but they relent under the rod. And God made a wonderful provision for their relief. The Jews themselves say it was not the sight of the brazen serpent that cured; but in looking up to it, they looked up to God as the Lord that healed them. There was much gospel in this. Our Saviour declared, Joh 3:14,15, that as Moses lifted up the serpent in the wilderness, so the Son of man must be lifted up, that whatsoever believeth in him, should not perish. Compare their disease and ours. Sin bites like a serpent, and stings like an adder. Compare the application of their remedy and ours. They looked and lived, and we, if we believe, shall not perish. It is by faith that we look unto Jesus, Heb 12:2. Whosoever looked, however desperate his case, or feeble his sight, or distant his place, was certainly and perfectly cured. The Lord can relieve us from dangers and distresses, by means which human reason never would have devised. Oh that the venom of the old serpent, inflaming men's passions, and causing them to commit sins which end in their eternal destruction, were as sensibly felt, and the danger as plainly seen, as the Israelites felt pain from the bite of the fiery serpents, and feared the death which followed! Then none would shut their eyes to Christ, or turn from his gospel. Then a crucified Saviour would be so valued, that all things else would be accounted loss for him; then, without delay, and with earnestness and simplicity, all would apply to him in the appointed way, crying, Lord, save us; we perish! Nor would any abuse the freeness of Christ's salvation, while they reckoned the price which it cost him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Make thee a fiery serpent - i. e. a serpent resembling in appearance the reptiles which attacked the people. The resemblance was of the essence of the symbolism (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As the brass serpent represented the instrument of their chastisement, so the looking unto it at God's word denoted acknowledgment of their sin, longing for deliverance from its penalty, and faith in the means appointed by God for healing. In the serpent of brass, harmless itself, but made in the image of the creature that is accursed above others ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Christian fathers rightly see a figure of Him ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who though \"holy, harmless, undefiled, separate from sinners\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was yet \"made sin\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and \"made a curse for us\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the eye of faith fixed on Him beholds the manifestation at once of the deserts of sin, of its punishment imminent and deprecated, and of the method of its remission devised by God Himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7-9. the people came to Moses, and said, We have sinned—The severity of the scourge and the appalling extent of mortality brought them to a sense of sin, and through the intercessions of Moses, which they implored, they were miraculously healed. He was directed to make the figure of a serpent in brass, to be elevated on a pole or standard, that it might be seen at the extremities of the camp and that every bitten Israelite who looked to it might be healed. This peculiar method of cure was designed, in the first instance, to show that it was the efficacy of God's power and grace, not the effect of nature or art, and also that it might be a type of the power of faith in Christ to heal all who look to Him because of their sins (Joh 3:14, 15; see also on [86]2Ki 18:4).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He was delivered from death, and cured of his disease. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Moses made a serpent of brass,.... Which was the most proper metal to make it of, that it might resemble the fiery serpents, whether of a golden or scarlet colour: and Diodorus Siculus (d) speaks of some of the colour of brass, whose bite was immediately followed with death, and by which, if anyone was struck, he was seized with terrible pains, and a bloody sweat flowed all over him; and this was chosen also, because being burnished and bright, could be seen at a great distance, and with this metal Moses might be furnished from Punon, the next station to this, where they now were, Zalmonah, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 33:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a place famous for brass mines, and which Jerom (e) says, in his time, was a little village, from whence brass metal was dug, by such that were condemned to the mines: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and put it upon a pole; as he was directed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and it came to pass, that if a serpent had bitten any man, when he beheld the serpent of brass, he lived: which was very marvellous, and the more so, if what physicians say is true, as Kimchi relates (f), that if a man bitten by a serpent looks upon a piece of brass he dies immediately: the lifting up of this serpent on a pole for such a purpose was a figure of the lifting up of Christ, either upon the cross, or in the ministry of the word, that whosoever looks unto him by faith may have healing; see Gill on John 3:14,where this type or figure is largely explained: the station the Israelites were now at, when this image was made, is called Zalmonah, which signifies an image, shadow, or resemblance, as the brazen serpent was; from Mount Hor, where they were last, to this place, according to Bunting (g), were twenty eight miles: this serpent did not remain in the place where it was set, but was taken with them, and continued until the days of Hezekiah, 2 Kings 18:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and it came to pass, that if a serpent had bitten any man, when he beheld the serpent of brass, he lived: which was very marvellous, and the more so, if what physicians say is true, as Kimchi relates (f), that if a man bitten by a serpent looks upon a piece of brass he dies immediately: the lifting up of this serpent on a pole for such a purpose was a figure of the lifting up of Christ, either upon the cross, or in the ministry of the word, that whosoever looks unto him by faith may have healing; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",where this type or figure is largely explained: the station the Israelites were now at, when this image was made, is called Zalmonah, which signifies an image, shadow, or resemblance, as the brazen serpent was; from Mount Hor, where they were last, to this place, according to Bunting (g), were twenty eight miles: this serpent did not remain in the place where it was set, but was taken with them, and continued until the days of Hezekiah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Bibliothec. l. 17. p. 560. (e) De locis Heb. fol. 91. G. (f) Sepher Sherash. rad. (g) Travels of the Patriarchs, &c. 83. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Bibliothec. l. 17. p. 560. (e) De locis Heb. fol. 91. G. (f) Sepher Sherash. rad. (g) Travels of the Patriarchs, &c. 83. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Moses made a serpent of brass, and put it upon a pole, and it came to pass, that if a serpent had bitten any man, when he beheld the serpent of brass, he lived.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moses made a serpent of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "bronze",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The removing of a pest by means of a bronze image of it finds parallels in ancient Europe. See Gray, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Numb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 276.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:10-11",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Numbers 21:10-11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". P ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stages in the journey to the east of Moab",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Stages in the journey to the east of Moab",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The site of Oboth is unknown; ‘somewhere on the flinty plateau to the east of Edom, the Ard Suwwan or Flint Ground, Arabia Petraea’ (G. A. Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "H. G. [Note: . G. Historical Geography of the Holy Land.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "557). Iye-abarim (Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Iyyê-hâ‘abhârîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘the Ruins of the ‘Abharim’) is stated to lie ‘over against Moab, on the sunrise (i.e. the eastern) side.’ ‘The ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Abharim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ means ‘the parts on the other side,’ a name which was given to the district on the east of the Dead Sea, looked at from the point of view of a dweller in Palestine: cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 27:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 33:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. The name distinguishes it from the Iyim of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which was in Judah, close to the Edomite border.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Many writers assign ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Numbers 21:10-11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 21:10-11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " to P , since the names Oboth and Iye-abarim recur in the list in ch. 33, which is from the hand of a priestly writer, and are found nowhere else in the O.T. According to that list (41–44) the itinerary was as follows: Mt Hor, Zalmonah, Punon, Oboth, Iye-abarim. The sites of Zalmonah and Punon are quite unknown. But the writer of 33, who clearly intends to trace the journey as completely as possible, omits all reference to the detour by the way to the Red Sea. If, therefore, Mt Hor is the modern Jebel Madurah (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") on the west of Edom, and Iye-abarim is somewhere on the eastern border of Moab, it seems probable that the priestly traditions represented Israel as marching straight through Edom. Whether the account of the hostility of the king of Edom was unknown to P , or whether it was, for some reason, intentionally omitted, we cannot say. But it is noteworthy that in Dt. also there is no mention of it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When he beheld the serpent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "גָחָשׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in all three places of this verse) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "of brass, he lived.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The record is brief and simple in the extreme, and tells nothing but the bare facts. The author of the Book of Wisdom understood the true bearing of those facts when he called the brazen serpent a ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σύμβολον σωτηρρίας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Wisdom 16:6), and when he wrote ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὁ ἐπιστραφεὶς οὐ διὰ τὸ θεωρούμενον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the thing he looked at) ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐσώζετο ἀλλὰ διὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σὲ τὸν πάντων σωτῆρα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". At an earlier day Hezekiah had estimated the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σύμβολον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σωτηρίας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at its true value, as being in itself worthless, and under certain circumstances mischievous (see on 2 Kings 18:4). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " CHAPTER 21:10-35 THE END OF JOURNEYS, THE BEGINNING OF VICTORIES (verse 10-",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Numbers 21:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At the command of God, Moses made a brazen serpent, and put it upon a standard.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: For the different views held by early writers concerning the brazen serpent, see Buxtorf, historia serp. aen., in his Exercitt. pp. 458ff.; Deyling, observatt. ss. ii. obs. 15, pp. 156ff.; Vitringa, observ. Songs 1, pp. 403ff.; Jo. Marck, Scripturariae Exercitt. exerc. 8, pp. 465ff.; Iluth, Serpens exaltatus non contritoris sed conterendi imago, Erl. 1758; Gottfr. Menken on the brazen serpent; Sack, Apologetick, 2 Ausg. pp. 355ff. Hoffmann, Weissagung u. Erfllung, ii. pp. 142, 143; Kurtz, History of the Old Covenant, iii. 345ff.; and the commentators on John 3:14 and John 3:15.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: For the different views held by early writers concerning the brazen serpent, see Buxtorf, historia serp. aen., in his Exercitt. pp. 458ff.; Deyling, observatt. ss. ii. obs. 15, pp. 156ff.; Vitringa, observ. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Songs 1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", pp. 403ff.; Jo. Marck, Scripturariae Exercitt. exerc. 8, pp. 465ff.; Iluth, Serpens exaltatus non contritoris sed conterendi imago, Erl. 1758; Gottfr. Menken on the brazen serpent; Sack, Apologetick, 2 Ausg. pp. 355ff. Hoffmann, Weissagung u. Erfllung, ii. pp. 142, 143; Kurtz, History of the Old Covenant, iii. 345ff.; and the commentators on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Whoever then of the persons bitten by the poisonous serpents looked at the brazen serpent with faith in the promise of God, lived, i.e., recovered from the serpent's bite. The serpent was to be made of brass or copper, because the colour of this metal, when the sun was shining upon it, was most like the appearance of the fiery serpents; and thus the symbol would be more like the thing itself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Even in the book of Wis. (Numbers 16:6-7), the brazen serpent is called \"a symbol of salvation; for he that turned himself toward it was not saved by the thing that he saw, but by Thee, that art the Saviour of all.\" It was not merely intended, however, as Ewald supposes (Gesch. ii. p. 228), as a \"sign that just as this serpent hung suspended in the air, bound and rendered harmless by the command of Jehovah, so every one who looked at this with faith in the redeeming power of Jehovah, was secured against the evil, - a figurative sign, therefore, like that of St. George and the Dragon among ourselves;\" for, according to this, there would be no internal causal link between the fiery serpents and the brazen image of a serpent. It was rather intended as a figurative representation of the poisonous serpents, rendered harmless by the mercy of God. For God did not cause a real serpent to be taken, but the image of a serpent, in which the fiery serpent was stiffened, as it were, into dead brass, as a sign that the deadly poison of the fiery serpents was overcome in this brazen serpent. This is not to be regarded as a symbol of the divine healing power; nor is the selection of such a symbol to be deduced and explained, as it is by Winer, Kurtz, Knobel, and others, from the symbolical view that was common to all the heathen religions of antiquity, that the serpent was a beneficent and health-bringing power, which led to its being exalted into a symbol of the healing power, and a representation of the gods of healing. This heathen view is not only foreign to the Old Testament, and without any foundation in the fact that, in the time of Hezekiah, the people paid a superstitious worship to the brazen serpent erected by Moses (2 Kings 18:4); but it is irreconcilably opposed to the biblical view of the serpent, as the representative of evil, which was founded upon Genesis 3:15, and is only traceable to the magical art of serpent-charming, which the Old Testament abhorred as an idolatrous abomination. To this we may add, that the thought which lies at the foundation of this explanation, viz., that poison is to be cured by poison, has no support in Hosea 13:4, but is altogether foreign to the Scriptures. God punishes sin, it is true, by sin; but He neither cures sin by sin, nor death by death. On the contrary, to conquer sin it was necessary that the Redeemer should be without sin; and to take away its power from death, it was requisite that Christ, the Prince of life, who had life in Himself, should rise again from death and the grave (John 5:26; John 11:25; Acts 3:15; 2 Timothy 1:10).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Even in the book of Wis. (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 16:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the brazen serpent is called \"a symbol of salvation; for he that turned himself toward it was not saved by the thing that he saw, but by Thee, that art the Saviour of all.\" It was not merely intended, however, as Ewald supposes (Gesch. ii. p. 228), as a \"sign that just as this serpent hung suspended in the air, bound and rendered harmless by the command of Jehovah, so every one who looked at this with faith in the redeeming power of Jehovah, was secured against the evil, - a figurative sign, therefore, like that of St. George and the Dragon among ourselves;\" for, according to this, there would be no internal causal link between the fiery serpents and the brazen image of a serpent. It was rather intended as a figurative representation of the poisonous serpents, rendered harmless by the mercy of God. For God did not cause a real serpent to be taken, but the image of a serpent, in which the fiery serpent was stiffened, as it were, into dead brass, as a sign that the deadly poison of the fiery serpents was overcome in this brazen serpent. This is not to be regarded as a symbol of the divine healing power; nor is the selection of such a symbol to be deduced and explained, as it is by Winer, Kurtz, Knobel, and others, from the symbolical view that was common to all the heathen religions of antiquity, that the serpent was a beneficent and health-bringing power, which led to its being exalted into a symbol of the healing power, and a representation of the gods of healing. This heathen view is not only foreign to the Old Testament, and without any foundation in the fact that, in the time of Hezekiah, the people paid a superstitious worship to the brazen serpent erected by Moses (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but it is irreconcilably opposed to the biblical view of the serpent, as the representative of evil, which was founded upon ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and is only traceable to the magical art of serpent-charming, which the Old Testament abhorred as an idolatrous abomination. To this we may add, that the thought which lies at the foundation of this explanation, viz., that poison is to be cured by poison, has no support in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 13:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but is altogether foreign to the Scriptures. God punishes sin, it is true, by sin; but He neither cures sin by sin, nor death by death. On the contrary, to conquer sin it was necessary that the Redeemer should be without sin; and to take away its power from death, it was requisite that Christ, the Prince of life, who had life in Himself, should rise again from death and the grave (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 5:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The brazen serpent became a symbol of salvation on the three grounds which Luther pointed out. In the first place, the serpent which Moses was to make by the command of God was to be of brass or copper, that is to say, of a reddish colour, and (although without poison) altogether like the persons who were red and burning with heat because of the bite of the fiery serpents. In the second place, the brazen serpent was to be set up upon a pole for a sign. And in the third place, those who desired to recover from the fiery serpent's bite and live, were to look at the brazen serpent upon the pole, otherwise they could not recover or live (Luther's Sermon on John 3:1-15). It was in these three points, as Luther has also clearly shown, that the typical character of this symbol lay, to which Christ referred in His conversation with Nicodemus (John 3:14). The brazen serpent had the form of a real serpent, but was \"without poison, and altogether harmless.\" So God sent His Son in the form of sinful flesh, and yet without sin (Romans 8:3; 2 Corinthians 5:21; 1 Peter 2:22-24). - 2. In the lifting up of the serpent as a standard. This was a δειγματίζειν ἐν παρρησίᾳ, a ́ (a \"showing openly,\" or \"triumphing\"), a triumphal exhibition of the poisonous serpents as put to death in the brazen image, just as the lifting up of Christ upon the cross was a public triumph over the evil principalities and powers below the sky (Colossians 2:14-15). - 3. In the cure effected through looking at the image of the serpent. Just as the Israelites had to turn their eyes to the brazen serpent in believing obedience to the word of the Lord, in order to be cured of the bite of the poisonous serpents, so much we look with faith at the Son of man lifted up upon the cross, if we would be delivered from the bite of the old serpent, from sin, death, the devil, and hell. \"Christ is the antitype of the serpent, inasmuch as He took upon Himself the most pernicious of all pernicious potencies, viz., sin, and made a vicarious atonement for it\" (Hengstenberg on John 3:14). The brazen image of the serpent was taken by the Israelites to Canaan, and preserved till the time of Hezekiah, who had it broken in pieces, because the idolatrous people had presented incense-offerings to this holy relic (2 Kings 18:4). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The brazen serpent became a symbol of salvation on the three grounds which Luther pointed out. In the first place, the serpent which Moses was to make by the command of God was to be of brass or copper, that is to say, of a reddish colour, and (although without poison) altogether like the persons who were red and burning with heat because of the bite of the fiery serpents. In the second place, the brazen serpent was to be set up upon a pole for a sign. And in the third place, those who desired to recover from the fiery serpent's bite and live, were to look at the brazen serpent upon the pole, otherwise they could not recover or live (Luther's Sermon on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:1-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It was in these three points, as Luther has also clearly shown, that the typical character of this symbol lay, to which Christ referred in His conversation with Nicodemus (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The brazen serpent had the form of a real serpent, but was \"without poison, and altogether harmless.\" So God sent His Son in the form of sinful flesh, and yet without sin (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 5:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:22-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). - 2. In the lifting up of the serpent as a standard. This was a δειγματίζειν ἐν παρρησίᾳ, a ́ (a \"showing openly,\" or \"triumphing\"), a triumphal exhibition of the poisonous serpents as put to death in the brazen image, just as the lifting up of Christ upon the cross was a public triumph over the evil principalities and powers below the sky (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 2:14-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). - 3. In the cure effected through looking at the image of the serpent. Just as the Israelites had to turn their eyes to the brazen serpent in believing obedience to the word of the Lord, in order to be cured of the bite of the poisonous serpents, so much we look with faith at the Son of man lifted up upon the cross, if we would be delivered from the bite of the old serpent, from sin, death, the devil, and hell. \"Christ is the antitype of the serpent, inasmuch as He took upon Himself the most pernicious of all pernicious potencies, viz., sin, and made a vicarious atonement for it\" (Hengstenberg on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The brazen image of the serpent was taken by the Israelites to Canaan, and preserved till the time of Hezekiah, who had it broken in pieces, because the idolatrous people had presented incense-offerings to this holy relic (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]