[[],[{"type":"header","content":"The Banquets of the King"},{"type":"prose","content":"It was in the days of Ahasuerus (Xerxes) who reigned from India to Ethiopia (Cush) over 127 provinces, "}],[{"type":"prose","content":"in those days when King Ahasuerus sat on his royal throne which was at the citadel in Susa [the capital of the Persian Empire], "}],[{"type":"prose","content":"in the third year of his reign he held a banquet for all his officials and his attendants. The army  of Persia and Media, the nobles and the officials of the provinces were there in his presence. "}],[{"type":"prose","content":"And he displayed the riches of his glorious kingdom and the splendor of his great majesty for many days, 180 days ."}],[{"type":"prose","content":"When these days were completed, the king held a banquet for all the people who were present at the citadel in Susa [the capital], from the greatest [in importance] to the least, a seven-day feast in the courtyard of the garden of the king’s palace. "}],[{"type":"prose","content":" (draperies) of fine white and violet linen fastened with cords of fine purple linen to silver rings and marble columns. The couches of gold and silver  on a mosaic floor of porphyry, marble, mother-of-pearl, and precious  stones. "}],[{"type":"prose","content":"Drinks were served in various kinds of golden goblets, and the royal wine was plentiful, in accordance with the generosity of the king. "}],[{"type":"prose","content":"The drinking was  in accordance with the law; no one was compelled [to drink], for the king had directed each official of his household to comply with each guest’s wishes. "}],[{"type":"prose","content":"Queen Vashti also held a [separate] banquet for the women in the palace of King Ahasuerus."}],[{"type":"header","content":"Queen Vashti’s Refusal"},{"type":"prose","content":"On the seventh day, when the king’s heart was joyful with wine (in high spirits), he commanded Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carkas, the seven eunuchs who served in the presence of King Ahasuerus [as his attendants], "}],[{"type":"prose","content":"to bring Queen Vashti before the king, wearing her royal crown (high turban), to display her beauty before the people and the officials, for she was lovely to see. "}],[{"type":"prose","content":"But Queen Vashti refused to come at the king’s command, which was delivered [to her] by the eunuchs. So the king became extremely angry and burned with rage."}],[{"type":"prose","content":"Then the king spoke to the wise men who understood the times [asking for their advice]—for it was the custom of the king  before all those who were familiar with law and legal matters— "}],[{"type":"prose","content":"and who were close to him [as advisors]: Carshena, Shethar, Admatha, Tarshish, Meres, Marsena, and Memucan, the seven officials of Persia and Media who had access to the king and were ranked highest in the kingdom. "}],[{"type":"prose","content":"[He said,] “According to the law, what is to be done with Queen Vashti because she did not obey the command of King Ahasuerus  by the eunuchs?” "}],[{"type":"prose","content":"And Memucan answered in the presence of the king and the officials, “Vashti the queen has not only wronged the king but [also] all the officials (royal representatives) and all the peoples who are in all the provinces of King Ahasuerus. "}],[{"type":"prose","content":"For the queen’s conduct will become known to all women, causing them to look on their husbands with contempt (disrespect), since they will say, ‘King Ahasuerus commanded Queen Vashti to be brought before him, but she did not come.’ "}],[{"type":"prose","content":"This [very] day the ladies of Persia and Media who have heard of the queen’s refusal will speak [in the same way] to all the king’s officials, and there will be plenty of contempt and anger. "}],[{"type":"prose","content":"If it pleases the king, let a royal command be issued by him and let it be written in the laws of the Persians and Medes so that it cannot be repealed  modified, that Vashti is no longer to come before King Ahasuerus; and let the king give her royal position to another who is better  more worthy than she. "}],[{"type":"prose","content":"So when the king’s great decree is proclaimed throughout his [extensive] kingdom, all women will give honor to their husbands, from the great to the insignificant.”"}],[{"type":"prose","content":"This statement (advice) pleased the king and the officials, and the king did what Memucan proposed. "}],[{"type":"prose","content":"So he sent letters to all the royal provinces, to each province in its own script and to each people in their own language, saying that every man should be the master  rule in his own home and that he should speak [in the household] in the language of his own people."}]]