[{"header":"The Wealth of King Ahasuerus"},{"num":1,"verse":"This is a record of what happened during the reign of Ahasuerus, the Ahasuerus who ruled over 127 provinces from India to Cush. "},{"num":2,"verse":"At that time King Ahasuerus was ruling from Susa the capital. "},{"num":3,"verse":"In the third year of his reign, he gave a banquet for all his officials and ministers, and the military leaders of Persia and Media, the nobles, and the provincial officials were present. "},{"num":4,"verse":"He displayed the enormous wealth of his kingdom, along with its splendid beauty and greatness for many days—for 180 days in all."},{"header":"The Banquet of King Ahasuerus"},{"num":5,"verse":"When those days were over, the king held a seven-day banquet in the courtyard of the garden of his palace for all the people who were present in Susa the capital, from the greatest to the least important. "},{"num":6,"verse":"There were curtains of white and blue linen tied with cords of fine linen and purple material to silver rings on marble columns. There were couches of gold and silver on a mosaic pavement of porphyry, marble, mother-of-pearl and other precious stones. "},{"num":7,"verse":"Drinks were served in gold vessels of various kinds, and there was plenty of royal wine because the king was generous. "},{"num":8,"verse":"According to the king’s decree the drinking was not compulsory because the king instructed every steward in his house to serve each individual what he desired. "},{"num":9,"verse":"Queen Vashti also held a banquet in the royal palace of King Ahasuerus for the women."},{"header":"Vashti Refuses to Obey the King"},{"num":10,"verse":"A week later, when the king was under the influence of all that wine, he ordered Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carcas, the seven eunuchs who served King Ahasuerus, "},{"num":11,"verse":"to bring Queen Vashti to the king, wearing the royal crown to display her beauty to the people and the officials, since she was lovely to look at. "},{"num":12,"verse":"Queen Vashti refused to come at the king’s order that was brought by the eunuchs."},{"header":"The King Removes Vashti as Queen"},{"num":13,"verse":"The king spoke to the wise men who understood the times, for it was the king’s custom to consult all those who understood law and justice. "},{"num":14,"verse":"(His closest advisors were: Carshena, Shethar, Admatha, Tarshish, Meres, Marsena, and Memucan, the seven officials of Persia and Media who had direct access to the king and who held the highest rank in the kingdom.) "},{"num":15,"verse":"The king inquired, “According to law, what should be done to Queen Vashti because she did not obey the order of King Ahasuerus that was delivered by the eunuchs?”"},{"num":16,"verse":"Then Memucan replied in the presence of the king and his officials, “It is not the king alone whom Vashti has wronged, but rather all of the officials and all of the people who are in the provinces of King Ahasuerus. "},{"num":17,"verse":"When the report about the queen goes out to all the women, it will cause them to despise their husbands. They’ll say, ‘King Ahasuerus ordered Queen Vashti to be brought before him, but she wouldn’t come.’ "},{"num":18,"verse":"This very day the wives of the officials of Persia and Media who hear the report about the queen will speak in the same way to all the officials of the king, and there will be more than enough contempt and anger. "},{"num":19,"verse":"If it seems good to the king, let a royal decree go out from him and let it be written in the laws of Persia and Media, which cannot be repealed, that Vashti is never again to enter the presence of King Ahasuerus. Let the king give her royal position to another woman who is better than she. "},{"num":20,"verse":"When the edict of the king that he issues is heard throughout his kingdom—for it’s vast—then all the women will give honor to their husbands, from the greatest to the least important.”"},{"num":21,"verse":"This seemed like a good idea to the king and his officials, so the king did what Memucan suggested. "},{"num":22,"verse":"He sent letters to all the provinces of the king, written in the script of that province, and to each people in their own language, ordering that every man should be the master in his house and speak the language of his own people."}]