[{"num":10,"verse":"Lord, why are you standing aloof and far away? Why do you hide when I need you the most?"},{"num":2,"verse":"Come and deal with all these proud and wicked men who viciously persecute the poor. Pour upon these men the evil they planned for others! "},{"num":3,"verse":"For these men brag of all their evil lusts; they revile God and congratulate those the Lord abhors, whose only goal in life is money."},{"num":4,"verse":"These wicked men, so proud and haughty, seem to think that God is dead. They wouldn’t think of looking for him! "},{"num":5,"verse":"Yet there is success in everything they do, and their enemies fall before them. They do not see your punishment awaiting them. "},{"num":6,"verse":"They boast that neither God nor man can ever keep them down—somehow they’ll find a way!"},{"num":7,"verse":"Their mouths are full of profanity and lies and fraud. They are always boasting of their evil plans. "},{"num":8,"verse":"They lurk in dark alleys of the city and murder passersby. "},{"num":9,"verse":"Like lions they crouch silently, waiting to pounce upon the poor. Like hunters they catch their victims in their traps. "},{"num":10,"verse":"The unfortunate are overwhelmed by their superior strength and fall beneath their blows. "},{"num":11,"verse":"“God isn’t watching,” they say to themselves; “he’ll never know!”"},{"num":12,"verse":"O Lord, arise! O God, crush them! Don’t forget the poor or anyone else in need. "},{"num":13,"verse":"Why do you let the wicked get away with this contempt for God? For they think that God will never call them to account. "},{"num":14,"verse":"Lord, you see what they are doing. You have noted each evil act. You know what trouble and grief they have caused. Now punish them. O Lord, the poor man trusts himself to you; you are known as the helper of the helpless. "},{"num":15,"verse":"Break the arms of these wicked men. Go after them until the last of them is destroyed."},{"num":16,"verse":"The Lord is King forever and forever. Those who follow other gods shall be swept from his land."},{"num":17,"verse":"Lord, you know the hopes of humble people. Surely you will hear their cries and comfort their hearts by helping them. "},{"num":18,"verse":"You will be with the orphans and all who are oppressed, so that mere earthly man will terrify them no longer."}]