[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-5 The angel showed Joshua, the high priest, to Zechariah, in a vision. Guilt and corruption are great discouragements when we stand before God. By the guilt of the sins committed by us, we are liable to the justice of God; by the power of sin that dwells in us, we are hateful to the holiness of God. Even God's Israel are in danger on these accounts; but they have relief from Jesus Christ, who is made of God to us both righteousness and sanctification. Joshua, the high priest, is accused as a criminal, but is justified. When we stand before God, to minister to him, or stand up for God, we must expect to meet all the resistance Satan's subtlety and malice can give. Satan is checked by one that has conquered him, and many times silenced him. Those who belong to Christ, will find him ready to appear for them, when Satan appears most strongly against them. A converted soul is a brand plucked out of the fire by a miracle of free grace, therefore shall not be left a prey to Satan. Joshua appears as one polluted, but is purified; he represents the Israel of God, who are all as an unclean thing, till they are washed and sanctified in the name of the Lord Jesus, and by the Spirit of our God. Israel now were free from idolatry, but there were many things amiss in them. There were spiritual enemies warring against them, more dangerous than any neighbouring nations. Christ loathed the filthiness of Joshua's garments, yet did not put him away. Thus God by his grace does with those whom he chooses to be priests to himself. The guilt of sin is taken away by pardoning mercy, and the power of it is broken by renewing grace. Thus Christ washes those from their sins in his own blood, whom he makes kings and priests to our God. Those whom Christ makes spiritual priests, are clothed with the spotless robe of his righteousness, and appear before God in that; and with the graces of his Spirit, which are ornaments to them. The righteousness of saints, both imputed and implanted, is the fine linen, clean and white, with which the bride, the Lamb's wife, is arrayed, Re 19:8. Joshua is restored to former honours and trusts. The crown of the priesthood is put on him. When the Lord designs to restore and revive religion, he stirs up prophets and people to pray for it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I said, let them set a fair mitre on his head - This seems to have been purposely omitted, in order to leave something, and that, the completion of all, to be done at the intercession of the prophet. The glory and complement of the high priest's sacrificial attire was the mitre with the \"holy crown upon it and the plate of prate gold, on which was graven, Holiness to the Lord\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:36-38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 29:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which was to \"be upon\" the high priest's \"forehead, that he may bear the iniquity of the holy things which the children of Israel shall hallow in all their holy gifts; which was always to be upon his forehead, that they may be accepted before the Lord.\" The renewed gift of this was reserved for the intercession of man co-working with God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the angel of the Lord standing by - Seeing that all was done aright, and, now that the acquittal was complete, standing to give the charge. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the angel of the Lord standing by - Seeing that all was done aright, and, now that the acquittal was complete, standing to give the charge. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. And I said—Here the prophet, rejoicing at the change of raiment so far made, interposes to ask for the crowning assurance that the priesthood would be fully restored, namely, the putting the miter or priestly turban on Joshua: its fair color symbolizing the official purity of the order restored. He does not command, but prays; not \"Set,\" but \"Let them set.\" Vulgate and Syriac version read it, \"He then said,\" which is the easier reading; but the very difficulty of the present Hebrew reading makes it less likely to come from a modern corrector of the text.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "angel of … Lord stood by—the Divine Angel had been sitting (the posture of a judge, Da 7:9); now He \"stands\" to see that Zechariah's prayer be executed, and then to give the charge (Zec 3:6, 7).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And I said:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Zechariah takes the boldness to desire that for Joshua which might add to his veneration and authority; and he asks the thing of Christ, or rather Christ commandeth this be done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", who minister before Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "set a fair mitre; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a rich and beautiful ornament for the head of the high priest; not a crown, which is for royal heads, but a tire, a pontifical ensign. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "So they set, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as they were commanded by Christ at the request of the prophet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And clothed him with garments; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all the garments which did appertain to the high priest, of which you read ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 28:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which probably were put on, though they are not expressly mentioned here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The angel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who is the Lord Christ himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "stood by; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " withdrew not till all this was done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I said, Let them set a fair mitre upon his head,.... These are either the words of Jehovah the Father, who has all the angels at his command, and can order them to do what he pleases; always regards the intercession of Christ; is ever well pleased with his righteousness, and with his people, as clothed with it; and, where he gives grace, he gives more grace: a man clothed with Christ's righteousness is upon rising ground; he is in the way to great honour and glory: or, as some think, they are the words of the Angel of the Lord, the Messiah, continued, who willed, ordered, and commanded his ministering servants to do this, that Joshua might appear agreeably to the dignity of his office, and look great, as well as clean and neat: or rather they are the words of Zechariah the prophet; and design either the inward thoughts and secret wishes of his mind; or were an humble request of his, and was regarded; who, seeing something wanting to make Joshua a complete high priest, intercedes for it: so one saint rejoices in the restoration of another; and is so far from envying the gifts and graces of the greatest, that he wishes him more: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so they set a fair mitre upon his head; such as the high priest wore; on which was a plate of gold, and on it written \"Holiness to the Lord\"; and was an emblem of Christ being made sanctification to his people; see Exodus 28:4. The mitre was a garment of the high priest, a sort of covering for the head, a cap or turban: it was made of linen, and is called the linen mitre, Leviticus 16:4 and that which Joshua might have wore before, being stained and foul, it is requested that a \"fair\" or \"clean\" (l) one might be set upon his head. It consisted, as the Jewish writers say (m), of sixteen cubits or ells, which were rolled up in the form of a Turkish turban; and has its name in Hebrew from its being thus rolled up. The account Josephus (n) gives of it is, that it was ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so they set a fair mitre upon his head; such as the high priest wore; on which was a plate of gold, and on it written \"Holiness to the Lord\"; and was an emblem of Christ being made sanctification to his people; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The mitre was a garment of the high priest, a sort of covering for the head, a cap or turban: it was made of linen, and is called the linen mitre, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and that which Joshua might have wore before, being stained and foul, it is requested that a \"fair\" or \"clean\" (l) one might be set upon his head. It consisted, as the Jewish writers say (m), of sixteen cubits or ells, which were rolled up in the form of a Turkish turban; and has its name in Hebrew from its being thus rolled up. The account Josephus (n) gives of it is, that it was ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"a cap or bonnet wore on the head, not rising up in a point, nor encompassing the whole head, but put on little more than the middle of it; and is called \"masnaempthes\" (it should be \"mitznephet\"); and is formed in such a manner, as to look like a crown, made of a linen web, like a swath or roller; for it is many times rolled about and sewed;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and with which Jerom's account of it agrees; who says (o), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the fourth sort of garment is a round cap or bonnet, such as we see painted on Ulysses, like a globe, circle, or sphere, divided in the middle, and one part set on the head: this we and the Greeks call a \"tiara\"; the Hebrews, \"mitznephet\": it has no point at top, nor does it cover the whole head to the hair, but leaves a third part of the forehead uncovered; and so bound with a lace at the back of the head, that it cannot easily fall from it: it is made of fine linen; and is so well covered with a linen cloth, (and which also Josephus takes notice of in the above place), that no traces of the needle appear without.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It hid the seams, and the deformity of them: both the high priest and the common priests wore mitres, as appears from Exodus 28:4 and the difference between them, according to the Jewish writers (p), seems chiefly to lie in the manner of rolling and wrapping them: the mitre of the high priest was wrapped about his head, as you roll a broken limb, roll upon roll, and did not rise up to a point, but was flat on his head; but that of the common priests consisted of various folds and rolls; which gradually rose up to a point, as a nightcap, or high crowned hat. Josephus (q) contrary to all other writers, makes the high priest to have two mitres; for he says, he had a cap like to the former, such as all the rest of the priests had, upon which another was sewed, variegated with blue, or a violet colour; which Braunius (r) thinks is a mistake of his, arising from the blue lace, with which the plate of gold, that had engraven on it Holiness to the Lord, was fastened to the mitre; or else that the place is corrupted, or has been interpolated by some other hand; since this would make the high priest to have nine garments, and not eight only; but Fortunatus Scacchus (s) takes the passage to be genuine, and argues from it for another mitre or cap, more worthy of the high priest; and which was peculiar to him, and was very curiously wrought, and on which the celestial globe was figured; and so Josephus says (t), that the cap being made of blue or hyacinth, seemed to signify heaven; for otherwise the name of God would not have been put upon it. The son of Sirach, Ecclesiasticus 45:12 speaks very highly of this covering of the high priest's head, calling it ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It hid the seams, and the deformity of them: both the high priest and the common priests wore mitres, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and the difference between them, according to the Jewish writers (p), seems chiefly to lie in the manner of rolling and wrapping them: the mitre of the high priest was wrapped about his head, as you roll a broken limb, roll upon roll, and did not rise up to a point, but was flat on his head; but that of the common priests consisted of various folds and rolls; which gradually rose up to a point, as a nightcap, or high crowned hat. Josephus (q) contrary to all other writers, makes the high priest to have two mitres; for he says, he had a cap like to the former, such as all the rest of the priests had, upon which another was sewed, variegated with blue, or a violet colour; which Braunius (r) thinks is a mistake of his, arising from the blue lace, with which the plate of gold, that had engraven on it Holiness to the Lord, was fastened to the mitre; or else that the place is corrupted, or has been interpolated by some other hand; since this would make the high priest to have nine garments, and not eight only; but Fortunatus Scacchus (s) takes the passage to be genuine, and argues from it for another mitre or cap, more worthy of the high priest; and which was peculiar to him, and was very curiously wrought, and on which the celestial globe was figured; and so Josephus says (t), that the cap being made of blue or hyacinth, seemed to signify heaven; for otherwise the name of God would not have been put upon it. The son of Sirach, Ecclesiasticus 45:12 speaks very highly of this covering of the high priest's head, calling it ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"a crown of gold upon the mitre, wherein was engraved Holiness, an ornament of honour, a costly work, the desires of the eyes, goodly and beautiful;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as here a fair mitre: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and clothed him with garments; priestly ones, suitable to his office, which were in all eight; which were the linen breeches; the coat of linen; an embroidered girdle; a robe of blue; an ephod of gold; a breastplate curiously wrought, in which were the Urim and Thummim; a mitre of fine linen, and a plate of pure gold on it, Leviticus 8:7 and on the day of atonement he wore the four following extraordinary garments, breeches, coat, girdle, and mitre all of linen, Leviticus 16:4 (u); all which were typical of the clothing of believers by Christ, by whom they are made priests unto God: \"and clothed him with garments\"; priestly robes, suitable to his office: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and clothed him with garments; priestly ones, suitable to his office, which were in all eight; which were the linen breeches; the coat of linen; an embroidered girdle; a robe of blue; an ephod of gold; a breastplate curiously wrought, in which were the Urim and Thummim; a mitre of fine linen, and a plate of pure gold on it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and on the day of atonement he wore the four following extraordinary garments, breeches, coat, girdle, and mitre all of linen, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (u); all which were typical of the clothing of believers by Christ, by whom they are made priests unto God: \"and clothed him with garments\"; priestly robes, suitable to his office: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Angel of the Lord stood by; to see all done according to his order; and not as a mere spectator, for he was concerned in clothing him himself; and he still stood to denote his constant care of Joshua, and his regard to him, and as having something more to say to him, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l)  , Sept.; \"cidarim mundam\", V. L. Pagninus, Montanus, &c.  Targum. (m) Maimon. Cele Hamikdash, c. 8. sect. 19. (n) Antiqu. l. 3. c. 7. sect. 3.((o) De Vestitu Sacerdotum ad Fabiolam, fol. 19. I.((p) Maimon. Cele Hamikdash, c. 8. sect. 2. Aben Ezra in Exodus 28.36. (q) Ut supra, (Antiqu. l. 3. c. 7.) sect. 6. (r) De Vestitu Sacerdot. Hebr. l. 2. c. 21. p. 795. (s) Sacr. Elaeochrism. Myroth. l. 3. c. 39. p. 995. Vid. Solerium de Pileo, sect. 12. p. 257. (t) Ut supra, (Antiqu. l. 3. c. 7.) sect 7. (u) Maimon Cele Hamikdash, c. 8. sect. 1, 2, 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l)  , Sept.; \"cidarim mundam\", V. L. Pagninus, Montanus, &c.  Targum. (m) Maimon. Cele Hamikdash, c. 8. sect. 19. (n) Antiqu. l. 3. c. 7. sect. 3.((o) De Vestitu Sacerdotum ad Fabiolam, fol. 19. I.((p) Maimon. Cele Hamikdash, c. 8. sect. 2. Aben Ezra in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".36. (q) Ut supra, (Antiqu. l. 3. c. 7.) sect. 6. (r) De Vestitu Sacerdot. Hebr. l. 2. c. 21. p. 795. (s) Sacr. Elaeochrism. Myroth. l. 3. c. 39. p. 995. Vid. Solerium de Pileo, sect. 12. p. 257. (t) Ut supra, (Antiqu. l. 3. c. 7.) sect 7. (u) Maimon Cele Hamikdash, c. 8. sect. 1, 2, 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I said, Let them {g} set a clean mitre upon his head. So they set a clean mitre upon his head, and clothed him with garments. And the angel of the LORD stood by.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I said, Let them ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " set a clean mitre upon his head. So they set a clean mitre upon his head, and clothed him with garments. And the angel of the LORD stood by.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) The Prophet prays that besides the raiment, the Priest might also have attire for his head accordingly, that is, that the dignity of the priesthood might be perfect: and this was fulfilled in Christ, who was both Priest and King. And here all those are condemned, that can content themselves with any average reformation in religion, seeing the Prophet desires the perfection, and obtains it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The speaker might be the Angel of the Lord, reciting further the commands which he had given. But it is better to suppose that Zechariah, looking on with intense interest, gives vent to his feelings, in the request that the now comely attire of the High Priest should not be left incomplete.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mitre",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word is not the same (though from the same root) as that used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:36-38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but there is no doubt that the same thing is intended.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stood by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. remained in the same position that he had occupied before, to superintend and sanction the proceedings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I said.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If this is the true reading (which Ewald doubts), we must consider that the prophet, excited by what has passed, cannot stand by as a mere spectator, but feels constrained to take part in the scene, and to request that the change of garments may be completed by the addition of the fair head dress. The LXX. omits the word, continuing the address to the attendant. The Vulgate has, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "et dixit.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So the Syriac and the Targum and some few manuscripts. But the received reading is confirmed, as Dr. Alexander points out, by the change in the mood of the following verb from the imperative to the optative, \"let them put,\" \"would that they put.\" There is nothing incongruous in the prophet thus intervening in his own person. Thus Isaiah, in the midst of a solemn vision, gives vent to his feelings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and St. John in the Apocalypse often mingles his own sentiments and actions with what he beheld (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Mitre",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "tsaniph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κίδαριν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": so the Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "cidarim.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is not the same word as that used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. (which is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mitsnepheth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), for the official head dress of Aaron, though it is probably a synonym for it; and the prophet's wish is to see Joshua not only reinstated in his office and dignity, but found holy also. For the fair linen mitre, or tiara, was that which bore upon its front the golden plate inscribed, \"Holiness unto the Lord\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:36-38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and therefore showed that he was qualified to intercede for the people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Stood by.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Angel of Jehovah continued standing in his place, contemplating, sanctioning, and directing what was being done. Zechariah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At this moment the prophet feels compelled to utter the prayer that they may also put a clean mitre upon Joshua's head, which prayer is immediately granted. The prayer appears at first to be superfluous, inasmuch as the mitre would certainly not be forgotten when the dirty clothes were taken away and the festal dress was put on. Nevertheless, the fact that it is granted shows that it was not superfluous. The meaning of the prayer was hardly that the high priest might be newly attired from head to foot, as Hengstenberg supposes, but is rather connected with the significance of the mitre. Tsânı̄ph is not a turban, such as might be worn by anybody (Koehler), but the headdress of princely persons and kings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 29:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is synonymous with mitsnepheth, the technical word for the tiara prescribed for the high priest in the law (Ex. and Lev.), as we may see from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the regal diadem, which is called tsânı̄ph in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is spoken of under the name of mitsnepheth. The turban of the high priest was that portion of his dress in which he carried his office, so to speak, upon his forehead; and the clean turban was the substratum for the golden plate that was fastened upon it, and by which he was described as holy to the Lord, and called to bear the guilt of the children of Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The prayer for a clean mitre to be put upon his head, may therefore be accounted for from the wish that Joshua should not only be splendidly decorated, but should be shown to be holy, and qualified to accomplish the expiation of the people. Purity, as the earthly type of holiness, forms the foundation for glory. In the actual performance of the matter, therefore, the putting on of the clean mitre is mentioned first, and then the clothing with festal robes. This took place in the presence of the angel of the Lord. That is the meaning of the circumstantial clause, \"and the angel of the Lord stood\" (ritum tanquam herus imperans, probans et praesentia sua ornans, C. B. Mich.), and not merely that the angel of the Lord, who had hitherto been sitting in the judge's seat, rose up from his seat for the purpose of speaking while the robing was going on (Hofmann, Koehler). עמד does not mean to stand up, but simply to remain standing. ",
        "children": []
      }
    ]
  }
]