[{"header":"Abraham Tricks Abimelech"},{"num":20,"verse":"Abraham left Hebron and traveled to southern Canaan where he stayed awhile between Kadesh and Shur. When he moved to Gerar, "},{"num":2,"verse":"he told people that his wife Sarah was his sister. Abimelech king of Gerar heard this, so he sent some servants to take her. "},{"num":3,"verse":"But one night God spoke to Abimelech in a dream and said, “You will die. The woman you took is married.”"},{"num":4,"verse":"But Abimelech had not gone near Sarah, so he said, “Lord, would you destroy an innocent nation? "},{"num":5,"verse":"Abraham himself told me, ‘This woman is my sister,’ and she also said, ‘He is my brother.’ I am innocent. I did not know I was doing anything wrong.”"},{"num":6,"verse":"Then God said to Abimelech in the dream, “Yes, I know you did not realize what you were doing. So I did not allow you to sin against me and touch her. "},{"num":7,"verse":"Give Abraham his wife back. He is a prophet. He will pray for you, and you will not die. But if you do not give Sarah back, you and all your family will surely die.”"},{"num":8,"verse":"So early the next morning, Abimelech called all his officers and told them everything that had happened in the dream. They were very afraid. "},{"num":9,"verse":"Then Abimelech called Abraham to him and said, “What have you done to us? What wrong did I do against you? Why did you bring this trouble to my kingdom? You should not have done these things to me. "},{"num":10,"verse":"What were you thinking that caused you to do this?”"},{"num":11,"verse":"Then Abraham answered, “I thought no one in this place respected God and that someone would kill me to get Sarah. "},{"num":12,"verse":"And it is true that she is my sister. She is the daughter of my father, but she is not the daughter of my mother. "},{"num":13,"verse":"When God told me to leave my father’s house and wander in many different places, I told Sarah, ‘You must do a special favor for me. Everywhere we go tell people I am your brother.’”"},{"num":14,"verse":"Then Abimelech gave Abraham some sheep, cattle, and male and female slaves. He also gave Sarah, Abraham’s wife, back to him "},{"num":15,"verse":"and said, “Look around you at my land. You may live anywhere you want.”"},{"num":16,"verse":"Abimelech said to Sarah, “I gave your brother Abraham twenty-five pounds of silver to make up for any wrong that people may think about you. I want everyone to know that you are innocent.”"},{"num":17,"verse":"Then Abraham prayed to God, and God healed Abimelech, his wife, and his servant girls so they could have children. "},{"num":18,"verse":"The Lord had kept all the women in Abimelech’s house from having children as a punishment on Abimelech for taking Abraham’s wife Sarah."}]