[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:15-30 The sockets of silver each weighed about 115 pounds; they were placed in rows on the ground. In every pair of these sockets, a strong board of shittim-wood, covered with plates of gold, was fitted by mortises and tenons. Thus walls were formed for the two sides, and for the west end. The wall was further held together by bars, which passed through rings of gold. Over this the curtains were spread. Though movable, it was strong and firm. The materials were very costly. In all this it was a type of the church of God, built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief Corner-stone, Eph 2:20,21.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the two sides - Rather, at the back.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15-30. thou shalt make boards … rear up the tabernacle according to the fashion … which was showed thee—The tabernacle, from its name as well as from its general appearance and arrangements, was a tent; but from the description given in these verses, the boards that formed its walls, the five (cross) bars that strengthened them, and the middle bar that \"reached from end to end,\" and gave it solidity and compactness, it was evidently a more substantial fabric than a light and fragile tent, probably on account of the weight of its various coverings as well as for the protection of its precious furniture.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Which were of another fashion than the former, as may be gathered both from the distinct nomination and use of them, and from the laws of building. And whereas the rest were but single boards, these were double, for greater strength and conveniency of joining them together. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And two boards shalt thou make for the corners of the tabernacle in the two sides. For the northwest and southwest corners, in the north and south sides; concerning which Dr. Lightfoot thus writes (t): and the west end had six planks entire, besides a plank at either corner, joining end and sides together; these corner planks were of the same breadth that all the others were, and, thus set, the middle of the breadth of the one plank was laid close to the end of the south side, or to that plank that was furthest west; so that a quarter of a yard of the breadth of the corner plank was inward, to make up the tabernacle breadth, a quarter was taken up with the thickness of the side plank to which it joined, and a quarter lay outward: thus at the southwest, just so was it at the northwest corner: then count; the two corner planks were inward a quarter of a yard apiece, and the six planks that stood between them of three quarters apiece, behold five yards, just the breadth of the house between wall and wall: these corners knit end and side together, and were the strength of the building; as, adds he,\"Christ is of his church, making Jews and Gentiles one spiritual temple.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Ut supra. (Works, vol 1. p. 719.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Ut supra. (Works, vol 1. p. 719.) ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And two boards shalt thou make for the corners of the tabernacle in the two sides.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23, 24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The two corner frames.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Exodus 26:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Six boards were to be made for the back of the dwelling westwards (ימּה), and two boards \"for the corners or angels of the dwelling at the two outermost (hinder) sides.\" למקצּעת (for cornered), from מקצּע, equivalent to מקצוע an angle (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 26:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 46:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), from קצע to cut off, lit., a section, something cut off, hence an angle, or corner-piece. These corner boards (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 26:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") were to be \"doubled (תּאמם) from below, and whole (תּמּים, integri, forming a whole) at its head (or towards its head, cf. אל ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 36:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") with regard to the one ring, so shall it be to both of them (so shall they both be made); to the two corners shall they be\" (i.e., designed for the two hinder corners). The meaning of these words, which are very obscure in some points, can only be the following: the two corner beams at the tack were to consist of two pieces joined together at a right angle, so as to form as double boards one single whole from the bottom to the top. The expressions \"from below\" and \"up to its head\" are divided between the two predicates \"doubled\" (תּאמים) and \"whole\" (תּמּים), but they belong to both of them. Each of the corner beams was to be double from the bottom to the top, and still to form one whole. There is more difficulty in the words האחת אל־הטּבּעת in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 26:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is impossible to attach any intelligible meaning to the rendering \"to the first ring,\" so that even Knobel, who proposed it, has left it unexplained. There is hardly any other way of explaining it, than to take the word אל in the sense of \"having regard to a thing,\" and to understand the words as meaning, that the corner beams were to form one whole, from the face that each received only one ring, probably at the corner, and not two, viz., one on each side. This one ring was placed half-way up the upright beam in the corner or angle, in such a manner that the central bolt, which stretched along the entire length of the walls (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 26:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), might fasten into it from both the side and back. ",
        "children": []
      }
    ]
  }
]