[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:4-14 Christ came into this world for judgment to the Jewish church and nation, which were wretchedly corrupt and degenerate. Those have their minds wofully blinded, who do ill, and justify themselves in it; but God will not hold those guiltless who hold themselves so. How can we go to God to beg a blessing on unlawful methods of getting wealth, or to return thanks for success in them? There was a general decay of religion among them, and they regarded it not. The Good Shepherd would feed his flock, but his attention would chiefly be directed to the poor. As an emblem, the prophet seems to have taken two staves; Beauty, denoted the privileges of the Jewish nation, in their national covenant; the other he called Bands, denoting the harmony which hitherto united them as the flock of God. But they chose to cleave to false teachers. The carnal mind and the friendship of the world are enmity to God; and God hates all the workers of iniquity: it is easy to foresee what this will end in. The prophet demanded wages, or a reward, and received thirty pieces of silver. By Divine direction he cast it to the potter, as in disdain for the smallness of the sum. This shadowed forth the bargain of Judas to betray Christ, and the final method of applying it. Nothing ruins a people so certainly, as weakening the brotherhood among them. This follows the dissolving of the covenant between God and them: when sin abounds, love waxes cold, and civil contests follow. No wonder if those fall out among themselves, who have provoked God to fall out with them. Wilful contempt of Christ is the great cause of men's ruin. And if professors rightly valued Christ, they would not contend about little matters.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Whose possessors - (buyers) slay them and hold themselves not guilty, rather, are not guilty either in their own eyes, or in the sight of God, since He gave them up and would no more avenge them. They contract no guilt. Aforetime God said; \"Israel was holiness to the Lord, the first-fruits of His increase; all that devour him shall be guilty: evil shall come upon them, saith the Lord\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Now God reversed this, as He said by the same prophet, \"My people hath been lost sheep; their shepherds have caused them to go astray; they have turned them away on the mountains; all that found them have devoured them; and their adversaries say, We are not guilty, because they have sinned against the Lord, the habitation of justice, yea, the hope of their fathers, the Lord\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The offence of injuring Israel was that they were God's people: when He cast them forth, they who chastened them were His servants ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 43:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", His instruments, and offended only when through pride they knew not in whose hands they themselves were ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or through cruelty exceeded their office ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 47:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so they became guilty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And they that sell them say, Blessed be the Lord, for I am rich - Even Sennacherib felt himself in part, or thought best to own himself, to be an instrument in God's hand Isaiah 36:10. But Titus when he  \"entered Jerusalem, marveled at the strength of the city and its towers, which 'he tyrants' in phrensy abandoned. When then he had beheld their solid strength and the greatness of each rock, and how accurately they were fitted in, and how great their length and breadth, he said 'By the help of God we have warred: and God it was who brought down the Jews from those bulwarks: for what avail the hands of man or his engines against such towers?' Much of this sort he said to his friends.\" The Jews also were \"sold\" in this war, as they had not been in former captures; and that, not by chance, but because the Roman policy was different from all, known by \"experience\" in the time of Zechariah. Into Babylon they had been carried captive, as a whole, because it was the will of God, after the \"seventy years\" to restore them. In this war, it was His will to destroy or disperse them; and so those above 17 were sent to Egypt to the works; those below 17 were sold. : \"The whole number taken prisoners during the wars were 1,100,000,\" beside those who perished elsewhere. Jerome: \"Read we the ancient histories and the traditions of the mourning Jews, that at the Tabernaculum Abrahae (where now is a very thronged mart every year) after the last destruction, which they endured from Adrian, many thousands were sold, and what could not be sold were removed into Egypt, and destroyed by shipwreck or famine and slaughter by the people. No displeasure came upon the Romans for the utter destruction, as there had upon the Assyrians and Chaldaeans.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And they that sell them say, Blessed be the Lord, for I am rich - Even Sennacherib felt himself in part, or thought best to own himself, to be an instrument in God's hand ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 36:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But Titus when he  \"entered Jerusalem, marveled at the strength of the city and its towers, which 'he tyrants' in phrensy abandoned. When then he had beheld their solid strength and the greatness of each rock, and how accurately they were fitted in, and how great their length and breadth, he said 'By the help of God we have warred: and God it was who brought down the Jews from those bulwarks: for what avail the hands of man or his engines against such towers?' Much of this sort he said to his friends.\" The Jews also were \"sold\" in this war, as they had not been in former captures; and that, not by chance, but because the Roman policy was different from all, known by \"experience\" in the time of Zechariah. Into Babylon they had been carried captive, as a whole, because it was the will of God, after the \"seventy years\" to restore them. In this war, it was His will to destroy or disperse them; and so those above 17 were sent to Egypt to the works; those below 17 were sold. : \"The whole number taken prisoners during the wars were 1,100,000,\" beside those who perished elsewhere. Jerome: \"Read we the ancient histories and the traditions of the mourning Jews, that at the Tabernaculum Abrahae (where now is a very thronged mart every year) after the last destruction, which they endured from Adrian, many thousands were sold, and what could not be sold were removed into Egypt, and destroyed by shipwreck or famine and slaughter by the people. No displeasure came upon the Romans for the utter destruction, as there had upon the Assyrians and Chaldaeans.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And their own shepherds - (In contrast to those who \"bought\" and \"sold\" them, who accordingly were not their own, temporal or spiritual) they to whom God had assigned them, who should have fed them with the word of God, strengthened the diseased, healed the sick, bound up the broken, and sought the lost, \"pity them not\" Ezekiel 34:4. He says what they should have done, in blaming them for what they did not do. They owed them a tender compassionate love; they laid aside all mercy, and became wolves, as Paul says; \"After my departure shall grievous wolves enter in among you, not sparing the flock. Also of your own selves shall men arise, speaking perverse things, to draw away disciples after them\" Acts 20:29-30. They who owed them all love, shall have none. Jerome: \"No marvel then, he says, if enemies shall use the right of conquest, when their very shepherds and teachers spared them not, and, through their fault, the flock was given over to the wolves.\" All were corrupted, high priest, priests, scribes, lawyers, Pharisees, Sadducees. No one  had pity on them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And their own shepherds - (In contrast to those who \"bought\" and \"sold\" them, who accordingly were not their own, temporal or spiritual) they to whom God had assigned them, who should have fed them with the word of God, strengthened the diseased, healed the sick, bound up the broken, and sought the lost, \"pity them not\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He says what they should have done, in blaming them for what they did not do. They owed them a tender compassionate love; they laid aside all mercy, and became wolves, as Paul says; \"After my departure shall grievous wolves enter in among you, not sparing the flock. Also of your own selves shall men arise, speaking perverse things, to draw away disciples after them\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 20:29-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They who owed them all love, shall have none. Jerome: \"No marvel then, he says, if enemies shall use the right of conquest, when their very shepherds and teachers spared them not, and, through their fault, the flock was given over to the wolves.\" All were corrupted, high priest, priests, scribes, lawyers, Pharisees, Sadducees. No one  had pity on them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. possessors—The buyers [Maurer], their Roman oppressors, contrasted with \"they that sell men.\" The instruments of God's righteous judgment, and therefore \"not holding themselves guilty\" (Jer 50:7). It is meant that they might use this plea, not that they actually used it. Judah's adversaries felt no compunction in destroying them; and God in righteous wrath against Judah allowed it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they that sell them—(Compare Zec 11:12). The rulers of Judah, who by their avaricious rapacity and selfishness (Joh 11:48, 50) virtually sold their country to Rome. Their covetousness brought on Judea God's visitation by Rome. The climax of this was the sale of the innocent Messiah for thirty pieces of silver. They thought that Jesus was thus sold and their selfish interest secured by the delivery of Him to the Romans for crucifixion; but it was themselves and their country that they thus sold to the Roman possessors.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I am rich—by selling the sheep (De 29:19; Ho 12:8). In short-sighted selfishness they thought they had gained their object, covetous self-aggrandizement (Lu 16:14), and hypocritically \"thanked\" God for their wicked gain (compare Lu 18:11).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "say … pity—In Hebrew it is singular: that is, each of those that sell them saith: Not one of their own shepherds pitieth them. An emphatical mode of expression by which each individual is represented as doing, or not doing, the action of the verb [Henderson]. Hengstenberg refers the singular verbs to Jehovah, the true actor; the wicked shepherds being His unconscious instruments. Compare Zec 11:6, For I will no more pity, with the Hebrew \"pitieth not\" here.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whose possessors slay them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either their own governors, or the Romans who in right of conquerors are their possessors; which way soever they got them into their hands, they ruined them, destroyed them both in body and estate. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And hold themselves not guilty; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " think they do not sin in doing this; so low thoughts they had of this people, such extravagant thoughts they had of their own power and authority. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They that sell them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " betray their persons, or liberty, or estate for profit, or sell them for slaves to foreigners; say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Blessed be the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for I am rich; with profane, ungodly hearts do give God thanks that they thrive by the most barbarous methods of cruelty and oppression, by bloody murders, as if these were ways of his appointing to gain wealth as if he blessed them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Their own shepherds pity them not; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who by birth, call, and office were their proper shepherds, the governors of this poor people, the princes, the priests, had no pity on them in their slavery or blood; looked on as unconcerned, it may be glad, that either they got a booty, or were rid of a disaffected subject. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Whose possessors slay them, and hold themselves not guilty,.... Not the Romans after Christ came, into whose hands they were delivered, and by whom they were slain in great numbers, not accounting it any sin to put them to death; but the priests, Scribes, Pharisees, and doctors, among the Jews, who ruined and destroyed their souls, by feeding them with poisonous doctrines; teaching them the commandments of men, and to observe the traditions of the elders; and to seek for life and salvation by the works of the law, which was a ministration of condemnation and death to them; and yet thought they did God and the souls of men good service: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they that sell them; as false teachers make merchandise of the souls of men: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "say, Blessed be the Lord, for I am rich; having devoured widows' houses and substances, under a pretence of long prayers; and enriched themselves through tithes of everything, and by other methods; as the Scribes and Pharisees did: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and their own shepherds pity them not; those who should have been concerned for the welfare of their souls had no compassion on them. Aben Ezra, Kimchi, and Ben Melech, interpret this of God, the Shepherd of Israel; the verb being singular, though the noun is plural: so God is called Makers, Creators, Psalm 149:2 and this sense agrees with the following words. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and their own shepherds pity them not; those who should have been concerned for the welfare of their souls had no compassion on them. Aben Ezra, Kimchi, and Ben Melech, interpret this of God, the Shepherd of Israel; the verb being singular, though the noun is plural: so God is called Makers, Creators, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 149:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and this sense agrees with the following words. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Whose possessors slay them, and hold themselves {f} not guilty: and they that sell them say, {g} Blessed be the LORD; for I am rich: and their own shepherds pity them not.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Whose possessors slay them, and hold themselves ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not guilty: and they that sell them say, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Blessed ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the LORD; for I am rich: and their own shepherds pity them not.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Their governors destroy them without any remorse of conscience, or yet thinking that they do evil.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) He notes the hypocrites, who always have the name of God in their mouths, though in their life and doings they deny God, attributing their gain to God's blessings, which comes from the wealth of their brethren.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "possessors",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "buyers.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The flock of which the prophet was commanded to take charge had been bought and slain without compunction, and sold for gain, with a complacent “bless the Lord” at the good price they fetched.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Possessors",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "buyers.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Those who claimed to be owners by right of purchase. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hold themselves not guilty.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They are so blinded by self-interest that they see no sin in thus treating the flock. But the expression is better rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "bear no blame, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " suffer no penalty, commit this wickedness with impunity. Septuagint, \"repent not;\" Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "non dolebant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which Jerome explains, \"did not suffer for it.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Blessed be the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So little compunction do they feel that they actually thank God for their  ill-gotten gains. The prophet is speaking of chiefs and rulers, civil and ecclesiastical, who played into the enemies' hands, and thought of nothing but how to make a gain of the subject people. Our Lord denounces such untrustworthy shepherds (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 10:11-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Doubtless, too, the expressions in the text refer to the foreign powers which had oppressed the Jews at various times, Egypt, Assyria, etc. Amid all such distresses, from whatever cause, God still had tender care for his people, and punished and will punish their enemies. In this verse the offenders against Israel are of three classes - buyers, sellers, shepherds (see ver. 8). \"Shepherd\" appears sometimes in the Assyrian inscriptions as a synonym for \"prince\" (see Schrader, 'Keilinschr.,' p. 453) : Zechariah 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This section contains a symbolical act. By the command of Jehovah the prophet assumes the office of a shepherd over the flock, and feeds it, until he is compelled by its ingratitude to break his shepherd's staff, and give up the flock to destruction. This symbolical act is not a poetical fiction, but is to be regarded in strict accordance with the words, as an internal occurrence of a visionary character and of prophetical importance, through which the faithful care of the Lord for His people is symbolized and exhibited. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Thus said Jehovah my God: Feed the slaughtering-flock; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". whose purchasers slay them, and bear no blame, and their sellers say, Blessed be Jehovah! I am getting rich, and their shepherds spare them not. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For I shall no more spare the inhabitants of the earth, is the saying of Jehovah; and behold I cause the men to fall into one another's hands, and into the king's hand; and they will smite the land, and I shall not deliver out of their hand.\" The person who receives the commission to feed the flock is the prophet. This is apparent, both from the expression \"my God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", comp. with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), and also from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to which he is to take the instruments of a foolish shepherd. This latter verse also shows clearly enough, that the prophet does not come forward here as performing these acts in his own person, but that he represents another, who does things in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which in truth neither Zechariah nor any other prophet ever did, but only God through His Son, and that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He is identified with God, inasmuch as here the person who breaks the staff is the prophet, and the person who has made the covenant with the nations is God. These statements are irreconcilable, both with Hofmann's assumption, that in this symbolical transaction Zechariah represents the prophetic office, and with that of Koehler, that he represents the mediatorial office. For apart from the fact that such abstract notions are foreign to the prophet's announcement, these assumptions are overthrown by the fact that neither the prophetic office nor the mediatorial office can be identified with God, and also that the work which the prophet carries out in what follows was not accomplished through the prophetic office. \"The destruction of the three shepherds, or world-powers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is not effected through the prophetic word or office; and the fourth shepherd (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is not instituted through the prophetic office and word\" (Kliefoth). The shepherd depicted by the prophet can only be Jehovah Himself, or the angel of Jehovah, who is equal in nature to Himself, i.e., the Messiah. But since the angel of Jehovah, who appears in the visions, is not mentioned in our oracle, and as the coming of the Messiah is also announced elsewhere as the coming of Jehovah to His people, we shall have in this instance also to understand Jehovah Himself by the shepherd represented in the prophet. He visits His flock, as it is stated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and assumes the care of them. The distinction between the prophet and Jehovah cannot be adduced as an argument against this; for it really belongs to the symbolical representation of the matter, according to which God commissions the prophet to do what He Himself intends to do, and will surely accomplish. The more precise definition of what is here done depends upon the answer to be given to the question, Who are the slaughtering flock, which the prophet undertakes to feed? Does it denote the whole of the human race, as Hofmann supposes; or the nation of Israel, as is assumed by the majority of commentators? צאן ההרגה, flock of slaughtering, is an expression that may be applied either to a flock that is being slaughtered, or to one that is destined to be slaughtered in the future. In support of the latter sense, Kliefoth argues that so long as the sheep are being fed, they cannot have been already slaughtered, or be even in process of slaughtering, and that ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " expressly states, that the men who are intended by the flock of slaughtering will be slaughtered in future when the time of sparing is over, or be treated in the manner described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But the first of these arguments proves nothing at all, inasmuch as, although feeding is of course not equivalent to slaughtering, a flock that is being slaughtered by its owners might be transferred to another shepherd to be fed, so as to rescue it from the caprice of its masters. The second argument rests upon the erroneous assumption that ישׁבי הארץ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is identical with the slaughtering flock. The epithet צאן ההרגה, i.e., lit., flock of strangling - as hârag does not mean to slay, but to strangle - is explained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The flock is so called, because its present masters are strangling it, without bearing guilt, to sell it for the purpose of enriching themselves, and its shepherds treat it in an unsparing manner; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does not give the reason why the flock is called the flock of strangling or of slaughtering (as Kliefoth supposes), but the reason why it is given up by Jehovah to the prophet to feed. לא יאשׁמוּ does not affirm that those who are strangling it do not think themselves to blame - this is expressed in a different manner (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): nor that they do not actually incur guilt in consequence, or do not repent of it; for Jehovah transfers the flock to the prophet to feed, because He does not wish its possessors to go on strangling it, and אשׁם never has the meaning, to repent. לא יאשׁמוּ refers rather to the fact that these men have hitherto gone unpunished, that they still continue to prosper. So that 'âshēm means to bear or expiate the guilt, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Ges., Hitzig, Ewald, etc.).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What follows also agrees with this, - namely, that the sellers have only their own advantage in view, and thank God that they have thereby become rich. The singular יאמר is used distributively: every one of them says so. ואעשׁר, a syncopated form for ואעשׁר (Ewald, 73, b), and ו expressing the consequence, that I enrich myself (cf. Ewald, 235, b). רעיהם are the former shepherds. The imperfects are not futures, but express the manner in which the flock was accustomed to be treated at the time when the prophet undertook to feed it. Jehovah will put an end to this capricious treatment of the flock, by commanding the prophet to feed it. The reason for this He assigns in Zechariah 11:6 : For I shall not spare the inhabitants of the earth any longer. ישׁבי הארץ cannot be the inhabitants of the land, i.e., those who are described as the \"flock of slaughtering\" in Zechariah 11:4; for in that case \"feeding\" would be equivalent to slaughtering, or making ready for slaughtering. But although a flock is eventually destined for slaughtering, it is not fed for this purpose only, but generally to yield profit to its owner. Moreover, the figure of feeding is never used in the Scriptures in the sense of making ready for destruction, but always denotes fostering and affectionate care for the preservation of anything; and in the case before us, the shepherd feeds the flock entrusted to him, by slaying the three bad shepherds; and it is not till the flock has become weary of his tending that he breaks the shepherd's staves, and lays down his pastoral office, to give them up to destruction. Consequently the ישׁבי הארץ are different from the צאן ההרגה, and are those in the midst of whom the flock is living, or in whose possession and power it is. They cannot be the inhabitants of a land, however, but since they have kings (in the plural), as the expression \"every one into the hand of his king\" clearly shows, the inhabitants of the earth, or the world-powers; from which it also follows that the \"flock of slaughtering\" is not the human race, but the people of Israel, as we may clearly see from what follows, especially from Zechariah 11:11-14. Israel was given up by Jehovah into the hands of the nations of the world, or the imperial powers, to punish it for its sin. But as these nations abused the power entrusted to them, and sought utterly to destroy the nation of God, which they ought only to have chastised, the Lord takes charge of His people as their shepherd, because He will no longer spare the nations of the world, i.e., will not any longer let them deal with His people at pleasure, without being punished. The termination of the sparing will show itself in the fact that God causes the nations to destroy themselves by civil wars, and to be smitten by tyrannical kings. המציא ביד ר, to cause to fall into the hand of another, i.e., to deliver up to his power (cf. 2 Samuel 3:8). האדם is the human race; and מלכּו, the king of each, is the king to whom each is subject. The subject of כּתּתוּ is רעהוּ and מלכּו, the men and the kings who tyrannize over the others. These smite them in pieces, i.e., devastate the earth by civil war and tyranny, without any interposition on the part of God to rescue the inhabitants of the earth, or nations beyond the limits of Israel, out of their hand, or to put any restraint upon tyranny and self-destruction. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "What follows also agrees with this, - namely, that the sellers have only their own advantage in view, and thank God that they have thereby become rich. The singular יאמר is used distributively: every one of them says so. ואעשׁר, a syncopated form for ואעשׁר (Ewald, 73, b), and ו expressing the consequence, that I enrich myself (cf. Ewald, 235, b). רעיהם are the former shepherds. The imperfects are not futures, but express the manner in which the flock was accustomed to be treated at the time when the prophet undertook to feed it. Jehovah will put an end to this capricious treatment of the flock, by commanding the prophet to feed it. The reason for this He assigns in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 11:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : For I shall not spare the inhabitants of the earth any longer. ישׁבי הארץ cannot be the inhabitants of the land, i.e., those who are described as the \"flock of slaughtering\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for in that case \"feeding\" would be equivalent to slaughtering, or making ready for slaughtering. But although a flock is eventually destined for slaughtering, it is not fed for this purpose only, but generally to yield profit to its owner. Moreover, the figure of feeding is never used in the Scriptures in the sense of making ready for destruction, but always denotes fostering and affectionate care for the preservation of anything; and in the case before us, the shepherd feeds the flock entrusted to him, by slaying the three bad shepherds; and it is not till the flock has become weary of his tending that he breaks the shepherd's staves, and lays down his pastoral office, to give them up to destruction. Consequently the ישׁבי הארץ are different from the צאן ההרגה, and are those in the midst of whom the flock is living, or in whose possession and power it is. They cannot be the inhabitants of a land, however, but since they have kings (in the plural), as the expression \"every one into the hand of his king\" clearly shows, the inhabitants of the earth, or the world-powers; from which it also follows that the \"flock of slaughtering\" is not the human race, but the people of Israel, as we may clearly see from what follows, especially from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 11:11-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Israel was given up by Jehovah into the hands of the nations of the world, or the imperial powers, to punish it for its sin. But as these nations abused the power entrusted to them, and sought utterly to destroy the nation of God, which they ought only to have chastised, the Lord takes charge of His people as their shepherd, because He will no longer spare the nations of the world, i.e., will not any longer let them deal with His people at pleasure, without being punished. The termination of the sparing will show itself in the fact that God causes the nations to destroy themselves by civil wars, and to be smitten by tyrannical kings. המציא ביד ר, to cause to fall into the hand of another, i.e., to deliver up to his power (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). האדם is the human race; and מלכּו, the king of each, is the king to whom each is subject. The subject of כּתּתוּ is רעהוּ and מלכּו, the men and the kings who tyrannize over the others. These smite them in pieces, i.e., devastate the earth by civil war and tyranny, without any interposition on the part of God to rescue the inhabitants of the earth, or nations beyond the limits of Israel, out of their hand, or to put any restraint upon tyranny and self-destruction. ",
            "children": []
          }
        ]
      }
    ]
  }
]