[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Searched . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “shall not God search this out.” The word is used of mining operations, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 28:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; of exploring a country, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 139:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Lord, thou hast searched me, and known me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, known me exactly, as men know those things which they diligently search out. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou knowest my down-sitting, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — All my postures and motions; my actions, and my cessation from action. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou understandest my thoughts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — All my secret counsels, designs, and imaginations; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "afar off — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Before they are perfectly formed in my own mind. Thou knowest what my thoughts will be in such and such circumstances, long before I know it, yea, from all eternity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou compassest my path — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thou watchest me on every side, and therefore discernest every step which I take. The expression is metaphorical, and seems to be taken either from huntsmen watching all the motions and lurking places of the beasts they hunt, and endeavour to catch; or from soldiers besieging their enemies in a city, and setting watches round about them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And my lying down — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When I am withdrawn from all company, and am reflecting on what has passed during the day, and am composing myself to rest, thou knowest what I have in my heart, and with what thoughts I lie down to sleep; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and art acquainted with all my ways — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "At all times, in all places, and in all situations and circumstances. Thou knowest what rule I walk by, what end I walk toward, and what company I walk with.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "139:1-6 God has perfect knowledge of us, and all our thoughts and actions are open before him. It is more profitable to meditate on Divine truths, applying them to our own cases, and with hearts lifted to God in prayer, than with a curious or disputing frame of mind. That God knows all things, is omniscient; that he is every where, is omnipresent; are truths acknowledged by all, yet they are seldom rightly believed in by mankind. God takes strict notice of every step we take, every right step and every by step. He knows what rule we walk by, what end we walk toward, what company we walk with. When I am withdrawn from all company, thou knowest what I have in my heart. There is not a vain word, not a good word, but thou knowest from what thought it came, and with what design it was uttered. Wherever we are, we are under the eye and hand of God. We cannot by searching find how God searches us out; nor do we know how we are known. Such thoughts should restrain us from sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Lord, thou hast searched me - The word rendered searched, has a primary reference to searching the earth by boring or digging, as for water or metals. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 28:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then it means to search accurately or closely.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And known me - As the result of that search, or that close investigation. Thou seest all that is in my heart. Nothing is, or can be, concealed from thee. It is with this deep consciousness that the psalm begins; and all that follows is but an expansion and application of this idea. It is of much advantage in suggesting right reflections on our own character, to have this full consciousness that God knows us altogether; that he sees all that there is in our heart; that he has been fully acquainted with our past life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And known me - As the result of that search, or that close investigation. Thou seest all that is in my heart. Nothing is, or can be, concealed from thee. It is with this deep consciousness that the psalm begins; and all that follows is but an expansion and application of this idea. It is of much advantage in suggesting right reflections on our own character, to have this full consciousness that God knows us altogether; that he sees all that there is in our heart; that he has been fully acquainted with our past life. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 139",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 139:1-24. After presenting the sublime doctrines of God's omnipresence and omniscience, the Psalmist appeals to Him, avowing his innocence, his abhorrence of the wicked, and his ready submission to the closest scrutiny. Admonition to the wicked and comfort to the pious are alike implied inferences from these doctrines.   ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ps 139:1-24. After presenting the sublime doctrines of God's omnipresence and omniscience, the Psalmist appeals to Him, avowing his innocence, his abhorrence of the wicked, and his ready submission to the closest scrutiny. Admonition to the wicked and comfort to the pious are alike implied inferences from these doctrines.   ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 O Lord, thou hast searched me, and known me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Thou knowest my downsitting and mine uprising, thou understandest my thought afar off.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 Thou compassest my path and my lying down, and art acquainted with all my ways.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 For there is not a word in my tongue, but, lo, O Lord, thou knowest it altogether.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 Thou hast beset me behind and before, and laid thine hand upon me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 Such knowledge is too wonderful for me; it is high, I cannot attain unto it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 139:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"O Lord, thou hast searched me, and known me.\" He invokes in adoration Jehovah the all-knowing God, and he proceeds to adore him by proclaiming one of his peculiar attributes. If we would praise God aright we must draw the matter of our praise from himself - \"O Jehovah, thou hast.\" No pretended god knows aught of us; but the true God, Jehovah, understands us, and is most intimately acquainted with our persons, nature, and character. How well it is for us to know the God who knows us! The divine knowledge is extremely thorough and searching; it is as if he had searched us, as officers search a man for contraband goods, or as pillagers ransack a house for plunder. Yet we must not let the figure run upon all fours, and lead us further than it is meant to do, the Lord knows all things naturally and as a matter of course, and not by any effort on his part. Searching ordinarily implies a measure of ignorance which is removed by observation; of course this is not the case with the Lord; but the meaning of the Psalmist is, that the Lord knows us as thoroughly as if he had examined us minutely, and had pried into the most secret corners of our being. This infallible knowledge has always existed - \"Thou hast searched me\": and it continues unto this day, since God cannot forget that which he has once known. There never was a time in which we were unknown to God, and there never will be a moment in which we shall be beyond his observation. Note how the Psalmist makes his doctrine personal, he saith not, \"O God, thou knowest all things\"; but, \"thou hast known me.\" It is ever our wisdom to lay truth home to ourselves. How wonderful the contrast between the observer and the observed! Jehovah and me! Yet this most intimate connection exists, and therein lies our hope. Let the reader sit still a while and try to realize the two poles of this statement, - the Lord and poor puny man - and he will see much to admire and wonder at.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 139:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Thou knowest my downsitting and mine uprising.\" Me thou knowest, and all that comes of me. I am observed when I quietly sit down, and marked when I resolutely rise up. My most common and casual acts, my most needful and necessary movements, are noted by thee, and thou knowest the inward thoughts which regulate them. Whether I sink in lowly self-renunciation, or ascend in pride, thou seest the motions of my mind, as well as those of my body. This is a fact to be remembered every moment: sitting down to consider, or rising up to act, we are still seen, known, and read by Jehovah our Lord. \"Thou understandest my thought afar off.\" Before it is my own it is foreknown and comprehended by thee. Though my thought be invisible to the sight, though as yet I be not myself cognizant of the shape it is assuming, yet thou hast it under thy consideration, and thou perceivest its nature, its source, its drift, its result. Never dost thou misjudge or wrongly interpret me, my inmost thought is perfectly understood by thine impartial mind. Though thou shouldst give but a glance at my heart, and see me as one sees a passing meteor moving afar, yet thou wouldst by that g!impse sum up all the meanings of my soul, so transparent is everything to thy piercing glance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 139:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Thou compassest my path and my lying down.\" My path and my pallet, my running and my resting, are alike within the circle of thine observation. Thou dost surround me even as the air continually surrounds all creatures that live. I am shut up within the wall of thy being; I am encircled within the bounds of thy knowledge. Waking or sleeping I am still observed of thee. I may leave thy path, but thou never leavest mine. I may sleep and forget thee, but thou dost never slumber, nor fall into oblivion concerning thy creature. The original signifies not only surrounding, but winnowing and sifting. The Lord judges our active life and our quiet life; he discriminates our action and our repose, and marks that in them which is good and also that which is evil. There is chaff in all our wheat, and the Lord divides them with unerring precision. \"And art acquainted with all my ways.\" Thou art familiar with all I do; nothing is concealed from thee, nor surprising to thee, nor misunderstood by thee. Our paths may be habitual or accidental, open or secret, but with them all the Most Holy One is well acquainted. This should fill us with awe, so that we sin not; with courage, so that we fear not; with delight, so that we mourn not.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 139:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:4",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For there is not a word in my tongue, but lo, O Lord, thou knowest it altogether.\" The unformed word, which lies within the tongue like a seed in the soft, is certainly and completely known to the Great Searcher of hearts. A negative expression is used to make the positive statement all the stronger: not a word is unknown is a forcible way of saying that every word is well known. Divine knowledge is perfect, since not a single word is unknown, nay, not even an unspoken word, and each one is \"altogether\" or wholly known. What hope of concealment can remain when the speech with which too many conceal their thoughts is itself transparent before the Lord? O Jehovah, how great art thou! If thine eye hath such power, what must be the united force of thine whole nature!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...THE ARGUMENT This Psalm is esteemed by the Hebrews the most excellent in the whole book. The matter of it is noble and sublime, and so is the style. The occasion of it seems to have been those heavy censures and reproaches wherewith David was loaded by his enemies, who branded him for a notorious hypocrite and imposter, that pretended religion only for the covering and promoting his own ambitious and wicked designs against his lawful king, whose life and crown he sought to take away. Against these he comforteth himself with the consideration of God’s omniscience, to whom he appeals as the only proper judge of the integrity of his heart. David magnifieth the all-seeing providence of God, Psalm 139:1-16; his great and tender mercies to him before he had a being in the world, Psalm 139:17,18; abhorreth all converse with wicked men, Psalm 139:19-22; prayeth for and testifieth his sincerity, Psalm 139:23,24.  No text from Poole on this verse. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This Psalm is esteemed by the Hebrews the most excellent in the whole book. The matter of it is noble and sublime, and so is the style. The occasion of it seems to have been those heavy censures and reproaches wherewith David was loaded by his enemies, who branded him for a notorious hypocrite and imposter, that pretended religion only for the covering and promoting his own ambitious and wicked designs against his lawful king, whose life and crown he sought to take away. Against these he comforteth himself with the consideration of God’s omniscience, to whom he appeals as the only proper judge of the integrity of his heart. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "David magnifieth the all-seeing providence of God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 139:1-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; his great and tender mercies to him before he had a being in the world, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 139:17,18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; abhorreth all converse with wicked men, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 139:19-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; prayeth for and testifieth his sincerity, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 139:23,24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " No text from Poole on this verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Lord, thou hast searched me, and known me. The omniscience of God reaches to all persons and things; but the psalmist only takes notice of it as respecting himself. God knows all men in general, and whatever belongs to them; he knows his own people in a special manner; and he knows their particular persons, as David and others: and this knowledge of God is considered after the manner of men, as if it was the fruit of search, to denote the exquisiteness of it; as a judge searches out a cause, a physician the nature of a disease, a philosopher the reason of things; who many times, after all their inquiries, fail in their knowledge; but the Lord never does: his elect lie in the ruins of the fall, and among the men of the world; he searches them out and finds them; for be knows where they are, and the time of finding them, and can distinguish them in a crowd of men from others, and notwithstanding the sad case they are in, and separates them from them; and he searches into them, into their most inward part, and knows them infinitely better than their nearest relations, friends and acquaintance do; he knows that of them and in them, which none but they themselves know; their thoughts, and the sin that dwells in them: yea, he knows more of them and in them than they themselves, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And he knows them after another manner than he does other men: there are some whom in a sense he knows not; but these he knows, as he did David, so as to approve of, love and delight in, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 7:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "O lord, thou hast searched me, and known me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "searched me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 139:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " me] Or, and knowest me, for nothing can be hid from that omniscient scrutiny.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God’s perfect knowledge of all the Psalmist’s life and thoughts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "O Lord, thou hast searched me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hast searched me out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". examined into all my thoughts and feelings (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And known me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". arrived at a full knowledge of my spiritual condition. Psalm 139:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Aramaic forms in this strophe are the ἅπαξ λεγομ רע (ground-form רעי) in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", endeavour, desire, thinking, like רעוּת and רעיון in the post-exilic books, from רעה (רעא), cupere, cogitare; and the ἅπ. λεγ. רבע in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", equivalent to רבץ, a lying down, if רבעי be not rather an infinitive like בּלעי in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 7:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", since ארחי is undoubtedly not inflected from ארח, but, as being infinitive, like עברי in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ארח; and the verb ארח also, with the exception of this passage, only occurs in the speeches of Elihu (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 34:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which are almost more strongly Aramaizing than the Book of Job itself. Further, as an Aramaizing feature we have the objective relation marked by Lamed in the expression בּנתּה לרעי, Thou understandest my thinking, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 116:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 129:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 135:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 136:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The monostichic opening is after the Davidic style, e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Among the prophets, Isaiah in particular is fond of such thematic introductions as we have here in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On ותּדע instead of ותּדעני vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the pronominal object stands once beside the first verb, or even beside the second (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), instead of twice (Hitzig). The \"me\" is then expanded: sitting down, rising up, walking and lying, are the sum of human conditions or states. רעי is the totality or sum of the life of the spirit and soul of man, and דּרכי the sum of human action. The divine knowledge, as ותּדע says, is the result of the scrutiny of man. The poet, however, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " uses the perfect throughout as a mood of that which is practically existing, because that scrutiny is a scrutiny that is never unexecuted, and the knowledge is consequently an ever-present knowledge. מרחוק is meant to say that He sees into not merely the thought that is fully fashioned and matured, but even that which is being evolved. זרית from זרה is combined by Luther (with Azulai and others) with זר, a wreath (from זרר, constringere, cingere), inasmuch as he renders: whether I walk or lie down, Thou art round about me (Ich gehe oder lige, so bistu umb mich). זרה ought to have the same meaning here, if with Wetzstein one were to compare the Arabic, and more particularly Beduin, drrâ, dherrâ, to protect; the notion of affording protection does not accord with this train of thought, which has reference to God's omniscience: what ought therefore to be meant is a hedging round which secures its object to the knowledge, or even a protecting that places it in security against any exchanging, which will not suffer the object to escape it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: This Verb. tert. Arab. w et y is old, and the derivative dherâ, protection, is an elegant word; with reference to another derivative, dherwe, a wall of rock protecting one from the winds, vid., Job, at Job 24:7, note. The II form (Piel) signifies to protect in the widest possible sense, e.g., (in Neshwn, ii. 343b), \"[Arab.] drâ 'l-šâh, he protected the sheep (against being exchanged) by leaving a lock of wool upon their backs when they were shorn, by which they might be recognised among other sheep.\")",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: This Verb. tert. Arab. w et y is old, and the derivative dherâ, protection, is an elegant word; with reference to another derivative, dherwe, a wall of rock protecting one from the winds, vid., Job, at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 24:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", note. The II form (Piel) signifies to protect in the widest possible sense, e.g., (in Neshwn, ii. 343b), \"[Arab.] drâ 'l-šâh, he protected the sheep (against being exchanged) by leaving a lock of wool upon their backs when they were shorn, by which they might be recognised among other sheep.\")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Arabic ḏrâ, to know, which is far removed in sound, is by no means to be compared; it is related to Arab. dr', to push, urge forward, and denotes knowledge that is gained by testing and experimenting. But we also have no need of that Arab. ḏrâ, to protect, since we can remain within the range of the guaranteed Hebrew usage, inasmuch as זרה, to winnow, i.e., to spread out that which has been threshed and expose it to the current of the wind, in Arabic likewise ḏrrâ, (whence מזרה, midhrâ, a winnowing-fork, like רחת, racht, a winnowing-shovel), gives an appropriate metaphor. Here it is equivalent to: to investigate and search out to the very bottom; lxx, Symmachus, and Theodotion, ἐξιξηνίασας, after which the Italic renders investigasti, and Jerome eventilasti. הסכּין with the accusative, as in Job 22:21 with עם: to enter into neighbourly, close, familiar relationship, or to stand in such relationship, with any one; cogn. שׁכן, Arab. skn. God is acquainted with all our ways not only superficially, but closely and thoroughly, as that to which He is accustomed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Arabic ḏrâ, to know, which is far removed in sound, is by no means to be compared; it is related to Arab. dr', to push, urge forward, and denotes knowledge that is gained by testing and experimenting. But we also have no need of that Arab. ḏrâ, to protect, since we can remain within the range of the guaranteed Hebrew usage, inasmuch as זרה, to winnow, i.e., to spread out that which has been threshed and expose it to the current of the wind, in Arabic likewise ḏrrâ, (whence מזרה, midhrâ, a winnowing-fork, like רחת, racht, a winnowing-shovel), gives an appropriate metaphor. Here it is equivalent to: to investigate and search out to the very bottom; lxx, Symmachus, and Theodotion, ἐξιξηνίασας, after which the Italic renders investigasti, and Jerome eventilasti. הסכּין with the accusative, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with עם: to enter into neighbourly, close, familiar relationship, or to stand in such relationship, with any one; cogn. שׁכן, Arab. skn. God is acquainted with all our ways not only superficially, but closely and thoroughly, as that to which He is accustomed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Psalm 139:4 this omniscience of God is illustratively corroborated with כּי; Psalm 139:4 has the value of a relative clause, which, however, takes the form of an independent clause. מלּה (pronounced by Jerome in his letter to Sunnia and Fretela, 82, MALA) is an Aramaic word that has been already incorporated in the poetry of the Davidico-Salomonic age. כלּהּ signifies both all of it and every one. In Psalm 139:5 Luther has been misled by the lxx and Vulgate, which take צוּר in the signification formare (whence צוּרה, forma); it signifies, as the definition \"behind and before\" shows, to surround, encompass. God is acquainted with man, for He holds him surrounded on all sides, and man can do nothing, if God, whose confining hand he has lying upon him (Job 9:23), does not allow him the requisite freedom of motion. Instead of דּעתּך (XX ἡ γνῶσίς σου) the poet purposely says in Psalm 139:6 merely דּעת: a knowledge, so all-penetrating, all-comprehensive as God's knowledge. The Ker reads פּליאה, but the Chethb פּלאיּה is supported by the Chethb פּלאי in Judges 13:18, the Ker of which there is not פּליא, but פּלי (the pausal form of an adjective פּלי, the feminine of which would be פּליּה). With ממּנּי the transcendence, with נשׂגּבה the unattainableness, and with להּ לא־אוּכל the incomprehensibleness of the fact of the omniscience of God is expressed, and with this, to the mind of the poet, coincides God's omnipresence; for true, not merely phenomenal, knowledge is not possible without the immanence of the knowing one in the thing known. God, however, is omnipresent, sustaining the life of all things by His Spirit, and revealing Himself either in love or in wrath - what the poet styles His countenance. To flee from this omnipresence (מן, away from), as the sinner and he who is conscious of his guilt would gladly do, is impossible. Concerning the first אנּה, which is here accented on the ultima, vid., on Psalm 116:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this omniscience of God is illustratively corroborated with כּי; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " has the value of a relative clause, which, however, takes the form of an independent clause. מלּה (pronounced by Jerome in his letter to Sunnia and Fretela, 82, MALA) is an Aramaic word that has been already incorporated in the poetry of the Davidico-Salomonic age. כלּהּ signifies both all of it and every one. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Luther has been misled by the lxx and Vulgate, which take צוּר in the signification formare (whence צוּרה, forma); it signifies, as the definition \"behind and before\" shows, to surround, encompass. God is acquainted with man, for He holds him surrounded on all sides, and man can do nothing, if God, whose confining hand he has lying upon him (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), does not allow him the requisite freedom of motion. Instead of דּעתּך (XX ἡ γνῶσίς σου) the poet purposely says in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " merely דּעת: a knowledge, so all-penetrating, all-comprehensive as God's knowledge. The Ker reads פּליאה, but the Chethb פּלאיּה is supported by the Chethb פּלאי in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 13:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Ker of which there is not פּליא, but פּלי (the pausal form of an adjective פּלי, the feminine of which would be פּליּה). With ממּנּי the transcendence, with נשׂגּבה the unattainableness, and with להּ לא־אוּכל the incomprehensibleness of the fact of the omniscience of God is expressed, and with this, to the mind of the poet, coincides God's omnipresence; for true, not merely phenomenal, knowledge is not possible without the immanence of the knowing one in the thing known. God, however, is omnipresent, sustaining the life of all things by His Spirit, and revealing Himself either in love or in wrath - what the poet styles His countenance. To flee from this omnipresence (מן, away from), as the sinner and he who is conscious of his guilt would gladly do, is impossible. Concerning the first אנּה, which is here accented on the ultima, vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 116:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]