[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Precious.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "weighty, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the first meaning of the word. The parallelism requires this, as also the peculiar word for “thoughts,” for which see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We have here the antithesis to that verse: while the Divine penetration discovers the most intimate thought of man, man finds God’s secrets incomprehensible.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 139:17-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:17-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How precious also, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “From the wonders of God’s forming hand, the psalmist proceeds to those of his all-directing providence, which afford additional proofs of the divine omniscience and omnipresence.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Are thy thoughts unto me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thy counsels, or contrivances, in my behalf, which are admirable and amiable in my eyes, and replete with kindness. Thou didst not only form me at first, but ever since my conception and birth thy thoughts have been employed for my good, preserving, providing for, and blessing me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How great is the sum of them! — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thy gracious counsels, designs, and providential dispensations toward me are numberless. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If I should count them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אספרם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall I count them? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, shall I attempt to count them? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They are more in number than the sand — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I might as well undertake to number the grains of sand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When I awake, I am still with thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thy wonderful counsels and works on my behalf come constantly into my mind, not only in the day-time, but even in the night-season, whenever I awake. “The thoughts and counsels of Jehovah,” says Dr. Horne, “concerning David, his appointment to the throne, his troubles, and his preservation in the midst of them, were precious and delightful subjects of meditation and praise, never to be exhausted of the rich matter they contained. With these in his mind he lay down at night, and when he awoke in the morning his thoughts naturally recurred to the pleasing theme. He began where he had left off, and found himself, in heart and soul, still present with God, still ruminating on him and his works.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "139:17-24 God's counsels concerning us and our welfare are deep, such as cannot be known. We cannot think how many mercies we have received from him. It would help to keep us in the fear of the Lord all the day long, if, when we wake in the morning, our first thoughts were of him: and how shall we admire and bless our God for his precious salvation, when we awake in the world of glory! Surely we ought not to use our members and senses, which are so curiously fashioned, as instruments of unrighteousness unto sin. But our immortal and rational souls are a still more noble work and gift of God. Yet if it were not for his precious thoughts of love to us, our reason and our living for ever would, through our sins, prove the occasion of our eternal misery. How should we then delight to meditate on God's love to sinners in Jesus Christ, the sum of which exceeds all reckoning! Sin is hated, and sinners lamented, by all who fear the Lord. Yet while we shun them we should pray for them; with God their conversion and salvation are possible. As the Lord knows us thoroughly, and we are strangers to ourselves, we should earnestly desire and pray to be searched and proved by his word and Spirit. if there be any wicked way in me, let me see it; and do thou root it out of me. The way of godliness is pleasing to God, and profitable to us; and will end in everlasting life. It is the good old way. All the saints desire to be kept and led in this way, that they may not miss it, turn out of it, or tire in it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "How precious also are thy thoughts unto me, O God! - On the word \"thoughts,\" see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The remark is made here doubtless in view of the numberless \"thoughts\" involved in planning and forming a frame so wondrous, and in the care necessary to bring it to perfection; to develop it; to provide for it; to guard and defend it. How many \"thoughts\" of a parent are employed in behalf of his children, in providing for them; teaching them; counseling them; anticipating their needs. How manymore thoughts are needful on the part of God in reference to each one of us: for there are numberless things necessary for us which cannot occupy the mind of a parent, since he cannot accomplish these things for us; they do not lie within his province, or in his power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "How great is the sum of them - literally, \"How strong are the heads of them.\" That is, The heading of them, or the summing of them up, would be a task beyond the power of man. And who \"could\" estimate the number of the \"thoughts\" necessarily bestowed on himself by his Maker in all the care exercised over him; all the arrangements for his development and growth; all that is done to defend him from danger; all that is indispensable in providing for his needs; all that was necessary to secure the salvation of his soul! See the notes at Psalm 40:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "How great is the sum of them - literally, \"How strong are the heads of them.\" That is, The heading of them, or the summing of them up, would be a task beyond the power of man. And who \"could\" estimate the number of the \"thoughts\" necessarily bestowed on himself by his Maker in all the care exercised over him; all the arrangements for his development and growth; all that is done to defend him from danger; all that is indispensable in providing for his needs; all that was necessary to secure the salvation of his soul! See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 40:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 139",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 139:1-24. After presenting the sublime doctrines of God's omnipresence and omniscience, the Psalmist appeals to Him, avowing his innocence, his abhorrence of the wicked, and his ready submission to the closest scrutiny. Admonition to the wicked and comfort to the pious are alike implied inferences from these doctrines.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy thoughts:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is taken either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Passively, my thoughts of thee; or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Actively, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy thoughts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", counsels, or contrivances on my behalf, which are admirable and amiable in mine eyes. Thou didst not only form me at first, but ever since my conception and birth thy thoughts have been employed for me, in preserving and providing for me, and blessing of me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "How great is the sum of them!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thy gracious designs and providences towards me are numberless, as it follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "How precious also are thy thoughts unto me, O God!.... The word (r) signifies that which is scarce and rare, and not to be attained and enjoyed; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the thoughts and counsels of God are impenetrable and unsearchable; he knows our thoughts, as Aben Ezra observes, but we do not know his, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 139:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; as well as it likewise signifies the worth and value of them; God's thoughts are infinitely beyond ours, and infinitely more valuable and more important, and are concerning our welfare and happiness: it is marvellous that God should think of us at all; it is more so that his thoughts should not be thoughts of evil, to bring that evil upon its we deserve, but thoughts of peace and reconciliation in and by his Son, in whom he was reconciling the world to himself; thoughts of salvation and eternal life, and of the way and means of bringing it about; thoughts to provide for our present supply in this world, and to lay up for us for the world to come; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It may be interpreted of the thoughts which David had of God in his meditations of him, which were sweet, precious, and comfortable to him; of his lovingkindness to him, covenant grace, precious promises, and gracious dealings with him; but the former sense seems best. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"to me how precious they that love thee, the righteous, O God!'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and so the Septuagint, Vulgate Latin, Ethiopic, Syriac, and Arabic versions render it, \"thy friends\"; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "how great is the sum of them! or \"the heads of them\"; that is, not the chief of thy friends, but the sum of thy thoughts, these in the bulk, in the general, are not to be counted; and much less the particulars of them, these are not to be entered into or described. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) \"difficiles\", Cocceius; \"quam rarae\"; so some in Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) \"difficiles\", Cocceius; \"quam rarae\"; so some in Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "How {m} precious also are thy thoughts unto me, O God! how great is the sum of them!",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "How ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " precious also are thy thoughts unto me, O God! how great is the sum of them!",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) How should we esteem the excellent declaration of your wisdom in the creation of man?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To me then, who am the object of all this care, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "how precious are thy thoughts, O God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "! It is my delight to meditate upon the purposes of Thy Providence. How vast are the sums of them! There are, as it were, many items in that inexhaustible theme, each of which is immeasurable. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 92:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 26:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is possible however that the word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "precious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " means rather ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "incomprehensible, overwhelming",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and that the Psalmist is contrasting his knowledge of God with God’s knowledge of him. ‘Thou knowest all ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thoughts and ways; but to me ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thoughts are immeasurable and incomprehensible.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "How precious also are thy thoughts unto me, O God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "! If God's works are admirable, and, therefore, precious, so still more are his thoughts - those deep counsels of his, which must have preceded all manifestation of himself in act or work. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "How great is the sum of them!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Were they all added together, how immeasurable would be the amount! What a treasure of wisdom and knowledge; Psalm 139:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The embryo folded up in the shape of an egg is here called גּלם, from גּלם, to roll or wrap together (cf. glomus, a ball), in the Talmud said of any kind of unshapen mass (lxx ἀκατέργαστον, Symmachus ἀμόρφωτον) and raw material, e.g., of the wood or metal that is to be formed into a vessel (Chullin 25a, to which Saadia has already referred).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Epiphanius, Haer, xxx. 31, says the Hebrew γολμη signifies the peeled grains of spelt or wheat before they are mixed up and backed, the still raw (only bruised) flour-grains - a signification that can now no longer be supported by examples.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As to the rest, compare similar retrospective glances into the embryonic state in Job 10:8-12, 2 Macc. 7:22f. (Psychology, S. 209ff., tr. pp. 247f.). On the words in libro tuo Bellarmine makes the following correct observation: quia habes apud te exemplaria sive ideas omnium, quomodo pictor vel sculptor scit ex informi materia quid futurum sit, quia videt exemplar. The signification of the future יכּתבוּ is regulated by ראוּ, and becomes, as relating to the synchronous past, scribebantur. The days יצּרוּ, which were already formed, are the subject. It is usually rendered: \"the days which had first to be formed.\" If יצּרוּ could be equivalent to ייצּרוּ, it would be to be preferred; but this rejection of the praeform. fut. is only allowed in the fut. Piel of the verbs Pe Jod, and that after a Waw convertens, e.g., ויּבּשׁ  equals  וייבּשׁ, Nahum 1:4 (cf. Caspari on Obadiah 1:11).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As to the rest, compare similar retrospective glances into the embryonic state in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:8-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 2 Macc. 7:22f. (Psychology, S. 209ff., tr. pp. 247f.). On the words in libro tuo Bellarmine makes the following correct observation: quia habes apud te exemplaria sive ideas omnium, quomodo pictor vel sculptor scit ex informi materia quid futurum sit, quia videt exemplar. The signification of the future יכּתבוּ is regulated by ראוּ, and becomes, as relating to the synchronous past, scribebantur. The days יצּרוּ, which were already formed, are the subject. It is usually rendered: \"the days which had first to be formed.\" If יצּרוּ could be equivalent to ייצּרוּ, it would be to be preferred; but this rejection of the praeform. fut. is only allowed in the fut. Piel of the verbs Pe Jod, and that after a Waw convertens, e.g., ויּבּשׁ  equals  וייבּשׁ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. Caspari on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: But outside the Old Testament it also occurs in the Pual, though as a wrong use of the word; vide my Anekdota (1841), S. 372f.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Accordingly, assuming the original character of the לא in a negative signification, it is to be rendered: The days which were (already) formed, and there was not one among them, i.e., when none among them had as yet become a reality. The suffix of כּלּם points to the succeeding ימים, to which יצּרוּ is appended as an attributive clause; ולא אחד בּהם is subordinated to this יצּרוּ: cum non or nondum (Job 22:16) unus inter eos  equals  unus eorum (Exodus 14:28) esset. But the expression (instead of ועוד לא היה or טרם יהיה) remains doubtful, and it becomes a question whether the Ker ולו (vid., on Psalm 100:3), which stands side by side with the Chethb ולא (which the lxx, Aquila, Symmachus, Theodotion, the Targum, Syriac, Jerome, and Saadia follow), is not to be preferred. This ולו, referred to גלמי, gives the acceptable meaning: and for it (viz., its birth) one among them (these days), without our needing to make any change in the proposed exposition down to יצרו. We decide in favour of this, because this ולו אחד בהם does not, as ולא אחד בהם, make one feel to miss any היה, and because the ולי which begins Psalm 139:17 connects itself to it by way of continuation. The accentuation has failed to discern the reference of כלם to the following ימים, inasmuch as it places Olewejored against יכתבו. Hupfeld follows this accentuation, referring כלם back to גלמי as a coil of days of one's life; and Hitzig does the same, referring it to the embryos. But the precedence of the relative pronoun occurs in other instances also, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Accordingly, assuming the original character of the לא in a negative signification, it is to be rendered: The days which were (already) formed, and there was not one among them, i.e., when none among them had as yet become a reality. The suffix of כּלּם points to the succeeding ימים, to which יצּרוּ is appended as an attributive clause; ולא אחד בּהם is subordinated to this יצּרוּ: cum non or nondum (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") unus inter eos  equals  unus eorum (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") esset. But the expression (instead of ועוד לא היה or טרם יהיה) remains doubtful, and it becomes a question whether the Ker ולו (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 100:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which stands side by side with the Chethb ולא (which the lxx, Aquila, Symmachus, Theodotion, the Targum, Syriac, Jerome, and Saadia follow), is not to be preferred. This ולו, referred to גלמי, gives the acceptable meaning: and for it (viz., its birth) one among them (these days), without our needing to make any change in the proposed exposition down to יצרו. We decide in favour of this, because this ולו אחד בהם does not, as ולא אחד בהם, make one feel to miss any היה, and because the ולי which begins ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " connects itself to it by way of continuation. The accentuation has failed to discern the reference of כלם to the following ימים, inasmuch as it places Olewejored against יכתבו. Hupfeld follows this accentuation, referring כלם back to גלמי as a coil of days of one's life; and Hitzig does the same, referring it to the embryos. But the precedence of the relative pronoun occurs in other instances also, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The Hebrew poet, says Gesenius (Lehrgebude, S. 739f.), sometimes uses the pronoun before the thing to which it referred has even been spoken of. This phenomenon belongs to the Hebrew style generally, vid., my Anekdota (1841), S. 382.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and is devoid of all harshness, especially in connection with כּלּם, which directly signifies altogether (e.g., Isaiah 43:14).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and is devoid of all harshness, especially in connection with כּלּם, which directly signifies altogether (e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It is the confession of the omniscience that is united with the omnipotence of God, which the poet here gives utterance to with reference to himself, just as Jahve says with reference to Jeremiah, Jeremiah 1:5. Among the days which were preformed in the idea of God (cf. on יצרו, Isaiah 22:11; Isaiah 37:26) there was also one, says the poet, for the embryonic beginning of my life. The divine knowledge embraces the beginning, development, and completion of all things (Psychology, S. 37ff., tr. pp. 46ff.). The knowledge of the thoughts of God which are written in the book of creation and revelation is the poet's cherished possession, and to ponder over them is his favourite pursuit: they are precious to him, יקרוּ (after Psalm 36:8), not: difficult of comprehension (schwerbegreiflich, Maurer, Olshausen), after Daniel 2:11, which would surely have been expressed by עמקוּ (Psalm 92:6), more readily: very weighty (schwergewichtig, Hitzig), but better according to the prevailing Hebrew usage: highly valued (schwergewerthet), cara.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is the confession of the omniscience that is united with the omnipotence of God, which the poet here gives utterance to with reference to himself, just as Jahve says with reference to Jeremiah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Among the days which were preformed in the idea of God (cf. on יצרו, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") there was also one, says the poet, for the embryonic beginning of my life. The divine knowledge embraces the beginning, development, and completion of all things (Psychology, S. 37ff., tr. pp. 46ff.). The knowledge of the thoughts of God which are written in the book of creation and revelation is the poet's cherished possession, and to ponder over them is his favourite pursuit: they are precious to him, יקרוּ (after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 36:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), not: difficult of comprehension (schwerbegreiflich, Maurer, Olshausen), after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which would surely have been expressed by עמקוּ (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 92:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), more readily: very weighty (schwergewichtig, Hitzig), but better according to the prevailing Hebrew usage: highly valued (schwergewerthet), cara.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: It should be noted that the radical idea of the verb, viz., being heavy (German schwer), is retained in all these renderings. - Tr.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Their sums\" are powerful, prodigious (Psalm 40:6), and cannot be brought to a summa summarum. If he desires to count them (fut. hypothet. as in Psalm 91:7; Job 20:24), they prove themselves to be more than the sand with its grains, that is to say, innumerable. He falls asleep over the pondering upon them, wearied out; and when he wakes up, he is still with God, i.e., still ever absorbed in the contemplation of the Unsearchable One, which even the sleep of fatigue could not entirely interrupt. Ewald explains it somewhat differently: if I am lost in the stream of thoughts and images, and recover myself from this state of reverie, yet I am still ever with Thee, without coming to an end. But it could only perhaps be interpreted thus if it were העירותי or התעוררתּי. Hofmann's interpretation is altogether different: I will count them, the more numerous than the sand, when I awake and am continually with Thee, viz., in the other world, after the awaking from the sleep of death. This is at once impossible, because הקיצתי cannot here, according to its position, be a perf. hypotheticum. Also in connection with this interpretation עוד would be an inappropriate expression for \"continually,\" since the word only has the sense of the continual duration of an action or a state already existing; here of one that has not even been closed and broken off by sleep. He has not done; waking and dreaming and waking up, he is carried away by that endless, and yet also endlessly attractive, pursuit, the most fitting occupation of one who is awake, and the sweetest (cf. Jeremiah 31:26) of one who is asleep and dreaming. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Their sums\" are powerful, prodigious (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 40:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and cannot be brought to a summa summarum. If he desires to count them (fut. hypothet. as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 91:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), they prove themselves to be more than the sand with its grains, that is to say, innumerable. He falls asleep over the pondering upon them, wearied out; and when he wakes up, he is still with God, i.e., still ever absorbed in the contemplation of the Unsearchable One, which even the sleep of fatigue could not entirely interrupt. Ewald explains it somewhat differently: if I am lost in the stream of thoughts and images, and recover myself from this state of reverie, yet I am still ever with Thee, without coming to an end. But it could only perhaps be interpreted thus if it were העירותי or התעוררתּי. Hofmann's interpretation is altogether different: I will count them, the more numerous than the sand, when I awake and am continually with Thee, viz., in the other world, after the awaking from the sleep of death. This is at once impossible, because הקיצתי cannot here, according to its position, be a perf. hypotheticum. Also in connection with this interpretation עוד would be an inappropriate expression for \"continually,\" since the word only has the sense of the continual duration of an action or a state already existing; here of one that has not even been closed and broken off by sleep. He has not done; waking and dreaming and waking up, he is carried away by that endless, and yet also endlessly attractive, pursuit, the most fitting occupation of one who is awake, and the sweetest (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") of one who is asleep and dreaming. ",
            "children": []
          }
        ]
      }
    ]
  }
]