[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exact no more.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Under the “farming” system of taxation adopted by the Roman empire, this was the besetting temptation of all collectors employed in it, and it led naturally to the evil repute which attached, not in Judæa only, to the name of publican. (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-14 The scope and design of John's ministry were, to bring the people from their sins, and to their Saviour. He came preaching, not a sect, or party, but a profession; the sign or ceremony was washing with water. By the words here used John preached the necessity of repentance, in order to the remission of sins, and that the baptism of water was an outward sign of that inward cleansing and renewal of heart, which attend, or are the effects of true repentance, as well as a profession of it. Here is the fulfilling of the Scriptures, Isa 40:3, in the ministry of John. When way is made for the gospel into the heart, by taking down high thoughts, and bringing them into obedience to Christ, by levelling the soul, and removing all that hinders us in the way of Christ and his grace, then preparation is made to welcome the salvation of God. Here are general warnings and exhortations which John gave. The guilty, corrupted race of mankind is become a generation of vipers; hateful to God, and hating one another. There is no way of fleeing from the wrath to come, but by repentance; and by the change of our way the change of our mind must be shown. If we are not really holy, both in heart and life, our profession of religion and relation to God and his church, will stand us in no stead at all; the sorer will our destruction be, if we do not bring forth fruits meet for repentance. John the Baptist gave instructions to several sorts of persons. Those that profess and promise repentance, must show it by reformation, according to their places and conditions. The gospel requires mercy, not sacrifice; and its design is, to engage us to do all the good we can, and to be just to all men. And the same principle which leads men to forego unjust gain, leads to restore that which is gained by wrong. John tells the soldiers their duty. Men should be cautioned against the temptations of their employments. These answers declared the present duty of the inquirers, and at once formed a test of their sincerity. As none can or will accept Christ's salvation without true repentance, so the evidence and effects of this repentance are here marked out.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Exact - Demand, or take, no more.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Than that which is appointed - That is, by the government. John does not condemn the office, or say that the employment should be forsaken. Though it was hated by the people - though often abused and therefore unpopular - yet \"the office itself\" was not dishonorable. If there is a government, it must be supported; and of course there must be people whose duty it is to collect taxes, as the means of the proper support of the government; and as such a support of the government is necessary, so the people should pay cheerfully the just apportionment of their rulers, and regard favorably those who are authorized to collect it. See Romans 13:1-6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Than that which is appointed - That is, by the government. John does not condemn the office, or say that the employment should be forsaken. Though it was hated by the people - though often abused and therefore unpopular - yet \"the office itself\" was not dishonorable. If there is a government, it must be supported; and of course there must be people whose duty it is to collect taxes, as the means of the proper support of the government; and as such a support of the government is necessary, so the people should pay cheerfully the just apportionment of their rulers, and regard favorably those who are authorized to collect it. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 13:1-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. Exact no more, &c.—directed against that extortion which made the publicans a byword. (See on [1551]Lu 19:2; [1552]Lu 19:8). (Also see on [1553]Mt 3:10.)",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 3:12\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said unto them,.... Not by advising them to quit their employments, as if it was a thing unlawful to impose pay, and collect taxes, but by directing them to perform their office aright: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "exact no more than that which is appointed you; by the government: there were two sorts of publicans; there were some that exacted more than what they were ordered, and settled the tax at their own pleasure, and collected what they would themselves; and these were very odious to the people, and were reckoned with the worst of sinners, as thieves and robbers; but there were others, who behaved according to the orders of the government, and these were submitted to, as appears from the Jewish canons: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"says (s) Samuel, the judgment a kingdom, is judgment (i.e. the orders of a government ought to be regarded); R. Chanina bar Cahana says, that Samuel says it of a publican,   \"who has nothing appointed for him\": the house of R. Jannai say, of a publican that stands of himself.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The gloss is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"\"the judgment of a kingdom is judgment\"; this is he that receives from a king, a tax (to gather) in a thing,  \"that is fixed\", so and so for the year, and he is no robber: \"who has nothing appointed for him\", but takes according to his whole will and pleasure.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Maimonides expresses this in plainer language (t). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"in what things is it said that a publican is as thieves? when a Gentile publican, or a Gentile that stands of himself, or a publican that stands for the king, and hath nothing fixed for him, but he takes what he pleases, and leaves what he pleases: but a publican with whom the king agrees, and orders that he should take a third or a fourth, or,  \"any thing that is appointed\"; and he constitutes an Israelitish publican to collect that part for the king, and it is known that the man is faithful, and does not add any thing to what the king has decreed; he is not in the class of robbers, for the judgment of a king is judgment.--And so a king that lays a tax upon citizens, or upon every man and man, \"a thing fixed\"; or decrees, that whoever transgresses this thing, they shall take all his goods into the king's house; or that whatever shall be found in the field in the time of the barn (i.e. when it should be there) should pay tribute for it, whether he is the owner of the field or not: and so with respect to any thing else of this kind, it is not a robbery; and an Israelite that collects them for the king, is not in the number of robbers; for lo! he is right, and he does not add nor alter, nor take any thing to himself.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Now such publicans as these, were received and submitted to, but others were rejected; so Moses Kotsensis says (u), that ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"publicans that take,    \"more than what is appointed for them\", are rejected.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From all which we may learn what publicans these were that came to John's baptism, and put the above question to him; that they were Jewish publicans, and not Gentiles; and therefore John says nothing to them, but what concerned their employment, which he doubtless would have done, if they had been ignorant Gentiles: and also we see the reason of his expressing himself in this manner, since publicans were very apt to go beyond their orders, and require more than was fixed for them to collect; and likewise that John, in this advice, spoke the sense of the Jews themselves; who did not refuse to pay tribute, excepting some few, provided no more was exacted, than the government appointed; and as temptations to such evils were very great, and it lay in the power of these men to impose on the people, and extort from them, to abstain from such practices was an argument of the fear of God, of the truth of grace, and of the sincerity of repentance. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) T. Bab. Bava Kama, fol. 113. 1.((t) Hilch. Gezala, c. 5. sect. 11, 12. (u) Mitzvot Tora, pr. neg. 214. Vid. T. Bab. Sanhedrin, fol. 25. 2. Gloss in ib. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s) T. Bab. Bava Kama, fol. 113. 1.((t) Hilch. Gezala, c. 5. sect. 11, 12. (u) Mitzvot Tora, pr. neg. 214. Vid. T. Bab. Sanhedrin, fol. 25. 2. Gloss in ib. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said unto them, Exact no more than that which is {b} appointed you.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he said unto them, Exact no more than that which is ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " appointed you.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Require no more than that sum that is appointed for the tribute money.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μηδὲν πλέον παρὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": this mode of expressing comparison (usual in mod. Grk.) is common to Lk. and the Ep. to Heb. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), and has been used in support of the view that Lk. wrote Heb. “Non improbabilis videtur mihi eorum opinio qui Lucae eam Ep. adjudicant,” Pricaeus.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πράσσετε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", make, in a sinister sense, exact, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exigite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Beza. Kypke quotes Julius Pollux on the vices of the publicans, one being ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παρεισπράττων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nimium exigens",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and remarks that this word could not be better explained than by the phrase in Lk., ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πράττων π",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "π",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸ διατ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Exact no more",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This was their habitual sin, and later historians often allude to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "immodestia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i. e. the extravagant greed) of the publicans and their cruel exactions (Caes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bell. Civ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " iii. 32). The cheating and meddling for which Zacchaeus promised fourfold restoration (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") were universal among them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Luke 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Exact (πράσσετε)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The change of the Rev. to extort is unfortunate. The word is used of the exaction of legal tribute, and excessive exaction is expressed by the following words' John would hardly have commanded them to extort in any case. ",
        "children": []
      }
    ]
  }
]