[{"num":18,"verse":"¶ At the same time the disciples came unto Jesus, saying, Who is the greatest in the kingdom of the heavens?"},{"num":2,"verse":"And Jesus called a little child unto him and set him in the midst of them"},{"num":3,"verse":"and said, Verily I say unto you, Except ye be converted and become as little children, ye shall not enter into the kingdom of the heavens."},{"num":4,"verse":"Whosoever therefore shall humble himself as this little child, the same is greatest in the kingdom of the heavens."},{"num":5,"verse":"And whosoever shall receive one such little child in my name receives me."},{"num":6,"verse":"But whosoever shall cause one of these little ones who believe in me to fall, it would be better for him that a millstone such as is turned by an ass be hanged about his neck and that he be sunk in the depth of the sea."},{"num":7,"verse":"¶ Woe unto the world because of offenses! For it must needs be that offenses come, but woe to that man by whom the offense comes!"},{"num":8,"verse":"Therefore if thy hand or thy foot cause thee to fall, cut them off and cast them from thee; it is better for thee to enter into life halt or maimed, rather than having two hands or two feet to be cast into eternal fire."},{"num":9,"verse":"And if thine eye causes thee to fall, pluck it out and cast it from thee; it is better for thee to enter into life with one eye, rather than having two eyes to be cast into the hell of fire."},{"num":10,"verse":"Take heed that ye despise not one of these little ones; for I say unto you, That in the heavens their angels always behold the face of my Father who is in the heavens."},{"num":11,"verse":"For the Son of man is come to save that which was lost."},{"num":12,"verse":"What do you think? If a man had a hundred sheep and one of them went astray, would he not leave the ninety-nine and go into the mountains and seek that which is gone astray?"},{"num":13,"verse":"And if so be that he finds it, verily I say unto you, he rejoices more of that one than of the ninety-nine who did not go astray."},{"num":14,"verse":"Even so it is not the will of your Father who is in the heavens that one of these little ones should perish."},{"num":15,"verse":"¶ Therefore if thy brother shall sin against thee, go and reprove him between thee and him alone; if he shall hear thee, thou hast gained thy brother."},{"num":16,"verse":"But if he will not hear thee, then take with thee one or two more that in the mouth of two or three witnesses every word may be established."},{"num":17,"verse":"And if he shall neglect to hear them, tell it unto the congregation; {Gr. ekklesia – called out ones} but if he neglects to hear the congregation, {Gr. ekklesia – called out ones} let him be unto thee as a worldly man and a publican."},{"num":18,"verse":"Verily I say unto you, Whatever ye shall bind on earth shall be bound in the heaven; and whatever ye shall loose on earth shall be loosed in the heaven."},{"num":19,"verse":"Again I say unto you, That if two of you shall agree on earth as touching anything that they shall ask, it shall be done for them of my Father who is in the heavens."},{"num":20,"verse":"For where two or three are gathered together in my name, there am I in the midst of them."},{"num":21,"verse":"¶ Then Peter came to him and said, Lord, how often shall my brother sin against me and I forgive him? until seven times?"},{"num":22,"verse":"Jesus said unto him, I say not unto thee, Until seven times, but, Until seventy times seven."},{"num":23,"verse":"Therefore is the kingdom of the heavens likened unto a man who is king who would take account of his slaves."},{"num":24,"verse":"And when he had begun to reckon, one was brought unto him who owed him ten thousand talents."},{"num":25,"verse":"But he not having wherewith to pay, his lord commanded him to be sold, and his wife and children and all that he had, to make payment."},{"num":26,"verse":"The slave therefore fell down and worshipped him, saying, Lord, have patience with me, and I will pay thee all."},{"num":27,"verse":"Then the lord of that slave was moved with compassion and loosed him and forgave him the debt."},{"num":28,"verse":"But as the same slave was leaving, he found one of his fellowslaves who owed him a hundred denarius, and he laid hands on him and took him by the throat, saying, Pay me what thou owest."},{"num":29,"verse":"And his fellowslave fell down at his feet and besought him, saying, Have patience with me, and I will pay thee all."},{"num":30,"verse":"And he would not, but went and cast him into prison until he should pay the debt."},{"num":31,"verse":"So when his fellowslaves saw what was done, they were very grieved and came and declared unto their lord all that was done."},{"num":32,"verse":"Then his lord, after he had called him, said unto him, O thou wicked slave, I forgave thee all that debt because thou didst beseech me;"},{"num":33,"verse":"was it not also expedient unto thee to have mercy on thy fellowslave even as I had mercy on thee?"},{"num":34,"verse":"And his lord was wroth and delivered him to the tormentors until he should pay all that was due unto him."},{"num":35,"verse":"So likewise shall my heavenly Father do also unto you unless from your hearts ye forgive every one his brother their trespasses."}]