[{"num":18,"verse":"The disciples came to Jesus at that time. They said, `Who is the greatest in the kingdom of heaven?'"},{"num":2,"verse":"Jesus called a child to him. He had the child stand in front of them."},{"num":3,"verse":"He said, `I tell you the truth. If your hearts do not change and become like hearts of children, you will never go into the kingdom of heaven."},{"num":4,"verse":"So anyone who feels himself small like this little child is the greatest in the kingdom of heaven."},{"num":5,"verse":"`If anyone takes in a child like this for my sake, he takes in me.'"},{"num":6,"verse":"`These little children believe in me. If anyone makes one of them do wrong, he will be punished. He will have worse trouble than if a big stone were tied to his neck and he were thrown into the deep sea."},{"num":7,"verse":"`There will be trouble in the world because people make other people do wrong! People will do wrong. But the person who makes another person do wrong will have trouble."},{"num":8,"verse":"If your hand or your foot makes you do wrong, cut it off and throw it away! It is better for you to enter into life without hands or feet than to have two hands and two feet and be thrown into the fire that burns for ever."},{"num":9,"verse":"If your eye makes you do wrong, pull it out and throw it away! It is better for you to enter into life with one eye, than to have two eyes and be thrown into the hell fire.'"},{"num":10,"verse":"`Do not think badly of these little children. I tell you this. They have angels in heaven. And all the time their angels can see the face of my father who is in heaven."},{"num":11,"verse":"`The Son of Man came to save anyone who is lost."},{"num":12,"verse":"What do you think about this? A man has a hundred sheep. One of them is lost. Will he not leave the ninety-nine sheep on the hills and go to look for the one that is lost? Yes, he will."},{"num":13,"verse":"I tell you the truth. When he finds it, he is more happy to see that one than the ninety-nine that were not lost."},{"num":14,"verse":"In the same way, my Father in heaven does not want one of these little children to be lost.'"},{"num":15,"verse":"`If your brother does something wrong to you, go to him. Talk alone to him and tell him what he has done. If he listens to you, you have kept your brother as a friend."},{"num":16,"verse":"But if he does not listen to you, take one or two others with you to talk to him. Then two or three people will hear every word and can prove what was said."},{"num":17,"verse":"If he does not listen to them, tell the church. If he does not listen to the church, treat him as one who does not believe in God and as bad as a tax collector.'"},{"num":18,"verse":"`I tell you the truth. What you tie on earth will be tied in heaven. What you set free on earth will be set free in heaven."},{"num":19,"verse":"I tell you another thing. If two of you on earth agree together to ask for something, my Father in heaven will do it for them."},{"num":20,"verse":"Where two or three people meet together in my name, I am there with them.'"},{"num":21,"verse":"Then Peter came to Jesus and asked him, `Lord, how many times should I forgive my brother when he does wrong things to me? Should I forgive him seven times?'"},{"num":22,"verse":"Jesus answered him, `I say not seven times only, but seventy times seven."},{"num":23,"verse":"`In that way the kingdom of heaven is like this. A king was ready to finish his business with his servants."},{"num":24,"verse":"The first servant was brought in. He owed the king a very large sum of money."},{"num":25,"verse":"He could not pay it. So his master said, \"Go sell him, his wife, his children, and everything he has, and pay me!\""},{"num":26,"verse":"So the servant bowed down in front of him. He begged, \"Sir, give me time. I will pay everything.\""},{"num":27,"verse":"His master was sorry for him and let him go. He did not make him pay the money."},{"num":28,"verse":"`That same servant went out and met another servant. This man owed him a much smaller sum of money. He caught him by the throat and said, Pay me what you owe me!\""},{"num":29,"verse":"Then this servant bowed down in front of him. He begged, \"Give me time. I will pay you.\""},{"num":30,"verse":"But he said, \"No.\" He went and put the man in prison until he could pay what he owed him."},{"num":31,"verse":"`The other servants saw what he did. They were very sad. They went and told their master everything that had been done."},{"num":32,"verse":"Then his master called the first servant to him. He said, \"You bad man! I let you go. I did not make you pay all you owed me, because you begged me to be kind to you."},{"num":33,"verse":"You should have been kind to the other servant, as I was kind to you.\""},{"num":34,"verse":"His master was very angry. He turned the servant over to the prison guards until he could pay all he owed him."},{"num":35,"verse":"`That is like what my Father in heaven will do to every one of you, if you do not forgive your brother from your heart.'"}]