[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As he that bindeth a stone in a sling ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". . .—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the stone is soon gone from the sling and seen no more, so honour and a fool soon part company. This seems on the whole the most probable rendering of this verse.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 26:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 26:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As he that bindeth a stone in a sling — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Whereby he hinders his own design of throwing the stone out of it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so is he, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — No less absurd is he that giveth to a fool that honour which he is not capable of using aright. Bishop Patrick and Houbigant give a different interpretation of the verse, thus: “As a stone put into a sling stays not long there, so is that honour thrown away which is bestowed upon a fool.” Parkhurst, however, according to the translation in the margin, supposes the meaning to be, “As a spark, or small piece of precious stone, in a heap of stones, so is he that giveth honour to a fool.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:2. He that is cursed without cause, the curse shall do him no more harm than the bird that flies over his head. 3. Every creature must be dealt with according to its nature, but careless and profligate sinners never will be ruled by reason and persuasion. Man indeed is born like the wild ass's colt; but some, by the grace of God, are changed. 4,5. We are to fit our remarks to the man, and address them to his conscience, so as may best end the debate. 6-9. Fools are not fit to be trusted, nor to have any honour. Wise sayings, as a foolish man delivers and applies them, lose their usefulness. 10. This verse may either declare how the Lord, the Creator of all men, will deal with sinners according to their guilt, or, how the powerful among men should disgrace and punish the wicked. 11. The dog is a loathsome emblem of those sinners who return to their vices, 2Pe 2:22. 12. We see many a one who has some little sense, but is proud of it. This describes those who think their spiritual state to be good, when really it is very bad. 13. The slothful man hates every thing that requires care and labour. But it is foolish to frighten ourselves from real duties by fancied difficulties. This may be applied to a man slothful in the duties of religion. 14. Having seen the slothful man in fear of his work, here we find him in love with his ease. Bodily ease is the sad occasion of many spiritual diseases. He does not care to get forward with his business. Slothful professors turn thus. The world and the flesh are hinges on which they are hung; and though they move in a course of outward services, yet they are not the nearer to heaven. 15. The sluggard is now out of his bed, but he might have lain there, for any thing he is likely to bring to pass in his work. It is common for men who will not do their duty, to pretend they cannot. Those that are slothful in religion, will not be at the pains to feed their souls with the bread of life, nor to fetch in promised blessings by prayer. 16. He that takes pains in religion, knows he is working for a good Master, and that his labour shall not be in vain. 17. To make ourselves busy in other men's matters, is to thrust ourselves into temptation. 18,19. He that sins in jest, must repent in earnest, or his sin will be his ruin. 20-22. Contention heats the spirit, and puts families and societies into a flame. And that fire is commonly kindled and kept burning by whisperers and backbiters. 23. A wicked heart disguising itself, is like a potsherd covered with the dross of silver.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "i. e., \"To give honor to the fool is like binding a stone in a sling; you cannot throw it.\" In each case you misapply and so waste. Others render in the sense of the margin: To use a precious stone where a pebble would be sufficient, is not less foolish than to give honor to a fool. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. A stone, bound in a sling, is useless; so honor, conferred on a fool, is thrown away.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As he that bindeth a stone in a sling; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whereby he hinders his own design of throwing the stone out of it; or, who fastens it there only for a season, that he may speedily and violently throw it away. Or, as it is rendered in our margin, and by many others, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As he that putteth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a precious ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a stone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is oft emphatically used for a precious stone, both in Scripture, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 39:10 1 Chronicles 29:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 39:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 29:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and elsewhere, and also in other authors) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in an heap of stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is obscured and lost. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "So is he that giveth honour to a fool; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " no less absurd is he that giveth to a fool that honour and praise which he is not capable either of receiving, or retaining, or using aright, but it is quite wasted upon him, and doth him more hurt than good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As he that bindeth a stone in a sling,.... That so fastens it to it that it cannot be slung out of it, it becomes useless and does not answer the end for which it is put there; or that places it there that it may be cast out, and is cast out, and so is thrown away, and of no more use; or that puts a precious stone, so some interpret it, in a heap of common stones, even in such a heap as is used at the stoning of malefactors; or increases the heap of stones on such, which the more exposes them, and the greater reproach they are loaded with; so the more a fool is praised, it does but bring to mind his folly, and issues in his greater disgrace, so Gussetius (o): or rather it has respect to a precious stone put in such a heap of stones, as Luther; or else, according to Schultens, to such an one put into a heap of sepulchral stones; or, as Aben Ezra, that binds up a stone, a common stone, in purple, which to do is ridiculous, so R. Joseph Kimchi; the Vulgate Latin version renders it, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"as he that casts a stone to Mercury's heap;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a Heathen deity, called by the eastern people Mertholin and Margenah (p), which last is near the same with the Hebrew word here used; whose statue was set up where two or more ways met, to direct travellers; and who therefore out of respect to the deity, and to show gratitude to him, used to cast a stone to the heap for the support of it; and which stones, set up in such doubtful places, were dedicated to him, and were called after his name (q); and not only travellers did this in honour of the deity, and to make his statue more manifest (r), but also for profit, to clear the way from stones; and this custom obtained with the Indians, Arabs, Saracens, and now does with the Mahometans (s): and such heaps of stones were also placed in cities, and at the doors of houses, in honour of Mercury, and were called from him Hermae (t); these stones were also erected for borders of countries (u). But it is not probable that this custom obtained in Solomon's time; and yet some Jewish writers interpret it to this sense, as if he that gives honour to a fool is like him that casts a stone to Mercury; and Jarchi in the text observes it as the sense of some of their Rabbins, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"that he that teacheth the law to a disciple that is not fit, is as he that casts a stone to Mercury;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to cast a stone to Mercury is with them the same as to commit idolatry (w); but either of the former senses is best; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so is he that giveth honour to a fool; it is all thrown away and lost, as a stone out of a sling; or as unseemly as to put a precious stone among a heap of stones, or a common stone in purple; See Gill on Proverbs 26:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so is he that giveth honour to a fool; it is all thrown away and lost, as a stone out of a sling; or as unseemly as to put a precious stone among a heap of stones, or a common stone in purple; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 26:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Ebr. Comment. p. 777. (p) D. Herbert de Chefbury d. Relig Gent. c. 7. p. 58. (q) Suidas in voce  (r) Phurnutus de Natura Deorum, p. 33. (s) Vid. D. Herbert de Cherbury, ut supra, p. 59. (t) Cornel. Nepot. Vit. Alcibiad. l. 7. c. 3.((u) Pausan. Corinth. sive, l. 2. p. 157. (w) Misn. Sanhedrin, c. 7. s. 6. & Maimon. in ib. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) Ebr. Comment. p. 777. (p) D. Herbert de Chefbury d. Relig Gent. c. 7. p. 58. (q) Suidas in voce  (r) Phurnutus de Natura Deorum, p. 33. (s) Vid. D. Herbert de Cherbury, ut supra, p. 59. (t) Cornel. Nepot. Vit. Alcibiad. l. 7. c. 3.((u) Pausan. Corinth. sive, l. 2. p. 157. (w) Misn. Sanhedrin, c. 7. s. 6. & Maimon. in ib. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "As he that bindeth a stone in a sling, so is he that giveth honour to a fool.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bindeth a stone in a sling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This, which is the rendering of the LXX. (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅς ἀποδεσμεύει λίθον ἐν σφενδόνῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), must be taken to mean, he who “bindeth fast” (R.V. marg.) a stone so that it cannot come out, thus frustrating by his action the very purpose for which a stone is put into a sling. Such a proceeding is a fit emblem of the incongruity of “giving honour to a fool.” But the Heb. word thus rendered “sling,” that which casts away stones, occurs nowhere else, and it may have the meaning of a heap or collection of stones. And it is so understood both in A.V. marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As he that putteth a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " precious ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stone in an heap of stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in R.V. text, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As a bag of gems in an heap of stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This rendering gives point to the comparison: To put honour on one who is so utterly undeserving of it as a fool, is like hiding precious stones among worthless pebbles. It necessitates however our understanding the word “stone,” used absolutely and without anything in the context (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to limit its meaning, of a precious stone or gem.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Some commentators both ancient and modern have supposed that the “heap of stones” referred to is that under which the criminal who had been stoned to death lay buried. A similar idea appears in Coverdale’s rendering: “He that setteth a fool in hye dignite, that is even as yf a man dyd caste a precious stone upon the galous.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "For the “bag,” “that which” (instead of “he that”) “bindeth fast,” or holdeth securely precious stones, or other valuables, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“bundle”), where the Heb. word is the same as here.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As he that bindeth a stone in a sling.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ὅς ἀποδεσμέυει λίθον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐν σφενδόνῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This gives a very good sense the point being either that the stone, after being firmly fitted in its place, quickly passes away from the sling, or, if more stress is laid on the word \"bindeth,\" that the stone is so firmly fixed that it cannot be slung, and therefore never reaches the mark. The alternative rendering adopted by the Revised Version is this, \"As a bag of gems in a heap of stones;\" where the incongruity would consist either in exposing jewels on a cairn, or sepulchral monument, whence they could easily be filched, or in attracting undesirable attention. But there are grammatical and etymological reasons against this interpretation; and the Authorized Version is to be considered correct. The Vulgate is curious: ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Sieur qui mittit lapidem in acervum Mercurii",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This rendering points to the custom, with which Jerome must have been familiar, of erecting statues of Mercury on the highways, which were thus placed under his protection. Round these statues were ranged heaps of stones, to which every wayfarer contributed by throwing a pebble as he passed. The absence of the critical faculty which discerned no absurdity in this anachronism is sufficiently remarkable. The Latin saying  seems intended to denote useless labour, as we speak of \"carrying coals to Newcastle.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So is he that giveth honour to a fool.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " You pay respect to a fool, or place him in an honourable position, but your labour is wasted; he cannot act up to his dignity, he cannot maintain the honour; it passes away like the stone from the sling, or, if it remains, it is useless to him. Proverbs 26:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This proverb presents to us a new difficulty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As one binds a stone in a sling,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So is he who giveth honour to a fool.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This translation is warranted by tradition, and is in accordance with the actual facts. A sling is elsewhere called קלע; but that מרגּמה also in the passage before us signifies a sling (from רגם, to throw with stones  equals  to stone or to throw stones  equals  to sling, cf. Targ. Esther 5:14 רגּם, of David's slinging stones against Goliath), is supported by the lxx, Syr., and Targ. on the one side, and the Jewish Glossists on the other (Rashi: fronde, Ital. frombola). Rightly the lxx renders כּצרור as a verb: ὡς ἀποδεσμεύει; on the contrary, the Syr. and Targ. regard it as a substantive: as a piece of stone; but צרור as a substantive does not mean a piece, as one would put into a sling to use as a weapon, but a grain, and thus a little piece, 2 Samuel 17:13; cf. Amos 9:9. Erroneously Ewald: \"if one binds to the sling the stone which he yet seeks to throw, then all this throwing and aiming are in vain; so it is in vain to give to a fool honour which does not reach him.\" If one seeks to sling a stone, he must lay the lapis missilis so in the sling that it remains firm there, and goes forth only by the strong force of the slinging; this fitting in (of the stone), so that it does not of itself fall out, is expressed by צרר בּ (cf. Proverbs 30:4; Job 26:8). The giving is compared to the binding, the stones to the honour, and the sling to the fool: the fool is related to the honour which one confers on him, as the stone to the sling in which one lays it - the giving of honour is a slinging of honour. Otherwise (after Kimchi) the Venet. ὡς συνδεσμὸς λίθου ἐν λιθάδι, i.e., as Fleischer translates: ut qui crumenam gemmarum plenam in acervum lapidum conjicit. Thus also Ralbag, Ahron b. Josef, and others, and lastly Zckler. The figure is in the form of an address, and מרגּמה (from רגם, accumulare, congerere, vid., under Psalm 67:1-7 :28) might certainly mean the heaping of stones. But אבן is not used in the sense of אבן יקרה (precious stone); also one does not see why one precious stone is not enough as the figure of honour, and a whole heap is named; but in the third place, כּן נותן requires for כצרור a verbal signification. Therefore Jerome translates: sicut qui mittit lapidem in acervum Mercurii; in this the echo of his Jewish teacher, for the Midrash thus explains literally: every one who gives honour to a fool is like one who throws a stone on a heap of stones consecrated to Mercury. Around the Hermes (ἑρμαὶ), i.e., pillars with the head of Mercury (statuae mercuriales or viales), were heaps of stones (ἕρμακες), to which the passer-by was wont to throw a stone; it was a mark of honour, and served at the same time to improve the way, whose patron was Mercurious (מרקולים). It is self-evident that this Graeco-Roman custom to which the Talm. makes frequent reference, cannot be supposed to have existed in the times of Solomon. Luther translates independently, and apparently rendering into German that in acervum Mercurii: that is as if one threw a precious stone on the \"Rabenstein,\" i.e., the heap of stones raised at the foot of the gallows. This heap of stones is more natural and suitable to the times of Solomon than the heap of stones dedicated to Mercury, if, like Gussetius, one understands מרגמה of a heap of stones, supra corpus lapidatum. But against this and similar interpretations it is enough to remark that כצרור cannot signify sicut qui mittit. Had such a meaning been intended, the word would have been כּהשׁליך or כּמשׁליך. Still different is the rendering of Joseph Kimchi, Aben Ezra, and finally Lwenstein: as when one wraps up a stone in a piece of purple stuff. But ארגּמן, purple, has nothing to do with the verb רגם; it is, as the Aramaic ארגּון shows, a compound word; the supposition of a denom. מרגּמה thus proceeds from a false etymological supposition. And Hitzig's combination of מרגמה with (Arab.) munjam, handle and beam of a balance (he translates: as a stone on the beam of a balance, i.e., lies on it), is nothing but refined ingenuity, since we have no need at all of such an Arab. word for a satisfactory clearing up of מרגמה. We abide by the rendering of the sling. Bttcher translates: a sling that scatters; perhaps מרגמה in reality denotes such a sling as throws many stones at once. Let that, however, be as it may: that he who confers a title of honour, a place of honour, and the like, on a fool, is like one who lays a stone in a sling, is a true and intelligibly formed thought: the fool makes the honour no honour; he is not capable of maintaining it; that which is conferred on him is uselessly wasted. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This translation is warranted by tradition, and is in accordance with the actual facts. A sling is elsewhere called קלע; but that מרגּמה also in the passage before us signifies a sling (from רגם, to throw with stones  equals  to stone or to throw stones  equals  to sling, cf. Targ. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 5:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " רגּם, of David's slinging stones against Goliath), is supported by the lxx, Syr., and Targ. on the one side, and the Jewish Glossists on the other (Rashi: fronde, Ital. frombola). Rightly the lxx renders כּצרור as a verb: ὡς ἀποδεσμεύει; on the contrary, the Syr. and Targ. regard it as a substantive: as a piece of stone; but צרור as a substantive does not mean a piece, as one would put into a sling to use as a weapon, but a grain, and thus a little piece, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 17:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 9:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Erroneously Ewald: \"if one binds to the sling the stone which he yet seeks to throw, then all this throwing and aiming are in vain; so it is in vain to give to a fool honour which does not reach him.\" If one seeks to sling a stone, he must lay the lapis missilis so in the sling that it remains firm there, and goes forth only by the strong force of the slinging; this fitting in (of the stone), so that it does not of itself fall out, is expressed by צרר בּ (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 30:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 26:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The giving is compared to the binding, the stones to the honour, and the sling to the fool: the fool is related to the honour which one confers on him, as the stone to the sling in which one lays it - the giving of honour is a slinging of honour. Otherwise (after Kimchi) the Venet. ὡς συνδεσμὸς λίθου ἐν λιθάδι, i.e., as Fleischer translates: ut qui crumenam gemmarum plenam in acervum lapidum conjicit. Thus also Ralbag, Ahron b. Josef, and others, and lastly Zckler. The figure is in the form of an address, and מרגּמה (from רגם, accumulare, congerere, vid., under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 67:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " :28) might certainly mean the heaping of stones. But אבן is not used in the sense of אבן יקרה (precious stone); also one does not see why one precious stone is not enough as the figure of honour, and a whole heap is named; but in the third place, כּן נותן requires for כצרור a verbal signification. Therefore Jerome translates: sicut qui mittit lapidem in acervum Mercurii; in this the echo of his Jewish teacher, for the Midrash thus explains literally: every one who gives honour to a fool is like one who throws a stone on a heap of stones consecrated to Mercury. Around the Hermes (ἑρμαὶ), i.e., pillars with the head of Mercury (statuae mercuriales or viales), were heaps of stones (ἕρμακες), to which the passer-by was wont to throw a stone; it was a mark of honour, and served at the same time to improve the way, whose patron was Mercurious (מרקולים). It is self-evident that this Graeco-Roman custom to which the Talm. makes frequent reference, cannot be supposed to have existed in the times of Solomon. Luther translates independently, and apparently rendering into German that in acervum Mercurii: that is as if one threw a precious stone on the \"Rabenstein,\" i.e., the heap of stones raised at the foot of the gallows. This heap of stones is more natural and suitable to the times of Solomon than the heap of stones dedicated to Mercury, if, like Gussetius, one understands מרגמה of a heap of stones, supra corpus lapidatum. But against this and similar interpretations it is enough to remark that כצרור cannot signify sicut qui mittit. Had such a meaning been intended, the word would have been כּהשׁליך or כּמשׁליך. Still different is the rendering of Joseph Kimchi, Aben Ezra, and finally Lwenstein: as when one wraps up a stone in a piece of purple stuff. But ארגּמן, purple, has nothing to do with the verb רגם; it is, as the Aramaic ארגּון shows, a compound word; the supposition of a denom. מרגּמה thus proceeds from a false etymological supposition. And Hitzig's combination of מרגמה with (Arab.) munjam, handle and beam of a balance (he translates: as a stone on the beam of a balance, i.e., lies on it), is nothing but refined ingenuity, since we have no need at all of such an Arab. word for a satisfactory clearing up of מרגמה. We abide by the rendering of the sling. Bttcher translates: a sling that scatters; perhaps מרגמה in reality denotes such a sling as throws many stones at once. Let that, however, be as it may: that he who confers a title of honour, a place of honour, and the like, on a fool, is like one who lays a stone in a sling, is a true and intelligibly formed thought: the fool makes the honour no honour; he is not capable of maintaining it; that which is conferred on him is uselessly wasted. ",
            "children": []
          }
        ]
      }
    ]
  }
]