[{"header":"The Passover"},{"num":12,"verse":"The Lord said to Moses and Aaron in the land of Egypt, "},{"num":2,"verse":"“This month will be the beginning of months. It will be the first month of the year to you. "},{"num":3,"verse":"Speak to the people of Israel when they are gathered together. Tell them that on the tenth day of this month, every man must take a lamb for those of his father’s house, a lamb for each house. "},{"num":4,"verse":"If those in the house are too few to eat a lamb, let him and his nearest neighbor take the right amount for the number of people. Divide the lamb by how much each can eat. "},{"num":5,"verse":"Your lamb must be perfect, a male lamb one year old. You may take it from the sheep or the goats. "},{"num":6,"verse":"Keep it until the fourteenth day of the same month. Then all the people of Israel are to kill it in the evening. "},{"num":7,"verse":"Then they must take some of the blood and put it on the wood pieces at the sides and top of the door of each house where they will eat it. "},{"num":8,"verse":"They must eat the meat that same night, made ready over a fire. They will eat it with bread made without yeast and with bitter plants. "},{"num":9,"verse":"Do not eat any of it if it is not cooked or if it is made ready by boiling. But cook it over a fire, its head, legs and inside parts. "},{"num":10,"verse":"Do not save any of it until morning. Burn with fire whatever is left of it before morning."},{"num":11,"verse":"“Eat it with your shoes on your feet and your walking stick in your hand. And you must eat it in a hurry. It is the time the Lord will pass over. "},{"num":12,"verse":"For I will go through the land of Egypt on that night. And I will kill all the first-born in the land of Egypt, both man and animal. I will punish all the gods of Egypt. I am the Lord. "},{"num":13,"verse":"But the blood will mark for you the houses where you live. When I see the blood I will pass over you. And no trouble will come upon you to destroy you when I punish the land of Egypt."},{"num":14,"verse":"“This day will be for you to remember. You must remember it by having a special supper in honor to the Lord. All of you must keep it as a law forever. "},{"num":15,"verse":"Seven days you must eat bread made without yeast. On the first day you must get all the yeast out of your houses. Whoever eats anything with yeast from the first day until the seventh day will be taken away from Israel. "},{"num":16,"verse":"On the first day you must have a holy meeting of the people, and another holy meeting on the seventh day. Do no work at all on these days, except to get ready what every person must eat. You may do only that. "},{"num":17,"verse":"You must have the special supper of bread without yeast. For on this same day I brought your family groups out of the land of Egypt. So all of you must remember this day as a law forever."},{"num":18,"verse":"“In the first month, from the evening of the fourteenth day until the evening of the twenty-first day, you must eat bread made without yeast. "},{"num":19,"verse":"There must be no yeast found in your houses for seven days. For whoever eats anything with yeast, that person, stranger or born in the land, will be cut off from the people of Israel. "},{"num":20,"verse":"Do not eat anything with yeast. You must eat bread made without yeast in all your homes.”"},{"num":21,"verse":"Then Moses called for all the leaders of Israel. He said to them, “Go and choose lambs for your families, and kill the Passover lamb. "},{"num":22,"verse":"Take a small branch and put it in the blood in the pot. Spread some of the blood on the wood pieces on the top and sides of the door. Then none of you go outside the door of his house until morning. "},{"num":23,"verse":"For the Lord will pass through to kill the Egyptians. But when He sees the blood around your door, the Lord will pass over the door. He will not let the one who destroys come into your houses to kill you. "},{"num":24,"verse":"You must remember this as a law for you and your children forever. "},{"num":25,"verse":"You must remember this special time when you go to the land that the Lord has promised to give you. "},{"num":26,"verse":"When your children ask you, ‘What does this special time mean to you?’ "},{"num":27,"verse":"you will say, ‘It is a Passover gift to the Lord. Because He passed over the houses of the people of Israel in Egypt. He killed the Egyptians but saved our homes.’” And the people bowed to the ground and worshiped. "},{"num":28,"verse":"Then the people of Israel went and did what the Lord had told Moses and Aaron."},{"header":"Death of the First-Born"},{"num":29,"verse":"At midnight the Lord killed all the first-born in the land of Egypt, from the first-born of Pharaoh who sat on the throne to the first-born of the one who was held in prison, and all the first-born of the cattle. "},{"num":30,"verse":"Pharaoh got up in the night, he and his servants and all the Egyptians. And there was a loud cry in Egypt. For there was no home where there was not someone dead."},{"header":"Children of Israel Leave Egypt"},{"num":31,"verse":"Then Pharaoh called for Moses and Aaron at night. He said, “Get up and go away from my people, both you and the people of Israel. Go and worship the Lord, as you have said. "},{"num":32,"verse":"Take your flocks and your cattle, as you have said, and go. And pray that good will come to me also.”"},{"num":33,"verse":"The Egyptians were trying to make the people hurry out of the land. For they said, “We will all be dead.” "},{"num":34,"verse":"So the people took their dough before yeast had been added. They tied their dough pots in their clothes on their shoulders. "},{"num":35,"verse":"The people of Israel had done what Moses had said. They had asked the Egyptians for things made of silver and gold and for clothes. "},{"num":36,"verse":"And the Lord had given the people favor in the eyes of the Egyptians. So the Egyptians let them have whatever they asked for. And they took the best things of Egypt."},{"num":37,"verse":"The people of Israel traveled from Rameses to Succoth. There were about 600,000 men on foot, and also the women and children. "},{"num":38,"verse":"And a mixed group of people went with them, and very many flocks and cattle. "},{"num":39,"verse":"They made the dough they had brought out of Egypt into loaves of bread without yeast. Yeast was not added to the dough because they had been sent out of Egypt and could not wait. They could not make ready any food for themselves."},{"num":40,"verse":"The people of Israel had lived in Egypt 430 years. "},{"num":41,"verse":"At the end of 430 years, on that same day, all of the Lord’s people left Egypt. "},{"num":42,"verse":"It was a night to be remembered for the Lord for having brought them out of the land of Egypt. This night is for the Lord, to be remembered by all the people of Israel for all time."},{"header":"How the Passover Supper Should Be Eaten"},{"num":43,"verse":"The Lord said to Moses and Aaron, “This is the Law of the Passover. No stranger may eat of it. "},{"num":44,"verse":"But every servant who is bought with money may eat of it, only after he has gone through the religious act of becoming a Jew. "},{"num":45,"verse":"A stranger or paid servant may not eat of it. "},{"num":46,"verse":"It must be eaten in one house. You must not carry any of the meat outside the house. And you must not break a bone of it. "},{"num":47,"verse":"All the people of Israel must remember this. "},{"num":48,"verse":"But when a stranger staying with you wants to share in this special supper to the Lord, let all his men and boys go through the religious act of becoming a Jew. Then let him come near to share in the special supper. He will be like one who is born in the land. But no person who has not gone through the religious act may eat of it. "},{"num":49,"verse":"The same law is for the one who is born in the land and for the stranger who stays among you.”"},{"num":50,"verse":"Then all the people of Israel did just as the Lord had told Moses and Aaron. "},{"num":51,"verse":"On that same day the Lord brought the people of Israel out of the land of Egypt by their family groups."}]