[{"num":21,"verse":"Then Moses called all of Israel’s elders together and gave them instructions."},{"num":28,"verse":"The Israelites went and did as they were instructed; they were obedient to what the Eternal had commanded Moses and Aaron."},{"num":29,"verse":"Now this is what happened: at midnight, He struck down all the firstborn sons in Egypt—from the firstborn son of Pharaoh, who sat on his throne, to the firstborn son of the prisoners locked in the dungeon, and even the firstborn of all the livestock in the land. "},{"num":30,"verse":"Pharaoh woke up during the night. He wasn’t the only one. His servants, as well as all of the Egyptians in the land, had awoken. A great scream shattered the night in Egypt, for there was not a single Egyptian house where someone was not dead."},{"num":31,"verse":"Pharaoh sent for Moses and Aaron before the night was over."},{"num":33,"verse":"The Egyptians frantically urged the people of Israel to hurry and leave their land."},{"num":34,"verse":"So the Israelites hurried. They took their bread dough before any yeast had been added, packed up their kneading bowls, wrapped them in some of their clothing, and carried them on their shoulders."},{"num":35,"verse":"The people of Israel also did what Moses had told them to do; they asked the Egyptians for items made of silver and gold, and they asked for extra clothing as well. "},{"num":36,"verse":"The Eternal caused the Egyptians to have a favorable attitude toward His people, so the Egyptians fulfilled these requests and gave the people what they asked for. This is how the Israelites stripped the Egyptians of their valued possessions."},{"num":37,"verse":"The Israelites left and traveled from Rameses to Succoth. There were about 600,000 men, plus all the women and children. "},{"num":38,"verse":"Another crowd, made up of various and sundry peoples, accompanied them, as well as herds, flocks, and a great number of livestock. "},{"num":39,"verse":"They baked flat bread along the way from the dough without yeast which they carried with them from Egypt. The dough had no yeast because the people had been rushed out of Egypt, and they did not have enough time to gather food supplies for themselves."},{"num":40,"verse":"The Israelites had lived in the land of Egypt for a total of 430 years. On the last day of their 430th year, all the forces belonging to the Eternal left the land of Egypt. "},{"num":42,"verse":"This was the night when the Eternal kept watch over His people and brought them safely out of the land of Egypt; now this night is to be kept by His people, to be celebrated by all of the people of Israel throughout all generations."},{"num":50,"verse":"Then all of the Israelites did exactly as the Eternal had instructed Moses and Aaron to do. "},{"num":51,"verse":"On that same day, He led the Israelites as they marched out of the land of Egypt like an army."}]