[{"header":"God Is Always With His People"},{"num":43,"verse":"Jacob, the Lord created you. Israel, he made you, and now he says, “Don’t be afraid. I saved you. I named you. You are mine."},{"num":2,"verse":"When you have troubles, I am with you. When you cross rivers, you will not be hurt. When you walk through fire, you will not be burned; the flames will not hurt you."},{"num":3,"verse":"That’s because I, the Lord, am your God. I, the Holy One of Israel, am your Savior. I gave Egypt to pay for you. I gave Ethiopia and Seba to make you mine."},{"num":4,"verse":"You are precious to me, and I have given you a special place of honor. I love you. That’s why I am willing to trade others, to give up whole nations, to save your life."},{"num":5,"verse":"“So don’t be afraid, because I am with you. I will gather your children and bring them to you. I will gather them from the east and from the west."},{"num":6,"verse":"I will tell the north: Give my people to me. I will tell the south: Don’t keep my people in prison. Bring my sons and daughters to me from the faraway places."},{"num":7,"verse":"Bring to me all the people who are mine—the people who have my name. I made them for myself. I made them, and they are mine."},{"num":8,"verse":"“Bring out the people who have eyes but are blind. Bring out the people who have ears but are deaf."},{"num":9,"verse":"All people and all nations should also be gathered together. Which of their gods said this would happen? Which of their gods would tell what happened in the beginning? They should bring their witnesses. The witnesses should speak the truth. This will show they are right.”"},{"num":10,"verse":"The Lord says, “You people are my witnesses and the servant I chose. I chose you so that you would help people believe me. I chose you so that you would understand that ‘I Am He’—I am the true God. There was no God before me, and there will be no God after me."},{"num":11,"verse":"I myself am the Lord, and there is no other Savior."},{"num":12,"verse":"I am the one who spoke to you, saved you, and told you those things. It was not some stranger who was with you. You are my witnesses, and I am God.” (This is what the Lord himself said.)"},{"num":13,"verse":"“I have always been God. When I do something, no one can change what I have done. And no one can save people from my power.”"},{"num":14,"verse":"The Lord, the Holy One of Israel, saves you, and he says, “I will send armies to Babylon for you. Many people will be captured. Those Chaldeans will be taken away in their own boats. (They are so proud of those boats.)"},{"num":15,"verse":"I am the Lord your Holy One. I made Israel. I am your King.”"},{"header":"God Will Save His People Again"},{"num":16,"verse":"The Lord is making roads through the sea. He is making a path for his people, even through rough waters. The Lord says,"},{"num":17,"verse":"“Those who fight against me with their chariots, horses, and armies will be defeated. They will never rise again. They will be destroyed. They will be put out like the flame in a lamp."},{"num":18,"verse":"So don’t remember what happened in earlier times. Don’t think about what happened a long time ago,"},{"num":19,"verse":"because I am doing something new! Now you will grow like a new plant. Surely you know this is true. I will even make a road in the desert, and rivers will flow through that dry land."},{"num":20,"verse":"The wild animals will thank me. The large animals and birds will honor me when I put water in the desert and make rivers flow through that dry land. I will do this to give water to my chosen people."},{"num":21,"verse":"I made them, and they will sing songs of praise to me."},{"num":22,"verse":"“Jacob, you did not pray to me. Israel, you became tired of me."},{"num":23,"verse":"You have not brought your sheep as sacrifices to me. You have not honored me with your sacrifices. I did not force you to give gifts to me like slaves. I did not force you to burn incense until you became tired."},{"num":24,"verse":"So you did not use your money to buy things to honor me. But you did force me to be like your slave. You sinned until the bad things you did made me very tired."},{"num":25,"verse":"“I, I am the one who wipes away all your sins. I do this to please myself. I will not remember your sins."},{"num":26,"verse":"But you should remember me. Let’s meet together and decide what is right. Tell your story and prove that you are innocent."},{"num":27,"verse":"Your first father sinned, and your lawyers committed crimes against me."},{"num":28,"verse":"I will make your Temple leaders unfit to serve there. I will destroy Jacob. Bad things will happen to Israel."}]