[{"num":43,"verse":"But now the Lord who created you, O Israel, says: Don’t be afraid, for I have ransomed you; I have called you by name; you are mine. "},{"num":2,"verse":"When you go through deep waters and great trouble, I will be with you. When you go through rivers of difficulty, you will not drown! When you walk through the fire of oppression, you will not be burned up—the flames will not consume you. "},{"num":3,"verse":"For I am the Lord your God, your Savior, the Holy One of Israel. I gave Egypt and Ethiopia and Seba to Cyrus in exchange for your freedom, as your ransom. "},{"num":4,"verse":"Others died that you might live; I traded their lives for yours because you are precious to me and honored, and I love you."},{"num":5,"verse":"Don’t be afraid, for I am with you. I will gather you from east and west, "},{"num":6,"verse":"from north and south. I will bring my sons and daughters back to Israel from the farthest corners of the earth. "},{"num":7,"verse":"All who claim me as their God will come, for I have made them for my glory; I created them. "},{"num":8,"verse":"Bring them back to me—blind as they are and deaf when I call (although they see and hear!)."},{"num":9,"verse":"Gather the nations together! Which of all their idols ever has foretold such things? Which can predict a single day ahead? Where are the witnesses of anything they said? If there are no witnesses, then they must confess that only God can prophesy."},{"num":10,"verse":"But I have witnesses, O Israel, says the Lord! You are my witnesses and my servants, chosen to know and to believe me and to understand that I alone am God. There is no other God; there never was and never will be. "},{"num":11,"verse":"I am the Lord, and there is no other Savior. "},{"num":12,"verse":"Whenever you have thrown away your idols, I have shown you my power. With one word I have saved you. You have seen me do it; you are my witnesses that it is true. "},{"num":13,"verse":"From eternity to eternity I am God. No one can oppose what I do."},{"num":14,"verse":"The Lord, your Redeemer, the Holy One of Israel, says: For your sakes I will send an invading army against Babylon that will walk in, almost unscathed. The boasts of the Babylonians will turn to cries of fear. "},{"num":15,"verse":"I am the Lord, your Holy One, Israel’s Creator and King. "},{"num":16,"verse":"I am the Lord, who opened a way through the waters, making a path right through the sea. "},{"num":17,"verse":"I called forth the mighty army of Egypt with all its chariots and horses, to lie beneath the waves, dead, their lives snuffed out like candlewicks."},{"num":18,"verse":"But forget all that—it is nothing compared to what I’m going to do! "},{"num":19,"verse":"For I’m going to do a brand-new thing. See, I have already begun! Don’t you see it? I will make a road through the wilderness of the world for my people to go home, and create rivers for them in the desert! "},{"num":20,"verse":"The wild animals in the fields will thank me, the jackals and ostriches too, for giving them water in the wilderness, yes, springs in the desert, so that my people, my chosen ones, can be refreshed. "},{"num":21,"verse":"I have made Israel for myself, and these my people will some day honor me before the world."},{"num":22,"verse":"But O my people, you won’t ask my help; you have grown tired of me! "},{"num":23,"verse":"You have not brought me the lambs for burnt offerings; you have not honored me with sacrifices. Yet my requests for offerings and incense have been very few! I have not treated you as slaves. "},{"num":24,"verse":"You have brought me no sweet-smelling incense nor pleased me with the sacrificial fat. No, you have presented me only with sins and wearied me with all your faults."},{"num":25,"verse":"I, yes, I alone am he who blots away your sins for my own sake and will never think of them again. "},{"num":26,"verse":"Oh, remind me of this promise of forgiveness, for we must talk about your sins. Plead your case for my forgiving you. "},{"num":27,"verse":"From the very first your ancestors sinned against me—all your forebears transgressed my law. "},{"num":28,"verse":"That is why I have deposed your priests and destroyed Israel, leaving her to shame."}]