[{"header":"God Asks People to Change Their Lives"},{"num":2,"verse":"Shameless people, change your lives"},{"num":2,"verse":"before you become like a dry and dying flower. In the heat of day, a flower will wilt and die. You will be like that when the Lord shows his terrible anger. So change your lives before the Lord shows his anger against you!"},{"num":3,"verse":"All you humble people, come to the Lord! Obey his laws. Learn to do good things. Learn to be humble. Maybe then you will be safe when the Lord shows his anger."},{"header":"The Lord Will Punish Israel’s Neighbors"},{"num":4,"verse":"No one will be left in Gaza. Ashkelon will be destroyed. By noon, the people will be forced to leave Ashdod. Ekron will be empty."},{"num":5,"verse":"You Cretans living by the sea, this message from the Lord is about you. Canaan, land of the Philistines, you will be destroyed—no one will live there!"},{"num":6,"verse":"Your land by the sea will become empty fields for shepherds and their sheep."},{"num":7,"verse":"Then the land will belong to the survivors from Judah. The Lord their God will remember the people from Judah and restore their fortunes. Then they will let their sheep eat the grass in those fields. In the evenings they will lie down in the empty houses of Ashkelon."},{"num":8,"verse":"The Lord says, “I know what the people of Moab and Ammon did. They embarrassed my people. They took their land to make their own countries larger."},{"num":9,"verse":"So, as surely as I am alive, Moab and the people of Ammon will be destroyed like Sodom and Gomorrah. I am the Lord All-Powerful, the God of Israel, and I promise those countries will be destroyed completely forever. Their land will be overgrown with weeds. It will be like the land covered with salt by the Dead Sea. The survivors of my people will take that land and everything left in it.”"},{"num":10,"verse":"This will happen to the people of Moab and Ammon because they were so proud and cruel and humiliated the people of the Lord All-Powerful."},{"num":11,"verse":"They will be afraid of the Lord, because he will destroy their gods. Then everyone in all the faraway lands will worship the Lord."},{"num":12,"verse":"People of Ethiopia, this even means you! The Lord’s sword will kill your people."},{"num":13,"verse":"Then the Lord will turn north and punish Assyria. He will destroy Nineveh—that city will be like an empty, dry desert."},{"num":14,"verse":"Only sheep and wild animals will live in those ruins. Owls and crows will sit on the columns that are left standing. Their calls will be heard coming through the windows. Crows will sit on the doorsteps. Black birds will make their homes in those empty houses."},{"num":15,"verse":"Nineveh is so proud now. It is such a happy city. The people think they are safe. They think Nineveh is the greatest place in the world, but it will be destroyed! It will be an empty place where only wild animals go to rest. People who pass by will whistle and shake their heads when they see how badly the city was destroyed."}]