[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To the Assyrian.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Their adversity leads Ephraim to seek protection from their formidable foe instead of turning to the Lord. (On “Jareb,” see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Excursus.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "EXCURSUS A: ON JAREB (Hosea 5:13).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "EXCURSUS A: ON JAREB (Hosea 5:13).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Schrader, in his “Cuneiform Inscriptions and the Old Testament,” has the following note:—“King Combat, or Contention (Jareb), is not a proper name—none such being found in the Assyrian lists. In the prevailing uncertainty respecting Biblical chronology, it is hard to determine what Assyrian monarch is meant by this appellative. If we are to understand Salmanassar III. (781-772) as the king in Hosea 10:14, under the name Salman, the allusion here may be to Assur-dan-ilu (771-754), who conducted a series of expeditions to the West.” But when we turn to Schrader’s comment on Hosea 10:14, we find that he abandons the theory that Salman is Salmanassar III. (see ad. Loc.). On the other hand, Tiglath-pileser, whom Schrader and Sir H. Rawlinson identify with the Pul of Scripture, was a warrior of great prowess, to whom such a designation as “King Combat” from Hosea and his contemporaries would admirably apply. The verse might then be taken to refer to the events of the reign of Menahem (2Kings 15:19, see also Introduction). But this explanation, probable as it is, is complicated with questions of Biblical chronology. (See Introduction).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Schrader, in his “Cuneiform Inscriptions and the Old Testament,” has the following note:—“King Combat, or Contention (Jareb), is not a proper name—none such being found in the Assyrian lists. In the prevailing uncertainty respecting Biblical chronology, it is hard to determine what Assyrian monarch is meant by this appellative. If we are to understand Salmanassar III. (781-772) as the king in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 10:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", under the name Salman, the allusion here may be to ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Assur-dan-ilu",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (771-754), who conducted a series of expeditions to the West.” But when we turn to Schrader’s comment on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 10:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we find that he abandons the theory that Salman is Salmanassar III. (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "ad. Loc.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " On the other hand, Tiglath-pileser, whom Schrader and Sir H. Rawlinson identify with the Pul of Scripture, was a warrior of great prowess, to whom such a designation as “King Combat” from Hosea and his contemporaries would admirably apply. The verse might then be taken to refer to the events of the reign of Menahem (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", see also ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Introduction",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " But this explanation, probable as it is, is complicated with questions of Biblical chronology. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Introduction",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hosea",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "‘PHYSICIANS OF NO VALUE’Hosea 5:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘PHYSICIANS OF NO VALUE’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 5:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The long tragedy which ended in the destruction of the Northern Kingdom by Assyrian invasion was already beginning to develop in Hosea’s time. The mistaken politics of the kings of Israel led them to seek an ally where they should have dreaded an enemy. As Hosea puts it in figurative fashion, Ephraim’s discovery of his ‘sickness’ sent him in the vain quest for help to the apparent source of the ‘sickness,’ that is to Assyria, whose king in the text is described by a name which is not his real name, but is a significant epithet, as the margin puts it, ‘a king that should contend’; and who, of course, was not able to heal nor to cure the wounds which he had inflicted. Ephraim’s suicidal folly is but one illustration of a universal madness which drives men to seek for the healing of their misery, and the alleviation of their discomfort, in the repetition of the very acts which brought these about. The attempt to get relief in such a fashion, of course, fails; for as the verse before our text emphatically proclaims, it is God who has been ‘as a moth unto Ephraim,’ gnawing away his strength: and it is only He who can heal, since in reality it is He, and not the quarrelsome king of Assyria, who has inflicted the sickness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus understood, the text carries wide lessons, and may serve us as a starting-point for considering man’s discovery of his ‘sickness,’ man’s mad way of seeking healing, God’s way of giving it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, man’s discovery of his sickness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, then, man’s discovery of his sickness.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The greater part of most lives is spent in mechanical, unreflecting repetition of daily duties and pleasures. We are all apt to live on the surface, and it requires an effort, which we are too indolent to make except under the impulse of some arresting motive, to descend into the depths of our own souls, and there to face the solemn facts of our own personality. The last place with which most of us are familiar, is our innermost self. Men are dimly conscious that things within are not well with them; but it is only one here and there that says so distinctly to himself, and takes the further step of thoroughly investigating the cause. But that superficial life is at the mercy of a thousand accidents, each one of which may break through the thin film, and lay bare the black depths.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there is another aspect of this discovery of sickness, far graver than the mere consciousness of unrest. Ephraim does not see his sickness unless he sees his sin. The greater part of every life is spent without that deep, all-pervading sense of discord between itself and God. Small and recurrent faults may evoke recurring remonstrances of conscience, but that is a very different thing from the deep tones and the clear voice of condemnation in respect to one’s whole life and character which sounds in a heart that has learned how ‘deceitful and desperately wicked’ it is. Such a conviction may flash upon a man at any moment, and from a hundred causes. A sorrow, a sunset-sky, a grave, a sermon, may produce it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But even when we have come to recognise clearly our unrest, we have gone but part of the way, we have become conscious of a symptom, not of the disease. Why is it that man is alone among the creatures in that discontent with externals, and that dissatisfaction with himself? ‘Foxes have holes, and the birds of the air have roosting-places’: why is it that amongst all God’s happy creatures, and God’s shining stars, men stand ‘strangers in a strange land,’ and are cursed with a restlessness which has not ‘where to lay its head’? The consciousness of unrest is but the agitation of the limbs which indicates disease. That disease is the twitching paralysis of sin. Like ‘the pestilence that walketh in darkness,’ it has a fell power of concealing itself, and the man whose sins are the greatest is always the least conscious of them. He dwells in a region where the malaria is so all-pervading that the inhabitants do not know what the sweetness of an unpoisoned atmosphere is. If there is a ‘worst man’ in the world, we may be very sure that no conscience is less troubled than his is.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So the question may well be urged on those so terribly numerous amongst us, whose very unconsciousness of their true condition is the most fatal symptom of their fatal disease. What is the worth of a peace which is only secured by ignoring realities, and which can be shattered into fragments by anything that compels a man to see himself as he is? In such a fool’s paradise thousands of us live. ‘Use and wont,’ the continual occupation with the trifles of our daily lives, the fleeting satisfactions of our animal nature, the shallow wisdom which bids us ‘let sleeping dogs lie,’ all conspire to mask, to many consciences, their unrest and their sin. We abstain from lifting the curtain behind which the serpent lies coiled in our hearts, because we dread to see its loathly length, and to rouse it to lift its malignant head, and to strike with its forked tongue. But sooner or later-may it not be too late-we shall be set face to face with the dark recess, and discover the foul reptile that has all the while been coiled there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Man’s mad way of seeking healing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Man’s mad way of seeking healing.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Can there be a more absurd course of action than that recorded in our text? ‘When Ephraim saw his sickness, then went Ephraim to Assyria.’ The Northern Kingdom sought for the healing of their national calamities from the very cause of their national calamities, and in repetition of their national sin. A hopeful policy, and one which speedily ended in the only possible result! But that insanity was but a sample of the infatuation which besets us all. When we are conscious of our unrest, are we not all tempted to seek to conceal it with what has made it? Take examples from the grosser forms of animal indulgence. The drunkard’s vulgar proverb recommending ‘a hair of the dog that bit you,’ is but a coarse expression of a common fault. He is wretched until ‘another glass’ steadies, for a moment, his trembling hand, and gives a brief stimulus to his nerves. They say that the Styrian peasants, who habitually eat large quantities of arsenic, show symptoms of poison if they leave it off suddenly. These are but samples, in the physical region, of a tendency which runs through all lire, and leads men to drown thought by plunging into the thick of the worldly absorptions that really cause their unrest. The least persistent of men is strangely obstinate in his adherence to old ways, in spite of all experience of their crooked slipperiness. We wonder at the peasants who have their cottages and vineyards on the slopes of Vesuvius, and who build them, and plant them, over and over again after each destructive eruption. The tragedy of Israel is repeated in many of our lives; and the summing up of the abortive efforts of one of its kings to recover power by following the gods that had betrayed him, might be the epitaph of the infatuated men who see their sickness and seek to heal it by renewed devotion to the idols who occasioned it: ‘They were the ruin of him and of all Israel.’ The experience of the woman who had ‘spent all her living on physicians, and was nothing the better, but rather the worse,’ sums up the sad story of many a life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But again the sense of sin sometimes seeks to conceal itself by repetition of sin. When the dormant snake begins to stir, it is lulled to sleep again by absorption of occupations, or by an obstinate refusal to look inwards, and often by plunging once more into the sin which has brought about the sickness. To seek thus for ease from the stings of conscience, is like trying to silence a buzzing in the head by standing beside Niagara thundering in our ears. They used to beat the drums when a martyr died, in order to drown his testimony; and so foolish men seek to silence the voice of conscience by letting passions shout their loudest. It needs no words to demonstrate the incurable folly of such conduct; but alas, it takes many words far stronger than mine to press home the folly upon men. The condition of such a half-awakened conscience is very critical if it is soothed by any means by which it is weakened and its possessor worsened. In the sickness of the soul homoeopathic treatment is a delusion. Ephraim may go to Assyria, but there is no healing of him there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. God’s way of giving true healing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. God’s way of giving true healing.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ephraim thought that, because the wounds were inflicted by Assyria, it was the source to which to apply for bandages and balm. If it had realised that Assyria was but the battle-axe wherewith the hand of God struck it, it would have learned that from God alone could come healing and health. The unrest which betrays the presence in our souls of a deep-seated sin, is a divine messenger. We terribly misinterpret the true source of all that disturbs us when we attribute it only to the occasions which bring it about; for the one purpose of all our restlessness is to drive us nearer to God, and to wrench us away from our Assyria. The true issue of Ephraim’s sickness would have been the penitent cry, ‘Come, let us return to the Lord our God, for He hath smitten, and He will bind us up.’ It is in the consciousness of loving nearness to Him that all our unrest is soothed, and the heaving ocean in our hearts becomes as a summer’s sea and ‘birds of peace sit brooding on the charmed waves.’ It is in that same consciousness that conscience ceases to condemn, and loses its sting. The prophet from whom our text is taken ends his wonderful ministry, that had been full of fiery denunciations and dark prophecies, with words that are only surpassed in their tenderness and the outpouring of the heart of God, by the fuller revelation in Jesus Christ: ‘O Israel, return unto the Lord thy God. Take with you words, and return unto the Lord, and say unto Him: Assyria shall not save us, for in Thee the fatherless findeth mercy.’ The divine answer which he was commissioned to bring to the penitent Israel-’I will heal their backslidings, I will love them freely; if Mine anger is turned away from Me’-is, in all its wealth of forgiving love but an imperfect prophecy of the great Physician, from the hem of whose garment flowed out power to one who ‘had spent all her living on physicians and could not be healed of any,’ and who confirmed to her the power which she had thought to steal from Him unawares by the gracious words which bound her to Him for ever-’Daughter, thy faith hath made thee whole; go in peace.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 5:13-14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 5:13-14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When Ephraim, saw his sickness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— When the king of Israel, namely, Menahem, saw himself too weak to contend with Pul, king of Assyria, he sent an embassy to him to make him his ally, and, in order to do it, became his tributary, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his hand might be with him to confirm his kingdom to him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Judah his wound — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his ulcer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "corrupted sore. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So in like manner shall Ahaz, king of Judah, implore the assistance of Tiglath-pileser against his enemies. For, after the words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "then went Ephraim to the Assyrian, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Judah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "should be supplied, and the clause should be read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Judah sent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall send,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to King Jareb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thus Secker and Pocock understand the passage. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jareb ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "means one that will plead for a person, and defend his cause against any that may oppose him, or an ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "avenger, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "helper. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And it does not appear to be here a proper name. Bishop Horsley renders it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The king who takes up all quarrels, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and observes, “This describes some powerful monarch who took upon him to interfere in all quarrels between inferior powers, to arbitrate between them, and compel them to make up their differences upon such terms as he thought proper to dictate: whose alliance was, of course, anxiously courted by weaker states. Such was the Assyrian monarch in the times to which the prophecy relates. His friendship was purchased by Menahem king of Israel,” (as observed above,) “and in a later period solicited by Ahaz, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 16:5-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet could he not heal you, nor cure you of your wound — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Those foreign alliances proved to be of no benefit either to Israel or Judah. It is expressly said of Tiglath-pileser, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 28:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that when he came to Ahaz, under colour of helping him according to the terms of their agreement, at a time when Judah was brought low, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he distressed him, but strengthened him not. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And though Ahaz gave him presents ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of the house of the Lord, out of the house of the king, and of the princes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "still ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he helped him not. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And as to the ten tribes, the Assyrian kings were so far from helping them really, that they destroyed numbers of them from time to time, and at last carried them all away into captivity. So weak often is human policy! ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will be unto Ephraim as a lion — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Vulgate reads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "leœna, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "a lioness, and the LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a panther. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The sense of the verse is, that it was in vain for either Israel or Judah to expect help from men, since God had determined to destroy or take them away, as with the impetuosity of a panther flying upon his prey, or the fury of a lion, tearing it in pieces.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:8-15 The destruction of impenitent sinners is not mere talk, to frighten them, it is a sentence which will not be recalled. And it is a mercy that we have timely warning given us, that we may flee from the wrath to come. Compliance with the commandments of men, who thwart the commandments of God, ripens a people for ruin. The judgments of God are sometimes to a sinful people as a moth, and as rottenness, or as a worm; as these consume the clothes and the wood, so shall the judgments of God consume them. Silently, they shall think themselves safe and thriving, but when they look into their state, shall find themselves wasting and decaying. Slowly, for the Lord gives them space to repent. Many a nation; as well as many a person, dies of a consumption. Gradually, God comes upon sinners with lesser judgments, to prevent greater, if they will be wise, and take warning. When Israel and Judah found themselves in danger, they sought the protection of the Assyrians, but this only helped to make their wound the worse. They would be forced to apply to God. He will bring them home to himself, by afflictions. When men begin to complain more of their sins than of their afflictions, then there begins to be some hope of them; and when under the conviction of sin, and the corrections of the rod, we must seek the knowledge of God. Those who are led by severe trials to seek God earnestly and sincerely, will find him a present help and an effectual refuge; for with him is plenteous redemption for all who call upon him. There is solid peace, and there only, where God is.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Ephraim saw his sickness - Literally, \"And Ephraim saw,\" i. e., perceived it. God proceeds to tell them, how they acted when they felt those lighter afflictions, the decline and wasting of their power. The \"sickness\" may further mean the gradual inward decay; the \"wound,\" blows received from without.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And sent to king Jareb - Or, as in the English margin \"a king who should plead, or, an avenging king.\" The \"hostile king\" is, probably, the same Assyrian Monarch, whom both Israel and Judah courted, who was the destruction of Israel and who weakened Judah. Ahaz king of Judah did send to Tiglath-Pileser king of Assyria to come and save him, when \"the Lord brought Judah low; and Tiglath-Pileser king of Assyria came unto him and distressed him, but strengthened him not\" 2 Chronicles 28:19-20. He who held his throne from God sent to a pagan king, \"I am thy servant and thy son; come up and save me out of the hand of the king of Syria, and out of the hand of the king of Israel, which rise up against me\" 2 Kings 16:7-8. He emptied his own treasures, and pillaged the house of God, in order to buy the help of the Assyrian, and he taught him an evil lesson against himself, of his wealth and his weakness. God had said that, if they were faithful, \"five shall chase an hundred, and an hundred put ten thousand to flight\" Leviticus 26:8. He had pronounced him cursed, who trusted in man, and made flesh his arm, and whose heart departed from the Lord\" Jeremiah 17:5. But Judah sought man's help, not only apart from God, but against God. God was bringing them down, and they, by man's aid, would lift themselves up. \"The king\" became an \"avenger,\" for , \"whoso, when God is angry, striveth to gain man as his helper, findeth him God's avenger, who leadeth into captivity God's deserters, as though he were sworn to avenge God.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And sent to king Jareb - Or, as in the English margin \"a king who should plead, or, an avenging king.\" The \"hostile king\" is, probably, the same Assyrian Monarch, whom both Israel and Judah courted, who was the destruction of Israel and who weakened Judah. Ahaz king of Judah did send to Tiglath-Pileser king of Assyria to come and save him, when \"the Lord brought Judah low; and Tiglath-Pileser king of Assyria came unto him and distressed him, but strengthened him not\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 28:19-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He who held his throne from God sent to a pagan king, \"I am thy servant and thy son; come up and save me out of the hand of the king of Syria, and out of the hand of the king of Israel, which rise up against me\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 16:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He emptied his own treasures, and pillaged the house of God, in order to buy the help of the Assyrian, and he taught him an evil lesson against himself, of his wealth and his weakness. God had said that, if they were faithful, \"five shall chase an hundred, and an hundred put ten thousand to flight\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He had pronounced him cursed, who trusted in man, and made flesh his arm, and whose heart departed from the Lord\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 17:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But Judah sought man's help, not only apart from God, but against God. God was bringing them down, and they, by man's aid, would lift themselves up. \"The king\" became an \"avenger,\" for , \"whoso, when God is angry, striveth to gain man as his helper, findeth him God's avenger, who leadeth into captivity God's deserters, as though he were sworn to avenge God.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. wound—literally, \"bandage\"; hence a bandaged wound (Isa 1:6; Jer 30:12). \"Saw,\" that is, felt its weakened state politically, and the dangers that threatened it. It aggravates their perversity, that, though aware of their unsound and calamitous state, they did not inquire into the cause or seek a right remedy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "went … to the Assyrian—First, Menahem (2Ki 15:19) applied to Pul; again, Hoshea to Shalmaneser (2Ki 17:3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "sent to King Jareb—Understand Judah as the nominative to \"sent.\" Thus, as \"Ephraim saw his sickness\" (the first clause) answers in the parallelism to \"Ephraim went to the Assyrian\" (the third clause), so \"Judah saw his wound\" (the second clause) answers to (Judah) \"sent to King Jareb\" (the fourth clause). Jareb ought rather to be translated, \"their defender,\" literally, \"avenger\" [Jerome]. The Assyrian \"king,\" ever ready, for his own aggrandizement, to mix himself up with the affairs of neighboring states, professed to undertake Israel's and Judah's cause; in Jud 6:32, Jerub, in Jerub-baal is so used, namely, \"plead one's cause.\" Judah, under Ahaz, applied to Tiglath-pileser for aid against Syria and Israel (2Ki 16:7, 8; 2Ch 28:16-21); the Assyrian \"distressed him, but strengthened him not,\" fulfiling the prophecy here, \"he could not heal you, nor cure you of your wound.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", after that. Ephraim; the king, and council, and kingdom of the ten tribes; Menahem is surely meant: see 2 Kings xv. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Saw his sickness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " weakness, like a consumption, threatening death. Though Menahem had killed Shallun, and got into the throne, yet he found himself unable to hold it against the opposite faction, and therefore sent for assistance from Assyria, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 15:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or at least purchased the friendship of Pul, who was come out as an enemy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Judah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the other kingdom of the two tribes, saw his wound; a deep and festering wound; or a corrupting imposthume, which needs be opened, cleansed, and bound up: such was the state of the two tribes at that day, ulcerous and full of danger, for Ahaz had done very wickedly, and wounded the kingdom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then went, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " made application, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephraim to the Assyrian; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " particularly to Pul, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 15:19,20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Not one word of their going to God, he was not in all their thoughts: he did afflict leisurely that they might seek him, but they forgot him still. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And sent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ambassadors and presents to entreat and procure his help, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to king Jareb:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whilst interpreters agree not who this Jareb was, while some will have it be a proper, others an appellative name, of a person or place, I think it will be a surer course’ to compare times, who was king of Assyria when Ephraim was sick and Judah was wounded, and both felt it, for whoever this will prove to be, he it is that is meant by Jareb: Pul in Menahem’s time, Tiglath-pileser in Ahaz’s time. Or what if Jareb be the sum of what Ephraim and Judah desired of this Assyrian king; they complained of wrong received, and sent to this foreign king their complaint, and requested that he would judge, or, in our modern terms, be arbitrator; so the word will bear. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Yet could he not heal you; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ephraim’s sickness grew worse by it, Israel was sicker for it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Nor cure you, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Judah, Ahaz, and his wounded state, of your wound; the Assyrian king was either unable or unwilling to heal the wound, which he knew would as much profit him as hurt his patient. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Ephraim saw his sickness, and Judah saw his wound,.... That their civil state were in a sickly condition, very languid, weak, feeble, and tottering, just upon the brink of ruin; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then went Ephraim to the Assyrian, and sent to King Jareb; that is, the ten tribes, or the king of them, went and met the Assyrian king; and Judah the two tribes, or the king of them, sent ambassadors to King Jareb; which sense the order of the words, in connection with the preceding clause, seems to require: by the Assyrian and King Jareb we are to understand one and the same, as appears from the following words, \"yet could he not heal &c.\", whereas, if they were different, it would have been expressed, \"yet could they not heal &c.\", and the king of Assyria is meant, who: also is called King Jareb, or rather king of Jareb (n); see Hosea 10:6; for this does not seem to be the name of the king of Assyria himself; though it may be that Pul, or Tiglathpileser, or Shalmaneser, might have more names than one, whoever is meant; but rather it is the name of some place in Assyria, as Aben Ezra, Kimchi, and Ben Melech, from which the country may be here denominated; though the Targum takes it to be, not the proper name of a man or place, but an appellative, paraphrasing it, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "then went Ephraim to the Assyrian, and sent to King Jareb; that is, the ten tribes, or the king of them, went and met the Assyrian king; and Judah the two tribes, or the king of them, sent ambassadors to King Jareb; which sense the order of the words, in connection with the preceding clause, seems to require: by the Assyrian and King Jareb we are to understand one and the same, as appears from the following words, \"yet could he not heal &c.\", whereas, if they were different, it would have been expressed, \"yet could they not heal &c.\", and the king of Assyria is meant, who: also is called King Jareb, or rather king of Jareb (n); see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 10:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for this does not seem to be the name of the king of Assyria himself; though it may be that Pul, or Tiglathpileser, or Shalmaneser, might have more names than one, whoever is meant; but rather it is the name of some place in Assyria, as Aben Ezra, Kimchi, and Ben Melech, from which the country may be here denominated; though the Targum takes it to be, not the proper name of a man or place, but an appellative, paraphrasing it, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and sent to the king that shall come to avenge them;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and so other interpreters (o) understand it, rendering it, either the king that should defend, as Tremellius; or the king the adversary, or litigator, as Cocceius, Hillerus (p), and Gussetius (q); a court adversary, that litigates a point, contends with one, and is an advocate for another; or, as Hiller elsewhere (r) renders it, the king that lies in wait: this was fulfilled with respect to Ephraim, when Menahem king of Israel, or the ten tribes, often meant by Ephraim, went and met Pul king of Assyria, and gave him a thousand talents to depart out of his land; perceiving his own weakness to withstand him, and in order to strengthen and confirm the kingdom in his hand, 2 Kings 15:19; or when Hoshea king of Israel gave presents to Shalmaneser king of Assyria, and became a servant to him, till he could get stronger, and shake off his yoke, 2 Kings 17:3; and with respect to Judah it had its accomplishment when Ahaz king of Judah sent messengers to Tiglathpileser king of Assyria to come and help him against the kings of Syria and Israel, finding he was not strong enough to oppose them himself, 2 Kings 16:7; now all this was highly provoking to the Lord, that when both Israel and Judah found themselves in a weak condition, and unable to resist their enemies, instead of seeking to him for help they applied to a foreign prince, and which proved unsuccessful to them: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and so other interpreters (o) understand it, rendering it, either the king that should defend, as Tremellius; or the king the adversary, or litigator, as Cocceius, Hillerus (p), and Gussetius (q); a court adversary, that litigates a point, contends with one, and is an advocate for another; or, as Hiller elsewhere (r) renders it, the king that lies in wait: this was fulfilled with respect to Ephraim, when Menahem king of Israel, or the ten tribes, often meant by Ephraim, went and met Pul king of Assyria, and gave him a thousand talents to depart out of his land; perceiving his own weakness to withstand him, and in order to strengthen and confirm the kingdom in his hand, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or when Hoshea king of Israel gave presents to Shalmaneser king of Assyria, and became a servant to him, till he could get stronger, and shake off his yoke, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and with respect to Judah it had its accomplishment when Ahaz king of Judah sent messengers to Tiglathpileser king of Assyria to come and help him against the kings of Syria and Israel, finding he was not strong enough to oppose them himself, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 16:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; now all this was highly provoking to the Lord, that when both Israel and Judah found themselves in a weak condition, and unable to resist their enemies, instead of seeking to him for help they applied to a foreign prince, and which proved unsuccessful to them: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "yet could he not heal you, nor cure you of your wound; but, on the contrary, afflicted them, hurt and destroyed them; there being a \"meiosis\" in the words, which expresses less than is designed; for though, with respect to Ephraim or Israel, Pul king of Assyria desisted from doing any damage to Israel, yet a successor of his, TiglathPileser, came and took several places of Israel, and carried the inhabitants captive; and at last came Shalmaneser, and took Samaria, the metropolis of the land, and carried all the ten tribes captive, 2 Kings 15:29; and so, with respect to Judah, Tiglathpileser, whom Ahaz sent unto for help, not only did not help and strengthen him, but afflicted him, 2 Chronicles 28:20; thus when sensible sinners see their spiritual maladies, and feel the smart of their wounds, and make a wrong application for relief, to their tears, repentance, and humiliation, and to works of: righteousness, or to anything or person short of Christ the great Physician, they meet with no success, find no relief until better directed. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "yet could he not heal you, nor cure you of your wound; but, on the contrary, afflicted them, hurt and destroyed them; there being a \"meiosis\" in the words, which expresses less than is designed; for though, with respect to Ephraim or Israel, Pul king of Assyria desisted from doing any damage to Israel, yet a successor of his, TiglathPileser, came and took several places of Israel, and carried the inhabitants captive; and at last came Shalmaneser, and took Samaria, the metropolis of the land, and carried all the ten tribes captive, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so, with respect to Judah, Tiglathpileser, whom Ahaz sent unto for help, not only did not help and strengthen him, but afflicted him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 28:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; thus when sensible sinners see their spiritual maladies, and feel the smart of their wounds, and make a wrong application for relief, to their tears, repentance, and humiliation, and to works of: righteousness, or to anything or person short of Christ the great Physician, they meet with no success, find no relief until better directed. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n)   \"ad regem\", Jarchi, Zanchius, Liveleus, Drusius; so Luther in Tarnovius. (o) \"altorem\", V. L. \"qui eum vindicaret\", Tigurine version; \"propugnaturum\", Junius & Tremellius; \"qui litigaret\", Piscator. (p) Onomast. Sacr. p. 219. (q) Ebr. Comment. p. 780. (r) Onomast. Sacr. p. 430. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n)   \"ad regem\", Jarchi, Zanchius, Liveleus, Drusius; so Luther in Tarnovius. (o) \"altorem\", V. L. \"qui eum vindicaret\", Tigurine version; \"propugnaturum\", Junius & Tremellius; \"qui litigaret\", Piscator. (p) Onomast. Sacr. p. 219. (q) Ebr. Comment. p. 780. (r) Onomast. Sacr. p. 430. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "When Ephraim saw his sickness, and Judah saw his wound, then went Ephraim to {m} the Assyrian, and sent to king {n} Jareb: yet could he not heal you, nor cure you of your wound.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When Ephraim saw his sickness, and Judah ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "saw",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " his wound, then went Ephraim to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the Assyrian, and sent to king ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Jareb: yet could he not heal you, nor cure you of your wound.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Instead of seeking for remedy from God's hand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Who was king of the Assyrians.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Both states are conscious of the destroying cancer, but neither of them adopts the only possible means of arresting its progress.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his sickness … his wound",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The ordinary figure for corruption of the body politic; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and sent to king Jareb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Some have thought that as Ephraim and Judah are both mentioned in the first line, the subject of the second verb in this second line must be Judah. As the text stands, however, this is impossible, and if ‘Judah’ once stood in the text as the subject of ‘sent’, it is not easy to conjecture how it dropped out. None of the ancient versions contains the word. But who is ‘king Jareb’, or rather ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the fighting king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (a nickname for the king of Assyria), to whom Ephraim sent? Sennacherib has been thought of, as if there were a playful interpretation of a shortened form of this name, but the short for Sennacherib (on the analogy of Baladan for Merodach-Baladan, Sharezer for Nergal-Sharezer) would be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "akhirib",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "irib.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Schrader thinks that the king meant is Asurdan, who in 755 and 754 made expeditions against Khatarik (the Hadrach of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Arpadda (Arpad); Nowack prefers Tiglath-Pileser II., to whom the epithet ‘fighter’ would accurately apply. In the uncertainty of the Israelitish chronology of this period, a decision is difficult. Indeed, it is becoming more and more evident that the intercourse between Assyria and Israel was more frequent than the fragmentary Bible notices had led us to suppose.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yet could he not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "though be will not he able to heal you, nor shall ye be relieved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or, with other points, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shall he relieve you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "of your wound.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Delitzsch fully explains the passage in his note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 17:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word rendered ‘wound’ means both bandage and ulcer, and the verb is used in Syriac for ‘to be delivered, or, removed.’ How completely the politicians of Israel miscalculated, appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then went Ephraim to the Assyrian, and sent to King Jareb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Both kingdoms became conscious of their disease and decline; Ephraim felt its sickness or internal consumption, Judah its wound or external corruption (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mazor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a festering wound, from ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "zur",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to squeeze out); they were both conscious of rottenness in their condition. That diseased condition was rather spiritual apostasy than political adversity, though these were connected as cause and effect. But, instead of applying to Jehovah, Ephraim had recourse to Assyria and its king for health and help, but in vain; for no earthly power could avert the Divine judgments. The punishment threatened in the twelfth verse prompts the efforts to obtain succor mentioned in this. The general sense of the verse is given by Kimchi as follows: \"When Ephraim and Judah saw that the enemies were constantly invading and plundering them, they seek help from the King of Assyria; but turn not back to me, nor seek help from me, but from flesh and blood, which, however, cannot help them when it is not my pleasure.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Some, as the Jewish interpreters, refer the first clause as a matter of course to Ephraim, but the second to Judah; thus, Jerome in like manner understands Ephraim's visit of that to Pul, recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the message of Judah to Tiglath-pileser (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".); but an interval of thirty years lay between the two events thus described as synchronous. Rashi explains the former clause of Hoshea's visit to Shalmaneser the King of Assyria, and the second of Ahaz's to Tiglath-pileser; Kimchi, again, refers the former to Menahem visiting Pul, and the second of Ahaz to Tiglath-pileser (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 28:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ephraim is the subject in both clauses, so that there is no need of a supposed reference to Judah in the second. Calvin correctly restricts them both to Ephraim, and accounts for the restriction as follows: \"Why, then, does he name only Ephraim? Even because the beginning of this evil commenced in the kingdom of Israel; for they were the first who went to the King of Assur, that they might, by his help, resist their neighbors, the Syrians; the Jews afterwards followed their example. Since, then, the Israelites afforded a precedent to the Jews to send for aids of this kind, the prophet expressly confines his discourse to them.\" He admits, however, that the accusation had respect to both in common; or Ephraim may have applied on behalf of Judah as well as for herself. There is much diversity of opinion with regard to the word \"Jareb.\" Some take it ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for a proper name, either of an Assyrian king or of some place or city in the country of Assyria. as the LXX., Aben Ezra, and Kimchi; but the absence of the article is opposed to this, neither is ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 37:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"and Zechariah reigned as king\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vayyimloch melech",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " proper parallel. Others ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " more correctly explain as a qualifying epithet to \"king,\" that is, \"pleader,\" \"striver,\" or \"warrior,\" in ether words, a warlike or champion king, like the epithet of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σωτήρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " among the Greeks. The indefiniteness in this case gives the idea of majesty or might, as in Arabic; thus, \"a champion king, and such a king!\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yet could he not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "yet shall he not be able to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "heal you",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "heal you",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (plural, and so Ephraim and Judah), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "nor cure you of your wound.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Whatever the distress was, whether arising from hostile invasion or domestic troubles, those degenerate kings had recourse to foreigners for aid. With the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "profitlessness as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " well as the sinfulness of such attempts they are here sharply rebuked. Thus Calvin: \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Here",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God declares that whatever the Israelites might seek would be in vain. ' Ye think,' he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "says",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ' that you can escape my hand by these remedies; but your folly will at length betray itself, for he will avail you nothing; that is, King Jareb will not heal you.'\" Hosea 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The two kingdoms could not defend themselves against this chastisement by the help of any earthly power. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"And Ephraim saw his sickness, and Judah his abscess; and Ephraim went to Asshur, and sent to king Jareb (striver): but he cannot cure you, nor drive the abscess away from you.\" By the imperfects, with Vav rel., ויּלך, ויּרא, the attempts of Ephraim and Judah to save themselves from destruction are represented as the consequence of the coming of God to punish, referred to in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Inasmuch as this is to be seen, so far as the historical fulfilment is concerned, not in the present, but in the past and future, the attempts to obtain a cure for the injuries also belong to the present (? past) and future. Mâzōr does not mean a bandage or the cure of injuries (Ges., Dietr.), but is derived from זוּר, to squeeze out (see Del. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and signifies literally that which is pressed out, i.e., a festering wound, an abscess. It has this meaning not only here, but also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from which the meaning bandage has been derived. On the figure employed, viz., the disease of the body politic, see Delitzsch on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That this disease is not to be sought for specially in anarchy and civil war (Hitzig), is evident from the simple fact, that Judah, which was saved from these evils, is described as being just as sick as Ephraim. The real disease of the two kingdoms was apostasy from the Lord, or idolatry with its train of moral corruption, injustice, crimes, and vices of every kind, which destroyed the vital energy and vital marrow of the two kingdoms, and generated civil war and anarchy in the kingdom of Israel. Ephraim sought for help from the Assyrians, viz., from king Jareb, but without obtaining it. The name Jareb, i.e., warrior, which occurs here and at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is an epithet formed by the prophet himself, and applied to the king of Assyria, not of Egypt, as Theodoret supposes. The omission of the article from מלך may be explained from the fact that Jârēbh is, strictly speaking, an appellative, as in למוּאל מלך in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 31:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We must not supply Yehūdâh as the subject to vayyishlach. The omission of any reference to Judah in the second half of the verse, may be accounted for from the fact that the prophecy had primarily and principally to do with Ephraim, and that Judah was only cursorily mentioned. The ἅπ. λεγ. יגהה from גּהה, in Syriac to by shy, to flee, is used with min in the tropical sense of removing or driving away. ",
        "children": []
      }
    ]
  }
]