[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) The vain effort to repent when it is too late. The spirit with which sacrifices of flocks and herds were offered is of more consequence than the multitude of such oblations (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Ghastly and revolting results follow the substitution of ritual of any kind for the weightier matter of the law.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 5:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 5:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They shall go with their flocks and herds to seek the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They shall seek to make their peace with God, and to induce him to be favourable to them by a multitude of sacrifices; but they shall not find their expectations answered. This is spoken of the people of Judah, mentioned in the latter part of the foregoing verse; who, though they attended the temple worship, yet did it without any true sense of religion, for which the Prophets Isaiah and Jeremiah particularly reprove them. The prophecy seems to look forward to the times of Hezekiah and Josiah, declaring that the attempts of those pious kings to reclaim the people from idolatry, and to restore the true worship of God, would fail of any durable effect, and would not avail to reverse the doom pronounced upon the guilty people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He hath withdrawn himself from them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God is said to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hide and withdraw himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "when he will not answer men’s prayers, nor afford them seasonable relief in time of need. Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "חלצ מהם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he hath disengaged, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "loosened himself from them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hath taken himself away.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:1-7 The piercing eye of God saw secret liking and disposition to sin, the love the house of Israel had to their sins, and the dominion their sins had over them. Pride makes men obstinate in other sins. And as Judah was treading in the same steps, they would fall with Israel. By dealing treacherously with the Lord, men only deceive themselves. Those that go to seek the Lord with their flocks and their herds only, and not with their hearts and souls, cannot expect to find him; nor shall any speed who do not seek the Lord while he may be found. See how much it is our concern to seek God early, now, while it is the accepted time, and the day of salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They shall go with their flocks - \"They had let slip the day of grace, wherein God had called them to repentance, and promised to be found of them and to accept them. When then the decree was gone forth and judgment determined against them, all their outward shew of worship and late repentance shall not prevail to gain admittance for them to Him. He will not be found of them, hear them, nor accept them. They stopped their ears obstinately against Him calling on them, and proffering mercy in the day of mercy: He will now stop His ear against them, crying for it in the Day of Judgment.\" Repenting thus late, (as is the case with most who repent, or think that they repent, at the close of life) they did not repent out of the love of God, but out of slavish fear, on account of the calamity which was coming upon them. But the main truth, contained in this and other passages of Holy Scripture which speak of a time when it is too late to turn to God, is this: that \"it shall be too late to knock when the door shall be shut, and too late to cry for mercy when it is the time of justice.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God waits long for sinners; He threatens long before He strikes; He strikes and pierces in lesser degrees, and with increasing severity, before the final blow comes. In this life, He places man in a new state of trial, even after His first judgments have fallen on the sinner. But the general rule of His dealings is this; that, when the time of each judgment is actually come, then, as to \"that\" judgment, it is too late to pray. It is \"not\" too late for other mercy, or for final forgiveness, so long as man's state of probation lasts; but it is too late as to this one. And thus, each judgment in time is a picture of the eternal judgment, when the day of mercy is past forever, to those who have finally, in this life, hardened themselves against it. But temporal mercies correspond with temporal judgments; eternal mercy with eternal judgment. In time, it may be too late to turn away temporal judgments; it is not too late, while God continues grace, to flee from eternal; and the desire not to lose God, is a proof to the soul that it is not forsaken by God, by whom alone the longing for Himself is kept alive or re-awakened in His creature.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They shall not find Him - This befell the Jews in the time of Josiah. Josiah himself \"turned to the Lord with all his heart and with all his soul and with all his might, according to all the law of Moses\" 2 Kings 23:25-27. He put away idolatry thoroughly; and the people so tier followed his example. He held such a Passover, as had not been held since the time of the judges. \"Notwithstanding the Lord turned not from the fierceness of this great wrath, wherewith His anger was kindled against Judah because of all the provocations that Manasseh had provoked Him withal. And the Lord said, I will remove Judah out of My sight, as I have removed Israel, and will cast off this city Jerusalem, which I have chosen, and the house of which I said, My name shall be there.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They shall not find Him - This befell the Jews in the time of Josiah. Josiah himself \"turned to the Lord with all his heart and with all his soul and with all his might, according to all the law of Moses\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 23:25-27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He put away idolatry thoroughly; and the people so tier followed his example. He held such a Passover, as had not been held since the time of the judges. \"Notwithstanding the Lord turned not from the fierceness of this great wrath, wherewith His anger was kindled against Judah because of all the provocations that Manasseh had provoked Him withal. And the Lord said, I will remove Judah out of My sight, as I have removed Israel, and will cast off this city Jerusalem, which I have chosen, and the house of which I said, My name shall be there.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The prophet describes the people, as complying with God's commands; \"they shall go,\" i. e., to the place which God had chosen and commanded, \"with their flocks and their herds,\" i. e., with the most costly sacrifices, \"the flocks\" supplying the sheep and goats prescribed by the law; the \"herds\" supplying the bullocks, calves and heifers offered. They seem to have come, so far, sincerely. Yet perhaps it is not without further meaning, that the prophet speaks of those outward sacrifices only, not of the heart; and the reformation under Josiah may therefore have failed, because the people were too ingrained with sin under Manasseh, and returned outwardly only under Josiah, as they fell back again after his death. And so God speaketh here, as He does by David, \"I will take no bullock out of thine house, nor he-goat out of thy fold. Thinkest thou, that I will eat bulls' flesh, or drink the blood of goats?\" Psalm 50:9, Psalm 50:13, and by Isaiah, \"To what purpose is the multitude of your sacrifices unto Me? I am full of the burnt-offerings of rams, and the fat of fed beasts\" Isaiah 1:11.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The prophet describes the people, as complying with God's commands; \"they shall go,\" i. e., to the place which God had chosen and commanded, \"with their flocks and their herds,\" i. e., with the most costly sacrifices, \"the flocks\" supplying the sheep and goats prescribed by the law; the \"herds\" supplying the bullocks, calves and heifers offered. They seem to have come, so far, sincerely. Yet perhaps it is not without further meaning, that the prophet speaks of those outward sacrifices only, not of the heart; and the reformation under Josiah may therefore have failed, because the people were too ingrained with sin under Manasseh, and returned outwardly only under Josiah, as they fell back again after his death. And so God speaketh here, as He does by David, \"I will take no bullock out of thine house, nor he-goat out of thy fold. Thinkest thou, that I will eat bulls' flesh, or drink the blood of goats?\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 50:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 50:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and by Isaiah, \"To what purpose is the multitude of your sacrifices unto Me? I am full of the burnt-offerings of rams, and the fat of fed beasts\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He hath withdrawn Himself from them - Perhaps he would say, that God, as it were \"freed Himself\" from them, as He saith in Isaiah, \"I am weary to bear them\" Isaiah 1:14, the union of sacrifices and of sin. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He hath withdrawn Himself from them - Perhaps he would say, that God, as it were \"freed Himself\" from them, as He saith in Isaiah, \"I am weary to bear them\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the union of sacrifices and of sin. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. with … flocks—to propitiate Jehovah (Isa 1:11-15).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "seek … not find—because it is slavish fear that leads them to seek Him; and because it then shall be too late (Pr 1:28; Joh 7:34).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the people of Judah, say some, but I rather think it is spoken of the Ephraimites, and either implies by what they did support their confidence of escaping ruin, or else foretells that extremity of sufferings should force them at last to offer sacrifices to God; and the Jewish doctors tell us, that under Hoshea’s reign Israel had liberty of bringing their offerings and sacrifices to Jerusalem: whether this were so or not, it is certain they did not seek him in right manner, it was with their flocks and herds, but not with their hearts, not with sound repentance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But they shall not find him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whilst he might have been found they would not seek him, now as a punishment, and to leave them remediless, God will not be found of them; he will not either accept a sacrifice, or pardon their sin, or return to save them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He hath withdrawn himself from them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in displeasure hath withdrawn his favourable presence from them, and with resolution to leave them to the violences of the Assyrian powers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They shall go with their flocks and with their herds to seek the Lord,.... Not only the two tribes of Judah and Benjamin, to whom Kimchi, Aben Ezra, and Abarbinel, restrain the words; but the ten tribes of Israel also, who, when in distress, and seeing ruin coming upon them, should seek the Lord; seek help from him against their enemies, and the pardon of their sins; seek his face and favour, and to appease his wrath, by bringing a multitude of sacrifices out of their flocks and herds; such a number of them, as if they brought all their flocks and herds with them; but not with true repentance for their sins, nor with faith in the great sacrifice, which legal sacrifices, rightly performed, prefigured. Kimchi refers this to the times of Josiah; but, as it respects Israel as well as Judah, it seems to design some time a little before the ruin of them both: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but they shall not find him; shall not find grace and mercy with him; he will not be favourable to them, will not afford them any help, but give them up to utter ruin and destruction; as he did Israel at the Assyrian captivity, and Judah at the Babylonish captivity: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he hath withdrawn himself from them; the glory of the Lord departed from them; his Shechinah, or divine Majesty, as the Targum, removed from them, because of their idolatry, and other sins; they sought him not where and while he was to be found; and therefore, when they sought him, found him not, because he had withdrawn his presence from among them, being provoked by their iniquities. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he hath withdrawn himself from them; the glory of the Lord departed from them; his Shechinah, or divine Majesty, as the Targum, removed from them, because of their idolatry, and other sins; they sought him not where and while he was to be found; and therefore, when they sought him, found him not, because he had withdrawn his presence from among them, being provoked by their iniquities. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "They shall go with their flocks and with their herds to seek the LORD; but they shall not find him; he hath withdrawn himself from them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with their flocks and with their herds",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e., with their sacrificial offerings. This passage affords decisive proof (if indeed the converging evidence from other quarters can be held incomplete) that the Israelites of the north simply and in good faith professed to be worshippers of Jehovah. It will be too late, says the prophet, to use the ordinary means of appeasing Jehovah’s wrath, which have only a value as the outward signs of penitence and faith (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Micah uses similar expressions respecting prayers which are offered too late (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They shall go with their flocks and with their herds to seek the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In this way they attempt to break, if not pro-vent, their fall. With numerous and costly sacrifices they endeavor to propitiate Jehovah. With sheep and goats out of their flocks, and with bullocks and heifers out of their herd, they try to make reparation for the past or to secure present and future favor. But in vain. Israel might go to Bethel and Judah to Jerusalem; but to no purpose. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They shall not find him; he hath withdrawn himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their repentance came too late; or when it did come it wanted sincerity; or it was a wrong motive which prompted it - fear of approaching calamity and not love to their Creator; or their sins ran parallel with their sacrifice. Forgetting that obedience is better than sacrifice, they cherished a disobedient spirit or continued in their course of disobedience notwithstanding their outward sacrificial service. For one cause or other they fail in their efforts to find him; for, instead of being a present help in time of trouble, he has withdrawn beyond their reach; he has removed the Shechinah-glory of his presence from among them; or he has loosed himself from all those ties that once bound him in mercy to them, just as a husband frees himself from all responsibilities and disarms all liabilities on behalf of a faithless partner whom he has been forced to divorce. And such is the specific reason assigned in the next verse. Hosea 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Israel, moreover, will not be able to avert the threatening judgment by sacrifices. Jehovah will withdraw from the faithless generation, and visit it with His judgments. This is the train of thought in the next strophe (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:6-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"They will go with their sheep and their oxen to seek Jehovah, and will not find Him: He has withdrawn Himself from them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They acted treacherously against Jehovah, for they have born strange children: now will the new moon devour them with their fields.\" The offering of sacrifices will be no help to them, because God has withdrawn Himself from them, and does not hear their prayers; for God has no pleasure in sacrifices which are offered in an impenitent state of mind (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The reason for this is given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Bâgad, to act faithlessly, which is frequently applied to the infidelity of a wife towards her husband (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 3:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), points to the conjugal relation in which Israel stood to Jehovah. Hence the figure which follows. \"Strange children\" are such as do not belong to the home (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e., such as have not sprung from the conjugal union. In actual fact, the expression is equivalent to בּני זנוּנים in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though zâr does not expressly mean \"adulterous.\" Israel ought to have begotten children of God in the maintenance of the covenant with the Lord; but in its apostasy from God it had begotten an adulterous generation, children whom the Lord could not acknowledge as His own. \"The new moon will devour them,\" viz., those who act so faithlessly. the meaning is not, \"they will be destroyed on the next new moon;\" but the new moon, as the festal season, on which sacrifices were offered (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 20:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), stands here for the sacrifices themselves that were offered upon it. The meaning is this: your sacrificial feast, your hypocritical worship, so far from bringing you salvation, will rather prove your sin. חלקיהם are not sacrificial portions, but the hereditary portions of Israel, the portions of land that fell to the different families and households, and from the produce of which they offered sacrifices to the Lord.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: It is very evident from this verse, that the feasts and the worship prescribed in the Mosaic law were observed in the kingdom of the ten tribes, at the places of worship in Bethel and Dan.) ",
        "children": []
      }
    ]
  }
]