[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He killed James the brother of John with the sword.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Had the Apostle been tried by the Sanhedrin on a charge of blasphemy and heresy, the sentence would have been death by stoning. Decapitation showed, as in the case of John the Baptist, that the sentence was pronounced by a civil ruler, adopting Roman modes of punishment, and striking terror by them in proportion as they were hateful to the Jews. The death of James reminds us of his Lord’s prediction that he, too, should drink of His cup, and be baptised with His baptism (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The fulfilment of that prophecy was found for one brother in his being the proto-martyr of the apostolic company, as it was found for the other in his being the last survivor of it. What led to his being selected as the first victim we can only conjecture; but the prominent position which he occupies in the Gospels, in company with Peter and John, probably continued, and the natural vehemence indicated in the name of Son of Thunder may have marked him out as among the foremost teachers of the Church. The brevity of St. Luke’s record presents a marked contrast to the fulness of later martyrologies. A tradition preserved by Eusebius (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hist.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ii. 9) as coming from Clement of Alexandria, records that his accuser was converted by beholding his faith and patience, confessed his new faith, and was led to execution in company with the Apostle, who bestowed on him the parting benediction of “Peace be with thee.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Acts",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE MARTYRDOM OF JAMESActs 12:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE MARTYRDOM OF JAMES",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 12:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One might have expected more than a clause to be spared to tell the death of a chief man and the first martyr amongst the Apostles. James, as we know, was one of the group of the Apostles who were in especially close connection with Jesus Christ. He is associated in the Gospels with Peter and his brother John, and is always named before John, as if he were the more important of the two, by reason of age or of other circumstances unknown to us. But yet we know next to nothing about him. In the Acts of the Apostles he is a mere lay figure; his name is only mentioned in the catalogue at the beginning, and here again in the brief notice of his death. The reticent and merely incidental character of the notice of his martyrdom is sufficiently remarkable. I think the lessons of the fact, and of the, I was going to say, slight way in which the writer of this book refers to it, may perhaps be most pointedly brought out if we take four contrasts-James and Stephen, James and Peter, James and John, James and James. Now, if we take these four I think we shall learn something.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, James and Stephen. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, then, James and Stephen.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Look at the different scale on which the incidents of the deaths of these two are told: the martyrdom of the one is beaten out over chapters, the martyrdom of the other is crammed into a corner of a sentence. And yet, of the two men, the one who is the less noticed filled the larger place officially, and the other was only a simple deacon and preacher of the Word. The fact that Stephen was the first Christian to follow his Lord in martyrdom is not sufficient to account for the extraordinary difference. The difference is to be sought for in another direction altogether. The Bible cares so little about the people whom it names because its true theme is the works of God, and not of man; and the reason why the ‘Acts of the Apostles’ kills off one of the chief Apostles in this fashion is simply that, as the writer tells us, his theme is ‘all that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ continued ‘to do and to teach after He was taken up.’ Since it is Christ who is the true actor, it matters uncommonly little what becomes of James or of the other ten. This book is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the ‘Acts of the Apostles,’ but it is the Acts of Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I might suggest, too, in like manner, that there is another contrast which I have not included in my four, between the scale on which the death of Jesus Christ is told by Luke, and that on which this death is narrated. What is the reason why so disproportionate a space of the Gospel is concerned with the last two days of our Lord’s life on earth? What is the reason why years are leaped over in silence and moments are spread out in detail, but that the death of a man is only a death, but the death of the Christ is the life of the world? It is little needful that we should have poetical, emotional, picturesque descriptions of martyrdoms and the like in a book which is altogether devoted to tracking the footsteps of Christ in history; and which regards men as nothing more than the successive instruments of His purpose, and the depositories of His grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Another lesson which we may draw from the reticence in the case of the Apostle, and the expansiveness in the case of the protomartyr, is that of a wise indifference to the utterly insignificant accident of posthumous memory or oblivion of us and our deeds and sufferings. James sleeps none the less sweetly in his grave, or, rather, wakes none the less triumphantly in heaven, because his life and death are both so scantily narrated. If we ‘self-infold the large results’ of faithful service, we need not trouble ourselves about its record on earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But another lesson which may be learned from this cursory notice of the Apostle’s martyrdom is-how small a thing death really is! Looked at from beside the Lord of life and death, which is the point of view of the author of this narrative, ‘great death’ dwindles to a very little thing. We need to revise our notions if we would understand how trivial it really is. To us it frowns like a black cliff blocking the upper end of our valley, but there is a path round its base, and though the throat of the pass be narrow, it has room for us to get through and up to the sunny uplands beyond. From a mountain top the country below seems level plain, and what looked like an impassable precipice has dwindled to be indistinguishable. The triviality of death, to those who look upon it from the heights of eternity, is well represented by these brief words which tell of the first breach thereby in the circle of the Apostles.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. There is another contrast, James and Peter. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. There is another contrast, James and Peter.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now this chapter tells of two things: the death of one of that pair of friends; the miracle that was wrought for the deliverance of the other from death. Why could not the parts have been exchanged, or why could not the miraculous hand that was stretched out to save the one fisherman of Bethsaida have been put forth to save the other? Why should James be slain, and Peter miraculously delivered? A question easily asked; a question not to be answered by us. We may say that the one was more useful for the development of the Church than the other. But we have all seen lives that, to our poor vision, seemed to be all but indispensable, ruthlessly swept away, and lives that seemed to be, and were, perfectly profitless, prolonged to extreme old age. We may say that maturity of character, development of Christian graces, made the man ready for glory. But we have all seen some struck down when anything but ready; and others left for the blessing of mankind many, many a day after they were far fitter for heaven than thousands that, we hope, have gone there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So all these little explanations do not go down to the bottom of the matter, and we are obliged just to leave the whole question in the loving Hands that hold the keys of life and death for us all. Only we may be sure of this, that James was as dear to Christ as Peter was, and that there was no greater love shown in sending the angel that delivered the one out of the ‘hand of Herod and from all the expectation of the people of the Jews,’ than was shown in sending the angel that stood behind the headsman and directed the stroke of the fatal sword on the neck of the other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The one was as dear to the Christ as the other-ay, and the one was as surely, and more blessedly, delivered ‘from the mouth of the lion’ as the other was, though the one seemed to be dragged from his teeth, and the other seemed to be crushed by his powerful jaws. James escaped from Herod when Herod slew him but could not make him unfaithful to his Master, and his deliverance was not less complete than the deliverance of his friend.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But let us remember, also, that if thus, to two equally beloved, there were dealt out these two different fates, it must be because that evil, which, as I said, is not so great as it looks, is also not so bitter as it tastes, and there is no real evil, for the loving heart, in the stroke that breaks its bands and knits it to Jesus Christ. If we are Christians, the deepest desire of our souls is fuller communion with our Lord. We realise that, in some stunted and scanty measure, by life; but oh! is it not strange that we should shrink from that change which will enable us to realise it fully and eternally? The contrast of James and Peter may teach us the equal love that presides over the life of the living and the death of the dying.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Another contrast is that of James and John. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Another contrast is that of James and John.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The close union, and subsequent separation by this martyrdom, of that pair of brothers is striking and pathetic. They seem to have together pursued their humble trade of fishermen in the little fishing village of Bethsaida, apparently as working partners with their father Zebedee. They were not divided by discipleship, as was the sad fate of many a brother delivered by a brother to death. If we may attach any weight to the suggestion that the expression in John’s narrative, ‘He first findeth ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his own",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " brother, Simon,’ implies that ‘the other disciple’ did the same by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " brother, James was brought to Jesus by John, and new tenderness and strength thereby given to their affection. They were closely associated in their Apostleship, and were together the companions of Jesus in the chief incidents of His life. They were afterwards united in the leadership of the Church. By death they were separated very far: the one the first of all the Apostles to ‘become a prey to Satan’s rage,’ the other ‘lingering out his fellows all,’ and ‘dying in bloodless age,’ living to be a hundred years old or more, and looking back through all the long parting to the brother who had joined with him in the wish that even Messiah’s Kingdom should not part them, and yet had been parted so soon and parted so long.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah! may we not learn the lesson that we should recognise the mercy and wisdom of the ministry of Death the separator, and should tread with patience the lonely road, do calmly the day’s work, and tarry till He comes, though those that stood beside us be gone? We may look forward with the assurance that ‘God keeps a niche in heaven to hide our idols’; and ‘albeit He breaks them to our face,’ yet shall we find them again, like Memnon’s statue, vocal in the rising sunshine of the heavens.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The brothers, so closely knit, so soon parted, so long separated, were at last reunited. Even to us here, with the chronology of earth still ours, the few years between the early martyrdom of James and the death of the centenarian John seem but a span. The lapse of the centuries that have rolled away since then makes the difference of the dates of the two deaths seem very small, even to us. What a mere nothing it will have looked to them, joined together once more before God!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " IV. Lastly, James and James. In his hot youth, when he deserved the name of a son of thunder-so energetic, boisterous, I suppose, destructive perhaps, he was-he and his brother, and their foolish mother, whose name is kindly not told us, go to Christ and say, ‘Grant that we may sit, the one on Thy right hand and the other on Thy left, in Thy kingdom.’ That was what he wished and hoped for, and what he got was years of service, and a taste of persecution, and finally the swish of the headsman’s sword.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so our dreams get disappointed, and their disappointment is often the road to their fulfilment, for Jesus Christ was answering James’ prayer, ‘Grant that we may sit on Thy right hand in Thy kingdom,’ when He called him to Himself, by the brief and bloody passage of martyrdom. James said, when he did not know what he meant, and the vow was noble though it was ignorant, ‘we can drink of the cup that Thou drinkest.’ And all honour to him! he stuck to his vow; and when the cup was proffered to him he manfully, and like a Christian, took it and drank it to the dregs; and, I suppose, went silently to his grave. But the change between his ardent anticipations and his calm resignation, and between his foolish dream and the stern reality, may well teach us that, whether our wishes he fulfilled or disappointed, they all need to be purified, and that the disappointment of them on earth is often God’s way of fulfilling them for us in higher fashion than we dreamed or asked.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, brethren, let us leave for ourselves, and for all dear ones, that question of living or dying, to His decision. Only let us be sure that whether our lives be long like John’s, or short like James’, ‘living or dying we are the Lord’s.’ And then, whatever be the length of life or the manner of death, both will bring us the fulfilment of our highest wishes, and will lead us to His side at whose right hand all those shall sit who have loved Him here, and, though long parted, shall be reunited in common enjoyment of the pleasures for evermore which bloom unfading there. ‘And so shall we ever be with the Lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-5 James was one of the sons of Zebedee, whom Christ told that they should drink of the cup that he was to drink of, and be baptized with the baptism that he was to be baptized with, Mt 20:23. Now the words of Christ were made good in him; and if we suffer with Christ, we shall reign with him. Herod imprisoned Peter: the way of persecution, as of other sins, is downhill; when men are in it, they cannot easily stop. Those make themselves an easy prey to Satan, who make it their business to please men. Thus James finished his course. But Peter, being designed for further services, was safe; though he seemed now marked out for a speedy sacrifice. We that live in a cold, prayerless generation, can hardly form an idea of the earnestness of these holy men of old. But if the Lord should bring on the church an awful persecution like this of Herod, the faithful in Christ would learn what soul-felt prayer is.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he killed ... - He caused to be put to death with a sword, either by beheading, or piercing him through. The Roman procurators were entrusted with authority over life, though in the time of Pilate the Jews had not this authority.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "James, the brother of John - This was the son of Zebedee, Matthew 4:21. He is commonly called James the Greater, in contradistinction from James, the son of Alpheus, who is called James the Less, Matthew 10:3. In this manner were the predictions of our Saviour respecting him fulfilled, Matthew 20:23, \"Ye shall indeed drink of my cup, and be baptized with the baptism that I am baptized with.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "James, the brother of John - This was the son of Zebedee, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He is commonly called James the Greater, in contradistinction from James, the son of Alpheus, who is called James the Less, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this manner were the predictions of our Saviour respecting him fulfilled, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Ye shall indeed drink of my cup, and be baptized with the baptism that I am baptized with.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. killed James … with the sword—beheaded him; a most ignominious mode of punishment, according to the Jews. Blessed martyr! Thou hast indeed \"drunk of thy Lord's cup, and hast been baptized with his baptism.\" (See on [1997]Mr 10:38-40.) A grievous loss this would be to the Church; for though nothing is known of him beyond what we read in the Gospels, the place which he had as one of the three whom the Lord admitted to His closest intimacy would lead the Church to look up to him with a reverence and affection which even their enemies would come to hear of. They could spring only upon one more prized victim; and flushed with their first success, they prevail upon Herod to seize him also.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Who had especially the care of the church at Jerusalem: one eminent amongst the apostles, and one of the sons of thunder, (or Boanerges), for his zealous and earnest preaching, and therefore the more hated by Herod: so that which our Saviour had foretold him came now to pass, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 20:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that he drank of the cup our Savionr did drink of. There was another James, who wrote the Epistle known by his name, and was called James the Less; because, as some think, he was brought to the knowledge of Christ after the other, of whom we read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 15:40",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 15:40",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he killed James the brother of John with the sword. This was James, the son of Zebedee, whom our Lord told, that he should be baptized with the baptism he was baptized with, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " meaning the baptism of martyrdom; and he was the first martyr among the apostles: the death he was put to was one of the four capital punishments among the Jews, and was reckoned by them the most disgraceful of them all, and was inflicted upon deceivers of the people; and such an one James was thought to be (e). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Misn. Sanhedrin, c. 7. sect. 1, 3. & 11. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Misn. Sanhedrin, c. 7. sect. 1, 3. & 11. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he {b} killed James the brother of John with the sword.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " killed James the brother of John with the sword.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Violently, his cause not being heard at all.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνεῖλε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", characteristic word, see on v. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 5:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἰάκωβον τὸν ἀ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: St. Chrysostom reminds us of our Lord’s prophecy in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 10:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), distinguished thus from the James of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Possibly his prominent position, and his characteristic nature as a son of Thunder marked him out as an early victim.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μαχαίρᾳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": so in the case of John the Baptist. This mode of death was regarded as very disgraceful among the Jews (J. Lightfoot, Wetstein), and as in the Baptist’s case so here, the mode of execution shows that the punishment was not for blasphemy, but that James was apprehended and killed by the political power. For the touching account of his martyrdom narrated by Clement of Alexandria, see Eus., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "H. E.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ii., 9. Whatever St. Luke’s reason for the brevity of the account, whether he knew no more, or whether he intended to write a third book giving an account of the other Apostles besides Peter and Paul, and so only mentioned here what concerned the following history (so Meyer, but see Wendt, p. 267 (1888)), his brief notice is at least in striking contrast (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπλῶς καὶ ὡς ἔτυχεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Chrys.) with the details of later martyrologies.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he killed James the brother of John",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] One of the two sons of Zebedee, who had been among the three specially favoured disciples of Jesus. It is therefore likely that he would take a leading part in the labours of the Church, and so Agrippa’s attention would be drawn to him as a proper person to be first struck down. All the accusations which had been laid against Stephen, that the Christian leader spake against the Temple and the Law, would be used with effect to such a zealous observer of Mosaic ritual as Herod Agrippa was.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with the sword",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This was the third in order of the modes of execution appointed among the Jews. These are stoning, burning, decapitation, and strangulation. In connection with the execution of James the words of the Mishna are interesting: “The manner of putting to death by the sword is as follows: the man’s head is cut off with the sword as is wont to be done ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by royal command",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” See Surenhusius on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sanhedrin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " p. 238 (misprinted 248), where there is a discussion about the position of the prisoner, whether he should stand erect or have his head on a block.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἰάκωβον τὸν ἀδελφὸν Ἰωάννου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "James the brother of John",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The one of these two brothers left the world at the earliest time, the other at a time long subsequent. At the time that Luke wrote, John, who survived, was better known than James, who is designated from John.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "James",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the son of Zebedee, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "James the Elder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to whom, with his brother John, our Lord gave the surname of Boanerges (which is a corruption of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בְנֵי דֶגֶשׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), sons of thunder. Nothing is recorded of him in the Acts but his presence in the upper room at Jerusalem after the Ascension (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and this his martyrdom, which was the fulfillment of our Lord's prediction in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His being singled out by Herod for death in company with Peter is rather an indication of his zeal and activity in the Lord's service, though we know nothing of his work. Eusebius relates an anecdote of his martyrdom, extracted from the lost work of Clement of Alexandria, called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ὑποτυτώσεις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or in Latin ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Adumbrationes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which Clement professed to have received by tradition from his predecessors, to the effect that the informer who accused James was so struck with his constancy in confessing Christ before the judge, that he came forward and confessed himself a Christian too. The two were then led off to execution together; and on the way the informer asked James's forgiveness. After a moment's hesitation, James said to him, \"Peace be unto thee,\" and kissed him. They were then both beheaded ('Eccl. Hist.,' 2. 9.). As Clement flourished about A.D. , the tradition need not have passed through more than three persons. It has been thought strange that Luke relates the death of a chief apostle with such brevity. But it did not bear on the main object of his work. Lightfoot ('Works,' vol. 8. p. 282, etc.) mentions a fanciful story related by Rabauus Maurus, that about this time the apostles composed the Apostles' Creed, each contributing one clause, and that the clause contributed by James the brother of John was, \"And in Jesus Christ his only Son our Lord.\" Acts 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Killed - with the sword",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "While the martyrdom of Stephen is described at length, that of James, the first martyr among the apostles, is related in two words. ",
        "children": []
      }
    ]
  }
]