[[],[{"type":"header","content":"Six Cities of Refuge"},{"type":"prose","content":"The LORD spoke to Joshua, saying, "}],[{"type":"prose","content":"“Speak to the Israelites, saying, ‘Designate the cities of refuge (asylum), of which I spoke to you through Moses, "}],[{"type":"prose","content":"so that the person (manslayer) who kills any person unintentionally, without premeditation, may flee there, and they shall be your refuge from the blood avenger. "}],[{"type":"prose","content":"He shall flee to one of these cities, and shall stand at the entrance of the gate of the city and explain his case to the elders of that city; and they shall take him into [the protection of] the city and give him a place [to stay], so that he may live among them. "}],[{"type":"prose","content":"If the blood avenger pursues him, they shall not hand the offender (manslayer) over to him, because he killed his neighbor unintentionally  without premeditation and did not hate him beforehand. "}],[{"type":"prose","content":"He shall live in that city until he has stood before the congregation for judgment [and if acquitted of murder he must stay there], until the death of the one who is the high priest in those days. Then the offender (manslayer) shall return to his own city and his own house from which he fled.’”"}],[{"type":"prose","content":"So they set apart  consecrated Kedesh in Galilee in the hill country of Naphtali, and Shechem in the hill country of Ephraim, and Kiriath-arba that is, Hebron in the hill country of Judah. "}],[{"type":"prose","content":"Beyond the Jordan east of Jericho, they designated Bezer in the wilderness on the plain from the tribe of Reuben, and Ramoth in Gilead from the tribe of Gad, and Golan in Bashan from the tribe of Manasseh. "}],[{"type":"prose","content":"These were the appointed cities for all the Israelites and for the stranger sojourning (living temporarily) among them, so that whoever killed any person unintentionally may flee there, and not die by the hand of the blood avenger until he had stood before the congregation [for judgment]."}]]