[{"header":"Cities to Run to for Safety"},{"num":20,"verse":"Then the Lord spoke to Joshua. He said, "},{"num":2,"verse":"“Tell the Israelites to choose the cities to go to for safety, just as I directed you through Moses. "},{"num":3,"verse":"Anyone who kills a person by accident can run there for safety. So can anyone who kills a person without meaning to. The one charged with murder will be kept safe from the nearest male relative of the person killed. "},{"num":4,"verse":"Suppose those who are charged with murder run for safety to one of these cities. Then they must stand in the entrance of the city gate. They must state their case in front of the elders of that city. The elders must let them come into their city. The elders must provide a place for them to live in their city. "},{"num":5,"verse":"Suppose the nearest male relative of the person killed chases the one charged with murder. Then the elders must not hand them over to that relative. That’s because that person didn’t mean to kill their neighbor. They didn’t make evil plans to do it. "},{"num":6,"verse":"They must stay in that city until their case has been brought to the community court. They must stay there until the high priest serving at that time dies. Then they can go back to their own home. They can return to the town they ran away from.”"},{"num":7,"verse":"So the Israelites set apart Kedesh in Galilee. It’s in the hill country of Naphtali. They set apart Shechem. It’s in the hill country of Ephraim. They set apart Kiriath Arba. It’s in the hill country of Judah. Kiriath Arba is also called Hebron. "},{"num":8,"verse":"On the east side of the Jordan River near Jericho they chose Bezer. It’s in the desert on the high plains. It’s in the territory of the tribe of Reuben. They chose Ramoth in Gilead. It’s in the territory of the tribe of Gad. They chose Golan in the land of Bashan. It’s in the territory of the tribe of Manasseh. "},{"num":9,"verse":"Suppose you kill someone by accident. Or another Israelite does it. Or an outsider who lives among you does it. Then any of you can run for safety to one of these cities that have been chosen. There you won’t be killed by the nearest male relative of the person killed by accident. First your case must be brought to the community court."}]