[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When the morning arose.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Lot had thus the night for making his preparations, but part of this he spent in his visits to his sons-in-law.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Consumed.—Heb., swept away; and so in Genesis 19:17. See Genesis 18:23-24, where it is rendered “destroy.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Consumed.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Heb., ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "swept away; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and so in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:23-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is rendered “destroy.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Genesis",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE SWIFT DESTROYERGenesis 19:15 - Genesis 19:26",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE SWIFT DESTROYER",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The religious significance of this solemn page of revelation is but little affected by any of the interesting questions which criticism raises concerning it, so that I am free to look at the whole narrative for the purpose of deducing its perennial lessons. There are four clearly marked stages in the story: the lingering of Lot in the doomed city, and the friendly force which dragged him from it; the prayer of abject fear, and the wonderful answer; the awful catastrophe; and the fate of the wretched woman who looked back.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. Lot’s lingering and rescue by force. Second thoughts are not always best. When great resolves have to be made, and when a clear divine command has to be obeyed, the first thought is usually the nobler; and the second, which pulls it back, and damps its ardour, is usually of the earth, earthy. So was it with Lot. Overnight, in the excitement of the terrible scene enacted before his door, Lot had been not only resolved himself to flee, but his voice had urged his sons-in-law to escape from the doom which he then felt to be imminent. But with the cold grey light of morning his mood has changed. The ties which held him in Sodom reassert their power. Perhaps daylight made his fears seem less real. There was no sign in the chill Eastern twilight that this day was to be unlike the other days. Perhaps the angels’ summons roused him from sleep, and their ‘arise’ is literally meant. It might have given wings to his flight. Urgent, and resonant, like the morning bugle, it bids him be stirring lest he be swept away ‘in the punishment of the city.’ Observe that the same word means ‘sin’ and ‘punishment,’-a testimony to the profound truth that at bottom they are one, sin being pain in the root, pain being sin in the flower. So our own word ‘evil’ covers all the ground, and means both sin and sorrow. But even that pealing note does not shatter his hesitation. He still lingers. What kept him? That which had first taken him there-material advantages. He had struck root in Sodom. The tent life which he had kept to at first has been long given up; we find him sitting in the gate of the city, the place for gossip and friendly intercourse. He has either formed, or is going to form, marriage alliances for his daughters with men of the city who are as black as the rest. Perhaps his wife, whom the story will not name, for pity or for horror, was a Sodomite. To escape meant to leave all this and his wealth behind. If he goes out, he goes out a pauper. So his heart, which is where his treasure is, makes his movements slow. What insanity his lingering must have seemed to the angels! I wonder if we, who cling so desperately to the world, and who are so slow to go where God would have us to be for our own safety, if thereby we shall lose anything of this world’s wealth, seem very much wiser to eyes made clear-sighted with the wisdom of heaven. This poor hesitating lingerer, too much at home in the city of destruction to get out of it even to save his life, has plenty of brothers to-day. Every man who lets the world hold him by the skirts when Christ is calling him to salvation, and every man who is reluctant to obey any clear call to sacrifice and separation from godless men, may see his own face in this glass, and perhaps get a glimpse of its ugliness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What a homely picture, full of weighty truth, the story gives us, of the angels each taking two of the reluctant four by the hand, and dragging them with some degree of kindly force from destruction into safety! So, in a great fire, domestic animals and horses seem to find a strange fascination in the flames, and have to be carried out of certain death by main force. They ‘set him’-or we might read, ‘made him rest’-outside the city. It was but a little distance, for these ‘cities’ were tiny places, and the walls were soon reached. But it was far enough to change Lot’s whole feelings. He passes to feeble despair and abject fear, as we shall see. That forlorn group, homeless, friendless, stripped of everything, shivering outside the gate in the cold morning air, may teach us how wise and prudent the man is who seeks the kingdom of God second, and the other things first.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 2. There was a pause outside the city. A new voice speaks now to Lot. ‘They’ brought him forth; but ‘He’ said ‘escape.’ The same ‘Lord’ to whom Abraham had prayed, has now rejoined the mysterious pair whom He had sent to Sodom. And Lot’s entreaty is addressed to Him whom he calls ‘my Lord.’ He uses singular pronouns throughout, although the narrator says that he ‘said unto ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ There seems to be here the same idea as is embodied in the word ‘Elohim’; namely, that the divine powers are regarded as in some sense separable, and yet all inhering in a personal unity. At all events, we have here a distinct representation of an intercourse between God and man, in which thoughts are conveyed to the human spirit direct from the divine, and desires pass from the human to the divine. The manner of the intercourse we do not know, but the possibility of the fact can scarcely be denied by any believer in a God; and, however we may call this miraculous or abnormal, the essence of the event can be repeated in the experience of each of us. God still speaks to men, and men may still plead with God. Unless our religion is communion, it is nothing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The divine voice reiterates the angels’ urgent command in still more stringent words: ‘Escape for thy life.’ There is to be no more angel-leading, but Lot’s feet are to be made as hinds’ feet by the thought of the flaming death that is pursuing. His lingering looks are sternly forbidden, since they would delay his flight and divide his heart. The direction of his flight is for the first time pointed out. The fertile plain, which had lured him down from the safe hills, is prohibited. Only on the mountain-side, probably the eastern mountains, where the morning red was beginning to blush, is there safety.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Lot’s answer shows a complete change of feeling. He is too fully alarmed now. His fright is so desperate that it has killed faith and common sense. The natural conclusion from God’s mercy, which he acknowledges, would have been trust and obedience. ‘Therefore I can escape,’ not ‘but I cannot escape,’ would have been the logic of faith. The latter is the irrationality of fear. When a man who has been cleaving to this fleeting life of earthly good wakes up to believe his danger, he is ever apt to plunge into an abyss of terror, in which God’s commands seem impossible, and His will to save becomes dim. The world first lies to us by ‘You are quite safe where you are. Don’t be in a hurry to go.’ Then it lies, ‘You never can get away now.’ Reverse Lot’s whimpering fears, and we get the truth. Are not God’s directions how to escape, promises that we shall escape? Will He begin to build, and not be able to finish? Will the judgments of His hand overrun their commission, like a bloodhound which, in its master’s absence, may rend his friend? ‘We have all of us one human heart,’ and this swift leap from unreasoning carelessness to as unreasoning dread, this failure to draw the true conclusion from God’s past mercy, and this despairing recoil from the path pointed for us, and craving for easier ways, belongs to us. ‘A strange servant of God was this,’ say we. Yes, and we are often quite as strange. How many people awakened to see their danger are so absorbed by the sight that they cannot see the cross, or think they can never reach it!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " God answered the cry, whatever its fault, and that may well make us pause in our condemnation. He hears even a very imperfect petition, and can see the tiniest germ of faith buried under thick clods of doubt and fear. This stooping readiness to meet Lot’s weakness comes in wonderful contrast with the terrible revelation of judgment which follows. What a conception of God, which had room for this more than human patience with weakness, and also for the flashing, lurid glories of destructive retribution! Zoar is spared, not for the unworthy reason which Lot suggested-because its minuteness might buy impunity, as some noxious insect too small to be worth crushing-but in accordance with the principle which was illustrated in Abraham’s intercession, and even in Lot’s safety; namely, that the righteous are shields for others, as Paul had the lives of all that sailed with him given to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " God’s ‘cannot’ answers Lot’s ‘cannot.’ His power is limited by His own solemn purpose to save His faltering servant. The latter had feared that, before he could reach the mountain, ‘the evil’ would overtake him. God shows him that his safety was a condition precedent to its outburst. Lot barred the way. God could not ‘let slip the dogs of’ judgment, but held them in the leash until Lot was in Zoar. Very awful is the command to make haste, based on this impossibility, as if God were weary of delay, and more than ready to smite. However we may find anthropomorphism in these early narratives, let us not forget that, when the world has long been groaning under some giant evil, and the bitter seed is grown up into a waving forest of poison, there is something in the passionless righteousness of God which brooks no longer delay, but seeks to make ‘a short work’ on the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 3. So we are brought face to face with the grim story of the destruction. There is a world of tragic meaning in the simple note of time given. ‘The sun was risen upon the earth when Lot entered into Zoar.’ The low-lying cities of the plain would lie in shadow for some time before the sun topped the eastern hills. What a dawn! At that joyous hour, just when the sunshine struck down on the smiling plain, and lake and river gleamed like silver, and all things woke to new hopes and fresh life, then the sky darkened, and the earth sank, and horrible rain of fiery bitumen fell from the black pall, salt mud poured in streams, and over all hung a column of fat, oily smoke. It is not my province to discuss the physical cause of the destruction; but I may refer to the suggestions of Sir J. W. Dawson, in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Egypt and Syria",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Expositor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for May 1886, in which he shows that great beds of bituminous limestone extend below the Jordan valley and much of the Dead Sea, and that the escape of inflammable gag from these through the opening of a fissure along a great ‘line of fault,’ is capable of producing all the effects described. The ‘brimstone’ of the Authorised Version is probably rather some form of bituminous matter which would be carried into the air by such an escape of gas, and a thick saline mud would accompany the eruption, encrusting anything it reached. Subsidence would follow the ejection of quantities of such matter; and hence the word ‘overthrew,’ which seems inappropriate to a mere conflagration, would be explained.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But, however this may be, we have to recognise a supernatural element in the starting of the train of natural causes, as well as in the timing of the catastrophe, and a divine purpose of retribution, which turns the catastrophe, however effected, into a judgment.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So regarded, the event has a double meaning. In the first place, it is a revelation of an element in the divine character and of a feature in the divine government. To the men of that time, it might be a warning. To Abraham, and through him to his descendants, and through them to us, it preaches a truth very unwelcome to many in this day: that there is in God that which constrains Him to hate, fight against, and punish, evil. The temper of this generation turns away from such thoughts, and, in the name of the truth that ‘God is love,’ would fain obliterate the truth that He does and will punish. But if the punitive element be suppressed, and that in God which makes it necessary ignored or weakened, the result will be a God who has not force enough to love, but only weakly to indulge. If He does not hate and punish, He does not pardon. For the sake of the love of God, we must hold firm by the belief in the judgments of God. The God who destroyed Sodom is not merely the God of an earlier antiquated creed. ‘Is He the God of the Jews only? Is He not also of the Gentiles? Yea, of the Gentiles also.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Again, this event is a prophecy. So our Lord has employed it; and much of the imagery in which the last judgment is represented is directly drawn from this narrative. So far from this story showing to us only the superstitions of a form of belief which we have long outgrown, its deepest meaning lies far ahead, and closes the history of man on the earth. We know from the lips which cannot lie, that the appalling suddenness of that destruction foreshadows the swiftness of the coming of that last ‘day of the Lord.’ We know that in literality some of the physical features shall be reproduced; for the fire which shall burn up the world and all its works is no figure, nor is it proclaimed only by such non-authoritative voices as those of Jesus and His apostles, but also by the modern possessors of infallible certitude, the men of science. We know that that day shall be a day of retribution. We know, too, that the crime of Sodom, foul and unnatural as it was, is not the darkest, but that its inhabitants {who have to face that judgment too} will find their doom more tolerable, and their sins lighter, than some who have had high places in the Church, than the Pharisees and wise men who have not taken Christ for their Saviour.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 4. The fate of the loiterer. Her backward look must have been more than momentary, for the destruction of the cities did not begin till Lot was safe in Zoar. She must have lingered far behind, and been overtaken by the eruption of liquid saline mud, which, as Sir J. W. Dawson has shown, would attend or follow the outburst of bituminous matter, so that her fate was the natural consequence of her heart being still in Sodom. As to the ‘pillar of salt’ which has excited cavils on the one hand and foolish legends on the other, probably we are to think rather of a heap than of a pillar. The word does not occur in either meaning elsewhere, but its derivation implies something raised above the level of the ground; and a heap, such as would be formed by a human body encrusted with salt mud, would suit the requirements of the expression. Like a man who falls in a snowstorm, or, still more accurately, just as some of the victims at Pompeii stumbled in their flight, and were buried under the ashes, which still keep the outline of their figures, so Lot’s wife was covered with the half-liquid slimy mud. Granted the delay in her flight, the rest is perfectly simple and natural. She was buried in a horrible tomb; and, in pity to her memory, no name has been written upon it. She remains to all generations, in a far truer sense than superstition dreamed of when it pointed to an upright salt rock as her prison and her monument, a warning of the danger of the backward look, which betrays the true home of the heart, and may leave us unsheltered in the open plain when the fiery storm bursts. ‘Remember Lot’s wife.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " When the angels awoke Lot, the day was breaking. By the time that Abraham had risen ‘early in the morning,’ and reached the place by his tent from which he had yesterday looked on the smiling plain, all was over, and the heavy smoke cloud wrapped the dead with its pall-like folds. So swift and sudden is to be the coming of the Son of man,-as the lightning which rushes in one fierce blinding flash from one side of heaven to the other. Wherefore, God calls to each of us: ‘Escape for thy life; look not behind thee.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-29 Lot was good, but there was not one more of the same character in the city. All the people of Sodom were very wicked and vile. Care was therefore taken for saving Lot and his family. Lot lingered; he trifled. Thus many who are under convictions about their spiritual state, and the necessity of a change, defer that needful work. The salvation of the most righteous men is of God's mercy, not by their own merit. We are saved by grace. God's power also must be acknowledged in bringing souls out of a sinful state If God had not been merciful to us, our lingering had been our ruin. Lot must flee for his life. He must not hanker after Sodom. Such commands as these are given to those who, through grace, are delivered out of a sinful state and condition. Return not to sin and Satan. Rest not in self and the world. Reach toward Christ and heaven, for that is escaping to the mountain, short of which we must not stop. Concerning this destruction, observe that it is a revelation of the wrath of God against sin and sinners of all ages. Let us learn from hence the evil of sin, and its hurtful nature; it leads to ruin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The visitors now take steps for the deliverance of Lot and his kindred before the destruction of the cities. All that are related to him are included in the offer of deliverance. There is a blessing in being connected with the righteous, if men will but avail themselves of it. Lot seems bewildered by the contemptuous refusal of his connections to leave the place. His early choice and his growing habits have attached him to the place, notwithstanding its temptations. His married daughters, or at least the intended husbands of the two who were at home (\"who are here\"), are to be left behind. But though these thoughts make him linger, the mercy of the Lord prevails. The angels use a little violence to hasten their escape. The mountain was preserved by its elevation from the flood of rain, sulphur, and fire which descended on the low ground on which the cities were built. Lot begs for a small town to which he may retreat, as he shrinks from the perils of a mountain dwelling, and his request is mercifully granted.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15-17. The kindly interest the angels took in the preservation of Lot is beautifully displayed. But he \"lingered.\" Was it from sorrow at the prospect of losing all his property, the acquisition of many years? Or was it that his benevolent heart was paralyzed by thoughts of the awful crisis? This is the charitable way of accounting for a delay that would have been fatal but for the friendly urgency of the angel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which are here; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which are found; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. which are present with thee, as this word is used, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Chronicles 29:17 2 Chronicles 5:11 30:21 31:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 29:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 30:21 31:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Whence some gather that he had two other daughters married to two Sodomitish men, who by their husbands’ persuasion and example staid and perished in those flames. But this is not necessary; for this phrase may be applied to the daughters by way of distinction from their spouses or husbands: q.d. Tarry no longer in expectation of thy sons-in-law, who are absent, and must be given up for lost, but take thy daughters which are found and present with thee, and go thy way. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when the morning arose,.... When it was break of day, for as yet the sun was not risen, nor did it rise until Lot got to Zoar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He was now returned from his sons-in-law, and by this time it began to be light: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then the angels hastened Lot; urged him to get out of his house as fast as he could: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, arise, take thy wife, and thy two daughters, which are here; from whence Aben Ezra, and others, have concluded, as has been observed, that he had other daughters elsewhere, which they suppose were married to men of Sodom; but the phrase, \"which are here\", or \"are found\", or \"are present\" (t), relates to his wife, as well as his daughters, and only signifies, that he should take all his relations that were present; and these may be only opposed to and distinguished from his sons-in-law that were absent, and refused to hearken to his advice and exhortations. Onkelos paraphrases the words, \"who are found faithful with thee\"; who believed what the angels said concerning the destruction of Sodom, as well as he, as did his wife and two daughters: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lest thou be consumed in the iniquity of the city; in the punishment inflicted on the city for their iniquity. See Revelation 18:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lest thou be consumed in the iniquity of the city; in the punishment inflicted on the city for their iniquity. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) \"quae inveniuntur\", Pagninus, Montanus; \"quae adsunt\", Junius & Tremellius, Piscator; \"quae praesentes\", Fagius, Munster, Cocceius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) \"quae inveniuntur\", Pagninus, Montanus; \"quae adsunt\", Junius & Tremellius, Piscator; \"quae praesentes\", Fagius, Munster, Cocceius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when the morning arose, then the angels hastened Lot, saying, Arise, take thy wife, and thy two daughters, which are here; lest thou be consumed in the iniquity of the city.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when the morning arose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] At day-break. The doom was to be inflicted before sun-rise (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 19:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). If Lot was still in the city, he too would perish: hence the men’s haste.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "consumed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "iniquity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, as R.V. marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "punishment",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See note, on the ambiguous meaning of the Hebrew word, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 15, 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And when the morning arose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as soon as the dawn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "שָׁחַר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to break forth as the light) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "went up",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ", i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on the first appearance of the morning twilight - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "then the angels hastened Lot, saying, Arise, take thy wife, and thy two daughters, which are here",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "which are found",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not implying the existence of other daughters (Knobel), but contrasting with the sons in law (Keil, Kalisch) lest thou be consumed in the iniquity (or punishment, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the city. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And while he lingered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - Lot's irresolution would have been his ruin but for his attendant. His heart manifestly clung to the earthly possessions he was leaving. The angels made no mention of his attempting to save a portion of his great wealth - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the men laid hold upon his hand, and upon the hand of his wife, and upon the hand of his two daughters; the Lord being merciful to him:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in the mercy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or gentleness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of Jehovah to him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the primary idea of the verb from which the noun is derived being that of softness (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and they brought him forth, and set him without the city.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 19:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As soon as it was dawn, the angels urged Lot to hasten away with his family; and when he still delayed, his heart evidently clinging to the earthly home and possessions which he was obliged to leave, they laid hold of him, with his wife and his two daughters, עליו יהוה בּחמלת, \"by virtue of the sparing mercy of Jehovah (which operated) upon him,\" and_ led him out of the city. ",
        "children": []
      }
    ]
  }
]