[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The sun was risen.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As Lot started at dawn, he had thus had about an hour for his flight.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-29 Lot was good, but there was not one more of the same character in the city. All the people of Sodom were very wicked and vile. Care was therefore taken for saving Lot and his family. Lot lingered; he trifled. Thus many who are under convictions about their spiritual state, and the necessity of a change, defer that needful work. The salvation of the most righteous men is of God's mercy, not by their own merit. We are saved by grace. God's power also must be acknowledged in bringing souls out of a sinful state If God had not been merciful to us, our lingering had been our ruin. Lot must flee for his life. He must not hanker after Sodom. Such commands as these are given to those who, through grace, are delivered out of a sinful state and condition. Return not to sin and Satan. Rest not in self and the world. Reach toward Christ and heaven, for that is escaping to the mountain, short of which we must not stop. Concerning this destruction, observe that it is a revelation of the wrath of God against sin and sinners of all ages. Let us learn from hence the evil of sin, and its hurtful nature; it leads to ruin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The visitors now take steps for the deliverance of Lot and his kindred before the destruction of the cities. All that are related to him are included in the offer of deliverance. There is a blessing in being connected with the righteous, if men will but avail themselves of it. Lot seems bewildered by the contemptuous refusal of his connections to leave the place. His early choice and his growing habits have attached him to the place, notwithstanding its temptations. His married daughters, or at least the intended husbands of the two who were at home (\"who are here\"), are to be left behind. But though these thoughts make him linger, the mercy of the Lord prevails. The angels use a little violence to hasten their escape. The mountain was preserved by its elevation from the flood of rain, sulphur, and fire which descended on the low ground on which the cities were built. Lot begs for a small town to which he may retreat, as he shrinks from the perils of a mountain dwelling, and his request is mercifully granted.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22. Haste … for I cannot do any thing till thou be come thither—The ruin of Sodom was suspended till he was secure. What care God does take of His people (Re 7:3)! What a proof of the love which God bore to a good though weak man!",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This phrase may note, either the time of the day when this was done; or rather the nature and quality of the day, that the sun appeared and shone forth that morning in great lustre and glory; which is well noted as a very considerable circumstance of the history, and a great aggravation of the ruin, which came when they least expected it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the sun was risen upon the earth when Lot entered into Zoar. Which is observed partly to point at the time of his entrance into the city, and of the burning of Sodom, which began at the same time; and partly to show what a fine morning it was, and what little appearance there was of such a tempest rising as quickly did; so that the inhabitants of Sodom, who were up so early, little thought of so sudden a catastrophe, and those that were in their beds were at once surprised with it: it was a morning of light and joy to Lot, who was so wonderfully delivered, but a dreadful one to the men of Sodom and the rest of the cities of the plain, with whom the scene was soon altered; likewise from hence it appeared, that the following tempest was extraordinary, and did not proceed from natural causes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The sun was risen upon the earth when Lot entered into Zoar.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The sun was risen upon the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the sun went forth, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it was now above the horizon. Lot had left Sodom with the first streak of dawn; but, having lingered, it was clear morning - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "when Lot entered into Zoar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - or \"went towards Zoar,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when the angel left him (Keil). Genesis 19:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"When the sun had risen and Lot had come towards Zoar (i.e., was on the way thither, but had not yet arrived), Jehovah caused it to rain brimstone and fire from Jehovah out of heaven, and overthrew those cities, and the whole plain, and all the inhabitants of the cities, and the produce of the earth.\" In the words \"Jehovah caused it to rain from Jehovah\" there is no distinction implied between the hidden and the manifested God, between the Jehovah present upon earth in His angels who called down the judgment, and the Jehovah enthroned in heaven who sent it down; but the expression \"from Jehovah\" is emphatica repetitio, quod non usitato naturae ordine tunc Deus pluerit, sed tanquam exerta manu palam fulminaverit praeter solitum morem: ut satis constaret nullis causis naturalibus conflatam fuisse pluviam illam ex igne et sulphure (Calvin). The rain of fire and brimstone was not a mere storm with lightning, which set on fire the soil already overcharged with naphtha and sulphur. The two passages, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cannot be adduced as proofs that lightning is ever called fire and brimstone in the Scriptures, for in both passages there is an allusion to the event recorded here. The words are to be understood quite literally, as meaning that brimstone and fire, i.e., burning brimstone, fell from the sky, even though the examples of burning bituminous matter falling upon the earth which are given in Oedmann's vermischte Sammlungen (iii. 120) may be called in question by historical criticism. By this rain of fire and brimstone not only were the cities and their inhabitants consumed, but even the soil, which abounded in asphalt, was set on fire, so that the entire valley was burned out and sank, or was overthrown (הפך) i.e., utterly destroyed, and the Dead Sea took its place.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Whether the Dead Sea originated in this catastrophe, or whether there was previously a lake, possibly a fresh water lake, at the north of the valley of Siddim, which was enlarged to the dimensions of the existing sea by the destruction of the valley with its cities, and received its present character at the same time, is a question which has been raised, since Capt. Lynch has discovered by actual measurement the remarkable fact, that the bottom of the lake consists of two totally different levels, which are separated by a peninsula that stretches to a very great distance into the lake from the eastern shore; so that whilst the lake to the north of this peninsula is, on an average, from 1000 to 1200 feet deep, the southern portion is at the most 16 feet deep, and generally much less, the bottom being covered with salt mud, and heated by hot springs from below.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In addition to Sodom, which was probably the chief city of the valley of Siddim, Gomorrah and the whole valley (i.e., the valley of Siddim, Genesis 14:3) are mentioned; and along with these the cities of Admah and Zeboim, which were situated in the valley (Deuteronomy 29:23, cf. Hosea 11:8), also perished, Zoar alone, which is at the south-eastern end of the valley, being spared for Lot's sake. Even to the present day the Dead Sea, with the sulphureous vapour which hangs about it, the great blocks of saltpetre and sulphur which lie on every hand, and the utter absence of the slightest trace of animal and vegetable life in its waters, are a striking testimony to this catastrophe, which is held up in both the Old and New Testaments as a fearfully solemn judgment of God for the warning of self-secure and presumptuous sinners. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In addition to Sodom, which was probably the chief city of the valley of Siddim, Gomorrah and the whole valley (i.e., the valley of Siddim, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") are mentioned; and along with these the cities of Admah and Zeboim, which were situated in the valley (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 29:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), also perished, Zoar alone, which is at the south-eastern end of the valley, being spared for Lot's sake. Even to the present day the Dead Sea, with the sulphureous vapour which hangs about it, the great blocks of saltpetre and sulphur which lie on every hand, and the utter absence of the slightest trace of animal and vegetable life in its waters, are a striking testimony to this catastrophe, which is held up in both the Old and New Testaments as a fearfully solemn judgment of God for the warning of self-secure and presumptuous sinners. ",
            "children": []
          }
        ]
      }
    ]
  }
]