[[],[{"type":"header","content":"To the Church in Sardis"},{"type":"prose","content":"“To the angel of the church in Sardis write the following:“This is the solemn pronouncement of the one who holds the seven spirits of God and the seven stars: ‘I know your deeds, that you have a reputation that you are alive, but in reality you are dead. "}],[{"type":"prose","content":"Wake up then, and strengthen what remains that was about to die, because I have not found your deeds complete in the sight of my God. "}],[{"type":"prose","content":"Therefore, remember what you received and heard, and obey it, and repent. If you do not wake up, I will come like a thief, and you will never know at what hour I will come against you. "}],[{"type":"prose","content":"But you have a few individuals in Sardis who have not stained their clothes, and they will walk with me dressed in white, because they are worthy. "}],[{"type":"prose","content":"The one who conquers will be dressed like them in white clothing, and I will never erase his name from the book of life, but will declare his name before my Father and before his angels. "}],[{"type":"prose","content":"The one who has an ear had better hear what the Spirit says to the churches.’"},{"type":"header","content":"To the Church in Philadelphia"}],[{"type":"prose","content":"“To the angel of the church in Philadelphia write the following:“This is the solemn pronouncement of the Holy One, the True One, who holds the key of David, who opens doors no one can shut, and shuts doors no one can open: "}],[{"type":"prose","content":"‘I know your deeds. (Look! I have put in front of you an open door that no one can shut.) I know that you have little strength, but you have obeyed my word and have not denied my name. "}],[{"type":"prose","content":"Listen! I am going to make those people from the synagogue of Satan—who say they are Jews yet are not, but are lying—Look, I will make them come and bow down at your feet and acknowledge that I have loved you. "}],[{"type":"prose","content":"Because you have kept my admonition to endure steadfastly, I will also keep you from the hour of testing that is about to come on the whole world to test those who live on the earth. "}],[{"type":"prose","content":"I am coming soon. Hold on to what you have so that no one can take away your crown. "}],[{"type":"prose","content":"The one who conquers I will make a pillar in the temple of my God, and he will never depart from it. I will write on him the name of my God and the name of the city of my God (the new Jerusalem that comes down out of heaven from my God), and my new name as well. "}],[{"type":"prose","content":"The one who has an ear had better hear what the Spirit says to the churches.’"},{"type":"header","content":"To the Church in Laodicea"}],[{"type":"prose","content":"“To the angel of the church in Laodicea write the following:“This is the solemn pronouncement of the Amen, the faithful and true witness, the originator of God’s creation: "}],[{"type":"prose","content":"‘I know your deeds, that you are neither cold nor hot. I wish you were either cold or hot! "}],[{"type":"prose","content":"So because you are lukewarm, and neither hot nor cold, I am going to vomit you out of my mouth! "}],[{"type":"prose","content":"Because you say, “I am rich and have acquired great wealth, and need nothing,” but do not realize that you are wretched, pitiful, poor, blind, and naked, "}],[{"type":"prose","content":"take my advice and buy gold from me refined by fire so you can become rich! Buy from me white clothing so you can be clothed and your shameful nakedness will not be exposed, and buy eye salve to put on your eyes so you can see! "}],[{"type":"prose","content":"All those I love, I rebuke and discipline. So be earnest and repent! "}],[{"type":"prose","content":"Listen! I am standing at the door and knocking! If anyone hears my voice and opens the door I will come into his home and share a meal with him, and he with me. "}],[{"type":"prose","content":"I will grant the one who conquers permission to sit with me on my throne, just as I too conquered and sat down with my Father on his throne. "}],[{"type":"prose","content":"The one who has an ear had better hear what the Spirit says to the churches.’”"}]]