[{"header":"Chapter 4"},{"num":1,"verse":"The Sabbath Rest of God’s People. Therefore, since the promise of entering into his rest endures, we must take care that none of you be judged to have fallen short."},{"num":2,"verse":"For we too have received the good news just as they did, but the message they heard was of no benefit to them because those who listened did not combine it with faith."},{"num":3,"verse":"For we who have faith enter into that rest, just as God has said:"},{"num":6,"verse":"Seeing, therefore, that some will enter into that rest, and since those who first had received the good news failed to enter because of their refusal to believe,"},{"num":7,"verse":"God once more set a day—“today”—when long afterward he spoke through David, as already quoted:"},{"num":8,"verse":"Now if Joshua had given them rest, God would not have spoken afterward of another day."},{"num":9,"verse":"Therefore, a Sabbath rest still remains for the people of God,"},{"num":10,"verse":"since those who enter into God’s rest also cease from their own labors as God did from his."},{"num":11,"verse":"Let us then make every effort to enter into that rest, so that no one may fall by following that example of refusing to believe."},{"num":12,"verse":"The Word of God Is Living. Indeed, the word of God is living and active. Sharper than any two-edged sword, it pierces to the point where it divides soul and spirit, joints and marrow; it judges the thoughts and the intentions of the heart."},{"num":13,"verse":"Nothing in creation is hidden from his sight. Everything is uncovered and exposed to the eyes of the one to whom we must all render an account."},{"num":14,"verse":"A Compassionate High Priest. Therefore, since we have a great high priest who has passed through the heavens, Jesus, the Son of God, let us hold fast to our profession of faith."},{"num":15,"verse":"For we do not have a high priest who is unable to sympathize with our weaknesses, but one who has been tested in every respect as we are, but without sinning."},{"num":16,"verse":"Let us then approach the throne of grace with confidence so that we may receive mercy and find grace when we are in need of help."}]