[{"header":"We Will Enter God’s Place of Rest"},{"num":4,"verse":"God’s promise that we may enter his place of rest still stands. We are afraid that some of you think you won’t enter his place of rest. "},{"num":2,"verse":"We have heard the same Good News that your ancestors heard. But the message didn’t help those who heard it in the past because they didn’t believe."},{"num":3,"verse":"We who believe are entering that place of rest. As God said, “So I angrily took a solemn oath that they would never enter my place of rest.” God said this even though he had finished his work when he created the world. "},{"num":4,"verse":"Somewhere in Scripture God has said this about the seventh day: “On the seventh day God rested from all his work.”"},{"num":5,"verse":"God also said in the same passage, “They will never enter my place of rest.” "},{"num":6,"verse":"However, some people enter that place of rest. Those who heard the Good News in the past did not enter God’s place of rest because they did not obey God. "},{"num":7,"verse":"So God set another day. That day is today. Many years after your ancestors failed to enter that place of rest God spoke about it through David in the passage already quoted: “If you hear God speak today, don’t be stubborn.” "},{"num":8,"verse":"If Joshua had given the people rest, God would not have spoken about another day. "},{"num":9,"verse":"Therefore, a time of rest and worship exists for God’s people. "},{"num":10,"verse":"Those who entered his place of rest also rested from their work as God did from his."},{"num":11,"verse":"So we must make every effort to enter that place of rest. Then no one will be lost by following the example of those who refused to obey."},{"num":12,"verse":"God’s word is living and active. It is sharper than any two-edged sword and cuts as deep as the place where soul and spirit meet, the place where joints and marrow meet. God’s word judges a person’s thoughts and intentions. "},{"num":13,"verse":"No creature can hide from God. Everything is uncovered and exposed for him to see. We must answer to him."},{"header":"Christ Is Superior to Other Chief Priests"},{"num":14,"verse":"We need to hold on to our declaration of faith: We have a superior chief priest who has gone through the heavens. That person is Yeshua, the Son of God. "},{"num":15,"verse":"We have a chief priest who is able to sympathize with our weaknesses. He was tempted in every way that we are, but he didn’t sin. "},{"num":16,"verse":"So we can go confidently to the throne of God’s kindness to receive mercy and find kindness, which will help us at the right time."}]