[{"num":6,"verse":"But Iyov answered and said,"},{"num":2,"verse":"Oh that my ka’as (vexation) were throughly weighed, and my calamity laid in the scales together!"},{"num":3,"verse":"For now it would be heavier than the chol of the seas; therefore my words are impetuous."},{"num":4,"verse":"For the khitzim (arrows) of Shaddai are in me, the poison whereof drinketh my ruach; the terrors of Eloah do set themselves in array against me."},{"num":5,"verse":"Doth the pereh (wild donkey) bray when he hath desheh? Or loweth the ox over his fodder?"},{"num":6,"verse":"Can that which is tasteless be eaten without melach? Or is there any taste in the white of an egg?"},{"num":7,"verse":"The things that my nefesh refused to touch are like my loathsome lechem."},{"num":8,"verse":"Who will grant that I might have my she’elah (request); oh that Eloah would grant me my tikveh!"},{"num":9,"verse":"Even that it would please Eloah to crush me; that He would let loose His yad, and cut me off!"},{"num":10,"verse":"Then should I yet have nechamah (consolation); yea, I would exult in chilah (pain); let him not spare; for I have not concealed the imrei Kadosh (words of the Holy One)."},{"num":11,"verse":"What is my koach, that I should wait? And what is mine end, that I should make patient my nefesh?"},{"num":12,"verse":"Is my koach the koach of avanim? Or is my basar bronze?"},{"num":13,"verse":"Is it that my help is not within me? And is tushiyyah (success) driven from me?"},{"num":14,"verse":"To him that is afflicted, chesed should be shown from his friend; otherwise, he forsaketh the fear of Shaddai."},{"num":15,"verse":"Achai (my brethren) have dealt deceitfully as a wadi, and as the torrents of wadis they vanish away;"},{"num":16,"verse":"Which are blackish muddy by reason of the kerakh (ice), and wherein the sheleg (snow) is melted."},{"num":17,"verse":"What season they become warm, they vanish; when it is hot, they disappear from their makom."},{"num":18,"verse":"The paths of their derech wind about; they go up to tohu [Gn 1:2], and perish."},{"num":19,"verse":"The caravans of Tema looked for them; the halichot (traveling companies) of Sheva hoped for them."},{"num":20,"verse":"They were disappointed because of their bitachon; they come there and are confounded."},{"num":21,"verse":"For now ye are become such; ye see my chatat (casting down), and are afraid."},{"num":22,"verse":"Did I say, Bring unto me? Or, Give a present for me of your ko’ach (power, wealth)?"},{"num":23,"verse":"Or, Deliver me from the yad tzar (hand of the enemy, oppressor)? Or, Redeem me with a ransom from the yad of the tyrants?"},{"num":24,"verse":"Teach me, and I will hold my tongue, and cause me to have binah wherein I have erred."},{"num":25,"verse":"How forcible are the imrei yosher (words of rectitude)! But what doth your hokhiach (reproof) reprove?"},{"num":26,"verse":"Do ye think to reprove words? The words of one in despair, which are as ruach?"},{"num":27,"verse":"Yea, ye cast lots for the yatom, and over your friend ye barter."},{"num":28,"verse":"Now therefore be pleased to look upon me; for it is evident unto you if in me there is kazav (falsity)."},{"num":29,"verse":"Turn, now, let there be no iniquity; yea, turn again; at issue is my tzedek (righteousness)."},{"num":30,"verse":"Is there iniquity on my leshon? Cannot my palate discern havvot (perverse things)?"}]