[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They glorified God in me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This verse represents the proper attitude of Christian hero-worship. An eminent Christian is like a “city set on a hill.” But the admiration which he attracts does not rest in him; it is made the occasion for giving praise to God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:15-24 St. Paul was wonderfully brought to the knowledge and faith of Christ. All who are savingly converted, are called by the grace of God; their conversion is wrought by his power and grace working in them. It will but little avail us to have Christ revealed to us, if he is not also revealed in us. He instantly prepared to obey, without hesitating as to his worldly interest, credit, ease, or life itself. And what matter of thanksgiving and joy is it to the churches of Christ, when they hear of such instances to the praise of the glory of his grace, whether they have ever seen them or not! They glorify God for his power and mercy in saving such persons, and for all the service to his people and cause that is done, and may be further expected from them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they glorified God in me - They praised God on my account. They regarded me as a true convert and a sincere Christian; and they praised God that he had converted such a persecutor, and had made him a preacher of the gospel. The design for which this is mentioned is, to show that though he was personally unknown to them, and had not derived his views of the gospel from them, yet that he had their entire confidence. They regarded him as a convert and an apostle, and they were disposed to praise God for his conversion. This fact would do much to conciliate the favor of the Galatians, by showing them that he had the confidence of the churches in the very land where the gospel was first planted, and which was regarded as the source of ecclesiastical authority. In view of this we may remark:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That it is the duty of Christians kindly and affectionately to receive among their number those who have been converted from a career of persecution or of sin in any form. And it is always done by true Christians. It is easy to forgive a man who has been actively engaged in persecuting the church, or a man who has been profane, intemperate, dishonest, or licentious, if he becomes a true penitent, and confesses and forsakes his sins. No matter what his life has been; no matter how abandoned, sensual, or devilish; if he manifests true sorrow and gives evidence of a change of heart, he is cordially received into any church, and welcomed as a fellow-laborer in the cause which he once destroyed. Here, at least, is one place where forgiveness is cordial and perfect. His former life is not remembered, except to praise God for His grace in recovering a sinner from such a course. The evils that he has done are forgotten, and he is henceforward regarded as entitled to all the privileges and immunities of a member of the household of faith. There is not on earth an infuriated persecutor or blasphemer who would not be cordially welcomed to any Christian church upon the evidence of his repentance; not a person so debased and vile that the most pure, and elevated, and learned, and wealthy Christians would not rejoice to sit down with him at the same communion table upon the evidence of his conversion to God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) we should \"glorify\" or praise God for all such instances of conversion. We should do it because:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Of the abstraction of the talents of the persecutor from the cause of evil. Paul could have done, and would have done immense service to the enemies of Christianity if he had pursued the career which he had commenced. But when he was converted, all that bad influence ceased. So when an infidel or a profligate man is converted now:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Because now his talents will be consecrated to a better service, they will be employed in the cause of truth and salvation. All the power of the matured and educated talent will now be devoted to the interests of religion; and it is a fact for which we should thank God, that he often takes educated talent, and commanding influence, and an established reputation for ability, learning, and zeal, and devotes it to his own service.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Because there will be a change of destiny; because the enemy of the Redeemer will now be saved. The moment when Saul of Tarsus was converted, was the moment which determined a change in his eternal destiny. Before, he was on the broad way to hell; henceforward, he walked in the path of life and salvation. Thus, we should always rejoice over a sinner returning from the error of his ways; and should praise God that he who was in danger of eternal ruin is now an heir of glory. Christians are not jealous in regard to the numbers who shall enter heaven. They feel that there is \"room\" for all; that the feast is ample for all; and they rejoice when any can be induced to come with them and partake of the happiness of heaven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) we may still glorify and praise God for the grace manifested in the conversion of Saul of Tarsus. What does not the world owe to him! What do we not owe to him! No man did as much in establishing the Christian religion as he did; no one among the apostles was the means of converting and saving so many souls; no one has left so many and so valuable writings for the edification of the church. To him we owe the invaluable epistles - so full of truth, and eloquence, and promises, and consolations - upon which we are commenting; and to him the church owes, under God, some of its most elevated and ennobling views or the nature of Christian doctrine and duty. After the lapse, therefore, of more than 1,800 years, we should not cease to glorify God for the conversion of this wonderful man, and should feel that we have cause of thankfulness that he changed the infuriated persecutor to a holy and devoted apostle.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) let us remember that God has the same power now. There is not a persecutor whom he could not convert with the same ease with which he changed Saul of Tarsus. There is not a vile and sensual man that he could not make pure; not a dishonest man that his grace could not make honest: not a blasphemer that he could not teach to venerate his name; not a lost and abandoned sinner that he cannot receive to himself. Let us then without ceasing cry unto him that his grace may be continually manifested in reclaiming such sinners from the error of their ways, and bringing them to the knowledge of the truth, and to a consecration of their lives to his service. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) let us remember that God has the same power now. There is not a persecutor whom he could not convert with the same ease with which he changed Saul of Tarsus. There is not a vile and sensual man that he could not make pure; not a dishonest man that his grace could not make honest: not a blasphemer that he could not teach to venerate his name; not a lost and abandoned sinner that he cannot receive to himself. Let us then without ceasing cry unto him that his grace may be continually manifested in reclaiming such sinners from the error of their ways, and bringing them to the knowledge of the truth, and to a consecration of their lives to his service. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24. in me—\"in my case.\" \"Having understood the entire change, and that the former wolf is now acting the shepherd's part, they received occasion for joyful thanksgiving to God in respect to me\" [Theodoret]. How different, he implies to the Galatians, their spirit from yours!   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " And they praised God on his behalf, for working so great a change in him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they glorified God in me. Or \"for me\"; on his account; for the wonderful grace bestowed on him and wrought in him; for the surprising change that was made in him, that of a persecutor he should become a preacher, which they ascribed, as he himself did, to the abundant grace of God; they were greatly thankful and blessed God, who had given him such large gifts, and made him so greatly useful in the cause, and among the churches of Christ. And by observing this, how much the churches in Judea were affected with the grace of God vouchsafed to him, though they had never seen him nor heard him, he tacitly strikes at and rebukes the false teachers, and the Galatians that adhered to them, for their different treatment of him; to whom he was not only known by face, but had preach among them so fully, clearly, and powerfully, the Gospel of the grace of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they glorified God in me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They glorified God in Saul, ascribing the change entirely to the grace of God working on his heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The conduct of the Judæan Christians is noteworthy, not only as in marked contrast with that of the Judaizing party in Galatia, but as testifying to the soundness of the Apostle’s teaching. The Gospel which he preached, though independent of them as to its source, was identical with that which they had themselves welcomed. And they ascribed the glory to God in the grace given to His servant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This is a sure test of the reality of our faith and love:—when we read or hear of men being raised up to “preach the faith” in days that are past, or in distant lands (as, for example, in the great missionary work of the Church), do we glorify God in them? This was well understood by the English Reformers.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In the Commemoration Service (dating from the time of Q. Elizabeth, and not improbably drawn up by Abp Parker) which is used in the University, and some, if not all of the Colleges of Cambridge, there is a prayer commencing, ‘O Lord, we glorify Thee in these Thy servants our Benefactors departed out of this present life.’ No better commentary on the expression can be found than the Collect for the Conversion of St Paul. Compare also our Lord’s words, “All mine (neut. but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "including",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " masc. and fem.) are thine, and thine are mine; and I am glorified in them.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐδόξαζον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they glorified",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") And in the present day the Church glorifies God ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in Paul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Remember thou to observe the same thing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (to glorify God) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as often as a good report",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (about some one converted from ungodliness), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "has been brought to thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—V. g.]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν ἐμοὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") comp. note to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 1:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They glorified God previously, they now glorified Him also ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on account",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Paul.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they glorified God in me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καὶ ἐδόξαζον ἐν ἐμοὶ τὸν Θεόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and they were glorifying God in me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that is, for what they recognized as God s work in me and through me; in my own conversion, and in my effective ministering of the gospel to others. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " denotes the sphere in which they found occasion for praising God. Instances of a somewhat similar use of the preposition are ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ζητεῖται ἐν τοῖς οἰκονόμοις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ver. 6, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἵνα ἐν ἡμῖν μάθητε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": 9:15, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἵνα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "οὕτω γένηται ἐν ἐμοί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sentence is not essential to the line of thought in vers. 21-23. The apostle was probably prompted to add it by the complacency which he felt in the interest and sympathy which in those days the Jewish Churches showed towards him - sentiments which afterwards faded too much away into those of suspicion and alienation (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He rejoices to remember, and he will have the Galatian Churchmen know, that once the believers of the circumcision were proud of him, and were satisfied that he was preaching the true gospel of Christ. And his preaching was the same now as it had been then. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ref_word",
        "text": "ADDITIONAL NOTES.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Galatians 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In me",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sense is different from that in Galatians 1:16, see note. Here the meaning is that they glorified God as the author and source of what they saw in me. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The sense is different from that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", see note. Here the meaning is that they glorified God as the author and source of what they saw in me. ",
            "children": []
          }
        ]
      }
    ]
  }
]