[{"header":"Israel’s History after the Exodus"},{"num":1,"verse":"These are the words that Moses spoke to all Israel across the Jordan in the wilderness, in the Arabah opposite Suph, between Paran and Tophel, Laban, Hazeroth, and Dizahab."},{"num":2,"verse":"It is eleven days’ journey from Horeb by way of Mount Seir to Kadesh-barnea."},{"num":3,"verse":"In the fortieth year, on the first day of the eleventh month, Moses spoke to the sons of Israel, in accordance with everything that the Lord had commanded him to declare to them,"},{"num":4,"verse":"after he had defeated Sihon the king of the Amorites, who lived in Heshbon, and Og the king of Bashan, who lived in Ashtaroth and in Edrei."},{"num":5,"verse":"Across the Jordan in the land of Moab, Moses began to explain this Law, saying,"},{"num":6,"verse":"“The Lord our God spoke to us at Horeb, saying, ‘You have stayed long enough at this mountain."},{"num":7,"verse":"Turn and set out on your journey, and go to the hill country of the Amorites, and to all their neighbors in the Arabah, in the hill country, in the lowland, in the Negev, by the seacoast, the land of the Canaanites, and Lebanon, as far as the great river, the river Euphrates."},{"num":8,"verse":"See, I have placed the land before you; go in and take possession of the land which the Lord swore to give to your fathers, to Abraham, to Isaac, and to Jacob, and their descendants after them.’"},{"num":9,"verse":"“And I spoke to you at that time, saying, ‘I am not able to endure you alone."},{"num":10,"verse":"The Lord your God has multiplied you, and behold, you are this day like the stars of heaven in number."},{"num":11,"verse":"May the Lord, the God of your fathers increase you a thousand times more than you are, and bless you, just as He has promised you!"},{"num":12,"verse":"How can I alone endure the burden and weight of you and your strife?"},{"num":13,"verse":"Obtain for yourselves men who are wise, discerning, and informed from your tribes, and I will appoint them as your heads.’"},{"num":14,"verse":"And you answered me and said, ‘The thing which you have said to do is good.’"},{"num":15,"verse":"So I took the heads of your tribes, wise and informed men, and appointed them as heads over you, commanders of thousands, hundreds, fifties, and tens, and officers for your tribes."},{"num":16,"verse":"“Then I ordered your judges at that time, saying, ‘Hear the cases between your fellow countrymen and judge righteously between a person and his fellow countryman, or the stranger who is with him."},{"num":17,"verse":"You are not to show partiality in judgment; you shall hear the small and the great alike. You are not to be afraid of any person, for the judgment is God’s. The case that is too difficult for you, you shall bring to me, and I will hear it.’"},{"num":18,"verse":"At that time I commanded you all the things that you were to do."},{"num":19,"verse":"“Then we set out from Horeb, and went through all that great and terrible wilderness that you saw on the way to the hill country of the Amorites, just as the Lord our God had commanded us; and we came to Kadesh-barnea."},{"num":20,"verse":"And I said to you, ‘You have come to the hill country of the Amorites, which the Lord our God is about to give us."},{"num":21,"verse":"See, the Lord your God has placed the land before you; go up, take possession, just as the Lord, the God of your fathers, has spoken to you. Do not fear or be dismayed.’"},{"num":22,"verse":"“Then all of you approached me and said, ‘Let us send men ahead of us, so that they may spy out the land for us, and bring back to us word of the way by which we should go up, and the cities which we should enter.’"},{"num":23,"verse":"The plan pleased me, and I took twelve of your men, one man for each tribe."},{"num":24,"verse":"Then they turned and went up into the hill country, and came to the Valley of Eshcol, and spied it out."},{"num":25,"verse":"And they took some of the fruit of the land in their hands and brought it down to us. They also brought us back a report and said, ‘The land that the Lord our God is about to give us is good.’"},{"num":26,"verse":"“Yet you were unwilling to go up; instead you rebelled against the command of the Lord your God;"},{"num":27,"verse":"and you grumbled in your tents and said, ‘Because the Lord hates us, He has brought us out of the land of Egypt, to hand us over to the Amorites to destroy us."},{"num":28,"verse":"Where can we go up? Our brothers have made our hearts melt, by saying, “The people are bigger and taller than we; the cities are large and fortified up to heaven. And besides, we saw the sons of the Anakim there.”’"},{"num":29,"verse":"But I said to you, ‘Do not be terrified, nor fear them."},{"num":30,"verse":"The Lord your God, who goes before you, will Himself fight for you, just as He did for you in Egypt before your eyes,"},{"num":31,"verse":"and in the wilderness where you saw how the Lord your God carried you, just as a man carries his son, on all of the road which you have walked until you came to this place.’"},{"num":32,"verse":"Yet in spite of all this, you did not trust the Lord your God,"},{"num":33,"verse":"who goes before you on your way, to seek out a place for you to make camp, in the fire by night to show you the way by which you should go, and in the cloud by day."},{"num":34,"verse":"“Then the Lord heard the sound of your words, and He was angry and swore an oath, saying,"},{"num":35,"verse":"‘Not one of these men, this evil generation, shall see the good land which I swore to give your fathers,"},{"num":36,"verse":"except Caleb the son of Jephunneh; he shall see it, and to him I will give the land on which he has set foot, and to his sons, because he has followed the Lord fully.’"},{"num":37,"verse":"The Lord was angry with me also on your account, saying, ‘Not even you shall enter there."},{"num":38,"verse":"Joshua the son of Nun, who stands before you, shall himself enter there; encourage him, for he will give it to Israel as an inheritance."},{"num":39,"verse":"Moreover, your little ones who, you said, would become plunder, and your sons, who this day have no knowledge of good and evil, shall enter there, and I will give it to them and they shall take possession of it."},{"num":40,"verse":"But as for you, turn around and set out for the wilderness by the way of the Red Sea.’"},{"num":41,"verse":"“Then you replied to me, ‘We have sinned against the Lord; we ourselves will go up and fight, just as the Lord our God commanded us.’ And every man of you strapped on his weapons of war, and you viewed it as easy to go up into the hill country."},{"num":42,"verse":"But the Lord said to me, ‘Say to them, “Do not go up nor fight, for I am not among you; otherwise you will be defeated by your enemies.”’"},{"num":43,"verse":"So I spoke to you, but you would not listen. Instead, you rebelled against the command of the Lord, and acted presumptuously and went up into the hill country."},{"num":44,"verse":"And the Amorites who lived in that hill country came out against you and chased you as bees do, and they scattered you from Seir to Hormah."},{"num":45,"verse":"Then you returned and wept before the Lord; but the Lord did not listen to your voice, nor pay attention to you."},{"num":46,"verse":"So you remained at Kadesh for many days, the days that you spent there."}]