[{"num":1,"verse":"These are the devarim (words) which Moshe spoke unto kol Yisroel on the far side of the Yarden in the midbar, in the Aravah opposite Suf between Paran, and Tophel, and Lavan, and Chatzerot, and Di-Zahav."},{"num":2,"verse":"(There is eleven days’ journey from Chorev unto Kadesh-Barnea by way of Mount Seir.)"},{"num":3,"verse":"And it came to pass in the fortieth year, in the eleventh month, on the first day of the month, that Moshe spoke unto the Bnei Yisroel, according unto all that Hashem had given him in commandment unto them,"},{"num":4,"verse":"After he had slain Sichon Melech HaEmori, which dwelt in Cheshbon, and Og Melech HaBashan, which dwelt in Ashtarot at Edre’i;"},{"num":5,"verse":"On the far side of the Yarden, in Eretz Moav, began Moshe to expound this torah, saying,"},{"num":6,"verse":"Hashem Eloheinu spoke unto us in Chorev, saying, Ye have dwelt long enough at this mountain;"},{"num":7,"verse":"Turn you, and take your journey, and go to the Har HaEmori (hill country of the Amorites), and unto all the places nigh thereunto, in the Aravah, in the hills, in the Shefelah, and in the Negev, and by the seacoast, to the Eretz HaKena’ani (Land of the Canaanites), and unto Lebanon, unto the great river, the river Euphrates."},{"num":8,"verse":"See, I have set ha’aretz (the land) before you; go in and possess ha’aretz which Hashem swore unto Avoteichem, Avraham, Yitzchak, and Ya’akov, to give unto them and to their zera after them."},{"num":9,"verse":"And I spoke unto you at that time, saying, I am not able to bear the burden of you by myself alone;"},{"num":10,"verse":"Hashem Eloheichem hath multiplied you, and, see, ye are today as numerous as the kokhavei HaShomayim."},{"num":11,"verse":"(Hashem Elohei Avoteichem increase you a thousand times over and bless you, as He hath promised you!)"},{"num":12,"verse":"How can I myself alone bear your problems, and your massa and your strife?"},{"num":13,"verse":"Take you anashim chachamim, men of wisdom and understanding, who are known among your tribes, and I will set them over you."},{"num":14,"verse":"And ye answered me, and said, The thing which thou hast spoken is tov for us to do."},{"num":15,"verse":"So I took the leaders of your tribes, anashim chachamim, men of understanding, and made them heads over you, over thousands, and over hundreds, and over fifties, and over tens, shoterim among your tribes."},{"num":16,"verse":"And I charged your shofetim at that time, saying, Hear the cases between your brethren, and judge righteously between every man and his brother, and the ger that is with him."},{"num":17,"verse":"Ye shall not respect persons in mishpat but ye shall hear the katon as well as the gadol; ye shall not be afraid of the face of man; for the mishpat is Elohim’s: and the case that is too hard for you, bring it unto me, and I will hear it."},{"num":18,"verse":"And I commanded you at that time all the things which ye should do."},{"num":19,"verse":"And when we departed from Chorev, we went through all that great and terrible midbar, which ye saw on the way to the Har HaEmori, just as Hashem Eloheinu commanded us; and we came to Kadesh-Barnea."},{"num":20,"verse":"And I said unto you, Ye are come unto the Har HaEmori which Hashem Eloheinu doth give unto us."},{"num":21,"verse":"See, Hashem Eloheicha hath set ha’aretz before thee; go up and possess it, as Hashem Elohei Avoteicha hath said unto thee; fear not, neither be discouraged."},{"num":22,"verse":"And ye came near unto me every one of you, and said, Let us send anashim ahead of us, and they shall spy out ha’aretz, and bring us word again by what way we must go up, and into what towns we shall come."},{"num":23,"verse":"And the proposal pleased me well; and I took Shneym Asar, (Twelve) of you, one of each shevet (tribe);"},{"num":24,"verse":"And they turned and went up into the hill country, and came unto the Eshkol Valley, and explored it."},{"num":25,"verse":"And they took of the pri ha’aretz in their hands, brought it down unto us, brought us word, and said, It is a tovah ha’aretz which Hashem Eloheinu doth give us."},{"num":26,"verse":"Notwithstanding ye would not go up, but rebelled against the commandment of Hashem Eloheichem;"},{"num":27,"verse":"And ye murmured in your oholim, and said, Because Hashem hated us, He hath brought us forth out of Eretz Mitzrayim, to deliver us into the hand of HaEmori, to destroy us."},{"num":28,"verse":"Where shall we go up? Our brethren have discouraged levavenu (our hearts), saying, The people is greater and taller than we; the cities are great and walled up to Shomayim; moreover we have seen the Bnei Anakim there."},{"num":29,"verse":"Then I said unto you, Dread not, neither be afraid of them."},{"num":30,"verse":"Hashem Eloheichem which goeth before you, He shall fight for you, according to all that He did for you in Mitzrayim before your eyes;"},{"num":31,"verse":"And in the midbar, where thou hast seen how that Hashem Eloheicha did bear thee, as a man doth carry his ben, in all the way that ye went, until ye came into this place."},{"num":32,"verse":"Yet in this thing ye were not ma’aminim (believers) in Hashem Eloheichem,"},{"num":33,"verse":"Who went in the way before you, to search you out a place to pitch your tents in, in eish by lailah, to show you by what way ye should go, and in an anan (cloud) by day."},{"num":34,"verse":"And Hashem heard the sound of your words, and was angry, and on oath, said,"},{"num":35,"verse":"Surely there shall not one of these men of this dor harah see ha’aretz hatovah, which I swore to give unto Avoteichem."},{"num":36,"verse":"Except Kalev ben Yephunneh; he shall see it, and to him will I give ha’aretz that he hath trodden upon, and to his children, because he hath wholly followed Hashem."},{"num":37,"verse":"Also Hashem was angry with me because of you, saying, Thou also shalt not go in there."},{"num":38,"verse":"But Yehoshua ben Nun, the one assisting thee, he shall go in there; encourage him, for he shall cause Yisroel to inherit it."},{"num":39,"verse":"Moreover your little ones, which ye said would be taken captive, and your children, which as yet do not have knowledge between tov and rah, they shall go in there, and unto them will I give it, and they shall possess it."},{"num":40,"verse":"But as for you, turn, take your journey into the midbar by the way of the Yam Suf."},{"num":41,"verse":"Then ye answered and said unto me, We have sinned against Hashem; we will go up and fight, according to all that Hashem Eloheinu did command us. And when ye had girded on every man his weapons of war, ye made light of going up into the hill country."},{"num":42,"verse":"And Hashem said unto me, Say unto them. Go not up, neither fight; for I am not in your midst; lest ye be struck down before your enemies."},{"num":43,"verse":"So I spoke unto you; and ye would not hear, but rebelled against the commandment of Hashem, and went presumptuously up into the hill country."},{"num":44,"verse":"And HaEmori, which dwelt in that hill country, came out against you, and chased you, as bees do, and destroyed you in Seir, even unto Chormah."},{"num":45,"verse":"And ye returned and wept before Hashem; but Hashem would not listen to your voice, nor give ear unto you."},{"num":46,"verse":"That is why ye abode in Kadesh as long as ye did."}]