[{"header":"Devarim: The Words that Moses Spoke"},{"num":1,"verse":"These are the words that Moses spoke to all Israel across the Jordan—in the wilderness, in the Arabah opposite Suph, between Paran and Tophel, Laban, Hazeroth and Di-Zahab. "},{"num":2,"verse":"It is eleven days’ journey from Horeb by way of Mount Seir to Kadesh-barnea."},{"num":3,"verse":"Now Moses spoke to Bnei-Yisrael, according to all Adonai had commanded him for them—in the fortieth year, in the eleventh month, on the first day of the month, "},{"num":4,"verse":"after he had struck down Sihon king of the Amorites who lived in Heshbon, and Og king of the Bashan who lived in Ashtaroth and Edrei."},{"num":5,"verse":"Across the Jordan in the land of Moab, Moses began to explain this Torah saying, "},{"num":6,"verse":"“Adonai our God spoke to us at Horeb saying: ‘You have stayed long enough at this mountain. "},{"num":7,"verse":"Turn, journey on, and enter the hill country of the Amorites and all their neighbors, in the Arabah, the hill country, the lowland, the Negev, and by the seashore—the land of the Canaanites and the Lebanon as far as the great river, the Euphrates. "},{"num":8,"verse":"See, I have set the land before you. Enter and possess the land that Adonai swore to your fathers—to Abraham, to Isaac, and to Jacob—to give to them and to their descendants after them.’"},{"header":"Bad Report and Poor Response"},{"num":9,"verse":"“I spoke to you at that time saying: ‘I am not able to bear the burden of you by myself. "},{"num":10,"verse":"Adonai your God has multiplied you—and here you are today, like the stars of the heavens in number."},{"num":11,"verse":"“‘May Adonai, God of your fathers, increase you a thousand times as many as you are, and may He bless you just as He has promised you! "},{"num":12,"verse":"How can I bear your load and burden and bickering by myself? "},{"num":13,"verse":"Choose for yourselves wise and discerning men, well known to your tribes, and I will appoint them as your heads.’"},{"num":14,"verse":"“You answered me and said: ‘The thing you have said to do is good.’ "},{"num":15,"verse":"So I took the heads of your tribes, men who were wise and well known, and appointed them as heads over you—leaders of thousands, leaders of hundreds, leaders of fifties, leaders of tens, and officials for your tribes."},{"num":16,"verse":"“I commanded your judges at that time saying: ‘Hear cases between your brothers, and judge fairly between a man and his brother or the outsider with him. "},{"num":17,"verse":"You must not show partiality in judgment—you must hear the small and the great alike. Fear no man, for the judgment is God’s. The case that is too hard for you, you shall bring to me and I will hear it.’"},{"num":18,"verse":"“I commanded you at that time everything you should do."},{"num":19,"verse":"“Then we journeyed from Horeb and went through all that great and terrible wilderness that you saw on the way to the hill country of the Amorites, as Adonai our God commanded us. Then we came to Kadesh-barnea. "},{"num":20,"verse":"I said to you: ‘You have come to the hill country of the Amorites, which Adonai our God is giving to us. "},{"num":21,"verse":"See, Adonai your God has set the land before you—go up, take possession, as Adonai God of your fathers has promised you. Do not be afraid or discouraged.’"},{"num":22,"verse":"“Then all of you came near to me and said: ‘Let’s send men ahead of us to explore the land for us and bring us back word about the way we should go up and the cities we will enter.’"},{"num":23,"verse":"“The idea seemed good to me, so I took twelve men from among you—one man for each tribe. "},{"num":24,"verse":"They turned and went up into the hill country, and they came to the Wadi Eshcol and spied it out. "},{"num":25,"verse":"They took in their hands some of the fruit of the land and brought it down to us. They also brought back word to us and said, ‘Good is the land that Adonai our God is giving to us.’"},{"num":26,"verse":"“Yet you would not go up, but rebelled against the command of Adonai your God. "},{"num":27,"verse":"In your tents you grumbled and said: ‘Because Adonai hates us, He has brought us out from the land of Egypt to hand us over to the Amorites, to destroy us! "},{"num":28,"verse":"Where are we going? Our brothers have discouraged our hearts saying, “The people are greater and taller than we are! The cities are great and fortified up to the heavens! Besides, we have even seen the children of Anakim there!”’"},{"num":29,"verse":"“Then I said to you, ‘Don’t tremble or be afraid of them. "},{"num":30,"verse":"Adonai your God, who goes before you, He Himself will fight for you—just as He did for you in Egypt before your own eyes, "},{"num":31,"verse":"and in the wilderness, where you saw how Adonai your God carried you as a man carries his son, everywhere you went until you came to this place.’ "},{"num":32,"verse":"Yet for all this you did not trust in Adonai your God—"},{"num":33,"verse":"the One who goes before you on the way to scout out a place for you to camp and to show you the way you should go, in fire by night and in the cloud by day."},{"num":34,"verse":"“When Adonai heard the tone of your words, He was angry and swore an oath saying, "},{"num":35,"verse":"‘Not one of these men of this evil generation will see the good land that I swore to give your fathers—"},{"num":36,"verse":"except Caleb the son of Jephunneh. He will see it—yet to him and his children I will give the land that he has walked on, because he has followed Adonai wholeheartedly.’"},{"num":37,"verse":"“Adonai was even angry with me on your account, saying, ‘You will not enter there, either. "},{"num":38,"verse":"Joshua son of Nun, who stands before you, will enter there—encourage him, for he will enable Israel to inherit it."},{"num":39,"verse":"“‘Moreover, your little ones—whom you said would become plunder, and your children who today have no knowledge of good or evil—they will enter there. To them I will give it and they will possess it. "},{"num":40,"verse":"But as for you, turn around and journey into the wilderness by way of the Sea of Reeds.’"},{"num":41,"verse":"“Then you answered and said to me, ‘We have sinned against Adonai. We will go up and fight, just as Adonai our God commanded us.’ So each of you strapped on his weapons of war, figuring it was easy to go up to the hill country."},{"num":42,"verse":"“But Adonai said to me, ‘Tell them, “Do not go up and fight—for I am not with you, and you will be defeated by your enemies.”’"},{"num":43,"verse":"“So I told you, but you would not listen—you rebelled against the command of Adonai and presumptuously went up into the hill country. "},{"num":44,"verse":"The Amorites who lived in that hill country came out against you, and they chased you as bees do and scattered you from Seir to Hormah. "},{"num":45,"verse":"Then you returned and wept before Adonai, but Adonai did not listen to your voice or pay attention to you."},{"num":46,"verse":"“So you stayed in Kadesh many days—like the days you had spent before."}]