[{"header":"Christian Order"},{"num":11,"verse":"Imitate me, just as I imitate Christ."},{"num":2,"verse":"I praise and appreciate you because you remember me in everything and you firmly hold to the traditions [the substance of my instructions], just as I have passed them on to you. "},{"num":3,"verse":"But I want you to understand that Christ is the head (authority over) of every man, and man is the head of woman, and God is the head of Christ. "},{"num":4,"verse":"Every man who prays or prophesies with something on his head dishonors his head [and the One who is his head]. "},{"num":5,"verse":"And every woman who prays or prophesies when she has her head uncovered disgraces her head; for she is one and the same as the woman whose head is shaved [in disgrace]. "},{"num":6,"verse":"If a woman does not cover her head, she should have her hair cut off; and if it is disgraceful for a woman to have her hair cut off or her head shaved, she should cover her head. "},{"num":7,"verse":"A man ought not have his head covered [during worship], since he is the image and [reflected] glory of God; but the woman is [the expression of] man’s glory. "},{"num":8,"verse":"For man does not originate from woman, but woman from man; "},{"num":9,"verse":"for indeed man was not created for the sake of woman, but woman for the sake of man. "},{"num":10,"verse":"Therefore the woman ought to have a sign of authority on her head, for the sake of the angels [so as not to offend them]. "},{"num":11,"verse":"Nevertheless, woman is not independent of man, nor is man independent of woman. "},{"num":12,"verse":"For as the woman originates from the man, so also man is born through the woman; and all things [whether male or female] originate from God [as their Creator]. "},{"num":13,"verse":"Judge for yourselves; is it proper for a woman to offer prayer to God [publicly] with her head uncovered? "},{"num":14,"verse":"Does not common sense itself teach you that if a man has long hair, it is a dishonor to him, "},{"num":15,"verse":"but if a woman has long hair, it is her ornament and glory? For her long hair is given to her as a covering. "},{"num":16,"verse":"Now if anyone is inclined to be contentious [about this], we have no other practice [in worship than this], nor do the churches of God [in general]."},{"num":17,"verse":"But in giving this next instruction, I do not praise you, because when you meet together it is not for the better but for the worse. "},{"num":18,"verse":"For, in the first place, when you meet together in church, I hear that there are divisions among you; and in part I believe it, "},{"num":19,"verse":"for [doubtless] there have to be factions among you, so that those who are of approved character may be clearly recognized among you. "},{"num":20,"verse":"So when you meet together, it is not to eat the Lord’s Supper, "},{"num":21,"verse":"for when you eat, each one hurries to get his own supper first [not waiting for others or the poor]. So one goes hungry while another gets drunk. "},{"num":22,"verse":"What! Do you not have houses in which to eat and drink? Or do you show contempt for the church of God and humiliate those [impoverished believers] who have nothing? What will I say to you? Shall I praise you for this? In this I will not praise you!"},{"header":"The Lord’s Supper"},{"num":23,"verse":"For I received from the Lord Himself that [instruction] which I passed on to you, that the Lord Jesus on the night in which He was betrayed took bread; "},{"num":24,"verse":"and when He had given thanks, He broke it and said, “This is (represents) My body, which is [offered as a sacrifice] for you. Do this in [affectionate] remembrance of Me.” "},{"num":25,"verse":"In the same way, after supper He took the cup, saying, “This cup is the new covenant [ratified and established] in My blood; do this, as often as you drink it, in [affectionate] remembrance of Me.” "},{"num":26,"verse":"For every time you eat this bread and drink this cup, you are [symbolically] proclaiming [the fact of] the Lord’s death until He comes [again]."},{"num":27,"verse":"So then whoever eats the bread or drinks the cup of the Lord in a way that is unworthy [of Him] will be guilty of [profaning and sinning against] the body and blood of the Lord. "},{"num":28,"verse":"But a person must [prayerfully] examine himself [and his relationship to Christ], and only when he has done so should he eat of the bread and drink of the cup. "},{"num":29,"verse":"For anyone who eats and drinks [without solemn reverence and heartfelt gratitude for the sacrifice of Christ], eats and drinks a judgment on himself if he does not recognize the body [of Christ]. "},{"num":30,"verse":"That [careless and unworthy participation] is the reason why many among you are weak and sick, and a number sleep [in death]. "},{"num":31,"verse":"But if we evaluated and judged ourselves honestly [recognizing our shortcomings and correcting our behavior], we would not be judged. "},{"num":32,"verse":"But when we [fall short and] are judged by the Lord, we are disciplined [by undergoing His correction] so that we will not be condemned [to eternal punishment] along with the world."},{"num":33,"verse":"So then, my brothers and sisters, when you come together to eat [the Lord’s Supper], wait for one another [and see to it that no one is left out]. "},{"num":34,"verse":"If anyone is too hungry [to wait], let him eat at home, so that you will not come together for judgment [on yourselves]. About the remaining matters [of which I was informed], I will take care of them when I come."}]