[{"num":1,"verse":"Be ye imitators of me, even as I also am of Christ."},{"num":2,"verse":"Now I praise you that ye remember me in all things, and hold fast the traditions, even as I delivered them to you. "},{"num":3,"verse":"But I would have you know, that the head of every man is Christ; and the head of the woman is the man; and the head of Christ is God. "},{"num":4,"verse":"Every man praying or prophesying, having his head covered, dishonoreth his head. "},{"num":5,"verse":"But every woman praying or prophesying with her head unveiled dishonoreth her head; for it is one and the same thing as if she were shaven. "},{"num":6,"verse":"For if a woman is not veiled, let her also be shorn: but if it is a shame to a woman to be shorn or shaven, let her be veiled. "},{"num":7,"verse":"For a man indeed ought not to have his head veiled, forasmuch as he is the image and glory of God: but the woman is the glory of the man. "},{"num":8,"verse":"For the man is not of the woman; but the woman of the man: "},{"num":9,"verse":"for neither was the man created for the woman; but the woman for the man: "},{"num":10,"verse":"for this cause ought the woman to have a sign of authority on her head, because of the angels. "},{"num":11,"verse":"Nevertheless, neither is the woman without the man, nor the man without the woman, in the Lord. "},{"num":12,"verse":"For as the woman is of the man, so is the man also by the woman; but all things are of God. "},{"num":13,"verse":"Judge ye in yourselves: is it seemly that a woman pray unto God unveiled? "},{"num":14,"verse":"Doth not even nature itself teach you, that, if a man have long hair, it is a dishonor to him? "},{"num":15,"verse":"But if a woman have long hair, it is a glory to her: for her hair is given her for a covering. "},{"num":16,"verse":"But if any man seemeth to be contentious, we have no such custom, neither the churches of God."},{"num":17,"verse":"But in giving you this charge, I praise you not, that ye come together not for the better but for the worse. "},{"num":18,"verse":"For first of all, when ye come together in the church, I hear that divisions exist among you; and I partly believe it. "},{"num":19,"verse":"For there must be also factions among you, that they that are approved may be made manifest among you. "},{"num":20,"verse":"When therefore ye assemble yourselves together, it is not possible to eat the Lord’s supper: "},{"num":21,"verse":"for in your eating each one taketh before other his own supper; and one is hungry, and another is drunken. "},{"num":22,"verse":"What, have ye not houses to eat and to drink in? or despise ye the church of God, and put them to shame that have not? What shall I say to you? shall I praise you? In this I praise you not. "},{"num":23,"verse":"For I received of the Lord that which also I delivered unto you, that the Lord Jesus in the night in which he was betrayed took bread; "},{"num":24,"verse":"and when he had given thanks, he brake it, and said, This is my body, which is for you: this do in remembrance of me. "},{"num":25,"verse":"In like manner also the cup, after supper, saying, This cup is the new covenant in my blood: this do, as often as ye drink it, in remembrance of me. "},{"num":26,"verse":"For as often as ye eat this bread, and drink the cup, ye proclaim the Lord’s death till he come. "},{"num":27,"verse":"Wherefore whosoever shall eat the bread or drink the cup of the Lord in an unworthy manner, shall be guilty of the body and the blood of the Lord. "},{"num":28,"verse":"But let a man prove himself, and so let him eat of the bread, and drink of the cup. "},{"num":29,"verse":"For he that eateth and drinketh, eateth and drinketh judgment unto himself, if he discern not the body. "},{"num":30,"verse":"For this cause many among you are weak and sickly, and not a few sleep. "},{"num":31,"verse":"But if we discerned ourselves, we should not be judged. "},{"num":32,"verse":"But when we are judged, we are chastened of the Lord, that we may not be condemned with the world. "},{"num":33,"verse":"Wherefore, my brethren, when ye come together to eat, wait one for another. "},{"num":34,"verse":"If any man is hungry, let him eat at home; that your coming together be not unto judgment. And the rest will I set in order whensoever I come."}]