[{"header":"Chapter 11"},{"num":1,"verse":"Be imitators of me, as I am of Christ."},{"num":2,"verse":"I praise you because you remember me in everything and hold fast to the traditions, just as I handed them on to you."},{"header":"A. Women’s Headdresses[b]"},{"num":3,"verse":"Man and Woman. But I want you to know that Christ is the head of every man, and a husband the head of his wife, and God the head of Christ. "},{"num":4,"verse":"Any man who prays or prophesies with his head covered brings shame upon his head. "},{"num":5,"verse":"But any woman who prays or prophesies with her head unveiled brings shame upon her head, for it is one and the same thing as if she had had her head shaved. "},{"num":6,"verse":"For if a woman does not have her head veiled, she may as well have her hair cut off. But if it is shameful for a woman to have her hair cut off or her head shaved, then she should wear a veil."},{"num":7,"verse":"A man, on the other hand, should not cover his head, because he is the image and glory of God, but woman is the glory of man. "},{"num":8,"verse":"For man did not come from woman, but woman from man; "},{"num":9,"verse":"nor was man created for woman, but woman for man; "},{"num":10,"verse":"for this reason a woman should have a sign of authority on her head, because of the angels. "},{"num":11,"verse":"Woman is not independent of man or man of woman in the Lord. "},{"num":12,"verse":"For just as woman came from man, so man is born of woman; but all things are from God."},{"num":13,"verse":"Judge for yourselves: is it proper for a woman to pray to God with her head unveiled? "},{"num":14,"verse":"Does not nature itself teach you that if a man wears his hair long it is a disgrace to him, "},{"num":15,"verse":"whereas if a woman has long hair it is her glory, because long hair has been given [her] for a covering? "},{"num":16,"verse":"But if anyone is inclined to be argumentative, we do not have such a custom, nor do the churches of God."},{"header":"B. The Lord’s Supper[i]"},{"num":17,"verse":"An Abuse at Corinth. In giving this instruction, I do not praise the fact that your meetings are doing more harm than good. "},{"num":18,"verse":"First of all, I hear that when you meet as a church there are divisions among you, and to a degree I believe it; "},{"num":19,"verse":"there have to be factions among you in order that [also] those who are approved among you may become known. "},{"num":20,"verse":"When you meet in one place, then, it is not to eat the Lord’s supper, "},{"num":21,"verse":"for in eating, each one goes ahead with his own supper, and one goes hungry while another gets drunk. "},{"num":22,"verse":"Do you not have houses in which you can eat and drink? Or do you show contempt for the church of God and make those who have nothing feel ashamed? What can I say to you? Shall I praise you? In this matter I do not praise you."},{"num":23,"verse":"Tradition of the Institution. For I received from the Lord what I also handed on to you, that the Lord Jesus, on the night he was handed over, took bread, "},{"num":24,"verse":"and, after he had given thanks, broke it and said, “This is my body that is for you. Do this in remembrance of me.” "},{"num":25,"verse":"In the same way also the cup, after supper, saying, “This cup is the new covenant in my blood. Do this, as often as you drink it, in remembrance of me.” "},{"num":26,"verse":"For as often as you eat this bread and drink the cup, you proclaim the death of the Lord until he comes."},{"num":27,"verse":"Therefore whoever eats the bread or drinks the cup of the Lord unworthily will have to answer for the body and blood of the Lord. "},{"num":28,"verse":"A person should examine himself, and so eat the bread and drink the cup. "},{"num":29,"verse":"For anyone who eats and drinks without discerning the body, eats and drinks judgment on himself. "},{"num":30,"verse":"That is why many among you are ill and infirm, and a considerable number are dying. "},{"num":31,"verse":"If we discerned ourselves, we would not be under judgment; "},{"num":32,"verse":"but since we are judged by [the] Lord, we are being disciplined so that we may not be condemned along with the world."},{"num":33,"verse":"Therefore, my brothers, when you come together to eat, wait for one another. "},{"num":34,"verse":"If anyone is hungry, he should eat at home, so that your meetings may not result in judgment. The other matters I shall set in order when I come."}]