[{"header":"Chapter 19"},{"num":1,"verse":"Song of Victory and Wedding Day of the Lamb. After this I heard what sounded like the roar of a great multitude in heaven, shouting:"},{"num":3,"verse":"Once again they shouted:"},{"num":4,"verse":"The twenty-four elders and the four living creatures threw themselves to the ground and worshiped God who was seated on the throne, and they cried:"},{"num":5,"verse":"Then a voice came from the throne, saying:"},{"num":6,"verse":"And I heard what seemed to be the sound of a vast multitude, like the sound of a torrential stream or of great peals of thunder, crying out:"},{"num":9,"verse":"Then the angel said to me, “Write: ‘Blessed are those who are invited to the wedding banquet of the Lamb.’ ” And he added, “These are the true words of God.”"},{"num":10,"verse":"I fell at his feet to worship him, but he said to me, “You must not do that! I am a fellow servant with you and with your brethren who have given witness to Jesus. Worship God! For the witness to Jesus is the spirit of prophecy."},{"header":"Recapitulative Visions of the History of Salvation[e]"},{"num":11,"verse":"The White Horse and the King of Kings. Now I saw heaven opened, and a white horse appeared. Its rider was called “Faithful and True,” for with righteousness he judges and wages war."},{"num":12,"verse":"His eyes were like fiery flames, and on his head were many crowns. The name inscribed on him was known to no one but himself."},{"num":13,"verse":"He was clothed in a robe dipped in blood, and he was known by the name The Word of God."},{"num":14,"verse":"The armies of heaven were following him, riding on white horses and dressed in fine linen, white and clean."},{"num":15,"verse":"Coming out of his mouth was a sharp sword with which to strike down the nations. He will rule them with an iron scepter, and he will tread the winepress of the fury of the wrath of God the Almighty."},{"num":16,"verse":"On his robe and on his thigh he had a name inscribed: “King of kings and Lord of lords.”"},{"num":17,"verse":"The Great Booty. Then I saw an angel standing in the sun, and with a loud voice he cried out to all the birds flying in midair, “Come here! Gather together for the great supper of God,"},{"num":18,"verse":"to eat the flesh of kings, the flesh of commanders, and the flesh of warriors, the flesh of horses and their riders, the flesh of all, both free and slave, both small and great.”"},{"num":19,"verse":"The Beast and the False Prophet. Next I saw the beast and the kings of the earth and their armies gathered together to wage war against the one upon the horse and against his army."},{"num":20,"verse":"The beast was captured, and with it the false prophet who in its presence had performed the signs by which he had deluded those who had received the mark of the beast and those who had worshiped its image."}]