[{"header":"A season for everything"},{"header":"Hard work"},{"num":9,"verse":"What do workers gain from all their hard work?"},{"num":10,"verse":"I have observed the task that God has given human beings."},{"num":11,"verse":"God has made everything fitting in its time, but has also placed eternity in their hearts, without enabling them to discover what God has done from beginning to end."},{"num":12,"verse":"I know that there’s nothing better for them but to enjoy themselves and do what’s good while they live."},{"num":13,"verse":"Moreover, this is the gift of God: that all people should eat, drink, and enjoy the results of their hard work."},{"num":14,"verse":"I know that whatever God does will last forever; it’s impossible to add to it or take away from it. God has done this so that people are reverent before him."},{"num":15,"verse":"Whatever happens has already happened, and whatever will happen has already happened before. And God looks after what is driven away."},{"header":"Enjoy what you do now"},{"num":16,"verse":"I saw something else under the sun: in the place of justice, there was wickedness; and in the place of what was right, there was wickedness again!"},{"num":17,"verse":"I thought to myself, God will judge both righteous and wicked people, because there’s a time for every matter and every deed."},{"num":18,"verse":"I also thought, Where human beings are concerned, God tests them to show them that they are but animals"},{"num":19,"verse":"because human beings and animals share the same fate. One dies just like the other—both have the same life-breath. Humans are no better off than animals because everything is pointless."},{"num":21,"verse":"Who knows if a human being’s life-breath rises upward while an animal’s life-breath descends into the earth?"},{"num":22,"verse":"So I perceived that there was nothing better for human beings but to enjoy what they do because that’s what they’re allotted in life. Who, really, is able to see what will happen in the future?"}]