[{"header":"A Time for Everything"},{"num":3,"verse":"There is a right time for everything, and everything on earth will happen at the right time."},{"header":"God Controls His World"},{"num":9,"verse":"Do people really gain anything from their hard work?"},{"num":10,"verse":"I saw all the hard work God gave us to do."},{"num":11,"verse":"God gave us the ability to think about his world, but we can never completely understand everything he does. And yet, he does everything at just the right time."},{"num":12,"verse":"I learned that the best thing for people to do is to be happy and enjoy themselves as long as they live."},{"num":13,"verse":"God wants everyone to eat, drink, and enjoy their work. These are gifts from God."},{"num":14,"verse":"I learned that anything God does will continue forever. People cannot add anything to the work of God, and they cannot take anything away from it. God did this so that people would respect him."},{"num":15,"verse":"What happened in the past has happened, and what will happen in the future will happen. But God wants to help those who have been treated badly."},{"num":16,"verse":"I also saw these things in this life: I saw that the courts should be filled with goodness and fairness, but there is evil there now."},{"num":17,"verse":"So I said to myself, “God has planned a time for everything, and he has planned a time to judge everything people do. He will judge good people and bad people.”"},{"header":"Are People Like Animals?"},{"num":18,"verse":"I thought about what people do to each other. And I said to myself, “God wants people to see that they are like animals."},{"num":19,"verse":"The same thing happens to animals and to people—they die. People and animals have the same ‘breath.’ Is a dead animal different from a dead person? It is all so senseless!"},{"num":20,"verse":"The bodies of people and animals end the same way. They came from the earth, and, in the end, they will go back to the earth."},{"num":21,"verse":"Who knows what happens to a person’s spirit? Who knows if a human’s spirit goes up to God while an animal’s spirit goes down into the ground?”"},{"num":22,"verse":"So I saw that the best thing people can do is to enjoy what they do, because that is all they have. Besides, no one can help another person see what will happen in the future."}]