[{"header":"Remind Everyone How To Behave Toward Other People"},{"num":3,"verse":"Be reminding them to be subject to rulers, to authorities; to be obedient; to be ready for every good work; "},{"num":2,"verse":"to blaspheme no one; to be non-quarrelsome, kind, demonstrating all gentleness toward all people."},{"header":"For We Also Were Once Foolish And Deceived, But God Saved Us By His Mercy And Grace"},{"num":3,"verse":"For we also were once foolish, disobedient, being deceived, being-slaves to various desires and pleasures, spending life in malice and envy, detested, hating one another. "},{"num":4,"verse":"But when the kindness and love-for-mankind of our Savior God appeared, "},{"num":5,"verse":"He saved us— not by works which we did in [our] righteousness, but according-to His mercy, through a washing of  regeneration and a renewing of  the Holy Spirit, "},{"num":6,"verse":"Whom He richly poured-out upon us through Jesus Christ our Savior, "},{"num":7,"verse":"in order that having been declared-righteous by the grace of that One, we might become heirs according-to the hope of eternal life. "},{"num":8,"verse":"The saying is trustworthy."},{"header":"Speak With Confidence, So That Believers Take The Lead In Good Works"},{"num":9,"verse":"But be shunning foolish controversies and genealogies and quarrels and battles pertaining-to-the-Law. For they are unprofitable and worthless. "},{"num":10,"verse":"Be declining a divisive person after a first and second admonition, "},{"num":11,"verse":"knowing that such a one has been perverted and is sinning, being self-condemned."},{"num":12,"verse":"When I send Artemas or Tychicus to you, be diligent to come to me in Nicopolis, for I have determined to spend-the-winter there. "},{"num":13,"verse":"Diligently send-forward Zenas the lawyer and Apollos, in order that nothing may be lacking for them. "},{"num":14,"verse":"And let our people also be learning to take-the-lead in good works for necessary needs, in order that they may not be unfruitful. "},{"num":15,"verse":"All the ones with me greet you. Greet the ones loving us in the faith. Grace be with you all."}]