[{"num":3,"verse":"Remind believers to willingly place themselves under the authority of government officials. Believers should obey them and be ready to help them with every good thing they do. "},{"num":2,"verse":"Believers shouldn’t curse anyone or be quarrelsome, but they should be gentle and show courtesy to everyone."},{"header":"What God Did for Us"},{"num":3,"verse":"Indeed, we, too, were once stupid, disobedient, and misled. We were slaves to many kinds of lusts and pleasures. We were mean and jealous. We were hated, and we hated each other."},{"num":4,"verse":"However, when God our Savior made his kindness and love for humanity appear, "},{"num":5,"verse":"he saved us, but not because of anything we had done to gain his approval. Instead, because of his mercy he saved us through the washing in which the Holy Spirit gives us new birth and renewal. "},{"num":6,"verse":"God poured a generous amount of the Spirit on us through Yeshua Christ our Savior. "},{"num":7,"verse":"As a result, God in his kindness has given us his approval and we have become heirs who have the confidence that we have everlasting life. "},{"num":8,"verse":"This is a statement that can be trusted. I want you to insist on these things so that those who believe in God can concentrate on setting an example by doing good things. This is good and helps other people."},{"header":"Advice for Titus"},{"num":9,"verse":"Avoid foolish controversies, arguments about genealogies, quarrels, and fights about Moses’ Teachings. This is useless and worthless. "},{"num":10,"verse":"Have nothing to do with people who continue to teach false doctrine after you have warned them once or twice. "},{"num":11,"verse":"You know that people like this are corrupt. They are sinners condemned by their own actions."},{"header":"Farewell"},{"num":12,"verse":"When I send Artemas or Tychicus to you, hurry to visit me in the city of Nicopolis. I have decided to spend the winter there. "},{"num":13,"verse":"Give Zenas the lawyer and Apollos your best support for their trip so that they will have everything they need."},{"num":14,"verse":"Our people should also learn how to set an example by doing good things when urgent needs arise so that they can live productive lives."},{"num":15,"verse":"Everyone with me sends you greetings. Greet our faithful friends."}]