[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Controversy.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A judicial suit, in which Jehovah is plaintiff as well as judge (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). By the “children of Israel” we are to understand the northern kingdom of the ten tribes, as distinguished from Judah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mercy.—Better rendered love. The Hebrew word chésed expresses (1) the love of God for Israel under covenant relationship; (2) the corresponding quality in man exhibited to God or towards his fellow-men. (See Hupfeld on Psalm 4:4; and Duhm, Theologie der Propheten, p. 100.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Mercy.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better rendered ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "love.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The Hebrew word ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "chésed",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " expresses (1) the love of God for Israel under covenant relationship; (2) the corresponding quality in man exhibited to God or towards his fellow-men. (See Hupfeld on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Duhm, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Theologie der Propheten,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " p. 100.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 4:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hear the word of the Lord, ye children of Israel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“The prophet here begins a third discourse, which is manifestly distinct from the preceding, both as to matter and manner. He was before predicting what should happen in future times, by way of prophetic vision; here he reproves those of the present time for such sins as then reigned among them; such as provoked God to send on them and their posterity the judgments foretold in the former chapter.” He seems to be addressing chiefly the Israelites of the ten tribes, though not exclusively, his reproofs and exhortations being so formed and expressed as to suit the case of the Jews also. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the Lord hath a controversy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ריב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a cause, contention, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or matter of debate. The LXX. render the word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κρισις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "judgment, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dispute; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and so the Vulgate. The expression is taken from the actions, or pleas, which one man brings against another, for injuries or damages received: so here God is represented as entering into judgment, or bringing a plea, or complaint, against the people of the ten tribes, for their injustice and other sins, as being so many injuries to his honour, for which he demands satisfaction. The other prophets bring the same charges against this people, as we find from their writings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because there is no truth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — No faithfulness in their minds, words, or works; they cover falsehood with fair words, till they can conveniently execute their designed frauds. It appears they had no sense of moral honesty; made no conscience of what they said or did, though never so contrary to uprightness, and injurious to their neighbours. Much less had they any sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mercy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or of the obligation they were under to help the indigent and necessitous. There was neither compassion nor beneficence among them; they neither pitied nor relieved any. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nor knowledge of God in the land — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Here we have the cause of their want of integrity and benevolence: they had not the true and saving knowledge of God, they were neither acquainted with him, nor with his will, and their own duty: hence they were destitute of true piety, and therefore also of true virtue. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-5 Hosea reproves for immorality, as well as idolatry. There was no truth, mercy, or knowledge of God in the land: it was full of murders, 2Ki 21:16. Therefore calamities were near, which would desolate the country. Our sins, as separate persons, as a family, as a neighbourhood, as a nation, cause the Lord to have a controversy with us; let us submit and humble ourselves before Him, that he may not go on to destroy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hear the word of the Lord, ye children of Israel - The prophet begins here, in a series of pictures as it were, to exhibit the people of Israel to themselves, that they might know that God did not do without cause all this which He denounced against them. Here, at the outset, He summons, the whole people, their prophets and priests, before the judgment seat of God, where God would condescend, Himself to implead them, and hear, if they had ought in their defense. The title \"children of Israel\" is, in itself, an appeal to their gratitude and their conscience, as the title \"Christian\" among us is an appeal to us, by Him whose name we bear. Our Lord says, \"If ye were Abraham's children, ye would do the work's of Abraham\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Paul, \"let every one that nameth the name of Christ, depart from iniquity\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the Lord hath a controversy - God wills, in all His dealings with us His creatures, to prove even to our own consciences, the righteousness of His judgments, so as to leave us without excuse. Now, through His servants, He shows people their unrighteousness and His justice; hereafter our Lord, the righteous Judge, will show it through the book of people's own consciences.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With the inhabitants of the land - God had given the land to the children of Israel, on account of the wickedness of these whom He drave out before them. He gave it to them \"that they might observe His statutes and keep His laws\" (Psalm 105 ult.). He had promised that His \"Eyes should always be upon it from the beginning of the year unto the end of the year\" Deuteronomy 11:12. This land, the scene of those former judgments, given to them on those conditions (see Deuteronomy 4:1, Deuteronomy 4:40; Deuteronomy 6:21-25, etc.), the land which God had given to them as their God, they had filled with iniquity.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With the inhabitants of the land - God had given the land to the children of Israel, on account of the wickedness of these whom He drave out before them. He gave it to them \"that they might observe His statutes and keep His laws\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 105",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ult.). He had promised that His \"Eyes should always be upon it from the beginning of the year unto the end of the year\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 11:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This land, the scene of those former judgments, given to them on those conditions (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 6:21-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.), the land which God had given to them as their God, they had filled with iniquity.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Because there is no truth, nor mercy - \"Truth and mercy\" are often spoken of, as to Almighty God. Truth takes in all which is right, and to which God has bound Himself; mercy, all beyond, which God does out of His boundless love. When God says of Israel, \"there is no truth nor mercy,\" He says that there is absolutely none of those two great qualities, under which He comprises all His own Goodness. \"There is no truth,\" none whatever, \"no regard for known truth; no conscience, no sincerity, no uprightness; no truth of words; no truth of promises; no truth in witnessing; no making good in deeds what they said in words.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor mercy - The word has a wide meaning; it includes all love of one to another, a love issuing in acts. It includes loving-kindness, piety to parents, natural affection, forgiveness, tenderness, beneficence, mercy, goodness. The prophet, in declaring the absence of this grace, declares the absence of all included under it. Whatever could be comprised under love, whatever feelings are influenced by love, of that there was nothing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor knowledge of God - The union of right knowledge and wrong practice is hideous in itself; and it must be especially offensive to Almighty God, that His creatures should know whom they offend, how they offend Him, and yet, amid and against their knowledge, choose that which displeases Him. And, on that ground, perhaps, He has so created us, that when our acts are wrong, our knowledge becomes darkened Romans 1:21. The \"knowledge of God\" is not merely to know some things of God, as that He is the Creator and Preserver of the world and of ourselves. To know things of God is not to know God Himself. We cannot know God in any respect, unless we are so far made like unto Him. \"Hereby do we know that we know Him, if we keep His commandments. He that saith, I know Him, and keepeth not His commandments, is a liar and the truth is not in him. Every one that loveth is born of' God, and knoweth God. He that loveth not, knoweth not God, for God is love\" 1 John 2:3-4; 1 John 4:7-8.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Nor knowledge of God - The union of right knowledge and wrong practice is hideous in itself; and it must be especially offensive to Almighty God, that His creatures should know whom they offend, how they offend Him, and yet, amid and against their knowledge, choose that which displeases Him. And, on that ground, perhaps, He has so created us, that when our acts are wrong, our knowledge becomes darkened ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The \"knowledge of God\" is not merely to know some things of God, as that He is the Creator and Preserver of the world and of ourselves. To know things of God is not to know God Himself. We cannot know God in any respect, unless we are so far made like unto Him. \"Hereby do we know that we know Him, if we keep His commandments. He that saith, I know Him, and keepeth not His commandments, is a liar and the truth is not in him. Every one that loveth is born of' God, and knoweth God. He that loveth not, knoweth not God, for God is love\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 2:3-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 4:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Knowledge of God being the gift of the Holy Spirit, he who hath not grace, cannot have that knowledge. A certain degree of speculative knowledge of God, a bad man may have, as Balaam had by inspiration, and the Pagan who, \"when they knew God, glorified Him not as God.\" But even this knowledge is not retained without love. Those who \"held the truth in unrighteousness\" ended (Paul says Romans 1:21, Romans 1:18, Romans 1:28) by corrupting it. \"They did not like to retain God in their knowledge, and so God gave them over to a reprobate,\" or undistinguishing mind, that they could not. Certainly, the speculative and practical knowledge are bound up together, through the oneness of the relation of the soul to God, whether in its thoughts of Him, or its acts toward Him. Wrong practice corrupts belief, as misbelief corrupts practice. The prophet then probably denies that there was any true knowledge of God, of any sort, whether of life or faith or understanding or love. Ignorance of God, then, is a great evil, a source of all other evils. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Knowledge of God being the gift of the Holy Spirit, he who hath not grace, cannot have that knowledge. A certain degree of speculative knowledge of God, a bad man may have, as Balaam had by inspiration, and the Pagan who, \"when they knew God, glorified Him not as God.\" But even this knowledge is not retained without love. Those who \"held the truth in unrighteousness\" ended (Paul says ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") by corrupting it. \"They did not like to retain God in their knowledge, and so God gave them over to a reprobate,\" or undistinguishing mind, that they could not. Certainly, the speculative and practical knowledge are bound up together, through the oneness of the relation of the soul to God, whether in its thoughts of Him, or its acts toward Him. Wrong practice corrupts belief, as misbelief corrupts practice. The prophet then probably denies that there was any true knowledge of God, of any sort, whether of life or faith or understanding or love. Ignorance of God, then, is a great evil, a source of all other evils. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 4",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ho 4:1-19. Henceforth the Prophet Speaks Plainly and without Symbol, in Terse, Sententious Propositions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In this chapter he reproves the people and priests for their sins in the interregnum which followed Jeroboam's death; hence there is no mention of the king or his family; and in Ho 4:2 bloodshed and other evils usual in a civil war are specified.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Israel—the ten tribes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "controversy—judicial ground of complaint (Isa 1:18; Jer 25:31; Mic 6:2).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "no … knowledge of God—exhibited in practice (Jer 22:16).God’s judgments against the sins of the people, Hosea 4:1-5, and of the priests, Hosea 4:6-11, and against their idolatry, Hosea 4:12-14. Judah is exhorted to take warning by Israel’s calamity, Hosea 4:15-19.  Hear;  attend, consider, and duly weigh: it is the hearing of the mind, as well as of the ear, is here required. The word of the Lord;  he that speaks is the great God, though the messenger be a man; the message is not man’s, but it is the word, the message of the sovereign, holy; just, and mighty Jehovah, who ever speaks most important things, things that respect our duty and safety. Ye children of Israel;  you of the ten tribes, with whose ancestors my covenant was made, who received the law by the disposition of angels, but have not kept it, you that have turned aside from your God to idols. The Lord;  who knoweth your sins, who hateth, threateneth, and will judge, and punish unless you repent, it is he that speaketh, and summoneth you to plead with him. Hath a controversy;  just matter of debate or arguing against you; you have wronged him, and he will right himself, yet so that he will be clear in his judgment, all shall see that the just Lord doth justly, and that this people’s sins are the cause of all their sufferings, that God doth not delight to afflict the children of men. With the inhabitants of the land;  who dwell in the cities and towns of Israel, divided from the house of David, and from the house of God; ye that dwell with idolatrous neighbours: it is not a few, but the generality of the inhabitants; it is the whole land I have an action against. There is no truth,  no faithfulness, in their minds, words, or works; they cover falsehood with fair words, till they may fitly execute their designed frauds. There is neither plain-heartedness nor constancy in their purposes and words. Nor mercy,  kindness or gentleness of mind; all are hardened, and restrain their bowels, which should be opened toward the indigent and necessitous. There is neither compassion nor beneficence among them, they pity not, nor relieve any. Nor knowledge of God;  all generally are ignorant, know not what God hath done for them, or what God is in himself, or what candour and truth, or what tenderness and beneficence, he requires in his word; if they have a slight knowledge of those things, yet they consider them not. They have rased the knowledge of God out of their minds. In the land: this speaks the universal ignorance, mercilessness, and unfaithfulness of that age. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "no … knowledge of God—exhibited in practice (Jer 22:16).God’s judgments against the sins of the people, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 4:1-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and of the priests, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 4:6-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and against their idolatry, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 4:12-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Judah is exhorted to take warning by Israel’s calamity, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea 4:15-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hear; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " attend, consider, and duly weigh: it is the hearing of the mind, as well as of the ear, is here required. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The word of the Lord; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he that speaks is the great God, though the messenger be a man; the message is not man’s, but it is the word, the message of the sovereign, holy; just, and mighty Jehovah, who ever speaks most important things, things that respect our duty and safety. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Ye children of Israel; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " you of the ten tribes, with whose ancestors my covenant was made, who received the law by the disposition of angels, but have not kept it, you that have turned aside from your God to idols. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The Lord; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " who knoweth your sins, who hateth, threateneth, and will judge, and punish unless you repent, it is he that speaketh, and summoneth you to plead with him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hath a controversy; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " just matter of debate or arguing against you; you have wronged him, and he will right himself, yet so that he will be clear in his judgment, all shall see that the just Lord doth justly, and that this people’s sins are the cause of all their sufferings, that God doth not delight to afflict the children of men. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "With the inhabitants of the land; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " who dwell in the cities and towns of Israel, divided from the house of David, and from the house of God; ye that dwell with idolatrous neighbours: it is not a few, but the generality of the inhabitants; it is the whole land I have an action against. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "There is no truth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " no faithfulness, in their minds, words, or works; they cover falsehood with fair words, till they may fitly execute their designed frauds. There is neither plain-heartedness nor constancy in their purposes and words. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Nor mercy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " kindness or gentleness of mind; all are hardened, and restrain their bowels, which should be opened toward the indigent and necessitous. There is neither compassion nor beneficence among them, they pity not, nor relieve any. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Nor knowledge of God; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " all generally are ignorant, know not what God hath done for them, or what God is in himself, or what candour and truth, or what tenderness and beneficence, he requires in his word; if they have a slight knowledge of those things, yet they consider them not. They have rased the knowledge of God out of their minds. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "In the land:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this speaks the universal ignorance, mercilessness, and unfaithfulness of that age. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hear the word of the Lord, ye children of Israel,.... The people of the ten tribes, as distinct from Judah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the prophet having finished his parables he was ordered to take up and deliver, and his explanations of them, and concluded with a gracious promise of the conversion of the Jews in the latter day, enters upon a new discourse, which begins with reproof for various sins; since what had been delivered in parables and types had had no effect upon them, they are called upon to hear what the Lord would say to them by the prophet, in more clear and express terms; silence is ordered, and attention required to what follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord hath a controversy with the inhabitants of the land; the land of Israel; against him they had sinned, before him they stood guilty; he had something, yea, many things, against them; a charge is brought into open court, the indictment is read, an answer must be made: God is the antagonist, that moves and brings on the controversy in a judicial way, and who can answer him for one of a thousand? or stand before him, or in court with him, when he marks iniquity? the charge is as follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because there is no truth; none that do or speak truth; that are true and faithful men, true to their word, and faithful to their trust; no truth of grace in them, nor truth of doctrine held and received by them; truth failed from among them, and none were valiant for it; no truth or civil faith with respect to men, nor any truth of word or worship with respect to God: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "nor mercy: to poor and indigent creatures; no compassion shown them; no offices of humanity or acts of beneficence exercised towards them; though these are more desirable by the Lord than, and are preferred by him to, all ceremonial sacrifices, Hosea 6:6, or no piety, religion, godliness, powerful godliness, which has the promise of this life, and that to come: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "nor mercy: to poor and indigent creatures; no compassion shown them; no offices of humanity or acts of beneficence exercised towards them; though these are more desirable by the Lord than, and are preferred by him to, all ceremonial sacrifices, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or no piety, religion, godliness, powerful godliness, which has the promise of this life, and that to come: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "nor knowledge of God in the land; in the land of Israel, where God was used to be known; where he had been worshipped; were his word had been dispensed, and his prophets had been sent, and his saints that knew him, and his mind and will, formerly had dwelt; but now a company of atheists, at least that lived as such, and had no true spiritual saving knowledge of God, and communion with him; they had not true love to him, nor a godly reverence of him, which this implies; and that was the source of all the wickedness committed by them, afterwards expressed. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"there are none that do truth, nor dispense mercy, nor walk in the fear of the Lord, in the land.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"there are none that do truth, nor dispense mercy, nor walk in the fear of the Lord, in the land.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Hear the word of the LORD, ye children of Israel: for the LORD {a} hath a controversy with the inhabitants of the land, because there is no truth, nor mercy, nor knowledge of God in the land.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hear the word of the LORD, ye children of Israel: for the LORD ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hath a controversy with the inhabitants of the land, because ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " no truth, nor mercy, nor knowledge of God in the land.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Because the people would not obey the admonitions of the Prophets, he accuses them before the judgment seat of God, against whom they chiefly offended; Isa 7:13 Zec 12:10 Mic 6:1,2.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye children of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The northern kingdom only is addressed (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 4:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the prophet turns aside to Judah).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord hath a controversy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Jehovah is both plaintiff and judge; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Isaiah 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no truth, nor mercy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ‘no truthfulness and no kindness.’ The Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "khesedh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " includes in its wide range of meaning[55] (1) the love of God to man, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (2) the love of man to God, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and (3) brotherly love, or the love of a man to his neighbour, as often. Here the context favours the last of these applications. St Jerome well describes the connexion between the two qualities,—‘nec veritas absque misericordiâ sustineri potest, et misericordia absque veritate facit negligentes, unde alterum miscendum est alteri’. In short, truth without love leads to hardness, love without truth to weakness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[55] On the Hebrew words for love, comp. Carl Abel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ueber den Begriff der Liebe in einigen alten und neuen Sprachen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Berlin, 1872, pp. 63.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nor knowledge of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This might well have been mentioned first. Moral practice is low, because the heart has no experience of God’s personal dealings with it (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The people are summoned to hear whereof Jehovah accuses them, viz. the universal prevalence of the most crying sins. The prophet assures them that this is the true cause of the physical calamity which is becoming more and more general in its range.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - A new and distinct division of the book commences with this fourth chapter and continues till the close. What had previously been presented in figure and symbol is now plainly and literally stated. The children of Israel are summoned in the first verse of this chapter to hear the charge preferred against them and the sentence pronounced. Having convened, as it were, a public assembly and cited the persons concerned, the prophet proceeds to show cause why they are bound to give an attentive hearing. In God's controversy with the people of the land the prophet acts as his ambassador, accusing the people of great and grievous sins, and vindicating the justice of God's judgments in their punishment. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ki",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with which the last clause of the verse commences may be either causal or recitative, and may thus specify either the ground or subject of controversy. It is commonly understood here in the former sense. Israel is charged with want of truth, mercy, and the knowledge of God. Kimchi comments on this controversy as follows: \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "With",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the inhabitants of the land of Israel I have a controversy, for I gave them the land on the condition that they should exercise righteousness and judgment, and on this condition I pledged myself to them that my eyes would be upon them from the beginning of the year to the end of the year. But since they practice the opposite  - cursing, lying, etc. - I also will act with them in a way contrary to what I assured them, and will hide my face from them.\" He adds, \"There were some righteous among them, but they were few, and they hid themselves from the face of the multitude who were wicked.\" Truth and mercy are at once Divine attributes and human virtues; it is in the latter sense, of course, that they are here employed. Truth includes works as well as words, doing as well as saying; it implies uprightness in speech and behavior - thorough integrity of character and conduct, Mercy goes beyond and supplements this. We sometimes say of such a one that he is an honest but a hard man. Mercy combined with truth, on the contrary, makes a man kind as well as honest, benevolent as well as upright. In a somewhat similar sense the apostle conjoins goodness and righteousness when he says, \"Scarcely for a righteous man will one die: yet peradventure for a good man some would even dare to die.\" The knowledge of God is the real root of these two virtues of truth and mercy. If we know God as he is in himself and as he stands in his relations to us, we shall conform our conduct to his character and our actions to his will. If we know God to be a God of truth, who delighteth in truth in the inward parts, we shall cultivate truth in our hearts, express it with our lips, and practice it in our lives. If we know God as a God of mercy, who has shown such boundless mercy to us in pardoning our multiplied and aggravated offences, we shall imitate that mercy in our relations to our fellow-man; nor shall we enact the part of the merciless man in the parable, who owed his lord ten thousand talents, and who, having nothing to pay, was freely forgiven the debt; but finding his fellow-servant, who owed him only an hundred pence, laid hands on him and took him by the throat, saying, \"Pay me that thou owest,\" and, deaf to that fellow-servant's supplications, east him into prison till he should pay the debt. The intimate connection of the knowledge of God with the virtues in question is confirmed by the Prophet Jeremiah, \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Did",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not thy father eat and drink, and do judgment and justice, and then it was well with him? he judged the cause of the poor and needy; then it was well with him: was not this to know me, saith the Lord?\" Hosea 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:1-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " form the first strophe, and contain, so to speak, the theme and the sum and substance of the whole of the following threatening of punishment and judgment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Hear the word of Jehovah, ye sons of Israel! for Jehovah has a controversy with the inhabitants of the land; for there is no truth, and no love, and no knowledge of God in the land.\" Israel of the ten tribes is here addressed, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " clearly shows. The Lord has a controversy with it, has to accuse and judge it (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), because truth, love, and the knowledge of God have vanished from the land. 'Emeth and chesed are frequently associated, not merely as divine attributes, but also as human virtues. They are used here in the latter sense, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"There is no 'ĕmeth, i.e., no truthfulness, either in speech or action, no one trusting another any more\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 9:3-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Chesed is not human love generally, but love to inferiors, and to those who need help or compassionate love. Truth and love are mutually conditions, the one of the other. \"Truth cannot be sustained without mercy; and mercy without truth makes men negligent; so that the one ought to be mingled with the other\" (Jerome). They both have their roots in the knowledge of God, of which they are the fruit (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for the knowledge of God is not merely \"an acquaintance with His nature and will\" (Hitzig), but knowledge of the love, faithfulness, and compassion of God, resting upon the experience of the heart. Such knowledge not only produces fear of God, but also love and truthfulness towards brethren (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 4:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). Where this is wanting, injustice gains the upper hand. ",
        "children": []
      }
    ]
  }
]