[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For lack",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "knowledge,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which you, O priest, should have kept alive in their hearts. The knowledge of God is life eternal. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The Lord’s “controversy” repudiates the entire priesthood, as they had rejected the true knowledge of God. They had inclined to calf-worship, had been vacillating respecting Baal, and had connived at moral offences. If, on the other hand, with most commentators, we consider the people themselves as thus addressed, the passage refers to the cessation of the position of priesthood, which every member of the true theocracy ought to have maintained. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The people should no longer be priests to Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 4:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My people are destroyed for lack of knowledge — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The ignorance of the nature, necessity, and excellence of true religion, which prevailed among the Jews and Israelites, was one principal cause of those sins which drew down such heavy judgments upon them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because thou hast rejected knowledge — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, wouldest not use the means of knowledge which thou hadst. “But this lack of knowledge in the people was, in a great measure, owing to the want of that constant instruction which they ought to have received from the priests. The mention of it, therefore, occasions a sudden transition from general threatenings to particular denunciations against the priesthood.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will also reject thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The high-priest for the time being, as the representative of the whole order, seems to be here addressed; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that thou shalt be no priest to me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“Since the person threatened was to be rejected from being a priest, he was priest at the time when he was threatened; otherwise he had not been a subject of rejection. The person threatened therefore must have been the head, for the time being, of the true Levitical priesthood, not of the intruded priesthood of Jeroboam. This is a proof, that the metropolis, threatened with excision is Jerusalem, not Samaria, and that the ten tribes exclusively are not the subject of this part of the prophecy.” — Bishop Horsley. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Seeing thou hast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forgotten the law of thy God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Hast neither desired nor endeavoured to understand, or retain it in thy mind, nor to transmit the knowledge and remembrance of it to posterity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will also forget thy children — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thy offspring, or the people whose priest thou art, and of whom thou oughtest to have taken a fatherly care; I will not look upon them any longer as the seed of Abraham, and children of my covenant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:6-11 Both priests and people rejected knowledge; God will justly reject them. They forgot the law of God, neither desired nor endeavoured to retain it in mind, and to transmit the remembrance to their posterity; therefore God will justly forget them and their children. If we dishonour God with that which is our honour, it will, sooner or later, be turned into shame to us. Instead of warning the people against sin, from the consideration of the sacrifices, which showed what an offence sin was to God, since it needed an atonement, the priests encouraged the people to sin, since atonement might be made at so small an expense. It is very wicked to be pleased with the sins of others, because they may turn to our advantage. What is unlawfully gained, cannot be comfortably used. The people and the priests hardened one another in sin; therefore justly shall they share in the punishment. Sharers in sin must expect to share in ruin. Any lust harboured in the heart, in time will eat out all its strength and vigour. That is the reason why many professors grow so heavy, so dull, so dead in the way of religion. They have a liking for some secret lust, which takes away their hearts.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My people are destroyed for lack of knowledge - \"My people are,\" not, \"is.\" This accurately represents the Hebrew . The word \"people\" speaks of them as a whole; are, relates to the individuals of whom that whole is composed. Together, the words express the utter destruction of the whole, one and all. They are destroyed \"for lack of knowledge,\" literally, \"of the knowledge,\" i. e., the only knowledge, which in the creature is real knowledge, that knowledge, of the want of which he had before complained, the knowledge of the Creator. So Isaiah mourns in the same words , \"therefore my people are gone into captivity, because they have no knowledge\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They are destroyed for lack of it, for the true knowledge of God is the life of the soul, true life, eternal life, as our Saviour saith, \"This is life eternal, that they should know Thee, the only true God, and Jesus Christ whom Thou has sent.\" The source of this lack of knowledge, so fatal to the people, was the willful rejection of that knowledge by the priest;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because thou hast rejected knowledge, I will also reject thee, that thou shalt be no priest to Me - God marks the relation between the sin and the punishment, by retorting on them, as it were, their own acts; and that with great emphasis, \"I will utterly reject thee . Those, thus addressed, must have been true priests, scattered up and down in Israel, who, in an irregular way, offered sacrifices for them, and connived at their sins. For God's sentence on them is, \"thou shalt be no priest to me.\" But the priests whom Jeroboam consecrated out of other tribes than Levi, were priests not to God, but to the calves. Those then, originally true priests to God, had probably a precarious livelihood, when the true worship of God was deformed by the mixture of the calf-worship, and the people \"halted between two opinions;\" and so were tempted by poverty also, to withhold from the people unpalatable truth. They shared, then, in the rejection of God's truth which they dissembled, and made themselves partakers in its suppression. And now, they \"despised, were disgusted\" with  the knowledge of God, as all do in fact despise and dislike it, who prefer ought besides to it. So God repaid their contempt to them, and took away the office, which, by their sinful connivances, they had hoped to retain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Seeing thou hast forgotten the law of thy God - This seems to have been the sin of the people. For the same persons could not, at least in the same stage of sin, despise and forget. They who despise or \"reject,\" must have before their mind that which they \"reject.\" To reject is willful, conscious, deliberate sin, with a high hand; to \"forget,\" an act of negligence. The rejection of God's law was the act of the understanding and will, forgetfulness of it comes from the neglect to look into it; and this, from the distaste of the natural mind for spiritual things, from being absorbed in things of this world, from inattention to the duties prescribed by it, or shrinking from seeing \"that\" condemned, which is agreeable to the flesh. The priests knew God's law and \"despised\" it; the people \"forgat\" it. In an advanced stage of sin, however, man may come to forget what he once despised; and this is the condition of the hardened sinner.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will also forget thy children - Literally, \"I will forget thy children, I too.\" God would mark the more, that His act followed on their's; they, first; then, He saith, \"I too.\" He would requite them, and do what it belonged not to His Goodness to do first. Parents who are careless as to themselves, as to their own lives, even as to their own shame, still long that their children should not be as themselves. God tries to touch their hearts, where they are least steeled against Him. He says not, \"I will forget thee,\" but I will forget those nearest thy heart, \"thy children.\" God is said to forget, when He acts, as if His creatures were no longer in His mind, no more. the objects of His providence and love. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I will also forget thy children - Literally, \"I will forget thy children, I too.\" God would mark the more, that His act followed on their's; they, first; then, He saith, \"I too.\" He would requite them, and do what it belonged not to His Goodness to do first. Parents who are careless as to themselves, as to their own lives, even as to their own shame, still long that their children should not be as themselves. God tries to touch their hearts, where they are least steeled against Him. He says not, \"I will forget thee,\" but I will forget those nearest thy heart, \"thy children.\" God is said to forget, when He acts, as if His creatures were no longer in His mind, no more. the objects of His providence and love. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. lack of knowledge—\"of God\" (Ho 4:1), that is, lack of piety. Their ignorance was wilful, as the epithet, \"My people,\" implies; they ought to have known, having the opportunity, as the people of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou—O priest, so-called. Not regularly constituted, but still bearing the name, while confounding the worship of Jehovah and of the calves in Beth-el (1Ki 12:29, 31).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will … forget thy children—Not only those who then were alive should be deprived of the priesthood, but their children who, in the ordinary course would have succeeded them, should be set aside.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My people:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the divorce was not yet issued out, the ten tribes yet were in some sense ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ammi. Are destroyed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not only in the prophetic style, are, because ere long they shall most certainly be destroyed, but in the course of the history it is plain in matter of fact; many of them were cut off by Pul king of Assyria, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and many were destroyed by the bloody and cruel tyranny of Menahem, and more were ruined in their estates by exactions and impositions. The civil wars, the seditions, the usurpations of some and the deposing of others, were things the prophet Hosea lived to see, and I believe speaks of here as things that had already destroyed many. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For lack of knowledge",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of God, his law, his menaces, his providences, and government of the world. Had they known his holy nature, his jealousy for his own glory, his hatred of sin and his power to punish it, had they known their God, they would either have forborne to sin, or repented of what sins they had committed, and so prevented his wrath. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because thou",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the prophet now turns his words from the people to the priests among them. The people’s ignorance was much from the ignorance and profane humour of their priests, and this the prophet doth tacitly charge on the priests, to whom he speaks as to one particular person: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who callest thyself, art accounted by the people, and goest under the name of a priest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hast rejected knowledge:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " strange perverseness! they who should direct others, who should be teachers, are and will be ignorant, will not know, reject knowledge; detestest to know, as the Chaldee paraphrase. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will also reject thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with equal dislike I will reject time, I will destroy your church constitution, and with that I will destroy your priesthood; and I will do this with detestation and abhorrence too. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou hast forgotten the law of thy God:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " O Israel, and you, O priests, you have all sinned together, slighted and disrespected the law, broken all the precepts of it, set up other gods, other worship, other priests than the law directs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will also forget; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will pay thee in thy own coin, I will forget, i. e. slight and disregard. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy children; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the people of Israel, the whole kingdom of the ten tribes; both those pretended priests and their ghostly children with them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My people are destroyed for lack of knowledge,.... This is not to be understood of those who are the Lord's people by special grace; for they cannot he destroyed, at least with everlasting destruction; God's love to them, his choice of them, covenant with them, the redemption of them by Christ, and the grace of God in them, secure them from such destruction: nor can they perish through want of knowledge; for though they are by nature as ignorant as others, yet it is the determinate will of God to bring them to the knowledge of the truth, in order to salvation; and that same decree which fixes salvation as the end, secures the belief of the truth as the means; and the covenant of grace provides for their knowledge of spiritual things, as well as other spiritual blessings; in consequence of which their minds are enlightened by the Spirit of wisdom and understanding, and they have the knowledge of God and Christ given them, which is life eternal. But this is to he understood of the people of the ten tribes of Israel, who were nationally and nominally the people of God, were so by profession; they called themselves the people of God; and though they were idolaters, yet they professed to worship God in their idols; and as yet God's \"loammi\" had not taken place upon them; he still sent his prophets among them, to reprove and reform them, and they were not as yet finally rejected by him, and cast out of their land. These may be said to be \"destroyed\", because they were threatened with destruction, and it was near at hand, they were just upon the brink of it; and because of the certainty of it, and this \"through the lack of knowledge\": either in the people, who were ignorant of God, his mind, and will, and worship, and without fear and reverence of him, which was the cause of all the abominations they ran into, for which they were threatened with ruin; or in the priests, whose business it was to teach and instruct the people; but instead of teaching them true doctrine, and the true, manner of worship, taught them false doctrine, and led them into superstition and idolatry; and so they perished through the default of the priests in performing their office; which sense is confirmed by what follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because thou hast rejected knowledge, I will also reject thee, that thou shall be no priest to me; the priests that Jeroboam made were of the lowest of the people, ignorant and illiterate men, 1 Kings 12:31 and they chose to continue such; they rejected with contempt and abhorrence, as the word signifies, the knowledge of God, and of all divine things; of the law of God, concerning what was to be done, or not to be done, by the people; and of all statutes and ordinances relating to divine worship, and the performance of the priestly office: and though there might be some of Aaron's line that continued in the land of Israel, and in their office; yet these affected the same ignorance, and therefore the Lord threatens them with a rejection from the priesthood; or, however, that they should be no priests to him, or in his account, but should be had in the utmost abhorrence and contempt, The word here used has a letter in it more than usual (s), which may signify the utter rejection of them, and the great contempt they were had in by the Lord; this was to take place, and did, at the captivity by Shalmaneser. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because thou hast rejected knowledge, I will also reject thee, that thou shall be no priest to me; the priests that Jeroboam made were of the lowest of the people, ignorant and illiterate men, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 12:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and they chose to continue such; they rejected with contempt and abhorrence, as the word signifies, the knowledge of God, and of all divine things; of the law of God, concerning what was to be done, or not to be done, by the people; and of all statutes and ordinances relating to divine worship, and the performance of the priestly office: and though there might be some of Aaron's line that continued in the land of Israel, and in their office; yet these affected the same ignorance, and therefore the Lord threatens them with a rejection from the priesthood; or, however, that they should be no priests to him, or in his account, but should be had in the utmost abhorrence and contempt, The word here used has a letter in it more than usual (s), which may signify the utter rejection of them, and the great contempt they were had in by the Lord; this was to take place, and did, at the captivity by Shalmaneser. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Seeing thou hast forgotten the law of thy God: which he had given them, who was their God by profession; and which they had forgot as if they never had read or learnt it; and so as not to observe and keep it themselves, nor teach and instruct others in it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will also forget thy children; have no regard to them, take no notice and care of them, as if they were never known by him; meaning either the people in general, their disciples and spiritual children; or else their natural children, who should be cut off, and not succeed them in the priesthood. The words are very emphatic, \"I will forget them, even I\" (t); which expresses the certainty of it more fully, as well as more clearly points at the justness of the retaliation. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(s)  the last is superfluous; the reason of the word being so written. Ben Melech confesses his ignorance of. (t)  \"etiam ego\", Pagninus, Montanus, Zanchius, Cocceius, Rivet, Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s)  the last is superfluous; the reason of the word being so written. Ben Melech confesses his ignorance of. (t)  \"etiam ego\", Pagninus, Montanus, Zanchius, Cocceius, Rivet, Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "My people are destroyed for lack of knowledge: because {f} thou hast rejected knowledge, I will also reject thee, that thou shalt be no priest to me: seeing {g} thou hast forgotten the law of thy God, I will also forget thy children.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "My people are destroyed for lack of knowledge: because ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thou hast rejected knowledge, I will also reject thee, that thou shalt be no priest to me: seeing ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thou hast forgotten the law of thy God, I will also forget thy children.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) That is, the priests will be cast off, because for lack of knowledge they are not able to execute their charge, and instruct others; De 33:3, Mal 2:7.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Meaning the whole body of the people, who were weary with hearing the word of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My people are destroyed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The prophet cannot escape, because the people is on the brink of ruin through the prophet’s fault. It is the perfect of prophetic certitude, ‘my people is already as good as destroyed.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for lack of knowledge",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] More precisely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "by reason of (their) lack of knowledge.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The ‘knowledge of God’ is meant (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 4:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou hast rejected knowledge",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is emphatically expressed in the Hebrew. ‘Knowledge’, viz. of God’s revealed will, was theoretically a deposit in the priestly order (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 44:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There is no reason to think that the ‘priest-people’ of Israel is addressed; there was no priest-people till after the return from exile.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forgotten … forget",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] To ‘forget’ what has been committed to one’s charge is the same as to ignore it. The penalty of the priests is not really distinct from that of the people (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 4:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); the priestly office could in no full sense be maintained in captivity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the law of thy God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘Thy God’, because the priest was specially ‘brought near’ to Jehovah. ‘The law’, Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tôrâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", will cover oral as well as written instructions (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 17:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but a later passage (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") shows that a written legislation existed in Hosea’s time. The contents of this may be presumed from Hosea’s language to have been, at any rate to a large extent, concerned with applications of religious morality.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy children",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. the members of the priestly caste; ‘thy brethren’ would be more consistent with the figure (comp. ‘thy mother’, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 4:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "My people are destroyed for lack of knowledge.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Here the verb is plural and its subject singular, because, being collective, it comprehends all the individual members of the nation. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כדמו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by Jerome in the sense of \"silence:\" \"conticuit populus incus,\" which he explains to mean \"sinking into eternal silence.\" So also the Chaldee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The LXX., understands it in the sense of \"likeness:\" \"My people are like (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὡμοιώθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as if they had no knowledge.\" Aben Ezra disproves this sense as follows: \"This word, if it were from the root signifying 'likeness,' would have after it ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "el",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seghol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as, 'To [",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "el",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seghol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] whom art thou like in thy greatness?' (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 31:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but without the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "el",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it has the meaning of ' cutting off.'\" So Kimchi: \"Here also it has the sense of  'cutting off.'\" The article before \"knowledge\" implies renewed mention and refers to the word in ver. 1; or it may emphasize the word as that knowledge by way of eminence, which surpasses all other knowledge, and without which no other knowledge can really prove a blessing in the end. The knowledge of God is the most excellent of all sciences. Paul counted all things but loss in comparison with its possession; and our blessed Lord himself says, \"This is life eternal, that they might know thee the only true God, and Jesus Christ, whom thou hast sent;\" while the Prophet Isaiah attributed the captivity to its absence: \"My people are gone into captivity because they have no knowledge.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Because thou hast rejected knowledge... seeing thou hast forgotten the Law of thy Son.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The cause of this ignorance is here charged on the unfaithfulness of the priesthood. They rejected knowledge and forgot the Law of their God. The two concluding clauses of this verse may be regarded as \"split members\" of a single sentence. As rejection implies the presence of the object rejected, while forgetfulness implies its absence from the mind or memory, some have understood rejection of knowledge as the sin of the priest, and forgetfulness that of the people. This separation is not necessary, for what men continue for a time to despise they will by-and-by forget. The forgetfulness is thus an advance upon rejection. The sin of these priests was very great, for, while the priests' lips were required to keep knowledge, they neither preserved that knowledge themselves nor promoted it among the people; hence the indignant and direct address. Thus Kimchi says: \"He addresses the priestly order that existed at that time: Thou hast rejected he knowledge for thyself and to teach it to the people, consequently I will reject thee from being a priest unto me. Since thou dost not exercise the office of priest, which is to teach the Law, I will reject thee so that thou shalt not be a priest in my house.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will also reject thee that thou shalt be no priest to me... I will also forget thy children, even I.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The punishment resembles the offence; the human delinquency is reflected in the Divine retaliation. To make this the more pointed, the \"thou on thy part (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "attah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")\" at the head of the sentence has its counterpart, or rather is counterbalanced by the \"even I\" or \"I too (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gam ani",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")\" at its close. The severity of the punishment is augmented by the threat that, not only the then existing priests, but their sons after them, would be excluded from the honor of the priesthood. This was touching painfully the tenderest part. It needs scarcely be observed that forgetfulness is only spoken of God in a figurative sense, and after the manner of men, that being forgotten which is no longer the object of attention or affection. \"The meaning of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אשׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" says Kimchi, \"is by way of figure, like the man who forgets something and does not take it to heart.\" The unusual form ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אֶמְאָסְאָך",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has been variously accounted for. The Massorites mark the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "aleph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " before ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "caph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as redundant; it is omitted in several manuscripts of Kennicott and De Rossi, as also some of the early printed editions. Kimchi confesses his ignorance of its use. Olshausen treats it as a copyist's error; but Ewald \"regards it as an Aram-seen pausal form.\" Some take the reference to be to Israel as a kingdom of priests (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") rather than to the actual priesthood. Hosea 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This thought is carried out still further in the second strophe, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:6-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"My nation is destroyed for lack of knowledge; for thou, the knowledge hast thou rejected, and so do I reject thee from being a priest to me. Thou didst forget the law of thy God; thy sons will I also forget.\" The speaker is Jehovah: my nation, that is to say, the nation of Jehovah. This nation perishes for lack of the knowledge of God and His salvation. Hadda‛ath (the knowledge) with the definite article points back to da‛ath Elōhı̄m (knowledge of God) in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This knowledge Israel might have drawn from the law, in which God had revealed His counsel and will (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but it would not. It rejected the knowledge and forgot the law of its God, and would be rejected and forgotten by God in consequence. In 'attâh (thou) it is not the priests who are addressed - the custodians of the law and promoters of divine knowledge in the nation - but the whole nation of the ten tribes which adhered to the image-worship set up by Jeroboam, with its illegal priesthood (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:26-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in spite of all the divine threats and judgments, through which one dynasty after another was destroyed, and would not desist from this sin of Jeroboam. The Lord would therefore reject it from being priest, i.e., would deprive it of the privilege of being a priestly nation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), would strip it of the privilege of being a priestly nation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), would strip it of its priestly rank, and make it like the heathen. According to Olshausen (Heb. Gram. p. 179), the anomalous form אמאסאך is only a copyist's error for אמאסך; but Ewald (247, e) regards it as an Aramaean pausal form. \"Thy sons,\" the children of the national community, regarded as a mother, are the individual members of the nation. ",
        "children": []
      }
    ]
  }
]