[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The second woe . . .—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Translate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The second woe is past",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (Omit the word “and,” which weakens the proclamation.) The eagle flying in mid-heaven had announced the three woe trumpets. A voice now reminds us that two of these had passed, just as at the close of the fifth trumpet a voice proclaimed that the first woe was past. We must remember, too, that the angel which descended from heaven declared that the end should not be delayed beyond the sounding of the seventh trumpet; the last woe trumpet, therefore, is the trumpet which will usher in the closing woe and the finishing of the mystery of God. Whatever view we adopt concerning the interpretation of the Apocalypse must be governed by the plainly declared fact that the seventh trumpet brings us to the very end. The next verse only serves to make this plainer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:14-19 Before the sounding of the seventh and last trumpet, there is the usual demand of attention. The saints and angels in heaven know the right of our God and Saviour to rule over all the world. But the nations met God's wrath with their own anger. It was a time in which he was beginning to reward his people's faithful services, and sufferings; and their enemies fretted against God, and so increased their guilt, and hastened their destruction. By the opening the temple of God in heaven, may be meant, that there was a more free communication between heaven and earth; prayer and praises more freely and frequently going up, graces and blessings plentifully coming down. But it rather seems to refer to the church of God on earth. In the reign of antichrist, God's law was laid aside, and made void by traditions and decrees; the Scriptures were locked up from the people, but now they are brought to the view of all. This, like the ark, is a token of the presence of God returned to his people, and his favour toward them in Jesus Christ, as the Propitiation for their sins. The great blessing of the Reformation was attended with very awful providences; as by terrible things in righteousness God answered the prayers presented in his holy temple now opened.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The second woe is past - That is, the second of the three that were announced as yet to come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And, behold, the third woe cometh quickly - The last of the series. The meaning is, that what was signified by the third \"woe\" would be the next, and final event, in order. On the meaning of the word \"quickly,\" see the notes on Revelation 1:1; compare Revelation 2:5, Revelation 2:16; Revelation 3:11; Revelation 22:7, Revelation 22:12, Revelation 22:20.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And, behold, the third woe cometh quickly - The last of the series. The meaning is, that what was signified by the third \"woe\" would be the next, and final event, in order. On the meaning of the word \"quickly,\" see the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In reference now to the important question about the application of this portion of the Book of Revelation, it need hardly be said that the greatest variety of opinion has prevailed among expositors. It would be equally unprofitable, humiliating, and discouraging to attempt to enumerate all the opinions which have been held; and I must refer the reader who has any desire to become acquainted with them to Poole's Synopsis, in loco, and to the copious statement of Prof. Stuart, Cove. vol. 2, pp. 219-227. Prof. Stuart himself supposes that the meaning is, that \"a competent number of divinely-commissioned and faithful Christian witnesses, endowed with miraculous powers, should bear testimony against the corrupt Jews, during the last days of their commonwealth, respecting their sins; that they should proclaim the truths of the gospel; and that the Jews by destroying them, would bring upon themselves an aggravated and an awful doom,\" 2:226. Instead of attempting to examine in detail the opinions which have been held, I shall rather state what seems to me to be the fair application of the language used, in accordance with the principles pursued thus far in the exposition. The inquiry is, whether there have been any events to which this language is applicable, or in reference to which, if it be admitted that it was the design of the Spirit of inspiration to describe them, it may be supposed that such language would be employed as we find here.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In this inquiry it may be assumed that the preceding exposition is correct, and the application now to be made must accord with that - that is, it must be found that events occurred in such times and circumstances as would be consistent with the supposition that that exposition is correct. It is to be assumed, therefore, that Revelation 9:20-21, refers to the state of the ecclesiastical world after the conquest of Constantinople by the Turks, and previous to the Reformation; that Revelation 10:1-11 refers to the Reformation itself; that Revelation 11:1-2, refers to the necessity, at the time of the Reformation, of ascertaining what was the true church, of reviving the Scripture doctrine respecting the atonement and justification, and of drawing correct lines as to membership in the church. All this has reference, according to this interpretation, to the state of the church while the papacy would have the ascendency, or during the twelve hundred and sixty years in which it would trample down the church as if the holy city were in the hands of the Gentiles. Assuming this to be the correct exposition, their what is here said Revelation 11:3-13 must relate to that period, for it is with reference to that same time - the period of \"a thousand two hundred and threescore days,\" or twelve hundred and sixty years - that it is said Revelation 11:3 the witnesses would \"prophesy,\" \"clothed in sackcloth.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In this inquiry it may be assumed that the preceding exposition is correct, and the application now to be made must accord with that - that is, it must be found that events occurred in such times and circumstances as would be consistent with the supposition that that exposition is correct. It is to be assumed, therefore, that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 9:20-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", refers to the state of the ecclesiastical world after the conquest of Constantinople by the Turks, and previous to the Reformation; that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:1-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " refers to the Reformation itself; that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", refers to the necessity, at the time of the Reformation, of ascertaining what was the true church, of reviving the Scripture doctrine respecting the atonement and justification, and of drawing correct lines as to membership in the church. All this has reference, according to this interpretation, to the state of the church while the papacy would have the ascendency, or during the twelve hundred and sixty years in which it would trample down the church as if the holy city were in the hands of the Gentiles. Assuming this to be the correct exposition, their what is here said ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:3-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " must relate to that period, for it is with reference to that same time - the period of \"a thousand two hundred and threescore days,\" or twelve hundred and sixty years - that it is said ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the witnesses would \"prophesy,\" \"clothed in sackcloth.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "If this be so, then what is here stated Revelation 11:3-13 must be supposed to occur during the ascendency of the papacy, and must mean, in general, that during that long period of apostasy, darkness, corruption, and sin, there would be faithful witnesses for the truth, who, though they were few in number, would be sufficient to keep up the knowledge of the truth on the earth, and to bear testimony against the prevailing errors and abominations. The object of this portion of the book, therefore, is to describe the character of the faithful witnesses for the truth during this long period of darkness; to state their influence; to record their trials; and to show what would he the ultimate result in regard to them, when their \"testimony\" should become triumphant. This general view will be seen to accord with the exposition of the previous portion of the book, and will be sustained, I trust, by the more particular inquiry into the application of the passage to which I now proceed. The essential points in the passage Revelation 11:3-13 respecting the \"witnesses\" are six:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If this be so, then what is here stated ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:3-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " must be supposed to occur during the ascendency of the papacy, and must mean, in general, that during that long period of apostasy, darkness, corruption, and sin, there would be faithful witnesses for the truth, who, though they were few in number, would be sufficient to keep up the knowledge of the truth on the earth, and to bear testimony against the prevailing errors and abominations. The object of this portion of the book, therefore, is to describe the character of the faithful witnesses for the truth during this long period of darkness; to state their influence; to record their trials; and to show what would he the ultimate result in regard to them, when their \"testimony\" should become triumphant. This general view will be seen to accord with the exposition of the previous portion of the book, and will be sustained, I trust, by the more particular inquiry into the application of the passage to which I now proceed. The essential points in the passage ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:3-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " respecting the \"witnesses\" are six:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) who are meant by the witnesses;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) the war made on them;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) their death;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) their resurrection;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) their reception into heaven; and,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) the consequences of their triumph in the calamity that came upon the city.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I. Who are meant by the witnesses, Revelation 11:3-6. There are several specifications in regard to this point which it is necessary to notice:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Who are meant by the witnesses, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:3-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There are several specifications in regard to this point which it is necessary to notice:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The fact that, during this long period of error, corruption, and sin, there were those who were faithful witnesses for the truth - people who opposed the prevailing errors; who maintained the great doctrines of the Christian faith; and who were ready to lay down their lives in defense of the truth. For a full confirmation of this it would be necessary to trace the history of the church down from the rise of the papal power through the long lapse of the subsequent ages; but such an examination would be far too extensive for the purpose contemplated in these notes, and, indeed, would require a volume by itself. Happily, this has already been done; and all that is necessary now is to refer to the works where the fact here affirmed has been abundantly established. In many of the histories of the church - Mosheim, Neander, Milner, Milman, Gieseler - most ample proof may be found, that amidst the general darkness and corruption there were those who faithfully adhered to the truth as it is in Jesus, end who, amidst many sufferings, bore their testimony against prevailing errors. The investigation has been made, also, with special reference to an illustration of this passage, by Mr. Elliott, Hover Apoca. vol. 2, pp. 193-406; and although it must be admitted that some of the details are of doubtful applicability, yet the main fact is abundantly established, that during that long period there were \"witnesses\" for the pure truths of the gospel, and a faithful testimony borne against the abominations and errors of the papacy. These \"witnesses\" are divided by Mr. Elliott into:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) the earlier Western witnesses - embracing such men, and their followers, as Serenus, bishop of Marseilles; the Anglo-Saxon church in England ; Agobard, Archbishop of Lyons from 810 to 841 a.d., on the one side of the Alps, and Claude of Turin on the other; Gotteschalcus, 884 a.d.; Berenger, Arnold of Brescia, Peter de Bruys, and his disciple Henry, and then the Waldenses.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. The second woe—that under the sixth trumpet (Re 9:12-21), including also the prophecy, Re 11:1-13: Woe to the world, joy to the faithful, as their redemption draweth nigh.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the third woe cometh quickly—It is not mentioned in detail for the present, until first there is given a sketch of the history of the origination, suffering, and faithfulness of the Church in a time of apostasy and persecution. Instead of the third woe being detailed, the grand consummation is summarily noticed, the thanksgiving of the twenty-four elders in heaven for the establishment of Christ's kingdom on earth, attended with the destruction of the destroyers of the earth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The second woe is past; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, here endeth the misery that is like to come upon the world in that period of time which shall follow the sounding of the sixth trumpet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And, behold, the third woe cometh quickly:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "third woe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " signifies those calamities which should come in that period of time prophesied of by the sounding of the seventh trumpet; this makes a late learned author think that all that which went before, viz. the Gentiles treading down the outward court, the slaying of the witnesses, and their resuscitation, must be under the sixth trumpet; which period endeth not until the church’s enemies be ready to be destroyed; whose destruction is afterwards opened to us in the angels pouring out their vials. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The second woe is past,.... Not in John's time, only in a visionary way; the meaning is, that the second woe trumpet, which is the sixth, will now have done sounding, when the four angels, bound in the river Euphrates, shall have been loosed, and they, with their horsemen, shall have done what they were designed to do; when the two witnesses shall have been slain, and are raised again, and ascended to heaven; and the things attending, or following thereon, as the earthquake, and slaughter, and the conversions of men, are accomplished. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And behold the third woe cometh quickly; immediately, upon the passing of the other; namely, the sounding of the seventh trumpet, as follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And behold the third woe cometh quickly; immediately, upon the passing of the other; namely, the sounding of the seventh trumpet, as follows. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{26} The second woe is past; and, behold, the third woe cometh quickly.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{26}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The second woe is past; ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", behold, the third woe cometh quickly.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(26) He passes to the second history, which is the second part of this chapter. John calls these the second and third woe, see Re 9:12.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The second woe is past",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Having included the plagues inflicted by the two prophets, as well as the invasion of the terrible horsemen of chap. 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the third woe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In what does this consist? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Perhaps",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we are to see the answer in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : but at any rate we have an instance of the way that, throughout this book, the last member of each series of signs disappoints us; we think (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that the end of all things is come, but instead a new series begins.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἡ οὐαὶ ἡ δευτέρα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the second woe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This, according to D. Lange, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "designates the period of the rage of antichrist, consisting",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of 42 months. Comm. Ap. f. 221. But the four angels in the Euphrates plainly brought on the second woe. See Erkl. Offenb. p. 73, etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The second woe is past.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The full description of this woe occupies ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:13-11:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The account describes the natural spiritual punishment which is inflicted upon men in consequence of their sins (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:13-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This is insufficient to lead men to avert the final judgment by timely repentance. We have then a further description of God's long suffering, and the rejection of his mercy, accompanied by an assurance of the safety of the faithful (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:1-11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This brings us to the end of the world (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:11-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), just as the sixth seal led to the same termination (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:12-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and both are followed by the seventh, which gives a reference to the eternal peace of heaven. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And, behold, the third woe cometh quickly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Omit \"and.\" It is not said, in the case of the other \"woes,\" that they come ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "quickly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In his description of the preservation and glorification of the Church under the form of the \"witnesses,\" the writer had been led to anticipate in some degree what follows under the seventh trumpet. Thus the seventh comes ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "quickly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " When events have progressed so far that the faithful Church is ascended to heaven with her Lord, then immediate]y follows the eternal rest set forth under the seventh trumpet. But this period is described as \"the third woe,\" because it is the period of time final punishment of the wicked; and it is the judgment of the ungodly which is the theme of the trumpet visions, although mention is incidentally made of the preservation and reward of the just. This is the time foretold in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Just as in the case of the seals, the period of the seventh seal is recorded but not described, so here, in the case of the seventh trumpet, its advent is recorded, and its nature is indicated in ver. 18, but no further description is given of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "woe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; only a slight reference to the bliss of those who are secure in heaven. Thus St. John does not attempt a complete picture of either the blessings of heaven or the woes of hell. Revelation 11:14",
        "children": []
      }
    ]
  }
]