[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3-14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Two ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "WITNESSES.—It is the opinion of one able and pre-eminently painstaking commentator that “no solution has ever been given of this portion of the prophecy.” I quote this that none may be disappointed when no satisfactory solution is given here; further light in the knowledge of the Bible, and the light of history, and, above all, the aid of the Holy Spirit, may show what the real solution is. At present it is best to lay down the lines which seem to lead in the direction of such a solution. First, the aim of the present vision must be kept in mind; and secondly, the vision in Zechariah (Zechariah 4, all), on which this is professedly built, must be remembered. Now the aim of our present vision seems to be to explain that in the great progress towards victory the Church itself will suffer through corruptions and worldliness, but that the true Temple—the kernel, so to speak, of the Church—will be unharmed and kept safe in her Master’s hands. But the position of this hidden and enshrined Church will not be one of idle security; in that Temple will be reared in secret, as the rightful king Josiah was, those who will witness undaunted and undefiled for their Lord; throughout the whole of that chequered period of profanation and pain there will never be wanting true witnesses for righteousness and faith. To assure the sacred seer that this would be the ease, to exhibit the nature of their work and its results, is the apparent aim of the vision. If this be so, the witnesses can scarcely be literal individual men, though it is true that many literal individual men have played the part of these witnesses. Turning to the foundation vision in Zechariah, we find that the vision there is designed to encourage the weak and restored exiles in their work of rebuilding the Temple; they are shown that, weak as they are, there is a hidden strength, like a sacred stream of oil, which can make them triumph over all their difficulties: not by might or power, but by God’s Spirit, the mountain would become a plain (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 4:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and “Grace! Grace!” would be the triumphant shout when the headstone of the Temple was raised. In both visions, then, our minds are turned to the hidden sources of divine strength; there is a safe and secret place measured off by God, where He gives His children strength—not of ordinary might or power, but strength of grace. This is the grace which made Zerubbabel and Joshua strong to achieve their work; this is the grace which can make the two witnesses strong to do their part in the building of that more glorious spiritual temple which is built on the foundation of Apostles and prophets, Jesus Christ Himself being the chief corner-stone. The witnesses, then, stand as the typical representatives of those who, in the strength of God, have, through the long ages, borne witness for Christ against all wrong and falsehood, against a world in arms or a Church in error, or against a nominal Christianity in danger of becoming as corrupt and as cruel as heathenism. Such witnesses stand, like the two columns Jachin and Boaz, before the true Temple of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) And I will give . . .—Translate, And I will give (omit “power”) to my two witnesses, and they shall . . . These are the words of God Himself; the omission of the words “and the angel stood” from Revelation 11:1 prevents any confusion of thought on this point. Two witnesses were required for competent evidence (Deuteronomy 17:6; Deuteronomy 19:15, et al.), and there has constantly been a sending forth of God’s chosen messengers in pairs— Moses and Aaron, Elijah and Elisha, besides Joshua and Zerubbabel, alluded to by Zechariah; and in New Testament times our Lord sent forth His disciples “two and two,” as afterwards Paul and Barnabas, or Paul and Silas, went forth to preach. There is, besides the mere mutual support which two can give, a need for the association of two different characters in the same sort of work: the energy and the sympathy, the elucidator of doctrines and the messenger to the conscience, the apologist and the evangelist, the man of thought and the man of action, the Son of Thunder and the Son of Consolation; it is well that in a world-wide work this duality of power should be brought into play. The witnesses prophesy: the word prophesy must surely be allowed a much wider meaning than merely to predict or foretell future events. The compass of their work, as described afterwards, embraces much more than this (see Revelation 11:5-7): they work wonders, showing tokens that remind us of the days of Moses and Aaron; their words are mighty; their life is a testimony.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "I ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "will give . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Translate, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "And I will give",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (omit “power”) ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "to my two witnesses",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and they shall .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " . . These are the words of God Himself; the omission of the words “and the angel stood” from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prevents any confusion of thought on this point. Two witnesses were required for competent evidence (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 19:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "et al.),",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and there has constantly been a sending forth of God’s chosen messengers in pairs— Moses and Aaron, Elijah and Elisha, besides Joshua and Zerubbabel, alluded to by Zechariah; and in New Testament times our Lord sent forth His disciples “two and two,” as afterwards Paul and Barnabas, or Paul and Silas, went forth to preach. There is, besides the mere mutual support which two can give, a need for the association of two different characters in the same sort of work: the energy and the sympathy, the elucidator of doctrines and the messenger to the conscience, the apologist and the evangelist, the man of thought and the man of action, the Son of Thunder and the Son of Consolation; it is well that in a world-wide work this duality of power should be brought into play. The witnesses ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "prophesy",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": the word prophesy must surely be allowed a much wider meaning than merely to predict or foretell future events. The compass of their work, as described afterwards, embraces much more than this (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:5-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): they work wonders, showing tokens that remind us of the days of Moses and Aaron; their words are mighty; their life is a testimony.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Their prophesying, or witnessing, extends over forty and two months: a symbolical period, as we have seen, but a period corresponding to that during which other witnesses had witnessed for God. Thus long did Elijah bear witness, under rainless heavens, against the idolatries of Israel; thus long did a greater than Elijah offer the water of life to the Jews, and witness against the hard, unspiritual, worldly religionism of the Pharisee and Sadducee; thus, too, must the witnesses, for God bear testimony during the period that the world- power seems dominant. They are clad in sackcloth— the emblem of mourning (2Kings 6:30; Jonah 3:4) adopted by the prophets, whose God-taught hearts saw reasons for mourning where shallower minds saw none (Isaiah 20:2, and Zechariah 13:2). Compare the garb of Elijah and John the Baptist (2Kings 1:8, and Matthew 3:4), whose very apparel and appearance were designed to testify against the evils they saw. “The special witnesses of God, in a luxurious and self-pleasing age, are often marked out from the world by signs of self-denial, of austerity, and even of isolation” (Dr. Vaughan).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Their prophesying, or witnessing, extends over forty and two months: a symbolical period, as we have seen, but a period corresponding to that during which other witnesses had witnessed for God. Thus long did Elijah bear witness, under rainless heavens, against the idolatries of Israel; thus long did a greater than Elijah offer the water of life to the Jews, and witness against the hard, unspiritual, worldly religionism of the Pharisee and Sadducee; thus, too, must the witnesses, for God bear testimony during the period that the world- power seems dominant. They are clad in sackcloth— the emblem of mourning (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 6:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") adopted by the prophets, whose God-taught hearts saw reasons for mourning where shallower minds saw none (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 20:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 13:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Compare the garb of Elijah and John the Baptist (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), whose very apparel and appearance were designed to testify against the evils they saw. “The special witnesses of God, in a luxurious and self-pleasing age, are often marked out from the world by signs of self-denial, of austerity, and even of isolation” (Dr. Vaughan).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 11:3-6. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:3-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I will give power unto my two witnesses ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Here God promises to raise up some true and faithful witnesses to preach and protest against the innovations and inventions which he foresaw would corrupt Christianity, especially in the western parts of Europe. “Of these witnesses,” says Bishop Newton, “there should be, though but a small, yet a competent number; and it was a sufficient reason for making them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two witnesses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "because that is the number required by the law, and approved by the gospel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 19:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 18:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and upon former occasions two have often been joined in commission, as Moses and Aaron in Egypt, Elijah and Elisha in the apostacy of the ten tribes, and Zerubbabel and Joshua after the Babylonish captivity, to whom these witnesses are particularly compared. Our Saviour himself sent forth his disciples, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two and two; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and it hath been observed also that the principal reformers have usually appeared, as it were, in pairs; as the Waldenses and Albigenses, John Huss and Jerome of Prague, Luther and Calvin, Cranmer and Ridley, and their followers. Not that I conceive that any two particular men, or two particular churches, were intended by this prophecy; but only that there should be some in every age, though but a few in number, who should bear witness to the truth, and declare against the iniquity and idolatry of their times. They should not be discouraged even by persecution and oppression, but, though ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "clothed in sackcloth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and living in a mourning and afflicted state, should yet ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prophesy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Should yet preach the sincere word of God, and denounce the divine judgments against the reigning idolatry and wickedness: and this they should continue to do, as long as the grand corruption itself should last, for the space of twelve hundred and sixty ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "days, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which is the same space of time with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the forty and two months, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "before mentioned, the period assigned for the tyranny and idolatry of the Church of Rome. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "witnesses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "therefore, cannot be any two men, or any two churches, but must be a succession of men, and a succession of churches.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A character is then given of these witnesses, and of the power and effect of their preaching. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "These are the two olive-trees, and the two candlesticks,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — That is, they, like Zerubbabel and Joshua, (Zechariah 4.,) are the great instructers and enlighteners of the church. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fire proceedeth out of their mouth, and devoureth their enemies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — That is, they are like unto Moses and Elijah, (Numbers 16.; 2 Kings 1.,) who called for fire upon their adversaries. But their fire was real, this is symbolical, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "proceedeth out of ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mouth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of the witnesses, denouncing the divine vengeance on the corrupters and opposers of true religion; much in the same manner as it was said to Jeremiah, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will make my words in thy mouth fire, and this people wood, and it shall devour them. These have power to shut heaven, that it rain not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — That is, they are like Elijah, who foretold a want of rain in the days of Ahab, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 17:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 5:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and it rained not on the earth for the space of three years and six months, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which, mystically understood, is the same space of time as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the forty and two months, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "twelve hundred and sixty days, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which are allotted for the prophesying of the witnesses. During this time the divine protection and blessing shall be withheld from those men who neglect and despise their preaching and doctrine. They ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "also ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "power over the waters, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That is, they are like Moses and Aaron, who inflicted these plagues on Egypt; and they may be said to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "smite the earth with ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "plagues ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which they denounce; for, in Scripture language, the prophets are often said to do those things which they declare and foretel. But it is most highly probable that these particulars will receive a more literal accomplishment when the plagues of God, and the vials of his wrath (chap. 16.) shall be fully poured out upon men, in consequence of their having so long resisted the testimony of the witnesses. Their cause and the cause of truth will finally be avenged on all their enemies.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:3-13 In the time of treading down, God kept his faithful witnesses to attest the truth of his word and worship, and the excellence of his ways, The number of these witnesses is small, yet enough. They prophesy in sackcloth. It shows their afflicted, persecuted state, and deep sorrow for the abominations against which they protested. They are supported during their great and hard work, till it is done. When they had prophesied in sackcloth the greatest part of 1260 years, antichrist, the great instrument of the devil, would war against them, with force and violence for a time. Determined rebels against the light rejoice, as on some happy event, when they can silence, drive to a distance, or destroy the faithful servants of Christ, whose doctrine and conduct torment them. It does not appear that the term is yet expired, and the witnesses are not a present exposed to endure such terrible outward sufferings as in former times; but such things may again happen, and there is abundant cause to prophesy in sackcloth, on account of the state of religion. The depressed state of real Christianity may relate only to the western church. The Spirit of life from God, quickens dead souls, and shall quicken the dead bodies of his people, and his dying interest in the world. The revival of God's work and witnesses, will strike terror into the souls of his enemies. Where there is guilt, there is fear; and a persecuting spirit, though cruel, is a cowardly spirit. It will be no small part of the punishment of persecutors, both in this world, and at the great day, that they see the faithful servants of God honoured and advanced. The Lord's witnesses must not be weary of suffering and service, nor hastily grasp at the reward; but must stay till their Master calls them. The consequence of their being thus exalted was a mighty shock and convulsion in the antichristian empire. Events alone can show the meaning of this. But whenever God's work and witnesses revive, the devil's work and witnesses fall before him. And that the slaying of the witnesses is future, appears to be probable.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will give power unto my two witnesses - In respect to this important passage ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:3-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I propose to pursue the same method which I have pursued all along in this exposition: first, to examine the meaning of the words and phrases in the symbol, with a purpose to ascertain the fair signification of the symbols; and, secondly, to inquire into the application - that is, to inquire whether any events have occurred which, in respect to their character and to the time of their occurrence, can be shown to be a fair fulfillment of the language.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And I will give power - The word \"power\" is not in the original. The Greek is simply, \"I will give\" - that is, I will grant to my two witnesses the right or the power of prophesying during the time specified - correctly expressed in the margin, \"give unto my two witnesses that they may prophesy.\" The meaning is not that he would send two witnesses to prophesy, but rather that these were in fact such \"witnesses,\" and that he would during that time permit them to exercise their prophetic gifts, or give them the privilege and the strength to enunciate the truth which they were commissioned to communicate as his \"witnesses\" to mankind. Some word, then, like \"power, privilege, opportunity, or boldness,\" it is necessary to supply in order to complete the sense.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Unto my two witnesses - The word \"two\" evidently denotes that the number would be small; and yet it is not necessary to confine it literally to two persons, or to two societies or communities. Perhaps the meaning is, that as, under the law, two witnesses were required, and were enough, to establish any fact (notes on John 8:17), such a number would during those times be preserved from apostasy as would be sufficient to keep up the evidence of truth; to testify against the prevailing abominations, errors, and corruptions; to show what was the real church, and to bear a faithful witness against the wickedness of the world. The law of Moses required that there should be two witnesses on a trial, and this, under that law, was deemed a competent number. See Numbers 35:30; Deuteronomy 17:6; Deuteronomy 19:15; Matthew 18:16; John 5:30-33. The essential meaning of this passage then is, that there would be \"a competent number\" of witnesses in the case; that is, as many as would be regarded as sufficent to establish the points concerning which they would testify, with perhaps the additional idea that the number would be small.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Unto my two witnesses - The word \"two\" evidently denotes that the number would be small; and yet it is not necessary to confine it literally to two persons, or to two societies or communities. Perhaps the meaning is, that as, under the law, two witnesses were required, and were enough, to establish any fact (notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), such a number would during those times be preserved from apostasy as would be sufficient to keep up the evidence of truth; to testify against the prevailing abominations, errors, and corruptions; to show what was the real church, and to bear a faithful witness against the wickedness of the world. The law of Moses required that there should be two witnesses on a trial, and this, under that law, was deemed a competent number. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 19:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 18:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 5:30-33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The essential meaning of this passage then is, that there would be \"a competent number\" of witnesses in the case; that is, as many as would be regarded as sufficent to establish the points concerning which they would testify, with perhaps the additional idea that the number would be small.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There is no reason for limiting it strictly to two persons, or for supposing that they would appear in pairs, two and two; nor is it necessary to suppose that it refers particularly to two people or nations. The word rendered \"witnesses\" - μάρτυρί  marturi - is that from which we have derived the word \"martyr.\" It means properly one who bears testimony, either in a judicial sense Matthew 18:16; Matthew 26:65, or one who can in any way testify to the truth of what he has seen and known, Luke 24:48; Romans 1:9; Philippians 1:8; 1 Thessalonians 2:10; 1 Timothy 6:12. Then it came to be employed in the sense in which the word \"martyr\" is now - to denote one who, amidst great sufferings or by his death, bears witness to the truth; that is, one who is so confident of the truth, and so upright, that he will rather lay down his life than deny the truth of what he has seen and known, Acts 22:20; Revelation 2:13. In a similar sense it comes to denote one who is so thoroughly convinced on a subject that it is not susceptible of being seen and heard, or who is so attached to one that he is willing to lay down his life as the evidence of his conviction and attachment. The word, as used here, refers to those who, during this period of \"forty and two months,\" would thus be witnesses for Christ in the world; that is, who would bear their testimony to the truth of his religion, to the doctrines which he had revealed, and to what was required of man - who would do this amidst surrounding error and corruption, and when exposed to persecutions and trials on account of their belief. It is not uncommon in the Scriptures to represent the righteous as witnesses for God. See the notes on Isaiah 43:10, Isaiah 43:12; Isaiah 44:8.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There is no reason for limiting it strictly to two persons, or for supposing that they would appear in pairs, two and two; nor is it necessary to suppose that it refers particularly to two people or nations. The word rendered \"witnesses\" - μάρτυρί  marturi - is that from which we have derived the word \"martyr.\" It means properly one who bears testimony, either in a judicial sense ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 18:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:65",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or one who can in any way testify to the truth of what he has seen and known, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Thessalonians 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Then it came to be employed in the sense in which the word \"martyr\" is now - to denote one who, amidst great sufferings or by his death, bears witness to the truth; that is, one who is so confident of the truth, and so upright, that he will rather lay down his life than deny the truth of what he has seen and known, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 22:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In a similar sense it comes to denote one who is so thoroughly convinced on a subject that it is not susceptible of being seen and heard, or who is so attached to one that he is willing to lay down his life as the evidence of his conviction and attachment. The word, as used here, refers to those who, during this period of \"forty and two months,\" would thus be witnesses for Christ in the world; that is, who would bear their testimony to the truth of his religion, to the doctrines which he had revealed, and to what was required of man - who would do this amidst surrounding error and corruption, and when exposed to persecutions and trials on account of their belief. It is not uncommon in the Scriptures to represent the righteous as witnesses for God. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And they shall prophesy - The word \"prophesy\" does not necessarily mean that they would predict future events; but the sense is, that they would give utterance to the truth as God had revealed it. See the notes on Revelation 10:11. The sense here is, that they would in some public manner hold up or maintain the truth before the world.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And they shall prophesy - The word \"prophesy\" does not necessarily mean that they would predict future events; but the sense is, that they would give utterance to the truth as God had revealed it. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The sense here is, that they would in some public manner hold up or maintain the truth before the world.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A thousand two hundred and threescore days - The same period as the forty and two months Revelation 11:2, though expressed in a different form. Reckoning a day for a year, this period would be twelve hundred and sixty years, or the same as the \"time and times and the dividing of time\" in Daniel 7:25. See the notes on that place; also Editor's Preface. The meaning of this would be, therefore, that during that long period, in which it is said that \"the holy city would be trodden under foot,\" there would be those who might be properly called \"witnesses\" for God, and who would be engaged in holding up his truth before the world; that is, there would be no part of that period in which there would not be found some to whom this appellation could with propriety be given. Though the \"holy city\" - the church - would seem, to be wholly trodden down, yet there would be a few at least who would assert the great doctrines of true godliness.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A thousand two hundred and threescore days - The same period as the forty and two months ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", though expressed in a different form. Reckoning a day for a year, this period would be twelve hundred and sixty years, or the same as the \"time and times and the dividing of time\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See the notes on that place; also Editor's Preface. The meaning of this would be, therefore, that during that long period, in which it is said that \"the holy city would be trodden under foot,\" there would be those who might be properly called \"witnesses\" for God, and who would be engaged in holding up his truth before the world; that is, there would be no part of that period in which there would not be found some to whom this appellation could with propriety be given. Though the \"holy city\" - the church - would seem, to be wholly trodden down, yet there would be a few at least who would assert the great doctrines of true godliness.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Clothed in sackcloth - Sackcloth - σάκκους  sakkous - was properly a coarse black cloth commonly made of hair, used for sacks, for straining, and for mourning garments. See the Revelation 6:12 note; Isaiah 3:24 note; and Matthew 11:21 note. Here it is an emblem of mourning; and the idea is, that they would prophesy in the midst of grief. This would indicate that the time would be one of calamity, or that, in doing this, there would be occasion for their appearing in the emblems of grief, rather than in robes expressive of joy. The most natural interpretation of this is, that there would be but few who could be regarded as true witnesses for God in the world, and that they would be exposed to persecution. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Clothed in sackcloth - Sackcloth - σάκκους  sakkous - was properly a coarse black cloth commonly made of hair, used for sacks, for straining, and for mourning garments. See the ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note. Here it is an emblem of mourning; and the idea is, that they would prophesy in the midst of grief. This would indicate that the time would be one of calamity, or that, in doing this, there would be occasion for their appearing in the emblems of grief, rather than in robes expressive of joy. The most natural interpretation of this is, that there would be but few who could be regarded as true witnesses for God in the world, and that they would be exposed to persecution. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. I will give power—There is no \"power\" in the Greek, so that \"give\" must mean \"give commission,\" or some such word.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "my two witnesses—Greek, \"the two witnesses of me.\" The article implies that the two were well known at least to John.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "prophesy—preach under the inspiration of the Spirit, denouncing judgments against the apostate. They are described by symbol as \"the two olive trees\" and \"the two candlesticks,\" or lamp-stands, \"standing before the God of the earth.\" The reference is to Zec 4:3, 12, where two individuals are meant, Joshua and Zerubbabel, who ministered to the Jewish Church, just as the two olive trees emptied the oil out of themselves into the bowl of the candlestick. So in the final apostasy God will raise up two inspired witnesses to minister encouragement to the afflicted, though sealed, remnant. As two candlesticks are mentioned in Re 11:4, but only one in Zec 4:2, I think the twofold Church, Jewish and Gentile, may be meant by the two candlesticks represented by the two witnesses: just as in Re 7:1-8 there are described first the sealed of Israel, then those of all nations. But see on [2706]Re 11:4. The actions of the two witnesses are just those of Moses when witnessing for God against Pharaoh (the type of Antichrist, the last and greatest foe of Israel), turning the waters into blood, and smiting with plagues; and of Elijah (the witness for God in an almost universal apostasy of Israel, a remnant of seven thousand, however, being left, as the 144,000 sealed, Re 7:1-8) causing fire by his word to devour the enemy, and shutting heaven, so that it rained not for three years and six months, the very time (1260 days) during which the two witnesses prophesy. Moreover, the words \"witness\" and \"prophesy\" are usually applied to individuals, not to abstractions (compare Ps 52:8). De Burgh thinks Elijah and Moses will again appear, as Mal 4:5, 6 seems to imply (compare Mt 17:11; Ac 3:21). Moses and Elijah appeared with Christ at the Transfiguration, which foreshadowed His coming millennial kingdom. As to Moses, compare De 34:5, 6; Jude 9. Elias' genius and mode of procedure bears the same relation to the \"second\" coming of Christ, that John the Baptist's did to the first coming [Bengel]. Many of the early Church thought the two witnesses to be Enoch and Elijah. This would avoid the difficulty of the dying a second time, for these have never yet died; but, perhaps, shall be the witnesses slain. Still, the turning the water to blood, and the plagues (Re 11:6), apply best to \"Moses (compare Re 15:3, the song of Moses\"). The transfiguration glory of Moses and Elias was not their permanent resurrection-state, which shall not be till Christ shall come to glorify His saints, for He has precedence before all in rising. An objection to this interpretation is that those blessed departed servants of God would have to submit to death (Re 11:7, 8), and this in Moses' case a second time, which Heb 9:27 denies. See on [2707]Zec 4:11, 12, on the two witnesses as answering to \"the two olive trees.\" The two olive trees are channels of the oil feeding the Church, and symbols of peace. The Holy Spirit is the oil in them. Christ's witnesses, in remarkable times of the Church's history, have generally appeared in pairs: as Moses and Aaron, the inspired civil and religious authorities; Caleb and Joshua; Ezekiel the priest and Daniel the prophet; Zerubbabel and Joshua.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in sackcloth—the garment of prophets, especially when calling people to mortification of their sins, and to repentance. Their very exterior aspect accorded with their teachings: so Elijah, and John who came in His spirit and power. The sackcloth of the witnesses is a catch word linking this episode under the sixth trumpet, with the sun black as sackcloth (in righteous retribution on the apostates who rejected God's witnesses) under the sixth seal (Re 6:12).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And I will give power unto my two witnesses:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there hath been a great dispute amongst godly and learned men, who these ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two witnesses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " should be: some have thought them to be Enoch and Elijah, who, though long since glorified, they have thought (with no great probability, as I suppose any indifferent person will judge) shall come again, and be killed on the earth; yet this is the general notion of the popish writers. Others would have them the two sorts of gospel churches, one of which was made up of native Gentiles, the other of Jews proselyted to the Christian faith. Others have interpreted it of the Old Testament and the New: others, of some two eminent divines; and as to them there have been various guesses: others, of the ministers whom God employed upon the Reformation: others, of a Christian magistracy and ministry. For my own part, the name of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "witnesses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is so often applied to the first ministers of the gospel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 1:22 2:32 3:15 4:33 5:32 10:41 22:15 26:16 1 Peter 5:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 2:32 3:15 4:33 5:32 10:41 22:15 26:16 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 5:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; that I cannot but understand it of that faithful part of the ministry, who preach the gospel faithfully during the whole reign of antichrist. Neither do I think that the number ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at all relates to their number, but to their witness bearing; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being the number which God ordained as sufficient to establish all civil things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 17:6 Deu 19:15 Matthew 18:16 Hebrews 10:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 19:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 18:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; unless there be a regard had to those pairs, which all along the Old Testament bare testimony for God; Moses and Aaron, Caleb and Joshua, Elijah and Elisha; and after the captivity, Zerubbabel and Joshua, and the two olive trees, mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Zechariah 4:11,14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 4:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", to which plainly this text hath relation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 11:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". To which some also add Abraham and Lot, Ezra and Nehemiah, Haggai and Zechariah, Paul and Barnabas, Peter and John; and note, that when Christ first sent out his apostles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 10:1-42",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:1-42",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", he sent them out two by two. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And they shall prophesy a thousand two hundred and threescore days, clothed in sackcloth:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we read before, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the holy city, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, the true church, should be trodden under foot by the Gentiles ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forty and two months; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we read here, that the witnesses should ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "prophesy in sackcloth a thousand two hundred and threescore days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is apparent, that in the prophetical style a day signifies a year, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 14:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 14:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Forty days, each day for a year, shall ye bear your iniquities, even forty years.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 4:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have appointed thee each day for a year.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 9:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seventy weeks",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " must signify four hundred and ninety years, (for in seventy weeks there are four hundred and ninety days), or else the promise as to the coming of the Messiah failed. So the prophetical year contains three hundred and sixty years, and the prophetical month thirty years (for they did count thirty days to each month); so forty-two months are just one thousand two hundred and sixty days, that is, one thousand two hundred and sixty years. We shall find, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 12:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 12:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the woman (that is, the church) was in the wilderness just this time, one thousand two hundred and sixty days; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 13:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", this was also the time of the beast that rose up out of the sea, having seven heads and ten horns, and upon his horns ten crowns: by which it appeareth, that these four things ran all parallel at the same time; the beast arising, and exercising his power; the new Gentiles trampling upon the church, the holy city; the woman’s abiding in the wilderness; and the witnesses prophesying in sackcloth. If we could find out where any one of these began, we should find out the time of all the rest. Those who fix the rise of the beast in or about the year 400, must add to this 1260. Then in 1660 antichrist’s reign should have determined, and also the time of the church’s persecution, and the time when faithful ministers should prophesy in sackcloth: but if the rise of the beast were in the year 500, the expiration must be in 1760; if it be fixed in 600, all these things will determine in 1860; for the same number of days being assigned to all the four, it is manifest that all four began together, and shall end together, and that at the end of a thousand two hundred and sixty years after the beginning of them. For my own part, I look upon it as very hard to determine: but the difficulty lies in finding out the time when the beast first arose; for that being once found out, it is easy to conclude from Scripture, when both the popedom shall have an end, and the calamitous time for the church, especially the ministry of it, shall cease. That which God showeth John in this verse, is only, that his faithful ministers that should truly reveal his will, (which is here called prophesying), should have a mournful time for a thousand two hundred and threescore years. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will give power unto my two witnesses,.... By whom are meant, not Enoch and Elias, as some of the ancient fathers thought, who, they supposed, would come before the appearance of Christ, and oppose antichrist, and be slain by him, which sense the Papists greedily catch at; nor are the Scriptures, the two Testaments, Old and New, designed, though their name and number agree, and also their office, which is to testify of Christ; but then to be clothed in sackcloth, to be killed, and rise again, and ascend to heaven, are things that cannot so well be accommodated to them: but these witnesses intend the ministers of the Gospel and churches of Christ, who have bore testimony for Christ, and against antichrist, ever since he appeared in the world; and particularly the churches and ministers in Piedmont bid fair for this character; who were upon the spot when antichrist arose, always bore their protest against him, and were ever independent of the church of Rome, and subsisted in the midst of the darkness of the apostasy; and suffered much, and very great persecutions, from the Papists; and have stood their ground, and continue to this day; and have been like olive trees and candlesticks, imparting oil and light to others. Though they ought not to be considered exclusive of other ministers and churches, who also have bore, and still do bear a witness for Christ, and against the idolatries of the church of Rome: no two individual persons can be meant, since these witnesses were to prophesy 1260 days, that is, so many years, but a succession of ministers and churches; and these are called two, both on account of the fewness of them, and because the testimony of two is sufficient to confirm any matter; and it may be in allusion to the various instances of two eminent persons being raised up at certain periods of time, as Moses and Aaron, at the deliverance of the children of Israel out of Egypt; Caleb and Joshua, at their entrance into Canaan; Elijah and Elisha in the idolatrous times of Ahab; and Joshua and Zerubbabel at the rebuilding and finishing of the second temple. Now the Angel, and who is Christ, here promises that he will give something to these witnesses: some supply the words, \"I will give it\"; that is, the holy city, or the church, to them, to be taken care of and defended; others, \"I will give\" them a mouth and wisdom, which their adversaries shall not be able to resist, according to the promise in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 21:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We supply the words, \"I will give power\"; that is, authority to preach the Gospel, and strength to profess it, and to continue to bear a testimony to it, signified by prophesying; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And they shall prophesy; that is, \"that they may prophesy\"; which is supported by the Arabic and Ethiopic versions, the former rendering the words, \"I will give to my two witnesses to prophesy\", and the latter, \"I will give in command to my two witnesses that they may prophesy\"; the sense is, that Christ will give to them a mission and commission, sufficient authority, all needful gifts and grace, courage and presence of mind to preach his Gospel, to hold forth his word, and bear a testimony for him during the whole time of the apostasy, even ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a thousand two hundred and threescore days; that is, so many years, which, as before observed, is the date of the beast's reign, of the holy city being trodden under foot of the Gentiles, and of the church's retirement into the wilderness: it is observable, that the date of the beast's reign and tyranny is expressed by months, and the date of the church's being in the wilderness, and the prophesying of the witnesses, is signified by days; and the reason which some give is not despicable, as that the beast and his followers are the children of darkness and of the night, over which the moon presides, from whence months are, numbered; and the church and the witnesses are children of the day, over which the sun rules. The habit of these witnesses during their time of prophesying follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "clothed in sackcloth; expressive either of their outward state and condition, being poor, mean, and abject, while the followers of the beast are clad in silks, and live deliciously; or else of the inward frame of their minds, as mourning for the sad estate of the church of Christ, groaning under the tyranny and persecutions of antichrist. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "clothed in sackcloth; expressive either of their outward state and condition, being poor, mean, and abject, while the followers of the beast are clad in silks, and live deliciously; or else of the inward frame of their minds, as mourning for the sad estate of the church of Christ, groaning under the tyranny and persecutions of antichrist. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And {6} I will give power unto my two witnesses, and they shall {7} prophesy a thousand two hundred and threescore days, clothed in sackcloth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{6}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I will give ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "power",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " unto my two witnesses, and they shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{7}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prophesy a thousand two hundred ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " threescore days, clothed in sackcloth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) I would rather translate it illud than illam the temple than the city: for God says, I will give that temple, and commit it to my two witnesses, that is, to the ministers of the word, who are few indeed, weak and contemptible: but yet two, that is, of such a number as one of them may help another, and one confirm the testimony of another to all men, that from the mouth of two or three witnesses every word may be made good among men; 2Co 13:1.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(7) They will exercise their office enjoined by me by the space of those 1260 years, in the midst of afflictions though never so lamentable, which is figuratively shown by the mourning garment.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δώσω τοῖς δυσὶν μάρτυσίν μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The object of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δώσω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " follows here, not in the form of the infin.,[2820] but is described, according to the Hebrew way, in the succeeding clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ προφητ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Formally and materially incorrect are the additions to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δώσω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “constancy and wisdom,”[2821] “the holy city,”[2822] which are expressly rejected already by Vitr. Unnecessarily, although in fact not unsuitably, De Wette supplies “direction and power.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The art. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " allows us to think only of two definite witnesses, otherwise known already, who, as the entire description until ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " establishes, are personal individuals, but not “allegories of potencies.”[2823] The witnesses are meant[2824] to be witnesses of Christ (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μάρτ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "),[2825] which accordingly is understood in general of itself, because, as all true ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΠΡΟΦΗΤΕΊΑ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΠΡΟΦΗΤΕΊΑ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " proceeds from Christ,[2826] so also is it actually directed to Christ;[2827] but here it is especially applicable, because the witnesses come forth as preachers of repentance during an essentially Messianic visitation of judgment, and, besides, have to suffer from the same hostility as that by which the Lord himself is brought to the cross, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But from this it does not follow[2828] that Christ himself is to be regarded as speaking;[2829] but the heavenly voice[2830] speaks only in Christ’s name.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμέρας χιλίας διακοσίας ἑξήκοντα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The specification of the forty-two months, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", after the days, shows that daily, during this whole time, the prophetic speech of the two witnesses is heard.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "περιβ-g0-",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σάκκους-g0-",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They are thus, above all things, preachers of repentance; for the penitential garb,[2831] which they themselves have adopted,[2832] puts before the eyes of the hearers what the prophetic testimony demands.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2820] As ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2821] N. de Lyra, C. a Lap.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2822] Beza.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2823] Ebrard, who will in no way concede that they are symbols of individuals.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2824] Ewald, De Wette, etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2825] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ κύριος αὐτων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2826] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2827] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2828] Beng., Hengstenb., Ebrard.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2829] Cf., on the other hand, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ κύρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2830] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2831] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[2832] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σάκκους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the simple, archaic garb of prophets, especially appropriate to humiliation (reff.). The faithful prophets who withdraw from the local apostacy to the desert in company with Isaiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Asc. Isa.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ii. 9 f.) are also clothed in this black hair-cloth. The voice of the divine speaker here “melts imperceptibly into the narrative of the vision” (Alford, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Contemporary Jewish belief (4 Esd. 6:26) made these “witnesses” (men “who have not tasted death from their birth,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Enoch, Elijah) appear before the final judgment and preach successfully, but the only trace of any analogous feature in rabbinical prophecy seems to be the appearance of Moses and Messiah during the course of the Gog and Magog campaign. The reproduction of this oracle, long after its original period in 70 A.D., would be facilitated by the fact that the visions of Ezekiel and Zechariah, upon which it was modelled, both presupposed the fall of the city and temple in ancient Jerusalem (Abbott, pp. 84–88).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I will give power",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, as in the margin, “I will give to My two Witnesses that they may prophesy”—the Hebrew idiom being literally reproduced.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my two witnesses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The traditional view of these, dating from the second century, is that they are Enoch and Elijah—the two prophets who, having (for a time) finished their work on earth, have left it without death: but who, since “it is appointed for all men once to die,” will, as is here revealed, come on earth again, to prophesy and suffer death in the days of Antichrist.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As to Elijah, there seems to be little doubt that this view is true. The prophecy of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has indeed received ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " fulfilment in the mission of the Baptist (St ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But St ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " perhaps implies that this fulfilment is not the final one—especially when compared with St ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Really the plain sense of these passages seems to be, that Elijah will actually be sent before the second Coming of Christ, as one in his spirit and power was before His first.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But the personality of his colleague is more doubtful. Of Enoch we know so little, that internal evidence hardly applies either way: all we can say is, that he was recognised by popular Jewish belief as a seer of apocalypses, and that his character as a prophet and preacher of repentance is recognised by St Jude. This harmonises well enough with his being intended: but the internal evidence of Scripture itself points rather to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Elijah being the two witnesses. Their names are coupled in the prophecy of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 4:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as well as in the history of the Transfiguration: and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Revelation 11:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ascribes to these prophets the plague actually inflicted by Moses, as well as that by Elijah. This modification of the traditional view was first suggested by the abbot Joachim, the great mediæval commentator on this book; but it has found wide acceptance in modern times. It may be observed, that as Elijah is doubtless still living a supernatural life in the body, so Moses must have been raised to such life for the Transfiguration: but he is not necessarily incapable of death, any more than were Lazarus and others who have been raised from the dead.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1260 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Revelation 11:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Δώσω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will give",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") namely, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they may prophesy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This is the language of the Lord Jesus respecting His highly distinguished servants",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—V. g. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here follows, with the same which ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ו ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "has in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ויאל אלוה וידכאני",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ואם ידעת ויש",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῖς δυσὶ μάρτυσί μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to My two witnesses) These are not Moses and Elias, but two illustrious men (as Nic. Selneccer acknowledges, besides other interpreters), at once resembling them, and resembling Joshua and Zerubbabel. But Elias the prophet is certainly to come before the coming of Christ to judgment, just as John the Baptist came before the coming of Christ in the flesh: Mal. 3:23 (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And the genius and mode of procedure of Elias the prophet bears the same relation to the last coming, which the genius and mode of procedure of John the Baptist bears to the former coming. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And I will give power unto my two witnesses.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Omit \"power.\" What is given follows, viz. \"they shall prophesy,\" etc. The voice, speaking in the name of Christ, says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"My:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The two witnesses of me;\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τοῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the,\" as though they were well known. There is much diversity of interpretation in regard to \"the two witnesses.\" It seems reasonable to understand the two witnesses as representative of the elect Church of God (embracing both Jewish and Christian) and of the witness which she bears concerning God, especially in the Old and New Testaments. The following considerations seem to support this interpretation: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The vision is evidently founded on that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is emblematical of the restored temple, which only in the preceding verse (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is a type of the elect of God's Church (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide supra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Apocalypse continually represents the Church of God, after the pattern of the life of Christ, in three aspects - that of conflict and degradation; that of preservation; that of triumph (see Professor Milligan's Baird Lectures, 'The Revelation of St. John,' lect. 2 and 5.). This is a summary of the vision here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Much of the Apocalypse follows our Lord's description in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In that chapter (vers. 13, 14) we have, \"He that shall endure unto the end, the same shall be saved. And this gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come.\" Again, a brief description of this vision. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is not probable that two individuals are meant; for ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(a)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as we have shown throughout the Apocalypse, the application is invariably to principles and societies, though this may include particular applications in certain cases; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(b)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is inconceivable that Moses and Elias, or any other of the saints of God, should return from Paradise to suffer as these two witnesses; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(c)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " our Lord expressly explained the reference to the coming of Elias, and declared that he had already come; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(d)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there seems no more reason for interpreting these two witnesses literally of two men, than for interpreting Sodom and Egypt in their ordinary geographical signification in ver. 8. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(5)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The details of the fate of the two witnesses agree with the interpretation given - the whole vision being understood as symbolical. Thus ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(a)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the picture of the two witnesses is evidently formed after the pattern of Moses and Elias, on account of the conspicuous witness they bore and the hardship they suffered, as well as their preservation and final vindication. Moreover, Moses and Elias are typical of the Law and the prophets, or the Scriptures - the means (as stated above) by which the Church chiefly bears witness of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(b)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The time during which they prophesy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(c)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the clothing in sackcloth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(d)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the appellation of candlesticks and olive trees; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(e)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their power to hurt; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(f)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their apparent death; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(g)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the torment they cause; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(h)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their resuscitation; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(i)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their vindication; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(k)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the immediate advent of the final judgment; - all agree (as shown below) with the interpretation given. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(6)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Witness is constantly connected in the Apocalypse and elsewhere with the Church, and generally with suffering, sometimes with triumph (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 1:2, 5, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 12:11, 17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(7)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we are told, \"The testimony [witness] of Jesus is the spirit of prophecy,\" exactly the quality with which the two witnesses are credited (ver. 3), and which is the work of the Church. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they shall prophesy;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, \"prophesy\" in its literal meaning of forthtelling God's will and his judgments on the wicked, and so of preaching repentance. This is emphatically the work of the Church, and is accomplished chiefly through the Scriptures. It is this prophesying that torments (see vers. 5, 10). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A thousand two hundred",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "three score days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Or, forty and two months (ver. 2). During the period of the world's existence (see on ver. 2) the Church, although \"trodden underfoot,\" will not cease to \"prophesy.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Clothed in sackcloth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus, symbolically, is expressed the same fact as in ver. 2. The Church there is \"trodden underfoot\" during the period of the world; here it is said that she is to perform her office during this time \"clothed in sackcloth.\" The treatment by the world of both the Church of God and the Word of God is represented by the apparel of mourning and woe, which is the lot of the Church on earth. Revelation 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Power",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Omit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Two witnesses",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The reader may profitably consult on this point the lectures of Professor Milligan on the Revelation of St. John. He maintains that the conception of the Apocalypse is powerfully molded by John's recollections of the life of Jesus; that there is a close parallelism between the Apocalypse and the delineation of the life of Christ contained in the fourth Gospel; and that the Apocalypse is, in the deeper conceptions which pervade it, a repetition of the Gospel. See pp. 59-69.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They shall prophesy (προφητεύσουσιν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on prophet, Luke 7:26. Commonly explained of preaching repentance, though some take it in the later sense of foretelling future events.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on prophet, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Commonly explained of preaching repentance, though some take it in the later sense of foretelling future events.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Clothed in sackcloth",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The garb of preachers of repentance. Compare Isaiah 22:12; Jeremiah 4:8; Jonah 3:5; Matthew 3:4. For sackcloth see on Luke 10:13. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The garb of preachers of repentance. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 4:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For sackcloth see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 10:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]