[{"header":"Pharaoh in Pursuit"},{"num":14,"verse":"Now the Lord spoke to Moses, saying, "},{"num":2,"verse":"“Tell the sons of Israel to turn back and camp in front of Pi-hahiroth, between Migdol and the sea. You shall camp in front of Baal-zephon, opposite it, by the sea. "},{"num":3,"verse":"For Pharaoh will say of the Israelites, ‘They are wandering aimlessly in the land; the wilderness has shut them in.’ "},{"num":4,"verse":"I will harden (make stubborn, defiant) Pharaoh’s heart, so that he will pursue them; and I will be glorified and honored through Pharaoh and all his army, and the Egyptians shall know [without any doubt] and acknowledge that I am the Lord.” And they did so."},{"num":5,"verse":"When the king of Egypt was told that the people had fled, Pharaoh and his servants had a change of heart toward the people, and they said, “What is this that we have done? We have let Israel go from serving us!” "},{"num":6,"verse":"So Pharaoh harnessed horses to his war-chariots [for battle] and took his army with him; "},{"num":7,"verse":"and he took six hundred chosen war-chariots, and all the other war-chariots of Egypt with fighting charioteers over all of them. "},{"num":8,"verse":"The Lord hardened the heart of Pharaoh, king of Egypt, and he pursued the Israelites, as they were leaving confidently and defiantly. "},{"num":9,"verse":"The Egyptians chased them with all the horses and war-chariots of Pharaoh, his horsemen and his army, and they overtook them as they camped by the sea, beside Pi-hahiroth, in front of Baal-zephon."},{"num":10,"verse":"As Pharaoh approached, the Israelites looked up and saw the Egyptians marching after them, and they were very frightened; so the Israelites cried out to the Lord. "},{"num":11,"verse":"Then they said to Moses, “Is it because there are no graves in Egypt that you have taken us away to die in the wilderness? What is this that you have done to us by bringing us out of Egypt? "},{"num":12,"verse":"Did we not say to you in Egypt, ‘Leave us alone; let us serve the Egyptians?’ For it would have been better for us to serve the Egyptians [as slaves] than to die in the wilderness.”"},{"header":"The Sea Is Divided"},{"num":13,"verse":"Then Moses said to the people, “Do not be afraid! Take your stand [be firm and confident and undismayed] and see the salvation of the Lord which He will accomplish for you today; for those Egyptians whom you have seen today, you will never see again. "},{"num":14,"verse":"The Lord will fight for you while you [only need to] keep silent and remain calm.”"},{"num":15,"verse":"The Lord said to Moses, “Why do you cry to Me? Tell the sons of Israel to move forward [toward the sea]. "},{"num":16,"verse":"As for you, lift up your staff and stretch out your hand over the sea and divide it, so that the sons of Israel may go through the middle of the sea on dry land. "},{"num":17,"verse":"As for Me, hear this: I will harden the hearts of the Egyptians, and they will go in [the sea] after them; and I will be glorified and honored through Pharaoh and all his army, and his war-chariots and his horsemen. "},{"num":18,"verse":"And the Egyptians shall know [without any doubt] and acknowledge that I am the Lord, when I am glorified and honored through Pharaoh, through his war-chariots and his charioteers.”"},{"num":19,"verse":"The angel of God, who had been going in front of the camp of Israel, moved and went behind them. The pillar of the cloud moved from in front and stood behind them. "},{"num":20,"verse":"So it came between the camp of Egypt and the camp of Israel. It was a cloud along with darkness [even by day to the Egyptians], but it gave light by night [to the Israelites]; so one [army] did not come near the other all night."},{"num":21,"verse":"Then Moses stretched out his hand over the sea; and the Lord swept the sea back by a strong east wind all that night and turned the seabed into dry land, and the waters were divided. "},{"num":22,"verse":"The Israelites went into the middle of the sea on dry land, and the waters formed a wall to them on their right hand and on their left. "},{"num":23,"verse":"Then the Egyptians pursued them into the middle of the sea, even all Pharaoh’s horses, his war-chariots and his charioteers. "},{"num":24,"verse":"So it happened at the early morning watch [before dawn], that the Lord looked down on the army of the Egyptians through the pillar of fire and cloud and put them in a state of confusion. "},{"num":25,"verse":"He made their chariot wheels hard to turn, and the chariots difficult to drive; so the Egyptians said, “Let us flee from Israel, for the Lord is fighting for them against the Egyptians.”"},{"num":26,"verse":"Then the Lord said to Moses, “Stretch out your hand over the sea so that the waters may come back over the Egyptians, on their war-chariots and their charioteers.” "},{"num":27,"verse":"So Moses stretched out his hand over the sea, and the sea returned to its normal flow at sunrise; and the Egyptians retreated right into it [being met by the returning water]; so the Lord overthrew the Egyptians and tossed them into the midst of the sea. "},{"num":28,"verse":"The waters returned and covered the chariots and the charioteers, and all the army of Pharaoh that had gone into the sea after them; not even one of them survived. "},{"num":29,"verse":"But the Israelites walked on dry land in the middle of the sea, and the waters formed a wall to them on their right hand and on their left."},{"num":30,"verse":"The Lord saved Israel that day from the hand of the Egyptians, and Israel saw the Egyptians [lying] dead on the seashore. "},{"num":31,"verse":"When Israel saw the great power which the Lord had used against the Egyptians, they feared the Lord [with reverence and awe-filled respect], and they believed in the Lord, and in His servant Moses."}]