[{"num":14,"verse":"Adonai said to Moshe, "},{"num":2,"verse":"“Tell the people of Isra’el to turn around and set up camp in front of Pi-Hachirot, between Migdol and the sea, in front of Ba‘al-Tz’fon; camp opposite it, by the sea. "},{"num":3,"verse":"Then Pharaoh will say that the people of Isra’el are wandering aimlessly in the countryside, the desert has closed in on them. "},{"num":4,"verse":"I will make Pharaoh so hardhearted that he will pursue them; thus I will win glory for myself at the expense of Pharaoh and all his army, and the Egyptians will realize at last that I am Adonai.” The people did as ordered."},{"num":5,"verse":"When the king of Egypt was told that the people had fled, Pharaoh and his servants had a change of heart toward the people. They said, “What have we done, letting Isra’el stop being our slaves?” "},{"num":6,"verse":"So he prepared his chariots and took his people with him — "},{"num":7,"verse":"he took 600 first-quality chariots, as well as all the other chariots in Egypt, along with their commanders. "},{"num":8,"verse":"Adonai made Pharaoh hardhearted, and he pursued the people of Isra’el, as they left boldly. "},{"num":9,"verse":"(ii) The Egyptians went after them, all the horses and chariots of Pharaoh, with his cavalry and army, and overtook them as they were encamped by the sea, by Pi-Hachirot, in front of Ba‘al-Tz’fon. "},{"num":10,"verse":"As Pharaoh approached, the people of Isra’el looked up and saw the Egyptians right there, coming after them. In great fear the people of Isra’el cried out to Adonai "},{"num":11,"verse":"and said to Moshe, “Was it because there weren’t enough graves in Egypt that you brought us out to die in the desert? Why have you done this to us, bringing us out of Egypt? "},{"num":12,"verse":"Didn’t we tell you in Egypt to let us alone, we’ll just go on being slaves for the Egyptians? It would be better for us to be the Egyptians’ slaves than to die in the desert!” "},{"num":13,"verse":"Moshe answered the people, “Stop being so fearful! Remain steady, and you will see how Adonai is going to save you. He will do it today — today you have seen the Egyptians, but you will never see them again! "},{"num":14,"verse":"Adonai will do battle for you. Just calm yourselves down!”"},{"num":15,"verse":"(A: iii) Adonai asked Moshe, “Why are you crying to me? Tell the people of Isra’el to go forward! "},{"num":16,"verse":"Lift your staff, reach out with your hand over the sea, and divide it in two. The people of Isra’el will advance into the sea on dry ground. "},{"num":17,"verse":"As for me, I will make the Egyptians hardhearted; and they will march in after them; thus I will win glory for myself at the expense of Pharaoh and all his army, chariots and cavalry. "},{"num":18,"verse":"Then the Egyptians will realize that I am Adonai, when I have won myself glory at the expense of Pharaoh, his chariots and his cavalry.”"},{"num":19,"verse":"Next, the angel of God, who was going ahead of the camp of Isra’el, moved away and went behind them; and the column of cloud moved away from in front of them and stood behind them. "},{"num":20,"verse":"It stationed itself between the camp of Egypt and the camp of Isra’el — there was cloud and darkness here, but light by night there; so that the one did not come near the other all night long."},{"num":21,"verse":"Moshe reached his hand out over the sea, and Adonai caused the sea to go back before a strong east wind all night. He made the sea become dry land, and its water was divided in two. "},{"num":22,"verse":"Then the people of Isra’el went into the sea on the dry ground, with the water walled up for them on their right and on their left."},{"num":23,"verse":"The Egyptians continued their pursuit, going after them into the sea — all Pharaoh’s horses, chariots and cavalry. "},{"num":24,"verse":"Just before dawn, Adonai looked out on the Egyptian army through the column of fire and cloud and threw them into a panic. "},{"num":25,"verse":"He caused the wheels of their chariots to break off, so that they could move only with difficulty. The Egyptians said, “Adonai is fighting for Isra’el against the Egyptians! Let’s get away from them!”"},{"num":26,"verse":"(A: iv, S: iii) Adonai said to Moshe, “Reach your hand out over the sea, and the water will return and cover the Egyptians with their chariots and cavalry.” "},{"num":27,"verse":"Moshe reached his hand out over the sea, and by dawn the sea had returned to its former depth. The Egyptians tried to flee, but Adonai swept them into the sea. "},{"num":28,"verse":"The water came back and covered all the chariots and cavalry of Pharaoh’s army who had followed them into the sea — not even one of them was left. "},{"num":29,"verse":"But the people of Isra’el walked on dry ground in the sea, with the water walled up for them on their right and on their left."},{"num":30,"verse":"On that day, Adonai saved Isra’el from the Egyptians; Isra’el saw the Egyptians dead on the shore. "},{"num":31,"verse":"When Isra’el saw the mighty deed that Adonai had performed against the Egyptians, the people feared Adonai, and they believed in Adonai and in his servant Moshe."}]