[{"header":"Crossing the Red Sea"},{"num":14,"verse":"Now the Lord spoke to Moses, saying: "},{"num":2,"verse":"Speak to the children of Israel, so that they turn and camp before Pi Hahiroth, between Migdol and the sea, before Baal Zephon. Opposite it you shall camp by the sea. "},{"num":3,"verse":"For Pharaoh will say of the children of Israel, “They are confused in the land. The wilderness has shut them in.” "},{"num":4,"verse":"So I will harden Pharaoh’s heart, so that he shall pursue them. And I will be honored because of Pharaoh and because of all his army, so that the Egyptians may know that I am the Lord. And they did so."},{"num":5,"verse":"When it was told the king of Egypt that the people fled, the heart of Pharaoh and of his servants was turned against the people, and they said, “Why have we done this, that we have let Israel go from serving us?” "},{"num":6,"verse":"So he made ready his chariot and took his people with him. "},{"num":7,"verse":"And he took six hundred select chariots, and all the chariots of Egypt, and officers over every one of them. "},{"num":8,"verse":"The Lord hardened the heart of Pharaoh king of Egypt, and he pursued after the children of Israel. However, the children of Israel went out with confidence. "},{"num":9,"verse":"But the Egyptians pursued after them, all the horses and chariots of Pharaoh, and his horsemen, and his army, and overtook them camping by the sea, beside Pi Hahiroth, before Baal Zephon."},{"num":10,"verse":"When Pharaoh drew near, the children of Israel lifted up their eyes, and indeed, the Egyptians were marching after them, and they were extremely terrified, so the children of Israel cried out to the Lord. "},{"num":11,"verse":"Then they said to Moses, “Is it because there were no graves in Egypt that you have taken us away to die in the wilderness? Why have you dealt with us in this way, bringing us out of Egypt? "},{"num":12,"verse":"Is not this the word that we spoke to you in Egypt, saying, ‘Let us alone, that we may serve the Egyptians’? For it would have been better for us to serve the Egyptians than to die in the wilderness.”"},{"num":13,"verse":"But Moses said to the people, “Fear not! Stand firm! And see the salvation of the Lord, which He will show you today. For the Egyptians whom you have seen today, you shall never see again. "},{"num":14,"verse":"The Lord shall fight for you, while you hold your peace.”"},{"num":15,"verse":"The Lord said to Moses, “Why do you cry out to Me? Speak to the children of Israel, so that they go forward. "},{"num":16,"verse":"And as for you, lift up your rod, and stretch out your hand over the sea, and divide it; then the children of Israel shall go on dry ground through the midst of the sea. "},{"num":17,"verse":"As for Me, surely, I will harden the hearts of the Egyptians, so that they shall follow them, and I will be honored through Pharaoh, through all his army, his chariots, and his horsemen. "},{"num":18,"verse":"Then the Egyptians shall know that I am the Lord when I am honored through Pharaoh, his chariots, and his horsemen.”"},{"num":19,"verse":"Then the angel of God, which went before the camp of Israel, moved and went behind them, and the pillar of the cloud moved before them and stood behind them. "},{"num":20,"verse":"So it came between the camp of the Egyptians and the camp of Israel, and there was a cloud and darkness to them, but it gave light by night. Therefore, the one did not come near the other the entire night."},{"num":21,"verse":"Then Moses stretched out his hand over the sea, and the Lord caused the sea to go back by a strong east wind all that night, and made the sea dry land, so that the waters were divided. "},{"num":22,"verse":"The children of Israel went into the midst of the sea on the dry ground, and the waters were a wall unto them on their right hand, and on their left."},{"num":23,"verse":"Then the Egyptians pursued and went in after them into the midst of the sea, even all Pharaoh’s horses, his chariots, and his horsemen. "},{"num":24,"verse":"And in the morning watch the Lord looked down on the army of the Egyptians through the pillar of fire and of the cloud and threw the camp of the Egyptians into confusion. "},{"num":25,"verse":"He removed their chariot wheels, so that they drove them with difficulty, and the Egyptians said, “Let us flee from the face of Israel, for the Lord is fighting for them against Egypt.”"},{"num":26,"verse":"Then the Lord said to Moses, “Stretch out your hand over the sea, so that the waters may come back upon the Egyptians, upon their chariots, and their horsemen.” "},{"num":27,"verse":"So Moses stretched forth his hand over the sea, and the sea returned to its normal place when the morning appeared, while the Egyptians fled against it, so the Lord overthrew the Egyptians in the midst of the sea. "},{"num":28,"verse":"The waters returned and covered the chariots, and the horsemen, and all the host of Pharaoh that came into the sea after them. There remained not so much as one of them."},{"num":29,"verse":"But the children of Israel walked on dry land in the midst of the sea. And the waters were a wall to them on their right hand and on their left. "},{"num":30,"verse":"Thus the Lord saved Israel that day from the hand of the Egyptians, and Israel saw the Egyptians dead upon the seashore. "},{"num":31,"verse":"When Israel saw the great power which the Lord used upon the Egyptians, the people feared the Lord, and they believed in the Lord and in His servant Moses."}]