[{"num":5,"verse":"When Egypt’s king received the news that the Israelites had run away, the attitude of Pharaoh and his servants changed. They began talking among themselves."},{"num":6,"verse":"Pharaoh prepared his chariot and called out his army. "},{"num":7,"verse":"He took a select group of the 600 best chariots in the land plus all the other chariots in Egypt with drivers commanding all of them."},{"num":8,"verse":"The Eternal hardened the stubborn heart of Pharaoh, king of Egypt; and he chased after the Israelites just as they were marching out of the land with victorious hands held high."},{"num":9,"verse":"The Egyptians pursued the Israelites. All of Pharaoh’s horses and chariots, his chariot-drivers and army caught up with the Israelites as they were camping by the sea not far from Pi-hahiroth, opposite Baal-zephon."},{"num":10,"verse":"Pharaoh approached the Israelites’ camp, and the Israelites saw the Egyptian army closing in on them. The Israelites were trapped and feared for their lives, so they cried out to the Eternal."},{"num":19,"verse":"God’s messenger, who had been out front leading the people of Israel, moved to protect the rear of the company; the cloud pillar moved with him from the front to the back of them. "},{"num":20,"verse":"The cloud pillar took its position between Egypt’s and Israel’s camps. The cloud cast darkness by day yet it lit up the sky by night. As a result, the Egyptians never got close to the Israelites the entire night. "},{"num":21,"verse":"Moses then took his staff and reached out over the sea. The Eternal parted the sea with a strong east wind, which blew all night and turned the floor of the sea into dry ground between the divided waters. "},{"num":22,"verse":"The Israelites broke camp and traveled on dry ground through the parted waters, and the sea stood like a solid wall on their right and on their left."},{"num":23,"verse":"The Egyptians were undaunted. They continued their pursuit; all of Pharaoh’s horses, chariots, and chariot-drivers followed the Israelites into the middle of the sea."},{"num":24,"verse":"Before daybreak the Eternal peered down upon the Egyptian army through the fire pillar and the cloud pillar and threw them all into confusion. "},{"num":25,"verse":"He caused the wheels of their chariots to break down so that it was nearly impossible for the drivers to control them. The Egyptians knew something was wrong."},{"num":26,"verse":"After all the Israelites had reached the other side of the sea, the Eternal spoke to Moses."},{"num":27,"verse":"So Moses raised his hand and reached out over the sea, and the walls of water collapsed. As dawn gave way to morning, the sea returned to normal and the Eternal swept the retreating Egyptian army into the sea. "},{"num":28,"verse":"The waters rushed and covered all the chariots and their drivers, swallowing up all of Pharaoh’s army that had pursued Israel into the sea. Not one Egyptian survived."},{"num":29,"verse":"But the Israelites had walked safely through the parted waters on dry ground, and the sea stood like a solid wall on their right and on their left. "},{"num":30,"verse":"That day the Eternal rescued Israel from the powerful grip of the Egyptians, and Israel watched the corpses of the Egyptians wash up on the shore. "},{"num":31,"verse":"When Israel witnessed the incredible power that the Eternal used to defeat the Egyptians, the people were struck with fear of Him, and they trusted in Him and also in Moses, His servant."}]