[{"num":14,"verse":"Forsooth the Lord spake to Moses, and said,"},{"num":2,"verse":"Speak thou to the sons of Israel; turn they again, and set they tents even against Pihahiroth, which is betwixt Migdol and the sea, against Baalzephon; and in the sight thereof ye shall set tents on the sea. (Speak thou to the Israelites; tell them to turn back, and pitch their tents before Pihahiroth, which is between Migdol and the Red Sea, or the Sea of Reeds, east of Baalzephon; yea, in the sight of it, ye shall pitch your tents by the sea.)"},{"num":3,"verse":"And Pharaoh shall say on the sons of Israel, They be made strait in the land, the desert hath closed them together. (And Pharaoh shall say of the Israelites, The land is too narrow there for all of them, yea, the wilderness hath enclosed them.)"},{"num":4,"verse":"And I shall make hard his heart, and he shall pursue you, and I shall be glorified in Pharaoh, and in all his host; and the Egyptians shall know that I am the Lord; and they did so."},{"num":5,"verse":"And it was told to the king of the Egyptians, that the people had fled; and the heart of Pharaoh and of his servants was changed on the people, and they said, What would we do, that we let go Israel, that it should not serve us? (And it was told to the king of the Egyptians, that the people had fled; and Pharaoh’s heart, and the hearts of his servants, were turned against the people, and they said, What have we done? we have let Israel go, and now there is no one here to serve us!)"},{"num":6,"verse":"Therefore Pharaoh joined (up) the chariot, and took with him all his people; (And so Pharaoh joined up his chariot, and took all his people with him;)"},{"num":7,"verse":"and he took six hundred chosen chariots, and whatever thing of chariots was in Egypt, and [the] dukes of all the host. (and he took six hundred of the choicest chariots, and whatever other chariots were in Egypt, and all the leaders of his army.)"},{"num":8,"verse":"And the Lord made hard the heart of Pharaoh, king of Egypt, and he pursued the sons of Israel; and they were gone out in an high hand. (And the Lord hardened the heart of Pharaoh, king of Egypt, and he pursued the Israelites; and they went forth with great defiance.)"},{"num":9,"verse":"And when the Egyptians pursued the steps of the sons of Israel before-going, they found them in tents on the sea; (and) all the chivalry, and [the] chariots of Pharaoh, and all the host were in Pihahiroth, against Baalzephon. (And the Egyptians, yea, all the cavalry, and the chariots, and all of Pharaoh’s army, pursued the steps of the Israelites who had gone forth before them; and they found them in their tents by the Red Sea, by Pihahiroth, and east of Baalzephon.)"},{"num":10,"verse":"And when Pharaoh had nighed, the sons of Israel raised [up] their eyes, and they saw the Egyptians behind them, and they dreaded greatly (and they greatly feared); and they cried to the Lord,"},{"num":11,"verse":"and said to Moses, In hap sepulchres were not in Egypt, therefore thou hast taken us away, that we shall die in wilderness? what wouldest thou do this, that thou leddest us out of Egypt? (and they said to Moses, Perhaps there were no tombs, or no graves, in Egypt, and so thou hast taken us away, so that now we can die here in this wilderness? why hast thou done this, and led us out of Egypt?)"},{"num":12,"verse":"Whether this is not the word that we spake to thee in Egypt (Was this not what we said to thee in Egypt), saying, Go away from us, (so) that we (can) serve the Egyptians? for it is much better to serve them, than to die in (the) wilderness."},{"num":13,"verse":"And Moses said to the people, Do not ye dread, stand ye, and see the great works of God, which he shall do today; for ye shall no more see the Egyptians, which ye see now, till into without end; (And Moses said to the people, Do not ye fear, stand ye, and see the great works of God, which he shall do today; for the Egyptians, whom ye now see, soon ye shall never see them again;)"},{"num":14,"verse":"the Lord shall fight for you, and ye shall be still. (the Lord shall fight for you, but ye must keep still/but ye must be silent)."},{"num":15,"verse":"And the Lord said to Moses, What criest thou to me? Speak thou to the sons of Israel, that they go forth; (And the Lord said to Moses, Why criest thou to me? Speak thou to the Israelites, so that they go forth;)"},{"num":16,"verse":"forsooth raise thou thy rod, and stretch forth thine hand on the sea, and part thou it, that the sons of Israel go in the midst of the sea, by dry place. (now raise thou up thy staff, and stretch forth thy hand over the sea, and part thou it, so that the Israelites can go through the midst of the sea, on dry land.)"},{"num":17,"verse":"Forsooth I shall make hard the heart(s) of [the] Egyptians, that they pursue you, and I shall be glorified in Pharaoh, and in all the host of him, and in the chariots of him, and in the knights of him; (But I shall harden the hearts of the Egyptians, so that they pursue you, and I shall be glorified in Pharaoh, and in all his army, and in his chariots, and in his soldiers;)"},{"num":18,"verse":"and [the] Egyptians shall know that I am the Lord God, when I shall be glorified in Pharaoh, and in the chariots, and in the knights of him (and in his soldiers)."},{"num":19,"verse":"And the angel of the Lord, that went before the castles, or tents, of Israel, took himself, and went behind them; and the pillar of cloud went together with him, and left the former things after the back, (And the angel of the Lord, who went before the tents, or the army, of Israel, took himself, and went behind them; and the pillar of cloud went with him, yea, it also went from in front of them, to behind their backs,)"},{"num":20,"verse":"and stood betwixt the castles of Egyptians and the castles of Israel; and the cloud was dark toward the Egyptians, and it was lightening the night toward Israel, so that in all the time of the night, they might not [come] nigh together to themselves. (and they stood between the tents, or the army, of the Egyptians and the tents, or the army, of Israel; and the cloud was dark toward the Egyptians, but it was lighting the night toward the Israelites, so that they could not come close to each other in all that night.)"},{"num":21,"verse":"And when Moses had stretched forth his hand on the sea, the Lord took away the sea, the while a great wind and a burning (one) blew in all the night, and turned the sea into dryness; and the water was parted. (And when Moses had stretched forth his hand over the Red Sea, the Lord took away the sea, by a great burning wind that blew all that night, and turned the sea into dry land; and so the waters were parted.)"},{"num":22,"verse":"And the sons of Israel entered by the midst of the dry sea; for the water was as a wall at the right side, and the left side of them. (And the Israelites entered into the midst of the sea on dry land; for the water was like a wall on their right side, and on their left side.)"},{"num":23,"verse":"And the Egyptians pursued, and entered after them, all the riding of Pharaoh, his chariots, and [his] knights, by the midst of the sea. (And the Egyptians pursued them, and entered into the midst of the sea after them, yea, all the horses of Pharaoh, and his chariots, and his soldiers.)"},{"num":24,"verse":"And the watch of the morrowtide came then, and lo! the Lord beheld on the castles of the Egyptians, by a pillar of fire, and of cloud, and killed the host of them; (And the morning watch came then, and lo! the Lord looked down through the pillars of fire, and of cloud, on the army of the Egyptians, and he panicked all the soldiers;)"},{"num":25,"verse":"and he destroyed the wheels of [the] chariots, and those were borne into the depth (and he clogged up the wheels of the chariots, and they turned with great difficulty). Therefore the Egyptians said, Flee we (from) Israel; for the Lord fighteth for them against us."},{"num":26,"verse":"And the Lord said to Moses, Hold forth thine hand on the sea, that the waters turn again to [the] Egyptians, on the chariots, and on the knights of them. (And the Lord said to Moses, Stretch forth thy hand over the sea, so that the waters return onto the Egyptians, yea, onto their chariots, and onto their soldiers.)"},{"num":27,"verse":"And when Moses had held forth his hand against the sea, it turned again first in the morrowtide to the former place (And Moses stretched forth his hand over the sea, and early in the morning it returned to its former place); and when the Egyptians fled, the waters came (up) against them, and the Lord wrapped them (up) in the midst of the flood."},{"num":28,"verse":"And the waters turned again, and covered the chariots, and [the] knights of all the host of Pharaoh, which followed, and entered into the sea; soothly not one of them was (left) alive. (And the waters returned, and covered the chariots, and all the soldiers of Pharaoh’s army, who had followed the Israelites, and had entered into the sea after them; truly not one of them was left alive.)"},{"num":29,"verse":"Forsooth the sons of Israel went through the midst of the dry sea, and the waters were to them as for a wall, on the right side, and on the left side. (But the Israelites went through the midst of the sea on dry land, and for them the waters were like a wall, on their right side, and on their left side.)"},{"num":30,"verse":"And in that day the Lord delivered Israel from the hand of [the] Egyptians, and they saw the Egyptians dead on the brink of the sea, (And on that day the Lord saved Israel from the hands of the Egyptians, and they saw the Egyptians lying dead on the seashore,)"},{"num":31,"verse":"and they saw the great hand, or power/or might, which the Lord had used against the Egyptians; and the people dreaded the Lord, and they believed to the Lord, and to Moses his servant (and they saw the great power, or the great might, which the Lord had used against the Egyptians; and the people feared the Lord, and they believed in the Lord, and in his servant Moses.)"}]