[{"num":40,"verse":"Comfort ye, comfort ye my people, saith your God."},{"num":2,"verse":"Speak to the heart of Jerusalem, and cry unto her, that her time of suffering is accomplished, that her iniquity is pardoned; for she hath received of Jehovah's hand double for all her sins."},{"num":3,"verse":"The voice of one crying in the wilderness: Prepare ye the way of Jehovah, make straight in the desert a highway for our God!"},{"num":4,"verse":"Every valley shall be raised up, and every mountain and hill shall be brought low; and the crooked shall be made straight, and the rough places a plain."},{"num":5,"verse":"And the glory of Jehovah shall be revealed, and all flesh shall see [it] together: for the mouth of Jehovah hath spoken."},{"num":6,"verse":"A voice saith, Cry. And he saith, What shall I cry?—All flesh is grass, and all the comeliness thereof as the flower of the field."},{"num":7,"verse":"The grass withereth, the flower fadeth, for the breath of Jehovah bloweth upon it: surely the people is grass."},{"num":8,"verse":"The grass withereth, the flower fadeth; but the word of our God abideth for ever."},{"num":9,"verse":"O Zion, that bringest glad tidings, get thee up into a high mountain; O Jerusalem, that bringest glad tidings, lift up thy voice with strength: lift it up, be not afraid; say unto the cities of Judah, Behold your God!"},{"num":10,"verse":"Behold, the Lord Jehovah will come with might, and his arm shall rule for him; behold, his reward is with him, and his recompence before him."},{"num":11,"verse":"He will feed his flock like a shepherd: he will gather the lambs with his arm, and carry them in his bosom; he will gently lead those that give suck."},{"num":12,"verse":"Who hath measured the waters in the hollow of his hand, and meted out the heavens with [his] span, and grasped the dust of the earth in a measure, and weighed the mountains in a balance, and the hills in scales?"},{"num":13,"verse":"Who hath directed the Spirit of Jehovah, and, [as] his counsellor, hath taught him?"},{"num":14,"verse":"With whom took he counsel, and [who] gave him intelligence, and instructed him in the path of judgment, and taught him knowledge, and shewed him the way of understanding?"},{"num":15,"verse":"Behold, the nations are esteemed as a drop of the bucket, and as the fine dust on the scales; behold, he taketh up the isles as an atom."},{"num":16,"verse":"And Lebanon is not sufficient to burn, nor the beasts thereof sufficient for a burnt-offering."},{"num":17,"verse":"All the nations are as nothing before him; they are esteemed by him less than a cipher, and vanity."},{"num":18,"verse":"To whom then will ye liken God? and what likeness will ye compare unto him?"},{"num":19,"verse":"The workman casteth a graven image, and the goldsmith spreadeth it over with gold, and casteth silver chains [for it]."},{"num":20,"verse":"He that is impoverished, so that he hath no offering, chooseth a tree that doth not rot; he seeketh unto him a skilled workman to prepare a graven image that shall not be moved."},{"num":21,"verse":"—Do ye not know? Have ye not heard? Hath it not been told you from the beginning? Have ye not understood the foundation of the earth?"},{"num":22,"verse":"[It is] he that sitteth upon the circle of the earth, and the inhabitants thereof are as grasshoppers; that stretcheth out the heavens as a gauze curtain, and spreadeth them out as a tent to dwell in;"},{"num":23,"verse":"that bringeth the princes to nothing, that maketh the judges of the earth as vanity."},{"num":24,"verse":"Scarcely are they planted, scarcely are they sown, scarcely hath their stock taken root in the earth, but he also bloweth upon them and they wither, and the whirlwind taketh them away as stubble."},{"num":25,"verse":"To whom then will ye liken me, or shall I be equal? saith the Holy One."},{"num":26,"verse":"Lift up your eyes on high, and see! Who hath created these things, bringing out their host by number? He calleth them all by name; through the greatness of his might and strength of power, not one faileth."},{"num":27,"verse":"Why sayest thou, Jacob, and speakest, O Israel, My way is hid from Jehovah, and my right is passed away from my God?"},{"num":28,"verse":"Dost thou not know, hast thou not heard, that the everlasting God, Jehovah, the Creator of the ends of the earth, fainteth not nor tireth? There is no searching of his understanding."},{"num":29,"verse":"He giveth power to the faint; and to him that hath no might he increaseth strength."},{"num":30,"verse":"Even the youths shall faint and shall tire, and the young men shall stumble and fall;"},{"num":31,"verse":"but they that wait upon Jehovah shall renew [their] strength: they shall mount up with wings as eagles; they shall run, and not tire; they shall walk, and not faint."}]