[{"header":"God’s People Have Hope"},{"num":40,"verse":"“Comfort, comfort My people,” says your God. "},{"num":2,"verse":"“Speak kind words to Jerusalem. Call out to her that her time of war has ended, that her sin has been taken away, and that she has received from the Lord’s hand twice as much for all her sins.”"},{"num":3,"verse":"A voice is calling, “Make the way ready for the Lord in the desert. Make the road in the desert straight for our God. "},{"num":4,"verse":"Every valley will be lifted up and every mountain and hill will be brought down. The turns in the road will be made straight and the bad places will be made smooth. "},{"num":5,"verse":"Then the shining-greatness of the Lord will be seen. All flesh together will see it, for the mouth of the Lord has spoken.” "},{"num":6,"verse":"A voice says, “Cry.” And he said, “What should I cry?” All flesh is grass. All its beauty is like the flower of the field. "},{"num":7,"verse":"The grass dries up and the flower loses its color when the breath of the Lord blows upon it. For sure the people are grass. "},{"num":8,"verse":"The grass dries up. The flower loses its color. But the Word of our God stands forever."},{"num":9,"verse":"O Zion, you who bring good news, go up on the high mountain! Lift up your voice with strength, O Jerusalem, you who bring good news. Lift it up, do not be afraid. Say to the cities of Judah, “Here is your God!” "},{"num":10,"verse":"See, the Lord God will come with power, and His arm will rule for Him. See, He is bringing the reward He will give to everyone for what he has done. "},{"num":11,"verse":"He will feed His flock like a shepherd. He will gather the lambs in His arms and carry them close to His heart. He will be gentle in leading those that are with young."},{"num":12,"verse":"Who knows how much water is in His hand? Who has used his hand to know how far the heavens reach? Who knows what the dust of the earth would fill? Who has weighed the mountains and the hills? "},{"num":13,"verse":"Who has led the Spirit of the Lord? Who has taught Him words of wisdom? "},{"num":14,"verse":"From whom did He ask for wisdom, and who gave Him understanding? Who taught Him the right way, and taught Him much learning? Who showed Him the way of understanding? "},{"num":15,"verse":"See, the nations are like a drop in a pail. Their weight is like a little piece of dust. See, He lifts up the islands like fine dust. "},{"num":16,"verse":"Even Lebanon is not enough to burn. Its animals are not enough for a burnt gift in worship. "},{"num":17,"verse":"All the nations are as nothing before Him. He thinks of them as less than nothing and of no worth."},{"num":18,"verse":"To Whom then is God like? What will you compare Him with? "},{"num":19,"verse":"An able workman makes a false god. A man who works with gold covers it with gold. And a man who works with silver makes silver chains for it. "},{"num":20,"verse":"He who is too poor to give such a gift, picks out a tree that will not waste away. He finds an able workman to set up a false god that will not be moved."},{"num":21,"verse":"Do you not know? Have you not heard? Has it not been told to you from the beginning? Have you not understood from the beginning of the earth? "},{"num":22,"verse":"It is God Who sits on the throne above the earth. The people living on the earth are like grasshoppers. He spreads out the heavens like a curtain. He spreads them out like a tent to live in. "},{"num":23,"verse":"It is He Who brings rulers down to nothing. He makes the judges of the earth as nothing. "},{"num":24,"verse":"They have just been planted, and have begun to take root in the earth. But He only blows on them and they dry up, and the storm carries them away like dry grass. "},{"num":25,"verse":"“To whom will you compare Me, that I should be like him?” says the Holy One. "},{"num":26,"verse":"Lift up your eyes and see. Who has made these stars? It is the One Who leads them out by number. He calls them all by name. Because of the greatness of His strength, and because He is strong in power, not one of them is missing."},{"num":27,"verse":"O Jacob and Israel, why do you say, “My way is hidden from the Lord. My God does not think about my cause”? "},{"num":28,"verse":"Have you not known? Have you not heard? The God Who lives forever is the Lord, the One Who made the ends of the earth. He will not become weak or tired. His understanding is too great for us to begin to know. "},{"num":29,"verse":"He gives strength to the weak. And He gives power to him who has little strength. "},{"num":30,"verse":"Even very young men get tired and become weak and strong young men trip and fall. "},{"num":31,"verse":"But they who wait upon the Lord will get new strength. They will rise up with wings like eagles. They will run and not get tired. They will walk and not become weak."}]