[{"header":"Final Warnings"},{"num":13,"verse":"This will be the third time I am coming to you. “Every accusation must be verified by two or three witnesses.” "},{"num":2,"verse":"I have already warned those who sinned previously and all the rest. Although I am absent now, I am warning them as I did on my second visit: If I come back, I will not spare you, "},{"num":3,"verse":"since you want proof that the Messiah is speaking through me. He is not weak in dealing with you but is making his power felt among you. "},{"num":4,"verse":"Though he was crucified in weakness, he lives by God’s power. We are weak with him, but by God’s power we will live for you."},{"num":5,"verse":"Keep examining yourselves to see whether you are continuing in the faith. Test yourselves! You know, don’t you, that Jesus the Messiah lives in you? Could it be that you are failing the test? "},{"num":6,"verse":"I hope you will realize that we haven’t failed our test. "},{"num":7,"verse":"We pray to God that you will not do anything wrong—not to show that we have not failed the test, but so that you may do what is right, even if we seem to have failed. "},{"num":8,"verse":"For we cannot do anything against the truth, but only for the truth. "},{"num":9,"verse":"We are glad when we are weak and you are strong. That is what we are praying for—your maturity."},{"num":10,"verse":"For this reason I am writing this while I am away from you: When I come I do not want to be severe in using the authority the Lord gave me to build you up and not to tear you down."},{"header":"Final Greetings and Benediction"},{"num":11,"verse":"Finally, brothers, goodbye. Keep on growing to maturity. Keep listening to my appeals. Continue agreeing with each other and living in peace. Then the God of love and peace will be with you. "},{"num":12,"verse":"Greet one another with a holy kiss. "},{"num":13,"verse":"All the saints greet you."},{"num":14,"verse":"May the grace of the Lord Jesus the Messiah, the love of God, and the fellowship of the Holy Spirit be with all of you!"}]