[{"num":13,"verse":"This is my third trip to your city and community. As the Scripture says, “Every charge must be confirmed by two or three witnesses.” "},{"num":2,"verse":"As I said before on my second visit, I say now again while absent. Consider this an advance warning, if you wish, to those of you still caught up in your old sins and to all the rest as well: when I come the next time, I will not spare anyone who is out of order. "},{"num":3,"verse":"You asked to see evidence that the power of the Anointed One, the Liberating King, is at work in me. Well, you will see it because He won’t be weak in dealing with you. Instead, He will do great things in you. "},{"num":4,"verse":"Now it’s true that He was crucified in weakness, but it’s also true that He lives by God’s power. For we who belong to Him are weak in Him, but we will live with Him by God’s power for you."},{"num":5,"verse":"Examine yourselves. Check your faith! Are you really in the faith? Do you still not know that Jesus the Anointed is in you?—unless, of course, you have failed the test. "},{"num":6,"verse":"Surely you will realize we have not failed the test, "},{"num":7,"verse":"but we pray to God that you will stay away from evil. What’s important is not whether we appear to have passed the test, but that you do what is right and act honorably, even if it appears that we have failed. "},{"num":8,"verse":"For there’s nothing we can do to oppose the truth; all we can do is align ourselves with it. "},{"num":9,"verse":"You see, we celebrate when we are weak but you are strong. Our prayer is simple: that you may be whole and complete. "},{"num":10,"verse":"How I hope I am saving you by writing this to you in advance; this letter will spare me from using the Lord’s authority to come down on you when I arrive. His intention in giving me this authority is to build you up, not tear you down."},{"num":11,"verse":"Finally, brothers and sisters, keep rejoicing and repair whatever is broken. Encourage each other, think as one, and live at peace; and God, the Author of love and peace, will remain with you. "},{"num":12,"verse":"Greet each other with a holy kiss, as brothers and sisters. "},{"num":13,"verse":"All the saints here with me send you their greeting."},{"num":14,"verse":"May the grace of the Lord Jesus the Anointed, the love of God the Father, and the fellowship of the Holy Spirit remain with you all. [Amen.]"}]