[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 3:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 3:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The firstborn — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Who were God’s property: (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and to whom the administration of holy things was formerly committed, which now was taken away from them, either because they had forfeited this privilege by joining with the rest of their brethren in the idolatrous worship of the calf, or because they were to be mainly concerned in the distribution and management of the inheritances which now they were going to possess, and therefore could not be at leisure to attend upon the service of the sanctuary: and God would not commit it to some other persons in each tribe, which might be an occasion of idolatry, confusion, division, and contempt of sacred things, but to one distinct tribe, which might be entirely devoted to that service, and particularly to the tribe of Levi; partly out of his respect to Moses and Aaron, branches of this tribe; partly as a recompense of their zeal for God against idolaters, and partly because it was the smallest of the tribes, and therefore most likely to find both employment in, and maintenance for the work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-13 There was much work belonging to the priests' office, and there were now only Aaron and his two sons to do it; God appoints the Levites to attend them. Those whom God finds work for, he will find help for. The Levites were taken instead of the first-born. When He that made us, saves us, as the first-born of Israel were saved, we are laid under further obligations to serve him faithfully. God's right to us by redemption, confirms the right he has to us by creation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "keep his charge - i. e. so assist him that the obligations incumbent on him and on the congregation may be fulfilled. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11-13. I have taken the Levites, &c.—The consecration of this tribe did not originate in the legislative wisdom of Moses, but in the special appointment of God, who chose them as substitutes for the first-born. By an appointment made in memory of the last solemn judgment on Egypt (from which the Israelitish households were miraculously exempt) all the first-born were consecrated to God (Ex 13:12; 22:29), who thus, under peculiar circumstances, seemed to adopt the patriarchal usage of appointing the oldest to act as the priest of the family. But the privilege of redemption that was allowed the first-born opened the way for a change; and accordingly, on the full organization of the Mosaic economy, the administration of sacred things formerly committed to the first-born was transferred from them to the Levites, who received that honor partly as a tribute to Moses and Aaron, partly because this tribe had distinguished themselves by their zeal in the affair of the golden calf (Ex 32:29), and also because, being the smallest of the tribes, they could ill find suitable employment and support in the work. (See on [55]De 33:8). The designation of a special class for the sacred offices of religion was a wise arrangement; for, on their settlement in Canaan, the people would be so occupied that they might not be at leisure to wait on the service of the sanctuary, and sacred things might, from various causes, fall into neglect. But the appointment of an entire tribe to the divine service ensured the regular performance of the rites of religion. The subsequent portion of the chapter relates to the formal substitution of this tribe.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I am the Lord—that is, I decree it to be so; and being possessed of sovereign authority, I expect full obedience.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Instead of all the first-born, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who were God’s propriety by right of redemption, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 13:12",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to whom the administration of holy things was formerly committed, which now was taken away from them, either because they had forfeited this privilege by joining with the rest of their brethren in the idolatrous worship of the calf, or because they were to be mainly concerned in the distribution and management of the inheritances which now they were going to possess, and therefore could not be at leisure to attend upon the service of the sanctuary; which made it fit that this work should be committed to other hands. And God would not commit it to some other persons in each tribe, which might be an occasion of idolatry, confusion, division, and contempt of sacred things, but to one distinct tribe, which might be entirely devoted to that service, and particularly to the tribe of Levi; partly, out of his respect to Moses and Aaron, branches of this tribe; partly, as a recompence of their zeal for God and against idolaters; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 32:26,29 Deu 33:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 32:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",29 Deu 33:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and partly, because it was the smallest of the tribes, and therefore most likely to find both employment in and maintenance for the work. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I, behold, I have taken the Levites from among the children of Israel,.... Separated them from others, and set them apart for the service of the sanctuary; this was his own act and deed, and which he did of his own will and pleasure, who is a sovereign Being, and might and would do whatsoever he pleased, nor should any object unto him, or contradict him: and this he did: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "instead of all the firstborn that openeth the matrix among the children of Israel; he made an exchange of those for the Levites; upon the destruction of the firstborn of Egypt, and saving the firstborn of Israel, he claimed the latter as his own in a special sense, and now he gave up his right to them, and instead thereof took the Levites; nor could the people of Israel reasonably object to this, nor be uneasy at it, but rather be pleased with it; since hereby they were not only freed from the charge of redeeming their firstborn, but since they were the Lord's, he might have appointed them to be servants to the priests; and every Israelite would choose rather, no doubt, to part with a tribe for this service than to have their firstborn sons employed in it; and there were none so fit as the tribe of Levi, not only because it was a small tribe, but because the priests were of this tribe, to whom they were to minister; and therefore as there was a connection between them, the Levites would readily serve them: it is a notion that has obtained both among Jews and Christians, that the firstborn before this time were priests in the family, but now the Levites were taken in their room; and Jarchi particularly observes, that when the firstborn sinned in the business of the calf, they were rejected, and the Levites, who did not commit idolatry, were chosen in their room; but it does not appear, before the fixing the priesthood in Aaron's family, that the firstborn in a family were priests, and officiated as such, but rather the father and head of the family for the whole, or everyone for himself, as in Adam's family, he and his two sons; and moreover, it was a recent thing, and only among the Hebrews, that the firstborn were in a peculiar manner the Lord's, not as priests, only to be redeemed, and now the Levites were redeemed in their room; it was not to be priests, but the servants of the priests (r): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "therefore the Levites shall be mine; whom he gave to the priests to assist them in their work, which was for him and his glory. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) Vid. Outram. de Sacrificiis, l. 1. c. 4. sect. 1, 2, 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) Vid. Outram. de Sacrificiis, l. 1. c. 4. sect. 1, 2, 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I, behold, I have taken the Levites from among the children of Israel instead of all the firstborn that openeth the matrix among the children of Israel: therefore the Levites shall be mine;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All male first-born of men and animals are sacred to God, i.e. they must be sacrificed. In very primitive ages it is probable that this custom actually prevailed (cf. Genesis 22, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 3:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but the Israelite practice of redeeming human first-born by an equivalent in money or animals must have arisen at an early date. The practice of offering the firstborn is enjoined in J E (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (E ), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 13:11-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Note: J, however, differs from P in dating the offering of first-born not from the Exodus but from the entrance into Canaan.] , ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 34:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. (J )), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. (P ), and the redemption (in P ) is to be by a money payment. But at this point, in P , a different form of redemption is commanded, i.e. the handing over of the Levites for service. This subject is resumed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Numbers 3:40-51",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 3:40-51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is explained that the Levites were substituted only for those firstborn who were more than a month old at the time.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I have taken the Levites.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The actual separation of Levi had been already anticipated (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:47, 53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but the meaning and purpose of that separation is now formally declared, into reason, however, is assigned for the choice of this particular tribe. It is almost always assumed that their zeal in the matter of the golden calf was the ground of the preference shown to them now. But it may be doubted whether there was any \"preference\" in the matter at all. To Aaron and his seed on undoubted and important preference was shown, but the functions and position of the Levites were not such as to give them any preeminence, or to secure them any substantial advantage. They were tied down to the performance of routine duties, which demanded no intelligence, and gave scope for no ambitions. The one obvious reason why Levi was selected is to be found in the fact that he was by far the smallest in numbers among the tribes, being less than half the next smallest, Manasseh, and almost exactly balancing the first-born. A larger tribe could not have been spared, and would not have been needed, for the purpose in question. If any more recondite motive must be sought for the Divine selection, it must be found in the prophecy of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Levi as well as Simeon, though in a different way, was doomed never to raise his head as a united and powerful tribe among his brethren. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "pc_st_rem",
        "text": "Numbers 3:13 Verse 13. - Because all the first-born are mine (see Exodus 13:2, and below on verse 43). That the powers of heaven had a special claim upon the firstling of man or beast was probably one of the oldest religious ideas in the world, which it would be difficult to trace to any origin but in some primeval revelation. It branched out into many superstitions, of which the cruel cultus of Moloch was the worst. Among the tribes which preserved the patriarchal faith, it retained more or less of its primitive meaning in the assignment of sacrificial duties to the eldest son. According to the Targums, the \"young men of the children of Israel\" sent by Moses to offer sacrifices before the consecration of Aaron (Exodus 24:5) were first-born. Whatever ancient and latent claims, however, God may have had upon the firstborn of Israel, they are here superseded by a special and recent claim founded upon their miraculous preservation when the first-born of the Egyptians were slain. All the firstborn in that day became \"anathema,\" devoted to God, for evil or for good, for death or for life. He, to whom belongs the whole harvest of human souls, came and claimed his first-fruits from the fields of Egypt. He took unto himself by death the first-born of the Egyptians; he left for himself in life the first-born of the Israelites. For the convenience, however, of the people, and for the better and more regular discharge of the ministry, he was content to take the single small tribe of Levi in lieu of the first-born of all. Numbers 3:12 Verse 12. - Instead of all the first-born. The Septuagint inserts here, \"they shall be their ransom.\" Numbers 3:13 Verse 13. - Mine shall they be: I am the Lord. Rather, \"mine shall they be, mine, the Lord's.\" Numbers 3:15 Verse 15. - From a month old. The first-born were to be redeemed \"from a month old\" (Numbers 18:16). Numbers 3:12Keil and Delitzsch Biblical Commentary on the Old TestamentGod appointed the Levites for this service, because He had decided to adopt them as His own in the place of all the first-born of Egypt. When He slew the first-born of Egypt, He sanctified to Himself all the first-born of Israel, of man and beast, for His own possession (see Exodus 13:1-2). By virtue of this sanctification, which was founded upon the adoption of the whole nation as His first-born son, the nation was required to dedicate to Him its first-born sons for service at the sanctuary, and sacrifice all the first-born of its cattle to Him. But now the Levites and their cattle were to be adopted in their place, and the first-born sons of Israel to be released in return (Numbers 3:40.). By this arrangement, through which the care of the service at the sanctuary was transferred to one tribe, which would and should henceforth devote itself with undivided interest to this vocation, not only was a more orderly performance of this service secured, than could have been effected through the first-born of all the tribes; but so far as the whole nation was concerned, the fulfilment of its obligations in relation to this service was undoubtedly facilitated. Moreover, the Levites had proved themselves to be the most suitable of all the tribes for his post, through their firm and faithful defence of the honour of the Lord at the worship of the golden calf (Exodus 32:26.). It is in this spirit, which distinguished the tribe of Levi, that we may undoubtedly discover the reason why they were chosen by God for the service of the sanctuary, and not in the fact that Moses and Aaron belonged to the tribe, and desired to form a hierarchical caste of the members of their own tribe, such as was to be found among other nations: the magi, for example, among the Medes, the Chaldeans among the Persians, and the Brahmins among the Indians. יהוה אני לי, \"to Me, to Me, Jehovah\" (Numbers 3:13, Numbers 3:41, and Numbers 3:45; cf. Ges. 121, 3). LinksNumbers 3:12 InterlinearNumbers 3:12 Parallel TextsNumbers 3:12 NIVNumbers 3:12 NLTNumbers 3:12 ESVNumbers 3:12 NASBNumbers 3:12 KJVNumbers 3:12 Bible AppsNumbers 3:12 ParallelNumbers 3:12 Biblia ParalelaNumbers 3:12 Chinese BibleNumbers 3:12 French BibleNumbers 3:12 German BibleBible Hub",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Numbers 3:13 ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_sub_title",
            "text": "Verse 13.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "Because all the first-born are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mine (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and below on verse 43). That the powers of heaven had a special claim upon the firstling of man or beast was probably one of the oldest religious ideas in the world, which it would be difficult to trace to any origin but in some primeval revelation. It branched out into many superstitions, of which the cruel cultus of Moloch was the worst. Among the tribes which preserved the patriarchal faith, it retained more or less of its primitive meaning in the assignment of sacrificial duties to the eldest son. According to the Targums, the \"young men of the children of Israel\" sent by Moses to offer sacrifices before the consecration of Aaron (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 24:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") were first-born. Whatever ancient and latent claims, however, God may have had upon the firstborn of Israel, they are here superseded by a special and recent claim founded upon their miraculous preservation when the first-born of the Egyptians were slain. All the firstborn in that day became \"anathema,\" devoted to God, for evil or for good, for death or for life. He, to whom belongs the whole harvest of human souls, came and claimed his first-fruits from the fields of Egypt. He took unto himself by death the first-born of the Egyptians; he left for himself in life the first-born of the Israelites. For the convenience, however, of the people, and for the better and more regular discharge of the ministry, he was content to take the single small tribe of Levi in lieu of the first-born of all. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "pc_st_rem",
            "text": "Numbers 3:12 Verse 12. - Instead of all the first-born. The Septuagint inserts here, \"they shall be their ransom.\" Numbers 3:13 Verse 13. - Mine shall they be: I am the Lord. Rather, \"mine shall they be, mine, the Lord's.\" Numbers 3:15 Verse 15. - From a month old. The first-born were to be redeemed \"from a month old\" (Numbers 18:16). Numbers 3:12Keil and Delitzsch Biblical Commentary on the Old TestamentGod appointed the Levites for this service, because He had decided to adopt them as His own in the place of all the first-born of Egypt. When He slew the first-born of Egypt, He sanctified to Himself all the first-born of Israel, of man and beast, for His own possession (see Exodus 13:1-2). By virtue of this sanctification, which was founded upon the adoption of the whole nation as His first-born son, the nation was required to dedicate to Him its first-born sons for service at the sanctuary, and sacrifice all the first-born of its cattle to Him. But now the Levites and their cattle were to be adopted in their place, and the first-born sons of Israel to be released in return (Numbers 3:40.). By this arrangement, through which the care of the service at the sanctuary was transferred to one tribe, which would and should henceforth devote itself with undivided interest to this vocation, not only was a more orderly performance of this service secured, than could have been effected through the first-born of all the tribes; but so far as the whole nation was concerned, the fulfilment of its obligations in relation to this service was undoubtedly facilitated. Moreover, the Levites had proved themselves to be the most suitable of all the tribes for his post, through their firm and faithful defence of the honour of the Lord at the worship of the golden calf (Exodus 32:26.). It is in this spirit, which distinguished the tribe of Levi, that we may undoubtedly discover the reason why they were chosen by God for the service of the sanctuary, and not in the fact that Moses and Aaron belonged to the tribe, and desired to form a hierarchical caste of the members of their own tribe, such as was to be found among other nations: the magi, for example, among the Medes, the Chaldeans among the Persians, and the Brahmins among the Indians. יהוה אני לי, \"to Me, to Me, Jehovah\" (Numbers 3:13, Numbers 3:41, and Numbers 3:45; cf. Ges. 121, 3). LinksNumbers 3:12 InterlinearNumbers 3:12 Parallel TextsNumbers 3:12 NIVNumbers 3:12 NLTNumbers 3:12 ESVNumbers 3:12 NASBNumbers 3:12 KJVNumbers 3:12 Bible AppsNumbers 3:12 ParallelNumbers 3:12 Biblia ParalelaNumbers 3:12 Chinese BibleNumbers 3:12 French BibleNumbers 3:12 German BibleBible Hub",
            "children": []
          }
        ]
      }
    ]
  }
]