[{"num":12,"verse":"And he began to say to them in parables, A man planted a vineyard, and made a fence round [it] and dug a wine-vat, and built a tower, and let it out to husbandmen, and left the country."},{"num":2,"verse":"And he sent a bondman to the husbandmen at the season, that he might receive from the husbandmen of the fruit of the vineyard."},{"num":3,"verse":"But they took him, and beat [him], and sent [him] away empty."},{"num":4,"verse":"And again he sent to them another bondman; and [at] him they [threw stones, and] struck [him] on the head, and sent [him] away with insult."},{"num":5,"verse":"And [again] he sent another, and him they killed; and many others, beating some and killing some."},{"num":6,"verse":"Having yet therefore one beloved son, he sent also him to them the last, saying, They will have respect for my son."},{"num":7,"verse":"But those husbandmen said to one another, This is the heir: come, let us kill him and the inheritance will be ours."},{"num":8,"verse":"And they took him and killed him, and cast him forth out of the vineyard."},{"num":9,"verse":"What therefore shall the lord of the vineyard do? He will come and destroy the husbandmen, and will give the vineyard to others."},{"num":10,"verse":"Have ye not even read this scripture, The stone which they that builded rejected, this has become the corner-stone:"},{"num":11,"verse":"this is of [the] Lord, and it is wonderful in our eyes?"},{"num":12,"verse":"And they sought to lay hold of him, and they feared the crowd; for they knew that he had spoken the parable of them. And they left him and went away."},{"num":13,"verse":"And they send to him certain of the Pharisees and of the Herodians, that they might catch him in speaking."},{"num":14,"verse":"And they come and say to him, Teacher, we know that thou art true, and carest not for any one; for thou regardest not men's person, but teachest the way of God with truth: Is it lawful to give tribute to Caesar or not?"},{"num":15,"verse":"Should we give, or should we not give? But he knowing their hypocrisy said unto them, Why tempt ye me? Bring me a denarius that I may see [it]."},{"num":16,"verse":"And they brought [it]. And he says to them, Whose [is] this image and superscription? And they said to him, Caesar's."},{"num":17,"verse":"And Jesus answering said to them, Pay what is Caesar's to Caesar, and what is God's to God. And they wondered at him."},{"num":18,"verse":"And Sadducees come to him, that say there is no resurrection; and they demanded of him saying,"},{"num":19,"verse":"Teacher, Moses wrote to us that if any one's brother die, and leave a wife behind, and leave no children, that his brother shall take his wife, and raise up seed to his brother."},{"num":20,"verse":"There were seven brethren; and the first took a wife, and dying did not leave seed;"},{"num":21,"verse":"and the second took her and died, and neither did he leave seed; and the third likewise."},{"num":22,"verse":"And the seven [took her and] did not leave seed. Last of all the woman also died."},{"num":23,"verse":"In the resurrection, when they shall rise again, of which of them shall she be wife, for the seven had her as wife?"},{"num":24,"verse":"And Jesus answering said to them, Do not ye therefore err, not knowing the scriptures, nor the power of God?"},{"num":25,"verse":"For when they rise from among [the] dead they neither marry, nor are given in marriage, but are as angels [who are] in the heavens."},{"num":26,"verse":"But concerning the dead that they rise, have ye not read in the book of Moses, in [the section of] the bush, how God spoke to him, saying, *I* [am] the God of Abraham, and the God of Isaac, and the God of Jacob?"},{"num":27,"verse":"He is not the God of [the] dead, but of [the] living. *Ye* therefore greatly err."},{"num":28,"verse":"And one of the scribes who had come up, and had heard them reasoning together, perceiving that he had answered them well, demanded of him, Which is [the] first commandment of all?"},{"num":29,"verse":"And Jesus answered him, [The] first commandment of all [is], Hear, Israel: the Lord our God is one Lord;"},{"num":30,"verse":"and thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thine understanding, and with all thy strength. This is [the] first commandment."},{"num":31,"verse":"And a second like it [is] this: Thou shalt love thy neighbour as thyself. There is not another commandment greater than these."},{"num":32,"verse":"And the scribe said to him, Right, teacher; thou hast spoken according to [the] truth. For he is one, and there is none other besides him;"},{"num":33,"verse":"and to love him with all the heart, and with all the intelligence, and with all the soul, and with all the strength, and to love one's neighbour as one's self, is more than all the burnt-offerings and sacrifices."},{"num":34,"verse":"And Jesus, seeing that he had answered intelligently, said to him, Thou art not far from the kingdom of God. And no one dared question him any more."},{"num":35,"verse":"And Jesus answering said [as he was] teaching in the temple, How do the scribes say that the Christ is son of David?"},{"num":36,"verse":"[for] David himself said [speaking] in the Holy Spirit, The Lord said to my Lord, Sit on my right hand until I put thine enemies [as] footstool of thy feet."},{"num":37,"verse":"David himself [therefore] calls him Lord, and whence is he his son? And the mass of the people heard him gladly."},{"num":38,"verse":"And he said to them in his doctrine, Beware of the scribes, who like to walk about in long robes, and salutations in the marketplaces,"},{"num":39,"verse":"and first seats in the synagogues, and first places at suppers;"},{"num":40,"verse":"who devour the houses of widows, and as a pretext make long prayers. These shall receive a severer judgment."},{"num":41,"verse":"And Jesus, having sat down opposite the treasury, saw how the crowd was casting money into the treasury; and many rich cast in much."},{"num":42,"verse":"And a poor widow came and cast in two mites, which is a farthing."},{"num":43,"verse":"And having called his disciples to [him] he said to them, Verily I say unto you, This poor widow has cast in more than all who have cast into the treasury:"},{"num":44,"verse":"for all have cast in of that which they had in abundance, but she of her destitution has cast in all that she had, the whole of her living."}]