[{"header":"Chapter 12"},{"num":1,"verse":"Parable of the Tenants. He began to speak to them in parables. “A man planted a vineyard, put a hedge around it, dug a wine press, and built a tower. Then he leased it to tenant farmers and left on a journey. "},{"num":2,"verse":"At the proper time he sent a servant to the tenants to obtain from them some of the produce of the vineyard. "},{"num":3,"verse":"But they seized him, beat him, and sent him away empty-handed. "},{"num":4,"verse":"Again he sent them another servant. And that one they beat over the head and treated shamefully. "},{"num":5,"verse":"He sent yet another whom they killed. So, too, many others; some they beat, others they killed. "},{"num":6,"verse":"He had one other to send, a beloved son. He sent him to them last of all, thinking, ‘They will respect my son.’ "},{"num":7,"verse":"But those tenants said to one another, ‘This is the heir. Come, let us kill him, and the inheritance will be ours.’ "},{"num":8,"verse":"So they seized him and killed him, and threw him out of the vineyard. "},{"num":9,"verse":"What [then] will the owner of the vineyard do? He will come, put the tenants to death, and give the vineyard to others. "},{"num":10,"verse":"Have you not read this scripture passage:"},{"num":12,"verse":"They were seeking to arrest him, but they feared the crowd, for they realized that he had addressed the parable to them. So they left him and went away."},{"num":13,"verse":"Paying Taxes to the Emperor. They sent some Pharisees and Herodians to him to ensnare him in his speech. "},{"num":14,"verse":"They came and said to him, “Teacher, we know that you are a truthful man and that you are not concerned with anyone’s opinion. You do not regard a person’s status but teach the way of God in accordance with the truth. Is it lawful to pay the census tax to Caesar or not? Should we pay or should we not pay?” "},{"num":15,"verse":"Knowing their hypocrisy he said to them, “Why are you testing me? Bring me a denarius to look at.” "},{"num":16,"verse":"They brought one to him and he said to them, “Whose image and inscription is this?” They replied to him, “Caesar’s.” "},{"num":17,"verse":"So Jesus said to them, “Repay to Caesar what belongs to Caesar and to God what belongs to God.” They were utterly amazed at him."},{"num":18,"verse":"Some Sadducees, who say there is no resurrection, came to him and put this question to him, "},{"num":19,"verse":"saying, “Teacher, Moses wrote for us, ‘If someone’s brother dies, leaving a wife but no child, his brother must take the wife and raise up descendants for his brother.’ "},{"num":20,"verse":"Now there were seven brothers. The first married a woman and died, leaving no descendants. "},{"num":21,"verse":"So the second married her and died, leaving no descendants, and the third likewise. "},{"num":22,"verse":"And the seven left no descendants. Last of all the woman also died. "},{"num":23,"verse":"At the resurrection [when they arise] whose wife will she be? For all seven had been married to her.” "},{"num":24,"verse":"Jesus said to them, “Are you not misled because you do not know the scriptures or the power of God? "},{"num":25,"verse":"When they rise from the dead, they neither marry nor are given in marriage, but they are like the angels in heaven. "},{"num":26,"verse":"As for the dead being raised, have you not read in the Book of Moses, in the passage about the bush, how God told him, ‘I am the God of Abraham, [the] God of Isaac, and [the] God of Jacob’? "},{"num":27,"verse":"He is not God of the dead but of the living. You are greatly misled.”"},{"num":28,"verse":"One of the scribes, when he came forward and heard them disputing and saw how well he had answered them, asked him, “Which is the first of all the commandments?” "},{"num":29,"verse":"Jesus replied, “The first is this: ‘Hear, O Israel! The Lord our God is Lord alone! "},{"num":30,"verse":"You shall love the Lord your God with all your heart, with all your soul, with all your mind, and with all your strength.’ "},{"num":31,"verse":"The second is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.” "},{"num":32,"verse":"The scribe said to him, “Well said, teacher. You are right in saying, ‘He is One and there is no other than he.’ "},{"num":33,"verse":"And ‘to love him with all your heart, with all your understanding, with all your strength, and to love your neighbor as yourself’ is worth more than all burnt offerings and sacrifices.” "},{"num":34,"verse":"And when Jesus saw that [he] answered with understanding, he said to him, “You are not far from the kingdom of God.” And no one dared to ask him any more questions."},{"num":35,"verse":"As Jesus was teaching in the temple area he said, “How do the scribes claim that the Messiah is the son of David? "},{"num":36,"verse":"David himself, inspired by the holy Spirit, said:"},{"num":37,"verse":"David himself calls him ‘lord’; so how is he his son?” [The] great crowd heard this with delight."},{"num":38,"verse":"In the course of his teaching he said, “Beware of the scribes, who like to go around in long robes and accept greetings in the marketplaces, "},{"num":39,"verse":"seats of honor in synagogues, and places of honor at banquets. "},{"num":40,"verse":"They devour the houses of widows and, as a pretext, recite lengthy prayers. They will receive a very severe condemnation.”"},{"num":41,"verse":"He sat down opposite the treasury and observed how the crowd put money into the treasury. Many rich people put in large sums. "},{"num":42,"verse":"A poor widow also came and put in two small coins worth a few cents. "},{"num":43,"verse":"Calling his disciples to himself, he said to them, “Amen, I say to you, this poor widow put in more than all the other contributors to the treasury. "},{"num":44,"verse":"For they have all contributed from their surplus wealth, but she, from her poverty, has contributed all she had, her whole livelihood.”"}]