[{"header":"The Story of the Renters"},{"num":12,"verse":"Jesus began to speak to the people using stories. He said, “A man planted a vineyard. He put a wall around it. He dug a pit for a winepress. He also built a lookout tower. He rented the vineyard out to some farmers. Then he went to another place. "},{"num":2,"verse":"At harvest time he sent a servant to the renters. He told the servant to collect from them some of the fruit of the vineyard. "},{"num":3,"verse":"But they grabbed the servant and beat him up. Then they sent him away with nothing. "},{"num":4,"verse":"So the man sent another servant to the renters. They hit this one on the head and treated him badly. "},{"num":5,"verse":"The man sent still another servant. The renters killed him. The man sent many others. The renters beat up some of them. They killed the others."},{"num":6,"verse":"“The man had one person left to send. It was his son, and he loved him. He sent him last of all. He said, ‘They will respect my son.’"},{"num":7,"verse":"“But the renters said to each other, ‘This is the one who will receive all the owner’s property someday. Come, let’s kill him. Then everything will be ours.’ "},{"num":8,"verse":"So they took him and killed him. They threw him out of the vineyard."},{"num":9,"verse":"“What will the owner of the vineyard do then? He will come and kill those renters. He will give the vineyard to others. "},{"num":10,"verse":"Haven’t you read what this part of Scripture says,"},{"num":12,"verse":"Then the chief priests, the teachers of the law and the elders looked for a way to arrest Jesus. They knew he had told the story against them. But they were afraid of the crowd. So they left him and went away."},{"header":"Is It Right to Pay the Royal Tax to Caesar?"},{"num":13,"verse":"Later the religious leaders sent some of the Pharisees and Herodians to Jesus. They wanted to trap him with his own words. "},{"num":14,"verse":"They came to him and said, “Teacher, we know that you are a man of honor. You don’t let other people tell you what to do or say. You don’t care how important they are. But you teach the way of God truthfully. Is it right to pay the royal tax to Caesar or not? "},{"num":15,"verse":"Should we pay or shouldn’t we?”"},{"num":16,"verse":"They brought the coin. He asked them, “Whose picture is this? And whose words?”"},{"num":17,"verse":"Then Jesus said to them, “Give back to Caesar what belongs to Caesar. And give back to God what belongs to God.”"},{"header":"Marriage When the Dead Rise"},{"num":18,"verse":"The Sadducees came to Jesus with a question. They do not believe that people rise from the dead. "},{"num":19,"verse":"“Teacher,” they said, “Moses wrote for us about a man who died and didn’t have any children. But he did leave a wife behind. That man’s brother must get married to the widow. He must provide children to carry on his dead brother’s name. "},{"num":20,"verse":"There were seven brothers. The first one got married. He died without leaving any children. "},{"num":21,"verse":"The second one got married to the widow. He also died and left no child. It was the same with the third one. "},{"num":22,"verse":"In fact, none of the seven left any children. Last of all, the woman died too. "},{"num":23,"verse":"When the dead rise, whose wife will she be? All seven of them were married to her.”"},{"num":24,"verse":"Jesus replied, “You are mistaken because you do not know the Scriptures. And you do not know the power of God. "},{"num":25,"verse":"When the dead rise, they won’t get married. And their parents won’t give them to be married. They will be like the angels in heaven. "},{"num":26,"verse":"What about the dead rising? Haven’t you read in the Book of Moses the story of the burning bush? God said to Moses, ‘I am the God of Abraham. I am the God of Isaac. And I am the God of Jacob.’ (Exodus 3:6) "},{"num":27,"verse":"He is not the God of the dead. He is the God of the living. You have made a big mistake!”"},{"header":"The Most Important Commandment"},{"num":28,"verse":"One of the teachers of the law came and heard the Sadducees arguing. He noticed that Jesus had given the Sadducees a good answer. So he asked him, “Which is the most important of all the commandments?”"},{"num":29,"verse":"Jesus answered, “Here is the most important one. Moses said, ‘Israel, listen to me. The Lord is our God. The Lord is one. "},{"num":30,"verse":"Love the Lord your God with all your heart and with all your soul. Love him with all your mind and with all your strength.’ (Deuteronomy 6:4,5) "},{"num":31,"verse":"And here is the second one. ‘Love your neighbor as you love yourself.’ (Leviticus 19:18) There is no commandment more important than these.”"},{"num":32,"verse":"“You have spoken well, teacher,” the man replied. “You are right in saying that God is one. There is no other God but him. "},{"num":33,"verse":"To love God with all your heart and mind and strength is very important. So is loving your neighbor as you love yourself. These things are more important than all burnt offerings and sacrifices.”"},{"num":34,"verse":"Jesus saw that the man had answered wisely. He said to him, “You are not far from God’s kingdom.” From then on, no one dared to ask Jesus any more questions."},{"header":"Whose Son Is the Messiah?"},{"num":35,"verse":"Jesus was teaching in the temple courtyard. He asked, “Why do the teachers of the law say that the Messiah is the son of David? "},{"num":36,"verse":"The Holy Spirit spoke through David himself. David said,"},{"num":37,"verse":"David himself calls him ‘Lord.’ So how can he be David’s son?”"},{"header":"Warning Against the Teachers of the Law"},{"num":38,"verse":"As he taught, he said, “Watch out for the teachers of the law. They like to walk around in long robes. They like to be greeted with respect in the market. "},{"num":39,"verse":"They love to have the most important seats in the synagogues. They also love to have the places of honor at dinners. "},{"num":40,"verse":"They take over the houses of widows. They say long prayers to show off. God will punish these men very much.”"},{"header":"The Widow’s Offering"},{"num":41,"verse":"Jesus sat down across from the place where people put their temple offerings. He watched the crowd putting their money into the offering boxes. Many rich people threw large amounts into them. "},{"num":42,"verse":"But a poor widow came and put in two very small copper coins. They were worth only a few pennies."},{"num":43,"verse":"Jesus asked his disciples to come to him. He said, “What I’m about to tell you is true. That poor widow has put more into the offering box than all the others. "},{"num":44,"verse":"They all gave a lot because they are rich. But she gave even though she is poor. She put in everything she had. That was all she had to live on.”"}]