[{"header":"The Picture-Story of the Grape-Field (A)"},{"num":12,"verse":"Jesus began to teach them by using picture-stories, saying, “There was a man who planted grapes in a field. He put a fence around it and made a place for making wine. He built a tower to look over the field. Then he let farmers rent it and went into another country. "},{"num":12,"verse":"The leaders wanted to take Him but they were afraid of the people. They knew He had told the picture-story against them. They left Him and went away."},{"header":"They Try to Trap Jesus (C)"},{"num":13,"verse":"Some of the proud religious law-keepers and Herod’s men were sent to trap Jesus in His talk. "},{"num":14,"verse":"They came to Him and said, “Teacher, we know You are true. We know You are not afraid of what men think or say about You. You teach the way of God in truth. Is it right to pay taxes to Caesar or not? "},{"num":15,"verse":"Should we pay or not pay?” Jesus knew how they pretended to be someone they were not. He said to them, “Why do you try to trap Me? Bring Me a small piece of money so I may look at it.” "},{"num":16,"verse":"They brought Him one. He asked them, “Whose picture is this? Whose name is on it?” They answered, “Caesar’s.” "},{"num":17,"verse":"Then Jesus said to them, “Pay to Caesar the things that belong to Caesar. Pay to God the things that belong to God.” They were surprised and wondered at Him."},{"header":"They Ask about Being Raised from the Dead (D)"},{"num":18,"verse":"Some people from the religious group who believe no one will be raised from the dead came to Jesus. They asked Him, "},{"num":19,"verse":"“Teacher, Moses gave us a Law. It said, ‘If a man’s brother dies and leaves his wife behind, but no children, then his brother should marry his wife and raise children for his brother.’  "},{"num":20,"verse":"There were seven brothers. The first was married. He died before he had any children. "},{"num":21,"verse":"The second married her and died. He had no children. The same happened with the third. "},{"num":22,"verse":"All seven had her for a wife. All died without children. Last of all the woman died. "},{"num":23,"verse":"When people are raised from the dead, whose wife will she be? All seven had her for a wife.” "},{"num":24,"verse":"Jesus said to them, “Is this not the reason you are wrong, because you do not know the Holy Writings or the power of God? "},{"header":"The Great Law (G)"},{"num":28,"verse":"Then one of the teachers of the Law heard them arguing. He thought Jesus had spoken well. He asked Him, “Which Law is the greatest of all?” "},{"num":29,"verse":"Jesus said to him, “The greatest Law is this, ‘Listen, Jewish people, The Lord our God is one Lord! "},{"num":32,"verse":"Then the teacher of the Law said, “Teacher, You have told the truth. There is one God. There is no other God but Him. "},{"num":33,"verse":"A man should love Him with all his heart and with all his understanding. He should love Him with all his soul and with all his strength and love his neighbor as himself. This is more important than to bring animals to be burned on the altar or to give God other gifts on the altar in worship.” "},{"num":34,"verse":"Jesus saw he had spoken with understanding. He said to him, “You are not far from the holy nation of God.” After that no one thought they could ask Him anything."},{"header":"Jesus Asks the Proud Religious Law-Keepers about the Christ (J)"},{"num":35,"verse":"Jesus was in the house of God teaching. He asked, “How do the teachers of the Law say that Christ is the Son of David? "},{"header":"False Teachers (L)"},{"num":38,"verse":"Jesus taught them, saying, “Look out for the teachers of the Law. They like to walk around in long coats. They like to have the respect of men as they stand in the center of town where people gather. "},{"header":"The Woman Whose Husband Had Died Gave All She Had (M)"},{"num":41,"verse":"Jesus sat near the money box in the house of God. He watched the people putting in money. Many of them were rich and gave much money. "},{"num":42,"verse":"A poor woman whose husband had died came by and gave two very small pieces of money."},{"num":43,"verse":"Jesus called His followers to Him. He said, “For sure, I tell you, this poor woman whose husband has died has given more money than all the others. "}]