[{"header":"Taking the Kingdom by Force"},{"num":12,"verse":"Yeshua began to speak to them in parables: “A man planted a vineyard. He put a hedge around it, dug a pit for the winepress, and built a tower. He leased it to some tenant farmers and went on a journey. "},{"num":2,"verse":"And at the season, he sent a servant to collect from the tenants part of the vineyard’s fruit. "},{"num":3,"verse":"But grabbing him, they beat him up and sent him away empty-handed. "},{"num":4,"verse":"And again the man sent another servant to them, and they wounded his head and treated him shamefully. "},{"num":5,"verse":"He sent another, and that one they killed; and so on with many others, beating some and killing some. "},{"num":6,"verse":"He had yet one, a well-loved son. He sent him to them last of all, saying, ‘They will respect my son.’"},{"num":7,"verse":"“But those tenants said to one another, ‘This is the heir! Come on, let’s kill him and the inheritance will be ours!’ "},{"num":8,"verse":"So grabbing the son, they killed him and threw him out of the vineyard."},{"num":9,"verse":"“What then will the master of the vineyard do? He will come and destroy the tenants and give the vineyard to others. "},{"num":10,"verse":"Haven’t you read this Scripture?"},{"num":12,"verse":"They were trying to seize Yeshua, because they realized that He spoke the parable against them. But they feared the crowd, so they left Him and went away."},{"header":"A Test of Loyalty"},{"num":13,"verse":"Then they send some of the Pharisees and Herodians to Yeshua in order to trap Him with a word. "},{"num":14,"verse":"They come and say to Him, “Teacher, we know that You are honest, and what others think doesn’t concern You. You don’t look at men’s appearance, but teach the way of God according to the truth. Is it permitted to pay taxes to Caesar, or not? "},{"num":15,"verse":"Should we pay, or shouldn’t we?”"},{"num":16,"verse":"They brought one. And He said to them, “Whose image is this? And whose inscription?”"},{"num":17,"verse":"Then Yeshua said to them, “Give to Caesar the things that are Caesar’s, and to God the things that are God’s.” And they were completely amazed at Him."},{"header":"The Challenge of the Sadducees"},{"num":18,"verse":"Then Sadducees (who say there is no resurrection) came and began questioning Yeshua, saying, "},{"num":19,"verse":"“Teacher, Moses wrote for us that ‘if a man’s brother dies and leaves a wife but no children, then his brother should take the widow and father children for his brother.’"},{"num":20,"verse":" There were seven brothers; and the first took a wife and, when he died, left no offspring. "},{"num":21,"verse":"And the second took her and died, leaving no offspring, and the third likewise. "},{"num":22,"verse":"Now the seven left no offspring. Last of all, the woman died, too. "},{"num":23,"verse":"In the resurrection, when they rise up, whose wife will she be? For all seven had married her.”"},{"num":24,"verse":"Yeshua said to them, “Isn’t this the reason you’ve gone astray, because you don’t understand the Scriptures or the power of God? "},{"num":25,"verse":"For when they rise up from the dead, they neither marry nor are given in marriage, but are like angels in heaven. "},{"num":26,"verse":"But concerning the dead being raised, haven’t you read in the book of Moses about the burning bush? How God said to him, ‘I am the God of Abraham, and the God of Isaac, and the God of Jacob’?"},{"num":27,"verse":" He’s not the God of the dead, but of the living. You have gone far astray!”"},{"header":"Love Ends the Argument"},{"num":28,"verse":"One of the Torah scholars came and heard them debating. Seeing that Yeshua had answered them well, he asked Him, “Which commandment is first of all?”"},{"num":29,"verse":"Yeshua answered, “The first is, ‘Shema Yisrael, Adonai Eloheinu, Adonai echad. Hear, O Israel, the Lord our God, the Lord is One. "},{"num":30,"verse":"And you shall love Adonai your God with all your heart, and with all your soul, and with all your mind, and with all your strength.’"},{"num":31,"verse":" The second is this, ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.”"},{"num":32,"verse":"“Well said, Teacher,” the Torah scholar said to Him. “You have spoken the truth, that He is echad, and besides Him there is no other!"},{"num":33,"verse":" And ‘to love Him with all the heart, with all the understanding, and with all the strength,’ and ‘to love the neighbor as oneself,’ is much more than all burnt offerings and sacrifices.”"},{"num":34,"verse":"When Yeshua saw that he had answered wisely, He said to him, “You are not far from the kingdom of God.” And no one dared any longer to question Him."},{"header":"Who Is King David’s Lord?"},{"num":35,"verse":"While Yeshua was teaching in the Temple, He said, “How is it that the Torah scholars say that the Messiah is Ben-David? "},{"num":36,"verse":"David himself, through the Ruach ha-Kodesh, said,"},{"num":37,"verse":"If David himself calls Him ‘Lord,’ in what way is He his son?” And the large crowd was listening to Him with delight."},{"num":38,"verse":"In His teaching He said, “Watch out for the Torah scholars, who like to walk around in long robes. They like greetings in the marketplaces, "},{"num":39,"verse":"the best seats in the synagogues, and places of honor at feasts. "},{"num":40,"verse":"They devour widows’ houses and make long prayers as a show. These men will receive greater condemnation!”"},{"num":41,"verse":"He sat down opposite the treasury and began watching how the people were putting money into the offering box. Many rich people were putting in a lot. "},{"num":42,"verse":"Then a poor widow came and put in two small copper coins, worth less than a penny. "},{"num":43,"verse":"Calling His disciples over, He said to them, “Amen, I tell you, this poor widow has put in more than all those contributing to the box! "},{"num":44,"verse":"For they all put in from their surplus; but she, out of her poverty, put in everything she had, her whole living.”"}]