[{"num":12,"verse":"Jesus then began to speak to the disciples in stories. `A man planted a farm of vines for growing fruit called grapes. He put a fence of small trees around it. He dug a place to press the juice from the fruit. He built a high house from which men could watch over the farm. Then he let some men pay to use it and went to a country far away."},{"num":2,"verse":"At harvest time the owner sent one his servants to get some of the fruit from the farm."},{"num":3,"verse":"The men took the servant and beat him. They sent him away without any fruit."},{"num":4,"verse":"He sent another servant. They hurt this one also, and cut his head. The things they did to him were very wrong."},{"num":5,"verse":"So he sent another servant. The men killed him. He sent many others, and the men beat some and killed others."},{"num":6,"verse":"There was one left. He was his own son. He sent him last. He said, \"They will respect my son.\""},{"num":7,"verse":"But the men said to each other, \"This is the one who will have everything when his father dies. Let us kill him. Then everything will belong to us.\""},{"num":8,"verse":"They killed him and threw his body outside the farm."},{"num":9,"verse":"`What will the man who owned the farm do to them? He will come back and kill the men in the farm. And he will give the farm to other men to use."},{"num":10,"verse":"ave you not read this writing: \"The stone which the builders would not use is now the chief stone of the corner. The Lord did this. It looks wonderful to us.\"?'"},{"num":12,"verse":"They tried to catch Jesus but they feared the people. They knew that Jesus had spoken this against them. So they left him and went away."},{"num":13,"verse":"They sent some Pharisees and some of Herod's people to Jesus. They planned how to make Jesus say something wrong."},{"num":14,"verse":"They came and said to him, `Teacher, we know that you are true. You do not fear any person or care how great he is. But you teach the true way of God. Tell us, is it right to pay taxes to Caesar or is it not?"},{"num":15,"verse":"Should we pay taxes or not?' Jesus knew they were trying to get him into trouble. So he said to them, `Why are you trying to get me to do wrong? Bring me a piece of money. Let me look at it.'"},{"num":16,"verse":"They brought one to him. He asked, `Whose picture and name is this?' They answered, `Caesar's.'"},{"num":17,"verse":"So he said, `Give to Caesar what belongs to Caesar and give to God what belongs to God.' The Pharisees and Herod's people were much surprised at Jesus."},{"num":18,"verse":"Some of the Sadducees came to Jesus. They say that people do not rise from death. They asked Jesus a question."},{"num":19,"verse":"`Teacher,' they said, `Moses gave us this law: if a man dies and leaves a wife but no children, then his brother must marry the wife and raise a family for his brother."},{"num":20,"verse":"There were seven brothers. The first one married. He died and left no child."},{"num":21,"verse":"e second brother married the wife. He also died and left no child. It was the same with the third one."},{"num":22,"verse":"All seven brothers married her. They all had no children. Last of all the woman died also."},{"num":23,"verse":"Now then when people rise from death, whose wife will she be? All seven of them had married her.'"},{"num":24,"verse":"Jesus said to them, `You are wrong! You do not know what the holy writings say. And you do not know what power God has."},{"num":25,"verse":"When people rise from death, men and women do not marry. But they are like angels in heaven."},{"num":26,"verse":"People do rise from death! Have you never read what Moses wrote? It is in the place where we read about the small tree which burned. Moses tells how God said to him, \"I am the God of Abraham, the God of Isaac, and the God of Jacob.\""},{"num":27,"verse":"He is not the God of dead people, but of living people. The way you look at things is wrong altogether.'"},{"num":28,"verse":"One of the scribes heard them talking. He saw that Jesus gave them a good answer. Then he came and asked, `Which law is the greatest law of all?'"},{"num":29,"verse":"Jesus answered, `The greatest one is, \"Hear, O Israel. The Lord our God is one Lord."},{"num":30,"verse":"Love the Lord your God with all your heart. Love him with all your soul. Love him with all your mind. And love him with all your strength.\""},{"num":31,"verse":"The second law is this: \"Love your neighbour as you love yourself.\" No law is greater than these laws.'"},{"num":32,"verse":"Then the scribe answered Jesus, `Teacher, what you say is right. There is one God. There are no other gods."},{"num":33,"verse":"Love God with all your heart. Love him with all your understanding. Love him with all your strength. That is much better than to burn offerings and make sacrifices. Love your neighbour as you love yourself. That is better than any of these offerings and sacrifices.'"},{"num":34,"verse":"Jesus saw that the scribe was wise. So he said to him, `You are not far from the kingdom of God.' After that everyone feared to ask him any more questions."},{"num":35,"verse":"Jesus was teaching people in the temple. He said, `How can the scribes say that Christ is David's son?"},{"num":36,"verse":"The Holy Spirit spoke through David and he himself said: \"The Lord said to my Lord, `Sit beside me until I make you master over your enemies.' \""},{"num":37,"verse":"`So David calls Christ his Lord. How can Christ be David's son?' Most of the people were glad to hear Jesus' teaching."},{"num":38,"verse":"Jesus went on to teach them. He said, `Take care. Do not let the scribes fool you by the way they do things. They like to walk about with long gowns. They want people to greet them in the market."},{"num":39,"verse":"They want to sit in the front seats in the meeting houses. They want to sit in the best places at feasts."},{"num":40,"verse":"They take away the homes of women whose husbands are dead. They cover up the wrong things they do by talking to God a long time. They will be punished more!'"},{"num":41,"verse":"Jesus sat down in the temple near the place where people put in their money. He saw how the people put in money. Many rich people put in much money."},{"num":42,"verse":"A poor woman, whose husband was dead, came. She put in two small pieces of money."},{"num":43,"verse":"Jesus called his disciples. He said, `I tell you the truth. This poor woman has given more money than all the other people."},{"num":44,"verse":"All these people had plenty of money and they gave only a part of it. She was poor and she gave everything she had. She has nothing left to live on.'"}]