[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-14 God will not suffer his people to lie still in sin. By this parable Nathan drew from David a sentence against himself. Great need there is of prudence in giving reproofs. In his application, he was faithful. He says in plain terms, Thou art the man. God shows how much he hates sin, even in his own people; and wherever he finds it, he will not let it go unpunished. David says not a word to excuse himself or make light of his sin, but freely owns it. When David said, I have sinned, and Nathan perceived that he was a true penitent, he assured him his sin was forgiven. Thou shalt not die: that is, not die eternally, nor be for ever put away from God, as thou wouldest have been, if thou hadst not put away the sin. Though thou shalt all thy days be chastened of the Lord, yet thou shalt not be condemned with the world. There is this great evil in the sins of those who profess religion and relation to God, that they furnish the enemies of God and religion with matter for reproach and blasphemy. And it appears from David's case, that even where pardon is obtained, the Lord will visit the transgression of his people with the rod, and their iniquity with stripes. For one momentary gratification of a vile lust, David had to endure many days and years of extreme distress.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See the marginal references. In both the points of David's crime the retribution was according to his sin. His adultery was punished by Absalom's outrage, his murder by the bloodshed of domestic fights, which cost the lives of at least three of his favorite sons, Amnon, Absalom, and Adonijah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. I will raise up evil against thee out of thine own house, &c.—The prophet speaks of God threatening to do what He only permitted to be done. The fact is, that David's loss of character by the discovery of his crimes, tended, in the natural course of things, to diminish the respect of his family, to weaken the authority of his government, and to encourage the prevalence of many disorders throughout his kingdom.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will do this thing, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. I will execute this judgment. This God did by inclining David’s heart to leave his concubines to keep his house, and so to come into Absalom’s power; by giving up Ahithophel to his own carnal policy, which readily suggested to him that wicked and desperate counsel; and by exposing Absalom to these temptations, and leaving him to his own vicious inclinations, which God certainly knew would in such circumstances produce that effect. So the sin was wholly from men, but the ordering and overruling their mistakes and miscarriages to this end was from God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For thou didst it secretly,.... Committed adultery with Bathsheba privately, and endeavoured to conceal it, by getting her husband killed in battle, and then marrying her as soon as he could to hide the shame of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but one will do this thing before all Israel, and before the sun; as the above fact was; that is, he would suffer it to he done, and so order it in his providence, that everything should concur to the doing of it; as David's leaving his wives behind him, Ahithophel's wicked counsel he was suffered to give, and the lustful inclination Absalom was left unto, and not any of the people of Israel having religion, spirit, and courage enough to remonstrate against it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but one will do this thing before all Israel, and before the sun; as the above fact was; that is, he would suffer it to he done, and so order it in his providence, that everything should concur to the doing of it; as David's leaving his wives behind him, Ahithophel's wicked counsel he was suffered to give, and the lustful inclination Absalom was left unto, and not any of the people of Israel having religion, spirit, and courage enough to remonstrate against it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For thou didst it secretly: but I will do this thing before all Israel, and before the sun.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But David had also sinned in committing adultery. It was therefore announced to him by Jehovah, \"Behold, I raise up mischief over thee out of thine own house, and will take thy wives before thine eyes, and give them to thy neighbour, that he may lie with thy wives before the eyes of this sun (for the fulfilment of this by Absalom, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 16:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"For thou hast done it in secret; but I will do this thing before all Israel, and before (in the face of) the sun.\" David's twofold sin was to be followed by a twofold punishment. For his murder he would have to witness the commission of murder in his own family, and for his adultery the violation of his wives, and both of them in an intensified form. As his sin began with adultery, and was consummated in murder, so the law of just retribution was also carried out in the punishment, in the fact that the judgments which fell upon his house commenced with Amnon's incest, whilst Absalom's rebellion culminated in the open violation of his father's concubines, and even Adonijah lost his life, simply because he asked for Abishag the Shunammite, who had lain in David's bosom to warm and cherish him in his old age (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 2:23-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      }
    ]
  }
]