[{"num":25,"verse":"Then the kingdom of heaven shall be likened to ten virgins who took their lamps and went to meet the bridegroom."},{"num":2,"verse":"Five of them were foolish (thoughtless, without forethought) and five were wise (sensible, intelligent, and prudent)."},{"num":3,"verse":"For when the foolish took their lamps, they did not take any [extra] oil with them;"},{"num":4,"verse":"But the wise took flasks of oil along with them [also] with their lamps."},{"num":5,"verse":"While the bridegroom lingered and was slow in coming, they all began nodding their heads, and they fell asleep."},{"num":6,"verse":"But at midnight there was a shout, Behold, the bridegroom! Go out to meet him!"},{"num":7,"verse":"Then all those virgins got up and put their own lamps in order."},{"num":8,"verse":"And the foolish said to the wise, Give us some of your oil, for our lamps are going out."},{"num":9,"verse":"But the wise replied, There will not be enough for us and for you; go instead to the dealers and buy for yourselves."},{"num":10,"verse":"But while they were going away to buy, the bridegroom came, and those who were prepared went in with him to the marriage feast; and the door was shut."},{"num":11,"verse":"Later the other virgins also came and said, Lord, Lord, open [the door] to us!"},{"num":12,"verse":"But He replied, I solemnly declare to you, I do not know you [I am not acquainted with you]."},{"num":13,"verse":"Watch therefore [give strict attention and be cautious and active], for you know neither the day nor the hour when the Son of Man will come."},{"num":14,"verse":"For it is like a man who was about to take a long journey, and he called his servants together and entrusted them with his property."},{"num":15,"verse":"To one he gave five talents [probably about $5,000], to another two, to another one—to each in proportion to his own personal ability. Then he departed and left the country."},{"num":16,"verse":"He who had received the five talents went at once and traded with them, and he gained five talents more."},{"num":17,"verse":"And likewise he who had received the two talents—he also gained two talents more."},{"num":18,"verse":"But he who had received the one talent went and dug a hole in the ground and hid his master’s money."},{"num":19,"verse":"Now after a long time the master of those servants returned and settled accounts with them."},{"num":20,"verse":"And he who had received the five talents came and brought him five more, saying, Master, you entrusted to me five talents; see, here I have gained five talents more."},{"num":21,"verse":"His master said to him, Well done, you upright (honorable, admirable) and faithful servant! You have been faithful and trustworthy over a little; I will put you in charge of much. Enter into and share the joy (the delight, the blessedness) which your master enjoys."},{"num":22,"verse":"And he also who had the two talents came forward, saying, Master, you entrusted two talents to me; here I have gained two talents more."},{"num":23,"verse":"His master said to him, Well done, you upright (honorable, admirable) and faithful servant! You have been faithful and trustworthy over a little; I will put you in charge of much. Enter into and share the joy (the delight, the blessedness) which your master enjoys."},{"num":24,"verse":"He who had received one talent also came forward, saying, Master, I knew you to be a harsh and hard man, reaping where you did not sow, and gathering where you had not winnowed [the grain]."},{"num":25,"verse":"So I was afraid, and I went and hid your talent in the ground. Here you have what is your own."},{"num":26,"verse":"But his master answered him, You wicked and lazy and idle servant! Did you indeed know that I reap where I have not sowed and gather [grain] where I have not winnowed?"},{"num":27,"verse":"Then you should have invested my money with the bankers, and at my coming I would have received what was my own with interest."},{"num":28,"verse":"So take the talent away from him and give it to the one who has the ten talents."},{"num":29,"verse":"For to everyone who has will more be given, and he will be furnished richly so that he will have an abundance; but from the one who does not have, even what he does have will be taken away."},{"num":30,"verse":"And throw the good-for-nothing servant into the outer darkness; there will be weeping and grinding of teeth."},{"num":31,"verse":"When the Son of Man comes in His glory (His majesty and splendor), and all the holy angels with Him, then He will sit on the throne of His glory."},{"num":32,"verse":"All nations will be gathered before Him, and He will separate them [the people] from one another as a shepherd separates his sheep from the goats;"},{"num":33,"verse":"And He will cause the sheep to stand at His right hand, but the goats at His left."},{"num":34,"verse":"Then the King will say to those at His right hand, Come, you blessed of My Father [you favored of God and appointed to eternal salvation], inherit (receive as your own) the kingdom prepared for you from the foundation of the world."},{"num":35,"verse":"For I was hungry and you gave Me food, I was thirsty and you gave Me something to drink, I was a stranger and you brought Me together with yourselves and welcomed and entertained and lodged Me,"},{"num":36,"verse":"I was naked and you clothed Me, I was sick and you visited Me with help and ministering care, I was in prison and you came to see Me."},{"num":37,"verse":"Then the just and upright will answer Him, Lord, when did we see You hungry and gave You food, or thirsty and gave You something to drink?"},{"num":38,"verse":"And when did we see You a stranger and welcomed and entertained You, or naked and clothed You?"},{"num":39,"verse":"And when did we see You sick or in prison and came to visit You?"},{"num":40,"verse":"And the King will reply to them, Truly I tell you, in so far as you did it for one of the least [in the estimation of men] of these My brethren, you did it for Me."},{"num":41,"verse":"Then He will say to those at His left hand, Begone from Me, you cursed, into the eternal fire prepared for the devil and his angels!"},{"num":42,"verse":"For I was hungry and you gave Me no food, I was thirsty and you gave Me nothing to drink,"},{"num":43,"verse":"I was a stranger and you did not welcome Me and entertain Me, I was naked and you did not clothe Me, I was sick and in prison and you did not visit Me with help and ministering care."},{"num":44,"verse":"Then they also [in their turn] will answer, Lord, when did we see You hungry or thirsty or a stranger or naked or sick or in prison, and did not minister to You?"},{"num":45,"verse":"And He will reply to them, Solemnly I declare to you, in so far as you failed to do it for the least [in the estimation of men] of these, you failed to do it for Me."},{"num":46,"verse":"Then they will go away into eternal punishment, but those who are just and upright and in right standing with God into eternal life."}]