[{"header":"Wise Bridesmaids Will Keep Watch And Stay Prepared For The Coming of The Groom"},{"num":25,"verse":"“At-that-time, the kingdom of the heavens will be-like ten virgins, who, having taken their lamps, went out to meet the bridegroom. "},{"num":2,"verse":"Now five of them were foolish, and five were wise. "},{"num":3,"verse":"For the foolish ones, having taken their lamps, did not take oil with them. "},{"num":4,"verse":"But the wise ones took oil in jars with their lamps. "},{"num":5,"verse":"And while the bridegroom was delaying, they all became drowsy and were sleeping. "},{"num":6,"verse":"And in the middle of the night, a shout has come— ‘Behold, the bridegroom! Come out to meet him!’ "},{"num":7,"verse":"Then all those virgins arose and put their lamps in-order. "},{"num":8,"verse":"And the foolish ones said to the wise ones, ‘Give us from your oil, because our lamps are going-out’. "},{"num":9,"verse":"But the wise ones responded, saying, ‘There will not by any means ever be enough for us and for you. Go instead to the ones selling and buy for yourselves’. "},{"num":10,"verse":"And while they were going away to buy, the bridegroom came. And the prepared ones entered with him into the wedding-celebrations. And the door was shut. "},{"num":11,"verse":"And later, the other virgins also come, saying, ‘Sir, sir, open for us’. "},{"num":12,"verse":"But the one, having responded, said, ‘Truly I say to you, I do not know you’. "},{"num":13,"verse":"Therefore, keep-watching, because you do not know the day nor the hour."},{"header":"Wise Servants Will Put Their Talents To Work For The Master While He Is Gone"},{"num":14,"verse":"“For it  is just like a man going-on-a-journey— he called his own slaves and handed over his possessions to them. "},{"num":15,"verse":"And he gave five talents to one, and two to another, and one to another— to each according to his own ability. And he went on his journey. "},{"num":16,"verse":"Immediately having gone, the one having received the five talents worked with them and gained another five. "},{"num":17,"verse":"Similarly, the one having received the two talents gained another two. "},{"num":18,"verse":"But the one having received the one talent, having gone, dug [a hole in] the ground and hid his master’s silver talent. "},{"num":19,"verse":"Now after much time, the master of those slaves comes and settles the account with them. "},{"num":20,"verse":"And having come to him, the one having received the five talents brought another five talents, saying, ‘Master, you handed-over five talents to me. Look, I gained another five talents’. "},{"num":21,"verse":"His master said to him, ‘Well done, good and faithful slave. You were faithful over a few things. I will put you in charge over many things. Enter into the joy of your master’. "},{"num":22,"verse":"And also having come to him, the one having received the two talents said, ‘Master, you handed over two talents to me. Look, I gained another two talents’. "},{"num":23,"verse":"His master said to him, ‘Well done, good and faithful slave. You were faithful over a few things. I will put you in charge over many things. Enter into the joy of your master’. "},{"num":24,"verse":"And also having come to him, the one having received the one talent said, ‘Master, I knew you— that you are a hard man, reaping where you did not sow and gathering from where you did not scatter [threshings]. "},{"num":25,"verse":"And having become afraid, having gone, I hid your talent in the ground. Look, you have what is yours’. "},{"num":26,"verse":"But having responded, his master said to him, ‘Evil and lazy slave! You knew that I reap where I did not sow and gather from where I did not scatter! "},{"num":27,"verse":"Therefore you should-have put my money with the bankers. And having come, I would have received-back what was mine with interest. "},{"num":28,"verse":"Therefore take the talent away from him, and give it to the one having the ten talents. "},{"num":29,"verse":"For to everyone having, it will be given, and he will be caused-to-abound. But from the one not having, even what he has will be taken away from him. "},{"num":30,"verse":"And throw-out the unprofitable slave into the outer darkness’. In that place, there will be the weeping and the grinding of teeth."},{"header":"When The King Comes In Glory, Mankind Will Be Sent To Their Eternal Destinies"},{"num":31,"verse":"“Now when the Son of Man comes in His glory, and all the angels with Him, at-that-time He will sit on the throne of His glory, "},{"num":32,"verse":"and all the nations will be gathered in front of Him. And He will separate them from one another, just as the shepherd separates the sheep from the goats. "},{"num":33,"verse":"And He will make the sheep stand on His right side, and the goats on the left side. "},{"num":34,"verse":"Then the King will say to the ones on His right side, ‘Come, the ones having been blessed of  My Father— inherit the kingdom having been prepared for you since the foundation of the world. "},{"num":35,"verse":"For I was hungry, and you gave Me something to eat. I thirsted, and you gave-a-drink-to Me. I was a stranger, and you brought Me in; "},{"num":36,"verse":"naked, and you clothed Me. I was sick, and you looked-after Me. I was in prison, and you came to Me’. "},{"num":37,"verse":"Then the righteous ones will respond to Him, saying, ‘Lord, when did we see You hungering and we fed You, or thirsting and we gave-a-drink? "},{"num":38,"verse":"And when did we see You a stranger and we brought You in, or naked and we clothed You? "},{"num":39,"verse":"And when did we see You being sick or in prison and we came to You?’ "},{"num":40,"verse":"And having responded, the King will say to them, ‘Truly I say to you, in-as-much-as you did it to one of the least of these My brothers, you did it to Me’. "},{"num":41,"verse":"Then He will also say to the ones on the left side, ‘Depart from Me, the ones having been cursed, into the eternal fire having been prepared for the devil and his angels. "},{"num":42,"verse":"For I was hungry, and you did not give Me something to eat. I thirsted, and you did not give-a-drink-to Me. "},{"num":43,"verse":"I was a stranger, and you did not bring Me in; naked, and you did not clothe Me; sick, and in prison, and you did not look after Me’. "},{"num":44,"verse":"Then they also will respond, saying, ‘Lord, when did we see You hungering, or thirsting, or a stranger, or naked, or sick, or in prison, and we did not serve You?’ "},{"num":45,"verse":"Then He will respond to them, saying, ‘Truly I say to you, in as much as you did not do it to one of the least of these, neither did you do it to Me’. "},{"num":46,"verse":"And these will go to eternal punishment, but the righteous ones to eternal life”."}]