[{"num":25,"verse":"Then the kingdom of heaven will be like this. Ten young women took their lamps and went to meet a man who was being married."},{"num":2,"verse":"Five of them were foolish and five of them were wise."},{"num":3,"verse":"The five foolish women took their lamps but took no oil with them."},{"num":4,"verse":"The wise ones took bottles of oil with their lamps."},{"num":5,"verse":"`It was a long time before the man came, so they all went to sleep."},{"num":6,"verse":"At midnight there was a call, \"Here comes the man who is to be married! Come out to meet him.\""},{"num":7,"verse":"Then all the young women woke up. They cleaned their lamps."},{"num":8,"verse":"The foolish ones said to the wise ones, \"Give us some of your oil. The light in our lamps is dying.\""},{"num":9,"verse":"But the wise ones answered, \"There may not be enough oil for us all. Go to the market and buy some for yourselves.\""},{"num":10,"verse":"`While they went away to buy oil, the man came. Those who were ready went in with him to the wedding feast. Then the door was shut."},{"num":11,"verse":"After that, the other women also came. They called, \"Sir, sir, open the door for us.\""},{"num":12,"verse":"But he said, \"I tell you the truth. I do not know you.\""},{"num":13,"verse":"So watch! You do not know the day or the hour.'"},{"num":14,"verse":"`The kingdom of heaven will be like the time a man went to a country far away. He called his servants and put them in charge of his money."},{"num":15,"verse":"He gave five bags of money to one servant. He gave two bags of money to another servant. He gave one bag of money to another servant. He gave to each one what he was able to be in charge of. Then he went away."},{"num":16,"verse":"`Right away the servant who had five bags of money began to buy and sell things with it. He made five bags of money more than he had at first."},{"num":17,"verse":"`The servant who had two bags of money did the same thing as the one who had five bags. He also made two bags of money more than he had at first."},{"num":18,"verse":"But the man who had only one bag of money dug a hole in the ground. And he hid his master's money in the ground."},{"num":19,"verse":"`After a long time, the master of those servants came home. He asked what they had done with his money."},{"num":20,"verse":"The servant who had been given five bags of money brought five bags more to his master. He said, \"Sir, you gave me five bags of money. See, I have made five bags more money.\""},{"num":21,"verse":"`His master said, \"You have done well. You are a good servant. I can trust you. You have taken good care of a few things. I will put you in charge of many things. Come, have a good time with your master.\""},{"num":22,"verse":"`The servant who had been given two bags of money came and said to his master, \"Sir, you gave me two bags of money. I have made two bags more money.\""},{"num":23,"verse":"His master said, \"You have done well. You are a good servant. I can trust you. You have taken good care of a few things. I will put you in charge of many things. Come, have a good time with your master.\""},{"num":24,"verse":"`The servant who had been given one bag of money came and said, \"Sir, I knew that you were a hard man. You cut grain where you did not plant. You pick fruit where you put nothing in."},{"num":25,"verse":"I was afraid. So I went and hid your money in the ground. Here is your money.\""},{"num":26,"verse":"`His master answered him, \"You are a bad and lazy servant. You knew that I cut grain where I did not plant. You knew that I pick fruit where I put nothing in."},{"num":27,"verse":"You should have put my money in the bank. Then when I came home, I would have had my money with interest on it."},{"num":28,"verse":"So take the money away from him. Give it to the one who has ten bags."},{"num":29,"verse":"Anyone who has some will get more, and he will have plenty. But he who does not get anything, even the little that he has will be taken away from him."},{"num":30,"verse":"Take this good-for-nothing servant! Put him out in the dark place outside. People there will cry and make a noise with their teeth.\" '"},{"num":31,"verse":"`The Son of Man will be great and will come with all his holy angels. Then he will sit on his throne like a king."},{"num":32,"verse":"All the nations will be gathered in front of him. He will put them in two groups like a man who takes care of sheep. He puts the sheep on one side of him and he puts the goats on the other side of him."},{"num":33,"verse":"The Son of Man will put people who are like the sheep at his right side. He will put people who are like the goats at his left side."},{"num":34,"verse":"Then the King will say to those who are at his right side, \"Come! My Father has blessed you. The kingdom was made ready for you when the world was first made. Come into it now."},{"num":35,"verse":"I was hungry. You gave me food. I was thirsty. You gave me a drink. I was a stranger. You took me in."},{"num":36,"verse":"I needed clothes. You gave me clothes. I was sick. You came to visit me. I was in prison. You came to see me.\""},{"num":37,"verse":"`Then the good people will ask him, \"Lord when did we see you hungry and give you food? When did we see you thirsty and give you a drink?"},{"num":38,"verse":"When did we see you a stranger and take you in? When did we see you needing clothes and give you clothes?"},{"num":39,"verse":"When did we see you sick or in prison and come to see you?\""},{"num":40,"verse":"`The King will answer them, \"I tell you the truth. What you did for even the smallest of these people you did for me. They are my brothers.\""},{"num":41,"verse":"`Then he will say to those at the left side \"Go away from me. You are cursed. Go into the fire that burns for ever. That fire has been made ready for the devil and his angels."},{"num":42,"verse":"I was hungry. You did not give me food. I was thirsty. You did not give me a drink."},{"num":43,"verse":"I was a stranger. You did not take me in. I needed clothes. You did not give me any clothes. I was sick and in prison. You did not come to see me.\""},{"num":44,"verse":"`Then they will also ask, \"Lord, when did we see you hungry, or thirsty, or a stranger, or needing clothes, or sick, or in prison, and did not help you?\""},{"num":45,"verse":"`Then the King will answer them, \"I tell you the truth. What you did not do for even the smallest of these, you did not do for me.\""},{"num":46,"verse":"And they will go away to be punished for ever. But the good people will go away to live for ever.'"}]