[{"num":5,"verse":"Now the prophets, Haggai and Zechariah son [grandson] of Iddo, prophesied to the Jews in Judah and Jerusalem in the name of the God of Israel, Whose [Spirit] was upon them."},{"num":2,"verse":"Then rose up Zerubbabel son of Shealtiel [heir to the throne of Judah] and Jeshua son of Jozadak and began to build the house of God in Jerusalem; and with them were the prophets of God [Haggai and Zechariah], helping them."},{"num":3,"verse":"Then Tattenai, governor on the west side of the [Euphrates] River, and Shethar-bozenai and their companions came to them and said, Who authorized you to build this house and to restore this wall?"},{"num":4,"verse":"Then we told them [in reply] the names of the men who were building this building."},{"num":5,"verse":"But the eye of their God was upon the elders of the Jews, so the enemy could not make them stop until the matter came before Darius [I] and an answer was returned by letter concerning it."},{"num":6,"verse":"This is a copy of the letter that Tattenai, governor on this side of the River, and Shethar-bozenai and his associates, the Apharsachites who were on this [west] side of the River, sent to Darius [I] the king."},{"num":7,"verse":"They wrote: To Darius the king: All peace."},{"num":8,"verse":"Be it known to the king that we went to the province of Judah, to the house of the great God. It is being built with huge stones, with timber laid in the walls; this work goes on with diligence and care and prospers in their hands."},{"num":9,"verse":"Then we asked those elders, Who authorized you to build this house and restore these walls?"},{"num":10,"verse":"We asked their names also, that we might record the names of the men at their head and notify you."},{"num":11,"verse":"They replied, We are servants of the God of heaven and earth, rebuilding the house which was erected and finished many years ago by a great king of Israel."},{"num":12,"verse":"But after our fathers had provoked the God of heaven to wrath, He gave them into the hand of Nebuchadnezzar king of Babylon, the Chaldean, who destroyed this house and carried the people away into Babylon."},{"num":13,"verse":"But in the first year of Cyrus king of Babylon, the same King Cyrus made a decree to rebuild this house of God."},{"num":14,"verse":"And the vessels also of gold and silver of the house of God, which Nebuchadnezzar took from the temple in Jerusalem and brought into the temple of Babylon, King Cyrus took from the temple of Babylon and delivered to a man named Sheshbazzar, whom he had made governor."},{"num":15,"verse":"And King Cyrus said to him, Go, take these vessels to Jerusalem and carry them into the temple, and let the house of God be built upon its site."},{"num":16,"verse":"Then came this Sheshbazzar and laid the foundation of the house of God in Jerusalem; and since that time until now it has been in the process of being rebuilt and is not completed yet."},{"num":17,"verse":"So now, if it seems good to the king, let a search be made in the royal archives there in Babylon to see if it is true that King Cyrus issued a decree to build this house of God at Jerusalem; and let the king send us his pleasure in this matter."}]