[{"num":42,"verse":"3 Joseph’s brethren come into Egypt to buy corn. 7 He knoweth them, and tryeth them. 24 Simeon is put in prison. 34 The others go to fetch Benjamin."},{"num":1,"verse":"Then Jacob saw that there was food in Egypt, and Jacob said unto his sons, Why gaze ye one upon another?"},{"num":2,"verse":"And he said, Behold, I have heard that there is food in Egypt, Get you down thither, and buy us food thence, that we may live and not die."},{"num":3,"verse":"¶ So went Joseph’s ten brethren down to buy corn of the Egyptians."},{"num":4,"verse":"But Benjamin Joseph’s brother, would not Jacob send with his brethren: for he said, Lest death should befall him."},{"num":5,"verse":"And the sons of Israel came to buy food among them that came: for there was famine in the land of Canaan."},{"num":6,"verse":"Now Joseph was governor of the land, who sold to all the people of the land: then Joseph’s brethren came, and bowed their faces to the ground before him."},{"num":7,"verse":"And when Joseph saw his brethren, he knew them, and made himself strange toward them, and spake to them roughly, and said unto them, Whence come ye? Who answered, Out of the land of Canaan, to buy vittles."},{"num":8,"verse":"(Now Joseph knew his brethren, but they knew not him."},{"num":9,"verse":"And Joseph remembered the dreams, which he dreamed of them) and he said unto them, Ye are spies, and are come to see the weakness of the land."},{"num":10,"verse":"But they said unto him, Nay, my lord, but to buy vittles thy servants are come."},{"num":11,"verse":"We are all one man’s sons: we mean truly, and thy servants are no spies."},{"num":12,"verse":"But he said unto them, Nay, but ye are come to see the weakness of the land."},{"num":13,"verse":"And they said, We thy servants, are twelve brethren, the sons of one man in the land of Canaan: and behold, the youngest is this day with our father, and one is not."},{"num":14,"verse":"Again Joseph said unto them, This is it that I spake unto you, saying, Ye are spies."},{"num":15,"verse":"Hereby ye shall be proved: by the life of Pharaoh, ye shall not go hence, except your youngest brother come hither."},{"num":16,"verse":"Send one of you which may fetch your brother, and ye shall be kept in prison, that your words may be proved, whether there be truth in you, or else by the life of Pharaoh ye are but spies."},{"num":17,"verse":"So he put them in ward three days."},{"num":18,"verse":"Then Joseph said unto them the third day, This do, and live: for I fear God."},{"num":19,"verse":"If ye be true men, let one of your brethren be bound in your prison house, and go ye, carry food for the famine of your houses:"},{"num":20,"verse":"But bring your younger brother unto me, that your words may be tried, and that ye die not: and they did so."},{"num":21,"verse":"¶ And they said one to another, We have verily sinned against our brother, in that we saw the anguish of his soul, when he besought us, and we would not hear him: therefore is this trouble come upon us."},{"num":22,"verse":"And Reuben answered them, saying, Warned I not you, saying, Sin not against the child, and ye would not hear? and lo, his blood is now required."},{"num":23,"verse":"(And they were not aware that Joseph understood them: for he spake unto them by an interpreter.)"},{"num":24,"verse":"Then he turned from them, and wept, and turned to them again, and communed with them, and took Simeon from among them, and bound him before their eyes."},{"num":25,"verse":"¶ So Joseph commanded that they should fill their sacks with wheat, and put every man’s money again in his sack, and give them vittles for the journey: and thus did he unto them."},{"num":26,"verse":"And they laid their vittles upon their asses, and departed thence."},{"num":27,"verse":"And as one of them opened his sack for to give his ass provender in the Inn, he espied his money: for lo, it was in his sack’s mouth."},{"num":28,"verse":"Then he said unto his brethren, My money is restored: for lo, it is even in my sack. And their heart failed them, and they were astonished, and said one to another, What is this, that God hath done unto us?"},{"num":29,"verse":"¶ And they came unto Jacob their father unto the land of Canaan, and told him all that had befallen them, saying,"},{"num":30,"verse":"The man who is lord of the land, spake roughly to us, and put us in prison as spies of the country."},{"num":31,"verse":"And we said unto him, We are true men, and are no spies."},{"num":32,"verse":"We be twelve brethren, sons of our father: one is not, and the youngest is this day with our father in the land of Canaan."},{"num":33,"verse":"Then the lord of the country said unto us, Hereby shall I know if ye be true men: Leave one of your brethren with me, and take food for the famine of your houses, and depart,"},{"num":34,"verse":"And bring your youngest brother unto me, that I may know that ye are no spies, but true men: so will I deliver you your brother, and ye shall occupy in the land."},{"num":35,"verse":"¶ And as they emptied their sacks, behold, every man’s bundle of money was in his sack: and when they and their father saw the bundles of their money, they were afraid."},{"num":36,"verse":"Then Jacob their father said to them, Ye have robbed me of my children: Joseph is not, and Simeon is not, and ye will take Benjamin: all these things are against me."},{"num":37,"verse":"Then Reuben answered his father, saying, Slay my two sons, if I bring him not to thee again: deliver him to mine hand, and I will bring him to thee again."},{"num":38,"verse":"But he said, My son shall not go down with you: for his brother is dead, and he is left alone: if death come unto him by the way which ye go, then ye shall bring my gray head with sorrow unto the grave."}]