[{"num":42,"verse":"When Jacob heard that there was grain available in Egypt he said to his sons, “Why are you standing around looking at one another? "},{"num":2,"verse":"I have heard that there is grain available in Egypt. Go down and buy some for us before we all starve to death.”"},{"num":3,"verse":"So Joseph’s ten older brothers went down to Egypt to buy grain. "},{"num":4,"verse":"However, Jacob wouldn’t let Joseph’s younger brother Benjamin go with them, for fear some harm might happen to him as it had to his brother Joseph. "},{"num":5,"verse":"So it was that Israel’s sons arrived in Egypt along with many others from many lands to buy food, for the famine was as severe in Canaan as it was everywhere else."},{"num":6,"verse":"Since Joseph was governor of all Egypt, and in charge of the sale of the grain, it was to him that his brothers came, and bowed low before him, with their faces to the earth. "},{"num":7,"verse":"Joseph recognized them instantly, but pretended he didn’t."},{"num":8,"verse":"Then Joseph remembered the dreams of long ago! But he said to them, “You are spies. You have come to see how destitute the famine has made our land.”"},{"num":10,"verse":"“No, no,” they exclaimed. “We have come to buy food. "},{"num":11,"verse":"We are all brothers and honest men, sir! We are not spies!”"},{"num":12,"verse":"“Yes, you are,” he insisted. “You have come to see how weak we are.”"},{"num":13,"verse":"“Sir,” they said, “there are twelve of us brothers, and our father is in the land of Canaan. Our youngest brother is there with our father, and one of our brothers is dead.”"},{"num":14,"verse":"“So?” Joseph asked. “What does that prove? You are spies. "},{"num":15,"verse":"This is the way I will test your story: I swear by the life of Pharaoh that you are not going to leave Egypt until this youngest brother comes here. "},{"num":16,"verse":"One of you go and get your brother! I’ll keep the rest of you here, bound in prison. Then we’ll find out whether your story is true or not. If it turns out that you don’t have a younger brother, then I’ll know you are spies.”"},{"num":17,"verse":"So he threw them all into jail for three days."},{"num":18,"verse":"The third day Joseph said to them, “I am a God-fearing man and I’m going to give you an opportunity to prove yourselves. "},{"num":19,"verse":"I’m going to take a chance that you are honorable; only one of you shall remain in chains in jail, and the rest of you may go on home with grain for your families; "},{"num":20,"verse":"but bring your youngest brother back to me. In this way I will know whether you are telling me the truth; and if you are, I will spare you.” To this they agreed."},{"num":21,"verse":"Speaking among themselves, they said, “This has all happened because of what we did to Joseph long ago. We saw his terror and anguish and heard his pleadings, but we wouldn’t listen.”"},{"num":22,"verse":"“Didn’t I tell you not to do it?” Reuben asked. “But you wouldn’t listen. And now we are going to die because we murdered him.”"},{"num":23,"verse":"Of course they didn’t know that Joseph understood them as he was standing there, for he had been speaking to them through an interpreter. "},{"num":24,"verse":"Now he left the room and found a place where he could weep. Returning, he selected Simeon from among them and had him bound before their eyes. "},{"num":25,"verse":"Joseph then ordered his servants to fill the men’s sacks with grain, but also gave secret instructions to put each brother’s payment at the top of his sack! He also gave them provisions for their journey. "},{"num":26,"verse":"So they loaded up their donkeys with the grain and started for home. "},{"num":27,"verse":"But when they stopped for the night and one of them opened his sack to get some grain to feed the donkeys, there was his money in the mouth of the sack!"},{"num":28,"verse":"“Look,” he exclaimed to his brothers, “my money is here in my sack.” They were filled with terror. Trembling, they exclaimed to each other. “What is this that God has done to us?” "},{"num":29,"verse":"So they came to their father, Jacob, in the land of Canaan and told him all that had happened."},{"num":30,"verse":"“The king’s chief assistant spoke very roughly to us,” they told him, “and took us for spies. "},{"num":31,"verse":"‘No, no,’ we said, ‘we are honest men, not spies. "},{"num":32,"verse":"We are twelve brothers, sons of one father; one is dead, and the youngest is with our father in the land of Canaan.’ "},{"num":33,"verse":"Then the man told us, ‘This is the way I will find out if you are what you claim to be. Leave one of your brothers here with me and take grain for your families and go on home, "},{"num":34,"verse":"but bring your youngest brother back to me. Then I shall know whether you are spies or honest men; if you prove to be what you say, then I will give you back your brother and you can come as often as you like to purchase grain.’”"},{"num":35,"verse":"As they emptied out the sacks, there at the top of each was the money paid for the grain! Terror gripped them, as it did their father."},{"num":36,"verse":"Then Jacob exclaimed, “You have bereaved me of my children—Joseph didn’t come back, Simeon is gone, and now you want to take Benjamin too! Everything has been against me.”"},{"num":37,"verse":"Then Reuben said to his father, “Kill my two sons if I don’t bring Benjamin back to you. I’ll be responsible for him.”"},{"num":38,"verse":"But Jacob replied, “My son shall not go down with you, for his brother Joseph is dead and he alone is left of his mother’s children. If anything should happen to him, I would die.”"}]