[{"num":42,"verse":"Now when Jacob found out there was grain to be had in Egypt, he talked to his sons about it."},{"num":3,"verse":"So ten of Joseph’s brothers went down to buy grain in Egypt. "},{"num":4,"verse":"But Jacob didn’t send Joseph’s brother Benjamin with the others, because he was afraid something might happen to him. "},{"num":5,"verse":"So the sons of Israel decided to go down and buy grain along with many others, because the famine had reached the land of Canaan."},{"num":6,"verse":"Since Joseph was in charge of Egypt, he was the one responsible for selling the grain to the people who came from the various lands. When it was their turn, Joseph’s brothers came and bowed down before him with their faces to the ground. "},{"num":7,"verse":"The moment Joseph saw his brothers, he recognized them even though nearly 20 years had passed since last he saw them, but he treated them like strangers and spoke gruffly to them."},{"num":8,"verse":"Although Joseph recognized them, they did not recognize him. "},{"num":9,"verse":"He then remembered the dreams he had as a young man regarding his brothers."},{"num":17,"verse":"Then Joseph put all ten of his brothers in prison for three days."},{"num":18,"verse":"Three days later, Joseph had come up with a different plan."},{"num":23,"verse":"Now Joseph’s brothers were speaking to each other in their own language and had no idea that Joseph understood what they were saying, since he had been speaking with them through an interpreter. "},{"num":24,"verse":"But their words moved him, so he withdrew from them and cried. When he had composed himself, he came back and spoke to them again. He selected Simeon to remain behind and had him bound in ropes right in front of them. "},{"num":25,"verse":"Then Joseph gave orders to fill their bags with grain, to return their money to each man’s sack, and to give them food for their journey home. All of this was done for them."},{"num":26,"verse":"Then they loaded up their donkeys with the grain and left for Canaan. "},{"num":27,"verse":"Later, when they arrived where they would stay the night, one of them opened up his sack to give his donkey some fodder, and he saw his money lying at the top of the sack."},{"num":29,"verse":"When they finally arrived in the land of Canaan at their father Jacob’s house, they told him everything that had happened."},{"num":35,"verse":"Now as all the brothers went to empty their sacks, each found his bag of money inside. And when they and their father saw the money there, they were very frightened."}]