[{"header":"The River from the Temple"},{"num":47,"verse":"The man led me back to the door of the Temple. I saw water coming out from under the doorway that faces east. (The Temple faced east.) The water flowed down from the south end of the Temple. It was south of the altar. "},{"num":2,"verse":"The man brought me out through the outer north gate. And he led me around outside to the outer east gate. The water was coming out on the south side of the gate."},{"num":3,"verse":"The man went toward the east with a line in his hand. He measured about a third of a mile. Then he led me through water that came up to my ankles. "},{"num":4,"verse":"The man measured about a third of a mile again. Then he led me through water that came up to my knees. Then he measured about a third of a mile again. And he led me through water up to my waist. "},{"num":5,"verse":"The man measured about a third of a mile again. But it was now a river that I could not cross. The water had risen too high. It was deep enough for swimming. It was a river that no one could cross. "},{"num":6,"verse":"The man asked me, “Human being, do you see this?”"},{"num":7,"verse":"As I went back, I saw many trees on both sides of the water. "},{"num":8,"verse":"The man said to me, “This water will flow toward the eastern areas. It will go down into the Jordan Valley. When the water enters the Dead Sea, it will become fresh. "},{"num":9,"verse":"And everywhere the river goes, there will be many animals and fish. Wherever this water goes the Dead Sea will become fresh. So where the river goes there will be many living things. "},{"num":10,"verse":"Fishermen will stand by the sea. From En Gedi all the way to En Eglaim will become a place to spread fishing nets. There will be many kinds of fish in the Dead Sea. There will be as many kinds of fish as there are in the Mediterranean Sea. "},{"num":11,"verse":"But the swamps and marshes will not become fresh. They will be left for salt. "},{"num":12,"verse":"All kinds of fruit trees will grow on both banks of the river. Their leaves will not dry and die. The trees will have fruit every month because the water for them comes from the Temple. The fruit from the trees will be for food. And their leaves will be for medicine.”"},{"header":"Borders of the Land"},{"num":13,"verse":"This is what the Lord God says: “These are the borders to divide the land among the 12 tribes of Israel. Joseph will have two parts of land. "},{"num":14,"verse":"You will divide the land equally. I promised to give it to your ancestors. So this land will belong to you from your family."},{"num":15,"verse":"“This will be the border line of the land."},{"num":16,"verse":"Berothah and Sibraim. Sibraim is on the border between Damascus and Hamath. And it will go on to the city of Hazer Hatticon on the border of the country of Hauran. "},{"num":17,"verse":"So the border line will go from the Mediterranean Sea east to the city of Hazar Enan. This is on the northern border of Damascus. And the country of Hamath will be on the north side of the border."},{"num":18,"verse":"“On the east side the border runs south from a point between Hauran and Damascus. It will go along the Jordan between Gilead and the land of Israel. It will continue to the city of Tamar on the Dead Sea. This will be the east side of the land."},{"num":19,"verse":"“On the south side the border line will go west from Tamar. It will go all the way to the waters of Meribah Kadesh. Then it will run along the brook of Egypt to the Mediterranean Sea. This will be the south side of the land."},{"num":20,"verse":"“On the west side the Mediterranean Sea will be the border line. It will go to a place across from Lebo Hamath. This will be the west side of your land."},{"num":21,"verse":"“So you will divide this land among the tribes of Israel. "},{"num":22,"verse":"You will divide it as a property for yourselves. And it will be for you and for the foreigners who live and have children among you. These foreigners will be like people born in Israel. You will divide some land for them among the tribes of Israel. "},{"num":23,"verse":"In whatever tribe the foreigner lives, you will give him some land,” says the Lord God."}]