[{"header":"A River Will Flow From the Temple"},{"num":47,"verse":"The man brought me back to the entrance to the temple. I saw water flowing east from under a temple gateway. The temple faced east. The water was coming down from under the south side of the temple. It was flowing south of the altar. "},{"num":2,"verse":"Then he brought me out through the north gate of the outer courtyard. He led me around the outside to the outer gate that faced east. The water was flowing from the south side of the east gate."},{"num":3,"verse":"Then the man went toward the east. He had a measuring line in his hand. He measured off 1,700 feet. He led me through water that was up to my ankles. "},{"num":4,"verse":"Then he measured off another 1,700 feet. He led me through water that was up to my knees. Then he measured off another 1,700 feet. He led me through water that was up to my waist. "},{"num":5,"verse":"Then he measured off another 1,700 feet. But now it was a river that I could not go across. The water had risen so high that it was deep enough to swim in. "},{"num":6,"verse":"He asked me, “Son of man, do you see this?”"},{"num":7,"verse":"When I arrived there, I saw many trees. They were on both sides of the river. "},{"num":8,"verse":"The man said to me, “This water flows toward the eastern territory. It goes down into the Arabah Valley. There it enters the Dead Sea. When it empties into it, the salt water there becomes fresh. "},{"num":9,"verse":"Many creatures will live where the river flows. It will have many schools of fish. This water flows there and makes the salt water fresh. So where the river flows everything will live. "},{"num":10,"verse":"People will stand along the shore to fish. From En Gedi all the way to En Eglaim there will be places for spreading fishnets. The Dead Sea will have many kinds of fish. They will be like the fish in the Mediterranean Sea. "},{"num":11,"verse":"But none of the swamps will have fresh water in them. They will stay salty. "},{"num":12,"verse":"Fruit trees of all kinds will grow on both banks of the river. Their leaves will not dry up. The trees will always have fruit on them. Every month they will bear fruit. The water from the temple will flow to them. Their fruit will be used for food. And their leaves will be used for healing.”"},{"header":"The Borders of the Land"},{"num":13,"verse":"Here is what the Lord and King says. “People of Israel, here are the borders of the land that you will divide up. You will divide up the land among the 12 tribes of Israel. Each tribe will receive a share. But the family of Joseph will have two shares. "},{"num":14,"verse":"Divide the land into equal parts. Long ago I raised my hand and made a promise. I promised to give the land to your people of long ago. So all of it will belong to you."},{"num":15,"verse":"“Here are the borders of the land."},{"num":21,"verse":"“You must divide up this land among yourselves. Do this based on the number of men in your tribes. "},{"num":22,"verse":"Each of the tribes must receive a share of the land. You must also give some land to the outsiders who live among you and who have children. Treat them as if they had been born in Israel. Let them have some land among your tribes. "},{"num":23,"verse":"Outsiders can live in the land of any tribe. There you must give them their share,” announces the Lord and King."}]