[[],[],[{"type":"header","content":"Divorce"},{"type":"prose","content":"When Jesus had completed these teachings, he left Galilee and crossed the region of Judea on the other side of the Jordan. Great crowds followed him there, and he healed them."}],[{"type":"prose","content":"One day the Pharisees were badgering him: “Is it legal for a man to divorce his wife for any reason?”"}],[{"type":"prose","content":"He answered, “Haven’t you read in your Bible that the Creator originally made man and woman for each other, male and female? And because of this, a man leaves father and mother and is firmly bonded to his wife, becoming one flesh—no longer two bodies but one. Because God created this organic union of the two sexes, no one should desecrate his art by cutting them apart.”"}],[{"type":"prose","content":"They shot back in rebuttal, “If that’s so, why did Moses give instructions for divorce papers and divorce procedures?”"}],[{"type":"prose","content":"Jesus said, “Moses provided for divorce as a concession to your hard heartedness, but it is not part of God’s original plan. I’m holding you to the original plan, and holding you liable for adultery if you divorce your faithful wife and then marry someone else. I make an exception in cases where the spouse has committed adultery.”"}],[{"type":"prose","content":"Jesus’ disciples objected, “If those are the terms of marriage, we haven’t got a chance. Why get married?”"}],[{"type":"prose","content":"But Jesus said, “Not everyone is mature enough to live a married life. It requires a certain aptitude and grace. Marriage isn’t for everyone. Some, from birth seemingly, never give marriage a thought. Others never get asked—or accepted. And some decide not to get married for kingdom reasons. But if you’re capable of growing into the largeness of marriage, do it.”"}],[{"type":"header","content":"To Enter God’s Kingdom"},{"type":"prose","content":"One day children were brought to Jesus in the hope that he would lay hands on them and pray over them. The disciples shooed them off. But Jesus intervened: “Let the children alone, don’t prevent them from coming to me. God’s kingdom is made up of people like these.” After laying hands on them, he left."}],[{"type":"prose","content":"Another day, a man stopped Jesus and asked, “Teacher, what good thing must I do to get eternal life?”"}],[{"type":"prose","content":"Jesus said, “Why do you question me about what’s good?  is the One who is good. If you want to enter the life of God, just do what he tells you.”"}],[{"type":"prose","content":"The man asked, “What in particular?”Jesus said, “Don’t murder, don’t commit adultery, don’t steal, don’t lie, honor your father and mother, and love your neighbor as you do yourself.”"}],[{"type":"prose","content":"The young man said, “I’ve done all that. What’s left?”"}],[{"type":"prose","content":"“If you want to give it all you’ve got,” Jesus replied, “go sell your possessions; give everything to the poor. All your wealth will then be in heaven. Then come follow me.”"}],[{"type":"prose","content":"That was the last thing the young man expected to hear. And so, crestfallen, he walked away. He was holding on tight to a lot of things, and he couldn’t bear to let go."}],[{"type":"prose","content":"As he watched him go, Jesus told his disciples, “Do you have any idea how difficult it is for the rich to enter God’s kingdom? Let me tell you, it’s easier to gallop a camel through a needle’s eye than for the rich to enter God’s kingdom.”"}],[{"type":"prose","content":"The disciples were staggered. “Then who has any chance at all?”"}],[{"type":"prose","content":"Jesus looked hard at them and said, “No chance at all if you think you can pull it off yourself. Every chance in the world if you trust God to do it.”"}],[{"type":"prose","content":"Then Peter chimed in, “We left everything and followed you. What do we get out of it?”"}],[{"type":"prose","content":"Jesus replied, “Yes, you have followed me. In the re-creation of the world, when the Son of Man will rule gloriously, you who have followed me will also rule, starting with the twelve tribes of Israel. And not only you, but anyone who sacrifices home, family, fields—whatever—because of me will get it all back a hundred times over, not to mention the considerable bonus of eternal life. This is the Great Reversal: many of the first ending up last, and the last first.”"}]]