[{"header":"Jesus Teaches About Divorce"},{"num":19,"verse":"After Jesus said all these things, he left Galilee and went into the area of Judea on the other side of the Jordan River. "},{"num":2,"verse":"Large crowds followed him, and he healed them there."},{"num":3,"verse":"Some Pharisees came to Jesus and tried to trick him. They asked, “Is it right for a man to divorce his wife for any reason he chooses?”"},{"num":4,"verse":"Jesus answered, “Surely you have read in the Scriptures: When God made the world, ‘he made them male and female.’ "},{"num":7,"verse":"The Pharisees asked, “Why then did Moses give a command for a man to divorce his wife by giving her divorce papers?”"},{"num":8,"verse":"Jesus answered, “Moses allowed you to divorce your wives because you refused to accept God’s teaching, but divorce was not allowed in the beginning. "},{"num":10,"verse":"The followers said to him, “If that is the only reason a man can divorce his wife, it is better not to marry.”"},{"num":11,"verse":"Jesus answered, “Not everyone can accept this teaching, but God has made some able to accept it. "},{"header":"Jesus Welcomes Children"},{"num":13,"verse":"Then the people brought their little children to Jesus so he could put his hands on them and pray for them. His followers told them to stop, "},{"num":14,"verse":"but Jesus said, “Let the little children come to me. Don’t stop them, because the kingdom of heaven belongs to people who are like these children.” "},{"num":15,"verse":"After Jesus put his hands on the children, he left there."},{"header":"A Rich Young Man’s Question"},{"num":16,"verse":"A man came to Jesus and asked, “Teacher, what good thing must I do to have life forever?”"},{"num":17,"verse":"Jesus answered, “Why do you ask me about what is good? Only God is good. But if you want to have life forever, obey the commands.”"},{"num":18,"verse":"The man asked, “Which commands?”"},{"num":20,"verse":"The young man said, “I have obeyed all these things. What else do I need to do?”"},{"num":21,"verse":"Jesus answered, “If you want to be perfect, then go and sell your possessions and give the money to the poor. If you do this, you will have treasure in heaven. Then come and follow me.”"},{"num":22,"verse":"But when the young man heard this, he left sorrowfully, because he was rich."},{"num":23,"verse":"Then Jesus said to his followers, “I tell you the truth, it will be hard for a rich person to enter the kingdom of heaven. "},{"num":25,"verse":"When Jesus’ followers heard this, they were very surprised and asked, “Then who can be saved?”"},{"num":26,"verse":"Jesus looked at them and said, “For people this is impossible, but for God all things are possible.”"},{"num":27,"verse":"Peter said to Jesus, “Look, we have left everything and followed you. So what will we have?”"},{"num":28,"verse":"Jesus said to them, “I tell you the truth, when the age to come has arrived, the Son of Man will sit on his great throne. All of you who followed me will also sit on twelve thrones, judging the twelve tribes of Israel. "}]