[{"header":"Divorce(A)"},{"num":19,"verse":"When Jesus had finished saying these things, he left Galilee and went into the region of Judea to the other side of the Jordan."},{"num":2,"verse":"Large crowds followed him, and he healed them there."},{"num":3,"verse":"Some Pharisees came to him to test him. They asked, “Is it lawful for a man to divorce his wife for any and every reason?”"},{"num":7,"verse":"“Why then,” they asked, “did Moses command that a man give his wife a certificate of divorce and send her away?”"},{"num":8,"verse":"Jesus replied, “Moses permitted you to divorce your wives because your hearts were hard. But it was not this way from the beginning."},{"num":10,"verse":"The disciples said to him, “If this is the situation between a husband and wife, it is better not to marry.”"},{"num":11,"verse":"Jesus replied, “Not everyone can accept this word, but only those to whom it has been given."},{"header":"The Little Children and Jesus(J)"},{"num":13,"verse":"Then people brought little children to Jesus for him to place his hands on them and pray for them. But the disciples rebuked them."},{"num":14,"verse":"Jesus said, “Let the little children come to me, and do not hinder them, for the kingdom of heaven belongs to such as these.”"},{"num":15,"verse":"When he had placed his hands on them, he went on from there."},{"header":"The Rich and the Kingdom of God(N)"},{"num":16,"verse":"Just then a man came up to Jesus and asked, “Teacher, what good thing must I do to get eternal life?”"},{"num":18,"verse":"“Which ones?” he inquired."},{"num":20,"verse":"“All these I have kept,” the young man said. “What do I still lack?”"},{"num":21,"verse":"Jesus answered, “If you want to be perfect, go, sell your possessions and give to the poor, and you will have treasure in heaven. Then come, follow me.”"},{"num":22,"verse":"When the young man heard this, he went away sad, because he had great wealth."},{"num":23,"verse":"Then Jesus said to his disciples, “Truly I tell you, it is hard for someone who is rich to enter the kingdom of heaven."},{"num":25,"verse":"When the disciples heard this, they were greatly astonished and asked, “Who then can be saved?”"},{"num":26,"verse":"Jesus looked at them and said, “With man this is impossible, but with God all things are possible.”"},{"num":27,"verse":"Peter answered him, “We have left everything to follow you! What then will there be for us?”"},{"num":28,"verse":"Jesus said to them, “Truly I tell you, at the renewal of all things, when the Son of Man sits on his glorious throne, you who have followed me will also sit on twelve thrones, judging the twelve tribes of Israel."}]