[[],[{"type":"header","content":"Discussion about Divorce and Marriage"},{"type":"prose","content":"When Jesus had finished saying these things, he left Galilee and went down to the region of Judea east of the Jordan River."}],[{"type":"prose","content":"Large crowds followed him there, and he healed their sick."}],[{"type":"prose","content":"Some Pharisees came and tried to trap him with this question: “Should a man be allowed to divorce his wife for just any reason?”"}],[{"type":"prose","content":" Jesus replied. "}],[{"type":"prose","content":"And he said, "}],[],[{"type":"prose","content":"“Then why did Moses say in the law that a man could give his wife a written notice of divorce and send her away?” they asked."}],[{"type":"prose","content":"Jesus replied, "}],[],[{"type":"prose","content":"Jesus’ disciples then said to him, “If this is the case, it is better not to marry!”"}],[{"type":"prose","content":" Jesus said. "}],[],[{"type":"header","content":"Jesus Blesses the Children"},{"type":"prose","content":"One day some parents brought their children to Jesus so he could lay his hands on them and pray for them. But the disciples scolded the parents for bothering him."}],[{"type":"prose","content":"But Jesus said, "}],[{"type":"prose","content":"And he placed his hands on their heads and blessed them before he left."}],[{"type":"header","content":"The Rich Man"},{"type":"prose","content":"Someone came to Jesus with this question: “Teacher, what good deed must I do to have eternal life?”"}],[{"type":"prose","content":" Jesus replied. "}],[{"type":"prose","content":"“Which ones?” the man asked.And Jesus replied: "}],[],[{"type":"prose","content":"“I’ve obeyed all these commandments,” the young man replied. “What else must I do?”"}],[{"type":"prose","content":"Jesus told him, "}],[{"type":"prose","content":"But when the young man heard this, he went away sad, for he had many possessions."}],[{"type":"prose","content":"Then Jesus said to his disciples, "}],[],[{"type":"prose","content":"The disciples were astounded. “Then who in the world can be saved?” they asked."}],[{"type":"prose","content":"Jesus looked at them intently and said, "}],[{"type":"prose","content":"Then Peter said to him, “We’ve given up everything to follow you. What will we get?”"}],[{"type":"prose","content":"Jesus replied, "}],[],[]]