[{"num":19,"verse":"And it came to pass when Rebbe, Melech HaMoshiach finished these dvarim, he departed from the Galil and came into the regions of Yehudah east of the Yarden River."},{"num":2,"verse":"And a great multitude followed Rebbe, Melech HaMoshiach, who brought refuah (healing) to them there."},{"num":3,"verse":"And the Perushim approached him with a she’elah to test him, and they asked him, Is it mutar (permissible) for a man to give a get (divorce) to his wife for any and every reason?"},{"num":4,"verse":"But Rebbe, Melech HaMoshiach said in reply, Have you not read that HaBoreh (The Creator, G-d) bereshis (in the beginning) created them zachar (male) and nekevah (female) [BERESHIS 1:27, 5:2]?"},{"num":5,"verse":"And he said, Because of this, YAAZAV ISH ES AVIV VES IMMO VDAVAK BISHTO VHAYU LVASAR ECHAD (a man will leave his father and his mother and will be joined to his isha (wife), and the two will be one flesh, BERESHIS 2:24)."},{"num":6,"verse":"So they are no longer shnayim (two) but basar echad (one flesh). Therefore, whatever Hashem joined together, let no man divide asunder."},{"num":7,"verse":"They say to him, Why then did Moshe Rabbenu give the mitzvah to give the get, the sefer keritut, and send her away?"},{"num":8,"verse":"He says to them, Moshe, because of your hardness of heart, permitted you to give the get to your wives; but from bereshis (in the beginning), however, it was not so."},{"num":9,"verse":"But I [Moshiach] say to you that whoever, the case of zenut (fornication) being excepted, gives the get to his wife and marries another, is guilty of niuf (adultery)."},{"num":10,"verse":"Moshiach’s talmidim say to him, If thus is the case of the man with the wife, nikhnas lchuppah (to be wed) is not advantageous."},{"num":11,"verse":"But Rebbe, Melech HaMoshiach said to them, Not everyone is able to accept this dvar torah, but rather those to whom it has been given."},{"num":12,"verse":"For there are sarisim (eunuchs) who from the womb of their Em were born thus, and there are sarisim who were made sarisim by men, and there are sarisim who make sarisim of themselves for the sake of the Malchut HaShomayim. The one able to receive this, let him receive it."},{"num":13,"verse":"Then yeladim were brought to Rebbe, Melech HaMoshiach that he might place his hands on them and say a bracha. However, Moshiach’s talmidim rebuked them."},{"num":14,"verse":"But he said, Permit the yeladim to come to me, and forbid them not, for of such is the Malchut HaShomayim."},{"num":15,"verse":"And having placed his hands on the yeladim, Rebbe, Melech HaMoshiach departed from there."},{"num":16,"verse":"And one, having approached Rebbe, Melech HaMoshiach, said, Rebbe, what mitzvah, what good may I do that I may have Chayyei Olam?"},{"num":17,"verse":"And Rebbe, Melech HaMoshiach said to him, Why do you ask me about the good? There is only One who is good, nu? But if you wish to enter into Chayyim (Life), do not fail to be shomer mitzvot."},{"num":18,"verse":"He says to Rebbe, Melech HaMoshiach, Which mitzvah? And Rebbe, Melech HaMoshiach said, LO TIRTZACH, LO TINAF, LO TIGNOV, LO TAANEH VREIACHAH ED SHAKER, KABEID ES AVICHA VES IMMECHAH, VAHAVTAH LREACHA KAMOCHA (You shall not murder, commit adultery, steal, bear false witness;"},{"num":19,"verse":"Honor your father and your mother, and you shall love your neighbor as yourself, SHEMOT 20:13(13-16); DEVARIM 5:17-20; SHEMOT 20:12; DEVARIM 5:16; VAYIKRA 19:18."},{"num":20,"verse":"The bocher (bachelor, young man) says to Rebbe, Melech HaMoshiach, I was shomer mitzvot and frum in all these things, so where do I still fall short?"},{"num":21,"verse":"Rebbe, Melech HaMoshiach said to him, If you wish to be tamim (perfect), if you wish to have shelemut (perfection, completeness), then go and sell your possessions and give to the aniyim (poor) and you will have otzar (treasure) in Shomayim. Then come and follow me [Moshiach]."},{"num":22,"verse":"But having heard the divrei Moshiach, the young man went away with agmat nefesh (grief), for he was having many possessions."},{"num":23,"verse":"And he said to his talmidim, Omein, I say to you that an oisher with difficulty will enter into the Malchut HaShomayim."},{"num":24,"verse":"And again I say to you, it is easier for a camel to go through the eye of a needle than for an oisher to enter into the Malchut HaShomayim."},{"num":25,"verse":"And when Moshiach’s talmidim heard this, they were exceedingly astounded, saying, Who then is able to receive the Yeshuat Eloheinu?"},{"num":26,"verse":"And having looked upon them, Rebbe, Melech HaMoshiach said to them, With Bnei Adam it is impossible; but with Hashem all things are possible."},{"num":27,"verse":"Then Kefa said in reply to him, Hinei! We have left everything and followed you [as Moshiach]! Where does that leave us?"},{"num":28,"verse":"And Moshiach said to them, Omein, I say to you, that you, the ones having followed me, when the Briah (Creation) becomes Chadasha (New), when the Ben HaAdam [Moshiach] sits upon his Kisei Kavod (Throne of Glory), you also will sit upon the Shneym Asar Kisot (Twelve Thrones) judging the Shneym Asar Shivtei Yisroel."},{"num":29,"verse":"And anyone who left bais or achim or achayot or Abba or Em or banim or sadot (fields) on account of me [Moshiach] and my Name (Yehoshua, Yeshua), will receive a hundred times over and will inherit Chayyei Olam."},{"num":30,"verse":"And many who are Rishonim (first ones) will be Acharonim (last ones), and the Acharonim, Rishonim."}]