[{"header":"The divine principle of marriage"},{"num":1,"verse":"When Jesus had finished talking on these matters, he left Galilee and went on to the district of Judea on the far side of the Jordan. Vast crowds followed him, and he cured them."},{"num":3,"verse":"Then the Pharisees arrived with a test-question. “Is it right,” they asked, “for a man to divorce his wife on any grounds whatever?”"},{"num":4,"verse":"“Haven’t you read,” he answered, “that the one who created them from the beginning ‘made them male and female’ and said: ‘For this reason a man shall leave his father and mother and be joined to his wife, and the two shall become one flesh’? So they are no longer two separate people but one. No man therefore must separate what God has joined together.”"},{"num":7,"verse":"“Then why,” they retorted, “did Moses command us to give a written divorce-notice and dismiss the woman?”"},{"num":8,"verse":"“It was because you knew so little of the meaning of love that Moses allowed you to divorce your wives! But that was not the original principle. I tell you that anyone who divorces his wife on any grounds except her unfaithfulness and marries some other woman commits adultery.”"},{"num":10,"verse":"His disciples said to him, “If that is a man’s position with his wife, it is not worth getting married!”"},{"num":11,"verse":"“It is not everybody who can live up to this,” replied Jesus, “—only those who have a special gift. For some are incapable of marriage from birth, some are made incapable by the action of men, and some have made themselves so for the sake of the kingdom of Heaven. Let the man who can accept what I have said accept it.”"},{"header":"Jesus welcomes children"},{"num":13,"verse":"Then some little children were brought to him, so that he could put his hands on them and pray for them. The disciples frowned on the parents’ action but Jesus said, “You must let little children come to me, and you must never stop them. The kingdom of Heaven belongs to little children like these!” Then he laid his hands on them and went on his way."},{"header":"Jesus shows that keeping the commandments is not enough"},{"num":16,"verse":"Then it happened that a man came up to him and said, “Master what good thing must I do to secure eternal life?”"},{"num":17,"verse":"“I wonder why you ask me about what is good?” Jesus answered him. “Only one is good. But if you want to enter that life you must keep the commandments.”"},{"num":18,"verse":"“Which ones?” he asked. “‘You shall not murder,’ ‘You shall not commit adultery,’ ‘You shall not steal,’ ‘You shall not bear false witness,’ ‘Honour your father and your mother’, and ‘You shall love your neighbour as yourself’,” replied Jesus."},{"num":20,"verse":"“I have carefully kept all these,” returned the young man. “What is still missing in my life?”"},{"num":21,"verse":"Then Jesus told him, “If you want to be perfect, go now and sell your property and give the money away to the poor—you will have riches in Heaven. Then come and follow me!”"},{"num":22,"verse":"When the young man heard that he turned away crestfallen, for he was very wealthy."},{"num":23,"verse":"Then Jesus remarked to his disciples, “Believe me, a rich man will find it very difficult to enter the kingdom of Heaven. Yes, I repeat, a camel could more easily squeeze through the eye of a needle than a rich man get into the kingdom of God!”"},{"num":25,"verse":"The disciples were simply amazed to hear this, and said, “Then who can possibly be saved?”"},{"num":26,"verse":"Jesus looked steadily at them and replied, “Humanly speaking it is impossible; but with God anything is possible!”"},{"header":"Jesus declares that sacrifice for the kingdom will be repaid"},{"num":27,"verse":"At this Peter exclaimed, “Look, we have left everything and followed you. What is that going to be worth to us?”"},{"num":28,"verse":"“Believe me,” said Jesus, “when I tell you that in the next world, when the Son of Man shall sit down on his glorious throne, you who have followed me will also sit on twelve thrones and become judges of the twelve tribes of Israel. Every man who has left houses or brothers or sisters or fathers or mother or children or land for my sake will receive it all back many times over, and will inherit eternal life. But many who are first now will be last then—and the last first!"}]