[{"num":19,"verse":"After Jesus had finished this address, he left Galilee and circled back to Judea from across the Jordan River. "},{"num":2,"verse":"Vast crowds followed him, and he healed their sick. "},{"num":3,"verse":"Some Pharisees came to interview him and tried to trap him into saying something that would ruin him."},{"num":4,"verse":"“Don’t you read the Scriptures?” he replied. “In them it is written that at the beginning God created man and woman, "},{"num":5,"verse":"and that a man should leave his father and mother, and be forever united to his wife. The two shall become one—no longer two, but one! And no man may divorce what God has joined together.”"},{"num":7,"verse":"“Then, why,” they asked, “did Moses say a man may divorce his wife by merely writing her a letter of dismissal?”"},{"num":8,"verse":"Jesus replied, “Moses did that in recognition of your hard and evil hearts, but it was not what God had originally intended. "},{"num":9,"verse":"And I tell you this, that anyone who divorces his wife, except for fornication, and marries another, commits adultery.”"},{"num":10,"verse":"Jesus’ disciples then said to him, “If that is how it is, it is better not to marry!”"},{"num":11,"verse":"“Not everyone can accept this statement,” Jesus said. “Only those whom God helps. "},{"num":12,"verse":"Some are born without the ability to marry, and some are disabled by men, and some refuse to marry for the sake of the Kingdom of Heaven. Let anyone who can, accept my statement.”"},{"num":13,"verse":"Little children were brought for Jesus to lay his hands on them and pray. But the disciples scolded those who brought them. “Don’t bother him,” they said."},{"num":14,"verse":"But Jesus said, “Let the little children come to me, and don’t prevent them. For of such is the Kingdom of Heaven.” "},{"num":15,"verse":"And he put his hands on their heads and blessed them before he left."},{"num":16,"verse":"Someone came to Jesus with this question: “Good master, what must I do to have eternal life?”"},{"num":17,"verse":"“When you call me good you are calling me God,” Jesus replied, “for God alone is truly good. But to answer your question, you can get to heaven if you keep the commandments.”"},{"num":18,"verse":"“Which ones?” the man asked."},{"num":19,"verse":"honor your father and mother, and love your neighbor as yourself!”"},{"num":20,"verse":"“I’ve always obeyed every one of them,” the youth replied. “What else must I do?”"},{"num":21,"verse":"Jesus told him, “If you want to be perfect, go and sell everything you have and give the money to the poor, and you will have treasure in heaven; and come, follow me.” "},{"num":22,"verse":"But when the young man heard this, he went away sadly, for he was very rich."},{"num":23,"verse":"Then Jesus said to his disciples, “It is almost impossible for a rich man to get into the Kingdom of Heaven. "},{"num":24,"verse":"I say it again—it is easier for a camel to go through the eye of a needle than for a rich man to enter the Kingdom of God!”"},{"num":25,"verse":"This remark confounded the disciples. “Then who in the world can be saved?” they asked."},{"num":26,"verse":"Jesus looked at them intently and said, “Humanly speaking, no one. But with God, everything is possible.”"},{"num":27,"verse":"Then Peter said to him, “We left everything to follow you. What will we get out of it?”"},{"num":28,"verse":"And Jesus replied, “When I, the Messiah, shall sit upon my glorious throne in the Kingdom,* you my disciples shall certainly sit on twelve thrones judging the twelve tribes of Israel. "},{"num":29,"verse":"And anyone who gives up his home, brothers, sisters, father, mother, wife, children, or property, to follow me, shall receive a hundred times as much in return, and shall have eternal life. "},{"num":30,"verse":"But many who are first now will be last then; and some who are last now will be first then.”"}]