[{"num":1,"verse":"Therefore, having these promises, beloved, let us cleanse ourselves from every stain of flesh and spirit, perfecting holiness in the fear of God."},{"header":"Make Room For Us In Your Hearts"},{"num":2,"verse":"Make-room-for us— we wronged no one, we corrupted no one, we exploited no one. "},{"num":3,"verse":"I am not speaking for your condemnation. For I have said-before that you are in our hearts so as to die-together and to live-together. "},{"num":4,"verse":"There is great confidence in me toward you. There is much boasting by me about you."},{"header":"When I Found Titus In Macedonia, I Was Comforted By His Report About You"},{"num":5,"verse":"For indeed we having come to Macedonia, our flesh had no rest, but we were being afflicted in every way— battles outside, fears inside. "},{"num":6,"verse":"But the One comforting the downcast, God, comforted us by the coming of Titus; "},{"num":7,"verse":"and not only by his coming, but also by the comfort with which he was comforted over you while reporting to us your yearning, your mourning, your zeal for me, so that I rejoiced more."},{"header":"I Am Rejoicing At Your Repentance And Actions After You Received My Letter"},{"num":8,"verse":"Because even though I grieved you by the letter, I do not regret it. Even though I was regretting it (for I see that that letter grieved you, even though for an hour), "},{"num":9,"verse":"now I am rejoicing— not that you were grieved, but that you were grieved into repentance. For you were grieved in-accordance-with God, in order that you might suffer-loss in nothing by us. "},{"num":10,"verse":"For the grief in accordance with God works unregretted repentance leading-to salvation. But the grief of the world produces death. "},{"num":11,"verse":"For behold this very thing— the being grieved in accordance with God— how much earnestness it produced in you; even a defense, even indignation, even fear, even yearning, even zeal, even punishment. In everything you demonstrated yourselves to be pure in the matter. "},{"num":12,"verse":"So even though I wrote to you [causing grief], it was not for the sake of the one having done wrong, nor for the sake of the one having been wronged, but for the sake of making your earnestness for us evident to you in the sight of God. "},{"num":13,"verse":"For this reason, we have been comforted."},{"header":"I Rejoiced Even More At The Joy of Titus Over You"},{"num":14,"verse":"Because if I have boasted anything to him about you, I was not put-to-shame. But as we spoke all things to you in truth, so also our boasting before Titus proved-to-be the truth. "},{"num":15,"verse":"And his deep-feelings are especially for you, while remembering the obedience of you all— how you received him with fear and trembling. "},{"num":16,"verse":"I am rejoicing because in everything I am confident in you."}]