[{"num":7,"verse":"Because we have these promises, dearly loved ones, out of respect for God we should scour the filth from our flesh and spirit and move toward perfect beauty and holiness."},{"num":2,"verse":"Take us into your hearts; love us as we love you. You have nothing to fear. We have hurt no one, ruined no one, swindled no one. "},{"num":3,"verse":"I am not writing these things to condemn you, as I said before. Our hearts embrace you, so we stand beside you whether facing life or death. "},{"num":4,"verse":"I am completely confident and incredibly proud of you. Even in all this turbulence I am at peace—I am overflowing with joy."},{"num":5,"verse":"When we came into Macedonia, we were completely worn out—under attack from every angle—nagging opposition on the outside, our own nagging fears from the inside. "},{"num":6,"verse":"But God, who comforts the downcast, brought us comfort when Titus arrived from Corinth. "},{"num":7,"verse":"We were relieved, not just to see him, but because he told us how he was encouraged to learn about your longing, your grieving, and your continued enthusiasm for me. So these were all more reasons for me to rejoice!"},{"num":8,"verse":"I knew you would be upset with my last letter, but I do not regret sending it. If there were times I did have second thoughts, it was because I could see that the letter did hurt you, even if only for a while. "},{"num":9,"verse":"Now I am glad—not because it caused you grief but because you were moved to make a permanent change that can happen only with the realization that your actions have gone against God—I’m glad to know you suffered no long-term loss because of what we did. "},{"num":10,"verse":"Now this type of deep sorrow, godly sorrow, is not so much about regret; but it is about producing a change of mind and behavior that ultimately leads to salvation. But the other type of sorrow, worldly sorrow, often is fleeting and only brings death. "},{"num":11,"verse":"Look at what is happening among you! Notice how authentic and diligent you have become because this godly sorrow has been at work in your community. But there’s more: your desire to clear your name, your righteous anger, your respect, your longing, your zeal, and your concern for justice. All these demonstrate how you have been made clean. "},{"num":12,"verse":"So when I wrote my last difficult letter, it was not to comfort the victim or confront the perpetrator—it was to stir up your sincere devotion for us under God’s watchful eye. "},{"num":13,"verse":"In the midst of all that has happened, though it has been difficult, we are comforted and encouraged. When we saw the relief and joy on Titus’s face, we celebrated even more because his spirit had been totally refreshed by you. "},{"num":14,"verse":"Now if I have bragged in the past about you to Titus, I have nothing to be ashamed of. Just as we’ve spoken the whole truth to you, I’m glad to know that our boasts to Titus about you have proven true as well. "},{"num":15,"verse":"His love for you overflows even more as he recalls your obedience and how you respectfully and somewhat nervously, with fear and trembling, took him in. "},{"num":16,"verse":"I have great joy now because I have great confidence in you."}]