[{"header":"Solomon’s Palace"},{"num":7,"verse":"King Solomon also built a palace for himself. It took him 13 years to finish building it. "},{"num":2,"verse":"He built the Palace of the Forest of Lebanon. It was 150 feet long, 75 feet wide and 45 feet high. It had four rows of cedar columns. They supported the cedar beams. "},{"num":3,"verse":"The ceiling was covered with cedar above the beams. There were 45 beams on the roof, with 15 beams in each row. "},{"num":4,"verse":"Windows were placed in three rows facing each other. "},{"num":5,"verse":"All the doors were square. The three doors at each end faced each other."},{"num":6,"verse":"Solomon also built the porch of pillars. It was 75 feet long and 45 feet wide. Along the front of the porch, there was a covering supported by pillars."},{"num":7,"verse":"Solomon also built a throne room where he judged people. He called this the Hall of Justice. The room was covered with cedar from the floor to the ceiling. "},{"num":8,"verse":"The palace where Solomon was to live was behind the Hall of Justice. And it was built like the Hall of Justice. Solomon also built the same kind of palace for his wife. She was the daughter of the king of Egypt."},{"num":9,"verse":"All these buildings were made with blocks of carefully cut fine stone. Then they were trimmed with a saw in the front and back. These fine stones went from the foundations of the buildings to the top of the walls. Even the courtyard was made with blocks of stone. "},{"num":10,"verse":"The foundations were made with large blocks of fine stone. Some of the stones were 15 feet long. Others were 12 feet long. "},{"num":11,"verse":"On top of those stones there were other cut blocks of fine stone and cedar beams. "},{"num":12,"verse":"The palace courtyard, the courtyard inside the Temple and the porch to the Temple were surrounded by walls. All of these walls had three rows of cut stone blocks and one row of cedar beams."},{"header":"The Temple Is Completed Inside"},{"num":13,"verse":"King Solomon sent to Tyre and had Huram brought to him. "},{"num":14,"verse":"Huram’s mother was a widow from the tribe of Naphtali. His father was from Tyre and had been skilled in making things from bronze. Huram was also very skilled and experienced in bronze work. So he came to King Solomon. And he did all the bronze work Solomon wanted."},{"num":15,"verse":"He made two bronze pillars. Each one was 27 feet tall and 18 feet around. "},{"num":16,"verse":"He also made two bronze capitals that were 7½ feet tall. He put them on top of the pillars. "},{"num":17,"verse":"Then he made a net of seven chains for each capital. They covered the capitals on top of the two pillars. "},{"num":18,"verse":"Then he made two rows of bronze pomegranates to go on the nets. They were to cover the capitals at the top of the pillars. "},{"num":19,"verse":"The capitals on top of the pillars in the porch were shaped like lilies. They were 6 feet tall. "},{"num":20,"verse":"The capitals were on top of both pillars. They were above the bowl-shaped section and next to the nets. At that place there were 200 pomegranates in rows all around the capitals. "},{"num":21,"verse":"Huram put these two bronze pillars at the porch of the Temple. He named the south pillar He Establishes. And he named the north pillar In Him Is Strength. "},{"num":22,"verse":"The capitals on top of the pillars were shaped like lilies. So the work on the pillars was finished."},{"num":23,"verse":"Then Huram made a large round bowl from bronze, which was called the Sea. It was 45 feet around. It was 15 feet across and 7½ feet deep. "},{"num":24,"verse":"There was a rim around the outer edge of the bowl. Under this rim there were two rows of bronze plants surrounding the bowl. There were ten plants in every 18 inches. They were made in one piece with the bowl. "},{"num":25,"verse":"The bowl rested on the backs of 12 bronze bulls. They faced outward from the center of the bowl. Three bulls faced north, 3 faced east, 3 faced south and 3 faced west. "},{"num":26,"verse":"The sides of the bowl were 4 inches thick. The rim was like the rim of a cup or like a lily blossom. The bowl held about 11,000 gallons."},{"num":27,"verse":"Then Huram made ten bronze stands. Each one was 6 feet long, 6 feet wide and 4½ feet high. "},{"num":28,"verse":"The stands were made from square sides, which were put on frames. "},{"num":29,"verse":"On the sides were bronze lions, bulls and creatures with wings. On the frames above and below the lions and bulls there were designs of flowers hammered into the bronze. "},{"num":30,"verse":"Each stand had four bronze wheels with bronze axles. At the corners there were bronze supports for a large bowl. The supports had designs of flowers. "},{"num":31,"verse":"There was a frame on top of the bowls. It was 18 inches high above the bowls. The opening of the bowl was round, 27 inches deep. There were designs carved into the bronze on the frame. The frame was square, not round. "},{"num":32,"verse":"The four wheels were under the frame. They were 27 inches high. The axles between the wheels were made as one piece with the stand. "},{"num":33,"verse":"The wheels were like a chariot’s wheels. Everything on the wheels was made of bronze. The axles, rims, spokes and hubs were made of bronze."},{"num":34,"verse":"The four supports were on the four corners of each stand. They were made as one piece with the stand. "},{"num":35,"verse":"There was a strip of bronze around the top of each stand. It was 9 inches deep. It was made as one piece with the stand. "},{"num":36,"verse":"The sides of the stand and the frames were totally covered with carvings. They were carved with pictures of creatures with wings, lions and palm trees. There were also flowers carved all around. "},{"num":37,"verse":"So this is the way Huram made the ten stands. The bronze for each stand was melted and poured into a mold. So all of the stands were the same size and shape."},{"num":38,"verse":"Huram also made ten bronze bowls. There was one bowl for each of the ten stands. Each bowl was six feet across and could hold about 230 gallons. "},{"num":39,"verse":"Huram put five of the stands on the south side of the Temple. And he put the other five stands on the north side. He put the large bowl in the southeast corner of the Temple. "},{"num":40,"verse":"Huram also made bowls, shovels and small bowls."},{"num":46,"verse":"The king ordered these things to be made near the Jordan River between Succoth and Zarethan. They were made by melting and pouring bronze into clay molds. "},{"num":47,"verse":"Solomon never weighed the bronze used to make these things. There was too much to weigh. So the total weight of all the bronze was never known."},{"num":48,"verse":"Solomon also commanded that many things be made of gold for the Temple:"},{"num":51,"verse":"So the work King Solomon did for the Temple of the Lord was finished. David, Solomon’s father, had saved silver, gold and other articles for the Temple. So Solomon brought these things into the Temple. And he put them into the treasuries of the Temple of the Lord."}]