[{"num":7,"verse":"¶ But Solomon built his own house in thirteen years, and he finished all his house."},{"num":2,"verse":"He also built the house of the forest of Lebanon, which was one hundred cubits long and fifty cubits wide and thirty cubits high, upon four rows of cedar pillars, with cedar beams upon the pillars."},{"num":3,"verse":"And it was covered with cedar above upon the beams that lay on forty-five pillars, fifteen in a row."},{"num":4,"verse":"And there were windows in three orders, one against another in three orders."},{"num":5,"verse":"And all the doors and posts were square, with some windows opposite the other windows in three orders."},{"num":6,"verse":"And he made a porch of pillars, which was fifty cubits long and thirty cubits wide, and the porch was before those others, with its corresponding pillars and thick beams."},{"num":7,"verse":"Then he made a porch for the throne where he was to judge, even the porch of judgment; and it was covered with cedar from one side of the floor to the other."},{"num":8,"verse":"And his house where he dwelt had another court within the porch, which was of like work. Solomon also made a house for Pharaoh’s daughter, whom he had taken to wife, like unto this porch."},{"num":9,"verse":"All these works were of costly stones, cut and sawed with saws according to the measurements, within and without, even from the foundation unto the coping, and so on the outside unto the great court."},{"num":10,"verse":"And the foundation was of costly stones, even great stones, stones of ten cubits and stones of eight cubits."},{"num":11,"verse":"And above were also costly stones, hewed according to their measurements, and work of cedar."},{"num":12,"verse":"And the great court round about had three orders of hewed stones and an order of cedar beams, and likewise the inner court of the house of the LORD and the porch of the house."},{"num":13,"verse":"¶ And King Solomon sent and brought Hiram out of Tyre,"},{"num":14,"verse":"who was a widow’s son of the tribe of Naphtali, and his father had been of Tyre. A worker in brass, full of wisdom and intelligence and knowledge in all work of brass. And he came to King Solomon and did all his work."},{"num":15,"verse":"He made two pillars of brass, of eighteen cubits high apiece, and a line of twelve cubits did compass each of them about."},{"num":16,"verse":"And he made two chapiters of molten brass, to set upon the tops of the pillars; the height of the one chapiter was five cubits, and the height of the other chapiter was five cubits."},{"num":17,"verse":"And nets of checker work and wreaths of chain work for the chapiters which were to be placed upon the top of the pillars, seven for the one chapiter and seven for the other chapiter."},{"num":18,"verse":"And when he had made the pillars, he also made two orders of pomegranates round about upon the network to cover the chapiters that were upon the heads of the pillars with the pomegranates, and so did he for the other chapiter."},{"num":19,"verse":"And the chapiters that were upon the top of the pillars were in the form of lilies like those seen in the porch, for four cubits."},{"num":20,"verse":"And the chapiters upon the two pillars had two hundred pomegranates in two orders round about in each chapiter, on top of the belly of the chapiter, this belly being in front of the network."},{"num":21,"verse":"And he stood up the pillars in the porch of the temple. And when he had set up the right pillar, he called the name of it Jachin; {Heb. The LORD establishes} and in standing up the left pillar, he called its name Boaz. {Heb. Only in Him is there strength}"},{"num":22,"verse":"And upon the top of the pillars was lily work, and so the work of the pillars was finished."},{"num":23,"verse":"Likewise, he made a molten sea, ten cubits from the one brim to the other; it was perfectly round, and its height was five cubits, and a line of thirty cubits did compass it round about."},{"num":24,"verse":"And under the brim of it round about there were knops like gourds compassing it, ten in a cubit, compassing the sea round about in two orders, which were made when it was cast."},{"num":25,"verse":"It stood upon twelve oxen, three looking toward the north and three looking toward the west and three looking toward the Negev and three looking toward the east; and upon them the sea rested, and all their hinder parts were inward."},{"num":26,"verse":"And it was a hand breadth thick, and its lip was made like the lip of a cup, with flowers of lilies; it contained two thousand baths."},{"num":27,"verse":"He also made ten bases of brass; four cubits was the length of each base and four cubits the width and three cubits the height."},{"num":28,"verse":"And the work of the bases was like this: they had borders, and the borders were between mouldings;"},{"num":29,"verse":"and upon the borders that were between the mouldings were lions, oxen, and cherubim; and upon the mouldings of the base, above and beneath the lions and oxen were certain additions made of bevelled work."},{"num":30,"verse":"And each base had four brasen wheels and cardinals {hinged axles} of brass, and in its four corners it had shoulderpieces, which were molten at the side of each addition, to be under the laver."},{"num":31,"verse":"Its mouth entered into the chapiter (in the joint that came out of the base) one cubit above, and its mouth was rounded like the workmanship (of the same joint) in the base, of a cubit and a half. There were also engravings upon the mouth of it with their borders, which were square, not round."},{"num":32,"verse":"And under the borders were the four wheels, and the axletrees of the wheels came forth from the same base. The height of each wheel was one and a half cubits."},{"num":33,"verse":"And the workmanship of the wheels was like the workmanship of a chariot wheel, their axletrees and their rims and their spokes and their hubs were all molten."},{"num":34,"verse":"Likewise, the four shoulderpieces to the four corners of each base, and the shoulderpieces were of the very base itself."},{"num":35,"verse":"And in the top of the base there was a rounded compass of half a cubit high and on the top of the base, its mouldings and borders which were part of it."},{"num":36,"verse":"For on the tables of the mouldings and on the borders thereof, he made cherubim, lions, and palm trees, in front of the additions of each one round about."},{"num":37,"verse":"After this manner he made ten bases cast in the same manner, of the same size and of the same shape."},{"num":38,"verse":"Then he also made ten lavers of brass; each laver contained forty baths, and each laver measured four cubits; and he set a laver upon each one of the ten bases."},{"num":39,"verse":"And he put five bases on the right side of the house and five on the left side of the house, and he set the sea on the right side of the house to the east towards the Negev."},{"num":40,"verse":"Hiram made the lavers and the shovels and the basins likewise. So Hiram finished all the work that he made King Solomon for the house of the LORD:"},{"num":41,"verse":"That is, the two pillars and the two bowls of the chapiters that were on the top of the two pillars and the two networks, to cover the two bowls of the chapiters which were upon the head of the pillars,"},{"num":42,"verse":"and four hundred pomegranates for the two networks, even two orders of pomegranates for each network, to cover the two bowls of the chapiters that were upon the heads of the pillars,"},{"num":43,"verse":"and the ten bases and ten lavers upon the bases,"},{"num":44,"verse":"and one sea and twelve oxen under the sea,"},{"num":45,"verse":"and the pots and the shovels and the basins and all the other vessels, which Hiram made to King Solomon for the house of the LORD of bright brass."},{"num":46,"verse":"And the king caused them all to be cast in the plain of the Jordan, in the clay ground between Succoth and Zarthan."},{"num":47,"verse":"And Solomon did not inquire the weight of the brass of all the vessels because they were exceeding many."},{"num":48,"verse":"¶ And Solomon made all the vessels that pertained unto the house of the LORD: an altar of gold, and a table upon which the showbread was, also of gold,"},{"num":49,"verse":"and the lampstands of pure gold, five on the right hand, and five on the left, in front of the oracle, with the flowers and the lamps and the tongs of gold,"},{"num":50,"verse":"likewise the bowls and the snuffers and the basins and the spoons and the censers of pure gold, also the hinges of gold, both for the doors of the inner house, the holy of holies, and for the doors of the house of the temple."},{"num":51,"verse":"So all the work that King Solomon made for the house of the LORD was complete. And Solomon brought in the things which David, his father, had dedicated, even the silver and the gold and the vessels, and he kept it all in the treasury of the house of the LORD."}]