[{"header":"Solomon’s House"},{"num":7,"verse":"Solomon was building his own house thirteen years, and he finished all of it. "},{"num":2,"verse":"He built the house of the trees of Lebanon. It was as long as fifty long steps, as wide as twenty-five long steps, and eight times taller than a man. It was built on four rows of cedar pillars, and large pieces of cedar wood lying on top of the pillars. "},{"num":3,"verse":"And it was covered with cedar above the rooms that were on the forty-five pillars, fifteen in each row. "},{"num":4,"verse":"There were three rows of special windows on one side, and three rows of windows on the other side. "},{"num":5,"verse":"All the doors and windows were as high as they were wide. And there were three rows of windows on each side. "},{"num":6,"verse":"Then he made a room for walking through of large pillars. It was as long as twenty-five long steps, and as wide as fifteen long steps. There was a porch in front with pillars, and an overhead covering in front of them. "},{"num":7,"verse":"He made a room for the throne, the room for judging. It was where he would decide between right and wrong. It was covered with cedar from the floor to the roof. "},{"num":8,"verse":"His own house where he was to live, in the place behind the throne room, was built the same way. Solomon made a house like this room for Pharaoh’s daughter also, whom he had married."},{"num":9,"verse":"All these were made with stones of much worth, each one cut to be put into place. They were cut with saws, inside and outside, from the very base to the top of the roof, and from the outside to the largest room."},{"num":10,"verse":"The base of the building was made with large stones of much worth. The stones were as long as five long steps, and four long steps. "},{"num":11,"verse":"Above this were stones of much worth, cut to go well into place, and cedar. "},{"num":12,"verse":"The largest room had three rows of cut stone around it, and a row of cedar pieces. The same was around the open space in the house of the Lord, and the porch of the house."},{"header":"Hiram—the Able Workman"},{"num":13,"verse":"Now King Solomon brought Hiram from Tyre. "},{"num":14,"verse":"Hiram was the son of a woman whose husband had died, from the family of Naphtali. His father was a man of Tyre, who worked with brass. He was filled with wisdom and understanding and much learning for doing any work with brass. So he came to King Solomon, and did all his work."},{"header":"The Two Brass Pillars"},{"num":15,"verse":"He made the two pillars of brass. One of them was five times taller than a man. And the length around each of them was as far as six long steps. "},{"num":16,"verse":"He made two top pieces of melted brass to set on the tops of the pillars. One piece to go on top was as tall as a man can raise his hand. And the other piece to go on top was as tall as a man can raise his hand. "},{"num":17,"verse":"He made nets of network and turned strings of chain-work for the pieces on top of the pillars. There were seven for one top piece, and seven for the other. "},{"num":18,"verse":"So Hiram made the pillars. There were two rows of pomegranates around each network, to cover the top pieces. "},{"num":19,"verse":"Now the top pieces on the pillars of the porch were made to look like lily flowers, as tall as a man. "},{"num":20,"verse":"The top pieces were upon the two pillars, and above the round part beside the network. There were 200 pomegranates in rows around both top pieces. "},{"num":21,"verse":"He set up the pillars at the porch of the house. He set up the right pillar and called it Jachin. And he set up the left pillar and called it Boaz. "},{"num":22,"verse":"The top pieces on the pillars were made to look like lily flowers. So the work of the pillars was finished."},{"header":"The Brass Pool"},{"num":23,"verse":"Now he made a large brass water pool. It was round, and as wide as five long steps. It was as tall as a man can raise his hand. And the length around it was as far as fifteen long steps. "},{"num":24,"verse":"Gourds went around the top of the pool. There were ten of them for every cubit. The gourds were in two rows, and made right in with the pool. "},{"num":25,"verse":"The pool stood on the backs of twelve bulls made of brass. Three looked to the north. Three looked to the west. Three looked to the south. And three looked to the east. The water was set on top of them, and their back parts turned toward the center. "},{"num":26,"verse":"The side of the pool was as far through as the width of a man’s open hand. Its round top was made like the top of a cup, like a lily flower. It could hold 2,000 bottles of water."},{"header":"The Brass Stands"},{"num":27,"verse":"Then he made the ten stands of brass. Each stand was as long as two long steps, as wide as two long steps, and as high as a man’s neck. "},{"num":28,"verse":"This is how the stands were made. They had sides of the same length between the cross-pieces. "},{"num":29,"verse":"On the side pieces between the cross-pieces were lions, bulls and cherubim. On the side pieces, both above and below the lions and bulls, there were round pieces of hanging work. "},{"num":30,"verse":"Each stand had four brass wheels on straight pieces of brass. At the four corners were pieces to hold up the basin. These pieces were made of melted brass with round pieces at each side. "},{"num":31,"verse":"Its opening inside the crown at the top was a cubit. It was round like a pillar, one and a half cubits deep. There were pictures cut on its opening. And their sides were not round, but had four sides of the same length. "},{"num":32,"verse":"Under the sides were the four wheels. The pieces that held the wheels were on the stand. The height of a wheel was one and a half cubits. "},{"num":33,"verse":"The wheels were made like the wheel of a war-wagon. The straight pieces which held the wheels, the outside of the wheels, their crosspieces and their center pieces were all made of one piece of brass. "},{"num":34,"verse":"There were four pieces at the four corners of each stand to hold it up. These were of one piece with the stands. "},{"num":35,"verse":"A narrow piece went all the way around the top that held it up and the sides were of one piece. "},{"num":36,"verse":"He cut pictures of cherubim, lions and palm trees in the plates of the parts that held it up and on its sides, where there was room. And there were pictures all around. "},{"num":37,"verse":"He made the ten stands like this. All of them were made alike. They had the same length, width and height, and looked the same. "},{"num":38,"verse":"He made ten basins of brass. One basin held 40 bottles of water. Each one was as wide as two long steps. And one basin was on each of the ten stands. "},{"num":39,"verse":"Then he put the stands in place. Five were on the south side of the house, and five were on the north side of the house. And he set the large basin of brass on the southeast corner of the house."},{"num":40,"verse":"Hiram made the basins, and the objects for digging, and the pots. So Hiram finished doing all the work for King Solomon in the house of the Lord. "},{"num":41,"verse":"He made the two pillars, and the two pots of the top pieces on the top of the two pillars. And he made the two networks to cover the two pots of the pieces on top of the pillars. "},{"num":42,"verse":"He made the 400 pomegranates for the two networks. There were two rows of pomegranates for each network, to cover the two pots of the pieces on top of the pillars. "},{"num":43,"verse":"He made the ten stands with the ten basins on top of them. "},{"num":44,"verse":"He made the large basin and the twelve bulls under it. "},{"num":45,"verse":"He made the pails, the objects for digging, and the pots. All these things which Hiram made for King Solomon in the house of the Lord were made of shining brass. "},{"num":46,"verse":"The king made them in the plain of the Jordan, in the clay ground between Succoth and Zarethan. "},{"num":47,"verse":"Solomon did not weigh any of the objects, because there were too many. The weight of the brass was not known."},{"num":48,"verse":"Solomon made all the holy things which were in the house of the Lord. He made the gold altar and the gold table for the bread before the Lord. "},{"num":49,"verse":"He made the lamp-stands of pure gold. There were five on the right side and five on the left side, in front of the most holy place. He made the flowers and the lamps and their objects out of gold. "},{"num":50,"verse":"He made the cups, the objects to put out the lamps, the pots, the dishes for special perfume, and the fire-holders, of pure gold. He made the hinges of gold, for the doors of the most holy place and for the doors of the house."},{"num":51,"verse":"So all the work that King Solomon did in the house of the Lord was finished. And Solomon brought in the things which had been set apart by his father David, the silver and the gold and the holy things. He put them in the store-houses of the house of the Lord."}]