[{"num":8,"verse":"Thus hath Adonoi Hashem showed unto me: and hinei a basket of kayitz (summer fruit)."},{"num":2,"verse":"And Hashem said, Amos, what seest thou? And I said, A basket of kayitz (summer fruit). Then said Hashem unto me, The ketz (end) is come upon My people Yisroel; I will not again pass by them [and spare them] anymore."},{"num":3,"verse":"And the shirot of the heikhal shall turn to wailings in that Yom, saith Adonoi Hashem; there shall be many dead bodies in every place; they shall cast them forth. Silence!"},{"num":4,"verse":"Hear this, O ye that swallow up the needy, even to make the anivvei aretz (poor of the land) to fail,"},{"num":5,"verse":"Saying, When will the Rosh Chodesh be over, that we may sell grain? And Shabbos, that we may market wheat, making the eifah (bushel) small, and the shekel great, and falsifying the balances by mirmah (deceit)?"},{"num":6,"verse":"That we may buy the poor for kesef, and the needy for a pair of sandals; yea, and sell the sweepings with the wheat?"},{"num":7,"verse":"Hashem hath sworn by the ga’on Ya’akov, Surely I will never forget any of their ma’asim."},{"num":8,"verse":"Shall not ha’aretz (the land) tremble for this, and every one mourn that dwelleth therein? And the whole land shall rise like the Nile; and heave and sink, as by the Nile of Mitzrayim."},{"num":9,"verse":"And it shall come to pass in that Yom, saith Adonoi Hashem, that I will cause the shemesh to go down at noon, and I will darken ha’aretz in the yom ohr (day light);"},{"num":10,"verse":"And I will turn your chagim into mourning, and all your shirot into lamentation; and I will bring up sackcloth upon all loins, and baldness upon every rosh; and I will make it as the mourning of a yachid (only son), and the end thereof as a yom mar (bitter day)."},{"num":11,"verse":"Hinei, the yamim come, saith Adonoi Hashem, that I will send a ra’av (famine) in the land, not a ra’av (famine) of lechem, nor a thirst for mayim, but of hearing the Divrei Hashem;"},{"num":12,"verse":"And they shall wander from yam to yam, and from the tzafon (north) even to the mizrach (east), they shall run to and fro to seek the Devar Hashem, and shall not find it."},{"num":13,"verse":"In that Yom shall the betulot hayafot (fair virgins) and bochurim faint for thirst."},{"num":14,"verse":"They that swear by the sin of Shomron, and say, Chai Elohecha, O Dan; and, The Derech Beer Sheva liveth; even they shall fall, and never rise up again."}]