[{"header":"Chapter 19"},{"num":1,"verse":"The Levite from Ephraim. In those days, when there was no king in Israel, there was a Levite residing in remote parts of the mountain region of Ephraim who had taken for himself a concubine from Bethlehem of Judah. "},{"num":2,"verse":"But his concubine spurned him and left him for her father’s house in Bethlehem of Judah, where she stayed for some four months. "},{"num":3,"verse":"Her husband then set out with his servant and a pair of donkeys, and went after her to soothe her and bring her back. He arrived at her father’s house, and when the young woman’s father saw him, he came out joyfully to meet him. "},{"num":4,"verse":"His father-in-law, the young woman’s father, urged him to stay, and so he spent three days eating and drinking and passing the night there. "},{"num":5,"verse":"On the fourth day they rose early in the morning and he prepared to go. But the young woman’s father said to his son-in-law, “Fortify yourself with a little food; you can go later on.” "},{"num":6,"verse":"So they stayed and the two men ate and drank together. Then the young woman’s father said to the husband, “Why not decide to spend the night here and enjoy yourself?” "},{"num":7,"verse":"The man made a move to go, but when his father-in-law pressed him he went back and spent the night there."},{"num":8,"verse":"On the fifth morning he rose early to depart, but the young woman’s father said, “Fortify yourself!” He coaxed him, and he tarried until the afternoon, and the two of them ate. "},{"num":9,"verse":"Then when the husband was ready to go with his concubine and servant, the young woman’s father said to him, “See, the day is wearing on toward evening. Stay for the night. See, the day is coming to an end. Spend the night here and enjoy yourself. Early tomorrow you can start your journey home.” "},{"num":10,"verse":"The man, however, refused to stay another night; he and his concubine set out with a pair of saddled donkeys, and traveled until they came opposite Jebus, which is Jerusalem. "},{"num":11,"verse":"Since they were near Jebus with the day far gone, the servant said to his master, “Come, let us turn off to this city of the Jebusites and spend the night in it.” "},{"num":12,"verse":"But his master said to him, “We will not turn off to a foreigner’s city, where there are no Israelites. We will go on to Gibeah. "},{"num":13,"verse":"Come,” he said to his servant, “let us make for some other place and spend the night in either Gibeah or Ramah.” "},{"num":14,"verse":"So they continued on their way until the sun set on them when they were opposite Gibeah of Benjamin."},{"num":15,"verse":"There they turned off to enter Gibeah for the night. The man went in and sat down in the town square, but no one took them inside to spend the night. "},{"num":16,"verse":"In the evening, however, an old man came from his work in the field; he was from the mountain region of Ephraim, though he was living in Gibeah where the local people were Benjaminites. "},{"num":17,"verse":"When he noticed the traveler in the town square, the old man asked, “Where are you going, and where have you come from?” "},{"num":18,"verse":"He said to him, “We are traveling from Bethlehem of Judah far up into the mountain region of Ephraim, where I am from. I have been to Bethlehem of Judah, and now I am going home; but no one has taken me into his house. "},{"num":19,"verse":"We have straw and fodder for our donkeys, and bread and wine for myself and for your maidservant and the young man who is with your servant; there is nothing else we need.” "},{"num":20,"verse":"“Rest assured,” the old man said to him, “I will provide for all your needs, but do not spend the night in the public square.” "},{"num":21,"verse":"So he led them to his house and mixed fodder for the donkeys. Then they washed their feet, and ate and drank."},{"num":22,"verse":"The Outrage at Gibeah. While they were enjoying themselves, the men of the city, a bunch of scoundrels, surrounded the house and beat on the door. They said to the old man who was the owner of the house, “Bring out the man who has come into your house, so that we may get intimate with him.” "},{"num":23,"verse":"The man who was the owner of the house went out to them and said, “No, my brothers; do not be so wicked. This man has come into my house; do not commit this terrible crime. "},{"num":24,"verse":"Instead, let me bring out my virgin daughter and this man’s concubine. Humiliate them, or do whatever you want; but against him do not commit such a terrible crime.” "},{"num":25,"verse":"But the men would not listen to him. So the man seized his concubine and thrust her outside to them. They raped her and abused her all night until morning, and let her go as the sun was coming up. "},{"num":26,"verse":"At the approach of morning the woman came and collapsed at the entrance of the house in which her husband was, and lay there until morning. "},{"num":27,"verse":"When her husband rose in the morning and opened the door of the house to start out again on his journey, there was the woman, his concubine, collapsed at the entrance of the house with her hands on the threshold. "},{"num":28,"verse":"“Come, let us go,” he said to her, but there was no answer. So the man placed her on a donkey and started out again for home."},{"num":29,"verse":"On reaching home, he got a knife and took hold of the body of his concubine. He cut her up limb by limb into twelve pieces and sent them throughout the territory of Israel. "},{"num":30,"verse":"He instructed the men whom he sent, “Thus you shall say to all the men of Israel: ‘Has such a thing ever happened from the day the Israelites came up from the land of Egypt to this day? Take note of it; form a plan and give orders.’”"}]