[{"header":"Offerings at the Tabernacle’s Dedication"},{"num":7,"verse":"And it was on the day that Moses had fully set up the tabernacle and anointed it and sanctified it and all its instruments, both the altar and all its vessels, and anointed them, and sanctified them, "},{"num":2,"verse":"that the leaders of Israel, heads of their fathers’ houses, who were the leaders of the tribes, and were over them who were counted, made an offering. "},{"num":3,"verse":"And they brought their offering before the Lord, six covered wagons, and twelve oxen, a wagon for two of the leaders, and for each one an ox. And they brought them before the tabernacle."},{"num":4,"verse":"The Lord spoke to Moses, saying: "},{"num":5,"verse":"Accept these things from them, that they may be used in the service of the tent of meeting. Give them to the Levites, to each man according to his service."},{"num":6,"verse":"Moses took the wagons and the oxen and gave them to the Levites. "},{"num":7,"verse":"Two wagons and four oxen he gave to the sons of Gershon, according to their service. "},{"num":8,"verse":"And four wagons and eight oxen he gave to the sons of Merari, according to their service, under the hand of Ithamar the son of Aaron the priest. "},{"num":9,"verse":"But to the sons of Kohath he gave none because the service of the sanctuary belonging to them was that they should carry on their shoulders."},{"num":10,"verse":"The leaders brought their dedication offerings when the altar was anointed, and offered their offerings before the altar. "},{"num":11,"verse":"The Lord said to Moses: They will offer their offering, each leader on his day, for the dedicating of the altar."},{"num":12,"verse":"He that offered his offering the first day was Nahshon the son of Amminadab, of the tribe of Judah."},{"num":13,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":14,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":15,"verse":"one young bull, one ram, and one male lamb in its first year as a burnt offering; "},{"num":16,"verse":"one goat kid as a sin offering; "},{"num":17,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, and five male lambs in their first year. This was the offering of Nahshon the son of Amminadab."},{"num":18,"verse":"On the second day Nethanel the son of Zuar, leader of Issachar, presented an offering."},{"num":19,"verse":"He offered as his offering one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mingled with oil as a grain offering; "},{"num":20,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":21,"verse":"one young bull, one ram, and one male lamb in its first year as a burnt offering; "},{"num":22,"verse":"one goat kid as a sin offering; "},{"num":23,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, and five male lambs in their first year. This was the offering of Nethanel the son of Zuar."},{"num":24,"verse":"On the third day Eliab the son of Helon, leader of the children of Zebulun, presented an offering."},{"num":25,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":26,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":27,"verse":"one young bull, one ram, one male lamb in its first year as a burnt offering; "},{"num":28,"verse":"one goat kid as a sin offering; "},{"num":29,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, five male lambs in their first year. This was the offering of Eliab the son of Helon."},{"num":30,"verse":"On the fourth day Elizur the son of Shedeur, leader of the children of Reuben, presented an offering."},{"num":31,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":32,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":33,"verse":"one young bull, one ram, one male lamb in its first year as a burnt offering; "},{"num":34,"verse":"one goat kid as a sin offering; "},{"num":35,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, five male lambs in their first year. This was the offering of Elizur the son of Shedeur."},{"num":36,"verse":"On the fifth day Shelumiel the son of Zurishaddai, leader of the children of Simeon, presented an offering."},{"num":37,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":38,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":39,"verse":"one young bull, one ram, one male lamb in its first year, as a burnt offering: "},{"num":40,"verse":"one goat kid as a sin offering; "},{"num":41,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, five male lambs in their first year. This was the offering of Shelumiel the son of Zurishaddai."},{"num":42,"verse":"On the sixth day Eliasaph the son of Deuel, leader of the children of Gad, presented an offering."},{"num":43,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":44,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":45,"verse":"one young bull, one ram, one male lamb in its first year as a burnt offering; "},{"num":46,"verse":"one goat kid as a sin offering; "},{"num":47,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, five male lambs in their first year. This was the offering of Eliasaph the son of Deuel."},{"num":48,"verse":"On the seventh day Elishama the son of Ammihud, leader of the children of Ephraim, presented an offering."},{"num":49,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":50,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":51,"verse":"one young bull, one ram, one male lamb in its first year as a burnt offering; "},{"num":52,"verse":"one goat kid as a sin offering; "},{"num":53,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, five male lambs in their first year. This was the offering of Elishama the son of Ammihud."},{"num":54,"verse":"On the eighth day Gamaliel the son of Pedahzur, leader of the children of Manasseh, presented an offering."},{"num":55,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":56,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":57,"verse":"one young bull, one ram, and one male lamb in its first year as a burnt offering; "},{"num":58,"verse":"one goat kid as a sin offering; "},{"num":59,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, five male lambs in their first year. This was the offering of Gamaliel the son of Pedahzur."},{"num":60,"verse":"On the ninth day Abidan the son of Gideoni, leader of the children of Benjamin, presented an offering."},{"num":61,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":62,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":63,"verse":"one young bull, one ram, and one male lamb in its first year as a burnt offering; "},{"num":64,"verse":"one goat kid as a sin offering; "},{"num":65,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, and five male lambs in their first year. This was the offering of Abidan the son of Gideoni."},{"num":66,"verse":"On the tenth day Ahiezer the son of Ammishaddai, leader of the children of Dan, presented an offering."},{"num":67,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":68,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":69,"verse":"one young bull, one ram, and one male lamb in its first year as a burnt offering; "},{"num":70,"verse":"one goat kid as a sin offering; "},{"num":71,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, and five male lambs in their first year. This was the offering of Ahiezer the son of Ammishaddai."},{"num":72,"verse":"On the eleventh day Pagiel the son of Okran, leader of the children of Asher, presented an offering."},{"num":73,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":74,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":75,"verse":"one young bull, one ram, and one male lamb in its first year as a burnt offering; "},{"num":76,"verse":"one goat kid as a sin offering; "},{"num":77,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, and five male lambs in their first year. This was the offering of Pagiel the son of Okran."},{"num":78,"verse":"On the twelfth day Ahira the son of Enan, leader of the children of Naphtali, presented an offering."},{"num":79,"verse":"And his offering was one silver charger, the weight of which was one hundred and thirty shekels, one silver bowl of seventy shekels, after the shekel of the sanctuary, both of them full of fine flour mixed with oil as a grain offering; "},{"num":80,"verse":"one spoon of ten shekels of gold, full of incense; "},{"num":81,"verse":"one young bull, one ram, and one male lamb in its first year as a burnt offering; "},{"num":82,"verse":"one goat kid as a sin offering; "},{"num":83,"verse":"and as a sacrifice of peace offerings, two oxen, five rams, five male goats, and five male lambs in their first year. This was the offering of Ahira the son of Enan."},{"num":84,"verse":"This was the dedication of the altar, in the day when it was anointed, by the leaders of Israel: twelve silver plates, twelve silver bowls, and twelve gold spoons, "},{"num":85,"verse":"each silver plate weighing one hundred and thirty shekels, each bowl seventy. All the silver vessels weighed two thousand four hundred shekels, according to the shekel of the sanctuary. "},{"num":86,"verse":"The gold spoons were twelve, full of incense, weighing ten shekels apiece, according to the shekel of the sanctuary. All the gold of the spoons was one hundred and twenty shekels. "},{"num":87,"verse":"All the oxen for the burnt offering were twelve bulls, twelve rams, twelve male lambs in their first year, with their grain offering, and twelve goat kids for a sin offering. "},{"num":88,"verse":"And all the oxen for the sacrifice of the peace offerings were twenty-four bulls, the rams sixty, the goats sixty, the one-year-old lambs sixty. This was the dedication of the altar after it was anointed."},{"num":89,"verse":"And then Moses went into the tent of meeting to speak with Him, and he heard the voice of One speaking to him from the mercy seat that was on the ark of the testimony, from between the two cherubim, and He spoke to him."}]