[{"header":"Offerings of Tribal Princes"},{"num":7,"verse":"When Moses finished setting up the Tabernacle, he anointed and consecrated it and all its implements, the altar and all its utensils, and he anointed and consecrated them. "},{"num":2,"verse":"Then the princes of Israel, heads of their ancestral houses—they were tribal princes in charge over those who were numbered—gave offerings. "},{"num":3,"verse":"They brought as their gift before Adonai six covered carts and twelve oxen. A cart came from every two princes and an ox from each one of them. They presented them before the Tabernacle."},{"num":4,"verse":"Adonai spoke to Moses saying, "},{"num":5,"verse":"“Accept these from them to use in the service of the Tent of Meeting. Give them to the Levites to use as each man’s work requires.”"},{"num":6,"verse":"So Moses took the carts and the oxen and he gave them to the Levites. "},{"num":7,"verse":"He gave two carts and four oxen to the sons of Gershon, as their work required, "},{"num":8,"verse":"and four carts and eight oxen to the sons of Merari, as their work required, under the direction of Ithamar son of Aaron the kohen. "},{"num":9,"verse":"But to the sons of Kohath he did not give any because their responsibility was carrying the holy items on their shoulders."},{"num":10,"verse":"When the altar was anointed, the princes brought their dedication offerings and presented them before Adonai. "},{"num":11,"verse":"For Adonai had said to Moses, “Each day one of the princes is to bring his offering for the altar’s dedication.”"},{"num":12,"verse":"Bringing his offering on the first day was Nahshon son of Amminadab, from the tribe of Judah. "},{"num":13,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels by the shekel of the Sanctuary, both of them filled with fine flour mixed with oil as a grain offering, "},{"num":14,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":15,"verse":"one young bull from the herd, one ram, one male lamb a year old as a burnt offering, "},{"num":16,"verse":"one male goat as a sin offering, "},{"num":17,"verse":"and two oxen, five rams, five male goats and five male lambs one year old to be sacrificed as a fellowship offering. This was the offering of Nahshon son of Amminadab."},{"num":18,"verse":"On the second day, Nethanel son of Zuar, prince of Issachar, brought his offering. "},{"num":19,"verse":"The offering he brought was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":20,"verse":"one gold ladle of 10 shekels filled with incense, "},{"num":21,"verse":"one young bull, one ram and one male lamb one year old for a burnt offering, "},{"num":22,"verse":"one male goat for a sin offering, "},{"num":23,"verse":"and two oxen, five rams, five male goats and five male lambs one year old to be sacrificed as a fellowship offering. This was the offering of Nethanel son of Zuar."},{"num":24,"verse":"On the third day was the prince of the sons of Zebulun, Eliab son of Helon. "},{"num":25,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels, both according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":26,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":27,"verse":"one young bull, one ram and one male lamb a year old for a burnt offering, "},{"num":28,"verse":"one male goat for a sin offering, "},{"num":29,"verse":"two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Eliab son of Helon."},{"num":30,"verse":"On the fourth day was the prince of the sons of Reuben, Elizur son of Shedeur. "},{"num":31,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":32,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":33,"verse":"one young bull, one ram, one male lamb a year old for a burnt offering, "},{"num":34,"verse":"one male goat for a sin offering, "},{"num":35,"verse":"and two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Elizur son of Shedeur."},{"num":36,"verse":"On the fifth day was the prince of the sons of Simeon, Shelumiel son of Zurishaddai. "},{"num":37,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":38,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":39,"verse":"one young bull, one ram, one male lamb a year old for a burnt offering, "},{"num":40,"verse":"one male goat for a sin offering, "},{"num":41,"verse":"and two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Shelumiel son of Zurishaddai."},{"num":42,"verse":"On the sixth day was the prince of the sons of Gad, Eliasaph son of Deuel. "},{"num":43,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":44,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":45,"verse":"one young bull, one ram and one male lamb a year old for a burnt offering, "},{"num":46,"verse":"one male goat for a sin offering, "},{"num":47,"verse":"and two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Eliasaph son of Deuel."},{"num":48,"verse":"On the seventh day was the prince of the sons of Ephraim, Elishama son of Ammihud. "},{"num":49,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":50,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":51,"verse":"one young bull, one ram, one male lamb a year old for a burnt offering, "},{"num":52,"verse":"one male goat for a sin offering, "},{"num":53,"verse":"and two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Elishama son of Ammihud."},{"num":54,"verse":"On the eighth day was the prince of the sons of Manasseh, Gamaliel son of Pedahzur. "},{"num":55,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":56,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":57,"verse":"one young bull, one ram, one male lamb a year old for a burnt offering, "},{"num":58,"verse":"one male goat for a sin offering, "},{"num":59,"verse":"and two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Gamaliel son of Pedahzur."},{"num":60,"verse":"On the ninth day was the prince of the sons of Benjamin, Abidan son of Gideoni. "},{"num":61,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":62,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":63,"verse":"one young bull, one ram and one male lamb a year old for a burnt offering, "},{"num":64,"verse":"one male goat for a sin offering, "},{"num":65,"verse":"and two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Abidan son of Gideoni."},{"num":66,"verse":"On the tenth day came the prince of the sons of Dan, Ahiezer son of Ammishaddai. "},{"num":67,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":68,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":69,"verse":"one young bull, one ram, one male lamb a year old as a burnt offering, "},{"num":70,"verse":"one male goat for a sin offering, "},{"num":71,"verse":"and two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Ahiezer son of Ammishaddai."},{"num":72,"verse":"On the eleventh day came the prince of the sons of Asher, Pagiel son of Ochran. "},{"num":73,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":74,"verse":"one ladle of 10 shekels of gold filled with incense, "},{"num":75,"verse":"one young bull, one ram, one male lamb a year old as a burnt offering, "},{"num":76,"verse":"one male goat for a sin offering, "},{"num":77,"verse":"and two oxen, five rams, five male goats and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Pagiel son of Ochran."},{"num":78,"verse":"On the twelfth day came the prince of the sons of Naphtali, Ahira son of Enan. "},{"num":79,"verse":"His offering was one silver plate weighing 130 shekels, one silver basin weighing 70 shekels, according to the shekel of the Sanctuary, both filled with fine flour mixed with oil for a grain offering, "},{"num":80,"verse":"one ladle of 10 shekels of gold, filled with incense, "},{"num":81,"verse":"one young bull, one ram, one male lamb a year old for a burnt offering, "},{"num":82,"verse":"one male goat for a sin offering, "},{"num":83,"verse":"and two young bulls, five rams, five male goats, and five male lambs a year old to be sacrificed as a fellowship offering. This was the offering of Ahira son of Enan."},{"num":84,"verse":"This was the dedication offering from the princes of Israel for the day when the altar was to be anointed: twelve silver plates, twelve silver basins, twelve gold ladles. "},{"num":85,"verse":"Each silver plate was of 130 shekels, and each silver basin was of 70 shekels. Altogether, the silver utensils weighed 2,400 shekels according to the shekel of the Sanctuary."},{"num":86,"verse":"The ten gold ladles filled with incense each weighed 10 shekels, by the shekel of the Sanctuary. Altogether, the gold ladles totaled 120 shekels."},{"num":87,"verse":"The total of the livestock for the burnt offering was twelve young bulls, twelve rams, and twelve male lambs a year old, along with their grain offering. Twelve male goats were sin offerings. "},{"num":88,"verse":"The total number of livestock used for sacrifice of fellowship offerings was 24 oxen, 60 rams, 60 male goats and 60 male lambs a year old. These were the dedicatory offerings for the altar after it was anointed."},{"num":89,"verse":"When Moses entered the Tent of Meeting to speak with Adonai, he heard the voice speaking to him from above the atonement cover atop the Ark of Testimony between the cheruvim. So he spoke with Him."}]