[[],[{"type":"header","content":"Jehu Rebukes Jehoshaphat"},{"type":"prose","content":"Jehoshaphat the king of Judah returned safely to his house (palace) in Jerusalem. "}],[{"type":"prose","content":"Jehu the son of Hanani the seer went out to meet him and said to King Jehoshaphat, “Should you help the ungodly and love those who hate the LORD and in doing so  wrath from the LORD on yourself? "}],[{"type":"prose","content":"But there are  good things found in you, for you have removed the Asherim (idols) from the land and you have set your heart to seek God [with all your soul’s desire].”"}],[{"type":"prose","content":"So Jehoshaphat lived in Jerusalem, and he went out again among the people from Beersheba to the hill country of Ephraim and brought them back to the LORD, the God of their fathers."}],[{"type":"header","content":"Reforms Instituted"},{"type":"prose","content":"He appointed judges in the land in all the fortified cities of Judah, city by city, "}],[{"type":"prose","content":"and he said to the judges, “Be careful what you do, for you do not judge for man, but for the LORD who is with you in the matter of judgment. "}],[{"type":"prose","content":"So now let the fear (reverent awe) of the LORD be on you [to keep you from making unjust decisions]; be careful in what you do, for there is no injustice with the LORD our God, or partiality, or acceptance of a bribe.”"}],[{"type":"prose","content":"In Jerusalem also Jehoshaphat appointed some of the Levites, priests, and heads of the fathers’  of Israel to  the judgment of the LORD and to judge disputes among the inhabitants of Jerusalem. "}],[{"type":"prose","content":"Then the king commanded them, “Do this in the fear of the LORD, faithfully and wholeheartedly. "}],[{"type":"prose","content":"Whenever any dispute comes to you from your brothers (relatives) who live in their cities, between blood and blood, between law and commandment, or between statutes and judgments, you are to warn [and instruct] them so that they may not be guilty before the LORD; otherwise [God’s] wrath will come on you and your brothers. Do this and you will not be guilty. "}],[{"type":"prose","content":"Behold, Amariah the chief priest will be over you in all matters of the LORD, and Zebadiah the son of Ishmael, the governor of the house of Judah, in all the king’s matters; and the Levites will serve you as officers. Deal courageously, and may the LORD be with the upright.”"}]]