[{"num":19,"verse":"But Jehoshaphat king of Judah returned to his palace in Jerusalem in peace. "},{"num":2,"verse":"And Jehu the son of Hanani the seer went out to meet him, and he said to King Jehoshaphat, “How do you help those who are wicked and love those who hate the Lord? Because of this, wrath has gone out against you from the Lord. "},{"num":3,"verse":"However, some good things are found in you for you swept away the Asherah poles from the land, and you set your heart to seek after God.”"},{"header":"The Reforms of Jehoshaphat"},{"num":4,"verse":"Jehoshaphat lived in Jerusalem, but he went out among the people from Beersheba to the hill country of Ephraim, and he brought them back to the Lord God of their fathers. "},{"num":5,"verse":"And he set judges in the land among all the fortified cities of Judah, one by one. "},{"num":6,"verse":"And he said to the judges, “Consider carefully what you do because you do not judge according to man but the Lord, and He is with you in the matter of judgment. "},{"num":7,"verse":"So now may the fear of the Lord be on you. Consider and act well because there is no injustice, partiality, or bribe taking with the Lord our God.”"},{"num":8,"verse":"Moreover, Jehoshaphat appointed in Jerusalem some from the Levites and the priests and some from the heads of the families of Israel, in order to render judgment and decide disputes before the Lord; and they lived in Jerusalem. "},{"num":9,"verse":"And he commanded them, “So you will act in the fear of the Lord, in honesty, and with a complete heart. "},{"num":10,"verse":"And any dispute that comes before you all from your brothers who live in their cities, concerning bloodshed or offenses against law or commandment, against statutes or judgments, you will warn them, lest they trespass against the Lord and wrath come upon you and your brothers. Do this, and you will not trespass."},{"num":11,"verse":"“Note that Amariah the chief priest is over you in all matters of the Lord; and Zebadiah the son of Ishmael, the ruler of the house of Judah, for all the king’s matters; also, the Levites will be officials before you. Deal courageously, and the Lord will be with the good.”"}]