[{"header":"Times of Trouble Are Coming"},{"num":16,"verse":"A message from the Lord came to me. He said, "},{"num":2,"verse":"“Jeremiah, you must not get married. You must not have any sons or daughters in this land.” "},{"num":3,"verse":"Here is the Lord’s message about the children born in this place. He says about them and their parents, "},{"num":4,"verse":"“Some of them will die of deadly sicknesses. No one will mourn for them. Their bodies will not be buried. Instead, they will be like human waste lying there on the ground. Others will die because of war and hunger. Their bodies will not be buried. Instead, they will become food for the birds and the wild animals.”"},{"num":5,"verse":"The Lord says, “Jeremiah, suppose a meal is being served because someone has died. Do not enter any house where that is happening. Do not go there to mourn or to comfort the family. I will not bless these people anymore. I have taken my love and pity away from them,” announces the Lord. "},{"num":6,"verse":"“Important and unimportant people alike will die in this land. Their bodies will not be buried. No one will mourn for them. No one will cut themselves or shave their head for the dead. "},{"num":7,"verse":"No one will offer food or drink to comfort those who mourn for the dead. No one will do this even if someone’s father or mother has died."},{"num":8,"verse":"“Do not enter a house where a feast is being held. Do not sit down there to eat and drink. "},{"num":9,"verse":"I am the Lord who rules over all. I am the God of Israel. I am telling you, ‘In your days I will judge your people. You will see it with your own eyes. I will put an end to the sounds of joy and gladness here in Jerusalem. The voices of brides and grooms will not be heard anymore.’"},{"num":10,"verse":"“Tell these people all these things. They will ask you, ‘Why has the Lord decided to send so much trouble on us? We haven’t done anything wrong. We haven’t committed any sins against the Lord our God.’ "},{"num":11,"verse":"When they say this, here is what you should tell them. ‘I did it because your people of long ago deserted me,’ announces the Lord. ‘They followed other gods. They served them and worshiped them. They deserted me. They did not obey my law. "},{"num":12,"verse":"But you have done more evil things than they did. All of you are doing what your stubborn and evil hearts want you to do. You are not obeying me. "},{"num":13,"verse":"So I will throw you out of this land. I will send you away to another land. Neither you nor your people of long ago have known about it. There you will serve other gods day and night. And I will not give you any help.’"},{"num":14,"verse":"“But a new day is coming,” announces the Lord. “At that time here is what people will no longer say. ‘As sure as he is alive, the Lord brought the Israelites up out of Egypt.’ "},{"num":15,"verse":"Instead, they will say, ‘The Lord brought the Israelites up out of the land of the north. He gathered them out of all the countries where he had forced them to go. And that’s just as sure as he is alive.’ I will bring them back to the land I gave their people of long ago."},{"num":16,"verse":"“But now I will send for many fishermen,” announces the Lord. “They will catch some of these people. After that, I will send for many hunters. They will hunt down the others on every mountain and hill. They will bring them out of the cracks in the rocks. "},{"num":17,"verse":"My eyes see everything these people do. What they do is not hidden from me. I always see their sin. "},{"num":18,"verse":"I will pay them back double for their sin and the evil things they have done. They have made my land ‘unclean.’ They have set up lifeless statues of their evil gods. They have filled my land with them. I hate those gods.”"}]