[{"num":16,"verse":"On yet another occasion God spoke to me, and said:"},{"num":2,"verse":"You must not marry and have children here. "},{"num":3,"verse":"For the children born in this city and their mothers and fathers "},{"num":4,"verse":"shall die from terrible diseases. No one shall mourn for them or bury them, but their bodies shall lie on the ground to rot and fertilize the soil. They shall die from war and famine, and their bodies shall be picked apart by vultures and wild animals. "},{"num":5,"verse":"Do not mourn or weep for them, for I have removed my protection and my peace from them—taken away my loving-kindness and my mercies. "},{"num":6,"verse":"Both great and small shall die in this land, unburied and unmourned, and their friends shall not cut themselves nor shave their heads as signs of sorrow (as is their heathen custom). "},{"num":7,"verse":"No one shall comfort the mourners with a meal nor send them a cup of wine expressing grief for their parents’ death."},{"num":8,"verse":"As a sign to them of these sad days ahead, don’t you join them anymore in their feasts and parties—don’t even eat a meal with them. "},{"num":9,"verse":"For the Lord Almighty, the God of Israel, says: In your own lifetime, before your very eyes, I will end all laughter in this land—the happy songs, the marriage feasts, the songs of bridegrooms and of brides."},{"num":10,"verse":"And when you tell the people all these things and they ask, “Why has the Lord decreed such terrible things against us? What have we done to merit such treatment? What is our sin against the Lord our God?” "},{"num":11,"verse":"tell them the Lord’s reply is this: Because your fathers forsook me. They worshiped other gods and served them; they did not keep my laws, "},{"num":12,"verse":"and you have been worse than your fathers were! You follow evil to your hearts’ content and refuse to listen to me. "},{"num":13,"verse":"Therefore, I will throw you out of this land and chase you into a foreign land where neither you nor your fathers have been before, and there you can go ahead and worship your idols all you like—and I will grant you no favors!"},{"num":14,"verse":"But there will come a glorious day, says the Lord, when the whole topic of conversation will be that God is bringing his people home from a nation in the north, and from many other lands where he had scattered them. You will look back no longer to the time when I rescued you from your slavery in Egypt. That mighty miracle will scarcely be mentioned anymore. Yes, I will bring you back again, says the Lord, to this same land I gave your fathers."},{"num":16,"verse":"Now I am sending for many fishermen to fish you from the deeps where you are hiding from my wrath. I am sending for hunters to chase you down like deer in the forests or mountain goats on inaccessible crags. Wherever you run to escape my judgment, I will find you and punish you. "},{"num":17,"verse":"For I am closely watching you, and I see every sin. You cannot hope to hide from me."},{"num":18,"verse":"And I will punish you doubly for all your sins because you have defiled my land with your detestable idols and filled it up with all your evil deeds."},{"num":19,"verse":"O Lord, my Strength and Fortress, my Refuge in the day of trouble, nations from around the world will come to you saying, “Our fathers have been foolish, for they have worshiped worthless idols! "},{"num":20,"verse":"Can men make God? The gods they made are not real gods at all.”"},{"num":21,"verse":"And when they come in that spirit, I will show them my power and might and make them understand at last that I alone am God."}]