[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then went king David in, and sat.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As always at every important point in his life, David’s first care is to take that which he has in his mind before the Lord. The place to which he went must be the tent he had pitched for the ark. Here he sat to meditate in God’s presence upon the communication which had now been made to him, and then to offer his thanksgiving (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 7:18-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), praise (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 7:22-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and prayer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 7:25-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Divine Name is here printed with the word GOD in small capitals. This is always done in the Authorised Version wherever it stands for JEHOVAH in the original. The same custom is also followed with the word LORD. Out of reverence for the name, Jehovah never has its own vowels in Hebrew, but is printed with those belonging to Lord, or in case this word also is used, then with those belonging to God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Divine Name is here printed with the word GOD in small capitals. This is always done in the Authorised Version wherever it stands for JEHOVAH in the original. The same custom is also followed with the word LORD. Out of reverence for the name, Jehovah never has its own vowels in Hebrew, but is printed with those belonging to ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or in case this word also is used, then with those belonging to ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2 Samuel",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "DAVID’S GRATITUDE2 Samuel 7:18 - 2 Samuel 7:29",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "DAVID’S GRATITUDE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " God’s promise by Nathan of the perpetuity of the kingdom in David’s house made an era in the progress of revelation. A new element was thereby added to devout hope, and a new object presented to faith. The prophecy of the Messiah entered upon a new stage, bearing a relation, as its successive stages always did, to the history which supplies a framework for it. Now, for the first time, He can be set forth as the king of Israel; now the width of the promise, which at first embraced the seed of the woman, and then was limited to the seed of Abraham, and thereafter to the tribe of Judah, is still further limited to the house of David. The beam is narrowed as it is focussed into greater brilliance, and the personal Messiah begins to be faintly discerned in words which are to have a partial, preparatory fulfilment, in itself prophetic, in the collective Davidic monarchs whose office is itself a prophecy. This passage is the wonderful burst of praise which sprang from David’s heart in answer to Nathan’s words. In many of the Psalms later than this prophecy we find clear traces of that expectation of the personal Messiah, which gradually shaped itself, under divine inspiration, in David, as contained in Nathan’s message But this thanksgiving prayer, which was the immediate reflection of the astounding new message, has not yet penetrated its depth nor discovered its rich contents, but sees in it only the promise of the continuance of kingship in his descendants. We do not learn the fulness of God’s gracious promises on first hearing them. Life and experience and the teaching of His Spirit are needed to enable us to count our treasure, and we are richer than we know.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This prayer is a prose psalm outside the Psalter. It consists of two parts,-a burst of astonished thanksgiving and a stream of earnest petition, grasping the divine promise and turning it into a prayer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Note the burst of thanksgiving {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. The ark dwelt ‘in curtains,’ and into the temporary sanctuary went the king with his full heart. The somewhat peculiar attitude of sitting, while he poured it out to God, has offended some punctilious commentators, who will have it that we should translate ‘remained,’ and not ‘sat’; but there is no need for the change. The decencies of public worship may require a posture which expresses devotion; but individual communion is free from such externals, and absorbed contemplation naturally disposes of the body so as least to hinder the spirit. The tone of almost bewildered surprise at the greatness of the gift is strong all through the prayer. The man’s breath is almost taken away, and his words are sometimes broken, and throughout palpitating with emotion. Yet there is a plain progress of feeling and thought in them, and they may serve as a pattern of thanksgiving. Note the abrupt beginning, as if pent-up feeling forced its way, regardless of forms of devotion. The first emotion excited by God’s great goodness is the sense of unworthiness. ‘I do not deserve it,’ is the instinctive answer of the heart to any lavish human kindness, and how much more to God’s! ‘I am not worthy of the least of all the mercies,’ springs to the devout lips most swiftly, when gazing on His miracles of bestowing love. He must know little of himself, and less of God, who is not most surely melted down to contrition, which has no bitterness or pain in it, by the coals of loving fire heaped by God on his head.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The consciousness of unworthiness passes, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to adoring contemplation of God’s astounding mercy, and especially of the new element in Nathan’s prophecy,-the perpetuity of the Davidic sovereignty in the dim, far-off future. Thankfulness delights to praise the Giver for the greatness of His gift. Faith strengthens its hold of its blessings by telling them over, as a miser does his treasure. To recount them to God is the way to possess them more fully.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The difficult close of the verse cannot be discussed here. ‘The law for man’ is nearer the literal meaning of the words than ‘the manner of men’ {Rev. Ver.}; and, unfortunately, man’s manner is not the same as man’s law. But the usual explanations are unsatisfactory. We would hazard the suggestion that ‘this’ means that which God has spoken ‘of thy servant’s house,’ and that to call it ‘the law for man’ is equivalent to an expression of absolute confidence in the authority, universality, and certain fulfilment of the promise. The speech of God is ever the law for man, and this new utterance stands on a level with the older law, and shall rule all mankind. The king’s faith not only gazes on the great words of promise, but sees them triumphant on earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " comes another bend of the stream of praise. The more full the heart, the more is it conscious of the weakness of all words. The deepest praise, like the truest love, speaks best in silence. It is blessed when, in earthly relations, we can trust our dear ones’ knowledge of us to interpret our poor words. It is more blessed when, in our speech to God, we can feel that our love and faith are deeper than our word, and that He does not judge them by it, but it by them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Silence is His least injurious praise.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Silence is His least injurious praise.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Here, too, we may note the two instances, in this verse, of what runs through the whole prayer,-David’s avoidance of using ‘I.’ Except in the lowly ‘What am I?’ at the beginning, it never occurs; but he calls himself ‘David’ twice and ‘Thy servant’ ten times,-a striking, because unconscious, proof of his lowly sense of unworthiness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But he can say more; and what he does further say goes yet deeper than his former words. The personal aspect of the promise retreats into the background, and the ground of all God’s mercy in His ‘own heart’ fills the thoughts. Some previous promise, perhaps that through Samuel, is referred to; but the great truth that God is His own motive, and that His love is not drawn forth by our deserts, but wells up by its own energy, like a perennial fountain, is the main thought of the verse. God is self-moved to bless, and He blesses that we may know Him through His gifts. The one thought is the central truth, level to our apprehension, concerning His nature; the other is the key to the meaning of all His workings. All comes to pass because He loves with a self-originated love, and in order that we may know the motive and principle of His acts. We can get no farther into the secret of God than that. We need nothing more for peaceful acceptance of His providences for ourselves and our brethren. All is from love; all is for the manifestation of love. He who has learned these truths sits at the centre and lives in light.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " strikes a new note. The effect of God’s dealing with David is to magnify His name, to teach His incomparable greatness, and to confirm by experience ancient words which celebrate it. The thankful heart rejoices in hearsay being changed into personal knowledge. ‘As we have heard, so have we seen.’ Old truths flash up into new meaning, and only he who tastes and sees that God is good to him to-day really enters into the sweetness of His recorded past goodness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Note the widening of David’s horizon in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to embrace all Israel. His blessings are theirs. He feels his own relation to them as the culmination of the long series of past deliverances, and at the same time loses self in joy over Israel’s confirmation as God’s people by his kingship. True thankfulness regards personal blessings in their bearing on others, and shrinks from selfish use of them. Note, too, the parallel, if we may call it so, between Israel and Israel’s God, in that ‘there is none like Thee,’ and by reason of its choice by this incomparable Jehovah, no nation on earth is like ‘Thy people, even like Israel.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus steadily does this model of thanksgiving climb up from a sense of unworthiness, through adoration and gazing on its treasures, to God’s unmotived love as His impulse, and men’s knowledge of that love as His aim, and pauses at last, rapt and hushed, before the solitary loftiness of the incomparable God, and the mystery of the love, which has intertwined the personal blessings which it celebrates, with its great designs for the welfare of the people, whose unique position corresponds to the unapproachable elevation of its God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. 2 Samuel 7:25 - 2 Samuel 7:29",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " are prayer built on promise and winged by thankfulness. The whole of these verses are but the expansion of ‘do as Thou hast said.’ But they are not vain repetitions. Rather they are the outpourings of wondering thankfulness and faith, that cannot turn away from dwelling on the miracle of mercy revealed to it unworthy. God delights in the sweet monotony and persistence of such reiterated prayers, each of which represents a fresh throb of desire and a renewed bliss in thinking of His goodness. Observe the frequency and variety of the divine names in these verses,-in each, one, at least: Jehovah God {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}; Jehovah of hosts {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}; Jehovah of hosts, God of Israel {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}; Lord Jehovah {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. Strong love delights to speak the beloved name. Each fresh utterance of it is a fresh appeal to His revealed nature, and betokens another wave of blessedness passing over David’s spirit as he thinks of God. Observe, also, the other repetition of ‘Thy servant,’ which occurs in every verse, and twice in two of them. The king is never tired of realising his absolute subjection, and feels that it is dignity, and a blessed bond with God, that he should be His servant. The true purpose of honour and office bestowed by God is the service of God, and the name of ‘servant’ is a plea with Him which He cannot but regard. Observe, too, how echoes of the promise ring all through these verses, especially the phrases ‘establish the house’ and ‘for ever.’ They show how profoundly David had been moved, and how he is labouring, as it were, to make himself familiar with the astonishing vista that has begun to open before his believing eyes. Well is it for us if we, in like manner, seek to fix our thoughts on the yet grander ‘for ever’ disclosed to us, and if it colours all our look ahead, and makes the refrain of all our hopes and prayers.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the main lesson of the prayer is that God’s promise should ever be the basis and measure of prayer. The mould into which our petitions should run is, ‘Do as Thou hast said.’ Because God’s promise had come to David, ‘therefore hath Thy servant found in his heart to pray this prayer unto Thee.’ There is no presumption in taking God at His word. True prayer catches up the promises that have fallen from heaven, and sends them back again, as feathers to the arrows of its petitions. Nor does the promise make the prayer needless. We know that ‘if we ask anything according to His will, He heareth us’; and we know that we shall not receive the promised blessings, which are according to His will, unless we do ask. Let us seek to stretch our desires to the width of God’s promises, and to confine our wishes within their bounds.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 7:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then went King David in — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Into the tabernacle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And sat before the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, before the ark, the symbol of the divine presence, and where God was then peculiarly present, and was believed by David to be so. David probably ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sat ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for a season, while he meditated on these things, and then altered his posture and betook himself to prayer. It must be observed, however, that the Hebrew word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ישׁב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jashab, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sat, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "may with equal propriety be translated, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "remained ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "before the Lord. The Hebrews never addressed prayers or praises to God but either standing up or prostrate on the earth, and even their kings are always described as standing when they prayed or gave thanks in the temple. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 46:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 11:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 23:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nor is there any other posture of worship mentioned in Scripture, but standing, or kneeling, or falling on the face. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who am I, O Lord God? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "How infinitely unworthy am I and my family of this great honour and happiness! Thus David begins his address to God in a becoming spirit of humility and self-abasement, acknowledging his utter unworthiness of the blessings which God had already bestowed on him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:18-29 David's prayer is full of the breathings of devout affection toward God. He had low thoughts of his own merits. All we have, must be looked upon as Divine gifts. He speaks very highly and honourably of the Lord's favours to him. Considering what the character and condition of man is, we may be amazed that God should deal with him as he does. The promise of Christ includes all; if the Lord God be ours, what more can we ask, or think of? Eph 3:20. He knows us better than we know ourselves; therefore let us be satisfied with what he has done for us. What can we say more for ourselves in our prayers, than God has said for us in his promises? David ascribes all to the free grace of God. Both the great things He had done for him, and the great things He had made known to him. All was for his word's sake, that is, for the sake of Christ the eternal Word. Many, when they go to pray, have their hearts to seek, but David's heart was found, that is, it was fixed; gathered in from its wanderings, entirely engaged to the duty, and employed in it. That prayer which is from the tongue only, will not please God; it must be found in the heart; that must be lifted up and poured out before God. He builds his faith, and hopes to speed, upon the sureness of God's promise. David prays for the performance of the promise. With God, saying and doing are not two things, as they often are with men; God will do as he hath said. The promises of God are not made to us by name, as to David, but they belong to all who believe in Jesus Christ, and plead them in his name.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Sat before the Lord - In the tent where the ark was. Standing or kneeling was the usual attitude of prayer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:54-55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Modern commentators mostly take the word here in the sense of waiting, abiding, not sitting: but sat is the natural rendering. David sat down to meditate, and then rose up to pray. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2Sa 7:18-29. David's Prayer and Thanksgiving.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18. Then went king David in, and sat before the Lord—Sitting was anciently an attitude for worship (Ex 17:12; 1Sa 4:13; 1Ki 19:4). As to the particular attitude David sat, most probably, upon his heels. It was the posture of the ancient Egyptians before the shrines; it is the posture of deepest respect before a superior in the East. Persons of highest dignity sit thus when they do sit in the presence of kings and it is the only sitting attitude assumed by the modern Mohammedans in their places and rites of devotion.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sat:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this word may note either, first, His bodily posture, for there is no certain gesture to which prayer is limited and we have examples of saints praying in that posture, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 17:12 1 Kings 19:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 19:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; or he might sit for a season whilst he was meditating upon these things, and then alter his posture, (though it be not here expressed,) and betake himself to prayer. Or rather, secondly, His continuance, as this Hebrew word is oft used, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 22:11 Leviticus 14:8 1 Samuel 1:22 20:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 14:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 1:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 20:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that he did not barely present himself before God but abode there for some competent time, that he might with God’s leave pour out his soul freely before him. For howsoever one may in some cases pray sitting, yet it is most probable that David would in this holy place, and upon this occasion, use a more humble and reverent gesture, such as kneeling is, which therefore David prescribeth or adviseth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 95:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 95:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and Solomon accordingly practiseth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Kings 8:54 2 Chronicles 6:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:54",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 6:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who am I, and what is my house, that thou hast brought me hitherto?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " how indefinitely unworthy am I and my family of this great honour and happiness! ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then went King David in,.... Into the tabernacle where the ark was, which he had prepared for it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and sat before the Lord; before the ark, the symbol of his presence, and prayed, and gave thanks, as follows: from whence it appears that a sitting posture was sometimes used in prayer, of which we have other instances, Exodus 17:11. It is said (y) that Pythagoras, and also Numa, ordered that worshippers should sit. So that this act of devotion is not to be limited to any particular posture, though it seems most agreeable either to stand or kneel; and the Jews look upon this to be a peculiar case, and infer from hence that none were allowed to sit in the court but the kings of the house of Judah (z); and some of them (a) will not allow that to them, since the seraphim above are even said to stand, Isaiah 6:2; and suppose the meaning of this to be only that David supported himself in the court; and some render the words, \"he remained before the Lord\" (b); he continued in meditation, prayer, and thanksgiving, and such like acts of devotion, for a considerable time; so the Targum, in 1 Chronicles 17:16.\"King David came and continued in prayer before the Lord:\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and sat before the Lord; before the ark, the symbol of his presence, and prayed, and gave thanks, as follows: from whence it appears that a sitting posture was sometimes used in prayer, of which we have other instances, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is said (y) that Pythagoras, and also Numa, ordered that worshippers should sit. So that this act of devotion is not to be limited to any particular posture, though it seems most agreeable either to stand or kneel; and the Jews look upon this to be a peculiar case, and infer from hence that none were allowed to sit in the court but the kings of the house of Judah (z); and some of them (a) will not allow that to them, since the seraphim above are even said to stand, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and suppose the meaning of this to be only that David supported himself in the court; and some render the words, \"he remained before the Lord\" (b); he continued in meditation, prayer, and thanksgiving, and such like acts of devotion, for a considerable time; so the Targum, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 17:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".\"King David came and continued in prayer before the Lord:\" ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and he said, who am I, O Lord God? a creature, a sinful creature, a mean and unworthy one, undeserving of a place in the house of God, and of access unto him, and to receive any favour from him, less than the least of all saints, less than the least of all mercies: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and what is my house: or family of which he was, the family of Jesse; for though it sprung from a prince in Israel, yet was but low and mean, in comparison of some others, and especially unworthy of the regard of the great God: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou hast brought me hitherto? to such grandeur and dignity, as to be king over all Israel and Judah, to have all his enemies subdued under him, and to be at peace and rest from them, and established in his kingdom; and which he signifies the Lord alone had brought him to, through many difficulties and tribulations, and which he could never have attained unto by his own wisdom and power, nor by the assistance of his friends; it was all the Lord's doing, and wondrous in his eyes. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) Vid. D. Herbert. de Cherbury de Relig. Gent. c. 7. p. 65. (z) T. Bab. Yoma, fol. 69. 2. Maimon & Bartenor. in Misn. Yoma, c. 7. sect. 1.((a) Midrash in Abarbinel in loc. (b) \"et mansit\", Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) Vid. D. Herbert. de Cherbury de Relig. Gent. c. 7. p. 65. (z) T. Bab. Yoma, fol. 69. 2. Maimon & Bartenor. in Misn. Yoma, c. 7. sect. 1.((a) Midrash in Abarbinel in loc. (b) \"et mansit\", Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then went king David in, and sat before the LORD, and he said, Who am I, O Lord GOD? and what is my house, that thou hast brought me hitherto?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then went king David in, and sat before the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Lord] In the tent where the Ark, the symbol of God’s presence, was. As sitting does not seem to have been a customary posture for prayer, some commentators render ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tarried",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Others suppose that David sat to meditate, and afterwards stood up to pray.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " am ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Cp. Jacob’s language in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Lord God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Whenever God is thus printed in small capitals, it represents the sacred name Jehovah. From very ancient times the Jewish practice in reading the Scriptures has been to substitute in place of Jehovah ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Adônai",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or if the title Adônai is joined with Jehovah, as here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Elôhîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The E. V. follows the Jewish practice in giving Lord and God, and whenever they represent the name Jehovah indicates the fact by the use of capitals. “Lord God,” which represents “my Lord Jehovah,” must therefore be distinguished from “Lord God” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Samuel 7:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), which represents “Jehovah Elohim,” i.e. “Jehovah God.” See Additional Note II. on 1 Samuel, p. 236.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The appropriateness of this address “my Lord Jehovah” in David’s thanksgiving must be carefully noted. It is not merely an acknowledgment of the Divine sovereignty in general, but expresses the consciousness of belonging specially to God, and standing under His immediate guidance and protection. See Oehler’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Theology of the Old Testament",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", I. 148. It is the correlative of the title “my servant” with which God distinguishes David. It calls to mind St Paul’s words “the God whose I am, whom also I serve” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 27:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Compare Abram’s use of it in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Moses’ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When he turns to praise God for his dealings with Israel in general, David uses the ordinary title ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jehovah Elôhîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Samuel 7:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), and retains it in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Samuel 7:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " at the beginning of his petition, as if to identify the covenant God of Israel with the God to whom he makes his prayer: but in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Samuel 7:28-29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:28-29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " he returns to the more familiar address of confident trust “my Lord Jehovah.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "18–29. David’s prayer and thanksgiving",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "David’s address to God consists of (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") humble thanksgiving for the undeserved favour shewn to him and his house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Samuel 7:18-21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:18-21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") praise for God’s past manifestations of his glory in and to Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Samuel 7:22-24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:22-24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") petition for the final fulfilment of the promise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Samuel 7:25-29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:25-29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "David...  sat before the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word \"sat\" is usually explained by commentators as meaning \"tarried.\" The rabbins give the word its ordinary meaning, and say that it was the privilege of kings to pray in a sitting posture. But we cannot possibly believe that kings at this early stage had established a special etiquette for observance in prayer, and the difficulty is  merely imaginary. Because the Jews prayed standing, and we moderns pray kneeling, we both assume that to pray sitting was an irreverent act. It was not so, nor are we to think of David as sitting at ease in a chair. He sat upon the ground, as was the Oriental custom, with his feet doubled under him, and his head bent forward; and in this posture meditated upon Jehovah's message, and then poured out his thoughts. As it is expressly said that \"he sat before Jehovah,\" the place must have been the outer court of the tabernacle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who am I, O Lord Jehovah!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In the Authorized Version ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is rendered \"God,\" because it has the vowels of the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Elohim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; usually it is rendered \"Lord,\" because the Masserites attached to it the vowels of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Adonai",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"lord,\" equivalent to ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Dominus.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Adonai",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here precedes ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Massorites were driven from their usual practice, and were so superstitious as to suppose it more reverent to pronounce the name ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Elohim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " than that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to which the Jews attached magical powers. David's words are not so much a prayer as a meditation, full of thanksgiving, and even of wonder at the greatness of God's mercies to him. In it he first acknowledges his own unworthiness and the meanness of his father's house compared with the high dignity which God is bestowing upon him. For not only has he raised him to the kingly office, but promised him the continuance of his house \"for a great while to come.\" Whether David understood as yet that he was now placed in the same position as Abraham of old, in that \"in his seed all the families of the earth should be blessed,\" is uncertain, and depends upon the interpretation put upon the following words. This only we may affirm, that whet he says in this place of his house remaining until a distant future falls far short of the meaning of the passages quoted above from the Psalms. 2 Samuel 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "David's prayer and thanksgiving. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". King David came, i.e., went into the sanctuary erected upon Zion, and remained before Jehovah. ישׁב, remained, tarried (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), not \"sat;\" for the custom of sitting before the Lord in the sanctuary, as the posture assumed in prayer, cannot be deduced from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Moses is compelled to sit from simple exhaustion. David's prayer consists of two parts - thanksgiving for the promise (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:18-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and supplication for its fulfilment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:25-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The thanksgiving consists of a confession of unworthiness of all the great things that the Lord had hitherto done for him, and which He had still further increased by this glorious promise (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:18-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and praise to the Lord that all this had been done in proof of His true Deity, and to glorify His name upon His chosen people Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Samuel 7:18. \"Who am I, O Lord Jehovah? and who my house (i.e., my family), that Thou hast brought me hitherto?\" These words recall Jacob's prayer in Genesis 32:10, \"I am not worthy of the least of all the mercies,\" etc. David acknowledged himself to be unworthy of the great mercy which the Lord had displayed towards him, that he might give the glory to God alone (vid., Psalm 8:5 and Psalm 144:3).",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Who am I, O Lord Jehovah? and who my house (i.e., my family), that Thou hast brought me hitherto?\" These words recall Jacob's prayer in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"I am not worthy of the least of all the mercies,\" etc. David acknowledged himself to be unworthy of the great mercy which the Lord had displayed towards him, that he might give the glory to God alone (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 8:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 144:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      }
    ]
  }
]