[{"header":"Saul Is Chosen to Be the King"},{"num":9,"verse":"There was a man of Benjamin whose name was Kish the son of Abiel, the son of Zeror, the son of Becorath, the son of Aphiah, a Benjamite. He was a powerful man of action. "},{"num":2,"verse":"He had a son whose name was Saul, a good-looking young man. There was not a man among the people of Israel who was better looking than he. He was a head taller than any of the people. "},{"num":3,"verse":"Now the donkeys of Saul’s father Kish were lost. So Kish said to his son Saul, “Take one of the servants and go look for the donkeys.” "},{"num":4,"verse":"They passed through the hill country of Ephraim and the land of Shalishah, but they did not find them. They passed through the land of Shaalim, but they were not there. Then they passed through the land of the Benjamites, but they did not find them."},{"num":5,"verse":"When they came to the land of Zuph, Saul said to his servant who was with him, “Come, let us return. My father might stop worrying about the donkeys and start worrying about us.” "},{"num":6,"verse":"The servant said, “See, there is a man of God in this city, and people honor him. All that he says comes true. Let us go there. It may be that he can tell us where we should go.” "},{"num":7,"verse":"Then Saul said to his servant, “But if we go, what can we bring the man? The bread in our bags is gone. There is no gift to bring to the man of God. What do we have?” "},{"num":8,"verse":"The servant answered Saul and said, “See, I have a fourth of a piece of silver in my hand. I will give it to the man of God and he will tell us the way to go.” "},{"num":9,"verse":"(Before in Israel, when a man went to ask God a question, he would say, “Come, let us go to the man of God.” For he who is called a man who speaks for God now, was called a seer before.) "},{"num":10,"verse":"Saul said to his servant, “What you said is good. Come, let us go.” So they went to the city where the man of God was."},{"num":11,"verse":"As they went up the hill to the city, they met young women going out to get water. They said to them, “Is the man of God here?” "},{"num":12,"verse":"The women answered, “He is. Look, he is up in front of you. Hurry now, for he has come to the city today because the people are giving a gift in worship on the high place today. "},{"num":13,"verse":"You will find him as you go into the city, before he goes up to the high place to eat. The people will not eat until he comes to give thanks for the gift. Then those who are asked to come will eat. Now go up, for you will find him at once.” "},{"num":14,"verse":"So they went up to the city. As they came into the city, they saw Samuel coming out toward them to go up to the high place."},{"num":15,"verse":"Now the day before Saul came, the Lord had told Samuel, "},{"num":16,"verse":"“I will send you a man from the land of Benjamin about this time tomorrow. Choose him to be the leader of My people Israel. And he will save My people from the Philistines. For I have seen the trouble of My people. I have heard their cry. "},{"num":17,"verse":"When Samuel saw Saul, the Lord said to him, “Here is the man I told you about. He is the one who will rule over My people.” "},{"num":18,"verse":"Then Saul came to Samuel in the gate, and said, “Tell me, where is the man of God’s house?” "},{"num":19,"verse":"Samuel answered Saul and said, “I am the man of God. Go up before me to the high place. For you will eat with me today, and tomorrow I will let you go. And I will tell you all that is on your mind. "},{"num":20,"verse":"Do not worry about your donkeys which were lost three days ago, for they have been found. And for whom is all the desire of Israel? Is it not for you and for all your father’s house?” "},{"num":21,"verse":"Saul answered, “Am I not a Benjamite, from the smallest of the family groups of Israel? Is not my family the least important of all the families of Benjamin? Why then do you speak to me this way?”"},{"num":22,"verse":"Then Samuel took Saul and his servant and brought them into the meeting room. He gave them a place at the head of those who were asked to come, about thirty men. "},{"num":23,"verse":"Samuel said to the one who was making the food ready, “Bring the part I gave you and told you to set aside.” "},{"num":24,"verse":"So the man picked up the leg with what was on it and set it in front of Saul. And Samuel said, “Here is what has been saved for you. Eat. It has been kept for you until the right time, ever since I asked the people to come.” So Saul ate with Samuel that day."},{"num":25,"verse":"When they came down from the high place into the city, Samuel spoke with Saul on the roof. "},{"num":26,"verse":"They got up early the next day. Samuel called to Saul on the roof, saying, “Get up, that I may send you on your way.” So Saul got up, and both he and Samuel went out into the street."},{"header":"Saul Is Made King"},{"num":27,"verse":"As they were going out of the city, Samuel said to Saul, “Tell the servant to go on before us, but you stand here. Then I will make the Word of God known to you.”"}]