[{"header":"Saul Chosen to Be King"},{"num":9,"verse":"There was a man of Benjamin whose name was Kish son of Abiel son of Zeror son of Becorath son of Aphiah, a Benjaminite, a man of wealth. "},{"num":2,"verse":"He had a son whose name was Saul, a handsome young man. There was not a man among the people of Israel more handsome than he; he stood head and shoulders above everyone else."},{"num":3,"verse":"Now the donkeys of Kish, Saul’s father, had strayed. So Kish said to his son Saul, “Take one of the boys with you; go and look for the donkeys.” "},{"num":4,"verse":"He passed through the hill country of Ephraim and passed through the land of Shalishah, but they did not find them. And they passed through the land of Shaalim, but they were not there. Then he passed through the land of Benjamin, but they did not find them."},{"num":5,"verse":"When they came to the land of Zuph, Saul said to the boy who was with him, “Let us turn back, or my father will stop worrying about the donkeys and worry about us.” "},{"num":6,"verse":"But he said to him, “There is a man of God in this town; he is a man held in honor. Whatever he says always comes true. Let us go there now; perhaps he will tell us about the journey on which we have set out.” "},{"num":7,"verse":"Then Saul replied to the boy, “But if we go, what can we bring the man? For the bread in our sacks is gone, and there is no present to bring to the man of God. What have we?” "},{"num":8,"verse":"The boy answered Saul again, “Here, I have with me a quarter shekel of silver; I will give it to the man of God, to tell us our way.” "},{"num":9,"verse":"(Formerly in Israel, anyone who went to inquire of God would say, “Come, let us go to the seer”; for the one who is now called a prophet was formerly called a seer.) "},{"num":10,"verse":"Saul said to the boy, “Good; come, let us go.” So they went to the town where the man of God was."},{"num":11,"verse":"As they went up the hill to the town, they met some girls coming out to draw water, and said to them, “Is the seer here?” "},{"num":12,"verse":"They answered, “Yes, there he is just ahead of you. Hurry; he has come just now to the town, because the people have a sacrifice today at the shrine. "},{"num":13,"verse":"As soon as you enter the town, you will find him, before he goes up to the shrine to eat. For the people will not eat until he comes, since he must bless the sacrifice; afterward those eat who are invited. Now go up, for you will meet him immediately.” "},{"num":14,"verse":"So they went up to the town. As they were entering the town, they saw Samuel coming out toward them on his way up to the shrine."},{"num":15,"verse":"Now the day before Saul came, the Lord had revealed to Samuel: "},{"num":16,"verse":"“Tomorrow about this time I will send to you a man from the land of Benjamin, and you shall anoint him to be ruler over my people Israel. He shall save my people from the hand of the Philistines; for I have seen the suffering of my people, because their outcry has come to me.” "},{"num":17,"verse":"When Samuel saw Saul, the Lord told him, “Here is the man of whom I spoke to you. He it is who shall rule over my people.” "},{"num":18,"verse":"Then Saul approached Samuel inside the gate, and said, “Tell me, please, where is the house of the seer?” "},{"num":19,"verse":"Samuel answered Saul, “I am the seer; go up before me to the shrine, for today you shall eat with me, and in the morning I will let you go and will tell you all that is on your mind. "},{"num":20,"verse":"As for your donkeys that were lost three days ago, give no further thought to them, for they have been found. And on whom is all Israel’s desire fixed, if not on you and on all your ancestral house?” "},{"num":21,"verse":"Saul answered, “I am only a Benjaminite, from the least of the tribes of Israel, and my family is the humblest of all the families of the tribe of Benjamin. Why then have you spoken to me in this way?”"},{"num":22,"verse":"Then Samuel took Saul and his servant-boy and brought them into the hall, and gave them a place at the head of those who had been invited, of whom there were about thirty. "},{"num":23,"verse":"And Samuel said to the cook, “Bring the portion I gave you, the one I asked you to put aside.” "},{"num":24,"verse":"The cook took up the thigh and what went with it and set them before Saul. Samuel said, “See, what was kept is set before you. Eat; for it is set before you at the appointed time, so that you might eat with the guests.”"},{"num":25,"verse":"When they came down from the shrine into the town, a bed was spread for Saul on the roof, and he lay down to sleep. "},{"num":26,"verse":"Then at the break of dawn Samuel called to Saul upon the roof, “Get up, so that I may send you on your way.” Saul got up, and both he and Samuel went out into the street."},{"header":"Samuel Anoints Saul"},{"num":27,"verse":"As they were going down to the outskirts of the town, Samuel said to Saul, “Tell the boy to go on before us, and when he has passed on, stop here yourself for a while, that I may make known to you the word of God.” "}]