[{"num":9,"verse":"A powerful man named Kish, who descended from Abiel, Zeror, Becorath, and Aphiah (the son of a Benjaminite), lived among the people of Benjamin. "},{"num":2,"verse":"Kish had a handsome young son named Saul. Now Saul was not only the most handsome man in Israel, but he was also the most imposing, standing taller than all others."},{"num":3,"verse":"One day Saul’s father Kish had lost his donkeys, having wandered away, so he told his son Saul to take one of the servants and look for them. "},{"num":4,"verse":"They traveled through the hill country of Ephraim, through the land of Shalishah, and through the land of Shaalim, but they did not find them. Then they passed through the land of Benjamin, and still they did not see the donkeys."},{"num":5,"verse":"At last, when they came to Zuph, Saul told the servant who accompanied him,"},{"num":9,"verse":"It used to be in Israel that when people wanted to ask God a question, they would say, “Let’s go talk to the seer.” Now they are most commonly referred to as prophets, but they were called seers."},{"num":14,"verse":"They went immediately, and as they entered the city, Samuel was walking in their direction on his way up to the high place."},{"num":15,"verse":"Now the Eternal One had told Samuel on the previous day,"},{"num":17,"verse":"When Samuel saw Saul walking toward him, the Eternal spoke to him."},{"num":18,"verse":"There inside the gate, Saul walked up to Samuel."},{"num":22,"verse":"Samuel took Saul and his servant up to the hall where around 30 people waited, and he made them sit in the places of honor."},{"num":24,"verse":"The cook brought the thigh along with other select parts and set them in front of Saul."},{"num":25,"verse":"When they returned to the city from eating at the high place, Samuel spoke with Saul on the roof."},{"num":26,"verse":"The next morning, at the break of dawn, Samuel shouted up to Saul on the roof."},{"num":27,"verse":"When they reached the edge of the city, Samuel told him,"}]