[{"num":12,"verse":"Remember now thy Bo’re (Creator) in the yamim of thy bechurot, while the yamei hara’ah come not, nor the shanim draw nigh, when thou shalt say, I have no chefetz (pleasure) in them;"},{"num":2,"verse":"While the shemesh, or the ohr, or the yarei’ach, or the kokhavim, be not darkened, nor the clouds return after the rain;"},{"num":3,"verse":"In the yom when the shomrei habayit shall tremble, and the strong men shall stoop, and the grinders cease because they are few, and those that look out of the windows grow dim,"},{"num":4,"verse":"And the delatayim (doors) shall be shut in the street, when the sound of the grinding fades, and he shall arise at the sound of a tzipor (bird), and all their banot hashir (daughters of song) are brought low;"},{"num":5,"verse":"Also when they shall be afraid of height, and fears shall be in the derech, and the almond tree shall blossom, and the grasshopper drags himself along, and desire shall fail; because haAdam goeth to his bais olam (eternal home), and the mourners go about the streets;"},{"num":6,"verse":"Or ever the silver cord be loosed, or the golden bowl be broken, or the pitcher be broken at the fountain, or the wheel broken at the bor (cistern)."},{"num":7,"verse":"Then shall the aphar return to ha’aretz as it was; and the ruach shall return unto HaElohim who gave it."},{"num":8,"verse":"Hevel havalim, saith Kohelet; all is hevel."},{"num":9,"verse":"And moreover, because Kohelet was chacham, he taught the people da’as; yea, he applied, and searched out, and set in order many meshalim (proverbs)."},{"num":10,"verse":"Kohelet searched to find out divrei chefetz; and that which was written was yosher, even divrei emes."},{"num":11,"verse":"Divrei chachamim are like goads, and like nails firmly fixed are the collected sayings that are given by Ro’eh Echad (One Shepherd)."},{"num":12,"verse":"And further, by these, beni, be admonished; of making many sefarim there is no ketz; and much study is a weariness of the basar."},{"num":13,"verse":"Let us hear the sof (conclusion) of the whole matter; Fear HaElohim, and of His commandments be shomer mitzvot; for this is the whole duty of haAdam."},{"num":14,"verse":"For HaElohim shall bring kol ma’aseh (every work) into mishpat (judgment), with every ne’lam (secret thing, concealed thing), whether it be tov (good), or whether it be rah (evil)."}]