[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The sin of the young men was very great.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Grave peccatum sacerdotum ob scandalurn datum laicis ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(“the sin of the priests was a great one, because it put a stumbling-block in the way of the people”).—A. Lapide, quoted by Wordsworth. Religion was being brought into general disrepute through the conduct of its leading ministers; was it likely that piety, justice, and purity would be honoured and loved in the land of Israel when the whole ritual of the sacrifices was openly scoffed at in the great sanctuary of the people by the chief priests of their faith?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:11-26 Samuel, being devoted to the Lord in a special manner, was from a child employed about the sanctuary in the services he was capable of. As he did this with a pious disposition of mind, it was called ministering unto the Lord. He received a blessing from the Lord. Those young people who serve God as well as they can, he will enable to improve, that they may serve him better. Eli shunned trouble and exertion. This led him to indulge his children, without using parental authority to restrain and correct them when young. He winked at the abuses in the service of the sanctuary till they became customs, and led to abominations; and his sons, who should have taught those that engaged in the service of the sanctuary what was good, solicited them to wickedness. Their offence was committed even in offering the sacrifices for sins, which typified the atonement of the Saviour! Sins against the remedy, the atonement itself, are most dangerous, they tread under foot the blood of the covenant. Eli's reproof was far too mild and gentle. In general, none are more abandoned than the degenerate children of godly persons, when they break through restraints.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The offering of the Lord - Minchah, here in the general sense of \"gift or offering\" to God (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In its restricted sense, it is used of the meat offerings, the unbloody sacrifices, and is then coupled with bloody sacrifices, sacrifices of slain beasts. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-17. the priests' custom with the people—When persons wished to present a sacrifice of peace offering on the altar, the offering was brought in the first instance to the priest, and as the Lord's part was burnt, the parts appropriated respectively to the priests and offerers were to be sodden. But Eli's sons, unsatisfied with the breast and shoulder, which were the perquisites appointed to them by the divine law (Ex 29:27; Le 7:31, 32), not only claimed part of the offerer's share, but rapaciously seized them previous to the sacred ceremony of heaving or waving (see on [235]Le 7:29); and moreover they committed the additional injustice of taking up with their fork those portions which they preferred, while still raw. Pious people revolted at such rapacious and profane encroachments on the dues of the altar, as well as what should have gone to constitute the family and social feast of the offerer. The truth is, the priests having become haughty and unwilling in many instances to accept invitations to those feasts, presents of meat were sent to them; and this, though done in courtesy at first, being, in course of time, established into a right, gave rise to all the rapacious keenness of Eli's sons.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The sin of the young men was very great; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because they violently took away both man’s and God’s dues, and this before their time, and that with manifest contempt of God and men; and all this merely for the gratifying of their sensual appetite. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Before the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. even in the place of God’s special presence, where he saw and observed all their miscarriages; which argues the height of impiety and imprudence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Men abhorred the offering of the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they neglected and abhorred the practice of carrying up sacrifices to be offered, which they knew would be so grossly abused; and which, as they might think, would be rejected and abhorred by God himself; and therefore they would not contribute to the priests’ sin, and the corruption of God’s worship, but judged it better to neglect the thing, than to expose it to the priests’ depravation; wherein yet they erred, as we see, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 2:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Wherefore the sin of the young men was very great before the Lord,.... That is, the sons of Eli; for they were the ringleaders who set these bad examples, which other priests followed, and therefore the sin is ascribed to them; and which was sadly aggravated by taking what was not their own, and by taking it in a forcible manner, and before the Lord had his part in the offering, and all this done in the tabernacle, in the presence of God; which plainly showed that they had not the fear of God before their eyes, nor any sense of his omniscience and omnipresence, any more than of his holiness and justice: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for men abhorred the offering of the Lord; it was irksome and disagreeable to them to bring their sacrifices, when they saw the law of God was not attended to, and the rules of sacrificing were not observed; such contempt of God, such abuse of sacrifices, such injury done to the sacrificers, and such covetousness and sensuality in the priests, that it even set the people against sacrifices, and made them loath them, and neglect to bring them. And this aggravated the sin of the young men, though the sacrificers were not excused hereby, 1 Samuel 2:24. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for men abhorred the offering of the Lord; it was irksome and disagreeable to them to bring their sacrifices, when they saw the law of God was not attended to, and the rules of sacrificing were not observed; such contempt of God, such abuse of sacrifices, such injury done to the sacrificers, and such covetousness and sensuality in the priests, that it even set the people against sacrifices, and made them loath them, and neglect to bring them. And this aggravated the sin of the young men, though the sacrificers were not excused hereby, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Wherefore the sin of the young men was very great before the LORD: for men {o} abhorred the offering of the LORD.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Wherefore the sin of the young men was very great before the LORD: for men ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " abhorred the offering of the LORD.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Seeing the horrible abuse of it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the young men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Hophni and Phinehas.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men abhorred",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the men despised",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "brought into contempt the offering of Jehovah.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Sept. omits ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Corruption in the priesthood begets profanity in the people. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 2:8-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “They made it vile in the eyes of the people by shewing how vile it was in their eyes.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Such conduct as this on the part of the young men (the priests' servants), was a great sin in the sight of the Lord, as they thereby brought the sacrifice of the Lord into contempt. נאץ, causative, to bring into contempt, furnish occasion for blaspheming (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 12:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"The robbery which they committed was a small sin in comparison with the contempt of the sacrifices themselves, which they were the means of spreading among the people\" (O. v. Gerlach). Minchah does not refer here to the meat-offering as the accompaniment to the slain-offerings, but to the sacrificial offering generally, as a gift presented for the Lord.",
        "children": []
      }
    ]
  }
]