[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Now Eli was very old.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The compiler of these Books of Samuel was evidently wishful to speak as kindly as possible of Eli. He had, no doubt, deserved well of Israel in past days; and though it was clear that through his weak indulgence for his wicked sons, and his own lack of energy and foresight, he had brought discredit on the national sanctuary, and, in the end, defeat and shame on the people, yet the compiler evidently loved to dwell on the brightest side of the old high priest’s character—his piety, his generous love for Samuel, his patriotism, &c.; and here, where the shameful conduct of Hophni and Phinehas is dwelt on, an excuse is made for their father, Eli. “He was,” says the writer, “very old.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The women that assembled.—These women were evidently in some way connected with the service of the Tabernacle; possibly they assisted in the liturgical portion of the sanctuary worship. (Compare Psalm 68:11 : “The Lord gave the word, great was the company of female singers.”) Here, as so often in the world’s story, immorality follows on unbelief.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The women that assembled.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—These women were evidently in some way connected with the service of the Tabernacle; possibly they assisted in the liturgical portion of the sanctuary worship. (Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : “The Lord gave the word, great was the company of female singers.”) Here, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "so ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "often in the world’s story, immorality follows on unbelief.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Psalm 78:60-64, the punishment of the guilty priests and the forsaking of the defiled sanctuary is recorded. The psalmist Asaph relates how, in His anger at the people’s sin, God greatly abhorred Israel, so that He “forsook the Tabernacle at Shiloh—even the tent that He had pitched among men. He delivered their power into captivity, and their beauty into the enemy’s hand. The fire consumed their young men, and their maidens were not given to marriage. Their priests were slain with the sword, and there were no widows to make lamentation.”",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:60-64",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the punishment of the guilty priests and the forsaking of the defiled sanctuary is recorded. The psalmist Asaph relates how, in His anger at the people’s sin, God greatly abhorred Israel, so that He “forsook the Tabernacle at Shiloh—even the tent that He had pitched among men. He delivered their power into captivity, and their beauty into the enemy’s hand. The fire consumed their young men, and their maidens were not given to marriage. Their priests were slain with the sword, and there were no widows to make lamentation.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 2:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Now Eli was very old — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And therefore unfit either to manage his office himself, or to make a diligent inspection into the carriage of his sons, which gave them opportunity for their wickedness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All that his sons did to Israel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Whom they injured in their offerings, and alienated from the service of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "At the door of the tabernacle — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The place where all the people, both men and women, waited when they came up to the service of God, because the altar on which their sacrifices were offered was by the door. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:11-26 Samuel, being devoted to the Lord in a special manner, was from a child employed about the sanctuary in the services he was capable of. As he did this with a pious disposition of mind, it was called ministering unto the Lord. He received a blessing from the Lord. Those young people who serve God as well as they can, he will enable to improve, that they may serve him better. Eli shunned trouble and exertion. This led him to indulge his children, without using parental authority to restrain and correct them when young. He winked at the abuses in the service of the sanctuary till they became customs, and led to abominations; and his sons, who should have taught those that engaged in the service of the sanctuary what was good, solicited them to wickedness. Their offence was committed even in offering the sacrifices for sins, which typified the atonement of the Saviour! Sins against the remedy, the atonement itself, are most dangerous, they tread under foot the blood of the covenant. Eli's reproof was far too mild and gentle. In general, none are more abandoned than the degenerate children of godly persons, when they break through restraints.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Women that assembled - Or, \"Served.\" See the marginal reference and note. Probably such service as consisted in doing certain work for the fabric of the tabernacle as women are accustomed to do, spinning, knitting, embroidering, mending, washing, and such like. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22-24. the women that assembled at the door of the tabernacle—This was an institution of holy women of a strictly ascetic order, who had relinquished worldly cares and devoted themselves to the Lord; an institution which continued down to the time of Christ (Lu 2:37). Eli was, on the whole, a good man, but lacking in the moral and religious training of his family. He erred on the side of parental indulgence; and though he reprimanded them (see on [236]De 21:18), yet, from fear or indolence, he shrank from laying on them the restraints, or subjecting them to the discipline, their gross delinquencies called for. In his judicial capacity, he winked at their flagrant acts of maladministration and suffered them to make reckless encroachments on the constitution, by which the most serious injuries were inflicted both on the rights of the people and the laws of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He was very old; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and therefore unfit either to manage his office himself, or to make a diligent inspection into the carriage of his sons in holy administrations; which gave them opportunity for their wickedness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All that his sons did unto all Israel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whom they injured in their offerings, and alienated from the service of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Assembled, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "warred",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which expression is used of them, either because they came to the service and worship of God in the tabernacle, which is often called a warfare; or because they came in considerable numbers, and due order, like to an army. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "At the door; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the place where all the people, both men and women, waited when they came up to the service of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 1:9,12 Lu 1:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",12 Lu 1:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", because they could not have admittance into the tabernacle, and because the altar on which their sacrifices were offered was by the door. Hence it seems probable that these women were not such as devoted themselves to the service of God and of his tabernacle, either by fasting and prayer, &c., or by sewing, spinning, &c., which, if then there were any such, had their stations not at the door, but in divers places allotted to them round about the tabernacle; but of such as came up to worship God at his tabernacle; as women ofttimes did, with their husbands, as here Hannah did, and the blessed Virgin Mary, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Luke 2:41",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:41",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or with their parents. And this exposition may receive strength from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 38:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 38:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the very same phrase is used, and that when the great tabernacle was not yet built: and so there was no occasion for any women to come to the other less tabernacle then used, save only to pray or offer sacrifices. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now Eli was very old,.... It is very probable he was now about ninety years of age, since when he died he was ninety eight, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 4:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is observed to show his incapacity for the discharge of his office, and inspection into public affairs; which gave his sons opportunity of acting the wicked part they did without reproof, and with impunity, Eli knowing nothing of it; and accounts in some measure for the gentle reproof he gave them, when he did know of it; for being old, he was not so full of spirit and vigour, and more given to tenderness and mercy; besides, his sons were grown up and married, and he had less authority over them; though he ought to have considered himself not as a father only, but as an high priest and judge of Israel, and performed his office as such; however, it must be a great affliction to him in his old age, and added to the weight of it, that his sons should behave so unworthily as they did: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and heard all that his sons had done unto Israel; who, besides what was by the law allowed them, took flesh out of the pot as it was boiling, and demanded raw flesh to roast before the fat was offered to the Lord; and in this manner they used all, without distinction, that came with their sacrifices: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and how they lay with the women that assembled at the door of the tabernacle of the congregation; not that they lay with them at the door in a public beastly manner; but the women that came thither they decoyed into their own apartments, or into some of the courts of the tabernacle, and there debauched them: who these women were, and what their business at the tabernacle, is not easy to say; some think they came about business which belonged to women to do there, as to wash and clean the rooms, to sew and spin, and the like; but one would think that these latter works should be done, not at the door of the tabernacle, but in some apartment in it, or rather at their own houses, for the use of it: the Targum is, that they there assembled to pray, which is more likely, and that they were devout women; who came there in large numbers, for the word used has the signification of armies; to perform religious exercises in fasting, and praying, and bringing sacrifices to be offered for them; though they do not seem to be such, as was Anna the prophetess, Luke 2:37 who made their abode in the tabernacle, and served God night and day with fastings and prayers, since these were only at the door of the tabernacle; nor were there in the tabernacle conveniences for such persons, as afterwards in the temple. The Jews, for the most part, by these understand new mothers, who came with their offerings for purification, attended with many other women, their relations, friends, and neighbours, and which especially, when several met together on such an occasion, made a crowd at the door of the tabernacle; and some are of opinion that these men did not lie with them, or debauch them, according to the literal sense of the word; but that they delayed the offering of their nests of doves they brought, so that they were forced to stay all night, and could not return home; and because by this means they were restrained from their husbands, it is reckoned as if these men had lain with them (t); and which they think is confirmed, in that the man of God sent to Eli, after mentioned, takes no notice of this lewdness of theirs, only of their ill behaviour as to sacrifices, but the text is so express for their debauchery, that it cannot be denied. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and how they lay with the women that assembled at the door of the tabernacle of the congregation; not that they lay with them at the door in a public beastly manner; but the women that came thither they decoyed into their own apartments, or into some of the courts of the tabernacle, and there debauched them: who these women were, and what their business at the tabernacle, is not easy to say; some think they came about business which belonged to women to do there, as to wash and clean the rooms, to sew and spin, and the like; but one would think that these latter works should be done, not at the door of the tabernacle, but in some apartment in it, or rather at their own houses, for the use of it: the Targum is, that they there assembled to pray, which is more likely, and that they were devout women; who came there in large numbers, for the word used has the signification of armies; to perform religious exercises in fasting, and praying, and bringing sacrifices to be offered for them; though they do not seem to be such, as was Anna the prophetess, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " who made their abode in the tabernacle, and served God night and day with fastings and prayers, since these were only at the door of the tabernacle; nor were there in the tabernacle conveniences for such persons, as afterwards in the temple. The Jews, for the most part, by these understand new mothers, who came with their offerings for purification, attended with many other women, their relations, friends, and neighbours, and which especially, when several met together on such an occasion, made a crowd at the door of the tabernacle; and some are of opinion that these men did not lie with them, or debauch them, according to the literal sense of the word; but that they delayed the offering of their nests of doves they brought, so that they were forced to stay all night, and could not return home; and because by this means they were restrained from their husbands, it is reckoned as if these men had lain with them (t); and which they think is confirmed, in that the man of God sent to Eli, after mentioned, takes no notice of this lewdness of theirs, only of their ill behaviour as to sacrifices, but the text is so express for their debauchery, that it cannot be denied. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) T. Bab. Sabbat, fol. 55. 2. Ben Gersom & Abarbinel in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) T. Bab. Sabbat, fol. 55. 2. Ben Gersom & Abarbinel in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Now Eli was very old, and heard all that his sons did unto all Israel; and how they lay with the women that {p} assembled at the door of the tabernacle of the congregation.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Now Eli was very old, and heard all that his sons did unto all Israel; and how they lay with the women that ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{p}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " assembled ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "at",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the door of the tabernacle of the congregation.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Which was (as the Hebrews write) after their travail, when they came to be purified, read Ex 38:8, Le 12:6.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22–26. Eli’s fruitless expostulations with his sons",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] “",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Used to hear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " all that his sons ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "were doing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” constantly and habitually.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the women that assembled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that served.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word is applied to (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") military service: (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Levitical service (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 8:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): and it seems probable that the women mentioned here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 38:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same words are used, had regular duties in connexion with the tabernacle service. The example of the abominations connected with the Phoenician worship of Ashtaroth may have helped to corrupt the priests of Shiloh.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the tabernacle of the congregation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the tent of meeting",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Jehovah would meet and hold communication with the priests, and the people. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 29:42-43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Eli...  heard all that his sons did",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To the profanity and greed described in vers. 12-17 the sons of Eli added unchastity; and their sin was the greater because the women whom they corrupted were those dedicated to religious service (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 38:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The order of ministering women instituted by Moses probably lasted down to the destruction of the temple, and Anna may have belonged to it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); afterwards it appeared again in a more spiritual form in the widows and deaconesses of the Christian Church. The word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "assembled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " means \"arranged in bands,\" and shows not merely that they were numerous, but that they had regular duties assigned them, and each one her proper place and office. The frequent sacrifices, with the feasts which followed, must have provided occupation for a large number of hands in the cleaning of the utensils and the cooking of the food. But though Eli heard of the depraved conduct of his sons in thus defiling those who ministered in the tabernacle, he gives them but the faintest rebuke, and that apparently only because their misdeeds were in everybody's mouth; for the last clause of ver. 23 really is, \"For I hear of your evil doings from all this people.\" Eli's old age may have increased his indifference, but his religious character could never have had much depth or earnestness, to allow him to regard such heinous sins so lightly. It seems even as if he chiefly felt the annoyance occasioned to himself by the expostulations urged upon him \"from all this people.\" Still all that he says is wise and thoughtful. The sins of men in high station do not end with themselves; they make others also to transgress. And as Eli's sons were Jehovah's ministers, and they had led into wickedness those who also were bound to holy service, their misconduct was a sin against Jehovah himself. 1 Samuel 2:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Eli's treatment of the sins of his sons. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The aged Eli reproved his sons with solemn warnings on account of their sins; but without his warnings being listened to. From the reproof itself we learn, that beside the sin noticed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:12-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", they also committed the crime of lying with the women who served at the tabernacle (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 38:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and thus profaned the sanctuary with whoredom. But Eli, with the infirmities of his old age, did nothing further to prevent these abominations than to say to his sons, \"Why do ye according to the sayings which I hear, sayings about you which are evil, of this whole people.\" רעים את־דּבריכם is inserted to make the meaning clearer, and כּל־ה מאת is dependent upon שׁמע. \"This whole people\" signifies all the people that came to Shiloh, and heard and saw the wicked doings there. ",
        "children": []
      }
    ]
  }
]