[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:13-33 The scribes and Pharisees were enemies to the gospel of Christ, and therefore to the salvation of the souls of men. It is bad to keep away from Christ ourselves, but worse also to keep others from him. Yet it is no new thing for the show and form of godliness to be made a cloak to the greatest enormities. But dissembled piety will be reckoned double iniquity. They were very busy to turn souls to be of their party. Not for the glory of God and the good of souls, but that they might have the credit and advantage of making converts. Gain being their godliness, by a thousand devices they made religion give way to their worldly interests. They were very strict and precise in smaller matters of the law, but careless and loose in weightier matters. It is not the scrupling a little sin that Christ here reproves; if it be a sin, though but a gnat, it must be strained out; but the doing that, and then swallowing a camel, or, committing a greater sin. While they would seem to be godly, they were neither sober nor righteous. We are really, what we are inwardly. Outward motives may keep the outside clean, while the inside is filthy; but if the heart and spirit be made new, there will be newness of life; here we must begin with ourselves. The righteousness of the scribes and Pharisees was like the ornaments of a grave, or dressing up a dead body, only for show. The deceitfulness of sinners' hearts appears in that they go down the streams of the sins of their own day, while they fancy that they should have opposed the sins of former days. We sometimes think, if we had lived when Christ was upon earth, that we should not have despised and rejected him, as men then did; yet Christ in his Spirit, in his word, in his ministers, is still no better treated. And it is just with God to give those up to their hearts' lusts, who obstinately persist in gratifying them. Christ gives men their true characters.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The altar that sanctifieth the gift - The altar, dedicated to God, gave all the value or holiness to the offering, and must therefore be the greatest or of the most importance. If, therefore, either bound to the fulfillment of an oath, it must be the altar. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. Ye fools, and blind! for whether is greater, the gift, or the altar that sanctifieth the gift?—(See Ex 29:37).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 23:22\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 23:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye fools, and blind,.... This is very justly repeated, since this is no less an instance of their folly, blindness, and stupidity. In three copies of Beza's the word \"fools\" is not; nor is it in the Vulgate Latin, nor in Munster's Hebrew Gospel; but the Syriac, Arabic, Persic, and Ethiopic versions have it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for whether is greater, the gift, or the altar that sanctifieth the gift? The gift, or offering, before it was devoted to sacred use, and brought, and laid upon the altar, was common, had no ceremonial sanctity in it, and might be put to any use; but when it was brought, and laid upon the altar, it became holy; for, according to the law, whatever touched the altar, and indeed all, or any of the vessels of the sanctuary, was holy, Exodus 29:37. Christ speaks the sense of the law, and their own traditions, and in their own language, and argues from the same to the confutation of them: , \"the altar\", they say (u), \"sanctifies\" that which is fit for it; that is, that which is proper to be offered up upon it: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for whether is greater, the gift, or the altar that sanctifieth the gift? The gift, or offering, before it was devoted to sacred use, and brought, and laid upon the altar, was common, had no ceremonial sanctity in it, and might be put to any use; but when it was brought, and laid upon the altar, it became holy; for, according to the law, whatever touched the altar, and indeed all, or any of the vessels of the sanctuary, was holy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 29:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Christ speaks the sense of the law, and their own traditions, and in their own language, and argues from the same to the confutation of them: , \"the altar\", they say (u), \"sanctifies\" that which is fit for it; that is, that which is proper to be offered up upon it: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"as the altar sanctifies that which is fit for it, so the ascent unto it sanctifies; and as the altar, and the ascent, sanctify what is fit for them, so the vessels sanctify; the vessels for liquids sanctify the liquids, and the dry measures sanctify the dry; the vessels for liquids do not sanctify the dry, nor the dry measures sanctify the liquids; the holy vessels, which are bored, (or broken,) when they do the service they used to do, when whole, sanctify, if not, they do not sanctify; nor does anything sanctify but in the sanctuary.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Now, since this is a clear case, that the altar sanctifies the gift, and not the gift the altar, our Lord's question is, which is the greater? A man that has the least share of common sense will easily see, that the altar must be the greater: wherefore these scribes and Pharisees must be wretchedly stupid to give out, that an oath made by the altar was not binding, when one that was made by the gift, or  ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Korban, was binding; seeing the gift, or offering, received its sanctity from the altar: hence, of the two, an oath made by the altar should be more sacred and obligatory than one made by the gift. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) Misn. Zebachim, c. 9. sect. 7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) Misn. Zebachim, c. 9. sect. 7. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Ye fools and blind: for whether is greater, the gift, or the altar that sanctifieth the gift?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Our Lord repeats the unanswerable argument of ver. 17. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That sanctifieth the gift.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 29:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"It shall be an altar most holy; whatsoever toucheth  the altar shall be holy\" (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 41:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The offering is one with the altar. Matthew 23:19",
        "children": []
      }
    ]
  }
]