[{"header":"Paul Is Sent to Rome"},{"num":27,"verse":"It was decided that we should go to the country of Italy by ship. Then they put Paul and some other men in chains. Julius, a captain of Caesar’s army, was to watch them. "},{"num":2,"verse":"We went on a ship that was from the city of Adramyttian. It was going to stop at the towns along the sea-shore of Asia. Aristarchus was with us. He was a man from the city of Thessalonica in the country of Macedonia. "},{"num":3,"verse":"The next day we stopped in the city of Sidon. Julius was kind to Paul. He let him visit friends who cared for him."},{"num":4,"verse":"After leaving Sidon we were blown by the wind along the south side of the island of Cyprus. The wind was against us. "},{"num":5,"verse":"We crossed the sea along the countries of Cilicia and Pamphylia and got to the city of Myra in the country of Lycia. "},{"num":6,"verse":"The captain found a ship from the city of Alexandria that was going to the country of Italy. He put us on it. "},{"num":7,"verse":"For many days the ship did not move fast. It was hard to get to the city of Cnidus. The wind would not let us go on. So we went along the south shore of the island of Crete and passed the end of the island called Salome. "},{"num":8,"verse":"The wind was against us, and we did not sail very fast. Then we came to a place called Fair Havens. It was near the city of Lasea."},{"num":9,"verse":"Much time had been lost. To keep going that late in the year would mean danger. Paul spoke with strong words, "},{"num":10,"verse":"“Sirs, it looks to me as if this ship and its freight will be lost. We are in danger of being lost also.”"},{"num":11,"verse":"The captain of the soldiers listened to what the captain of the ship said and not to what Paul said. "},{"num":12,"verse":"It was not a good place to spend the winter. Most of those on the ship wanted to go on and try to get to Phoenix. Crete was a good place to tie up the ship. They wanted to spend the winter there. "},{"num":13,"verse":"When a south wind started to blow, they thought their plan was right. They pulled up the anchor and went close to the shore of Crete."},{"num":14,"verse":"Later a bad wind storm came down from the land. It was called a northeaster. "},{"num":15,"verse":"The ship was stopped by the wind. After awhile we gave up and let it go with the wind. "},{"num":16,"verse":"We went behind a small island called Claudia. It was hard work but we were able to make the ship’s boat safe. "},{"num":17,"verse":"They pulled it up and tied ropes around it and the ship. They were afraid of going on the Syrtis sands. So they took the sail down and let the ship go with the wind."},{"num":18,"verse":"The storm was so bad the high waves were beating against the ship. The next day the men threw some of the freight over into the sea. "},{"num":19,"verse":"On the third day, with their own hands, they threw part of the sails and ropes into the sea. "},{"num":20,"verse":"We did not see the sun or stars for many days. A very bad storm kept beating against us. We lost all hope of being saved."},{"header":"Paul Shows His Faith"},{"num":21,"verse":"No one had eaten for a long time. Then Paul stood up and said to them, “Men, you should have listened to me and not left Crete. You would not have had this trouble and loss. "},{"num":22,"verse":"But now I want you to take hope. No one will lose his life. Only the ship will be lost. "},{"num":23,"verse":"I belong to God and I work for Him. Last night an angel of God stood by me "},{"num":24,"verse":"and said, ‘Do not be afraid, Paul. You must stand in front of Caesar. God has given you the lives of all the men on this ship.’ "},{"num":25,"verse":"So take hope, men. I believe my God will do what He has told me. "},{"num":26,"verse":"But the ship will be lost on some island.”"},{"num":27,"verse":"It was now the fourteenth night. We were going with the wind on the Adriatic Sea. At midnight the sailors thought land was near. "},{"num":28,"verse":"They let down the lead weight and found the water was not very deep. After they had gone a little farther, they found there was not as much water. "},{"num":29,"verse":"They were afraid we might be thrown against the rocks on the shore. So they put out four anchors from the back of the ship. Then they waited for morning to come."},{"num":30,"verse":"The sailors were thinking of leaving the ship. They let down a boat as if they were going to put out anchors from the front of the ship. "},{"num":31,"verse":"But Paul said to the captain and the soldiers, “These men must stay on the ship or you cannot be safe!” "},{"num":32,"verse":"Then the soldiers cut the ropes and let the boat fall into the sea."},{"num":33,"verse":"Just before the light of day came, Paul told all of them to eat. He said, “Today is the fourteenth day you have not eaten. "},{"num":34,"verse":"You must eat. It will give you strength. Not one of you will lose a hair from your head.”"},{"num":35,"verse":"After he said this, he took some bread. He gave thanks to God in front of them all. He broke it in pieces and started to eat. "},{"num":36,"verse":"They all were comforted. Each one ate some food. "},{"num":37,"verse":"All together there were 276 of us on the ship. "},{"num":38,"verse":"After they had eaten, they threw the wheat into the sea so the ship would not be as heavy."},{"num":39,"verse":"In the morning they could not see what land they were near. Later they could see a river. Near its mouth there was a shore of sand. They planned to run the ship onto the sand if they could. "},{"num":40,"verse":"The anchors were cut loose and left in the sea. Then they took the ropes off that were holding the rudder. When they put up the sail, the wind took the ship toward shore. "},{"num":41,"verse":"But the ship hit a place where the water was low. It was made from where two seas meet. The front of the ship did not move but the back part broke in pieces by the high waves."},{"num":42,"verse":"The soldiers planned to kill the men in chains. They were afraid they would swim to shore and get away, "},{"num":43,"verse":"but the captain wanted to save Paul. He kept them from their plan. Calling out to those who could swim, he told them to jump into the sea and swim to shore. "},{"num":44,"verse":"The others should use wood or anything from the ship. In this way, they all got to shore without getting hurt."}]