[[],[{"type":"header","content":"God’s Grace to Unfaithful Jerusalem"},{"type":"prose","content":"Again the word of the  came to me, saying, "}],[{"type":"prose","content":"“Son of man, make Jerusalem understand [the heinous and vile nature of] her repulsive (idolatrous) acts "}],[{"type":"prose","content":"and say, ‘Thus says the Lord  to Jerusalem (all of Israel), “Your [spiritual] origin and your birth are from the land of the Canaanite; your [spiritual] father was an Amorite and your [spiritual] mother a Hittite. "}],[{"type":"prose","content":"And as for your birth, on the day you were born your navel cord was not cut, nor were you washed with water for cleansing, nor were you rubbed with salt or even wrapped in cloths. "}],[{"type":"prose","content":"No eye looked with pity on you to do any of these things for you, to have compassion on you; but you were thrown out in the open field, for you were loathed on the day that you were born."}],[{"type":"prose","content":"“When I passed by you and saw you squirming in your [newborn] blood, I said to you while you were there in your blood, ‘Live!’ Yes, I said to you while you were there in your blood, ‘Live!’ "}],[{"type":"prose","content":"I made you (Israel) multiply like plants [which grow] in the field, and you grew up and became tall and you reached the age for [wearing] fine jewelry; your breasts were formed and your hair had grown, yet you were naked and bare."}],[{"type":"prose","content":"“Then I passed by you [again] and looked on you; behold, you were maturing  at the time for love, and I spread My skirt over you and covered your nakedness. Yes, I swore [an oath] to you and entered into a covenant with you,” says the Lord , “and you became Mine.” "}],[{"type":"prose","content":"“Then I washed you with water; yes, I [thoroughly] washed away from you the [clinging] blood and anointed you with oil. "}],[{"type":"prose","content":"I also clothed you with embroidered cloth and put sandals of porpoise skin on your feet; and I wrapped you with fine linen and covered you with silk. "}],[{"type":"prose","content":"I adorned you with ornaments and I put bracelets on your wrists and a necklace around your neck. "}],[{"type":"prose","content":"I also put a ring in your nostril and earrings in your ears and a beautiful crown on your head. "}],[{"type":"prose","content":"Thus you were adorned with gold and silver, and your dress was [made] of fine linen and silk and embroidered cloth. You ate fine flour and honey and oil; so you were extremely beautiful and you advanced  prospered into royalty. "}],[{"type":"prose","content":"Then your fame went out among the nations on account of your beauty, for it was perfect because of My majesty  splendor which I bestowed on you,” says the Lord ."}],[{"type":"prose","content":"“But you trusted in  relied on your beauty and prostituted yourself [in idolatry and its debauched rituals] because of your fame, and you poured out your immoralities on every [willing] passer-by and your beauty was his [as you worshiped the idols of the Gentile nations]. "}],[{"type":"prose","content":"You took some of your clothes and made for yourself [decorated] high places  shrines of various colors and prostituted yourself on them—things which should never have come about and taken place. "}],[{"type":"prose","content":"You also took your beautiful jewels  beautiful vessels made of My gold and My silver, which I had given you, and made for yourself images of men so that you could prostitute yourself with them; "}],[{"type":"prose","content":"and you took your embroidered clothing and covered them, and offered My oil and My incense before them. "}],[{"type":"prose","content":"Also My bread which I gave you, [made from the] fine flour and oil and honey with which I fed you, you even offered it before idols [no better than cow dung] as a sweet  soothing aroma; so it happened,” says the Lord . "}],[{"type":"prose","content":"“Moreover, you took your sons and your daughters whom you had borne to Me, and you destroyed them as sacrifices [to your man-made gods]. Were your gross immoralities so small a matter? "}],[{"type":"prose","content":"You slaughtered My children and offered them up to [worthless] idols, forcing them to pass through the [hideousness of the] fire. "}],[{"type":"prose","content":"And in all your repulsive acts and prostitutions (idolatrous immoralities) you did not [pause to] remember the days of your youth, when you were naked and bare, squirming in your [newborn] blood."}],[{"type":"prose","content":"“Then it came about after all your wickedness ‘Woe, woe to you!’ says the Lord , "}],[{"type":"prose","content":"that you built yourself an altar for prostitution and made yourself a high place [for ritual prostitution] in every square [of Jerusalem]. "}],[{"type":"prose","content":"At the beginning of every street you built your high place and made your beauty repulsive; and you offered your body to every passer-by and multiplied your obscene immorality. "}],[{"type":"prose","content":"You also prostituted yourself with the Egyptians, your lustful neighbors [by embracing their pagan rituals], and you multiplied your obscene immorality to provoke Me to anger. "}],[{"type":"prose","content":"Behold now [listen very carefully], I have stretched out My hand against you, reduced your portion, and handed you over to the desire of those who hate you, the daughters of the Philistines, who are ashamed of your infamous behavior. "}],[{"type":"prose","content":"You prostituted yourself with the Assyrians because you were not satisfied; you prostituted yourself with them and still were not satisfied. "}],[{"type":"prose","content":"Moreover, you increased your obscene immorality with the land of tradesmen, Chaldea (Babylonia), and yet even with this you were not satisfied.”’”"}],[{"type":"prose","content":"“How weakened by longing  lust is your heart (mind),” says the Lord , “while you do all these things, the actions of a bold  brazen prostitute. "}],[{"type":"prose","content":"When you built your shrine altar for prostitution at the beginning of every street and made your high place in every public square, you were not like a prostitute because you refused payment. "}],[{"type":"prose","content":"You adulterous wife, who welcomes  receives strangers instead of her husband! "}],[{"type":"prose","content":"Men give gifts to all prostitutes, but you give your gifts to all your lovers, bribing the pagan nations to come to you [as allies] from every direction for your obscene immoralities. "}],[{"type":"prose","content":"And you are different from other [unfaithful] women in your promiscuity, in that no one follows you to lure you into prostitution, and because you give money and no money is given you; in this way you are different.”"}],[{"type":"prose","content":"Therefore, O prostitute [Israel], hear the word of the . "}],[{"type":"prose","content":"Thus says the Lord , “Because your lewdness was poured out and your nakedness uncovered through your obscene immoralities with your lovers (pagan allies), and with all your [repulsive] idols, and because of the blood of your sons that you gave to them, "}],[{"type":"prose","content":"therefore, listen, I will gather all your lovers (pagan allies) with whom you took pleasure, and all those whom you loved with all those whom you hated; I will even gather them against you from every direction and will expose your nakedness to them that they may see all your nakedness [making you, Israel, an object of loathing and of mockery, a spectacle among the nations]. "}],[{"type":"prose","content":"And I [the Lord ] will judge you like women who commit adultery or shed blood are judged; and I will bring on you the blood of wrath and jealousy. "}],[{"type":"prose","content":"I will also hand you over to your lovers, and they will tear down your shrines, demolish your high places, strip you of your clothing, take away your jewels, and they will leave you naked and bare. "}],[{"type":"prose","content":"They will also incite a crowd against you and they will stone you and slaughter you with their swords. "}],[{"type":"prose","content":"They will burn down your houses with fire and execute judgments on you in the sight of many women (Gentile nations). Then I will make you cease your prostitution, and you will no longer hire your lovers. "}],[{"type":"prose","content":"So I will calm My wrath toward you and My jealousy [resulting from being denied what is rightfully and uniquely mine] will turn away from you; I will be pacified and no longer angry. "}],[{"type":"prose","content":"Because you have not remembered the days of your youth but have enraged Me with all these things, therefore, I in turn will bring your conduct down on your own head,” says the Lord , “so that you will not commit this lewdness on top of all your other repulsive acts."}],[{"type":"prose","content":"“Behold, everyone who uses proverbs will use this proverb against you: ‘Like mother, like daughter.’ "}],[{"type":"prose","content":"You are the daughter of your mother, who loathed her husband and her children. You are the sister of your sisters, who loathed their husbands and their children. Your [spiritual] mother was a Hittite and your [spiritual] father an Amorite. "}],[{"type":"prose","content":"Now your older sister is Samaria, she with her daughters (outlying cities) who live north of you; and your younger sister is Sodom, she with her daughters who live south of you. "}],[{"type":"prose","content":"Yet you have not merely walked in their ways or behaved in accordance with their pagan practices; but, as if that were too little, you [soon] acted more corruptly in all your ways than they. "}],[{"type":"prose","content":"As I live,” says the Lord , “Sodom, your sister and her daughters have not done as you and your daughters have done. "}],[{"type":"prose","content":"Behold, this was the sin of your sister Sodom: she and her daughters (outlying cities) had arrogance, abundant food, and careless ease, but she did not help the poor and needy. "}],[{"type":"prose","content":"They were haughty and committed repulsive acts before Me; therefore I removed them when I saw it. "}],[{"type":"prose","content":"Furthermore, Samaria did not commit half of your sins, but you have greatly increased your repulsive acts more than they. So you have made your [wicked] sisters [Samaria and Sodom] appear righteous  justified by [comparison to] all the disgusting things which you have done. "}],[{"type":"prose","content":"Also bear your disgrace [as punishment], having made judgment favorable for your sisters, for [you virtually absolved them] because of your sins in which you behaved more repulsively than they; they are more in the right than you. Yes, be ashamed and bear your disgrace, for you made your [pagan] sisters seem righteous."}],[{"type":"prose","content":"“Nevertheless, I will restore them [again] from their captivity, the captivity of Sodom and her daughters (outlying cities), the captivity of Samaria and her daughters, and along with them [I will restore you from] your own captivity [in the day of the Lord ], "}],[{"type":"prose","content":"so that you [Judah] will bear your humiliation  disgrace, and be [thoroughly] ashamed for all [the wickedness] that you have done to console  comfort them. "}],[{"type":"prose","content":"Your sisters, Sodom and her daughters and Samaria and her daughters will return to their former state; and you and your daughters will return to your former state. "}],[{"type":"prose","content":"For [the name of] your sister Sodom was not mentioned by you [except as a byword] in the day of your pride [when David ruled], "}],[{"type":"prose","content":"before your [own] wickedness was uncovered. Now you have become an object of reproach  a byword for the daughters of Aram  of Edom and all who are around her, and for the daughters of the Philistines—those surrounding you who despise you. "}],[{"type":"prose","content":"You have borne [the penalty of] your lewdness and your repulsive acts,” says the . "}],[{"type":"prose","content":"Yes, thus says the Lord , “I will also deal with you as you have done, you who have despised the oath by breaking the covenant."},{"type":"header","content":"The Covenant Remembered"}],[{"type":"prose","content":"“Nevertheless, I will remember [with compassion] My covenant with you in the days of your youth, and I will establish an everlasting covenant with you. "}],[{"type":"prose","content":"Then you will remember your ways and be ashamed when you receive your sisters, both your older and your younger; I will give them to you as daughters, but not because of your covenant [with Me]. "}],[{"type":"prose","content":"And I will establish My covenant with you, and you will know [without any doubt] that I am the , "}],[{"type":"prose","content":"so that you may remember [in detail] and be ashamed and never open your mouth again because of your humiliation, when I have forgiven you for all that you have done,” says the Lord ."}]]