[{"header":"Jerusalem Is Unfaithful"},{"num":16,"verse":"The Lord said:"},{"num":2,"verse":"Ezekiel, son of man, remind the people of Jerusalem of their disgusting sins "},{"num":3,"verse":"and tell them that I, the Lord God, am saying:"},{"num":4,"verse":"When you were born, no one cut you loose from your mother or washed your body. No one rubbed your skin with salt and olive oil, and wrapped you in warm blankets. "},{"num":5,"verse":"Not one person loved you enough to do any of these things, and no one even felt sorry for you. You were despised, thrown into a field, and forgotten."},{"num":6,"verse":"I saw you lying there, rolling around in your own blood, and I couldn’t let you die. "},{"num":7,"verse":"I took care of you, like someone caring for a tender, young plant. You grew up to be a beautiful young woman with perfect breasts and long hair, but you were still naked."},{"num":8,"verse":"When I saw you again, you were old enough to have sex. So I covered your naked body with my own robe. Then I solemnly promised that you would belong to me and that I, the Lord God, would take care of you."},{"num":9,"verse":"I washed the blood off you and rubbed your skin with olive oil. "},{"num":10,"verse":"I gave you the finest clothes and the most expensive robes, as well as sandals made from the best leather. "},{"num":11,"verse":"I gave you bracelets, a necklace, "},{"num":12,"verse":"a ring for your nose, some earrings, and a beautiful crown. "},{"num":13,"verse":"Your jewelry was gold and silver, and your clothes were made of only the finest material and embroidered linen. Your bread was baked from fine flour, and you ate honey and olive oil. You were as beautiful as a queen, "},{"num":14,"verse":"and everyone on earth knew it. I, the Lord God, had helped you become a lovely young woman."},{"num":15,"verse":"You learned that you were attractive enough to have any man you wanted, so you offered yourself to every passerby. "},{"num":16,"verse":"You made shrines for yourself and decorated them with some of your clothes. That’s where you took your visitors to have sex with them. These things should never have happened! "},{"num":17,"verse":"You made idols out of the gold and silver jewelry I gave you, then you sinned by worshiping those idols. "},{"num":18,"verse":"You dressed them in the clothes you got from me, and you offered them the olive oil and incense I gave you. "},{"num":19,"verse":"I supplied you with fine flour, olive oil, and honey, but you sacrificed it all as offerings to please those idols. I, the Lord God, watched this happen."},{"num":20,"verse":"But you did something even worse than that—you sacrificed your own children to those idols! "},{"num":21,"verse":"You slaughtered my children, so you could offer them as sacrifices. "},{"num":22,"verse":"You were so busy sinning and being a prostitute that you refused to think about the days when you were young and were rolling around naked in your own blood."},{"num":23,"verse":"Now I, the Lord God, say you are doomed! Not only did you do these evil things, "},{"num":24,"verse":"but you also built places on every street corner "},{"num":25,"verse":"where you disgraced yourself by having sex with anyone who walked by. And you did that more and more every day! "},{"num":26,"verse":"To make me angry, you even offered yourself to Egyptians, who were always ready to sleep with you."},{"num":27,"verse":"So I punished you by letting those greedy Philistine enemies take over some of your territory. But even they were offended by your disgusting behavior."},{"num":28,"verse":"You couldn’t get enough sex, so you chased after Assyrians and slept with them. You still weren’t satisfied, "},{"num":29,"verse":"so you went after Babylonians. But those merchants could not satisfy you either."},{"num":30,"verse":"I, the Lord God, say that you were so disgusting that you would have done anything to get what you wanted. "},{"num":31,"verse":"You had sex on every street corner, and when you finished, you refused to accept money. That’s worse than being a prostitute! "},{"num":32,"verse":"You are nothing but an unfaithful wife who would rather have sex with strangers than with your own husband. "},{"num":33,"verse":"Prostitutes accept money for having sex, but you bribe men from everywhere to have sex with you. "},{"num":34,"verse":"You’re not like other prostitutes. Men don’t ask you for sex—you offer to pay them!"},{"header":"Jerusalem Must Be Punished"},{"num":35,"verse":"Jerusalem, you prostitute, listen to me. "},{"num":36,"verse":"You chased after lovers, then took off your clothes and had sex. You even worshiped disgusting idols and sacrificed your own children as offerings to them. "},{"num":37,"verse":"So I, the Lord God, will gather every one of your lovers, those you liked and those you hated. They will stand around you, and I will rip off your clothes and let all of those lovers stare at your nakedness. "},{"num":38,"verse":"I will find you guilty of being an unfaithful wife and a murderer, and in my fierce anger I will sentence you to death! "},{"num":39,"verse":"Then I will hand you over to your lovers, who will tear down the places where you had sex. They will take your clothes and jewelry, leaving you naked and empty-handed."},{"num":40,"verse":"Your lovers and an angry mob will stone you to death; they will cut your dead body into pieces "},{"num":41,"verse":"and burn down your houses. Other women will watch these terrible things happen to you. I promise to stop you from being a prostitute and paying your lovers for sex."},{"num":42,"verse":"Only then will I calm down and stop being angry and jealous. "},{"num":43,"verse":"You made me furious by doing all these disgusting things and by forgetting how I took care of you when you were young. Then you made things worse by acting like a prostitute. You must be punished! I, the Lord God, have spoken."},{"header":"Jerusalem’s Two Sisters"},{"num":44,"verse":"People will use this saying about you, Jerusalem: “If the mother is bad, so is her daughter.” "},{"num":45,"verse":"You are just like your mother, who hated her husband and her own children. You are also like your sisters, who hated their husbands and children. Your father was an Amorite, and your mother was a Hittite. "},{"num":46,"verse":"Your older sister was Samaria, that city to your north with her nearby villages. Your younger sister was Sodom, that city to your south with her nearby villages. "},{"num":47,"verse":"You followed their way of life and their wicked customs, and soon you were more disgusting than they were."},{"num":48,"verse":"As surely as I am the living Lord God, the people of Sodom and its nearby villages were never as sinful as you. "},{"num":49,"verse":"They were arrogant and spoiled; they had everything they needed and still refused to help the poor and needy. "},{"num":50,"verse":"They thought they were better than everyone else, and they did things I hate. And so I destroyed them."},{"num":51,"verse":"You people of Jerusalem have sinned twice as much as the people of Samaria. In fact, your evil ways have made both Sodom and Samaria look innocent. "},{"num":52,"verse":"So their punishment will seem light compared to yours. You will be disgraced and put to shame because of your disgusting sins."},{"header":"Jerusalem Will Be Ashamed"},{"num":53,"verse":"Someday I will bless Sodom and Samaria and their nearby villages. I will also bless you, Jerusalem. "},{"num":54,"verse":"Then you will be ashamed of how you’ve acted, and Sodom and Samaria will be relieved that they weren’t as sinful as you. "},{"num":55,"verse":"When that day comes, you and Sodom and Samaria will once again be well-off, and all nearby villages will be restored."},{"num":56,"verse":"Jerusalem, you were so arrogant that you sneered at Sodom. "},{"num":57,"verse":"But now everyone has learned how wicked you really are. The countries of Syria and Philistia, as well as your other neighbors, hate you and make insulting remarks. "},{"num":58,"verse":"You must pay for all the vulgar and disgusting things you have done. I, the Lord, have spoken."},{"header":"The Lord Makes a Promise to Jerusalem"},{"num":59,"verse":"Jerusalem, you deserve to be punished, because you broke your promises and ignored our agreement. "},{"num":60,"verse":"But I remember the agreement I made with you when you were young, and so I will make you a promise that will last forever. "},{"num":61,"verse":"When you think about how you acted, you will be ashamed, especially when I return your sisters to you as daughters, even though this was not part of our agreement. "},{"num":62,"verse":"I will keep this solemn promise, and you will know that I am the Lord. "},{"num":63,"verse":"I will forgive you, but you will think about your sins and be too ashamed to say a word. I, the Lord God, have spoken."}]