[{"header":"Jerusalem Is Like an Unfaithful Wife"},{"num":16,"verse":"A message from the Lord came to me. The Lord said, "},{"num":2,"verse":"“Son of man, tell the people of Jerusalem the evil things they have done. I hate those things. "},{"num":3,"verse":"Tell them, ‘The Lord and King speaks to Jerusalem. He says, “Your history in the land of Canaan goes back a long way. Your father was an Amorite. Your mother was a Hittite. "},{"num":4,"verse":"On the day you were born your cord was not cut. You were not washed with water to clean you up. You were not rubbed with salt. And you were not wrapped in large strips of cloth. "},{"num":5,"verse":"No one took pity on you. No one was concerned enough to do any of these things for you. Instead, you were thrown out into an open field. You were hated on the day you were born."},{"num":6,"verse":"“ ‘ “I was passing by. I saw you kicking around in your blood. As you were lying there, I said to you, ‘Live!’ "},{"num":7,"verse":"I made you grow like a plant in a field. Soon you had grown up. You became a young adult. Your breasts had formed. Your hair had grown. But you were completely naked."},{"num":8,"verse":"“ ‘ “Later, I was passing by again. I looked at you. I saw that you were old enough for love. So I married you and took good care of you. I covered your naked body. I made a firm promise to you. I entered into a covenant with you. And you became mine,” announces the Lord and King."},{"num":9,"verse":"“ ‘ “I bathed you with water. I washed the blood off you. And I put lotions on you. "},{"num":10,"verse":"I put a beautiful dress on you. I gave you sandals made out of fine leather. I dressed you in fine linen. I covered you with expensive clothes. "},{"num":11,"verse":"I decorated you with jewelry. I put bracelets on your arms. I gave you a necklace for your neck. "},{"num":12,"verse":"I put rings on your nose and ears. And I gave you a beautiful crown for your head. "},{"num":13,"verse":"So you were decorated with gold and silver. Your clothes were made out of fine linen. They were made out of expensive and beautiful cloth. Your food was made out of honey, olive oil and the finest flour. You became very beautiful. You became a queen. "},{"num":14,"verse":"You were so beautiful that your fame spread among the nations. The glory I had given you made your beauty perfect,” announces the Lord and King."},{"num":15,"verse":"“ ‘ “But you trusted in your beauty. You used your fame to become a prostitute. You offered your body freely to anyone who passed by. In fact, you gave yourself to anyone who wanted you. "},{"num":16,"verse":"You used some of your clothes to make high places colorful. That is where people worshiped other gods. You were a prostitute there. You went to your lover and he took your beauty. "},{"num":17,"verse":"I had given you fine jewelry. It was made out of gold and silver. You used it to make for yourself statues of male gods. You worshiped those gods. You were not faithful to me. "},{"num":18,"verse":"You put your beautiful clothes on them. You offered my oil and incense to them. "},{"num":19,"verse":"You also offered them food. It was made out of olive oil, honey and the finest flour. I had given it to you to eat. You offered it as sweet-smelling incense to them. That is what you did,” announces the Lord and King."},{"num":20,"verse":"“ ‘ “Then you took your sons and daughters who belonged to me. And you sacrificed them as food to other gods. Wasn’t it enough for you to be a prostitute? "},{"num":21,"verse":"You killed my children. You sacrificed them to other gods. "},{"num":22,"verse":"You did not remember the days when you were young. At that time you were completely naked. You were kicking around in your blood. But now you have done evil things. I hate them. You have worshiped other gods. You have not been faithful to me."},{"num":23,"verse":"“ ‘ “How terrible it will be for you!” announces the Lord and King. “How terrible for you! You continued to sin against me. "},{"num":24,"verse":"Your people built up mounds for themselves in every market. They put little places of worship on them. "},{"num":25,"verse":"They set them up at every street corner. Jerusalem, you misused your beauty. You offered your body to anyone who passed by. You did it again and again. "},{"num":26,"verse":"You committed shameful acts with the people of Egypt. They were your neighbors who were ready to have sex with you. You offered yourself to them again and again. That made me very angry. "},{"num":27,"verse":"So I reached out my powerful hand against you. I made your territory smaller. I handed you over to your Philistine enemies. The people in their towns were shocked by your impure conduct. "},{"num":28,"verse":"You also committed shameful acts with the people of Assyria. Nothing ever seemed to satisfy you. You could never get enough. "},{"num":29,"verse":"Then you offered yourself to the people of Babylon. But that did not satisfy you either. There are many traders in the land of Babylon."},{"num":30,"verse":"“ ‘ “I am filled with great anger against you,” announces the Lord and King. “Just look at all the things you are doing! You are acting like a prostitute who has no shame at all. "},{"num":31,"verse":"Your people built up mounds at every street corner. You put little places of worship on them in every market. But you did not really act like a prostitute. That’s because you refused to let your lovers pay you anything."},{"num":32,"verse":"“ ‘ “You unfaithful wife! You would rather be with strangers than with your own husband! "},{"num":33,"verse":"Every prostitute receives gifts. Instead, you give gifts to all your lovers. You offer them money to come to you from everywhere. You want them to sleep with you. You are not faithful to me. "},{"num":34,"verse":"As a prostitute, you are the opposite of others. No one runs after you to sleep with you. You are exactly the opposite. You pay them. They do not pay you.” ’ ”"},{"num":35,"verse":"You prostitute, listen to the Lord’s message. "},{"num":36,"verse":"The Lord and King says, “You poured out your desire on your lovers. You took off your clothing and slept with them. You did it again and again. You worshiped other gods. I hate them. You even sacrificed your children to them. "},{"num":37,"verse":"So I am going to gather together all the lovers you found pleasure with. They include those you loved and those you hated. I will gather them against you from everywhere. I will take your clothes off right in front of them. Then they will see you completely naked. "},{"num":38,"verse":"I will hand down my sentence against you. You will be punished like women who commit adultery and sacrifice their children to other gods. I am so angry with you. So I will sentence you to death for everything you have done. "},{"num":39,"verse":"Then I will hand you over to your lovers. They will tear down those mounds you built. They will destroy the little places of worship you put on them. They will take your clothes off. They will remove your fine jewelry. And they will leave you completely naked. "},{"num":40,"verse":"They will bring a crowd against you. The crowd will put you to death by throwing stones at you. And they will chop you to pieces with their swords. "},{"num":41,"verse":"They will burn down your houses and punish you. Many women will see it. I will not let you be a prostitute anymore. You will no longer pay your lovers. "},{"num":42,"verse":"Then my great anger against you will die down. My jealous anger will turn away from you. I will be calm. I will not be angry anymore."},{"num":43,"verse":"“You did not remember the days when you were young. The things you did made me very angry. So anything that happens to you will be your own fault,” announces the Lord and King. “You added impure conduct to all the other evil things you did. I hate all those things."},{"num":44,"verse":"“All those who use proverbs will use this one about you. They will say, ‘Like mother, like daughter.’ "},{"num":45,"verse":"You are a true daughter of your mother. She hated her husband and children. And you are a true sister of your sisters. They hated their husbands and children. Your mother was a Hittite. Your father was an Amorite. "},{"num":46,"verse":"Your older sister was Samaria. She lived north of you with her daughters. Your younger sister was Sodom. She lived south of you with her daughters. "},{"num":47,"verse":"You lived exactly the way they did. You copied their evil practices. I hate those practices. Everything you did was so sinful that you soon became even worse than they were. "},{"num":48,"verse":"Your sister Sodom and her daughters never did what you and your daughters have done. And that is just as sure as I am alive,” announces the Lord and King."},{"num":49,"verse":"“Here is the sin your sister Sodom committed. She and her daughters were proud. They ate too much. They were not concerned about others. They did not help those who were poor and in need. "},{"num":50,"verse":"They were very proud. They did many things that were evil in my eyes. I hated those things. So I got rid of Sodom and her daughters, just as you have seen. "},{"num":51,"verse":"Samaria did not commit half the sins you did. You sinned even more than they did. I hate those sins. Compared to what you did, you made your sisters seem godly. "},{"num":52,"verse":"So you will be dishonored. You have given your sisters an excuse for what they did. Your sins were far worse than theirs. In fact, your sisters appear to be more godly than you. So then, be ashamed. You will be dishonored. You have made them appear to be godly."},{"num":53,"verse":"“I will not only give you back what you had before. I will also do the same thing for Sodom and her daughters. And I will do the same for Samaria and her daughters. "},{"num":54,"verse":"That will make you feel dishonored. You will be ashamed of everything you have done. You have made them feel better because you sinned more and were punished more than they were. "},{"num":55,"verse":"Your sisters Sodom and Samaria and their daughters will return to what they were before. And you and your daughters will return to what you were before. "},{"num":56,"verse":"In the past you would not even mention your sister Sodom. You were proud at that time. "},{"num":57,"verse":"That was before your sin was uncovered. Now the daughters of Edom make fun of you. So do all her neighbors and the daughters of the Philistines. Everyone who lives around you hates you. "},{"num":58,"verse":"You will be punished for your impure conduct. I will also punish you for the other evil things you have done. I hate all those things,” announces the Lord."},{"num":59,"verse":"The Lord and King says, “I will punish you in keeping with what you have done. I sealed with a promise the covenant I made with you. You hated that promise. And you broke my covenant. "},{"num":60,"verse":"But I will remember my covenant with you. I made it with you when you were young. Now I will make a new covenant with you. It will last forever. "},{"num":61,"verse":"Then you will remember how you have lived. You will be ashamed when I give you Samaria and Sodom. Samaria is your older sister. Sodom is your younger one. I will give them and their daughters to you as daughters. That can’t happen based on my old covenant with you. "},{"num":62,"verse":"So I will make my new covenant with you. Then you will know that I am the Lord. "},{"num":63,"verse":"I will pay for all the sins you have committed. Then you will remember what you have done. You will be ashamed of it. Because of your shame, you will never speak against me again,” announces the Lord and King."}]