[[],[{"type":"header","content":"Jerusalem—an Unfaithful Wife"},{"type":"prose","content":"Then another message came to me from the :"}],[{"type":"prose","content":"“Son of man, confront Jerusalem with her detestable sins."}],[{"type":"prose","content":"Give her this message from the Sovereign : You are nothing but a Canaanite! Your father was an Amorite and your mother a Hittite."}],[{"type":"prose","content":"On the day you were born, no one cared about you. Your umbilical cord was not cut, and you were never washed, rubbed with salt, and wrapped in cloth."}],[{"type":"prose","content":"No one had the slightest interest in you; no one pitied you or cared for you. On the day you were born, you were unwanted, dumped in a field and left to die."}],[{"type":"prose","content":"“But I came by and saw you there, helplessly kicking about in your own blood. As you lay there, I said, ‘Live!’"}],[{"type":"prose","content":"And I helped you to thrive like a plant in the field. You grew up and became a beautiful jewel. Your breasts became full, and your body hair grew, but you were still naked."}],[{"type":"prose","content":"And when I passed by again, I saw that you were old enough for love. So I wrapped my cloak around you to cover your nakedness and declared my marriage vows. I made a covenant with you, says the Sovereign , and you became mine."}],[{"type":"prose","content":"“Then I bathed you and washed off your blood, and I rubbed fragrant oils into your skin."}],[{"type":"prose","content":"I gave you expensive clothing of fine linen and silk, beautifully embroidered, and sandals made of fine goatskin leather."}],[{"type":"prose","content":"I gave you lovely jewelry, bracelets, beautiful necklaces,"}],[{"type":"prose","content":"a ring for your nose, earrings for your ears, and a lovely crown for your head."}],[{"type":"prose","content":"And so you were adorned with gold and silver. Your clothes were made of fine linen and costly fabric and were beautifully embroidered. You ate the finest foods—choice flour, honey, and olive oil—and became more beautiful than ever. You looked like a queen, and so you were!"}],[{"type":"prose","content":"Your fame soon spread throughout the world because of your beauty. I dressed you in my splendor and perfected your beauty, says the Sovereign ."}],[{"type":"prose","content":"“But you thought your fame and beauty were your own. So you gave yourself as a prostitute to every man who came along. Your beauty was theirs for the asking."}],[{"type":"prose","content":"You used the lovely things I gave you to make shrines for idols, where you played the prostitute. Unbelievable! How could such a thing ever happen?"}],[{"type":"prose","content":"You took the very jewels and gold and silver ornaments I had given you and made statues of men and worshiped them. This is adultery against me!"}],[{"type":"prose","content":"You used the beautifully embroidered clothes I gave you to dress your idols. Then you used my special oil and my incense to worship them."}],[{"type":"prose","content":"Imagine it! You set before them as a sacrifice the choice flour, olive oil, and honey I had given you, says the Sovereign ."}],[{"type":"prose","content":"“Then you took your sons and daughters—the children you had borne to me—and sacrificed them to your gods. Was your prostitution not enough?"}],[{"type":"prose","content":"Must you also slaughter my children by sacrificing them to idols?"}],[{"type":"prose","content":"In all your years of adultery and detestable sin, you have not once remembered the days long ago when you lay naked in a field, kicking about in your own blood."}],[{"type":"prose","content":"“What sorrow awaits you, says the Sovereign . In addition to all your other wickedness,"}],[{"type":"prose","content":"you built a pagan shrine and put altars to idols in every town square."}],[{"type":"prose","content":"On every street corner you defiled your beauty, offering your body to every passerby in an endless stream of prostitution."}],[{"type":"prose","content":"Then you added lustful Egypt to your lovers, provoking my anger with your increasing promiscuity."}],[{"type":"prose","content":"That is why I struck you with my fist and reduced your boundaries. I handed you over to your enemies, the Philistines, and even they were shocked by your lewd conduct."}],[{"type":"prose","content":"You have prostituted yourself with the Assyrians, too. It seems you can never find enough new lovers! And after your prostitution there, you still were not satisfied."}],[{"type":"prose","content":"You added to your lovers by embracing Babylonia, the land of merchants, but you still weren’t satisfied."}],[{"type":"prose","content":"“What a sick heart you have, says the Sovereign , to do such things as these, acting like a shameless prostitute."}],[{"type":"prose","content":"You build your pagan shrines on every street corner and your altars to idols in every square. In fact, you have been worse than a prostitute, so eager for sin that you have not even demanded payment."}],[{"type":"prose","content":"Yes, you are an adulterous wife who takes in strangers instead of her own husband."}],[{"type":"prose","content":"Prostitutes charge for their services—but not you! You give gifts to your lovers, bribing them to come and have sex with you."}],[{"type":"prose","content":"So you are the opposite of other prostitutes. You pay your lovers instead of their paying you!"},{"type":"header","content":"Judgment on Jerusalem’s Prostitution"}],[{"type":"prose","content":"“Therefore, you prostitute, listen to this message from the !"}],[{"type":"prose","content":"This is what the Sovereign  says: Because you have poured out your lust and exposed yourself in prostitution to all your lovers, and because you have worshiped detestable idols, and because you have slaughtered your children as sacrifices to your gods,"}],[{"type":"prose","content":"this is what I am going to do. I will gather together all your allies—the lovers with whom you have sinned, both those you loved and those you hated—and I will strip you naked in front of them so they can stare at you."}],[{"type":"prose","content":"I will punish you for your murder and adultery. I will cover you with blood in my jealous fury."}],[{"type":"prose","content":"Then I will give you to these many nations who are your lovers, and they will destroy you. They will knock down your pagan shrines and the altars to your idols. They will strip you and take your beautiful jewels, leaving you stark naked."}],[{"type":"prose","content":"They will band together in a mob to stone you and cut you up with swords."}],[{"type":"prose","content":"They will burn your homes and punish you in front of many women. I will stop your prostitution and end your payments to your many lovers."}],[{"type":"prose","content":"“Then at last my fury against you will be spent, and my jealous anger will subside. I will be calm and will not be angry with you anymore."}],[{"type":"prose","content":"But first, because you have not remembered your youth but have angered me by doing all these evil things, I will fully repay you for all of your sins, says the Sovereign . For you have added lewd acts to all your detestable sins."}],[{"type":"prose","content":"Everyone who makes up proverbs will say of you, ‘Like mother, like daughter.’"}],[{"type":"prose","content":"For your mother loathed her husband and her children, and so do you. And you are exactly like your sisters, for they despised their husbands and their children. Truly your mother was a Hittite and your father an Amorite."}],[{"type":"prose","content":"“Your older sister was Samaria, who lived with her daughters in the north. Your younger sister was Sodom, who lived with her daughters in the south."}],[{"type":"prose","content":"But you have not merely sinned as they did. You quickly surpassed them in corruption."}],[{"type":"prose","content":"As surely as I live, says the Sovereign , Sodom and her daughters were never as wicked as you and your daughters."}],[{"type":"prose","content":"Sodom’s sins were pride, gluttony, and laziness, while the poor and needy suffered outside her door."}],[{"type":"prose","content":"She was proud and committed detestable sins, so I wiped her out, as you have seen."}],[{"type":"prose","content":"“Even Samaria did not commit half your sins. You have done far more detestable things than your sisters ever did. They seem righteous compared to you."}],[{"type":"prose","content":"Shame on you! Your sins are so terrible that you make your sisters seem righteous, even virtuous."}],[{"type":"prose","content":"“But someday I will restore the fortunes of Sodom and Samaria, and I will restore you, too."}],[{"type":"prose","content":"Then you will be truly ashamed of everything you have done, for your sins make them feel good in comparison."}],[{"type":"prose","content":"Yes, your sisters, Sodom and Samaria, and all their people will be restored, and at that time you also will be restored."}],[{"type":"prose","content":"In your proud days you held Sodom in contempt."}],[{"type":"prose","content":"But now your greater wickedness has been exposed to all the world, and you are the one who is scorned—by Edom and all her neighbors and by Philistia."}],[{"type":"prose","content":"This is your punishment for all your lewdness and detestable sins, says the ."}],[{"type":"prose","content":"“Now this is what the Sovereign  says: I will give you what you deserve, for you have taken your solemn vows lightly by breaking your covenant."}],[{"type":"prose","content":"Yet I will remember the covenant I made with you when you were young, and I will establish an everlasting covenant with you."}],[{"type":"prose","content":"Then you will remember with shame all the evil you have done. I will make your sisters, Samaria and Sodom, to be your daughters, even though they are not part of our covenant."}],[{"type":"prose","content":"And I will reaffirm my covenant with you, and you will know that I am the ."}],[{"type":"prose","content":"You will remember your sins and cover your mouth in silent shame when I forgive you of all that you have done. I, the Sovereign , have spoken!”"}]]