[{"num":46,"verse":"The word of Jehovah that came to Jeremiah the prophet concerning the nations."},{"num":2,"verse":"Of Egypt: concerning the army of Pharaoh-Necho king of Egypt, which was by the river Euphrates at Carchemish, which Nebuchadrezzar king of Babylon smote in the fourth year of Jehoiakim the son of Josiah, the king of Judah."},{"num":3,"verse":"Make ready buckler and shield, and draw near to battle!"},{"num":4,"verse":"Harness the horses, and mount ye horsemen, and stand forth with helmets; polish the spears, put on the coats of mail!"},{"num":5,"verse":"Why do I see them dismayed, turned away back? And their mighty ones are beaten down, and take to flight, and look not back? Terror [is] on every side, saith Jehovah."},{"num":6,"verse":"Let not the swift flee away, neither let the mighty man escape!—Toward the north, hard by the river Euphrates, they have stumbled and fallen."},{"num":7,"verse":"Who is this [that] riseth up as the Nile, whose waters toss themselves like the rivers?"},{"num":8,"verse":"It is Egypt that riseth up as the Nile, and [his] waters toss themselves like the rivers; and he saith, I will rise up, I will cover the earth; I will destroy the city and the inhabitants thereof."},{"num":9,"verse":"Go up, ye horses, and drive furiously, ye chariots; and let the mighty men go forth: Cush and Phut that handle the shield, and the Ludim that handle the bow [and] bend it."},{"num":10,"verse":"For this is the day of the Lord Jehovah of hosts, a day of vengeance, that he may be avenged of his adversaries; and the sword shall devour, and it shall be sated and made drunk with their blood; for the Lord Jehovah of hosts hath a sacrifice in the north country, by the river Euphrates."},{"num":11,"verse":"Go up to Gilead, and fetch balm, O virgin-daughter of Egypt! In vain shalt thou multiply remedies: there is no healing for thee."},{"num":12,"verse":"The nations have heard of thy shame, and thy cry hath filled the earth; for the mighty man stumbleth against the mighty, they are both fallen together."},{"num":13,"verse":"The word that Jehovah spoke to Jeremiah the prophet, concerning the coming of Nebuchadrezzar king of Babylon to smite the land of Egypt:"},{"num":14,"verse":"Declare in Egypt, and publish in Migdol, and publish in Noph, and in Tahpanhes; say, Stand fast, and prepare thee; for the sword devoureth round about thee."},{"num":15,"verse":"Why are thy valiants swept away? They stood not, for Jehovah did thrust them down."},{"num":16,"verse":"He made many to stumble, yea, one fell upon another; and they said, Arise, and let us return to our own people and to the land of our nativity, from the oppressing sword."},{"num":17,"verse":"There did they cry, Pharaoh king of Egypt is but a noise; he hath let the time appointed go by."},{"num":18,"verse":"[As] I live, saith the King, whose name is Jehovah of hosts, surely as Tabor among the mountains, and as Carmel by the sea, so shall he come."},{"num":19,"verse":"Thou, inhabitress, daughter of Egypt, furnish for thyself a captive's baggage, for Noph shall be a desolation and shall be ruined, so that none shall dwell therein."},{"num":20,"verse":"Egypt is a very fair heifer; the gad-fly cometh, it cometh from the north."},{"num":21,"verse":"Also her hired men in the midst of her are like fatted bullocks; for they also have turned back, they have fled away together, they did not stand; for the day of their calamity is come upon them, the time of their visitation."},{"num":22,"verse":"Her voice shall go like a serpent's; for they shall march with an army, and come against her with axes, as hewers of wood."},{"num":23,"verse":"They shall cut down her forest, saith Jehovah, though it be impenetrable; for they are more than the locusts, and are innumerable."},{"num":24,"verse":"The daughter of Egypt is put to shame; she is delivered into the hand of the people of the north."},{"num":25,"verse":"Jehovah of hosts, the God of Israel, saith, Behold, I will punish Amon of No, and Pharaoh, and Egypt, and her gods, and her kings; yea, Pharaoh and them that confide in him."},{"num":26,"verse":"And I will give them into the hand of those that seek their life, and into the hand of Nebuchadrezzar king of Babylon, and into the hand of his servants; but afterwards it shall be inhabited, as in the days of old, saith Jehovah."},{"num":27,"verse":"But thou, my servant Jacob, fear not, neither be dismayed, Israel: for behold, I will save thee from afar, and thy seed from the land of their captivity; and Jacob shall return, and be in rest and at ease, and none shall make [him] afraid."},{"num":28,"verse":"Fear thou not, my servant Jacob, saith Jehovah: for I am with thee; for I will make a full end of all the nations whither I have driven thee, but I will not make a full end of thee; but I will correct thee with judgment, and I will not hold thee altogether guiltless."}]