[{"num":46,"verse":"The Davar Hashem which came to Yirmeyah HaNavi against the Goyim;"},{"num":2,"verse":"Against Mitzrayim, against the army of Pharaoh Necho Melech Mitzrayim, which was by the river Euphrates in Carkemish (Carchemish), which Nevuchadretzar Melech Bavel defeated in the fourth year of Y’hoyakim Ben Yoshiyah Melech Yehudah."},{"num":3,"verse":"Order ye the mogen and tzinnah (large shield), and draw near to milchamah."},{"num":4,"verse":"Harness the susim; and get up, ye parashim (horsemen), and stand forth with your helmets; polish the spears, and put on the armor."},{"num":5,"verse":"What do I see? They are filled with terror and retreat! And their gibborim are beaten down, and are fled speedily, and look not back; for fear was all around, saith Hashem."},{"num":6,"verse":"Let not the swift flee away, nor the gibbor escape; they shall stumble, and fall toward the north by the river Euphrates."},{"num":7,"verse":"Who is this that riseth like the Nile, whose mayim surge like the rivers?"},{"num":8,"verse":"Mitzrayim riseth up like the Nile, and his mayim surge like the rivers; and he saith, I will go up, and will cover eretz (earth); I will destroy cities and the inhabitants thereof."},{"num":9,"verse":"Come up, ye susim; and rage, ye chariots; and let the Gibborim come forth; Kush and Put, that handle the mogen; and the Ludim, that handle and bend the keshet."},{"num":10,"verse":"For this is the Yom Adonoi Hashem Tzva’os, a day of vengeance, that He may avenge Him on His adversaries; and the cherev shall devour, and it shall be satiate and made drunk with their dahm; for Adonoi Hashem Tzva’os hath a zevach in eretz tzafon by the river Euphrates."},{"num":11,"verse":"Go up into Gil‘ad, and take balm, O Betulat Bat Mitzrayim; in vain shalt thou use many refu’ot (healing remedies, medicines); for thou shalt not be healed."},{"num":12,"verse":"The Goyim have heard of thy shame, and thy cry hath filled ha’aretz; for the gibbor hath stumbled against the gibbor, and they are fallen both together."},{"num":13,"verse":"The Davar that Hashem spoke to Yirmeyah HaNavi, how Nevuchadretzar Melech Bavel would come and strike Eretz Mitzrayim."},{"num":14,"verse":"Declare ye in Mitzrayim, and publish in Migdol, and publish in Noph and in Tahpanhes; say ye, Stand fast, prepare thee; for the cherev shall devour all around thee."},{"num":15,"verse":"Why was it swept away? They stood not, because Hashem did drive them."},{"num":16,"verse":"He made many to stumble, indeed, one fell upon another; and they said, Arise, and let us go back to ammenu (our own people), and to eretz moladteinu (land of our birth), from the oppressing cherev."},{"num":17,"verse":"They did cry there, Pharaoh Melech Mitzrayim is but a noise; he hath passed the mo’ed (time appointed)."},{"num":18,"verse":"As I live, saith HaMelech, Hashem Tzva’os Shmo, Surely as Tavor is among the harim, and as Carmel by the yam, so shall he [Nebuchadnezzar] come."},{"num":19,"verse":"O thou Bat dwelling in Mitzrayim, prepare thyself to go into Golus; for Noph shall be waste and desolate without an inhabitant."},{"num":20,"verse":"Mitzrayim is like a very fair eglah, but a gadfly comes; it comes out of the tzafon."},{"num":21,"verse":"Also her mercenaries are in the midst of her like young calves of the stall; for they also are turned back, and are fled away together; they did not stand, because the day of their calamity was come upon them, and the time of their pekuddat."},{"num":22,"verse":"The noise thereof [the sound of Egypt fleeing] shall go like a nachash; for they [her enemies] shall march in force, and come against her with axes, as choppers of wood."},{"num":23,"verse":"They shall cut down her forest, saith Hashem, though it cannot be searched out; because they are more in number than the arbeh (locust), innumerable."},{"num":24,"verse":"The Bat Mitzrayim shall be ashamed; she shall be delivered into the yad of the Am Tzafon (People of the North)."},{"num":25,"verse":"Hashem Tzva’os Elohei Yisroel, saith; Hineni, I will punish Amon of No, and Pharaoh, and Mitzrayim, with their elohim, and their melachim; even Pharaoh, and all the botechim (ones trusting) in him;"},{"num":26,"verse":"And I will deliver them into the yad of those that seek their nefesh, and into the yad of Nevuchadretzar Melech Bavel, and into the yad of his avadim; and afterward it shall be inhabited, as in the yemei kedem (days of old), saith Hashem."},{"num":27,"verse":"But fear not thou, O Avdi Ya’akov, and be not dismayed, O Yisroel; for, hineni, I will save thee from afar off, and thy zera from the land of their captivity; and Ya’akov shall return, and be in rest and securely at ease, and none shall make him afraid."},{"num":28,"verse":"Fear thou not, O Ya’akov Avdi, saith Hashem; for I am with thee; for I will make a full end of kol HaGoyim where I have scattered thee; but I will not make a full end of thee, but correct thee with mishpat (justice); yet will I not leave thee wholly unpunished."}]