[{"header":"Saul’s Growing Fear of David"},{"num":18,"verse":"David finished talking with Saul. After that, Jonathan and David became close friends. Jonathan loved David just as he loved himself. "},{"num":2,"verse":"From that time on, Saul kept David with him. He didn’t let him return home to his family. "},{"num":3,"verse":"Jonathan made a covenant with David because he loved him just as he loved himself. "},{"num":4,"verse":"Jonathan took off the robe he was wearing and gave it to David. He also gave him his military clothes. He even gave him his sword, his bow and his belt."},{"num":5,"verse":"David did everything Saul sent him to do. He did it so well that Saul gave him a high rank in the army. That pleased Saul’s whole army, including his officers."},{"num":6,"verse":"After David had killed Goliath, the men of Israel returned home. The women came out of all the towns of Israel to meet King Saul. They danced and sang joyful songs. They played harps and tambourines. "},{"num":7,"verse":"As they danced, they sang,"},{"num":8,"verse":"That song made Saul very angry. It really upset him. He said to himself, “They are saying David has killed tens of thousands of men. But they are saying I’ve killed only thousands. The only thing left for him to get is the kingdom itself.” "},{"num":9,"verse":"From that time on, Saul watched David closely."},{"num":10,"verse":"The next day an evil spirit sent by God came powerfully on Saul. Saul began to prophesy in his house. At that same time David began to play the harp, just as he usually did. Saul was holding a spear. "},{"num":11,"verse":"He threw it at David. As he did, he said to himself, “I’ll pin David to the wall.” But David got away from him twice."},{"num":12,"verse":"The Lord had left Saul and was with David. So Saul was afraid of David. "},{"num":13,"verse":"He sent David away. He put him in command of 1,000 men. David led the troops in battle. "},{"num":14,"verse":"In everything he did, he was very successful. That’s because the Lord was with him. "},{"num":15,"verse":"When Saul saw how successful David was, he became afraid of him. "},{"num":16,"verse":"But all the troops of Israel and Judah loved David. That’s because he led them in battle."},{"num":17,"verse":"Saul said to David, “Here is my older daughter Merab. I’ll give her to you to be your wife. Just serve me bravely and fight the Lord’s battles.” Saul said to himself, “I won’t have to lift my hand to strike him down. The Philistines will do that!”"},{"num":18,"verse":"But David said to Saul, “Who am I? Is anyone in my whole family that important in Israel? Am I worthy to become the king’s son-in-law?” "},{"num":19,"verse":"The time came for Saul to give his daughter Merab to David. Instead, Saul gave her to Adriel from Meholah to be his wife."},{"num":20,"verse":"Saul’s daughter Michal was in love with David. When they told Saul about it, he was pleased. "},{"num":21,"verse":"“I’ll give her to David to be his wife,” Saul said to himself. “Then maybe she’ll trap him. And maybe the Philistines will strike him down.” So Saul said to David, “Now you have a second chance to become my son-in-law.”"},{"num":22,"verse":"Then Saul gave an order to his attendants. He said, “Speak to David in private. Tell him, ‘The king likes you. All his attendants love you. So become his son-in-law.’ ”"},{"num":23,"verse":"Saul’s attendants spoke those very words to David. But David said, “Do you think it’s a small thing to become the king’s son-in-law? I’m only a poor man. I’m not very well known.”"},{"num":24,"verse":"Saul’s attendants told him what David had said. "},{"num":25,"verse":"Saul said, “Tell David, ‘Here’s the price the king wants for the bride. He wants you to kill 100 Philistines. Then bring back the skins you cut off when you circumcise them. That’s how Saul will get even with his enemies.’ ” Saul hoped that the Philistines would strike David down."},{"num":26,"verse":"Saul’s attendants also told David those things. Then David was pleased to become the king’s son-in-law. So before the wedding day, "},{"num":27,"verse":"David and his men went out and killed 200 Philistines. They circumcised the Philistines. Then David brought back all the skins. They counted out the full number and gave them to the king. By doing that, David could become the king’s son-in-law. So Saul gave David his daughter Michal to be his wife."},{"num":28,"verse":"Saul realized that the Lord was with David. He also realized that his daughter Michal loved David. "},{"num":29,"verse":"So Saul became even more afraid of him. As long as Saul lived, he remained David’s enemy."},{"num":30,"verse":"The Philistine commanders kept on going out to battle. Every time they did, David had more success against them than the rest of Saul’s officers. So his name became well known."}]