[{"header":"David’s Love for Jonathan"},{"num":18,"verse":"David finished talking to Saul. After that, Jonathan became David’s closest friend. He loved David as much as he loved himself. "},{"num":2,"verse":"(From that day on Saul kept David as his servant and didn’t let him go back to his family.) "},{"num":3,"verse":"So Jonathan made a pledge of mutual loyalty with David because he loved him as much as he loved himself. "},{"num":4,"verse":"Jonathan took off the coat he had on and gave it to David along with his battle tunic, his sword, his bow, and his belt."},{"num":5,"verse":"David was successful wherever Saul sent him. Saul put him in charge of the fighting men. This pleased all the people, including Saul’s officials."},{"header":"David’s Success Makes Saul Jealous"},{"num":6,"verse":"As they arrived, David was returning from a campaign against the Philistines. Women from all of Israel’s cities came to meet King Saul. They sang and danced, accompanied by tambourines, joyful music, and triangles. "},{"num":7,"verse":"The women who were celebrating sang,"},{"num":8,"verse":"Saul became very angry because he considered this saying to be insulting. “To David they credit tens of thousands,” he said, “but to me they credit only a few thousand. The only thing left for David is my kingdom.” "},{"num":9,"verse":"From that day on Saul kept an eye on David."},{"num":10,"verse":"The next day an evil spirit from Elohim seized Saul. He began to prophesy in his house while David strummed a tune on the lyre as he did every day. Now, Saul had a spear in his hand. "},{"num":11,"verse":"He raised the spear and thought, “I’ll nail David to the wall.” But David got away from him twice."},{"num":12,"verse":"Saul was afraid of David, because Yahweh was with David but had left Saul. "},{"num":13,"verse":"So he kept David away. He made David captain of a regiment. David led the troops out to battle and back again. "},{"num":14,"verse":"He was successful in everything he undertook because Yahweh was with him. "},{"num":15,"verse":"Saul noticed how very successful he was and became even more afraid of him. "},{"num":16,"verse":"Everyone in Israel and Judah loved David, because he led them in and out of battle."},{"num":17,"verse":"Finally, Saul said to David, “Here is my oldest daughter Merab. I will give her to you as your wife if you prove yourself to be a warrior for me and fight Yahweh’s battles.” (Saul thought, “I must not lay a hand on him. Let the Philistines do that.”)"},{"num":18,"verse":"“Who am I?” David asked Saul. “And how important are my relatives or my father’s family in Israel that I should be the king’s son-in-law?”"},{"num":19,"verse":"But when the time came to give Saul’s daughter Merab to David, she was married to Adriel from Meholah. "},{"num":20,"verse":"However, Saul’s daughter Michal fell in love with David. When Saul was told about it, the news pleased him. "},{"num":21,"verse":"Saul thought, “I’ll give her to David. She will trap him, and the Philistines will get him.” So he said to David a second time, “You will now be my son-in-law.”"},{"num":22,"verse":"Saul ordered his officers, “Talk to David in private. Tell him, ‘The king likes you, and all his officers are fond of you. Become the king’s son-in-law.’”"},{"num":23,"verse":"When Saul’s officers made it a point to say this, David asked, “Do you think it’s easy to become the king’s son-in-law? I am a poor and unimportant person.”"},{"num":24,"verse":"When the officers told Saul what David had said, "},{"num":25,"verse":"Saul replied, “Tell David, ‘The king doesn’t want any payment for the bride except 100 Philistine foreskins so that he can get revenge on his enemies.’” In this way Saul planned to have David fall into the hands of the Philistines. "},{"num":26,"verse":"When his officers told David this, David concluded that it was acceptable to become the king’s son-in-law. Before the time was up, "},{"num":27,"verse":"David and his men went out and struck down 200 Philistines. David brought the foreskins, and they counted them out for the king so that David could become the king’s son-in-law. Then Saul gave him his daughter Michal as his wife. "},{"num":28,"verse":"Saul realized that Yahweh was with David and that his daughter Michal loved David. "},{"num":29,"verse":"Then Saul was even more afraid of David, and so Saul became David’s constant enemy."},{"num":30,"verse":"The Philistine generals still went out to fight Israel. But whenever they went out to fight, David was more successful than the rest of Saul’s officers. So David gained a good reputation."}]