[{"num":62,"verse":"For the sake of Tziyon will I not hold my peace and for the sake of Yerushalayim I will not remain quiet, until her tzedek go forth like nogah (brightness), and her Yeshuah (Salvation) like a blazing lapid (torch),"},{"num":2,"verse":"And the Goyim shall see thy tzedek, and kol melachim thy kavod; and thou shalt be called by a shem chadash, which the mouth of Hashem shall designate."},{"num":3,"verse":"Thou shalt also be an ateret tiferet in the Yad Hashem, and a tzanif melukhah (royal turban, diadem) in the palm of thy G-d."},{"num":4,"verse":"Of thee it shalt no more be said, Azuvah (Forsaken); neither of thy land shall it any more be said, Shemameh (Desolate); but thou shalt be called Cheftzi-Vah, (My Delight is in her) and thy land Beulah (Married): for Hashem delighteth in thee, and thy land shall be married."},{"num":5,"verse":"For as a bochur marrieth a betulah, so shall thy banim marry thee; and as the choson rejoiceth over the kallah, so shall thy G-d rejoice over thee."},{"num":6,"verse":"I have set shomrim upon thy chomot, O Yerushalayim, which shall never hold their peace yom nor lailah; ye that remind Hashem, keep not silence,"},{"num":7,"verse":"And give Him no rest, until He establish, and until He make Yerushalayim a tehillah (praise) in Ha’Aretz."},{"num":8,"verse":"Hashem hath sworn by His yad yamin, and by the zero’a of His oz (might), Surely I will no more give thy dagan (grain) to be food for thine oyevim; and the bnei nekhar shall not drink thy tirosh, for the which thou hast toiled;"},{"num":9,"verse":"But they that have harvested it shall eat it, and praise Hashem; and they that have gathered it in shall drink it in the khatzerot (courtyards) of My Kodesh (Holy Place)."},{"num":10,"verse":"Pass through, pass through the She’arim; prepare ye the Derech HaAm; Build up, build up the mesilah (highway); gather out the even (stones); lift up a nes (banner) [visible] over HaAmim (the Nations)."},{"num":11,"verse":"Hinei, Hashem hath proclaimed unto the ketzeh HaAretz (end of the Earth), Say ye to Bat Tziyon, Hinei, thy Salvation cometh; hinei, His sachar (reward) is with Him, and His recompense before Him."},{"num":12,"verse":"And they shall call them, The Am HaKodesh, the Geulei Hashem; and thou shalt be called, Derushah (one being sought), Ir Lo Ne’ezavah (City Not Deserted)."}]