[{"num":23,"verse":"Then the whole assembly of them got up and conducted [Jesus] before Pilate."},{"num":2,"verse":"And they began to accuse Him, asserting, We found this Man perverting (misleading, corrupting, and turning away) our nation and forbidding to pay tribute to Caesar, saying that He Himself is Christ (the Messiah, the Anointed One), a King!"},{"num":3,"verse":"So Pilate asked Him, Are You the King of the Jews? And He answered him, [It is just as] you say. [I Am.]"},{"num":4,"verse":"And Pilate said to the chief priests and the throngs, I find no guilt or crime in this Man."},{"num":5,"verse":"But they were urgent and emphatic, saying, He stirs up and excites the people, teaching throughout all Judea—from Galilee, where He began, even to this place."},{"num":6,"verse":"Upon hearing this, Pilate asked whether the Man was a Galilean."},{"num":7,"verse":"And when he found out [certainly] that He belonged to Herod’s jurisdiction, he sent Him up to Herod [a higher authority], who was also in Jerusalem in those days."},{"num":8,"verse":"Now when Herod saw Jesus, he was exceedingly glad, for he had eagerly desired to see Him for a long time because of what he had heard concerning Him, and he was hoping to witness some sign (some striking evidence or spectacular performance) done by Him."},{"num":9,"verse":"So he asked Him many questions, but He made no reply."},{"num":10,"verse":"Meanwhile, the chief priests and the scribes stood by, continuing vehemently and violently to accuse Him."},{"num":11,"verse":"And Herod, with his soldiers, treated Him with contempt and scoffed at and ridiculed Him; then, dressing Him up in bright and gorgeous apparel, he sent Him back to Pilate."},{"num":12,"verse":"And that very day Herod and Pilate became friends with each other—[though] they had been at enmity before this."},{"num":13,"verse":"Pilate then called together the chief priests and the rulers and the people,"},{"num":14,"verse":"And said to them, You brought this Man before me as One Who was perverting and misleading and turning away and corrupting the people; and behold, after examining Him before you, I have not found any offense (crime or guilt) in this Man in regard to your accusations against Him;"},{"num":15,"verse":"No, nor indeed did Herod, for he sent Him back to us; behold, He has done nothing deserving of death."},{"num":16,"verse":"I will therefore chastise Him and deliver Him amended (reformed, taught His lesson) and release Him."},{"num":17,"verse":"For it was necessary for him to release to them one prisoner at the Feast."},{"num":18,"verse":"But they all together raised a deep cry [from the depths of their throats], saying, Away with this Man! Release to us Barabbas!"},{"num":19,"verse":"He was a man who had been thrown into prison for raising a riot in the city, and for murder."},{"num":20,"verse":"Once more Pilate called to them, wishing to release Jesus;"},{"num":21,"verse":"But they kept shouting out, Crucify, crucify Him!"},{"num":22,"verse":"A third time he said to them, Why? What wrong has He done? I have found [no offense or crime or guilt] in Him nothing deserving of death; I will therefore chastise Him [in order to teach Him better] and release Him."},{"num":23,"verse":"But they were insistent and urgent, demanding with loud cries that He should be crucified. And their voices prevailed (accomplished their purpose)."},{"num":24,"verse":"And Pilate gave sentence, that what they asked should be done."},{"num":25,"verse":"So he released the man who had been thrown into prison for riot and murder, for whom they continued to ask, but Jesus he delivered up to be done with as they willed."},{"num":26,"verse":"And as they led Him away, they seized one Simon of Cyrene, who was coming in from the country, and laid on him the cross and made him carry it behind Jesus."},{"num":27,"verse":"And there accompanied [Jesus] a great multitude of the people, [including] women who bewailed and lamented Him."},{"num":28,"verse":"But Jesus, turning toward them, said, Daughters of Jerusalem, do not weep for Me, but weep for yourselves and for your children."},{"num":29,"verse":"For behold, the days are coming during which they will say, Blessed (happy, fortunate, and to be envied) are the barren, and the wombs that have not borne, and the breasts that have never nursed [babies]!"},{"num":30,"verse":"Then they will begin to say to the mountains, Fall on us! and to the hills, Cover (conceal, hide) us!"},{"num":31,"verse":"For if they do these things when the timber is green, what will happen when it is dry?"},{"num":32,"verse":"Two others also, who were criminals, were led away to be executed with Him."},{"num":33,"verse":"And when they came to the place which is called The Skull [Latin: Calvary; Hebrew: Golgotha], there they crucified Him, and [along with] the criminals, one on the right and one on the left."},{"num":34,"verse":"And Jesus prayed, Father, forgive them, for they know not what they do. And they divided His garments and distributed them by casting lots for them."},{"num":35,"verse":"Now the people stood by [calmly and leisurely] watching; but the rulers scoffed and sneered (turned up their noses) at Him, saying, He rescued others [from death]; let Him now rescue Himself, if He is the Christ (the Messiah) of God, His Chosen One!"},{"num":36,"verse":"The soldiers also ridiculed and made sport of Him, coming up and offering Him vinegar (a sour wine mixed with water)"},{"num":37,"verse":"And saying, If you are the King of the Jews, save (rescue) Yourself [from death]."},{"num":38,"verse":"For there was also an inscription above Him in letters of Greek and Latin and Hebrew: This is the King of the Jews."},{"num":39,"verse":"One of the criminals who was suspended kept up a railing at Him, saying, Are You not the Christ (the Messiah)? Rescue Yourself and us [from death]!"},{"num":40,"verse":"But the other one reproved him, saying, Do you not even fear God, seeing you yourself are under the same sentence of condemnation and suffering the same penalty?"},{"num":41,"verse":"And we indeed suffer it justly, receiving the due reward of our actions; but this Man has done nothing out of the way [nothing strange or eccentric or perverse or unreasonable]."},{"num":42,"verse":"Then he said to Jesus, Lord, remember me when You come in Your kingly glory!"},{"num":43,"verse":"And He answered him, Truly I tell you, today you shall be with Me in Paradise."},{"num":44,"verse":"It was now about the sixth hour (midday), and darkness enveloped the whole land and earth until the ninth hour (about three o’clock in the afternoon),"},{"num":45,"verse":"While the sun’s light faded or was darkened; and the curtain [of the Holy of Holies] of the temple was torn in two."},{"num":46,"verse":"And Jesus, crying out with a loud voice, said, Father, into Your hands I commit My spirit! And with these words, He expired."},{"num":47,"verse":"Now the centurion, having seen what had taken place, recognized God and thanked and praised Him, and said, Indeed, without question, this Man was upright (just and innocent)!"},{"num":48,"verse":"And all the throngs that had gathered to see this spectacle, when they saw what had taken place, returned to their homes, beating their breasts."},{"num":49,"verse":"And all the acquaintances of [Jesus] and the women who had followed Him from Galilee stood at a distance and watched these things."},{"num":50,"verse":"Now notice, there was a man named Joseph from the Jewish town of Arimathea. He was a member of the council (the Sanhedrin), and a good (upright, advantageous) man, and righteous (in right standing with God and man),"},{"num":51,"verse":"Who had not agreed with or assented to the purpose and action of the others; and he was expecting and waiting for the kingdom of God."},{"num":52,"verse":"This man went to Pilate and asked for the body of Jesus."},{"num":53,"verse":"Then he took it down and rolled it up in a linen cloth for swathing dead bodies and laid Him in a rock-hewn tomb, where no one had ever yet been laid."},{"num":54,"verse":"It was the day of Preparation [for the Sabbath], and the Sabbath was dawning (approaching)."},{"num":55,"verse":"The women who had come with [Jesus] from Galilee followed closely and saw the tomb and how His body was laid."},{"num":56,"verse":"Then they went back and made ready spices and ointments (perfumes). On the Sabbath day they rested in accordance with the commandment."}]