[{"header":"Pilate Questions Jesus(A)"},{"num":23,"verse":"Then the entire assembly stood up and took him to Pilate."},{"num":2,"verse":"They began to accuse Jesus by saying, “We found that he stirs up trouble among our people: He keeps them from paying taxes to the emperor, and he says that he is Christ, a king.”"},{"num":3,"verse":"Pilate asked him, “Are you the king of the Jews?”"},{"num":4,"verse":"Pilate said to the chief priests and the crowd, “I can’t find this man guilty of any crime.”"},{"header":"Pilate Sends Jesus to Herod"},{"num":5,"verse":"The priests and the crowd became more forceful. They said, “He stirs up the people throughout Judea with his teachings. He started in Galilee and has come here.”"},{"num":6,"verse":"When Pilate heard that, he asked if the man was from Galilee. "},{"num":7,"verse":"When Pilate found out that he was, he sent Jesus to Herod. Herod ruled Galilee and was in Jerusalem at that time."},{"num":8,"verse":"Herod was very pleased to see Jesus. For a long time he had wanted to see him. He had heard about Jesus and hoped to see him perform some kind of miracle. "},{"num":9,"verse":"Herod asked Jesus many questions, but Jesus wouldn’t answer him. "},{"num":10,"verse":"Meanwhile, the chief priests and the experts in Moses’ Teachings stood there and shouted their accusations against Jesus."},{"num":11,"verse":"Herod and his soldiers treated Jesus with contempt and made fun of him. They put a colorful robe on him and sent him back to Pilate. "},{"num":12,"verse":"So Herod and Pilate became friends that day. They had been enemies before this."},{"num":13,"verse":"Then Pilate called together the chief priests, the rulers, and the people. "},{"num":14,"verse":"He told them, “You brought me this man as someone who turns the people against the government. I’ve questioned him in front of you and haven’t found this man guilty of the crimes of which you accuse him. "},{"num":15,"verse":"Neither could Herod. So he sent this man back to us. This man hasn’t done anything to deserve the death penalty. "},{"num":16,"verse":"So I’m going to have him whipped and set free.” "},{"header":"The Crowd Rejects Jesus(B)"},{"num":18,"verse":"The whole crowd then shouted, “Take him away! Free Barabbas for us.” "},{"num":19,"verse":"(Barabbas had been thrown into prison for his involvement in a riot that had taken place in the city and for murder.)"},{"num":20,"verse":"But because Pilate wanted to free Jesus, he spoke to the people again."},{"num":21,"verse":"They began yelling, “Crucify him! Crucify him!”"},{"num":22,"verse":"A third time Pilate spoke to them. He asked, “Why? What has he done wrong? I haven’t found this man deserving of the death penalty. So I’m going to have him whipped and set free.”"},{"num":23,"verse":"But the crowd pressured Pilate. They shouted that Jesus had to be crucified, and they finally won. "},{"num":24,"verse":"Pilate decided to give in to their demand. "},{"num":25,"verse":"He freed Barabbas, who had been put in prison for rioting and murdering, because that’s what they wanted. But he let them do what they wanted to Jesus."},{"header":"Jesus Is Led Away to Be Crucified"},{"num":26,"verse":"As the soldiers led Jesus away, they grabbed a man named Simon, who was from the city of Cyrene. Simon was coming into Jerusalem. They laid the cross on him and made him carry it behind Jesus."},{"num":27,"verse":"A large crowd followed Jesus. The women in the crowd cried and sang funeral songs for him. "},{"num":28,"verse":"Jesus turned to them and said, “You women of Jerusalem, don’t cry for me! Rather, cry for yourselves and your children! "},{"num":29,"verse":"The time is coming when people will say, ‘Blessed are the women who couldn’t get pregnant, who couldn’t give birth, and who couldn’t nurse a child.’ "},{"num":30,"verse":"Then people will say to the mountains, ‘Fall on us!’ and to the hills, ‘Cover us!’ "},{"num":31,"verse":"If people do this to a green tree, what will happen to a dry one?”"},{"num":32,"verse":"Two others, who were criminals, were led away to be executed with him."},{"header":"The Crucifixion(C)"},{"num":33,"verse":"When they came to the place called The Skull, they crucified him. The criminals were also crucified, one on his right and the other on his left."},{"num":34,"verse":"Then Jesus said, “Father, forgive them. They don’t know what they’re doing.” "},{"num":35,"verse":"The people stood there watching. But the rulers were making sarcastic remarks. They said, “He saved others. If he’s the Messiah that God has chosen, let him save himself!” "},{"num":36,"verse":"The soldiers also made fun of him. They would go up to him, offer him some vinegar, "},{"num":37,"verse":"and say, “If you’re the king of the Jews, save yourself!”"},{"num":38,"verse":"A written notice was placed above him. It said, “This is the king of the Jews.”"},{"header":"Criminals Talk to Jesus"},{"num":39,"verse":"One of the criminals hanging there insulted Jesus by saying, “So you’re really the Messiah, are you? Well, save yourself and us!”"},{"num":40,"verse":"But the other criminal scolded him: “Don’t you fear God at all? Can’t you see that you’re condemned in the same way that he is? "},{"num":41,"verse":"Our punishment is fair. We’re getting what we deserve. But this man hasn’t done anything wrong.”"},{"num":42,"verse":"Then he said, “Jesus, remember me when you enter your kingdom.”"},{"num":43,"verse":"Jesus said to him, “I can guarantee this truth: Today you will be with me in paradise.”"},{"header":"Jesus Dies on the Cross(D)"},{"num":44,"verse":"Around noon darkness came over the entire land and lasted until three in the afternoon. "},{"num":45,"verse":"The sun had stopped shining. The curtain in the temple was split in two."},{"num":46,"verse":"Jesus cried out in a loud voice, “Father, into your hands I entrust my spirit.” After he said this, he died."},{"num":47,"verse":"When an army officer saw what had happened, he praised God and said, “Certainly, this man was innocent!” "},{"num":48,"verse":"Crowds had gathered to see the sight. But when all of them saw what had happened, they cried and returned to the city. "},{"num":49,"verse":"All his friends, including the women who had followed him from Galilee, stood at a distance and watched everything."},{"header":"Jesus Is Placed in a Tomb(E)"},{"num":50,"verse":"There was a good man who had God’s approval. His name was Joseph. He was a member of the Jewish council, "},{"num":51,"verse":"but he had not agreed with what they had done. He was from the Jewish city of Arimathea, and he was waiting for God’s kingdom."},{"num":52,"verse":"He went to Pilate and asked for the body of Jesus. "},{"num":53,"verse":"After he took it down from the cross, he wrapped it in linen. Then he laid the body in a tomb cut in rock, a tomb in which no one had ever been buried. "},{"num":54,"verse":"It was Friday, and the day of rest—a holy day, was just beginning."},{"num":55,"verse":"The women who had come with Jesus from Galilee followed closely behind Joseph. They observed the tomb and how his body was laid in it. "},{"num":56,"verse":"Then they went back to the city and prepared spices and perfumes. But on the day of rest—a holy day, they rested according to the commandment."}]