[{"header":"Jesus Brought Before Pilate(A)"},{"num":23,"verse":"Then the whole assembly rose and led Him to Pilate. "},{"num":2,"verse":"And they began to accuse Him, saying, “We found this Man perverting our nation, and forbidding us to pay taxes to Caesar, and saying that He Himself is Christ a King.”"},{"num":3,"verse":"So Pilate asked Him, “Are You the King of the Jews?”"},{"num":4,"verse":"Then Pilate said to the chief priests and to the people, “I find no fault in this Man.”"},{"num":5,"verse":"But they insisted, saying, “He stirs up the people, teaching throughout all Judea, beginning from Galilee to here.”"},{"header":"Jesus Before Herod"},{"num":6,"verse":"When Pilate heard of Galilee, he asked whether the Man was a Galilean. "},{"num":7,"verse":"When he learned that He belonged to Herod’s jurisdiction, he sent Him to Herod, who was also in Jerusalem at that time."},{"num":8,"verse":"When Herod saw Jesus, he greatly rejoiced, for he had desired to see Him for a long time, because he had heard many things of Him, and he was hoping to see some miracle performed by Him. "},{"num":9,"verse":"He questioned Him with many words, but He gave no answer. "},{"num":10,"verse":"The chief priests and the scribes stood by, vehemently accusing Him. "},{"num":11,"verse":"Then Herod with his soldiers despised Him, and mocked Him, and dressed Him in a fine robe, and sent Him back to Pilate. "},{"num":12,"verse":"On the same day Pilate and Herod became friends with each other, having previously been at enmity with each other."},{"header":"Jesus Sentenced to Die(B)"},{"num":13,"verse":"Pilate called together the chief priests and the rulers and the people, "},{"num":14,"verse":"and said to them, “You have brought this Man to me as one who incites the people. And truly, I, having examined Him before you, have found no fault in this Man concerning those things of which you accuse Him. "},{"num":15,"verse":"No, neither has Herod, for he sent him back to us. Look, nothing worthy of death has been done by Him. "},{"num":16,"verse":"I will therefore chastise Him and release Him.” "},{"num":17,"verse":"For he was obligated to release one man to them at the feast."},{"num":18,"verse":"But they all cried out at once saying, “Take this Man away and release Barabbas to us!” "},{"num":19,"verse":"This man had been thrown in prison for an insurrection in the city and for murder."},{"num":20,"verse":"Therefore Pilate spoke to them again, desiring to release Jesus. "},{"num":21,"verse":"But they cried out, “Crucify Him! Crucify Him!”"},{"num":22,"verse":"He said to them a third time, “Why, what evil has He done? I have found in Him no cause worthy of death. I will therefore chastise Him and release Him.”"},{"num":23,"verse":"But they insisted with loud voices, asking that He be crucified. And the voices of these men and of the chief priests prevailed. "},{"num":24,"verse":"So Pilate gave the sentence as they demanded. "},{"num":25,"verse":"He released to them the man who was thrown in prison for insurrection and murder, whom they asked for. But he sentenced Jesus according to their will."},{"header":"The Crucifixion(C)"},{"num":26,"verse":"As they led Him away, they seized Simon of Cyrene, who was coming from the country, and they laid the cross on him to carry it behind Jesus. "},{"num":27,"verse":"A large number of people followed Him, including women who mourned and lamented Him. "},{"num":28,"verse":"Jesus turned to them, saying, “Daughters of Jerusalem, weep not for Me, but weep for yourselves and for your children. "},{"num":29,"verse":"Listen, the days are coming when they will say, ‘Blessed are the barren, who never bore and never nursed!’ "},{"num":30,"verse":"Then"},{"num":31,"verse":"For if men do these things when the tree is green, what will happen when it is dry?”"},{"num":32,"verse":"Two different men, who were criminals, also were led with Him to be killed. "},{"num":33,"verse":"When they came to the place which is called The Skull, there they crucified Him and the criminals, one on the right and one on the left. "},{"num":34,"verse":"Jesus said, “Father, forgive them, for they know not what they do.”  And they divided His clothes by casting lots."},{"num":35,"verse":"The people stood by watching. But the rulers with them scoffed, saying, “He saved others. Let Him save Himself if He is the Christ, the Chosen One of God.”"},{"num":36,"verse":"And the soldiers also mocked Him, coming to Him and offering Him sour wine, "},{"num":37,"verse":"saying, “If You are the King of the Jews, save Yourself.”"},{"num":38,"verse":"An inscription was written over Him in letters of Greek and Latin and Hebrew:"},{"num":39,"verse":"One of the criminals who were hanged blasphemed Him, saying, “If You are the Christ, save Yourself and us!”"},{"num":40,"verse":"But the other rebuked him, saying, “Do you not fear God, seeing you are under the same sentence? "},{"num":41,"verse":"And we indeed, justly. For we are receiving the due reward of our deeds. But this Man has done nothing amiss.”"},{"num":42,"verse":"Then he said to Jesus, “Lord, remember me when You come into Your kingdom.”"},{"num":43,"verse":"Jesus said to him, “Truly, I tell you, today you will be with Me in Paradise.”"},{"header":"The Death of Jesus(D)"},{"num":44,"verse":"It was now about the sixth hour, and darkness came over all the land until the ninth hour, "},{"num":45,"verse":"while the sun was darkened. And the veil of the temple was torn in the middle. "},{"num":46,"verse":"And Jesus cried out with a loud voice, “Father, into Your hands I commit My spirit.” Having said this, He gave up the spirit."},{"num":47,"verse":"When the centurion saw what had happened, he glorified God and said, “Certainly, this was a righteous Man.” "},{"num":48,"verse":"All the crowds who came together to that sight, witnessing what occurred, struck their chests and returned. "},{"num":49,"verse":"But all those who knew Him and the women accompanying Him from Galilee stood at a distance, seeing these things."},{"header":"The Burial of Jesus(E)"},{"num":50,"verse":"Now there was a man named Joseph, a member of the Council, who was a good and just man. "},{"num":51,"verse":"He had not consented to their counsel and deed. He was from Arimathea, a city of the Jews, and he himself was also waiting for the kingdom of God. "},{"num":52,"verse":"This man went to Pilate and asked for the body of Jesus. "},{"num":53,"verse":"Then he took Him down, and wrapped Him in linen, and placed Him in a hewn tomb, where no one had ever been buried. "},{"num":54,"verse":"It was the Day of Preparation, and the Sabbath was drawing near."},{"num":55,"verse":"The women who came with Him from Galilee followed, and saw the tomb and how His body was placed. "},{"num":56,"verse":"Then they returned and prepared spices and ointments. On the Sabbath they rested according to the commandment."}]