[{"num":23,"verse":"And having risen, the whole multitude of them did lead him to Pilate,"},{"num":2,"verse":"and began to accuse him, saying, `This one we found perverting the nation, and forbidding to give tribute to Caesar, saying himself to be Christ a king.'"},{"num":3,"verse":"And Pilate questioned him, saying, `Thou art the king of the Jews?' and he answering him, said, `Thou dost say [it].'"},{"num":4,"verse":"And Pilate said unto the chief priests, and the multitude, `I find no fault in this man;'"},{"num":5,"verse":"and they were the more urgent, saying -- `He doth stir up the people, teaching throughout the whole of Judea -- having begun from Galilee -- unto this place.'"},{"num":6,"verse":"And Pilate having heard of Galilee, questioned if the man is a Galilean,"},{"num":7,"verse":"and having known that he is from the jurisdiction of Herod, he sent him back unto Herod, he being also in Jerusalem in those days."},{"num":8,"verse":"And Herod having seen Jesus did rejoice exceedingly, for he was wishing for a long [time] to see him, because of hearing many things about him, and he was hoping some sign to see done by him,"},{"num":9,"verse":"and was questioning him in many words, and he answered him nothing."},{"num":10,"verse":"And the chief priests and the scribes stood vehemently accusing him,"},{"num":11,"verse":"and Herod with his soldiers having set him at nought, and having mocked, having put around him gorgeous apparel, did send him back to Pilate,"},{"num":12,"verse":"and both Pilate and Herod became friends on that day with one another, for they were before at enmity between themselves."},{"num":13,"verse":"And Pilate having called together the chief priests, and the rulers, and the people,"},{"num":14,"verse":"said unto them, `Ye brought to me this man as perverting the people, and lo, I before you having examined, found in this man no fault in those things ye bring forward against him;"},{"num":15,"verse":"no, nor yet Herod, for I sent you back unto him, and lo, nothing worthy of death is having been done by him;"},{"num":16,"verse":"having chastised, therefore, I will release him,'"},{"num":17,"verse":"for it was necessary for him to release to them one at every feast,"},{"num":18,"verse":"and they cried out -- the whole multitude -- saying, `Away with this one, and release to us Barabbas,'"},{"num":19,"verse":"who had been, because of a certain sedition made in the city, and murder, cast into prison."},{"num":20,"verse":"Pilate again then -- wishing to release Jesus -- called to them,"},{"num":21,"verse":"but they were calling out, saying, `Crucify, crucify him.'"},{"num":22,"verse":"And he a third time said unto them, `Why, what evil did he? no cause of death did I find in him; having chastised him, then, I will release [him].'"},{"num":23,"verse":"And they were pressing with loud voices asking him to be crucified, and their voices, and those of the chief priests, were prevailing,"},{"num":24,"verse":"and Pilate gave judgment for their request being done,"},{"num":25,"verse":"and he released him who because of sedition and murder hath been cast into the prison, whom they were asking, and Jesus he gave up to their will."},{"num":26,"verse":"And as they led him away, having taken hold on Simon, a certain Cyrenian, coming from the field, they put on him the cross, to bear [it] behind Jesus."},{"num":27,"verse":"And there was following him a great multitude of the people, and of women, who also were beating themselves and lamenting him,"},{"num":28,"verse":"and Jesus having turned unto them, said, `Daughters of Jerusalem, weep not for me, but for yourselves weep ye, and for your children;"},{"num":29,"verse":"for, lo, days do come, in which they shall say, Happy the barren, and wombs that did not bare, and paps that did not give suck;"},{"num":30,"verse":"then they shall begin to say to the mountains, Fall on us, and to the hills, Cover us; --"},{"num":31,"verse":"for, if in the green tree they do these things -- in the dry what may happen?'"},{"num":32,"verse":"And there were also others -- two evil-doers -- with him, to be put to death;"},{"num":33,"verse":"and when they came to the place that is called Skull, there they crucified him and the evil-doers, one on the right hand and one on the left."},{"num":34,"verse":"And Jesus said, `Father, forgive them, for they have not known what they do;' and parting his garments they cast a lot."},{"num":35,"verse":"And the people were standing, looking on, and the rulers also were sneering with them, saying, `Others he saved, let him save himself, if this be the Christ, the choice one of God.'"},{"num":36,"verse":"And mocking him also were the soldiers, coming near and offering vinegar to him,"},{"num":37,"verse":"and saying, `If thou be the king of the Jews, save thyself.'"},{"num":38,"verse":"And there was also a superscription written over him, in letters of Greek, and Roman, and Hebrew, `This is the King of the Jews.'"},{"num":39,"verse":"And one of the evil-doers who were hanged, was speaking evil of him, saying, `If thou be the Christ, save thyself and us.'"},{"num":40,"verse":"And the other answering, was rebuking him, saying, `Dost thou not even fear God, that thou art in the same judgment?"},{"num":41,"verse":"and we indeed righteously, for things worthy of what we did we receive back, but this one did nothing out of place;'"},{"num":42,"verse":"and he said to Jesus, `Remember me, lord, when thou mayest come in thy reign;'"},{"num":43,"verse":"and Jesus said to him, `Verily I say to thee, To-day with me thou shalt be in the paradise.'"},{"num":44,"verse":"And it was, as it were, the sixth hour, and darkness came over all the land till the ninth hour,"},{"num":45,"verse":"and the sun was darkened, and the vail of the sanctuary was rent in the midst,"},{"num":46,"verse":"and having cried with a loud voice, Jesus said, `Father, to Thy hands I commit my spirit;' and these things having said, he breathed forth the spirit."},{"num":47,"verse":"And the centurion having seen what was done, did glorify God, saying, `Really this man was righteous;'"},{"num":48,"verse":"and all the multitudes who were come together to this sight, beholding the things that came to pass, smiting their breasts did turn back;"},{"num":49,"verse":"and all his acquaintances stood afar off, and women who did follow him from Galilee, beholding these things."},{"num":50,"verse":"And lo, a man, by name Joseph, being a counsellor, a man good and righteous,"},{"num":51,"verse":"-- he was not consenting to their counsel and deed -- from Arimathea, a city of the Jews, who also himself was expecting the reign of God,"},{"num":52,"verse":"he, having gone near to Pilate, asked the body of Jesus,"},{"num":53,"verse":"and having taken it down, he wrapped it in fine linen, and placed it in a tomb hewn out, where no one was yet laid."},{"num":54,"verse":"And the day was a preparation, and sabbath was approaching,"},{"num":55,"verse":"and the women also who have come with him out of Galilee having followed after, beheld the tomb, and how his body was placed,"},{"num":56,"verse":"and having turned back, they made ready spices and ointments, and on the sabbath, indeed, they rested, according to the command."}]