[{"header":"Solomon Dedicates the Temple(A)"},{"num":7,"verse":"And when Solomon finished praying, fire came down from the heavens and consumed the burnt offering and sacrifices, and the glory of the Lord filled the temple. "},{"num":2,"verse":"And the priests were not able to enter into the house of the Lord, for the glory of the Lord filled the Lord’s house. "},{"num":3,"verse":"And all the sons of Israel saw when the fire came down and the glory of the Lord came on the temple, and they bowed their faces low to the ground on the pavement, and they worshipped confessing,"},{"num":4,"verse":"Then the king and all the people were making sacrifices before the Lord. "},{"num":5,"verse":"King Solomon sacrificed twenty-two thousand oxen and one hundred and twenty thousand sheep. So the king and all the people dedicated the house of God. "},{"num":6,"verse":"The priests stood at their positions, with the Levites and all their instruments of music for the Lord that King David had made to praise the Lord—for His mercy endures forever—when David gave praise by their ministry, and the priests sounded trumpets opposite the Levites, and all Israel stood."},{"num":7,"verse":"And Solomon consecrated the middle of the court that was in front of the house of the Lord because there he made burnt offerings and the fat of peace offerings (because the bronze altar that Solomon made was surely not able to contain the burnt offerings, grain offerings, and fat offerings)."},{"num":8,"verse":"And at the appointed time, Solomon made a feast for seven days, and all Israel—as a very great assembly—was with him, from the entrance of Lebo Hamath in the north to the Brook of Egypt in the south. "},{"num":9,"verse":"Then on the eighth day they made a solemn assembly because they had made a consecration of the altar for seven days and then the feast for seven days more. "},{"num":10,"verse":"Then on the twenty-third day of the seventh month Solomon sent the people away to their homes. They were joyful and good of heart because of what the Lord had done for David, Solomon, and His people Israel."},{"num":11,"verse":"Thus Solomon finished the house of the Lord and the king’s house. And Solomon successfully accomplished everything that came into his heart to do in the house of the Lord and in his own house."},{"header":"The Lord Appears to Solomon(B)"},{"num":12,"verse":"Then the Lord appeared to Solomon at night, and He said to Solomon,"},{"num":13,"verse":"“When I shut up the heaven and there is no rain, or when I command the locusts to devour the land, or send pestilence on My people, "},{"num":14,"verse":"if My people, who are called by My name, will humble themselves and pray, and seek My face and turn from their wicked ways, then I will hear from heaven, and will forgive their sin and will heal their land. "},{"num":15,"verse":"Now My eyes will be open and My ears attentive to the prayer of this place. "},{"num":16,"verse":"So now I have chosen and consecrated this house that My name be there continually. My eyes and heart will be there for all days."},{"num":17,"verse":"“And you, if you walk before Me as David your father did to do everything that I command you to do, and you keep My statutes and judgments, "},{"num":18,"verse":"then I will set the throne of your kingdom as I made a covenant with David your father saying, ‘You will not lack a man to rule Israel.’"},{"num":19,"verse":"“But if the people turn aside and abandon My statutes and commandments that I have given to you, and you walk after and serve other gods and worship them, "},{"num":20,"verse":"then I will uproot them from My land that I have given to them; and the house that I have consecrated for My name, I will throw it from before Me and set it as a proverb and taunt among the peoples. "},{"num":21,"verse":"And even though this house was majestic, it will lie desolate before all who pass by it, and they will say, ‘Why did the Lord do such a thing to this land and this house?’ "},{"num":22,"verse":"Then they will say, ‘Because they abandoned the Lord, the God of their fathers who brought them up from the land of Egypt, and they took hold of other gods and worshipped and served them; therefore He has brought on them all this disaster.”"}]