[{"header":"The Dedication of the Temple"},{"num":7,"verse":"When Solomon finished praying, fire flashed down from heaven and burned up the burnt offerings and sacrifices, and the glorious presence of the Lord filled the Temple."},{"num":2,"verse":"The priests could not enter the Temple of the Lord because the glorious presence of the Lord filled it."},{"num":3,"verse":"When all the people of Israel saw the fire coming down and the glorious presence of the Lord filling the Temple, they fell face down on the ground and worshiped and praised the Lord, saying,"},{"num":4,"verse":"Then the king and all the people offered sacrifices to the Lord."},{"num":5,"verse":"King Solomon offered a sacrifice of 22,000 cattle and 120,000 sheep and goats. And so the king and all the people dedicated the Temple of God."},{"num":6,"verse":"The priests took their assigned positions, and so did the Levites who were singing, “His faithful love endures forever!” They accompanied the singing with music from the instruments King David had made for praising the Lord. Across from the Levites, the priests blew the trumpets, while all Israel stood."},{"num":7,"verse":"Solomon then consecrated the central area of the courtyard in front of the Lord’s Temple. He offered burnt offerings and the fat of peace offerings there, because the bronze altar he had built could not hold all the burnt offerings, grain offerings, and sacrificial fat."},{"num":8,"verse":"For the next seven days Solomon and all Israel celebrated the Festival of Shelters. A large congregation had gathered from as far away as Lebo-hamath in the north and the Brook of Egypt in the south."},{"num":9,"verse":"On the eighth day they had a closing ceremony, for they had celebrated the dedication of the altar for seven days and the Festival of Shelters for seven days."},{"num":10,"verse":"Then at the end of the celebration, Solomon sent the people home. They were all joyful and glad because the Lord had been so good to David and to Solomon and to his people Israel."},{"header":"The Lord’s Response to Solomon"},{"num":11,"verse":"So Solomon finished the Temple of the Lord, as well as the royal palace. He completed everything he had planned to do in the construction of the Temple and the palace."},{"num":12,"verse":"Then one night the Lord appeared to Solomon and said,"}]