[{"num":12,"verse":"He admonisheth by Jacob’s example to trust in God, and not in riches."},{"num":1,"verse":"Ephraim is fed with the wind, and followeth after the East wind: he increaseth daily lies and destruction, and they do make a covenant with Assyria, and oil is carried into Egypt."},{"num":2,"verse":"The Lord hath also a controversy with Judah, and will visit Jacob, according to his ways: according to his works, will he recompense him."},{"num":3,"verse":"He took his brother by the heel in the womb, and by his strength he had power with God,"},{"num":4,"verse":"And had power over the Angel, and prevailed: he wept and prayed unto him: he found him in Bethel, and there he spake with us."},{"num":5,"verse":"Yea, the Lord God of hosts, the Lord is himself his memorial."},{"num":6,"verse":"Therefore turn thou to thy God: keep mercy and judgment, and hope still in thy God."},{"num":7,"verse":"He is Canaan: the balances of decree are in his hand: he loveth to oppress."},{"num":8,"verse":"And Ephraim said, Notwithstanding I am rich, I have found me out riches in all my labors: they shall find none iniquity in me, that were wickedness."},{"num":9,"verse":"Though I am the Lord thy God, from the land of Egypt, yet will I make thee to dwell in the tabernacles, as in the days of the solemn feast."},{"num":10,"verse":"I have also spoken by the Prophets, and I have multiplied visions, and used similitudes by the ministry of the Prophets."},{"num":11,"verse":"Is there iniquity in Gilead? surely they are vanity: they sacrifice bullocks in Gilgal, and their altars are as heaps in the furrows of the field."},{"num":12,"verse":"And Jacob fled into the country of Aram, and Israel served for a wife, and for a wife he kept sheep,"},{"num":13,"verse":"And by a Prophet the Lord brought Israel out of Egypt, and by a Prophet was he reserved."},{"num":14,"verse":"But Ephraim provoked him with high places: therefore shall his blood be poured upon him, and his reproach shall his Lord reward him."}]