[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(33) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He took him aside from the multitude.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We trace in this, and in the manual acts that followed, the same tender considerateness for the infirmities of the sufferer as in our Lord’s treatment of the blind. (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Here the man could not find in the pitying tones of the voice of the Healer that on which his faith could fasten, and the act came in to fill up the void.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mark",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE PATTERN OF SERVICEMark 7:33 - Mark 7:34",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE PATTERN OF SERVICE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 7:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 7:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For what reason was there this unwonted slowness in Christ’s healing works? For what reason was there this unusual emotion ere He spoke the word which cleansed? As to the former question, a partial answer may perhaps be that our Lord is here on half-heathen ground, where aids to faith were much needed, and His power had to be veiled that it might be beheld. Hence the miracle is a process rather than an act; and, advancing as it does by distinct stages, is conformed in appearance to men’s works of mercy, which have to adapt means to ends, and creep to their goal by persevering toil. As to the latter, we know not why the sight of this one poor sufferer should have struck so strongly on the ever-tremulous chords of Christ’s pitying heart; but we do know that it was the vision brought before His spirit by this single instance of the world’s griefs and sicknesses-in which mass, however, the special case before Him was by no means lost-that raised His eyes to heaven in mute appeal, and forced the groan from His breast.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The ‘missionary spirit’ is but one aspect of the Christian spirit. We shall only strengthen the former as we invigorate the latter. Harm has been done, both to ourselves and to that great cause, by seeking to stimulate compassion and efforts for heathen lands by the use of other excitements, which have tended to vitiate even the emotions they have aroused, and are apt to fail as when we need them most. It may therefore be profitable if we turn to Christ’s own manner of working, and His own emotions in His merciful deeds, set forth in this remarkable narrative, as containing lessons for us in our missionary and evangelistic work. I must necessarily omit more than a passing reference to the slow process of healing which this miracle exhibits. But that, too, has its teaching for us, who are so often tempted to think ourselves badly used, unless the fruit of our toil grows up, like Jonah’s gourd, before our eyes. If our Lord was content to reach His end of blessing step by step, we may well accept ‘patient continuance in well-doing’ as the condition indispensable to reaping in due season.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there are other thoughts still more needful which suggest themselves. Those minute details which this Evangelist ever delights to give of our Lord’s gestures, words, looks, and emotions, not only add graphic force to the narrative but are precious glimpses into the very heart of Christ. That fixed gaze into heaven, that groan which neither the glories seen above nor the conscious power to heal could stifle, that most gentle touch, as if removing material obstacles from the deaf ears, and moistening the stiff tongue that it might move more freely in the parched mouth, that word of authority which could not be wanting even when His working seemed likest a servant’s, do surely carry large lessons for us. The condition of all service, the cost of feeling at which our work must be done, the need that the helpers should identify themselves with the sufferers, and the victorious power of Christ’s word over all deaf ears-these are the thoughts which I desire to connect with our text and to commend to your meditation now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. We have here set forth, in the Lord’s heavenward look, the foundation and condition of all true work for God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. We have here set forth, in the Lord’s heavenward look, the foundation and condition of all true work for God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The profound questions which are involved in the fact that, as man, Christ held communion with God in the exercise of faith and aspiration, the same in kind as ours, do not concern us here. I speak to those who believe that Jesus is for us the perfect example of complete manhood, and who therefore believe that He is ‘the leader of faith,’ the head of the long processions of those who in every age have trusted in God and been ‘lightened.’ But, perhaps, though that conviction holds its place in our creeds, it has not been as completely incorporated with our thoughts as it should have been. There has, no doubt, been a tendency, operating in much of our evangelical teaching, and in the common stream of orthodox opinion, to except, half unconsciously, the exercises of the religious life from the sphere of Christ’s example, and we need to be reminded that Scripture presents His vow, ‘I will put my trust in Him,’ as the crowning proof of His brotherhood, and that the prints of His kneeling limbs have left their impressions where we kneel before the throne. True, the relation of the Son to the Father involves more than communion-namely, unity. But if we follow the teaching of the Bible, we shall not presume that the latter excludes the former, but understand that the unity is the foundation of perfect communion, and the communion the manifestation, so far as it can be manifested, of the unspeakable unity. The solemn words which shine like stars-starlike in that their height above us shrinks their magnitude and dims their brightness, and in that they are points of radiance partially disclosing, and separated by, abysses of unlighted infinitude-tell us that in the order of eternity, before creatures were, there was communion, for ‘the Word was with God,’ and there was unity, for ‘the Word was God.’ And in the records of the life manifested on earth the consciousness of unity loftily utters itself in the unfathomable declaration, ‘I and my Father are one’; whilst the consciousness of communion, dependent like ours on harmony of will and true obedience, breathes peacefully in the witness which He leaves to Himself: ‘The Father has not left Me alone, for I do always the things that please Him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We are fully warranted, then, in supposing that that wistful gaze to heaven means, and may be taken to symbolise, our Lord’s conscious direction of thought and spirit to God as He wrought His work of mercy. There are two distinctions to be noted between His communion with God and ours before we can apply the lesson to ourselves. His heavenward look was not the renewal of interrupted fellowship, but rather, as a man standing firmly on firm rock may yet lift his foot to plant it again where it was before, and settle himself in his attitude before he strikes with all his might; so we may say Christ fixes Himself where He always stood, and grasps anew the hand that He always held, before He does the deed of power. The communion that had never been broken was renewed; how much more the need that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " work for God the renewal of the-alas! too sadly sundered-fellowship should ever precede and always accompany our efforts! And again, Christ’s fellowship was with the Father, while ours must be with the Father through the Son. The communion to which we are called is with Jesus Christ, in whom we find God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The manner of that intercourse, and the various discipline of ourselves with a view to its perfecting which Christian prudence prescribes, need not concern us here. As for the latter, let us not forget that a wholesome and wide-reaching self-denial cannot be dispensed with. Hands that are full of gilded toys and glass beads cannot grasp durable riches, and eyes that have been accustomed to glaring lights see only darkness when they look up to the violet heaven with all its stars. As to the former, every part of our nature above the simply animal is capable of God, and the communion ought to include our whole being. Christ is truth for the understanding, authority for the will, love for the heart, certainty for the hope, fruition for all the desires, and for the conscience at once cleansing and law. Fellowship with Him is no indolent passiveness, nor the luxurious exercise of certain emotions, but the contact of the whole nature with its sole adequate object and rightful Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such intercourse, brethren, lies at the foundation of all work for God. It is the condition of all our power. It is the measure of all our success. Without it we may seem to realise the externals of prosperity, but it will be all illusion. With it we may perchance seem to ‘spend our strength for nought’; but heaven has its surprises; and those who toiled, nor left their hold of their Lord in all their work, will have to say at last with wonder, as they see the results of their poor efforts, ‘Who hath begotten me these? behold, I was left alone; these, where had they been?’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Consider in few words the manifold ways in which the indispensable prerequisite of all right effort for Christ may be shown to be communion with Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The heavenward look is the renewal of our own vision of the calm verities in which we trust, the recourse for ourselves to the realities which we desire that others should see. And what is equal in persuasive power to the simple utterance of one’s own intense conviction? He only will infuse his own religion into other minds, whose religion is not a set of hard dogmas, but is fused by the heat of personal experience into a river of living fire. It will flow then, not otherwise. The only claim which the hearts of men will listen to, in those who would win them to spiritual beliefs, is that ancient one: ‘That which we have seen with our eyes, which we have looked upon, declare we unto you.’ Mightier than all arguments, than all ‘proofs of the truth of the Christian religion,’ and penetrating into a sphere deeper than that of the understanding, is the simple proclamation, ‘We have found the Messias.’ If we would give sight to the blind, we must ourselves be gazing into heaven. Only when we testify of that which we see, as one might who, standing in a beleaguered city, discerned on the horizon the filmy dust-cloud through which the spearheads of the deliverers flashed at intervals, shall we win any to gaze with us till they too behold and know themselves set free.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The heavenward look draws new strength from the source of all our might. In our work, dear brethren, contemplating as it ought to do exclusively spiritual results, what we do depends largely on what we are, and what we are depends on what we receive, and what we receive depends on the depth and constancy of our communion with God. ‘The help which is done upon earth He doeth it all Himself.’ We and our organisations are but the channels through which this might is poured; and if we choke the bed with turbid masses of drift and heavy rocks of earthly thoughts, or build from bank to bank thick dams of worldliness compact with slime of sin, how shall the full tide flow through us for the healing of the salt and barren places? Will it not leave its former course silted up with sand, and cut for itself new outlets, while the useless quays that once rang with busy life stand silent, and ‘the cities are solitary that were full of people’? We are",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘The trumpet at Thy lips, the clarionFull of Thy cry, sonorous with Thy breath.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘The trumpet at Thy lips, the clarion",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Full of Thy cry, sonorous with Thy breath.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Let us see to it that by fellowship with Christ we keep the passage clear, and become recipients of the inspiration which shall thrill our else-silent spirits into the blast of loud alarum and the ringing proclamation of the true King.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The heavenward look will guard us from the temptations which surround all our service, and the distractions which lay waste our lives. It is habitual communion with Christ that alone will give the persistency that makes systematic, continuous efforts for Him possible, and yet will keep systematic work from degenerating, as it ever tends to do, into mechanical work. There is no greater virtue in irregular desultory service than in systematised labour. The one is not freer from besetting temptations than the other, only the temptations are of different sorts. Machinery saves manual toil, and multiplies force. But we may have too heavy machinery for what engineers call the boiler power,-too many wheels and shafts for the steam we have to drive them with. What we want is not less organisation, or other sorts of it, but more force. Any organisation will do if we have God’s Spirit breathing through it. None will be better than so much old iron if we have not.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We are ever apt to trust to our work, to do it without a distinct recurrence at each moment to the principles on which it rests, and the motives by which it should be actuated,-to become so absorbed in details that we forget the purpose which alone gives them meaning, to over-estimate the external aspects of it, to lose sight of the solemn truths which make it so grand, and to think of it as commonplace because it is common, as ordinary because it is familiar. And from these most real dangers, which beset us all, there is no refuge but the frequent, the habitual, gaze into the open heavens, which will show us again the realities of things, and bring to our spirits, dwarfed even by habits of goodness, the renewal of former motives by the vision of Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such constant communion will further surround us with an atmosphere through which none of the many influences which threaten our Christian life and our Christian work can penetrate. As the diver in his bell sits dry at the bottom of the sea, and draws a pure air from the free heavens far above him, and is parted from that murderous waste of green death that clings so closely round the translucent crystal walls which keep him safe; so we, enclosed in God, shall repel from ourselves all that would overflow to destroy us and our work, and may by His grace lay deeper than the waters some courses in the great building that shall one day rise, stately and many-mansioned, from out of the conquered waves. For ourselves, and for all that we do for Him, living communion with God is the means of power and peace, of security and success.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It was never more needful than now. Feverish activity rules in all spheres of life. The iron wheels of the car which bears the modern idol of material progress whirl fast, and crush remorselessly all who cannot keep up the pace. Christian effort is multiplied and systematised beyond all precedent. And all these facts make calm fellowship with God hard to compass. The measure of the difficulty is the measure of the need. I, for my part, believe that there are few Christian duties more neglected than that of meditation, the very name of which has fallen of late into comparative disuse, that augurs ill for the frequency of the thing. We are so busy thinking, discussing, defending, inquiring; or preaching, and teaching, and working, that we have no time and no leisure of heart for quiet contemplation, without which the exercise of the intellect upon Christ’s truth will not feed, and busy activity in Christ’s cause may starve, the soul. There are few things which the Church of this day in all its parts needs more than to obey the invitation, ‘Come ye yourselves apart into a lonely place, and rest a while.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ has set us the example. Let our prayers ascend as His did, and in our measure the answers which came to Him will not fail us. For us, too, ‘praying, the heavens’ shall be ‘opened,’ and the peace-bringing spirit fall dove-like on our meek hearts. For us, too, when the shadow of our cross lies black and gaunt upon our paths, and our souls are troubled, communion with heaven will bring the assurance, audible to our ears at least, that God will glorify Himself even in us. If, after many a weary day, we seek to hold fellowship with God as He sought it on the Mount of Olives, or among the solitudes of the midnight hills, or out in the morning freshness of the silent wilderness, like Him we shall have men gathering around us to hear us speak when we come forth from ‘the secret place of the Most High.’ If our prayer, like His, goes before our mighty deeds, the voice that first pierced the skies will penetrate the tomb, and make the dead stir in their grave-clothes. If our longing, trustful look is turned to the heavens, we shall not speak in vain on earth when we say, ‘Be opened!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren, we cannot do without the communion which our Master needed. Do we delight in what strengthened Him? Does our work rest upon the basis of inward fellowship with God which underlay His? Alas! that our Pattern should be our rebuke, and that the readiest way to force home our faults on our consciences should be the contemplation of the life which we say that we try to copy!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We have here pity for the evils we would remove, set forth by the Lord’s sigh. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We have here pity for the evils we would remove, set forth by the Lord’s sigh.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The frequency with which this Evangelist records our Lord’s emotions on the sight of sin and sorrow has been often noticed. In his pages we read of Christ’s grief at the hardness of men’s hearts, of His marvelling because of their unbelief, of His being moved with compassion for an outcast leper and a hungry multitude, of His sighing deeply in His spirit when prejudiced hostility, assuming the appearance of candid inquiry, asked of Him a sign from heaven. All these instances of true human feeling, like His tears at the grave of Lazarus, and His weariness as He sat on the well, and His tired sleep in the stern of the little fishing-boat, and His hunger and His thirst, are very precious as aids in realising His perfect manhood; but they have a worth beyond even that. They show us how the manifold ills and evils of man’s fate and conduct appealed to the only pure heart that ever beat, and how quickly and warmly it, by reason of its purity, throbbed in sympathy with all the woe. One might have thought that in the present case the consciousness that His help was so near would have been sufficient to repress the sigh. One might have thought that the heavenward look would have stayed the tears. But neither the happiness of active benevolence, nor the knowledge of immediate cure, nor the glories above flooding His vision, could lift the burden from His labouring breast. And surely in this too, we may discern a law for all our efforts, that their worth shall be in proportion to the expense of feeling at which they are done. Men predict the harvests in Egypt by the height which the river marks on the gauge of the inundation. So many feet there represent so much fertility. Tell me the depth of a Christian man’s compassion, and I will tell you the measure of his fruitfulness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What was it that drew that sigh from the heart of Jesus? One poor man stood before him, by no means the most sorely afflicted of the many wretched ones whom He healed. But He saw in him more than a solitary instance of physical infirmities. Did there not roll darkly before His thoughts that whole weltering sea of sorrow that moans round the world of which here is but one drop that He could dry up? Did there not rise black and solid, against the clear blue to which He had been looking, the mass of man’s sin, of which these bodily infirmities were but a poor symbol as well as a consequence? He saw, as none but He could bear to see, the miserable realities of human life. His knowledge of all that man might be, of all that the most of men were becoming, His power of contemplating in one awful aggregate the entire sum of sorrows and sins, laid upon His heart a burden which none but He has ever endured. His communion with heaven deepened the dark shadow on earth, and the eyes that looked up to God and saw Him, could not but see foulness where others suspected none, and murderous messengers of hell walking in darkness unpenetrated by mortal sight. And all that pain of clearer knowledge of the sorrowfulness of sorrow, and the sinfulness of sin, was laid upon a heart in which was no selfishness to blunt the sharp edge of the pain nor any sin to stagnate the pity that flowed from the wound. To Jesus Christ, life was a daily martyrdom before death had ‘made the sacrifice complete,’ and He ‘bore our griefs and carried our sorrows’ through many a weary hour before He ‘bare them in His own body on the tree.’ Therefore, ‘Bear ye one another’s burdens, and so fulfil the law’ which Christ obeyed, becomes a command for all who would draw men to Him. And true sorrow, a sharp and real sense of pain, becomes indispensable as preparation for, and accompaniment to, our work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Mark how in us, as in our Lord, the sigh of compassion is to be connected with the look to heaven. It follows upon that gaze. The evils become more real, more terrible, by their startling contrast with the unshadowed light which lives above cloudracks and mists. It is a sharp shock to turn from the free sweep of the heavens, starry and radiant, to the sights that meet us in ‘this dim spot which men call earth.’ Thus habitual communion with God is the root of the truest and purest compassion. It does not withdraw us from our fellow feeling with our brethren, it cultivates no isolation for undisturbed beholding of God. It at once supplies a standard by which to measure the greatness of man’s godlessness, and therefore of his gloom, and a motive for laying the pain of these upon our hearts, as if they were our own. He has looked into the heavens to little purpose who has not learned how bad and how sad the world now is, and how God bends over it in pitying love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And that same fellowship which will clear our eyes and soften our hearts, is also the one consolation which we have when our sense of ‘all the ills that flesh is heir to’ becomes deep nearly to despair. When one thinks of the real facts of human life, and tries to conceive of the frightful meanness and passion and hate and wretchedness that have been howling and shrieking and gibbering and groaning through dreary millenniums, one’s brain reels, and hope seems to be absurdity, and joy a sin against our fellows, as a feast would be in a house next door to where was a funeral. I do not wonder at settled sorrow falling upon men of vivid imagination, keen moral sense, and ordinary sensitiveness, when they brood long on the world as it is. But I do wonder at the superficial optimism which goes on with its little prophecies about human progress, and its rose-coloured pictures of human life, and sees nothing to strike it dumb for ever in men’s writhing miseries, blank failures, and hopeless end. Ah! brethren, if it were not for the heavenward look, how could we bear the sight of earth? ‘We see not yet all things put under Him.’ No! God knows, far enough off from that. Man’s folly, man’s submission to the creatures he should rule, man’s agonies, and man’s transgression, are a grim contrast to the Psalmist’s vision. If we had only earth to look to, despair of the race, expressed in settled melancholy apathy or in fierce cynicism, were the wisest attitude. But there is more within our view than earth; ‘we see Jesus’; we look to the heaven, and as we behold the true Man, we see more than ever, indeed, how far from that pattern we all are; but we can bear the thought of what men as yet have been, when we see that perfect Example of what men shall be. The root and the consolation of our sorrow for men’s evils is communion with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me remind you, too, that still more dangerous than the pity which is not based upon, and corrected by, the look to heaven, is the pity which does not issue in strenuous work. It is easy to excite people’s emotions; but it is perilous for both the operator and the subject, unless they be excited through the understanding, and pass on the impulse to the will and the practical powers. The surest way to petrify a heart is to stimulate the feelings, and give them nothing to do. They will never recover their original elasticity if they have been wantonly drawn forth thus. Coldness, hypocrisy, spurious sentimentalism, and a whole train of affectations and falsehoods follow the steps of an emotional religion, which divorces itself from active work. Pity is meant to impel to help. Let us not be content with painting sad and true pictures of men’s woes,-of the gloomy hopelessness of idolatry, for instance-but let us remember that every time our compassion is stirred, and no action ensues, our hearts are in some measure indurated, and the sincerity of our religion in some degree impaired. White-robed Pity is meant to guide the strong powers of practical help to their work. She is to them as eyes to go before them and point their tasks. They are to her as hands to execute her gentle will. Let us see to it that we rend them not apart; for idle pity is unblessed and fruitless as a sigh cast into the fragrant air, and unpitying work is more unblessed and fruitless still. Let us remember, too, that Christlike and indispensable as Pity is, she is second, and not first. Let us take heed that we preserve that order in our own minds, and in our endeavours to stimulate one another. For if we reverse it, we shall surely find the fountains of compassion drying up long before the wide stretches of thirsty land are watered, and the enterprises which we have sought to carry on by appealing to a secondary motive, languishing when there is most need for vigour. Here is the true sequence which must be observed in our missionary and evangelistic work, ‘Looking up to heaven, He sighed.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear brethren! must we not all acknowledge woful failures in this regard? How much of our service, our giving, our preaching, our planning, has been carried on without one thought of the ills and godlessness we profess to be seeking to cure! If some angel’s touch could annihilate all that portion of our activity, what gaps would be left in all our subscription lists, our sermons, and our labours both at home and abroad! Annihilate, do I say? It is done already. Such work is nothing, and comes to nothing. ‘Yea, it shall not be planted; yea, it shall not be sown; and He shall also blow upon it, and it shall wither.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The hindrances to such abiding consciousness of and pity for the world’s woes run all down to the one tap-root of all sin, selfishness. The remedies run all up to the common form of all goodness, the self-absorbing communion with Jesus Christ. And besides that mother-tincture of everything wrong, subsidiary impediments may be found in the small amounts of time and effort which any of us give to bring the facts of the world’s condition vividly before our minds. The destruction of all emotion is the indolent acquiescence in general statements which we are too lazy or busy to break up into individual cases. To talk about hundreds of millions of idolaters leaves the heart untouched. But take one soul out of all that mass, and try to feel what his life is in its pitchy darkness, broken only by lurid lights of fear and sickly gleams of hope, in its passions ungoverned by love, its remorse uncalmed by pardon, its affections feeling like the tendrils of some climbing plant for the stay they cannot find, and in the cruel blackness that swallows it up irrevocably at last. Follow it from the childhood that knows no discipline to the grave that knows no waking, and will not the solitary instance come nearer our hearts than the millions? But however that may be, the sluggishness of our imaginations, the very familiarity with the awful facts, our own feeble hold on Christ, our absorption in personal interests, the incompleteness and desultoriness of our communion with our Lord, do all concur with our natural selfishness to make a sadly large proportion of our apparent labours for God and men utterly cold and unfeeling, and therefore utterly worthless. Has the benighted world ever caused us as much pain as some trivial pecuniary loss has done? Have we ever felt the smart of the gaping wounds through which our brothers’ blood is pouring forth as much as we do the tiniest scratch on our own fingers? Does it sound to us like exaggerated rhetoric when a prophet breaks out, ‘Oh that my head were waters, and mine eyes a fountain of tears, that I might weep night and day!’ or when an Apostle in calmer tones declares, ‘I have great heaviness and continual sorrow of heart’? Some seeds are put to steep and swell in water, that they may be tested before sowing. The seed which we sow will not germinate unless it be saturated with our tears. And yet the sorrow must be blended with joy; for it is glad labour which is ordinarily productive labour-just as the growing time is the changeful April, and one knows not whether the promise of harvest is most sure in the clouds that drop fatness, or in the sunshine that makes their depths throb with whitest light, and touches the moist-springing blades into emeralds and diamonds. The gladness comes from the heavenward look, the pain is breathed in the deep-drawn sigh; both must be united in us if we would ‘approve ourselves as the servants of God-as sorrowful, yet always rejoicing.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. We have here loving contact with those whom we would help set forth in the Lord’s touch. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. We have here loving contact with those whom we would help set forth in the Lord’s touch.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The reasons for the variety observable in Christ’s method of communicating supernatural blessing were, probably, too closely connected with unrecorded differences in the spiritual conditions of the recipients to be distinctly traceable by us. But though we cannot tell why a particular method was employed in a given case, why now a word, and now a symbolic action, now the touch of His hand, and now the hem of His garment, appeared to be the vehicles of His power, we can discern the significance of these divers ways, and learn great lessons from them all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " His touch was sometimes obviously the result of what one may venture to call instinctive tenderness, as when He lifted the little children in His arms and laid His hands upon their heads. It was, I suppose, always the spontaneous expression of love and compassion, even when it was something more. The touch of His hand on the ghastly glossiness of the leper’s skin was, no doubt, His assertion of priestly functions, and of elevation above all laws of defilement; but what was it to the poor outcast, who for years had never felt the warm contact of flesh and blood? It always indicated that He Himself was the source of healing and life. It always expressed His identification of Himself with sorrow and sickness. So that it is in principle analogous to, and may be taken as illustrative of, that transcendent act whereby He ‘became flesh, and dwelt among us.’ Indeed, the very word by which our Lord’s taking the blind man by the hand is described in the chapter following our text, is that employed in the Epistle to the Hebrews when, dealing with the true brotherhood of Jesus, the writer says, ‘He took not hold of angels, but of the seed of Abraham He taketh hold.’ Christ’s touch is His willing contact with man’s infirmities and sins, that He may strengthen and hallow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And the lesson is one of universal application. Wherever men would help their fellows, this is a prime requisite, that the would-be helper should come down to the level of those whom he desires to aid. If we wish to teach, we must stoop to think the scholar’s thoughts. The master who has forgotten his boyhood will have poor success. If we would lead to purer emotions, we must try to enter into the lower feelings which we labour to elevate. It is of no use to stand at the mouth of the alleys we wish to cleanse, with our skirts daintily gathered about us, and smelling-bottle in hand, to preach homilies on the virtues of cleanliness. We must go in among the filth, and handle it, if we want to have it cleared away. The degraded must feel that we do not shrink from them, or we shall do them no good. The leper, shunned by all, and ashamed of himself because everybody loathes him, hungers in his hovel for the grasp of a hand that does not care for defilement, if it can bring cleansing. Even in regard to common material helps the principle holds good. We are too apt to cast our doles to the poor like bones to a dog, and then to wonder at what we are pleased to think men’s ingratitude. A benefit may be so conferred as to hurt more than a blow; and we cannot be surprised if so-called charity which is given with contempt and a sense of superiority, should be received with a scowl, and chafe a man’s spirit like a fetter. Such gifts bless neither him who gives nor him who takes. We must put our hearts into them, if we would win hearts by them. We must be ready, like our Master, to take blind beggars by the hand, if we would bless or help them. The despair and opprobrium of our modern civilisation; the gulf growing wider and deeper between Dives and Lazarus, between Belgravia and Whitechapel; the mournful failure of legalised help, and of delegated efforts to bridge it over, the darkening ignorance, the animal sensuousness, the utter heathenism that lives in every town of England, within a stone’s-throw of Christian houses, and near enough to hear the sound of public worship-will yield to nothing but that sadly forgotten law which enjoins personal contact with the sinful and the suffering, as one chief condition of raising them from the black mire in which they welter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the same law has its special application in regard to the enterprise of Christian missions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It defines the spirit in which Christian men should proclaim the Gospel. The effect of much well-meant Christian effort is simply to irritate. People are very quick to catch delicate intonations which reveal a secret sense, ‘how much better, wiser, more devout I am than these people!’ and wherever a trace of that appears in our work, the good of it is apt to be marred. We all know how hackneyed the charge of spiritual pride and Pharisaic self-complacency is, and, thank God, how unjust it often is. But averse as men may be to the truths which humble, and willing as they may be to assume that the very effort on our parts to present these to others implies a claim which they resent, we may at least learn from the threadbare calumny, what strikes men about our position, and what rouses their antagonism to us. It is allowable to be taught by our enemies, especially when it is such a lesson as this, that we must carefully divest our evangelistic work of apparent pretensions to superiority, and take our stand by the side of those to whom we speak. We cannot lecture men into the love of Christ, We can win them to it only by showing Christ’s love to them; and not the least important element in that process is the exhibition of our own love. We have a Gospel to speak of which the very heart is that the Son of God stooped to become one with the lowliest and most sinful; and how can that Gospel be spoken with power unless we too stoop like Him? We have to echo the invitation, ‘Learn of Me, for I am lowly in heart’; and how can such divine words flow from lips into which like grace has not been poured? Our theme is a Saviour who shrank from no sinner, who gladly consorted with publicans and harlots, who laid His hand on pollution, and His heart, full of God and of love, on hearts reeking with sin; and how can our message correspond with our theme if, even in delivering it, we are saying to ourselves, ‘The Temple of the Lord are we: this people which knoweth not the law is cursed’? Let us beware of the very real danger which besets us in this matter, and earnestly seek to make ourselves one with those whom we would gather into Christ, by actual familiarity with their condition, and by identification of ourselves in feeling with them, after the example of that greatest of Christian teachers who became ‘all things to all men, that by all means he might gain some’; after the higher example, which Paul followed, of that dear Lord who, being Highest, descended to the lowest, and in the days of His humiliation was not content with speaking words of power from afar, nor abhorred the contact of mortality and disease and loathsome corruption; but laid His hands upon death, and it lived; upon sickness, and it was whole; on rotting leprosy, and it was sweet as the flesh of a little child.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The same principle might be further applied to our Christian work, as affecting the form in which we should present the truth. The sympathetic identification of ourselves with those to whom we try to carry the Gospel will certainly make us wise to know how to shape our message. Seeing with their eyes, we shall be able to graduate the light. Thinking their thoughts, and having in some measure succeeded, by force of sheer community of feeling, in having, as it were, got inside their minds, we shall unconsciously, and without effort, be led to such aspects of Christ’s all-comprehensive truth as they most need. There will be no shooting over people’s heads, if we love them well enough to understand them. There will be no toothless generalities, when our interest in men keeps their actual condition and temptations clear before us. There will be no flinging fossil doctrines at them from a height, as if Christ’s blessed Gospel were, in another than the literal sense, ‘a stone of offence,’ if we have taken our place on their level. And without such sympathy, these and a thousand other weaknesses and faults will certainly vitiate much of our Christian effort.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me not be misunderstood when I speak of adapting our presentation of the Gospel to the wants of those to whom we carry it. That general statement may express the plainest dictate of Christian prudence or the most dangerous practical error. The one great truth of the Gospel wants no adaptation, by our handling, to any soul of man. It is fitted for all, and demands only plain, loving, earnest statement. There must be no tampering with central verities, nor any diplomatic reserve on the plea of consulting the needs of the men whom we address. Every sinful spirit needs the simple Gospel of salvation by Jesus Christ more than it needs anything else. Nor does adaptation mean deferential stretching a point to meet man’s wishes in our presentation of the truth. Their wishes have to be contravened, that their wants may be met. The truth which a man or a generation requires most is the truth which he or it likes least; and the true Christian teacher’s adaptation of his message will consist quite as much in opposing the desires and contradicting the lies, as in seeking to meet the felt wants, of the world. Nauseous medicines or sharp lancets are adapted to the sick man, quite as truly as pleasant food and soothing ointment.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But remembering all this, we still have a wide field for the operation of practical wisdom and loving common-sense, in determining the form of our message and the manner of our action. And not the least important of qualifications for solving the problems connected therewith is cheerful identification of ourselves with the thoughts and feelings of those whom we would fain draw to the love of God. Such contact with men will win their hearts, as well as soften ours, It will make them willing to hear, as well as us wise to speak. It will enrich our own lives with wide experience and multiplied interests. It will lift us out of the enchanted circle which selfishness draws around us. It will silently proclaim the Lord from whom we have learnt it. The clasp of the hand will be precious, even apart from the virtue that may flow from it, and may be to many a soul burdened with a consciousness of corruption, the dawning of belief in a love that does not shrink even from its foulness. Let us preach the Lord’s touch as the source of all cleansing. Let us imitate it in our lives, that ‘if any will not hear the word, they may without the word be won.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. We have here the true healing power and the consciousness of wielding it set forth in the Lord’s authoritative word. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. We have here the true healing power and the consciousness of wielding it set forth in the Lord’s authoritative word.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "All the rest of His action was either the spontaneous expression of His true participation in human sorrow, or a merciful veiling of His glory that sense-bound eyes might see it the better. But the word was the utterance of His will, and that was omnipotent. The hand laid on the sick, the blind or the deaf was not even the channel of His power. The bare putting forth of His energy was all-sufficient. In these we see the loving, pitying man. In this blazes forth, yet more loving, yet more compassionate, the effulgence of manifest God. Therefore so often do we read the very syllables with which His ‘voice then shook the earth,’ vibrating through all the framework of the material universe. Therefore do the Gospels bid us listen when He rebukes the fever, and it departs; when He says to the demons ‘Go,’ and they go; when one word louder in its human articulation than the howling wind hushes the surges; when ‘Talitha cumi’ brings back the fair young spirit from dreary wanderings among the shades of death. Therefore was it a height of faith not found in Israel when the Gentile soldier, whose training had taught him the power of absolute authority, as heathenism had driven him to long for a man who should speak with the imperial sway of a god, recognised in His voice an all-commanding power. From of old, the very signature of divinity has been declared to be, ‘He spake, and it was done’; and He, the breath of whose lips could set in motion material changes, is that Eternal Word, by whom all things were made.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What unlimited consciousness of sovereign dominion sounds in that imperative from His autocratic lips! It is spoken in deaf ears, but He knows that it will be heard. He speaks as the fontal source, not as the recipient channel, of healing. He anticipates no delay, no resistance. There is neither effort nor uncertainty in the curt command. He is sure that He has power, and He is sure that the power is His own.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is no analogy here between us and Him. Alone, fronting the whole race of man, He stands-utterer of a word which none can say after Him, possessor of unshared might, ‘and of His fulness do all we receive.’ But even from that divine authority and solitary sovereign consciousness we may gather lessons of infinite value for all Christian workers. Of His fulness we ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " received, and the power of the word on His lips may teach us that of His word even on ours, as the victorious certainty with which He spake His will of healing may remind us of the confidence with which it becomes us to proclaim His name.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " His will was almighty then. Is it less mighty or less loving now? Does it not gather all the world in the sweep of its mighty purpose of mercy? His voice pierced then into the dull, cold ear of death, and has it become weaker since? His word spoken ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him was enough to banish the foul spirits that run riot, swine-like, in the garden of God in man’s soul, trampling down and eating up its flowers and fruitage; is the word spoken ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him less potent to cast them out? Were not all the mighty deeds which He wrought by the breath of His lips on men’s bodies prophecies of the yet mightier ones which His Will of love, and the utterance of that Will by stammering lips, may work on men’s souls? Let us not in our faintheartedness number up our failures, the deaf that will not hear, the dumb that will not speak His praise, nor unbelievingly say, ‘Christ’s own word was mighty, but the word concerning Christ is weak on our lips.’ Not so; our lips are unclean, and our words are weak, but His word-the utterance of His loving Will that men should be saved-is what it always was and always will be. We have it, brethren, to proclaim. Did our Master countenance the faithless contrast between the living force of His word when He dwelt on earth, and the feebleness of it as He speaks through His servant? If He did, what did He mean when He said, ‘He that believeth on Me, the works that I do shall he do also, and greater works than these shall he do, because I go unto the Father’? And the reflection of Christ’s triumphant consciousness of power should irradiate our spirits as we do His work, like the gleam from gazing on God’s glory which shone on the lawgiver’s stern face while he talked with men. We have everything to assure us that we cannot fail. The manifest fitness of the Gospel to be the food of all souls; the victories of nineteen centuries, which at least prove that all conditions of society, all classes of civilisation, all varieties of race, all peculiarities of individual temperament, all depths of degradation and distances of alienation, are capable of receiving the word, which, like corn, can grow in every latitude, and, though it be an exotic everywhere, can anywhere be naturalised; the firm promises of unchanging faithfulness, the universal aspect of Christ’s work, the prevalence of His continual intercession, the indwelling of His abiding Spirit, and, not least, the unerring voice of our own experience of the power of the truth to bless and save-all these are ours. In view of these, what should make us doubt? Unwavering confidence is the only attitude that corresponds to such certainties. We have a rock to build on; let us build on it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rock. Putting fear and hesitancy far from us, let us gird ourselves with the joyful strength of assured victory, striking as those who know that conquest is bound to their standard, and who through all the dust of the field see the fair vision of the final triumph. The work is done before we begin it. ‘It is finished’ was a clarion blast proclaiming that all was won when all seemed lost. Weary ages have indeed to roll away before the great voice from heaven shall declare, ‘It is done’; but all that lies between the two is but the gradual unfolding and appropriating of the results which are already secured. The ‘strong man’ is bound; what remains is but the ‘spoiling of his house.’ The head is bruised; what remains is but the dying lashing of the snaky horror’s powerless coils. ‘I send you to reap that whereon ye bestowed no labour.’ The tearful sowing in the stormy winter’s day has been done by the Son of Man. For us there remains the joy of harvest-hot and hard work, indeed, but gladsome too.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, however languor and despondency may sometimes tempt us, thinking of slow advancement and of dying men who fade from the place of the living before the gradual light has reached their eyes, our duty is plain-to be sure that the word we carry cannot fail. You remember the old story how, when Jerusalem was in her hour of direst need, and the army of Babylon lay around her battered walls, the prophet was bid to buy ‘the field that is in Anathoth, in the country of Benjamin,’ for a sign that the transient fury of the invader would be beaten back, that Israel might again dwell safely in the land. So with us, the host of our King’s enemies comes up like a river strong and mighty; but all this world, held though it be by the usurper is still ‘Thy land, O Immanuel,’ and over it all Thy peaceful rule shall be established! Many things in this day tempt the witnesses of God to speak with doubting voice. Angry opposition, contemptuous denial, complacent assumption that a belief in old-fashioned evangelical truth is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ipso facto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a proof of mental weakness, abound. Let them not rob us of our confidence. Shame on us if we let ourselves be frightened from it by a sarcasm or a laugh! Do you fall back on all these grounds for assured reliance to which I have referred, and make the good old answer yours, ‘Why, herein is a marvellous thing, that ye know not whence He is, and yet-He hath opened mine eyes’! Trust the word which you have to speak. Speak it and work for its diffusion as if you did trust it. Do not preach it as if it were a notion of your own. In so far as it is, it will share the fate of all human conceptions of divine realities-’will have its day, and cease to be.’ Do not speak it as if it were some new nostrum for curing the ills of humanity, which might answer or might not. Speak it as if it were what it is-’the word of God which liveth and abideth for ever.’ Speak it as if you were what you are, neither its inventors nor its discoverers, but only its messengers, who have but to ‘preach the preaching which He bids’ you. And to all the widespread questionings of this day, filmy and air-filling as the gossamers of an autumn evening, to all the theories of speculation, and all the panaceas of unbelieving philanthropy, present the solid certainties of your inmost experience, and the yet more solid certainty of that all-loving name and all-sufficient work on which these repose. ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that we are of God, and the whole world lieth in wickedness. And we know that the Son of God is come.’ Then our proclamation, ‘This is the true God and eternal life,’ will not be in vain; and our loving entreaty, ‘Keep yourselves from idols,’ will be heard and yielded to in many a land.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The sum of the whole matter is briefly this. The root of all our efficiency in this great task to which we, unworthy, have been called, is in fellowship with Jesus Christ. ‘The branch cannot bear fruit of itself; without Me ye can do nothing.’ Living near Him, and growing like Him by gazing upon Him, His beauty will pass into our faces, His tender pity into our hearts, His loving identification of Himself with men’s pains and sins will fashion our lives; and the word which He spoke with authority and assured confidence will be strong when we speak it with like calm certainty of victory. If the Church of Christ will but draw close to her Lord till the fulness of His life and the gentleness of His pity flow into her heart and limbs, she will then be able to breathe the life which she has received into the prostrate bulk of a dead world. Only she must do as the meekest of the prophets did in a like miracle. She must not shrink from the touch of the cold clay nor the odour of incipient corruption, but lip to lip and heart to heart must lay herself upon the dead and he will live.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The pattern for our work, dear brethren, is before us in the Lord’s look, His sigh, His touch, His word. If we take Him for the example, and Him for the motive, Him for the strength, Him for the theme, Him for the reward, of our service, we may venture to look to Him as the prophecy of our success, and to be sure that when our own faint hearts or an unbelieving world question the wisdom of our enterprise or the worth of our efforts, we may answer as He did, ‘Go and show again those things which ye do hear and see; the blind receive their sight, and the lame walk, the lepers are cleansed, and the deaf hear, the dead are raised up, and the poor have the Gospel preached unto them.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:31-37 Here is a cure of one that was deaf and dumb. Those who brought this poor man to Christ, besought him to observe the case, and put forth his power. Our Lord used more outward actions in the doing of this cure than usual. These were only signs of Christ's power to cure the man, to encourage his faith, and theirs that brought him. Though we find great variety in the cases and manner of relief of those who applied to Christ, yet all obtained the relief they sought. Thus it still is in the great concerns of our souls.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he took him aside from the multitude - Why this was done we have no means of information. It might have been to conceal from the multitude everything respecting the \"manner\" of cure, in order that none might attempt to cure in a similar way.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he put his fingers into his ears ... - Why this was done it has been found exceedingly difficult to explain. Jesus had power at once to open his ears and loose his tongue, but for some cause he chose to accompany it with a sign. This was intended, probably, simply to denote that the power of healing came from him; to satisfy the man by the touch that he had this power, and that it could come from no other quarter. Our Saviour often used signs in this way to denote his power to heal. See Mark 8:23; John 9:6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he put his fingers into his ears ... - Why this was done it has been found exceedingly difficult to explain. Jesus had power at once to open his ears and loose his tongue, but for some cause he chose to accompany it with a sign. This was intended, probably, simply to denote that the power of healing came from him; to satisfy the man by the touch that he had this power, and that it could come from no other quarter. Our Saviour often used signs in this way to denote his power to heal. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 8:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "33. And he took him aside from the multitude—As in another case He \"took the blind man by the hand and led him out of the town\" (Mr 8:23), probably to fix his undistracted attention on Himself, and, by means of certain actions He was about to do, to awaken and direct his attention to the proper source of relief.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and put his fingers into his ears—As his indistinct articulation arose from his deafness, our Lord addresses Himself to this first. To the impotent man He said, \"Wilt thou be made whole?\" to the blind men, \"What will ye that I shall do unto you?\" and \"Believe ye that I am able to do this?\" (Joh 5:6; Mt 20:32; 9:28). But as this patient could hear nothing, our Lord substitutes symbolical actions upon each of the organs affected.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he spit and touched his tongue—moistening the man's parched tongue with saliva from His own mouth, as if to lubricate the organ or facilitate its free motion; thus indicating the source of the healing virtue to be His own person. (For similar actions, see Mr 8:23; Joh 9:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 7:31\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 7:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he took him aside from the multitude,.... To shun all appearance of ostentation and vain glory: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and put his fingers into his ears; the finger of his right hand into his left ear, and the finger of his left hand into his right ear: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he spit and touched his tongue; that is, either he spit upon his tongue, for so the Vulgate Latin renders it, \"spitting he touched his tongue\"; and the Persic version thus, \"he cast his spittle on his tongue\"; or rather, he spit on his finger, and touched his tongue with it. These actions were not done as means of healing, or as having any natural virtue, or tendency in them, to effect a cure; but to show the power of Christ, that by the mere touch of his finger, and by the spittle of his mouth, as well as by laying on of hands, as was desired, and by a word speaking, he could at once remove this, or any such disorder. The taking this man aside from the multitude, is an emblem of the Lord's separating his people from the rest of the world, when he calls them by his grace; for as they are distinguished from others, in the choice of them in Christ, and in redemption by him; so in the effectual calling, they are bid to come out from among them, and by the power of divine grace, they are brought out from among them, and give up themselves to Christ, and to his churches: and Christ's putting his fingers into the ears of this man, represents the exertion of his power, and his removing by the finger of his Spirit, the obstructions of spiritual hearing; or rather, the planting of the spiritual ear, or forming a principle ot spiritual nearing in the soul: and his touching his tongue with the spittle of his mouth, may lead us to observe the application of his word, through the efficacy of his grace, as a means of loosing his tongue and opening his lips to show forth his praise. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he spit and touched his tongue; that is, either he spit upon his tongue, for so the Vulgate Latin renders it, \"spitting he touched his tongue\"; and the Persic version thus, \"he cast his spittle on his tongue\"; or rather, he spit on his finger, and touched his tongue with it. These actions were not done as means of healing, or as having any natural virtue, or tendency in them, to effect a cure; but to show the power of Christ, that by the mere touch of his finger, and by the spittle of his mouth, as well as by laying on of hands, as was desired, and by a word speaking, he could at once remove this, or any such disorder. The taking this man aside from the multitude, is an emblem of the Lord's separating his people from the rest of the world, when he calls them by his grace; for as they are distinguished from others, in the choice of them in Christ, and in redemption by him; so in the effectual calling, they are bid to come out from among them, and by the power of divine grace, they are brought out from among them, and give up themselves to Christ, and to his churches: and Christ's putting his fingers into the ears of this man, represents the exertion of his power, and his removing by the finger of his Spirit, the obstructions of spiritual hearing; or rather, the planting of the spiritual ear, or forming a principle ot spiritual nearing in the soul: and his touching his tongue with the spittle of his mouth, may lead us to observe the application of his word, through the efficacy of his grace, as a means of loosing his tongue and opening his lips to show forth his praise. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he took him aside from the multitude, and put his fingers into his ears, and he spit, and touched his tongue;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπολαβόμενος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., withdrawing him from the crowd apart. Many reasons have been assigned for this procedure. The true reason, doubtless, is that Jesus did not wish to be drawn into a new ministry of healing on a large scale (Weiss, Schanz).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔβαλε τοὺς δακτύλους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.: one finger of the right hand into one ear, another of the left hand into the other, on account of the narrowness and depth of the hearing faculty, that He might touch it (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διὰ τὸ στενὸν καὶ βαθὺ τῆς ἀκοῆς ἵνα θίξῃ ταύτης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Euthy. Zig.). Deafness is first dealt with; it was the primary evil.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πτύσας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", spitting; on what, the tongue of the dumb man as on the eyes of the blind (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")? So Meyer. Or on His own finger, with which He then touched the tongue? So Weiss, Schanz, Kloster., Holtz. (H. C.), Keil. Mk. leaves us here to our own conjectures, as also in reference to the import of these singular acts of Jesus. Probably they were meant to rouse interest and aid faith in the dull soul of the sufferer. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Trench, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Notes on the Miracles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "aside from the multitude",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Why? (1) Some think it was to avoid all show and ostentation; (2) others, to prevent a publicity which might bring together the Gentiles in crowds; (3) others, far more probably, that apart from the interruptions of the crowd the man might be more recipient of deep and lasting impressions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and put his fingers into his ears",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In this man’s case there were evidently circumstances which rendered it necessary that his cure should be (1) gradual, and (2) effected by visible signs. And so our Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") took him aside from the multitude; (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") put His fingers into his ears, (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") touched his tongue with the moisture of His mouth (comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 2:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "d",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") looked up to heaven (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and sighed (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") spake the one word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephphatha",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 5:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀπολαβόμενος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "taking him aside",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The many outward acts [circumstances] which Jesus employed in this place, and the looks of others, who were healed, stood in the place of words [a sermon] to this deaf man, until he began to hear, inasmuch as Jesus was thereby healing his soul also. [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He imparted to the deaf man His healing power first through the avenue of the eyes, then next of the ears",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—Harm. p. 343.] Comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " concerning ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the blind",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " man.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πτύσας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spitting",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The saliva is clean and salutary in its uses.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 33.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he took him aside from the multitude privately",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was done, no doubt, to fix the attention of the afflicted man upon himself, and upon the fact that he was about to act upon his ears and his tongue. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he put",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἔβαλε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - literally, cast or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thrust - his fingers into his",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thrust - ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "his fingers into his",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "ears.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The action was very significant. It was as though he said, \"I am about to open a passage for hearing through these ears.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he spat, and touched his tongue;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, he touched his tongue with saliva from his own sacred lips. These symbolical actions must have had a great meaning for the afflicted man. They were a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "tableau vivant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", an acted metaphor, teaching him what he might expect from the mercy of Christ. The analogy of the miracle recorded in St. John (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") should be noticed here. It is an interesting circumstance (noticed in the 'Speaker's Commentary') that, in the Latin Church, the officiating priest touches the nostrils and ears of those who are to be baptized, with saliva from his own mouth. We may be assured that, in the case before us, these signs used by our Lord were intended to awaken the afflicted man's faith, and to stir up in him the lively expectation of a blessing. Mark 7:33",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Put (ἔβαλεν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., threw: thrust. ",
        "children": []
      }
    ]
  }
]