[{"header":"The Mountains of Israel to Be Blessed"},{"num":36,"verse":"“And you, son of man, prophesy to the mountains of Israel and say, ‘You mountains of Israel, hear the word of the Lord. "},{"num":2,"verse":"Thus says the Lord God, “Because the enemy has said of you, ‘Aha!’ and, ‘The ancient heights have become our property,’ "},{"num":3,"verse":"therefore prophesy and say, ‘Thus says the Lord God, “For good reason they have made you a desolation, and they crushed you from every side so that you would become a possession of the rest of the nations and you have become the talk and the whispering of the people.”’” "},{"num":4,"verse":"Therefore, O mountains of Israel, hear the word of the Lord God. Thus says the Lord God to the mountains and to the hills, to the ravines and to the valleys, to the desolate ruins and to the deserted cities which have become prey and a mockery to the rest of the nations which surround you, "},{"num":5,"verse":"therefore thus says the Lord God, “Most certainly in the fire of My jealousy (love for that which is Mine) I have spoken against the rest of the nations and against all Edom, who appropriated My land for themselves as a possession with wholehearted joy and with uttermost contempt, so that they might empty it out [and possess it] as prey.” "},{"num":6,"verse":"Therefore prophesy concerning the land of Israel and say to the mountains and to the hills, to the ravines and to the valleys, “Thus says the Lord God, ‘Behold, I have spoken in My jealousy (love for that which is Mine) and in My wrath because you have endured the [shameful] insults of the nations.’ "},{"num":7,"verse":"Therefore thus says the Lord God, ‘I have lifted up My hand and sworn [an oath] that the nations that are around you will themselves endure their [shameful] insults. "},{"num":8,"verse":"But you, O mountains of Israel, will put out your branches and bear your fruit to My people Israel; for they will soon come [home]. "},{"num":9,"verse":"For, behold, I am for you, and I will turn to you [in favor], and you shall be cultivated and sown. "},{"num":10,"verse":"I will multiply people on you, all the house of Israel, [indeed] all of it; the cities shall be inhabited and the ruins will be rebuilt. "},{"num":11,"verse":"I will multiply on you man and animal; and they will increase and be fruitful. And I will cause you to be inhabited as you were formerly, and I will do better [things] for you than at your beginning. Then you will know [with great confidence] that I am the Lord. "},{"num":12,"verse":"Yes, [O mountains of Israel] I will cause men—My people Israel—to walk on you and take possession of you, so that you will become their inheritance and never again bereave them of children.’"},{"num":13,"verse":"“Thus says the Lord God, ‘Because they say to you, “You [O land] are a devourer of people and have bereaved your nation of children,” "},{"num":14,"verse":"therefore you will no longer devour people, and no longer bereave your nation of children,’ says the Lord God. "},{"num":15,"verse":"I will not let you hear insults from the nations anymore, nor will you bear disgrace from the peoples any longer, nor will you cause your nation to stumble [through idolatry] any longer,” says the Lord God.’”"},{"num":16,"verse":"Moreover, the word of the Lord came to me, saying, "},{"num":17,"verse":"“Son of man, when the house of Israel was living in their own land, they defiled it by their [own] behavior and by their [idolatrous] actions. Their conduct before Me was like the uncleanness of a woman during her [physical] impurity. "},{"num":18,"verse":"So I poured out My wrath on them for the blood which they had shed on the land and because they had defiled it with their idols. "},{"num":19,"verse":"Also I scattered them among the nations and they were dispersed throughout the countries. I judged and punished them in accordance with their conduct and their [idolatrous] behavior. "},{"num":20,"verse":"When they came to the nations wherever they went, they profaned My holy name, because it was said of them, ‘These are the people of the Lord; yet they have come out of His land.’ "},{"num":21,"verse":"But I had concern for My holy name, which the house of Israel had profaned among the nations where they went."},{"header":"Israel to Be Renewed for His Name’s Sake"},{"num":22,"verse":"“Therefore say to the house of Israel, ‘Thus says the Lord God, “It is not for your sake, O house of Israel, that I am about to act, but for My holy name, which you have profaned among the nations where you went. "},{"num":23,"verse":"I will vindicate the holiness of My great name which has been profaned among the nations, which you have profaned among them. Then the nations will know [without any doubt] that I am the Lord,” says the Lord God, “when I prove Myself holy among you in their sight. "},{"num":24,"verse":"For I will take you from the nations and gather you from all the countries and bring you into your own land. "},{"num":25,"verse":"Then I will sprinkle clean water on you, and you will be clean; I will cleanse you from all your uncleanness and from all your idols. "},{"num":26,"verse":"Moreover, I will give you a new heart and put a new spirit within you, and I will remove the heart of stone from your flesh and give you a heart of flesh. "},{"num":27,"verse":"I will put my Spirit within you and cause you to walk in My statutes, and you will keep My ordinances and do them. "},{"num":28,"verse":"You will live in the land that I gave to your fathers; and you will be My people, and I will be your God. "},{"num":29,"verse":"I will also save you from all your uncleanness, and I will call for the grain and make it abundant, and I will not bring famine on you. "},{"num":30,"verse":"I will multiply the fruit of the tree and the produce of the field, so that you will not suffer again the disgrace of famine among the nations. "},{"num":31,"verse":"Then you will remember [clearly] your [own] evil ways and your deeds that were not good, and you will loathe yourselves in your own sight for your sins and for your outrageous atrocities. "},{"num":32,"verse":"I am not doing this for your sake,” says the Lord God. “Let that be known to you. Be ashamed and humiliated for your [wicked] ways, O house of Israel!”"},{"num":33,"verse":"‘Thus says the Lord God, “On the day that I cleanse you from all your sins I will also cause the cities [of Israel] to be inhabited, and the ruins will be rebuilt. "},{"num":34,"verse":"The desolate land will be cultivated instead of being a desolation in the sight of everyone who passes by. "},{"num":35,"verse":"Then they will say, ‘This land that was deserted and desolate has become like the garden of Eden; and the waste, desolate, and ruined cities are fortified and inhabited.’ "},{"num":36,"verse":"Then the nations that are left around you will know that I the Lord have rebuilt the ruined places and planted that which was desolate. I the Lord have spoken, and will do it.”"},{"num":37,"verse":"‘Thus says the Lord God, “This too I will let the house of Israel ask Me to do for them: I will increase their people like a flock. "},{"num":38,"verse":"Like the flock for sacrifices, like the flock at Jerusalem during her appointed feasts, so will the desolate cities be filled with flocks of people. Then they will know [with confident assurance] that I am the Lord.”’”"}]