[{"header":"Israel to Come Home"},{"num":36,"verse":"“Human, prophesy to the mountains of Israel and say: ‘Mountains of Israel, hear the word of the Lord. "},{"num":2,"verse":"This is what the Lord God says: The enemy has said about you, “Now the old places to worship gods have become ours.”’ "},{"num":3,"verse":"So prophesy and say: ‘This is what the Lord God says: They have made you an empty ruin and have crushed you from all around. So you became a possession of the other nations. People have talked and whispered against you. "},{"num":4,"verse":"So, mountains of Israel, hear the word of the Lord God. The Lord God speaks to the mountains, hills, ravines, and valleys, to the empty ruins and abandoned cities that have been robbed and laughed at by the other nations. "},{"num":5,"verse":"This is what the Lord God says: I speak in hot anger against the other nations. I speak against the people of Edom, who took my land for themselves with joy and with hate in their hearts. They forced out the people and took their pastureland.’ "},{"num":6,"verse":"So prophesy about the land of Israel and say to the mountains, hills, ravines, and valleys: ‘This is what the Lord God says: I speak in my jealous anger, because you have suffered the insults of the nations. "},{"num":7,"verse":"So this is what the Lord God says: I promise that the nations around you will also have to suffer insults."},{"num":8,"verse":"“‘But you, mountains of Israel, will grow branches and fruit for my people, who will soon come home. "},{"num":9,"verse":"I am concerned about you; I am on your side. You will be plowed, and seed will be planted in you. "},{"num":10,"verse":"I will increase the number of people who live on you, all the people of Israel. The cities will have people living in them, and the ruins will be rebuilt. "},{"num":11,"verse":"I will increase the number of people and animals living on you. They will grow and have many young. You will have people living on you as you did before, and I will make you better off than at the beginning. Then you will know that I am the Lord. "},{"num":12,"verse":"I will cause my people Israel to walk on you and own you, and you will belong to them. You will never again take their children away from them."},{"num":13,"verse":"“‘This is what the Lord God says: People say about you, “You eat people and take children from your nation.” "},{"num":14,"verse":"But you will not eat people anymore or take away the children, says the Lord God. "},{"num":15,"verse":"I will not make you listen to insults from the nations anymore; you will not suffer shame from them anymore. You will not cause your nation to fall anymore, says the Lord God.’”"},{"header":"The Lord Acts for Himself"},{"num":16,"verse":"The Lord spoke his word to me again, saying: "},{"num":17,"verse":"“Human, when the nation of Israel was living in their own land, they made it unclean by their ways and the things they did. Their ways were like a woman’s uncleanness in her time of monthly bleeding. "},{"num":18,"verse":"So I poured out my anger against them, because they murdered in the land and because they made the land unclean with their idols. "},{"num":19,"verse":"I scattered them among the nations, and they were spread through the countries. I punished them for how they lived and what they did. "},{"num":20,"verse":"They dishonored my holy name in the nations where they went. The nations said about them, ‘These are the people of the Lord, but they had to leave the land which he gave them.’ "},{"num":21,"verse":"But I had concern for my holy name, which the nation of Israel had dishonored among the nations where they went."},{"num":22,"verse":"“So say to the people of Israel, ‘This is what the Lord God says: Israel, I am going to act, but not for your sake. I will do something to help my holy name, which you have dishonored among the nations where you went. "},{"num":23,"verse":"I will prove the holiness of my great name, which has been dishonored among the nations. You have dishonored it among these nations, but the nations will know that I am the Lord when I prove myself holy before their eyes, says the Lord God."},{"num":24,"verse":"“‘I will take you from the nations and gather you out of all the lands and bring you back into your own land. "},{"num":25,"verse":"Then I will sprinkle clean water on you, and you will be clean. I will cleanse you from all your uncleanness and your idols. "},{"num":26,"verse":"Also, I will teach you to respect me completely, and I will put a new way of thinking inside you. I will take out the stubborn hearts of stone from your bodies, and I will give you obedient hearts of flesh. "},{"num":27,"verse":"I will put my Spirit inside you and help you live by my rules and carefully obey my laws. "},{"num":28,"verse":"You will live in the land I gave to your ancestors, and you will be my people, and I will be your God. "},{"num":29,"verse":"So I will save you from all your uncleanness. I will command the grain to come and grow; I will not allow a time of hunger to hurt you. "},{"num":30,"verse":"I will increase the harvest of the field so you will never again suffer shame among the nations because of hunger. "},{"num":31,"verse":"Then you will remember your evil ways and actions that were not good, and you will hate yourselves because of your sins and your terrible acts that I hate. "},{"num":32,"verse":"I want you to know that I am not going to do this for your sake, says the Lord God. Be ashamed and embarrassed about your ways, Israel."},{"num":33,"verse":"“‘This is what the Lord God says: This is what will happen on the day I cleanse you from all your sins: I will cause the cities to have people living in them again, and the destroyed places will be rebuilt. "},{"num":34,"verse":"The empty land will be plowed so it will no longer be a ruin for everyone who passes by to see. "},{"num":35,"verse":"They will say, “This land was ruined, but now it has become like the garden of Eden. The cities were destroyed, empty, and ruined, but now they are protected and have people living in them.” "},{"num":36,"verse":"Then those nations still around you will know that I, the Lord, have rebuilt what was destroyed and have planted what was empty. I, the Lord, have spoken, and I will do it.’"},{"num":37,"verse":"“This is what the Lord God says: I will let myself be asked by the people of Israel to do this for them again: I will make their people grow in number like a flock. "},{"num":38,"verse":"They will be as many as the flocks brought to Jerusalem during her holy feasts. Her ruined cities will be filled with flocks of people. Then they will know that I am the Lord.”"}]