[{"num":1,"verse":"¶ Now in the first year of Cyrus, king of Persia, that the word of the LORD by the mouth of Jeremiah might be fulfilled, the LORD stirred up the spirit of Cyrus, king of Persia, that he made a proclamation throughout all his kingdom and put it also in writing, saying,"},{"num":2,"verse":"Thus saith Cyrus, king of Persia, The LORD God of the heavens has given me all the kingdoms of the earth, and he has charged me to build him a house at Jerusalem, which is in Judah."},{"num":3,"verse":"Who is there among you of all his people? Let God be with him and let him go up to Jerusalem, which is in Judah, and build the house of the LORD God of Israel (he is God), which is in Jerusalem."},{"num":4,"verse":"And whoever may remain of all the places where they remained a stranger, let the men of his place help him with silver and with gold and with goods and with beasts, with freewill gifts for the house of God that is in Jerusalem."},{"num":5,"verse":"¶ Then rose up the heads of the families of Judah and of Benjamin and the priests and the Levites, of all those whose spirit God woke up to go up to build the house of the LORD which is in Jerusalem."},{"num":6,"verse":"And all those that were about them strengthened their hands with vessels of silver and of gold, with goods and with beasts and with precious things, besides all that was willingly offered."},{"num":7,"verse":"Also Cyrus, the king, brought forth the vessels of the house of the LORD, which Nebuchadnezzar had brought forth out of Jerusalem and had put them in the house of his god."},{"num":8,"verse":"Even those did Cyrus, king of Persia, bring forth by the hand of Mithredath, the treasurer, and numbered them unto Sheshbazzar, the prince of Judah."},{"num":9,"verse":"And this is the number of them: thirty chargers of gold, a thousand chargers of silver, twenty-nine knives,"},{"num":10,"verse":"thirty basins of gold, silver basons of a second sort four hundred and ten, and another thousand vessels."},{"num":11,"verse":"All the vessels of gold and of silver were five thousand four hundred. All these did Sheshbazzar cause to be brought up with those that came up from the captivity of Babylon unto Jerusalem."}]