[{"num":1,"verse":"In the first year of Cyrus, king of Persia, that the word of the Lord by the mouth of Jeremy should be fulfilled (so that the word of the Lord through Jeremiah would be fulfilled), the Lord raised (up) the spirit of Cyrus, king of Persia; and he published a voice in all his realm, yea, by writing, he sent out his letters, (to be read aloud,) and said,"},{"num":2,"verse":"(I,) Cyrus, the king of Persia, saith these things, The Lord God of heaven hath given to me all the realms of [the] earth, and he hath commanded to me, that I should build to him an house in Jerusalem, which is in Judah (and he hath commanded me, to build a House for him in Jerusalem, which is in Judah)."},{"num":3,"verse":"Who is among you of all his people? his God be with him; and go he up into Jerusalem, which is in Judah, and build he (again) the house of the Lord God of Israel; he is God, which is in Jerusalem. (Who is there among you of all his people? his God be with him; and go he up to Jerusalem, which is in Judah, and help he to rebuild the House of the Lord God of Israel; he is the God, who is worshipped in Jerusalem/whose city is Jerusalem.)"},{"num":4,"verse":"And all other men, that dwell wherever in all places, help him; the men of their place help in silver, and gold, and chattel, and sheep, besides that that they offer willfully to the temple of God, which is in Jerusalem. (And let all the other people, wherever they may live in every place, help him; let people from every place help him with silver, and gold, and chattel/and cattle, and sheep, besides what they offer by free will for the Temple of God, which was, and shall be again, in Jerusalem.)"},{"num":5,"verse":"And then [the] princes of the fathers of Judah and of Benjamin rose up, and the priests, and the deacons, and each man whose spirit God raised, for to go up to build (again) the temple of the Lord, that was in Jerusalem. (And then the leaders of the families of the tribes of Judah and of Benjamin, and the priests, and the Levites, and each man whose spirit God had raised up, rose up to go up to rebuild the Temple of the Lord, that was in Jerusalem.)"},{"num":6,"verse":"And all men that were in compass about helped the hands of them (And all the people who were round about helped them), with vessels of silver, and of gold, with their substance, with purtenance of household, and with work beasts, besides, or over, these things which they offered by their (own) free will."},{"num":7,"verse":"And king Cyrus brought forth the vessels of the temple of the Lord (And King Cyrus brought forth the vessels from the Temple of the Lord), which Nebuchadnezzar had taken from Jerusalem, and had set them in the temple of his god."},{"num":8,"verse":"And Cyrus, the king of Persia, brought forth those vessels by the hand of Mithredath, the son of Gizbar; and numbered those to Sheshbazzar, the prince of Judah. (And Cyrus, the king of Persia, put Mithredath, the treasurer, in charge of these vessels; and Mithredath listed them for Sheshbazzar, the governor of Judah.)"},{"num":9,"verse":"And this is the number of the vessels; golden vials, thirty; silveren vials, a thousand; great knives, nine and twenty; (And this is the number of the vessels; thirty gold basins, one thousand silver basins; twenty-nine other kinds of vessels;)"},{"num":10,"verse":"(small) golden basins, thirty; (small) silveren basins, two thousand four hundred and ten; and other vessels, a thousand; (thirty gold bowls; four hundred and ten silver bowls; and a thousand other vessels;)"},{"num":11,"verse":"all the vessels of gold and of silver were five thousand and four hundred. And Sheshbazzar took all these vessels, with them that went up from the transmigration of Babylon, into Jerusalem. (in all, there were five thousand four hundred gold and silver vessels. And Sheshbazzar took all of these vessels with him, when he, and others of the captivity, left Babylon, and went to Jerusalem.)"}]