[[],[{"type":"header","content":"Proclamation of Cyrus"},{"type":"prose","content":"Now in the first year of Cyrus king of Persia [that is, the first year he ruled Babylon], in order to fulfill the word of the  by the mouth of Jeremiah [the prophet], the  stirred up (put in motion) the spirit of Cyrus king of Persia, so that he sent a proclamation throughout all his kingdom, and also  in writing, saying:"}],[{"type":"prose","content":"“Thus says Cyrus king of Persia, ‘The , the God of heaven, has given me all the kingdoms of the earth and He has appointed me to build Him a house at Jerusalem, which is in Judah. "}],[{"type":"prose","content":"Whoever there is among you of all His people, may his God be with him! Let him go up to Jerusalem, which is in Judah and rebuild the house of the , the God of Israel; He is God who is in Jerusalem. "}],[{"type":"prose","content":"In any place where a survivor (Jewish exile) may live, let the men (Gentiles) of that place support him with silver and gold, with goods and cattle, together with freewill offerings for the house of God in Jerusalem.’”"},{"type":"header","content":"Holy Articles Restored"}],[{"type":"prose","content":"Then the heads of the fathers’  of Judah and Benjamin, and the priests and Levites, all those whose spirits God had stirred up, arose to go up and rebuild the house of the  which is in Jerusalem. "}],[{"type":"prose","content":"All those who were around them encouraged them with articles of silver, with gold, with goods, with cattle, and with valuable things, in addition to all that was given as a freewill offering. "}],[{"type":"prose","content":"Also King Cyrus brought out the articles of the house of the , which Nebuchadnezzar had carried away from Jerusalem [when he captured that city] and had put in the house of his gods. "}],[{"type":"prose","content":"And Cyrus, king of Persia, had Mithredath the treasurer bring them out, and he counted them out to Sheshbazzar, the governor (leader) of Judah. "}],[{"type":"prose","content":"And they counted: 30 dishes (basins) of gold, 1,000 dishes of silver, 29 duplicates; "}],[{"type":"prose","content":"30 [small] gold bowls, 410 [small] silver bowls of a second , and 1,000 other articles. "}],[{"type":"prose","content":"All the articles of gold and of silver  5,400. All these Sheshbazzar [the governor] brought up with the exiles who went from Babylon up to Jerusalem."}]]