[{"num":1,"verse":"1 Cyrus sendeth again the people that was in captivity,  8 and restoreth them their holy vessels."},{"num":1,"verse":"Now in the first year of Cyrus King of Persia (that the word of the LORD, spoken by the mouth of Jeremiah, might be accomplished) the Lord stirred up the spirit of Cyrus King of Persia, and he made a proclamation through all his kingdom, and also by writing, saying,"},{"num":2,"verse":"Thus saith Cyrus King of Persia, The Lord God of heaven hath given me all the kingdoms of the earth, and he hath commanded me to build him an house in Jerusalem, which is in Judah."},{"num":3,"verse":"Who is he among you of all his people with whom his God is? let him go up to Jerusalem which is in Judah, and build the house of the Lord God of Israel: he is the God, which is in Jerusalem."},{"num":4,"verse":"And everyone that remaineth in any place (where he sojourneth) let the men of his place relieve him with silver and with gold, and with substance, and with cattle, and with a willing offering, for the house of God that is in Jerusalem."},{"num":5,"verse":"Then the chief fathers of Judah and Benjamin, and the Priests and the Levites rose up, with all them whose spirit God had raised to go up, to build the house of the Lord which is in Jerusalem."},{"num":6,"verse":"And all they that were about them, strengthened their hands with vessels of silver, with gold, with substance and with cattle, and with precious things, besides all that was willingly offered."},{"num":7,"verse":"Also the king Cyrus brought forth the vessels of the house of the Lord, which Nebuchadnezzar had taken out of Jerusalem, and had put them in the house of his god."},{"num":8,"verse":"Even them did Cyrus king of Persia bring forth by the hand of Mithredath the treasurer, and counted them unto Sheshbazzar the Prince of Judah."},{"num":9,"verse":"And this is the number of them, thirty basins of gold, a thousand basins of silver, nine and twenty knives,"},{"num":10,"verse":"Thirty bowls of gold, and of silver bowls of the second sort, four hundred and ten, and of other vessels, a thousand."},{"num":11,"verse":"All the vessels of gold and silver were five thousand and four hundred. Sheshbazzar brought up all with them of the captivity that came up from Babel to Jerusalem."}]