[{"header":"Chapter 1"},{"num":1,"verse":"The Decree of Cyrus. In the first year of Cyrus, king of Persia, in order that the word of the Lord spoken by Jeremiah might be fulfilled, the Lord inspired King Cyrus of Persia to issue the following proclamation throughout his kingdom and also have it put in writing:"},{"num":2,"verse":"“King Cyrus of Persia says this: The Lord, the God of heaven, has given to me all the kingdoms of the earth, and in addition he has designated me to build him a house at Jerusalem in Judah."},{"num":3,"verse":"May God be with all those among you who belong to his people. They are to go up to Jerusalem in Judah and rebuild the house of the Lord, the God of Israel, the God who is in Jerusalem."},{"num":4,"verse":"And let everyone who has survived, and who has settled down to reside in that locale, be assisted by the people of that place with silver and gold, with goods and livestock, in addition to the voluntary offerings for the house of God in Jerusalem.”"},{"num":5,"verse":"Then the heads of the families of Judah and Benjamin, as well as the priests and Levites—all those whose spirit has been aroused by God—prepared to go forth and rebuild the house of God in Jerusalem."},{"num":6,"verse":"All of their neighbors assisted them with gifts of every kind—silver and gold, goods and livestock, and many valuable gifts, in addition to all of their free-will offerings."},{"num":7,"verse":"Furthermore, King Cyrus himself handed over the vessels of the house of the Lord that Nebuchadnezzar had carried away from Jerusalem and placed them in the temple of his gods."},{"num":8,"verse":"Cyrus, the king of Persia, ordered them to be released into the charge of Mithredath, the treasurer, who made a complete inventory of them before turning them over to Sheshbazzar, the prince of Judah."},{"num":9,"verse":"This was the final inventory: thirty gold dishes; one thousand silver dishes, in addition to twenty-nine others that had been repaired;"},{"num":10,"verse":"thirty gold bowls; four hundred and ten silver bowls; one thousand other articles."},{"num":11,"verse":"The final total of all the gold and silver vessels was five thousand four hundred. All these Sheshbazzar took with him when he led the exiles back from Babylon to Jerusalem."}]