[[],[{"type":"header","content":"The Day of Atonement"},{"type":"prose","content":"Now the  spoke to Moses after the death of the two sons of Aaron, when they offered  before the , and died; "}],[{"type":"prose","content":"and the  said to Moses: “Tell Aaron your brother not to come at  any time into the Holy  inside the veil, before the mercy seat which  on the ark, lest he die; for I will appear in the cloud above the mercy seat."}],[{"type":"prose","content":"“Thus Aaron shall come into the Holy  with  a young bull as a sin offering, and  a ram as a burnt offering. "}],[{"type":"prose","content":"He shall put the holy linen tunic and the linen trousers on his body; he shall be girded with a linen sash, and with the linen turban he shall be attired. These  holy garments. Therefore he shall wash his body in water, and put them on. "}],[{"type":"prose","content":"And he shall take from the congregation of the children of Israel two kids of the goats as a sin offering, and one ram as a burnt offering."}],[{"type":"prose","content":"“Aaron shall offer the bull as a sin offering, which  for himself, and make atonement for himself and for his house. "}],[{"type":"prose","content":"He shall take the two goats and present them before the   the door of the tabernacle of meeting. "}],[{"type":"prose","content":"Then Aaron shall cast lots for the two goats: one lot for the  and the other lot for the scapegoat. "}],[{"type":"prose","content":"And Aaron shall bring the goat on which the ’s lot fell, and offer it  a sin offering. "}],[{"type":"prose","content":"But the goat on which the lot fell to be the scapegoat shall be presented alive before the , to make atonement upon it,  to let it go as the scapegoat into the wilderness."}],[{"type":"prose","content":"“And Aaron shall bring the bull of the sin offering, which is for himself, and make atonement for himself and for his house, and shall kill the bull as the sin offering which  for himself. "}],[{"type":"prose","content":"Then he shall take a censer full of burning coals of fire from the altar before the , with his hands full of sweet incense beaten fine, and bring  inside the veil. "}],[{"type":"prose","content":"And he shall put the incense on the fire before the , that the cloud of incense may cover the mercy seat that  on the Testimony, lest he die. "}],[{"type":"prose","content":"He shall take some of the blood of the bull and sprinkle  with his finger on the mercy seat on the east  and before the mercy seat he shall sprinkle some of the blood with his finger seven times."}],[{"type":"prose","content":"“Then he shall kill the goat of the sin offering, which  for the people, bring its blood inside the veil, do with that blood as he did with the blood of the bull, and sprinkle it on the mercy seat and before the mercy seat. "}],[{"type":"prose","content":"So he shall make atonement for the Holy , because of the uncleanness of the children of Israel, and because of their transgressions, for all their sins; and so he shall do for the tabernacle of meeting which remains among them in the midst of their uncleanness. "}],[{"type":"prose","content":"There shall be no man in the tabernacle of meeting when he goes in to make atonement in the Holy , until he comes out, that he may make atonement for himself, for his household, and for all the assembly of Israel. "}],[{"type":"prose","content":"And he shall go out to the altar that  before the , and make atonement for it, and shall take some of the blood of the bull and some of the blood of the goat, and put it on the horns of the altar all around. "}],[{"type":"prose","content":"Then he shall sprinkle some of the blood on it with his finger seven times, cleanse it, and consecrate it from the uncleanness of the children of Israel."}],[{"type":"prose","content":"“And when he has made an end of atoning for the Holy , the tabernacle of meeting, and the altar, he shall bring the live goat. "}],[{"type":"prose","content":"Aaron shall lay both his hands on the head of the live goat, confess over it all the iniquities of the children of Israel, and all their transgressions, concerning all their sins, putting them on the head of the goat, and shall send  away into the wilderness by the hand of a suitable man. "}],[{"type":"prose","content":"The goat shall bear on itself all their iniquities to an uninhabited land; and he shall release the goat in the wilderness."}],[{"type":"prose","content":"“Then Aaron shall come into the tabernacle of meeting, shall take off the linen garments which he put on when he went into the Holy , and shall leave them there. "}],[{"type":"prose","content":"And he shall wash his body with water in a holy place, put on his garments, come out and offer his burnt offering and the burnt offering of the people, and make atonement for himself and for the people. "}],[{"type":"prose","content":"The fat of the sin offering he shall burn on the altar. "}],[{"type":"prose","content":"And he who released the goat as the scapegoat shall wash his clothes and bathe his body in water, and afterward he may come into the camp. "}],[{"type":"prose","content":"The bull  the sin offering and the goat  the sin offering, whose blood was brought in to make atonement in the Holy , shall be carried outside the camp. And they shall burn in the fire their skins, their flesh, and their offal. "}],[{"type":"prose","content":"Then he who burns them shall wash his clothes and bathe his body in water, and afterward he may come into the camp."}],[{"type":"prose","content":"“ shall be a statute forever for you: In the seventh month, on the tenth  of the month, you shall afflict your souls, and do no work at all,  a native of your own country or a stranger who dwells among you. "}],[{"type":"prose","content":"For on that day  shall make atonement for you, to cleanse you,  you may be clean from all your sins before the . "}],[{"type":"prose","content":"It  a sabbath of solemn rest for you, and you shall afflict your souls.  a statute forever. "}],[{"type":"prose","content":"And the priest, who is anointed and consecrated to minister as priest in his father’s place, shall make atonement, and put on the linen clothes, the holy garments; "}],[{"type":"prose","content":"then he shall make atonement for the Holy Sanctuary, and he shall make atonement for the tabernacle of meeting and for the altar, and he shall make atonement for the priests and for all the people of the assembly. "}],[{"type":"prose","content":"This shall be an everlasting statute for you, to make atonement for the children of Israel, for all their sins, once a year.” And he did as the  commanded Moses."}]]