[{"header":"Animals Pay the Price for Man’s Sin"},{"num":16,"verse":"The Lord spoke to Moses after the death of Aaron’s two sons, when they had come near the Lord and died. "},{"num":2,"verse":"The Lord said to Moses, “Tell your brother Aaron that he must not come just any time into the holy place inside the curtain, in front of the mercy-seat on the special box of the agreement or he will die. For I will show Myself in the cloud over the mercy-seat. "},{"num":3,"verse":"Only this way will Aaron go into the holy place, with a bull for a sin gift and a ram for a burnt gift. "},{"num":4,"verse":"He will put on the holy linen coat. And the linen under-clothing will be next to his body. He will be wearing the linen belt and the linen head-covering. These are holy clothing. He will wash his body in water and then dress himself. "},{"num":5,"verse":"He will take from the people of Israel two male goats for a sin gift and one ram for a burnt gift. "},{"num":6,"verse":"Then Aaron will give the bull as a sin gift for himself, to pay for the sins of himself and those in his house. "},{"num":7,"verse":"He will take the two goats and set them before the Lord at the door of the meeting tent. "},{"num":8,"verse":"Aaron will draw names for the two goats, choosing one for the Lord and the other to be sent away. "},{"num":9,"verse":"Then Aaron will bring the goat that was chosen for the Lord and give it as a sin gift. "},{"num":10,"verse":"But the goat that was chosen to be sent away will be brought alive before the Lord, for the taking away of sin. And it will be sent into the desert."},{"num":11,"verse":"“Then Aaron will give the bull as the sin gift for himself, to pay for the sins of himself and those in his house. He will kill the bull as the sin gift for himself. "},{"num":12,"verse":"He will take a fire pan full of fire from the altar before the Lord, and enough fine, ground, sweet perfume to fill two hands. And he will bring it inside the curtain. "},{"num":13,"verse":"He will put the special perfume on the fire before the Lord so that the cloud of the special perfume covers the mercy-seat on the special box of the agreement or he will die. "},{"num":14,"verse":"He will take some of the bull’s blood and put it with his finger on the east side of the mercy-seat. And with his finger he will put some of the blood seven times in front of the mercy-seat."},{"num":15,"verse":"“Then he will kill the goat as the sin gift for the people. He will bring its blood inside the curtain, and do the same with its blood as he did with the bull’s blood. He will put it on the seat and in front of the mercy-seat. "},{"num":16,"verse":"He will make the holy place, and also the meeting tent which is in the center of the camp, clean and pure because all the sins of the people make them unclean. "},{"num":17,"verse":"When he goes in to pay for sins in the holy place, no one will be in the meeting tent until he comes out. He will pay for the sins of himself, of those in his house, and of all the people of Israel. "},{"num":18,"verse":"Then he will go out to the altar before the Lord and make it clean and pure. He will take some of the bull’s blood and goat’s blood and put it on the horns of the altar on all sides. "},{"num":19,"verse":"With his finger he will put some of the blood on the altar seven times so it will be clean. He will set it apart from what is unclean among the people of Israel."},{"num":20,"verse":"“When he finishes making the holy place, the meeting tent and the altar free from sin, he will give the live goat. "},{"num":21,"verse":"Aaron will lay both his hands on the head of the live goat, and tell of all the sins and wrong-doings of the people of Israel. He will lay them upon the head of the goat and send it away into the desert by the hand of a man ready to help. "},{"num":22,"verse":"The goat will carry upon itself all their sins to a land where no one lives. Then the man will let the goat go free there."},{"num":23,"verse":"“Aaron will come into the meeting tent. He will take off the linen clothing he put on when he went into the holy place. And he will leave them there. "},{"num":24,"verse":"He will wash his body with water in a holy place and put on his clothes. Then he will come out and give his burnt gift and the people’s burnt gift, to pay for the sins of himself and the people. "},{"num":25,"verse":"He will burn the fat of the sin gift on the altar. "},{"num":26,"verse":"The man who let the goat carry away the sins will wash his clothes and wash his body with water. Then he may come among the tents. "},{"num":27,"verse":"The bull and the goat for the sin gift, whose blood was brought in to pay for sins in the holy place, will be taken away from the tents. Their skin, their flesh and their waste will be burned with fire. "},{"num":28,"verse":"Whoever burns them will wash his clothes and wash his body with water. Then he may come among the tents."},{"num":29,"verse":"“This will be a Law forever for you. On the tenth day of the seventh month, you must get rid of your pride and not do any work, both those who live in the land and those who visit from another land. "},{"num":30,"verse":"For on this day your sin will be taken away and you will be clean. You will be made free from all your sins before the Lord. "},{"num":31,"verse":"It is to be a special Day of Rest for you, that you may be free from pride. It is a Law forever. "},{"num":32,"verse":"The chosen religious leader who is set apart to work as religious leader in his father’s place will pay for the sin. He will put on the holy linen clothing "},{"num":33,"verse":"and make the holy place, the meeting tent and the altar free from sin. He will make the religious leaders and all the people free from sin also. "},{"num":34,"verse":"This will be a Law forever for you. The people of Israel must be made free from all their sins once a year.” And Moses did what the Lord told him to do."}]