[{"num":1,"verse":"After Aaron’s two sons died before the Lord, the Lord said to Moses, “Warn your brother Aaron not to enter into the Holy Place behind the veil, where the Ark and the place of mercy are, just whenever he chooses. The penalty for intrusion is death. For I myself am present in the cloud above the place of mercy."},{"num":3,"verse":"“Here are the conditions for his entering there: He must bring a young bull for a sin offering, and a ram for a burnt offering. "},{"num":4,"verse":"He must bathe himself and put on the sacred linen coat, shorts, belt, and turban. "},{"num":5,"verse":"The people of Israel shall then bring him two male goats for their sin offering, and a ram for their burnt offering. "},{"num":6,"verse":"First he shall present to the Lord the young bull as a sin offering for himself, making atonement for himself and his family. "},{"num":7,"verse":"Then he shall bring the two goats before the Lord at the entrance of the Tabernacle, "},{"num":8,"verse":"and cast lots to determine which is the Lord’s and which is to be sent away. "},{"num":9,"verse":"The goat allotted to the Lord shall then be sacrificed by Aaron as a sin offering. "},{"num":10,"verse":"The other goat shall be kept alive and placed before the Lord. The rite of atonement shall be performed over it, and it shall then be sent out into the desert as a scapegoat.*"},{"num":11,"verse":"“After Aaron has sacrificed the young bull as a sin offering for himself and his family, "},{"num":12,"verse":"he shall take a censer full of live coals from the altar of the Lord, and fill his hands with sweet incense beaten into fine powder, and bring it inside the veil. "},{"num":13,"verse":"There before the Lord he shall put the incense upon the coals, so that a cloud of incense will cover the mercy place above the Ark (containing the stone tablets of the Ten Commandments); thus he will not die. "},{"num":14,"verse":"And he shall bring some of the blood of the young bull and sprinkle it with his finger upon the east side of the mercy place, and then seven times in front of it."},{"num":15,"verse":"“Then he must go out and sacrifice the people’s sin offering goat, and bring its blood within the veil, and sprinkle it upon the place of mercy and in front of it, just as he did with the blood of the young bull. "},{"num":16,"verse":"Thus he shall make atonement for the holy place because it is defiled by the sins of the people of Israel, and for the Tabernacle, located right among them and surrounded by their defilement. "},{"num":17,"verse":"Not another soul shall be inside the Tabernacle when Aaron enters to make atonement in the Holy Place—not until after he comes out again and has made atonement for himself and his household and for all the people of Israel. "},{"num":18,"verse":"Then he shall go out to the altar before the Lord and make atonement for it. He must smear the blood of the young bull and the goat on the horns of the altar, "},{"num":19,"verse":"and sprinkle blood upon the altar seven times with his finger, thus cleansing it from the sinfulness of Israel and making it holy."},{"num":20,"verse":"“When he has completed the rite of atonement for the Holy Place, the entire Tabernacle, and the altar, he shall bring the live goat and, "},{"num":21,"verse":"laying both hands upon its head, confess over it all the sins of the people of Israel. He shall lay all their sins upon the head of the goat and send it into the desert, led by a man appointed for the task. "},{"num":22,"verse":"So the goat shall carry all the sins of the people into a land where no one lives, and the man shall let it loose in the wilderness."},{"num":23,"verse":"“Then Aaron shall go into the Tabernacle again and take off the linen garments he wore when he went behind the veil, and leave them there in the Tabernacle. "},{"num":24,"verse":"Then he shall bathe in a sacred place, put on his clothes again, and go out and sacrifice his own burnt offering for the people, making atonement for himself and for them. "},{"num":25,"verse":"He shall also burn upon the altar the fat for the sin offering."},{"num":26,"verse":"“The man who took the goat out into the desert shall afterwards wash his clothes and bathe himself and then come back into the camp. "},{"num":27,"verse":"And the young bull and the goat used for the sin offering (their blood was taken into the Holy Place by Aaron, to make atonement) shall be carried outside the camp and burned, including the hides and internal organs. "},{"num":28,"verse":"Afterwards, the person doing the burning shall wash his clothes and bathe himself and then return to camp."},{"num":29,"verse":"“This is a permanent law: You must do no work on the twenty-fifth day of September, but must spend the day in self-examination and humility. This applies whether you are born in the land or are a foreigner living among the people of Israel; for this is the day commemorating the atonement, cleansing you in the Lord’s eyes from all of your sins. "},{"num":31,"verse":"It is a Sabbath of solemn rest for you, and you shall spend the day in quiet humility; this is a permanent law. "},{"num":32,"verse":"This ceremony, in later generations, shall be performed by the anointed High Priest, consecrated in place of his ancestor Aaron; he shall be the one to put on the holy linen garments, "},{"num":33,"verse":"and make atonement for the holy sanctuary, the Tabernacle, the altar, the priests, and the people. "},{"num":34,"verse":"This shall be an everlasting law for you, to make atonement for the people of Israel once each year, because of their sins.”"}]