[{"header":"Alliance with King Hiram"},{"num":5,"verse":"Hiram king of Tyre sent his servants to Solomon when he heard that they had anointed him king in place of his father, for Hiram had always been a friend of David. "},{"num":2,"verse":"Then Solomon sent word to Hiram, saying, "},{"num":3,"verse":"“You know that David my father could not build a house (temple) for the Name (Presence) of the Lord his God because of the wars which surrounded him, until the Lord put his enemies under his feet. "},{"num":4,"verse":"But now that the Lord my God has given me rest [from war] on every side, there is neither adversary nor misfortune [confronting me]. "},{"num":5,"verse":"Behold, I intend to build a house (temple) to the Name of the Lord my God, just as the Lord said to my father David: ‘Your son whom I will put on your throne in your place shall build the house for My Name and Presence.’ "},{"num":6,"verse":"So now, command that they cut cedar trees from Lebanon for me, and my servants will join your servants, and I will give you whatever wages you set for your servants. For you know that there is no one among us who knows how to cut timber like the men of Sidon.”"},{"num":7,"verse":"When Hiram heard the words of Solomon, he rejoiced greatly and said, “Blessed be the Lord this day, who has given David a wise son [to be king] over this great people.” "},{"num":8,"verse":"So Hiram sent word to Solomon, saying, “I have heard the message which you sent to me; I will do everything you wish concerning the cedar and cypress timber. "},{"num":9,"verse":"My servants will bring the logs down from Lebanon to the [Mediterranean] sea, and I will have them made into rafts to go by sea to the place (port) that you direct me; then I will have them broken up there, and you shall carry them away. Then you shall return the favor by providing food for my household.” "},{"num":10,"verse":"So Hiram gave Solomon all the cedar and cypress timber he desired, "},{"num":11,"verse":"and Solomon gave Hiram 20,000 kors of wheat as food for his household, and 20 kors of pure [olive] oil. Solomon gave all these to Hiram each year. "},{"num":12,"verse":"The Lord gave Solomon wisdom, just as He promised him; and there was peace between Hiram and Solomon, and the two of them made a treaty."},{"header":"Conscription of Laborers"},{"num":13,"verse":"King Solomon levied forced laborers from all Israel; and the forced laborers numbered 30,000 men. "},{"num":14,"verse":"He sent them to Lebanon, 10,000 a month in shifts; one month they were in Lebanon and two months at home. Adoniram was in charge of the forced laborers. "},{"num":15,"verse":"Solomon had 70,000 burden bearers (transporters) and 80,000 stonemasons in the hill country [of Judah], "},{"num":16,"verse":"besides Solomon’s 3,300 chief deputies who were in charge of the project and who were in charge of the people doing the work. "},{"num":17,"verse":"The king gave orders, and they quarried great stones, valuable stones, to lay the foundation of the house (temple) with cut stones. "},{"num":18,"verse":"So Solomon’s builders and Hiram’s builders and the men of Gebal cut and chiseled the stones, and prepared the timber and the stones to build the house (temple)."}]