[{"num":1,"verse":"After the conquest—although seven of the tribes of Israel had not yet entered and conquered the land God had given them—all Israel gathered at Shiloh to set up the Tabernacle."},{"num":3,"verse":"Then Joshua asked them, “How long are you going to wait before clearing out the people living in the land that the Lord your God has given to you? "},{"num":4,"verse":"Select three men from each tribe, and I will send them to scout the unconquered territory and bring back a report of its size and natural divisions so that I can divide it for you. "},{"num":5,"verse":"The scouts will map it into seven sections, and then I will throw the sacred dice to decide which section will be assigned to each tribe. "},{"num":7,"verse":"However, remember that the Levites won’t receive any land; they are priests of the Lord. That is their wonderful heritage. And of course the tribes of Gad and Reuben and the half-tribe of Manasseh won’t receive any more, for they already have land on the east side of the Jordan where Moses promised them that they could settle.”"},{"num":8,"verse":"So the scouts went out to map the country and to bring back their report to Joshua. Then the Lord could assign the sections of land to the tribes by the throw of the sacred dice. "},{"num":9,"verse":"The men did as they were told and divided the entire territory into seven sections, listing the cities in each section. Then they returned to Joshua and the camp at Shiloh. "},{"num":10,"verse":"There at the Tabernacle at Shiloh the Lord showed Joshua by the sacred lottery which tribe should have each section:"},{"num":11,"verse":"The Land Given to the Tribe of Benjamin:"},{"num":12,"verse":"The northern boundary began at the Jordan River, went north of Jericho, then west through the hill country and the wilderness of Beth-aven. "},{"num":13,"verse":"From there the boundary went south to Luz (also called Bethel) and proceeded down to Ataroth-addar in the hill country south of Lower Beth-horon. "},{"num":14,"verse":"There the border turned south, passing the mountain near Beth-horon and ending at the village of Kiriath-baal (sometimes called Kiriath-jearim), one of the cities of the tribe of Judah. This was the western boundary."},{"num":15,"verse":"The southern border ran from the edge of Kiriath-baal, over Mount Ephron to the spring of Naphtoah, "},{"num":16,"verse":"and down to the base of the mountain beside the valley of Hinnom, north of the valley of Rephaim. From there it continued across the valley of Hinnom, crossed south of the old city of Jerusalem where the Jebusites lived, and continued down to En-rogel. "},{"num":17,"verse":"From En-rogel the boundary proceeded northeast to En-shemesh and on to Geliloth (which is opposite the slope of Adummim). Then it went down to the Stone of Bohan (who was a son of Reuben), "},{"num":18,"verse":"where it passed along the north edge of the Arabah. The border then went down into the Arabah, "},{"num":19,"verse":"ran south past Beth-hoglah, and ended at the north bay of the Dead Sea—which is the southern end of the Jordan River."},{"num":20,"verse":"The eastern border was the Jordan River. This was the land assigned to the tribe of Benjamin. "},{"num":21,"verse":"These twenty-six cities were included in the land given to the tribe of Benjamin: Jericho, Beth-hoglah, Emek-keziz, Beth-arabah, Zimaraim, Bethel, Avvim, Parah, Ophrah, Chephar-ammoni, Ophni, Geba, Gibeon, Ramah, Beeroth, Mizpeh, Chephirah, Mozah, Rekem, Irpeel, Taralah, Zela, Haeleph, Jebus (or Jerusalem), Gibeah, and Kiriath-jearim. All of these cities and their surrounding villages were given to the tribe of Benjamin."}]