[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Our bones.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The literal rendering of this verse is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As when one cutteth and cleaveth in the earth our bones are scattered at the mouth of Sheôl.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The reading “our bones” necessarily makes this an abrupt transition from the fate of the unjust judges in the last verse to that of the afflicted people, but in a correction by a second hand in the Codex Alex. of the LXX. we find the much easier and more satisfactory “their bones”—a reading confirmed by the Syriac, Ethiopic, and Arabic versions; as also by the fact that the word here rendered “cleave” is that employed in 2Chronicles 25:12 (see reference above, Psalm 141:6) of the Edomites thrown from the cliff. But the abrupt transition is not unlikely in Hebrew poetry, and the more difficult reading is according to rule to be preserved.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The reading “our bones” necessarily makes this an abrupt transition from the fate of the unjust judges in the last verse to that of the afflicted people, but in a correction by a second hand in the Codex Alex. of the LXX. we find the much easier and more satisfactory “their bones”—a reading confirmed by the Syriac, Ethiopic, and Arabic versions; as also by the fact that the word here rendered “cleave” is that employed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 25:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (see reference above, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") of the Edomites thrown from the cliff. But the abrupt transition is not unlikely in Hebrew poetry, and the more difficult reading is according to rule to be preserved.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The figure is mistaken in the Authorised Version. The reference is not to the ground strewn with the logs left by a woodcutter, but to the clods of earth left by the plough. Keeping the present text, and making the figure refer to the righteous, we should naturally compare Psalm 129:3, where ploughing is used as an image of affliction and torture, as “harrewing” is with us. The verse might be paraphrased: “We have been so harrowed and torn that we are brought to the brink of the grave,” the image being, however, heightened by the recollection of some actual massacre.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The figure is mistaken in the Authorised Version. The reference is not to the ground strewn with the logs left by a woodcutter, but to the clods of earth left by the plough. Keeping the present text, and making the figure refer to the righteous, we should naturally compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 129:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where ploughing is used as an image of affliction and torture, as “harrewing” is with us. The verse might be paraphrased: “We have been so harrowed and torn that we are brought to the brink of the grave,” the image being, however, heightened by the recollection of some actual massacre.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 141:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Our bones are scattered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — So barbarously cruel were our enemies that they not only killed many of our friends, but left their carcasses unburied, by which means their flesh, and sinews, &c., were consumed, or torn in pieces by wild beasts, and their bones dispersed upon the face of the earth, our common grave. The words are thought to refer to Saul’s barbarity and cruelty to David’s friends, in the horrid massacre of Ahimelech and the priests, by the hand of Doeg; perpetrated in such a savage manner that he compares it to the chopping and cleaving of wood, as if he had said, “How unlike, how barbarous, has their treatment been of me! My best friends slaughtered in great numbers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "at the command of Saul, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(so some render ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "לפי שׁאול",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", instead of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "at the grave’s mouth,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and hewn to pieces in his presence, as one would cut or chop a piece of wood:” see Peters.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "141:5-10 We should be ready to welcome the rebuke of our heavenly Father, and also the reproof of our brethren. It shall not break my head, if it may but help to break my heart: we must show that we take it kindly. Those who slighted the word of God before, will be glad of it when in affliction, for that opens the ear to instruction. When the world is bitter, the word is sweet. Let us lift our prayer unto God. Let us entreat him to rescue us from the snares of Satan, and of all the workers of iniquity. In language like this psalm, O Lord, would we entreat that our poor prayers should set forth our only hope, our only dependence on thee. Grant us thy grace, that we may be prepared for this employment, being clothed with thy righteousness, and having all the gifts of thy Spirit planted in our hearts.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Our bones are scattered at the grave's mouth - We are, indeed, now like bones scattered in the places of graves; we seem to be weak, feeble, disorganized. We are in a condition which of itself seems to be hopeless: as hopeless as it would be for dry bones scattered when they were buried to rise up and attack an enemy. The reference is to the condition of David and his followers as pursued by a mighty foe. His hope was not in his own forces, but in the power and interposition of God ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 141:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As when one cutteth and cleaveth wood upon the earth - Like chips, blocks, splinters, that have no strength; as when these lie scattered around - a fit emblem of our feeble and scattered forces. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As when one cutteth and cleaveth wood upon the earth - Like chips, blocks, splinters, that have no strength; as when these lie scattered around - a fit emblem of our feeble and scattered forces. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 141",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 141:1-10. This Psalm evinces its authorship as the preceding, by its structure and the character of its contents. It is a prayer for deliverance from sins to which affliction tempted him, and from the enemies who caused it.   ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ps 141:1-10. This Psalm evinces its authorship as the preceding, by its structure and the character of its contents. It is a prayer for deliverance from sins to which affliction tempted him, and from the enemies who caused it.   ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7 Our bones are scattered at the grave's mouth, as when one cutteth and cleaveth wood upon the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "8 But mine eyes are unto thee, O God the Lord: in thee is ray trust; leave not my soul destitute.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "9 Keep me from the snares which they have laid for me, and the gins of the workers of iniquity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10 Let the wicked fall into their own nets, whilst that I withal escape.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 141:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:7",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "David's case seemed hopeless: the cause of God in Israel was as a dead thing, even as a skeleton broken, and rotten, and shovelled out of the grave, to return as dust to its dust. \"Our bones are scattered at the grave's mouth.\" There seemed to be no life, no cohesion, no form, order, or headship among the godly party in Israel: Saul had demolished it, and scattered all its parts, so that it did not exist as an organized whole. David himself was like one of these dried bones, and the rest of the godly were in much the same condition. There seemed to be no vitality or union among the holy seed; but their cause lay at death's door. \"As when one cutteth and cleaveth wood upon the earth.\" They were like wood divided and thrown apart, not as one piece of timber, nor even as a bundle, but all cut to pieces, and thoroughly divided. Leaving out the word \"wood,\" which is supplied by the translators, the figure relates to cleaving upon the earth, which probably means ploughing, but may signify any other form of chopping and splitting, such as felling a forest, tearing up bushes, or otherwise causing confusion and division, How often have good men thought thus of the cause of God! Wherever they have looked, death, division, and destruction have stared them in the face. Cut and cloven, hopelessly sundered! Scattered, yea, scattered at the grave's mouth! Split up and split for the fire! Such the cause of God and truth has seemed to be. \"Upon the earth\" the prospect was wretched; the field of the church was ploughed, harrowed, and scarified: it had become like a wood-chopper's yard, where everything was doomed to be broken up. We have seen churches in such a state, and have been heart-broken. What a mercy that there is always a place above the earth to which we can look! There lives One who will give a resurrection to his cause, and a reunion to his divided people. He will bring up the dead bones from the grave's mouth, and make the dried faggots live again. Let us imitate the Psalmist in Psalm 141:8, and look up to the living God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "David's case seemed hopeless: the cause of God in Israel was as a dead thing, even as a skeleton broken, and rotten, and shovelled out of the grave, to return as dust to its dust. \"Our bones are scattered at the grave's mouth.\" There seemed to be no life, no cohesion, no form, order, or headship among the godly party in Israel: Saul had demolished it, and scattered all its parts, so that it did not exist as an organized whole. David himself was like one of these dried bones, and the rest of the godly were in much the same condition. There seemed to be no vitality or union among the holy seed; but their cause lay at death's door. \"As when one cutteth and cleaveth wood upon the earth.\" They were like wood divided and thrown apart, not as one piece of timber, nor even as a bundle, but all cut to pieces, and thoroughly divided. Leaving out the word \"wood,\" which is supplied by the translators, the figure relates to cleaving upon the earth, which probably means ploughing, but may signify any other form of chopping and splitting, such as felling a forest, tearing up bushes, or otherwise causing confusion and division, How often have good men thought thus of the cause of God! Wherever they have looked, death, division, and destruction have stared them in the face. Cut and cloven, hopelessly sundered! Scattered, yea, scattered at the grave's mouth! Split up and split for the fire! Such the cause of God and truth has seemed to be. \"Upon the earth\" the prospect was wretched; the field of the church was ploughed, harrowed, and scarified: it had become like a wood-chopper's yard, where everything was doomed to be broken up. We have seen churches in such a state, and have been heart-broken. What a mercy that there is always a place above the earth to which we can look! There lives One who will give a resurrection to his cause, and a reunion to his divided people. He will bring up the dead bones from the grave's mouth, and make the dried faggots live again. Let us imitate the Psalmist in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and look up to the living God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 141:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:8",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"But mine eyes are unto thee, O God the Lord.\" He looked upward and kept eyes fixed there. He regarded duty more than circumstances; he considered his promise rather than the external providence; and he expected from God rather than from men. He did not shut his eyes in indifference or despair, neither did he turn them to the creature in vain confidence, but he gave his eyes to his God, and saw nothing to fear. Jehovah his Lord is also his hope. Thomas called Jesus Lord and God, and David here speaks of his God and Lord. Saints delight to dwell upon the divine names when they are adoring or appealing. \"In thee is my trust.\" Not alone in thine attributes or in thy promises, but in thyself. Others might confide where they chose, but David kept to his God, in him he trusted always, only, confidently, and unreservedly. \"Leave not my soul destitute\"; as it would be if the Lord did not remember and fulfil his promise. To be destitute in circumstances is bad, but to be destitute in soul is far worse; to be left of friends is a calamity, but to be left of God would be destruction. Destitute of God is destitution with a vengeance. The comfort is that God hath said, \"I will never leave thee nor forsake thee.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 141:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:9",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Keep me from the snares which they have laid for me.\" He had before asked, in Psalm 141:3, that the door of his mouth might be kept; but his prayer now grows into \"Keep me.\" He seems more in trouble about covert temptation than concerning open attacks. Brave men do not dread battle, but they hate secret plots. We cannot endure to be entrapped like unsuspecting animals; therefore we cry to the God of wisdom for protection. \"And the gins of the workers of iniquity.\" These evil workers sought to catch David in his speech or acts. This was in itself a piece of in-equity, and so of a piece with the rest of their conduct. They were bad themselves, and they wished either to make him like themselves, or to cause him to seem so. If they could not catch the good man in one way, they would try another; snares and gins should be multiplied, for anyhow they were determined to work his ruin. Nobody could preserve David but the Omniscient and Omnipotent One, he also will preserve us. It is hard to keep out of snares which you cannot see, and to escape gins which you cannot discover. Well might the much-hunted Psalmist cry, \"Keep me.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Keep me from the snares which they have laid for me.\" He had before asked, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that the door of his mouth might be kept; but his prayer now grows into \"Keep me.\" He seems more in trouble about covert temptation than concerning open attacks. Brave men do not dread battle, but they hate secret plots. We cannot endure to be entrapped like unsuspecting animals; therefore we cry to the God of wisdom for protection. \"And the gins of the workers of iniquity.\" These evil workers sought to catch David in his speech or acts. This was in itself a piece of in-equity, and so of a piece with the rest of their conduct. They were bad themselves, and they wished either to make him like themselves, or to cause him to seem so. If they could not catch the good man in one way, they would try another; snares and gins should be multiplied, for anyhow they were determined to work his ruin. Nobody could preserve David but the Omniscient and Omnipotent One, he also will preserve us. It is hard to keep out of snares which you cannot see, and to escape gins which you cannot discover. Well might the much-hunted Psalmist cry, \"Keep me.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 141:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:10",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Let the wicked fall into their own nets, whilst that I withal escape.\" It may not be a Christian prayer, but it is a very just one, and it takes a great deal of grace to refrain from crying Amen to it; in fact, grace does not work towards making us wish otherwise concerning the enemies of holy men. Do we not all wish the innocent to be delivered, and the guilty to reap the result of their own malice? Of course we do, if we are just men. There can be no wrong in desiring that to happen in our own case which we wish for all good men. Yet is there a more excellent way. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Our bones; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " my bones, and the bones of my friends and followers. Our skin and flesh is in a manner consumed, and there is nothing left of us but a company of dead and dry belles; whereby he intimates that their condition was desperate. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 37:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 37:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Are scattered at the grave’s mouth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Literally and properly. So barbarously cruel were our enemies, that they not only killed us, but left our carcasses unburied, by which means our flesh and sinews, &c. were consumed or torn in pieces by wild beasts, and our bones dispersed ripen the time of the earth, our common grave; or if any of my followers were dead and buried, they pulled their bones out of the grave, and scattered them about. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Metaphorically. So the sense is, Our case is almost as hopeless as of those who are dead, and whose bones are scattered in several places. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As when one cutteth and cleaveth wood upon the earth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as much neglected and despised by them as the chips which a carpenter makes when he is cutting wood, which he will not stoop to take up. Or rather, as the LXX., and Chaldee, and Syriac understand it, and as it is in the Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as when one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (to wit, the husbandman) cutteth and cleaveth the earth, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which he teareth without any mercy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Our bones are scattered at the grave's mouth,.... Into which they were not suffered to be put, but lay unburied; or from whence they were dug up, and lay scattered about; which is to be understood of such of David's friends as fell into the hands of Saul and his men, and were slain: perhaps it may refer to the fourscore and five priests, and the inhabitants of Nob, slain by the order of Saul, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Though the phrase may be only proverbial, and be expressive of the danger David and his men were in, and their sense of it, who looked upon themselves like dry bones, hopeless and helpless, and had the sentence of death in themselves, and were as it were at the mouth of the grave, on the brink of ruin; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as when one cutteth and cleaveth wood upon the earth: and the chips fly here and there, and are disregarded; such was their case: or as men cut and cleave the earth with the plough, and it is tore up by it, and falls on each side of it, so are we persecuted, afflicted, and distressed by our enemies, and have no mercy shown us; so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"as a man that cuts and cleaves with ploughshares in the earth, so our members are scattered at the grave's mouth.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Syriac and Arabic versions understand it of the ploughshare cutting the earth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Syriac and Arabic versions understand it of the ploughshare cutting the earth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Our bones are scattered at the {h} grave's mouth, as when one cutteth and cleaveth wood upon the earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Our bones are scattered at the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " grave's mouth, as when one cutteth and cleaveth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "wood",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " upon the earth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Here it appears that David was miraculously delivered out of many deaths as in 2Co 1:9,10.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As when one splitteth and cleaveth (wood) upon the earth,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Our bones are scattered at the mouth of Sheol.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Precipitation from a rock was a common method of execution in ancient times (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 25:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the meaning would seem to be that when the judges or leaders of the “workers of iniquity” mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 141:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (for it is to them that the pronoun ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " must refer) have met with the fate they deserve, their followers (or people in general) will welcome the Psalmist’s advice and exhortation. ‘Judges’ however, though it may mean ‘rulers’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is not a natural word to use for the leaders of a class or party. Must not the reference be rather to the corrupt judges by whose help the rich and powerful procured the condemnation and even the judicial murder of the poor and defenceless? Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Taken by itself the next verse would seem to describe a national disaster, some defeat after which the bodies of the slain lay unburied on the field of battle. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 53:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But there is no hint of such a disaster in the rest of the Psalm, and we can only suppose that the Psalmist, when he uses the first person, ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " bones,’ is speaking on behalf of those with whom he is in sympathy, the godly who are the victims of persecution and oppression. While the wicked and their judges are still in power they are murdered, and their dead bodies call for vengeance; or, if the expression be taken as hyperbolical (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), they are deprived of all that makes life worth living, and are no better than bleaching skeletons, ready to be swallowed up by the greedy jaws of Sheol. Some MSS of the LXX, and the Syriac, read ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their bones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. the bones of the judges who have been executed, but this is probably only a conjectural correction to get rid of the difficulty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The meaning of the last line is uncertain. Most of the Ancient Versions (Aq. Symm. Jer. Targ. Syr.), and most modern commentators, render as R.V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as when one ploweth and cleaveth the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on the ground that this rendering is required by the usage of the language. In Aramaic and in cognate languages the first verb means to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "plow, cultivate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": it comes from the same root as the modern Arabic ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fellah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But neither it nor the second verb is used in the O.T. in this sense, and the comparison of the bodies or bones of the slain to the clods or stones turned up by the plough is not an obvious one. On the other hand the second verb may certainly mean ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to cleave wood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the first is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 4:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of slicing up gourds; and the comparison of the scattered and bleaching bones of the slain to the splinters and chips made by the woodcutter at his work and left scattered and uncared for is forcible and graphic.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Our bones are scattered at the grave's mouth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The calamity is not confined to the \"judges.\" The bones of the people generally lie scattered at hews mouth  - unburied, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., but ready to go down to Hades. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As when one cutteth and cleaveth wood upon the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "when one cleaves and breaks up the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The bones of God's servants were strewn as thickly ever the ground as stones over a newly ploughed piece of soil, so that the Holy Land looked as if it had become an antechamber of Hades\" (Kay). Psalm 141:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus far the Psalm is comparatively easy of exposition; but now it becomes difficult, yet not hopelessly so. David, thoroughly conscious of his sins against God and of his imperfection as a monarch, says, in opposition to the abuse which he is now suffering, that he would gladly accept any friendly reproof: \"let a righteous man smite in kindness and reprove me - head-oil (i.e., oil upon the head, to which such reproof is likened) shall my head not refuse.\" So we render it, following the accents, and not as Hupfeld, Kurtz, and Hitzig do: \"if a righteous man smites me, it is love; if he reproves me, an anointing of the head is it unto me;\" in connection with which the designation of the subject with היא would be twice wanting, which is more than is admissible. צדּיק stands here as an abstract substantive: the righteous man, whoever he may be, in antithesis, namely, to the rebels and to the people who have joined them. Amyraldus, Maurer, and Hengstenberg understand it of God; but it only occurs of God as an attribute, and never as a direct appellation. חסד, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is equivalent to בּחסד, cum benignitate  equals  benigne. What is meant is, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", what Paul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") styles πνεῦμα πραΰ́τητος. and הלם, tundere, is used of the strokes of earnest but well-meant reproof, which is called \"the blows of a friend\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 27:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Such reproof shall be to him as head-oil (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 23:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 133:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which his head does not despise. יני, written defectively for יניא, like ישּׁי, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", אבי, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 21:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and frequently; הניא (root נא, Arab. n', with the nasal n, which also expresses the negation in the Indo-Germanic languages) here signifies to deny, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to bring to nought, to destroy. On the other hand, the lxx renders μὴ λιπανάτω τὴν κεφαλήν μου, which is also followed by the Syriac and Jerome, perhaps after the Arabic nawiya, to become or to be fat, which is, however, altogether foreign to the Aramaic, and is, moreover, only used of fatness of the body, and in fact of camels. The meaning of the figure is this: well-meant reproof shall be acceptable and spiritually useful to him. The confirmation כּי־עוד וגו follows, which is enigmatical both in meaning and expression. This עוד is the cipher of a whole clause, and the following ו is related to this עוד as the Waw that introduces the apodosis, not to כּי as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 24:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", since no progression and connection is discernible if כי is taken as a subordinating quia. We interpret thus: for it is still so (the matter still stands thus), that my prayer is against their wickednesses; i.e., that I use no weapon but that of prayer against these, therefore let me always be in that spiritual state of mind which is alive to well-meant reproof. Mendelssohn's rendering is similar: I still pray, whilst they practise infamy. On עוד ו cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " עוד אשׁר (vid., Khler), and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 24:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " אחר ו. He who has prayed God in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 141:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to set a watch upon his mouth is dumb in the presence of those who now have dominion, and seeks to keep himself clear of their sinful doings, whereas he willingly allows himself to be chastened by the righteous; and the more silent he is towards the world (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the more constant is he in his intercourse with God. But there will come a time when those who now behave as lords shall fall a prey to the revenge of the people who have been misled by them; and on the other hand, the confession of the salvation, and of the order of the salvation, of God, that has hitherto been put to silence, will again be able to make itself freely heard, and find a ready hearing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As Psalm 141:6 says, the new rulers fall a prey to the indignation of the people and are thrown down the precipices, whilst the people, having again come to their right mind, obey the words of David and find them pleasant and beneficial (vid., Proverbs 15:26; Proverbs 16:24). נשׁמטוּ is to be explained according to 2 Kings 9:33. The casting of persons down from the rock was not an unusual mode of execution (2 Chronicles 25:12). ידי־סלע are the sides (Psalm 140:6; Judges 11:26) of the rock, after which the expression ἐχόμενα πέτρας of the lxx, which has been misunderstood by Jerome, is intended to be understood;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " says, the new rulers fall a prey to the indignation of the people and are thrown down the precipices, whilst the people, having again come to their right mind, obey the words of David and find them pleasant and beneficial (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 15:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 16:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). נשׁמטוּ is to be explained according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 9:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The casting of persons down from the rock was not an unusual mode of execution (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 25:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ידי־סלע are the sides (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 140:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 11:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") of the rock, after which the expression ἐχόμενα πέτρας of the lxx, which has been misunderstood by Jerome, is intended to be understood;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Beda Pieringer in his Psalterium Romana Lyra Radditum (Ratisbonae 1859) interprets κατεπόθησαν ἐχόμενα πέτρας οἱ κραταιοὶ τὐτῶν, absorpti, i.e., operti sunt loco ad petram pertinente signiferi turpis consilii eorum.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they are therefore the sides of the rock conceived of as it were as the hands of the body of rock, if we are not rather with Bttcher to compare the expressions בּידי and על־ידי construed with verbs of abandoning and casting down, Lamentations 1:14; Job 16:11, and frequently. In Psalm 141:7 there follows a further statement of the issue on the side of David and his followers: instar findentis et secantis terram (בּקע with Beth, elsewhere in the hostile signification of irrumpere) dispersa sunt ossa nostra ad ostium (לפי as in Proverbs 8:3) orci; Symmachus: ὥσπερ γεωργὸς ὅταν ῥήσσῃ τὴν τὴν, οὕτως ἐσκορπίσθη τὰ ὀστᾶ ἡμῶν εἰς στόμα ᾅδου; Quinta: ὡς καλλιεργῶν καὶ σκάπτων ἐν τῇ γῇ κ. τ. λ. Assuming the very extreme, it is a look of hope into the future: should his bones and the bones of his followers be even scattered about the mouth of Shel (cf. the Syrian picture of Shel: \"the dust upon its threshold ‛al-escûfteh,\" Deutsche Morgenlnd. Zeitschrift, xx. 513), their soul below, their bones above - it would nevertheless be only as when on in ploughing cleaves the earth; i.e., they do not lie there in order that they may continue lying, but that they may rise up anew, as the seed that is sown sprouts up out of the upturned earth. lxx Codd. Vat. et Sinait. τὰ ὀστᾶ ἡμῶν, beside which, however, is found the reading αὐτῶν (Cod. Alex. by a second hand, and the Syriac, Arabic, and Aethiopic versions), as Bttcher also, pro ineptissimo utcunque, thinks עצמינו must be read, understanding this, according to 2 Chronicles 25:12 extrem., of the mangled bodies of those cast down from the rock. We here discern the hope of a resurrection, if not directly, at least (cf. Oehler in Herzog's Real-Encyclopdie, concluding volume, S. 422) as am emblem of victory in spite of having succumbed. That which authorizes this interpretation lies in the figure of the husbandman, and in the conditional clause (Psalm 141:8), which leads to the true point of the comparison; for as a complaint concerning a defeat that had been suffered: \"so are our bones scattered for the mouth of the grave (in order to be swallowed up by it),\" Psalm 141:7, would be alien and isolated with respect to what precedes and what follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they are therefore the sides of the rock conceived of as it were as the hands of the body of rock, if we are not rather with Bttcher to compare the expressions בּידי and על־ידי construed with verbs of abandoning and casting down, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and frequently. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " there follows a further statement of the issue on the side of David and his followers: instar findentis et secantis terram (בּקע with Beth, elsewhere in the hostile signification of irrumpere) dispersa sunt ossa nostra ad ostium (לפי as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") orci; Symmachus: ὥσπερ γεωργὸς ὅταν ῥήσσῃ τὴν τὴν, οὕτως ἐσκορπίσθη τὰ ὀστᾶ ἡμῶν εἰς στόμα ᾅδου; Quinta: ὡς καλλιεργῶν καὶ σκάπτων ἐν τῇ γῇ κ. τ. λ. Assuming the very extreme, it is a look of hope into the future: should his bones and the bones of his followers be even scattered about the mouth of Shel (cf. the Syrian picture of Shel: \"the dust upon its threshold ‛al-escûfteh,\" Deutsche Morgenlnd. Zeitschrift, xx. 513), their soul below, their bones above - it would nevertheless be only as when on in ploughing cleaves the earth; i.e., they do not lie there in order that they may continue lying, but that they may rise up anew, as the seed that is sown sprouts up out of the upturned earth. lxx Codd. Vat. et Sinait. τὰ ὀστᾶ ἡμῶν, beside which, however, is found the reading αὐτῶν (Cod. Alex. by a second hand, and the Syriac, Arabic, and Aethiopic versions), as Bttcher also, pro ineptissimo utcunque, thinks עצמינו must be read, understanding this, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 25:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " extrem., of the mangled bodies of those cast down from the rock. We here discern the hope of a resurrection, if not directly, at least (cf. Oehler in Herzog's Real-Encyclopdie, concluding volume, S. 422) as am emblem of victory in spite of having succumbed. That which authorizes this interpretation lies in the figure of the husbandman, and in the conditional clause (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which leads to the true point of the comparison; for as a complaint concerning a defeat that had been suffered: \"so are our bones scattered for the mouth of the grave (in order to be swallowed up by it),\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 141:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", would be alien and isolated with respect to what precedes and what follows. ",
            "children": []
          }
        ]
      }
    ]
  }
]