[{"header":"Equal Justice for All"},{"num":23,"verse":"Don’t spread harmful rumors or help a criminal by giving false evidence."},{"num":2,"verse":"Always tell the truth in court, even if everyone else is dishonest and stands in the way of justice. "},{"num":3,"verse":"And don’t favor the poor, simply because they are poor."},{"num":4,"verse":"If you find an ox or a donkey that has wandered off, take it back where it belongs, even if the owner is your enemy."},{"num":5,"verse":"If a donkey is overloaded and falls down, you must do what you can to help, even if it belongs to someone who doesn’t like you."},{"num":6,"verse":"Make sure that the poor are given equal justice in court. "},{"num":7,"verse":"Don’t bring false charges against anyone or sentence an innocent person to death. I won’t forgive you if you do."},{"num":8,"verse":"Don’t accept bribes. Judges are blinded and justice is twisted by bribes."},{"num":9,"verse":"Don’t mistreat foreigners. You were foreigners in Egypt, and you know what it is like."},{"header":"Laws for the Sabbath"},{"num":10,"verse":"Plant and harvest your crops for six years, "},{"num":11,"verse":"but let the land rest during the seventh year. The poor are to eat what they want from your fields, vineyards, and olive trees during that year, and when they have all they want from your fields, leave the rest for wild animals."},{"num":12,"verse":"Work the first six days of the week, but rest and relax on the seventh day. This law is not only for you, but for your oxen, donkeys, and slaves, as well as for any foreigners among you."},{"num":13,"verse":"Make certain that you obey everything I have said. Don’t pray to other gods or even mention their names."},{"header":"Three Annual Festivals"},{"num":14,"verse":"Celebrate three festivals each year in my honor."},{"num":15,"verse":"Celebrate the Festival of Thin Bread by eating bread made without yeast, just as I have commanded. Do this at the proper time during the month of Abib, because it is the month when you left Egypt. And make certain that everyone brings the proper offerings."},{"num":16,"verse":"Celebrate the Harvest Festival each spring when you start harvesting your wheat, and celebrate the Festival of Shelters each autumn when you pick your fruit."},{"num":17,"verse":"Your men must come to these three festivals each year to worship me."},{"num":18,"verse":"Do not offer bread made with yeast when you sacrifice an animal to me. And make sure that the fat of the animal is burned that same day."},{"num":19,"verse":"Each year bring the best part of your first harvest to the place of worship."},{"header":"A Promise and a Warning"},{"num":20,"verse":"I am sending an angel to protect you and to lead you into the land I have ready for you. "},{"num":21,"verse":"Carefully obey everything the angel says, because I am giving him complete authority, and he won’t tolerate rebellion. "},{"num":22,"verse":"If you faithfully obey him, I will be a fierce enemy of your enemies. "},{"num":23,"verse":"My angel will lead you into the land of the Amorites, Hittites, Perizzites, Canaanites, Hivites, and Jebusites, and I will wipe them out. "},{"num":24,"verse":"Don’t worship their gods or follow their customs. Instead, destroy their idols and shatter their stone images."},{"num":25,"verse":"Worship only me, the Lord your God! I will bless you with plenty of food and water and keep you strong. "},{"num":26,"verse":"Your women will give birth to healthy children, and everyone will live a long life."},{"num":27,"verse":"I will terrify those nations and make your enemies so confused that they will run from you. "},{"num":28,"verse":"I will make the Hivites, Canaanites, and Hittites panic as you approach. "},{"num":29,"verse":"But I won’t do all this in the first year, because the land would become poor, and wild animals would be everywhere. "},{"num":30,"verse":"Instead, I will force out your enemies little by little and give your nation time to grow strong enough to take over the land."},{"num":31,"verse":"I will see that your borders reach from the Red Sea to the Euphrates River and from the Mediterranean Sea to the desert. I will let you defeat the people who live there, and you will force them out of the land. "},{"num":32,"verse":"But you must not make any agreements with them or with their gods. "},{"num":33,"verse":"Don’t let them stay in your land. They will trap you into sinning against me and worshiping their gods."}]