[{"header":"Laws of Justice and Mercy"},{"num":23,"verse":"You must not give a false report. Do not join your hand with the wicked to be a malicious witness."},{"num":2,"verse":"You must not follow the masses to do evil, and do not testify in a dispute that agrees with the crowd to pervert justice. "},{"num":3,"verse":"You must not show partiality to a poor man in his dispute."},{"num":4,"verse":"If you meet your enemy’s ox or his donkey going astray, you shall surely return it to him. "},{"num":5,"verse":"If you see the donkey of someone who hates you lying under its burden, you must not ignore it; you must surely help with him."},{"num":6,"verse":"You shall not turn justice away from your poor in his dispute. "},{"num":7,"verse":"Keep far away from a false charge, and do not kill the innocent and the righteous, for I will not justify the wicked."},{"num":8,"verse":"You shall not take a bribe, for a bribe blinds those who see and subverts the words of the righteous."},{"num":9,"verse":"Also you shall not oppress a foreigner, for you know the life of a foreigner, seeing you were foreigners in the land of Egypt."},{"header":"The Laws of Sabbaths"},{"num":10,"verse":"You shall sow your land for six years and shall gather in its produce, "},{"num":11,"verse":"but in the seventh year you shall let it rest and lie fallow, so that the poor of your people may eat, and what they leave the beasts of the field may eat. You shall do likewise with your vineyard and with your olive grove."},{"num":12,"verse":"For six days you are to do your work, but on the seventh day you must cease, so that your ox and your donkey may rest, and the son of your female servant and the foreigner may refresh themselves."},{"num":13,"verse":"In all things that I have said to you, watch yourselves, and do not mention the name of other gods, nor let them be heard from your mouth."},{"header":"The Three Annual Feasts"},{"num":14,"verse":"Three times in the year you must celebrate a feast to Me."},{"num":15,"verse":"You shall observe the Feast of Unleavened Bread. For seven days you shall eat unleavened bread, as I commanded you, in the appointed time of the month Aviv, for in it you came out from Egypt."},{"num":16,"verse":"You shall observe the Feast of Harvest, the first fruits of your labors, which you have sown in the field."},{"num":17,"verse":"Three times in the year all your males shall appear before the Lord God."},{"num":18,"verse":"You shall not offer the blood of My sacrifice with leavened bread, nor shall the fat of My sacrifice remain until the morning."},{"num":19,"verse":"The first of the first fruits of your land you shall bring into the house of the Lord your God."},{"header":"The Angel Prepares the Way"},{"num":20,"verse":"Indeed, I am going to send an angel before you to guard you along the way and to bring you into the place which I have prepared. "},{"num":21,"verse":"Be on guard before him and obey his voice. Do not provoke him, for he will not pardon your transgressions, for My name is in him. "},{"num":22,"verse":"But if you diligently obey his voice and do all that I say, then I will be an enemy to your enemies and an adversary to your adversaries. "},{"num":23,"verse":"For My angel will go before you and bring you to the Amorites, and the Hittites, and the Perizzites, and the Canaanites, the Hivites, and the Jebusites, and I will completely destroy them. "},{"num":24,"verse":"You must not bow down to their gods, or serve them, or do according to their practices, but you shall utterly overthrow them and break down their images in pieces. "},{"num":25,"verse":"You shall serve the Lord your God, and He shall bless your bread and your water, and I will remove sickness from your midst. "},{"num":26,"verse":"No one shall be miscarrying or be barren in your land. I will fulfill the number of your days."},{"num":27,"verse":"I will send My fear before you, and I will throw into panic all the people to whom you shall come. I will make all your enemies turn their backs to you. "},{"num":28,"verse":"I will send hornets before you which shall drive out the Hivite, the Canaanite, and the Hittite from before you. "},{"num":29,"verse":"I will not drive them out before you in one year, lest the land become desolate and the beasts of the field multiply against you. "},{"num":30,"verse":"Little by little I will drive them out before you, until you become fruitful and inherit the land."},{"num":31,"verse":"I will set your boundaries from the Red Sea to the sea of the Philistines, and from the desert to the River; for I will deliver the inhabitants of the land into your hand, and you will drive them out before you. "},{"num":32,"verse":"You must not make a covenant with them or with their gods. "},{"num":33,"verse":"They shall not live in your land, lest they cause you to sin against Me, for if you serve their gods, it will surely be a snare to you."}]