[{"num":1,"verse":"In the days when the judges ruled, there was a famine in the land. And a certain man of Bethlehem of Judah went to sojourn in the country of Moab, he, his wife, and his two sons."},{"num":2,"verse":"The man’s name was Elimelech and his wife’s name was Naomi and his two sons were named Mahlon [invalid] and Chilion [pining]; they were Ephrathites from Bethlehem of Judah. They went to the country of Moab and continued there."},{"num":3,"verse":"But Elimelech, who Naomi’s husband, died, and she was left with her two sons."},{"num":4,"verse":"And they took wives of the women of Moab; the name of the one was Orpah and the name of the other Ruth. They dwelt there about ten years;"},{"num":5,"verse":"And Mahlon and Chilion died also, both of them, so the woman was bereft of her two sons and her husband."},{"num":6,"verse":"Then she arose with her daughters-in-law to return from the country of Moab, for she had heard in Moab how the Lord had visited His people in giving them food."},{"num":7,"verse":"So she left the place where she was, her two daughters-in-law with her, and they started on the way back to Judah."},{"num":8,"verse":"But Naomi said to her two daughters-in-law, Go, return each of you to her mother’s house. May the Lord deal kindly with you, as you have dealt with the dead and with me."},{"num":9,"verse":"The Lord grant that you may find a home and rest, each in the house of her husband! Then she kissed them and they wept aloud."},{"num":10,"verse":"And they said to her, No, we will return with you to your people."},{"num":11,"verse":"But Naomi said, Turn back, my daughters, why will you go with me? Have I yet sons in my womb that may become your husbands?"},{"num":12,"verse":"Turn back, my daughters, go; for I am too old to have a husband. If I should say I have hope, even if I should have a husband tonight and should bear sons,"},{"num":13,"verse":"Would you therefore wait till they were grown? Would you therefore refrain from marrying? No, my daughters; it is far more bitter for me than for you that the hand of the Lord is gone out against me."},{"num":14,"verse":"Then they wept aloud again; and Orpah kissed her mother-in-law [good-bye], but Ruth clung to her."},{"num":15,"verse":"And Naomi said, See, your sister-in-law has gone back to her people and to her gods; return after your sister-in-law."},{"num":16,"verse":"And Ruth said, Urge me not to leave you or to turn back from following you; for where you go I will go, and where you lodge I will lodge. Your people shall be my people and your God my God."},{"num":17,"verse":"Where you die I will die, and there will I be buried. The Lord do so to me, and more also, if anything but death parts me from you."},{"num":18,"verse":"When Naomi saw that Ruth was determined to go with her, she said no more."},{"num":19,"verse":"So they both went on until they came to Bethlehem. And when they arrived in Bethlehem, the whole town was stirred about them, and said, Is this Naomi?"},{"num":20,"verse":"And she said to them, Call me not Naomi [pleasant]; call me Mara [bitter], for the Almighty has dealt very bitterly with me."},{"num":21,"verse":"I went out full, but the Lord has brought me home again empty. Why call me Naomi, since the Lord has testified against me, and the Almighty has afflicted me?"},{"num":22,"verse":"So Naomi returned, and Ruth the Moabitess, her daughter-in-law, with her, who returned from the country of Moab. And they came to Bethlehem at the beginning of barley harvest."}]