[{"header":"Elimelech’s Family Moves to Moab"},{"num":1,"verse":"In the days when there were judges to rule, there was a time of no food in the land. A certain man of Bethlehem in Judah went to visit the land of Moab with his wife and his two sons. "},{"num":2,"verse":"The name of the man was Elimelech. His wife’s name was Naomi. And the names of his two sons were Mahlon and Chilion. They were Ephrathites of Bethlehem in Judah. They went into the land of Moab and stayed there. "},{"num":3,"verse":"But Naomi’s husband Elimelech died. And she was left with her two sons, "},{"num":4,"verse":"who married Moabite women. The name of one was Orpah. The name of the other was Ruth. After living there about ten years, "},{"num":5,"verse":"both Mahlon and Chilion died. Naomi was left without her two children and her husband."},{"header":"Naomi and Ruth Return to Bethlehem"},{"num":6,"verse":"Then Naomi got ready to return from the land of Moab with her daughters-in-law. She had heard in the land of Moab that the Lord had brought food to His people. "},{"num":7,"verse":"So she left with her two daughters-in-law and went on the way toward the land of Judah. "},{"num":8,"verse":"But Naomi said to her two daughters-in-law, “Go, each one of you return to your own mother’s house. May the Lord show kindness to you, as you have done with the dead and with me. "},{"num":9,"verse":"May the Lord help you to find a home, each in the family of her husband.” Then she kissed them, and they cried in loud voices. "},{"num":10,"verse":"They said to her, “No, we will return with you to your people.” "},{"num":11,"verse":"But Naomi said, “Return to your people, my daughters. Why should you go with me? Do I have more sons within me, who could become your husbands? "},{"num":12,"verse":"Return, my daughters. Go. For I am too old to have a husband. If I had hope, if I should have a husband tonight and give birth to sons, "},{"num":13,"verse":"would you wait until they were grown? Would you not marry until then? No, my daughters. It is harder for me than for you. For the hand of the Lord is against me.” "},{"num":14,"verse":"Then they cried again in loud voices. Orpah kissed her mother-in-law. But Ruth held on to her."},{"num":15,"verse":"Naomi said, “See, your sister-in-law has returned to her people and her gods. Return after your sister-in-law.” "},{"num":16,"verse":"But Ruth said, “Do not beg me to leave you or turn away from following you. I will go where you go. I will live where you live. Your people will be my people. And your God will be my God. "},{"num":17,"verse":"I will die where you die, and there I will be buried. So may the Lord do the same to me, and worse, if anything but death takes me from you.” "},{"num":18,"verse":"When Naomi saw that Ruth would do nothing but go with her, she said no more to her."},{"num":19,"verse":"So they both went until they came to Bethlehem. The whole town of Bethlehem was happy because of them. The women said, “Is this Naomi?” "},{"num":20,"verse":"She said to them, “Do not call me Naomi. Call me Mara. For the All-powerful has brought much trouble to me. "},{"num":21,"verse":"I went out full. But the Lord has made me return empty. Why call me Naomi? The Lord has spoken against me. The All-powerful has allowed me to suffer.”"},{"num":22,"verse":"So Naomi returned. And her daughter-in-law Ruth, the Moabite woman, returned with her from the land of Moab. They came to Bethlehem at the beginning of barley gathering time."}]