[[],[{"type":"header","content":"Elimelech’s Family Goes to Moab"},{"type":"prose","content":"In the days when the judges ruled, there was a famine in the land, and a certain man of Bethlehem in Judah went to live in the country of Moab, he and his wife and two sons. "}],[{"type":"prose","content":"The name of the man was Elimelech and the name of his wife Naomi, and the names of his two sons were Mahlon and Chilion; they were Ephrathites from Bethlehem in Judah. They went into the country of Moab and remained there. "}],[{"type":"prose","content":"But Elimelech, the husband of Naomi, died, and she was left with her two sons. "}],[{"type":"prose","content":"These took Moabite wives; the name of the one was Orpah and the name of the other Ruth. When they had lived there about ten years, "}],[{"type":"prose","content":"both Mahlon and Chilion also died, so that the woman was left without her two sons and her husband."}],[{"type":"header","content":"Naomi and Her Moabite Daughters-in-Law"},{"type":"prose","content":"Then she started to return with her daughters-in-law from the country of Moab, for she had heard in the country of Moab that the LORD had considered his people and given them food. "}],[{"type":"prose","content":"So she set out from the place where she had been living, she and her two daughters-in-law, and they went on their way to go back to the land of Judah. "}],[{"type":"prose","content":"But Naomi said to her two daughters-in-law, “Go back each of you to your mother’s house. May the LORD deal kindly with you, as you have dealt with the dead and with me. "}],[{"type":"prose","content":"The LORD grant that you may find security, each of you in the house of your husband.” Then she kissed them, and they wept aloud. "}],[{"type":"prose","content":"They said to her, “No, we will return with you to your people.” "}],[{"type":"prose","content":"But Naomi said, “Turn back, my daughters, why will you go with me? Do I still have sons in my womb that they may become your husbands? "}],[{"type":"prose","content":"Turn back, my daughters, go your way, for I am too old to have a husband. Even if I thought there was hope for me, even if I should have a husband tonight and bear sons, "}],[{"type":"prose","content":"would you then wait until they were grown? Would you then refrain from marrying? No, my daughters, it has been far more bitter for me than for you, because the hand of the LORD has turned against me.” "}],[{"type":"prose","content":"Then they wept aloud again. Orpah kissed her mother-in-law, but Ruth clung to her."}],[{"type":"prose","content":"So she said, “See, your sister-in-law has gone back to her people and to her gods; return after your sister-in-law.” "}],[{"type":"prose","content":"But Ruth said,"},{"type":"poetry","content":"“Do not press me to leave you"},{"type":"poetry","content":"Where you go, I will go;"},{"type":"poetry","content":"your people shall be my people,"}],[{"type":"poetry","content":"Where you die, I will die—"},{"type":"poetry","content":"May the  do thus and so to me,"},{"type":"poetry","content":"if even death parts me from you!”"}],[{"type":"prose","content":"When Naomi saw that she was determined to go with her, she said no more to her."}],[{"type":"prose","content":"So the two of them went on until they came to Bethlehem. When they came to Bethlehem, the whole town was stirred because of them; and the women said, “Is this Naomi?” "}],[{"type":"prose","content":"She said to them,"},{"type":"poetry","content":"“Call me no longer Naomi,"}],[{"type":"poetry","content":"I went away full,"},{"type":"poetry","content":"why call me Naomi"}],[{"type":"prose","content":"So Naomi returned together with Ruth the Moabite, her daughter-in-law, who came back with her from the country of Moab. They came to Bethlehem at the beginning of the barley harvest."}]]