[{"header":"Elimelech’s Family in Moab"},{"num":1,"verse":"It came to pass in the days when judges were governing, there was a famine in the land. A man went from the town of Bethlehem in Judah to dwell in the region of Moab with his wife and his two sons. "},{"num":2,"verse":"The man’s name was Elimelech, his wife’s name was Naomi, and his two sons were named Mahlon and Chilion. They were Ephratites from Bethlehem in Judah. They came to the region of Moab and remained there."},{"num":3,"verse":"Then Naomi’s husband Elimelech died, so she was left with her two sons. "},{"num":4,"verse":"They married Moabite women—one was named Orpah and the second was named Ruth, and they dwelt there about ten years. "},{"num":5,"verse":"Then those two, Mahlon and Chilion, also died. So the woman was left without her children and her husband."},{"num":6,"verse":"Then she got up, along with her daughters-in-law to return from the region of Moab, because in the region of Moab she had heard that Adonai had taken note of His people and given them food. "},{"num":7,"verse":"So she left the place where she was, along with her two daughters-in-law, and they started out on the road to return to the land of Judah."},{"num":8,"verse":"So Naomi said to her two daughters-in-law, “Go, return each of you to your mother’s house. May Adonai show you the same kindness that you have shown to the dead and to me. "},{"num":9,"verse":"May Adonai grant that you find rest, each of you in the house of her own husband.” Then she kissed them and they wept loudly."},{"num":10,"verse":"“No!” they said to her, “we will return with you to your people.”"},{"num":11,"verse":"Now Naomi said, “Go back, my daughters! Why should you go with me? Do I have more sons in my womb who could become your husbands? "},{"num":12,"verse":"Go home, my daughters! I am too old to have a husband. Even if I were to say that there was hope for me and I could get married tonight, and then bore sons, "},{"num":13,"verse":"would you wait for them to grow up? Would you therefore hold off getting married? No, my daughters, it is more bitter for me than for you—for the hand of Adonai has gone out against me!”"},{"num":14,"verse":"Again they broke into loud weeping. Then Orpah kissed her mother-in-law goodbye. But Ruth clung to her. "},{"num":15,"verse":"She said, “Look, your sister-in-law is going back to her people and her gods. Return, along with your sister-in-law!”"},{"header":"Ruth’s Covenant With Naomi"},{"num":16,"verse":"Ruth replied,"},{"num":18,"verse":"When she saw that Ruth was determined to go with her, she no longer spoke to Ruth about it."},{"num":19,"verse":"So the two of them went on until they arrived in Bethlehem. As soon as they arrived in Bethlehem the whole city was excited because of them, and the women asked, “Is this Naomi?”"},{"num":20,"verse":"“Do not call me Naomi,” she told them. “Call me Mara—since Shaddai has made my life bitter."},{"num":21,"verse":" I went away full, but Adonai has brought me back empty. Why should you call me Naomi, since Adonai has testified against me and Shaddai has brought calamity on me?”"},{"num":22,"verse":"So Naomi and her daughter-in-law Ruth the Moabitess returned from the region of Moab. They arrived in Bethlehem at the beginning of the barley harvest."}]