[{"header":"The Eastern Tribes Return Home"},{"num":22,"verse":"Then Joshua summoned the Reubenites, the Gadites, and the half-tribe of Manasseh. "},{"num":2,"verse":"He said to them, “You have done everything that Moses the servant of the Lord commanded you and have obeyed me in everything that I have commanded you. "},{"num":3,"verse":"You have not left your brothers these many days down to this day, and you have observed the obligations of the commandment of the Lord your God. "},{"num":4,"verse":"Now the Lord your God has given rest to your brothers, as He had said to them. So now, turn and go to your homes, to the land of your possession, which Moses the servant of the Lord gave you on the other side of the Jordan. "},{"num":5,"verse":"Only carefully obey the commandment and the law that Moses the servant of the Lord commanded you: to love the Lord your God, to walk in all His ways, to obey His commandments, to cling to Him, and to serve Him with all your heart and soul.”"},{"num":6,"verse":"Joshua blessed them and sent them off, and they went to their tents. "},{"num":7,"verse":"Moses had assigned land in Bashan to half the tribe of Manasseh, and to the other half Joshua assigned land among their brothers on the west side of the Jordan. When Joshua sent them also to their homes and blessed them, "},{"num":8,"verse":"he said, “Return home with great wealth, much livestock, silver, gold, copper, iron, and great quantities of clothing. Divide the spoil of your enemies among your brothers.”"},{"num":9,"verse":"So the Reubenites, Gadites, and the half-tribe of Manasseh left the children of Israel at Shiloh in the land of Canaan to go to the land of Gilead, the land of their possession, according to the word of the Lord through Moses."},{"num":10,"verse":"The tribes of Reuben, Gad, and the half-tribe of Manasseh came near the Jordan in the land of Canaan and built a very large altar by the Jordan. "},{"num":11,"verse":"The children of Israel heard someone say, “The tribes of Reuben, Gad, and the half-tribe of Manasseh have built an altar by the land of Canaan by the Jordan on the Israelite side.” "},{"num":12,"verse":"When the children of Israel heard this, they assembled the whole congregation of the children of Israel at Shiloh to go up against them in war."},{"num":13,"verse":"Then the children of Israel sent Phinehas, son of Eleazar the priest, to the sons of Reuben, to the sons of Gad, and to the half-tribe of Manasseh, into the land of Gilead, "},{"num":14,"verse":"and with him ten chiefs, one chief each for each father’s household of every tribe of Israel; and each one of them was the head of his father’s house among the thousands of Israel."},{"num":15,"verse":"They came to the tribes of Reuben, Gad, and the half-tribe of Manasseh in the land of Gilead and said to them, "},{"num":16,"verse":"“The whole congregation of the Lord says, ‘What is this trespass you have committed against the God of Israel? Today you have turned from following the Lord by building yourselves an altar to rebel against Him! "},{"num":17,"verse":"Is the sin of Peor, from which we have still not purified ourselves even today, not enough for us, which brought a plague upon the congregation of the Lord "},{"num":18,"verse":"that today you have turned away from following the Lord?"},{"num":19,"verse":"If indeed your own land is unclean, then cross over to the land of the Lord where the tabernacle of the Lord stands and take land among us. Yet do not rebel against the Lord or rebel against us by building an altar other than the altar of the Lord our God. "},{"num":20,"verse":"Did not Achan son of Zerah commit a trespass in the things under the ban, and wrath fall on all the congregation of Israel? And that man did not perish alone in his iniquity.’ ”"},{"num":21,"verse":"Then the tribes of Reuben, Gad, and the half-tribe of Manasseh answered and said to the heads of the Israelite clans, "},{"num":22,"verse":"“The Lord God of gods, the Lord God of gods, He knows, and may Israel know—if we have acted in rebellion or disloyalty against the Lord, do not spare us today. "},{"num":23,"verse":"If we have built an altar to turn away from following the Lord, to offer burnt offerings and grain offerings or make peace offerings upon it, may the Lord Himself demand an account."},{"num":24,"verse":"“We did this deed because we were worried that in the future your descendants might say, ‘What have you to do with the Lord God of Israel? "},{"num":25,"verse":"The Lord made the Jordan a boundary between us and you, the descendants of Reuben and Gad. You have no share in the Lord!’ In this way your descendants might make our descendants to stop worshipping the Lord."},{"num":26,"verse":"“So we said to each other, ‘Let us build this altar, not for burnt offering or sacrifice, "},{"num":27,"verse":"but as a witness for us, for you, and for the generations after us, that we may perform the service of the Lord before Him with our burnt offerings, sacrifices, and peace offerings, and in the future your descendants will not be able to say to our descendants, “You have no share in the Lord!” ’"},{"num":28,"verse":"“Therefore we said, ‘In the future, if they say this to us or to our descendants, we will say, “Look at the replica of the altar of the Lord that our fathers made, not for burnt offerings or sacrifices, but as a witness between you and us.” ’"},{"num":29,"verse":"“God forbid that we should rebel against the Lord by turning from following the Lord today by building an altar for burnt offerings, grain offerings, and sacrifices other than the altar of the Lord God that stands before His tabernacle!”"},{"num":30,"verse":"When Phinehas the priest, the leaders of the congregation, and the heads of the Israelite clans who were with him heard what the descendants of Reuben, Gad, and Manasseh said, it pleased them. "},{"num":31,"verse":"Phinehas son of Eleazar the priest said to the descendants of Reuben, Gad, and Manasseh, “Today we know that the Lord is in our midst because you did not violate your obligations to the Lord in this matter. Indeed, you have delivered the children of Israel from the judgment of the Lord.”"},{"num":32,"verse":"Then Phinehas son of Eleazar the priest and the leaders returned from meeting the descendants of Reuben and Gad in the land of Gilead to the children of Israel in the land of Canaan. They brought back a report. "},{"num":33,"verse":"This report was good in the eyes of the children of Israel, and the children of Israel blessed God. They decided not to make war against the descendants of Reuben and Gad to ruin the land in which they lived."},{"num":34,"verse":"The descendants of Reuben and Gad named the altar Witness, “For it is a witness between us that the Lord is God.”"}]