[{"header":"Three Tribes Go Home"},{"num":22,"verse":"Then Joshua called a meeting of all the people from the tribes of Reuben, Gad, and East Manasseh. "},{"num":2,"verse":"He said to them, “You have done everything Moses, the Lord’s servant, told you to do. You have also obeyed all my commands. "},{"num":3,"verse":"For a long time you have supported the other Israelites. You have been careful to obey the commands the Lord your God gave you. "},{"num":4,"verse":"The Lord your God promised to give the Israelites peace, and he has kept his promise. Now you may go back to your homes, to the land that Moses, the Lord’s servant, gave you, on the east side of the Jordan River. "},{"num":5,"verse":"But be careful to obey the teachings and laws Moses, the Lord’s servant, gave you: to love the Lord your God and obey his commands, to continue to follow him and serve him the very best you can.”"},{"num":6,"verse":"Then Joshua said good-bye to them, and they left and went away to their homes. "},{"num":7,"verse":"Moses had given the land of Bashan to East Manasseh. Joshua gave land on the west side of the Jordan River to West Manasseh. And he sent them to their homes and he blessed them. "},{"num":8,"verse":"He said, “Go back to your homes and your riches. You have many animals, silver, gold, bronze, and iron, and many beautiful clothes. Also, you have taken many things from your enemies that you should divide among yourselves.”"},{"num":9,"verse":"So the people from the tribes of Reuben, Gad, and East Manasseh left the other Israelites at Shiloh in Canaan and went back to Gilead. It was their own land, given to them by Moses as the Lord had commanded."},{"num":10,"verse":"The people of Reuben, Gad, and East Manasseh went to Geliloth, near the Jordan River in the land of Canaan. There they built a beautiful altar. "},{"num":11,"verse":"The other Israelites still at Shiloh heard about the altar these three tribes built at the border of Canaan at Geliloth, near the Jordan River on Israel’s side. "},{"num":12,"verse":"All the Israelites became very angry at these three tribes, so they met together and decided to fight them."},{"num":13,"verse":"The Israelites sent Phinehas son of Eleazar the priest to Gilead to talk to the people of Reuben, Gad, and East Manasseh. "},{"num":14,"verse":"They also sent one leader from each of the ten tribes at Shiloh. Each of them was a leader of his family group of Israelites."},{"num":15,"verse":"These leaders went to Gilead to talk to the people of Reuben, Gad, and East Manasseh. They said: "},{"num":16,"verse":"“All the Israelites ask you: ‘Why did you turn against the God of Israel by building an altar for yourselves? You know that this is against God’s law. "},{"num":17,"verse":"Remember what happened at Peor? We still suffer today because of that sin, for which God made many Israelites very sick. "},{"num":18,"verse":"And now are you turning against the Lord and refusing to follow him?"},{"num":19,"verse":"If your land is unclean, come over into our land where the Lord’s Tent is. Share it with us. But don’t turn against the Lord and us by building another altar for the Lord our God. "},{"num":20,"verse":"Remember how Achan son of Zerah refused to obey the command about what must be completely destroyed. That one man broke God’s law, but all the Israelites were punished. Achan died because of his sin, but others also died.’”"},{"num":21,"verse":"The people from Reuben, Gad, and East Manasseh answered, "},{"num":22,"verse":"“The Lord is God of gods! The Lord is God of gods! God knows, and we want you to know also. If we have done something wrong, you may kill us. "},{"num":23,"verse":"If we broke God’s law, we ask the Lord himself to punish us. We did not build this altar to offer burnt offerings or grain and fellowship offerings."},{"num":24,"verse":"“We did not build it for that reason. We feared that someday your people would not accept us as part of your nation. Then they might say, ‘You cannot worship the Lord, the God of Israel. "},{"num":25,"verse":"The Lord made the Jordan River a border between us and you people of Reuben and Gad. You cannot worship the Lord.’ So we feared that your children might make our children stop worshiping the Lord."},{"num":26,"verse":"“That is why we decided to build this altar. But it is not for burnt offerings and sacrifices. "},{"num":27,"verse":"This altar is proof to you and us and to all our children who will come after us that we worship the Lord with our whole burnt offerings, grain, and fellowship offerings. This was so your children would not say to our children, ‘You are not the Lord’s.’"},{"num":28,"verse":"“In the future if your children say that, our children can say, ‘See the altar made by our ancestors. It is exactly like the Lord’s altar, but we do not use it for sacrifices. It shows that we are part of Israel.’"},{"num":29,"verse":"“Truly, we don’t want to be against the Lord or to stop following him by building an altar for burnt offerings, grain offerings, or sacrifices. We know the only true altar to the Lord our God is in front of the Holy Tent.”"},{"num":30,"verse":"When Phinehas the priest and the ten leaders heard the people of Reuben, Gad, and East Manasseh, they were pleased. "},{"num":31,"verse":"So Phinehas, son of Eleazar the priest, said, “Now we know the Lord is with us and that you didn’t turn against him. Now the Israelites will not be punished by the Lord.”"},{"num":32,"verse":"Then Phinehas and the leaders left the people of Reuben and Gad in Gilead and went back to Canaan where they told the Israelites what had happened. "},{"num":33,"verse":"They were pleased and thanked God. So they decided not to fight the people of Reuben and Gad and destroy those lands."},{"num":34,"verse":"And the people of Reuben and Gad named the altar Proof That We Believe the Lord Is God."}]