[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 18:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall I hide from Abraham that thing which I do ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Thus doth God in his counsels express himself after the manner of men, with deliberation. “The secret of the Lord is with them that fear him.” Those that by faith live a life of communion with God, cannot but know more of his mind than other people. They have a better insight into what is present, and a better foresight of what is to come.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:16-22 The two who are supposed to have been created angels went toward Sodom. The one who is called Jehovah throughout the chapter, continued with Abraham, and would not hide from him the thing he intended to do. Though God long forbears with sinners, from which they fancy that the Lord does not see, and does not regard; yet when the day of his wrath comes, he will look toward them. The Lord will give Abraham an opportunity to intercede with him, and shows him the reason of his conduct. Consider, as a very bright part of Abraham's character and example, that he not only prayed with his family, but he was very careful to teach and rule them well. Those who expect family blessings must make conscience of family duty. Abraham did not fill their heads with matters of doubtful dispute; but he taught them to be serious and devout in the worship of God, and to be honest in their dealings with all men. Of how few may such a character be given in our days! How little care is taken by masters of families to ground those under them in the principles of religion! Do we watch from sabbath to sabbath whether they go forward or backward?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The promise to Sarah. The men now enter upon the business of their visit. \"Where is Sarah thy wife?\" The jealousy and seclusion of later times had not yet rendered such an inquiry uncourteous. Sarah is within hearing of the conversation. \"I will certainly return unto thee.\" This is the language of self-determination, and therefore suitable to the sovereign, not to the ambassador. \"At the time of life;\" literally the living time, seemingly the time of birth, when the child comes to manifest life. \"Sarah thy wife shall have a son.\" Sarah hears this with incredulous surprise, and laughs with mingled doubt and delight. She knows that in the nature of things she is past child-bearing. \"Is anything too hard for the Lord?\" Sarah laughed within herself, within the tent and behind the speaker; yet to her surprise her internal feelings are known to him. She finds there is One present who rises above the sphere of nature. In her confusion and terror she denies that she laughed. But he who sees what is within, insists that she did laugh, at least in the thought of her heart. There is a beautiful simplicity in the whole scene. Sarah now doubtless received faith and strength to conceive.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Verse 16-33",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The conference concerning Sodom. The human manner of the interview is carried out to the end. Abraham convoys his departing guests. The Lord then speaks, apparently debating with himself whether he shall reveal his intentions to Abraham. The reasons for doing so are assigned. First. Abraham shall surely become a nation great and mighty, and therefore has the interest of humanity in this act of retribution on Sodom. All that concerns man concerns him. Second. Blessed in him shall be all the nations of the earth. Hence, he is personally and directly concerned with all the dealings of mercy and judgment among the inhabitants of the earth. Third. \"I have known him.\" The Lord has made himself known to him, has manifested his love to him, has renewed him after his own image; and hence this judgment upon Sodom is to be explained to him, that he may train his household to avoid the sins of this doomed city, \"to keep the way of the Lord, to do justice and judgment; and all this to the further intent that the Lord may bring upon Abraham what he hath spoken of him.\" The awful judgments of the Lord on Sodom, as before on the antediluvian world, are a warning example to all who are spared or hear of them. And those who, notwithstanding these monuments of the divine vengeance, will cease to do justice and judgment, may be certain that they will not continue to enjoy the benefits of the covenant of grace. For all these reasons it is meet that the secret of Lord be with him Psalm 25:11.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The conference concerning Sodom. The human manner of the interview is carried out to the end. Abraham convoys his departing guests. The Lord then speaks, apparently debating with himself whether he shall reveal his intentions to Abraham. The reasons for doing so are assigned. First. Abraham shall surely become a nation great and mighty, and therefore has the interest of humanity in this act of retribution on Sodom. All that concerns man concerns him. Second. Blessed in him shall be all the nations of the earth. Hence, he is personally and directly concerned with all the dealings of mercy and judgment among the inhabitants of the earth. Third. \"I have known him.\" The Lord has made himself known to him, has manifested his love to him, has renewed him after his own image; and hence this judgment upon Sodom is to be explained to him, that he may train his household to avoid the sins of this doomed city, \"to keep the way of the Lord, to do justice and judgment; and all this to the further intent that the Lord may bring upon Abraham what he hath spoken of him.\" The awful judgments of the Lord on Sodom, as before on the antediluvian world, are a warning example to all who are spared or hear of them. And those who, notwithstanding these monuments of the divine vengeance, will cease to do justice and judgment, may be certain that they will not continue to enjoy the benefits of the covenant of grace. For all these reasons it is meet that the secret of Lord be with him ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. the Lord said, Shall I hide—The chief stranger, no other than the Lord, disclosed to Abraham the awful doom about to be inflicted on Sodom and the cities of the plain for their enormous wickedness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " q.d. I will not, cannot hide it; it is against the laws of friendship to conceal my secrets from him. The interrogation here is in effect a negation, as elsewhere. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Samuel 7:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Chronicles 17:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 17:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Matthew 7:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 7:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Luke 6:43",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 6:43",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". See also ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Amos 3:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord said,.... Either unto Abraham himself, so leading on to what he was about to make known to him; and without supposing this it will be difficult to account for Abraham's intercession for Sodom upon this: or to the two angels with him; not as consulting them whether he should or no do what he next suggests, but to give to them Abraham's just character, and the reasons of his using him in such a friendly manner: or it may be, to the other divine Persons, the Father and Spirit, one with the Son of God, and always present with him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall I hide from Abraham the thing which I do? which he was about to do, namely, the destruction of Sodom and Gomorrah: the Jewish writers (a) observe, that these cities were given in the grant of the whole land to Abraham, and therefore it was right to acquaint him with it first: but other and better reasons are given in the next words; Abraham was a friend of the Lord, and he had showed himself friendly to him, not only now, but heretofore, and therefore will treat him as his friend, by imparting his secrets to him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Targ. Jerus. & Jarchi in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Targ. Jerus. & Jarchi in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the {h} LORD said, Shall I hide from Abraham that thing which I do;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " LORD said, Shall I hide from Abraham that thing which I do;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Jehovah the Hebrew word we call Lord, shows that this angel was Christ: for this word is only applied to God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the Lord said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. within Himself: cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “I thought,” lit. “I said.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall I hide from Abraham",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] With the thought of this verse, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “shall evil befall a city, and the Lord hath not done it? Surely the Lord God will do nothing, but he revealeth his secret unto his servants the prophets.” Here Jehovah purposes to reveal His intention to Abraham on account of his position as one who was in covenant relation, and the recipient of the promise (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 18:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- And the Lord said",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "- ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And the Lord said",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (to himself), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall I hide from Abraham",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - the LXX. interpolate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τοῦ παιδός μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but, as Philo observes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τοῦ φιλοῦ μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would have been a more appropriate designation for the patriarch (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 20:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that thing which I do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " propose to do, the present being used for the future, where, as m the utterances of God, whose will is equivalent to his deed, the action is regarded by the Speaker as being already as good as finished (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ewald, 'Hebrews Synt.,' § 135; Gesenius, § 126). Genesis 18:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After this conversation with Sarah, the heavenly guests rose up and turned their faces towards the plain of Sodom (פּני על, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Abraham accompanied them some distance on the road; according to tradition, he went as far as the site of the later Caphar barucha, from which you can see the Dead Sea through a ravine, - solitudinem ac terras Sodomae. And Jehovah said, \"Shall I hide from Abraham what I propose to do? Abraham is destined to be a great nation and a blessing to all nations (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for I have known, i.e., acknowledged him (chosen him in anticipative love, ידע as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that he may command his whole posterity to keep the way of Jehovah, to practise justice and righteousness, that all the promises may be fulfilled in them.\" God then disclosed to Abraham what he was about to do to Sodom and Gomorrah, not, as Kurtz supposes, because Abraham had been constituted the hereditary possessor of the land, and Jehovah, being mindful of His covenant, would not do anything to it without his knowledge and assent (a thought quite foreign to the context), but because Jehovah had chosen him to be the father of the people of God, in order that, by instructing his descendants in the fear of God, he might lead them in the paths of righteousness, so that they might become partakers of the promised salvation, and not be overtaken by judgment. The destruction of Sodom and the surrounding cities was to be a permanent memorial of the punitive righteousness of God, and to keep the fate of the ungodly constantly before the mind of Israel. To this end Jehovah explained to Abraham the cause of their destruction in the clearest manner possible, that he might not only be convinced of the justice of the divine government, but might learn that when the measure of iniquity was full, no intercession could avert the judgment-a lesson and a warning to his descendants also. ",
        "children": []
      }
    ]
  }
]