[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They said.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—But in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “he said,” and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c, “the Lord (Jehovah) said.” The messenger speaks as one with Jehovah, or as being His representative.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Where is Sarah thy wife?—This question is contrary to Oriental manners, as the women may be referred to only in the most indirect manner. But during the meal Abraham, as he talked with the strangers, had probably begun to recognise in them something more than human.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Where is Sarah thy wife?",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This question is contrary to Oriental manners, as the women may be referred to only in the most indirect manner. But during the meal Abraham, as he talked with the strangers, had probably begun to recognise in them something more than human.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 18:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Where is Sarah thy wife? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By naming her, they gave intimation to Abraham, that though they seemed strangers, yet they well knew him and his family: by inquiring after her, they showed a kind concern for the family of one whom they found respectful to them. And by speaking of her, she overhearing it, they drew her to listen to what was further to be said.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:9-15 Where is Sarah thy wife? was asked. Note the answer, In the tent. Just at hand, in her proper place, occupied in her household concerns. There is nothing got by gadding. Those are most likely to receive comfort from God and his promises, who are in their proper place, and in the way of their duty, Lu 2:8. We are slow of heart to believe, and need line upon line to the same purport. The blessings others have from common providence, believers have from the Divine promise, which makes them very sweet, and very sure. The spiritual seed of Abraham owe their life, and joy, and hope, and all, to the promise. Sarah thinks this too good news to be true; she laughed, and therefore cannot as yet find in her heart to believe it. Sarah laughed. We might not have thought there was a difference between Sarah's laughter and Abraham's, ch. 17:17; but He who searches the heart, saw that the one sprung from unbelief, and the other from faith. She denied that she had laughed. One sin commonly brings in another, and it is not likely we shall strictly keep to truth, when we question the Divine truth. But whom the Lord loves he will rebuke, convict, silence, and bring to repentance, and if they sin before him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The promise to Sarah. The men now enter upon the business of their visit. \"Where is Sarah thy wife?\" The jealousy and seclusion of later times had not yet rendered such an inquiry uncourteous. Sarah is within hearing of the conversation. \"I will certainly return unto thee.\" This is the language of self-determination, and therefore suitable to the sovereign, not to the ambassador. \"At the time of life;\" literally the living time, seemingly the time of birth, when the child comes to manifest life. \"Sarah thy wife shall have a son.\" Sarah hears this with incredulous surprise, and laughs with mingled doubt and delight. She knows that in the nature of things she is past child-bearing. \"Is anything too hard for the Lord?\" Sarah laughed within herself, within the tent and behind the speaker; yet to her surprise her internal feelings are known to him. She finds there is One present who rises above the sphere of nature. In her confusion and terror she denies that she laughed. But he who sees what is within, insists that she did laugh, at least in the thought of her heart. There is a beautiful simplicity in the whole scene. Sarah now doubtless received faith and strength to conceive.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Verse 16-33",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The conference concerning Sodom. The human manner of the interview is carried out to the end. Abraham convoys his departing guests. The Lord then speaks, apparently debating with himself whether he shall reveal his intentions to Abraham. The reasons for doing so are assigned. First. Abraham shall surely become a nation great and mighty, and therefore has the interest of humanity in this act of retribution on Sodom. All that concerns man concerns him. Second. Blessed in him shall be all the nations of the earth. Hence, he is personally and directly concerned with all the dealings of mercy and judgment among the inhabitants of the earth. Third. \"I have known him.\" The Lord has made himself known to him, has manifested his love to him, has renewed him after his own image; and hence this judgment upon Sodom is to be explained to him, that he may train his household to avoid the sins of this doomed city, \"to keep the way of the Lord, to do justice and judgment; and all this to the further intent that the Lord may bring upon Abraham what he hath spoken of him.\" The awful judgments of the Lord on Sodom, as before on the antediluvian world, are a warning example to all who are spared or hear of them. And those who, notwithstanding these monuments of the divine vengeance, will cease to do justice and judgment, may be certain that they will not continue to enjoy the benefits of the covenant of grace. For all these reasons it is meet that the secret of Lord be with him Psalm 25:11.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The conference concerning Sodom. The human manner of the interview is carried out to the end. Abraham convoys his departing guests. The Lord then speaks, apparently debating with himself whether he shall reveal his intentions to Abraham. The reasons for doing so are assigned. First. Abraham shall surely become a nation great and mighty, and therefore has the interest of humanity in this act of retribution on Sodom. All that concerns man concerns him. Second. Blessed in him shall be all the nations of the earth. Hence, he is personally and directly concerned with all the dealings of mercy and judgment among the inhabitants of the earth. Third. \"I have known him.\" The Lord has made himself known to him, has manifested his love to him, has renewed him after his own image; and hence this judgment upon Sodom is to be explained to him, that he may train his household to avoid the sins of this doomed city, \"to keep the way of the Lord, to do justice and judgment; and all this to the further intent that the Lord may bring upon Abraham what he hath spoken of him.\" The awful judgments of the Lord on Sodom, as before on the antediluvian world, are a warning example to all who are spared or hear of them. And those who, notwithstanding these monuments of the divine vengeance, will cease to do justice and judgment, may be certain that they will not continue to enjoy the benefits of the covenant of grace. For all these reasons it is meet that the secret of Lord be with him ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ge 18:9-15. Reproof of Sarah. An inquiry about his wife, so surprising in strangers, the subject of conversation, and the fulfilment of the fondly cherished promise within a specified time, showed Abraham that he had been entertaining more than ordinary travellers (Heb 13:2).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They said unto him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. one of them, in the name of all, said; which he did not for his own satisfaction, for he who knew her name knew also where she was, but to give occasion for the following discourse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the tent; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in her tent; for men and women had then their several tents or apartments. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they said unto him, where is Sarah thy wife?.... One of them put the question; and so the Septuagint version renders it, \"and he said unto him\", the principal of them, whom Abraham at first addressed and called him \"my Lord\", and was no other than the Son of God in an human form; and various things in the context show him to be a divine Person, particularly his promise of return next year, and Sarah should have a son: and the question here put by him was not out of ignorance, for he who knew the name of Abraham's wife, knew where she was; but this was asked in order to lead on to say something more concerning her, and that, hearing her name, she might draw nearer and listen to what was said of her: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he said, behold, in the tent; for in those times they dwelt in tents, and this was either the tent common to the family, or rather was Sarah's own tent, Genesis 24:67; Sarah was where she should be, in her own apartment, attending to the business of her family, and answered to the description the apostle gives of a good housewife, a keeper at home, Titus 2:5; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he said, behold, in the tent; for in those times they dwelt in tents, and this was either the tent common to the family, or rather was Sarah's own tent, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:67",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Sarah was where she should be, in her own apartment, attending to the business of her family, and answered to the description the apostle gives of a good housewife, a keeper at home, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Titus 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they said unto him, Where is Sarah thy wife? And he said, Behold, in the tent.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sarah thy wife",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The knowledge of his wife’s name must have caused Abraham surprise, and gives perhaps the first indication of his guests’ real character.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they said unto him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Principal One of the three, speaking for the others, interrogated Abraham during the progress, or perhaps at the close of, the meal saying), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Where is Sarah thy wife?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (thus indicating that their visit had a special reference to her). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he said, Behold, in the tent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is obvious that if at first Abraham regarded his visitors only as men, by this time a suspicion of their true character must have begun to dawn upon his mind. How should ordinary travelers be aware of his wife s name? and why should they do so unusual a thing, according to Oriental manners, as to inquire after her? If thus far their behavior could not fail to surprise the patriarch, what must have been his astonishment at the subsequent communication? Genesis 18:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "During the meal, at which Abraham stood, and waited upon them as the host, they asked for Sarah, for whom the visit was chiefly intended. On being told that she was in the tent, where she could hear, therefore, all that passed under the tree in front of the tent, the one whom Abraham addressed as Adonai (my Lord), and who is called Jehovah in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 18:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", said, \"I will return to thee (חיּה כּעת) at this time, when it lives again\" (חיּה, reviviscens, without the article, Ges. 111, 2b), i.e., at this time next year; \"and, behold, Sarah, thy wife, will (then) have a son.\" Sarah heard this at the door of the tent; \"and it was behind Him\" (Jehovah), so that she could not be seen by Him as she stood at the door. But as the fulfilment of this promise seemed impossible to her, on account of Abraham's extreme age, and the fact that her own womb had lost the power of conception, she laughed within herself, thinking that she was not observed. But that she might know that the promise was made by the omniscient and omnipotent God, He reproved her for laughing, saying, \"Is anything too wonderful (i.e., impossible) for Jehovah? at the time appointed I will return unto thee,\" etc.; and when her perplexity led her to deny it, He convicted her of falsehood. Abraham also had laughed at this promise (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and without receiving any reproof. For his laughing was the joyous outburst of astonishment; Sarah's, on the contrary, the result of doubt and unbelief, which had to be broken down by reproof, and, as the result showed, really was broken down, inasmuch as she conceived and bore a son, whom she could only have conceived in faith (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]