[{"header":"The Priestly Garments"},{"num":28,"verse":"And bring near to yourself Aaron, your brother, and his sons with him from among the children of Israel, so that they may minister to Me as priests—Aaron, Nadab and Abihu, Eleazar and Ithamar, Aaron’s sons. "},{"num":2,"verse":"You shall make holy garments for your brother Aaron, for glory and for beauty. "},{"num":3,"verse":"You shall speak to all who are specially skilled, whom I have filled with the spirit of wisdom, that they may make Aaron’s garments to consecrate him, that he may minister to Me as a priest. "},{"num":4,"verse":"These are the garments which they shall make: a breastplate, and an ephod, and a robe, and an embroidered coat, a turban, and a sash. They shall make holy garments for Aaron your brother and his sons, that he may minister to Me as priest. "},{"num":5,"verse":"They shall take the gold, the blue, the purple, and the scarlet, and fine linen."},{"header":"The Ephod(A)"},{"num":6,"verse":"They shall make the ephod of gold, of blue, and of purple, of scarlet, and fine twined linen, the work of a skilled workman. "},{"num":7,"verse":"It shall have the two shoulder pieces attached to its two corners, so it shall be joined together. "},{"num":8,"verse":"The skillfully woven waistband of the ephod, which is on it, shall be of the same workmanship, of the same material: of gold, of blue and purple, and scarlet, and fine twisted linen."},{"num":9,"verse":"You shall take two onyx stones and engrave on them the names of the children of Israel, "},{"num":10,"verse":"six of their names on one stone, and the other six names of the rest on the other stone, according to their birth. "},{"num":11,"verse":"With the work of an engraver in stone, like the engravings of a signet, you shall engrave the two stones with the names of the children of Israel. You shall set them in filigree of gold. "},{"num":12,"verse":"You shall put the two stones on the shoulders of the ephod as stones of memorial for the children of Israel, and Aaron shall bear their names before the Lord on his two shoulders as a memorial. "},{"num":13,"verse":"You shall make filigree settings of gold, "},{"num":14,"verse":"and two chains of pure gold. You shall make them of twisted cord and fasten the braided chains to the filigree settings."},{"header":"The Breastplate(B)"},{"num":15,"verse":"You shall make the breastplate of judgment, the work of a skillful workman. You shall make it in the same manner as the ephod. Of gold, of blue, and of purple, and of scarlet, and of fine twisted linen you shall make it. "},{"num":16,"verse":"It is to be square when doubled: a span in length and a span in width. "},{"num":17,"verse":"You shall set in it four rows of stones. The first row shall be a sardius, a topaz, and a carbuncle; "},{"num":18,"verse":"the second row an emerald, a sapphire, and a diamond; "},{"num":19,"verse":"the third row a jacinth, an agate, and an amethyst; "},{"num":20,"verse":"and the fourth row a beryl, an onyx, and a jasper. They shall be set in gold filigree. "},{"num":21,"verse":"The stones shall be according to the names of the children of Israel, twelve, according to their names, each like the engravings of a signet, every one according to his name for the twelve tribes."},{"num":22,"verse":"You shall make for the breastplate braided chains of pure gold. "},{"num":23,"verse":"You shall make on the breastplate two rings of gold and shall put the two rings on the two ends of the breastplate. "},{"num":24,"verse":"You shall put the two braided chains of gold on the two rings which are on the ends of the breastplate. "},{"num":25,"verse":"You shall fasten the other two ends of the two braided chains in the two filigree settings and put them on the front of the shoulder pieces of the ephod. "},{"num":26,"verse":"You shall make two rings of gold and shall put them on the two ends of the breastplate, on the edge of it which is toward the inner side of the ephod. "},{"num":27,"verse":"You shall make two other rings of gold and shall put them on the two shoulder pieces of the ephod underneath toward the front, close to the place where it is joined above the skillfully woven waistband of the ephod. "},{"num":28,"verse":"They shall bind the breastplate by its rings to the rings of the ephod with a blue cord, so that it may be above the skillfully woven waistband of the ephod, and so that the breastplate will not come loose from the ephod."},{"num":29,"verse":"Aaron shall bear the names of the children of Israel on the breastplate of judgment over his heart when he goes into the holy place, as a memorial before the Lord continually. "},{"num":30,"verse":"You shall put the Urim and the Thummim in the breastplate of judgment, and they shall be over Aaron’s heart when he goes in before the Lord. And Aaron shall bear the judgment of the children of Israel over his heart before the Lord continually."},{"header":"Other Priestly Garments(C)"},{"num":31,"verse":"You shall make the robe of the ephod completely blue. "},{"num":32,"verse":"There shall be a hole at the top of it, in the middle of it. Around its opening it shall have a binding of woven work, like the opening of a coat of mail, so that it will not be torn. "},{"num":33,"verse":"You shall make on its hem pomegranates of blue, and of purple, and of scarlet, all around its hem, and bells of gold between them all around: "},{"num":34,"verse":"a golden bell and a pomegranate, a golden bell and a pomegranate, all around on the hem of the robe. "},{"num":35,"verse":"It shall be on Aaron when he ministers. And its sound shall be heard when he goes into the holy place before the Lord, and when he comes out, so that he does not die."},{"num":36,"verse":"You shall make a plate of pure gold and engrave on it, like the engravings of a signet,"},{"num":37,"verse":"You shall put it on a blue cord, so that it may be upon the turban. It is to be on the front of the turban. "},{"num":38,"verse":"It shall be on Aaron’s forehead, so that Aaron may bear the iniquity of the holy things which the children of Israel shall consecrate in regard to all their holy gifts. And it shall always be on his forehead, so that they may be accepted before the Lord."},{"num":39,"verse":"You shall embroider the tunic of fine linen, and you shall make the turban of fine linen, and you shall make the sash, the work of an embroiderer. "},{"num":40,"verse":"For Aaron’s sons you shall make tunics. You shall make sashes for them, and you shall make caps for them, for glory and for beauty. "},{"num":41,"verse":"You shall put them on Aaron your brother, and on his sons with him, and shall anoint them, and consecrate them, and sanctify them, that they may minister to Me as priests."},{"num":42,"verse":"You shall make linen undergarments for them to cover their naked skin. They shall reach from the waist to the thighs. "},{"num":43,"verse":"They shall be on Aaron and on his sons when they come into the tent of meeting or when they come near to the altar to minister in the holy place, so that they may not bear iniquity and die."}]