[{"num":28,"verse":"And bring thou near unto thee Aharon thy brother, and his banim with him, from the midst of the Bnei Yisroel, that he may minister unto Me in the kohen’s office, even Aharon, Nadav and Avihu, Eleazar and Itamar, Bnei Aharon."},{"num":2,"verse":"And thou shalt make Bigdei Kodesh for Aharon thy brother for kavod and tiferet."},{"num":3,"verse":"And thou shalt speak unto all that are of chochmei lev, whom I have filled with the Ruach Chochmah, that they may make Bigdei Aharon to set him apart as kodesh, that he may minister unto Me in the kohen’s office."},{"num":4,"verse":"And these are HaBegadim which they shall make: a Choshen, and an Ephod, and a Me’il, and a Kesones of a box-like knitting work, a Mitznefet, and an Avnet; and they shall make Bigdei Kodesh for Aharon thy brother, and his Banim, that he may minister unto Me in the kohen’s office."},{"num":5,"verse":"And they shall take zahav, and turquoise, and purple, and scarlet wool, and linen."},{"num":6,"verse":"And they shall make the Ephod of zahav, of turquoise, and of purple, of scarlet wool, and twisted linen, with ma’aseh choshev (artistic embroidery)."},{"num":7,"verse":"It shall have the two ketefot (shoulder straps) thereof joined at the two sides thereof; and so it shall be joined together."},{"num":8,"verse":"And the Cheishev of his Ephod, which is upon it, shall be of the same, according to the work thereof; even of zahav, of turquoise, and purple, and scarlet wool, and twisted linen."},{"num":9,"verse":"And thou shalt take two avnei shoham (onyx stones), and engrave on them the Shemot of the Bnei Yisroel:"},{"num":10,"verse":"Shisha of their Shemot on one even (stone), and the other Shemot of the shisha remaining on the other even (stone), according to toldot (in the order in which they were born)."},{"num":11,"verse":"With the work of a charash even (engraver in gemstones), like the engravings of a chotam (signet ring), shalt thou engrave the two avanim with the Shemot Bnei Yisroel; thou shalt make them to be set in mishbetzot zahav (filigrees of gold)."},{"num":12,"verse":"And thou shalt fasten the two avanim upon the Kitfot HaEphod for avnei zikaron (memorial stones) unto the Bnei Yisroel; and Aharon shall bear their Shemot before Hashem upon his two ketefayim for a zikaron."},{"num":13,"verse":"And thou shalt make mishbetzot zahav (filigrees of gold);"},{"num":14,"verse":"And two sharsherot zahav tahor (chains of pure gold) at the edges; of braided artistic work shalt thou make them, and fasten the braided sharsherot (chains) to the mishbetzot (filigrees)."},{"num":15,"verse":"And thou shalt make the Choshen Mishpat with artistic work; like the work of the Ephod thou shalt make it; of zahav, of turquoise, and of purple, and of scarlet wool, and of twisted linen, shalt thou make it."},{"num":16,"verse":"Ravu’a (foursquare, square) it shall be folded; a span shall be the length thereof, and a span shall be the width thereof."},{"num":17,"verse":"And thou shalt set in it settings of even (stone), four rows of gemstones: the first row shall be a odem, a pitdah, and barekes: this shall be the first row."},{"num":18,"verse":"And the second row shall be nofech, sapphire, and yahalom."},{"num":19,"verse":"And the third row a leshem, shevo, and achlamah."},{"num":20,"verse":"And the fourth row tarshish, shoham, and yashfeh; they shall be set in zahav in their settings."},{"num":21,"verse":"And the avanim (gemstones) shall be for the Shemot Bnei Yisroel, Shteym Esreh (Twelve), according to their Shemot, like the engravings of a chotam (signet ring); every one with shmo shall they be according to the Shnei Asar Shevet (Twelve Tribes)."},{"num":22,"verse":"And thou shalt make for the Choshen at the edges of braided artistic work of zahav tahor (pure gold)."},{"num":23,"verse":"And thou shalt make upon the Choshen two rings of zahav, and shalt fasten the two rings on the two ends of the Choshen."},{"num":24,"verse":"And thou shalt fasten the two ropes of zahav on the two rings which are on the ends of the Choshen."},{"num":25,"verse":"And the other two ends of the two ropes thou shalt fasten in the two mishbetzot (filigrees), and attach them to the Ketefot HaEphod (Shoulder Straps of the Ephod) toward its front."},{"num":26,"verse":"And thou shalt make two rings of zahav, and thou shalt put them upon the two ends of the Choshen on the lower border thereof, on the inside toward the Ephod."},{"num":27,"verse":"And two other rings of zahav thou shalt make, and shalt put them on at the bottom of the Kitfot HaEphod toward the front thereof, opposite the seam thereof, above the Cheishev HaEphod (Belt of the Ephod)."},{"num":28,"verse":"And they shall bind the Choshen by the rings thereof unto the rings of the Ephod with a turquoise woolen cord, that it may be above the Cheishev HaEphod, and that the Choshen be not loosed from the Ephod."},{"num":29,"verse":"And Aharon shall bear the Shemot Bnei Yisroel in the Choshen HaMishpat upon his lev, when he goeth in unto HaKodesh, for a zikaron (memorial) before Hashem tamid."},{"num":30,"verse":"And thou shalt put in the Choshen HaMishpat the Urim and the Tummim; and they shall be upon the lev Aharon, when he goeth in before Hashem; and Aharon shall nasa (bear [see this word Yeshayah 53:12]) the Mishpat Bnei Yisroel upon his lev before Hashem tamid."},{"num":31,"verse":"And thou shalt make the Me’il HaEphod all of turquoise wool."},{"num":32,"verse":"And there shall be a head opening in the top of it, in the middle thereof; it shall have a border of artistic embroidery around the head opening of it, like the head opening of a coat of mail; that it be not torn."},{"num":33,"verse":"And beneath upon the hem of it thou shalt make pomegranates of turquoise, and of purple, and of scarlet, around the hem thereof; and bells of zahav between them round about:"},{"num":34,"verse":"A bell of zahav and a pomegranate, a bell of zahav and a pomegranate, upon the hem of the Me’il round about."},{"num":35,"verse":"And it shall be upon Aharon lesharet (to minister); and his sound shall be heard when he goeth in unto HaKodesh before Hashem, and when he cometh out, that he die not."},{"num":36,"verse":"And thou shalt make a Tzitz zahav tahor (head plate of pure gold), and engrave upon it, like the engravings of a chotam (signet ring), KODESH LAHASHEM."},{"num":37,"verse":"And thou shalt put it on a turquoise cord, that it may be upon the Mitznefet; upon the forefront of the Mitznefet it shall be."},{"num":38,"verse":"And it shall be upon metzach Aharon (forehead of Aharon), that Aharon may nasa (bear [see this word Yeshayah 53:12]) the avon of the kodashim (holy things), which the Bnei Yisroel shall set apart as kodesh in all their mattanot kadoshot (holy gifts); and it shall be always upon his metzach (forehead), that they may be leratzon (accepted, acceptable) before Hashem."},{"num":39,"verse":"And thou shalt embroider the Kesones of fine linen, and thou shalt make the Mitznefet of fine linen, and thou shalt make the Avnet of artistic embroidery."},{"num":40,"verse":"And for Bnei Aharon thou shalt make Kuttanot (Tunics), and thou shalt make for them Avnetim, and Migba’ot shalt thou make for them, for kavod and for tiferet."},{"num":41,"verse":"And thou shalt put them upon Aharon thy brother, and his banim with him; and shalt anoint them, and ordain them, and set them apart as kodesh, that they may minister unto Me in the kohen’s office."},{"num":42,"verse":"And thou shalt make them mikhnesei bahd (linen undergarments) to cover their nakedness; from the loins even unto the thighs they shall reach;"},{"num":43,"verse":"And they shall be upon Aharon, and upon his banim, when they come in unto the Ohel Mo’ed, or when they come near unto the Mizbe’ach lesharet (to minister) in HaKodesh; that they incur not avon, and die; it shall be a chukkat olahm unto him and his zera after him."}]