[{"num":7,"verse":"When King David dwelt in his house and the Lord had given him rest from all his surrounding enemies,"},{"num":2,"verse":"The king said to Nathan the prophet, See now, I dwell in a house of cedar, but the ark of God dwells within curtains."},{"num":3,"verse":"And Nathan said to the king, Go, do all that is in your heart, for the Lord is with you."},{"num":4,"verse":"That night the word of the Lord came to Nathan, saying,"},{"num":5,"verse":"Go and tell My servant David, Thus says the Lord: Shall you build Me a house in which to dwell?"},{"num":6,"verse":"For I have not dwelt in a house since I brought the Israelites out of Egypt to this day, but have moved about with a tent for My dwelling."},{"num":7,"verse":"In all the places where I have moved with all the Israelites, did I speak a word to any from the tribes of Israel whom I commanded to be shepherd of My people Israel, asking, Why do you not build Me a house of cedar?"},{"num":8,"verse":"So now say this to My servant David, Thus says the Lord of hosts: I took you from the pasture, from following the sheep, to be prince over My people Israel."},{"num":9,"verse":"And I was with you wherever you went, and have cut off all your enemies from before you; and I will make you a great name, like [that] of the great men of the earth."},{"num":10,"verse":"And I will appoint a place for My people Israel and will plant them, that they may dwell in a place of their own and be moved no more. And wicked men shall afflict them no more, as formerly"},{"num":11,"verse":"And as from the time that I appointed judges over My people Israel; and I will cause you to rest from all your enemies. Also the Lord declares to you that He will make for you a house:"},{"num":12,"verse":"And when your days are fulfilled and you sleep with your fathers, I will set up after you your offspring who shall be born to you, and I will establish his kingdom."},{"num":13,"verse":"He shall build a house for My Name [and My Presence], and I will establish the throne of his kingdom forever."},{"num":14,"verse":"I will be his Father, and he shall be My son. When he commits iniquity, I will chasten him with the rod of men and with the stripes of the sons of men."},{"num":15,"verse":"But My mercy and loving-kindness shall not depart from him, as I took [them] from Saul, whom I took away from before you."},{"num":16,"verse":"And your house and your kingdom shall be made sure forever before you; your throne shall be established forever."},{"num":17,"verse":"In accordance with all these words and all this vision Nathan spoke to David."},{"num":18,"verse":"Then King David went in and sat before the Lord, and said, Who am I, O Lord God, and what is my house, that You have brought me this far?"},{"num":19,"verse":"Then as if this were a little thing in Your eyes, O Lord God, You have spoken also of Your servant’s house in the far distant future. And this is the law for man, O Lord God!"},{"num":20,"verse":"What more can David say to You? For You know Your servant, O Lord God."},{"num":21,"verse":"Because of Your promise and as Your own heart dictates, You have done all these astounding things to make Your servant know and understand."},{"num":22,"verse":"Therefore You are great, O Lord God; for none is like You, nor is there any God besides You, according to all [You have made] our ears to hear."},{"num":23,"verse":"What [other] one nation on earth is like Your people Israel, whom God went to redeem to be a people for Himself and to make for Himself a name? You have done great and terrible things for Yourself and for Your land, before Your people, whom You redeemed and delivered for Yourself from Egypt, from the nations and their gods."},{"num":24,"verse":"And You have established for Yourself Your people Israel to be Your people forever, and You, Lord, became their God."},{"num":25,"verse":"Now, O Lord God, confirm forever the word You have given as to Your servant and his house; and do as You have said,"},{"num":26,"verse":"And Your name [and presence] shall be magnified forever, saying, The Lord of hosts is God over Israel; and the house of Your servant David will be made firm before You."},{"num":27,"verse":"For You, O Lord of hosts, God of Israel, have revealed this to Your servant: I will build you a house. So Your servant has found courage to pray this prayer to You."},{"num":28,"verse":"And now, O Lord God, You are God, and Your words are truth, and You have promised this good thing to Your servant."},{"num":29,"verse":"Therefore now let it please You to bless the house of Your servant, that it may continue forever before You; for You, O Lord God, have spoken it, and with Your blessing let [his] house be blessed forever."}]