[{"num":7,"verse":"And it came to pass, when HaMelech sat in his Bais, and Hashem had given him rest round about from all his oyevim;"},{"num":2,"verse":"That HaMelech said unto Natan HaNavi, See now, I dwell in a Bais of cedar, but the Aron HaElohim dwelleth within the curtain."},{"num":3,"verse":"And Natan said to HaMelech, Go, do all that is in thine lev; for Hashem is with thee."},{"num":4,"verse":"And it came to pass that lailah, that the Devar Hashem came unto Natan, saying,"},{"num":5,"verse":"Go and tell Avdi Dovid, Thus saith Hashem, Shalt thou build Me a Bais for Me to dwell in?"},{"num":6,"verse":"Whereas I have not dwelt in any Bais since the time that I brought up the Bnei Yisroel out of Mitzrayim, even to this day, but have walked in an Ohel and in a Mishkan."},{"num":7,"verse":"In all the places wherein I have walked with kol Bnei Yisroel spoke I a word with any of the Shivtei Yisroel, whom I commanded, to shepherd My people Yisroel, saying, Why build ye not Me a Bais of cedar?"},{"num":8,"verse":"Now therefore so shalt thou say unto Avdi Dovid, Thus saith Hashem Tzva’os, I took thee from the sheepfold, from following the tzon, to be Nagid over My people, over Yisroel:"},{"num":9,"verse":"And I was with thee whithersoever thou didst go, and have cut off all thine oyevim out of thy sight, and have made thee a shem gadol, like unto the shem of the Gedolim that are on ha’aretz."},{"num":10,"verse":"Moreover I will appoint makom (place, home) for My people Yisroel, and will plant them, that they may dwell in a place of their own, and be disturbed no more; neither shall the bnei avlah (children of wickedness) afflict them any more, as in former times,"},{"num":11,"verse":"Even since the time that I commanded Shofetim to be over My people Yisroel, and have caused thee to rest from all thine oyevim. Also Hashem declareth to thee that He will make thee a Bais."},{"num":12,"verse":"And when thy yamim be fulfilled, and thou shalt sleep with thy Avot, I will raise up thy Zera after thee, which shall proceed out of thy loins, and I will establish his Mamlachah (Kingdom)."},{"num":13,"verse":"He shall build a Bais for My Shem, and I will establish the kisse (throne) of his Mamlachah ad olam."},{"num":14,"verse":"I will be his Av, and he shall be My Ben [HaElohim]. If he commit iniquity, I will chasten him with the shevet anashim, and with the floggings of bnei adam;"},{"num":15,"verse":"But My chesed shall not be taken away from him, as I took it from Sha’ul, whom I removed from before thee."},{"num":16,"verse":"And thine Bais and thy Mamlachah shall be established ad olam before thee; thy kisse (throne) shall be established ad olam (forever) [See Ps 89:36-39])."},{"num":17,"verse":"According to all these devarim, and according to all this chizzayon (revelation), so did Natan speak unto Dovid."},{"num":18,"verse":"Then went HaMelech Dovid in, and sat before Hashem, and he said, Who am I, Adonoi Hashem? And what is my Bais, that Thou hast brought me this far?"},{"num":19,"verse":"And as if this were a small thing in Thy sight, Adonoi Hashem, Thou hast spoken also the future of Bais Avdecha. And is this fitting for haAdam [such as me], Adonoi Hashem?"},{"num":20,"verse":"And what can Dovid say more unto Thee? For Thou, Adonoi Hashem, knowest Avdecha."},{"num":21,"verse":"For the sake of Thy word, and according to Thine own lev, hast Thou done all this gedullah (great thing), and made it known to Avdecha."},{"num":22,"verse":"Wherefore Thou art great, Adonoi Hashem; for there is none like Thee, neither is there any Elohim but Thee, according to all that we have heard with our ears."},{"num":23,"verse":"And what Goy echad in ha’aretz is like Thy people, even like Yisroel, whom Elohim went to redeem for an Am for Himself, and to make Him a Shem, and to do for Thee hagedullah (the great thing) and nora’ot, for Thy land, before Thy people, which Thou redeemedst to Thee from Mitzrayim, from the Goyim and their g-ds?"},{"num":24,"verse":"For Thou hast confirmed to Thyself Thy people Yisroel to be an Am unto Thee ad olam; and Thou, Hashem, art become their Elohim."},{"num":25,"verse":"And now, Hashem Elohim, the davar (word, promise) that Thou hast spoken concerning Avdecha, and concerning his Bais, establish it ad olam, and do just as Thou hast said."},{"num":26,"verse":"And let Thy Shem be magnified ad olam, saying, Hashem Tzivos is Elohim over Yisroel; and let the Bais of Avdecha Dovid be established before Thee."},{"num":27,"verse":"For Thou, Hashem Tzva’os Elohei Yisroel, hast revealed to ozen Avdecha, saying, I will build thee a Bais; therefore hath Avdecha found in his lev to pray this tefillah unto Thee."},{"num":28,"verse":"And now, Adonoi Hashem Atah hu HaElohim, and Thy devarim are emes, and Thou hast promised hatovah hazot unto Avdecha;"},{"num":29,"verse":"Therefore now let it please Thee to bless the Bais Avdecha, that it may continue l’olam before Thee; for Thou, Adonoi Hashem, hast spoken it; and with Thy brocha let the Bais Avdecha be blessed l’olam."}]