[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To whom then will ye liken God . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The thought of the infinity of God leads, as in St. Paul’s reasoning (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:24-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to the great primary argument against the folly of idolatry. It is characteristic, partly of the two men individually, partly of the systems under which they lived, that while the tone of Isaiah is sarcastic and declamatory, that of St Paul is pitying, and as with indulgent allowance for the “times of ignorance.” We must remember, of course, that the Apostle speaks to those who had known nothing better than the worship of their fathers, the prophet to those who were tempted to fall into the worship of the heathen from a purer faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 40:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To whom then will ye liken God? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This is a proper inference from the foregoing discourse of God’s infinite greatness; from whence he takes occasion to show both the folly of those that make mean and visible representations of God, and the utter inability of men or idols to give any opposition to God. And this discourse, concerning the madness of idolaters, prosecuted both here and in the following chapter, was designed by God as a necessary antidote, whereby the Jews might be preserved from the contagion of idolatry, to which God saw they now had strong inclinations, and would have many and great temptations while they were in captivity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "40:18-26 Whatever we esteem or love, fear or hope in, more than God, that creature we make equal with God, though we do not make images or worship them. He that is so poor, that he has scarcely a sacrifice to offer, yet will not be without a god of his own. They spared no cost upon their idols; we grudge what is spent in the service of our God. To prove the greatness of God, the prophet appeals to all ages and nations. Those who are ignorant of this, are willingly ignorant. God has the command of all creatures, and of all created things. The prophet directs us to use our reason as well as our senses; to consider who created the hosts of heaven, and to pay our homage to Him. Not one fails to fulfil his will. And let us not forget, that He spake all the promises, and engaged to perform them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To whom then will ye liken God? - Since he is so great, what can resemble him? What form can be made like him? The main idea here intended to be conveyed by the prophet evidently is, that God is great and glorious, and worthy of the confidence of his people. This idea he illustrates by a reference to the attempts which had been made to make a representation of him, and by showing how vain those efforts were. He therefore states the mode in which the images of idols were usually formed, and shows how absurd it was to suppose that they could be any real representation of the true God. It is possible that this was composed in the time of Manasseh, when idolatry prevailed to a great extent in Judah, and that the prophet intended in this manner incidentally to show the folly and absurdity of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. Which of the heathen idols, then, is to be compared to this Almighty God? This passage, if not written (as Barnes thinks) so late as the idolatrous times of Manasseh, has at least a prospective warning reference to them and subsequent reigns; the result of the chastisement of Jewish idolatry in the Babylonish captivity was that thenceforth after the restoration the Jews never fell into it. Perhaps these prophecies here may have tended to that result (see 2Ki 23:26, 27).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This is a proper inference from the foregoing discourse of God’s immense and infinite greatness; from whence he taketh occasion to show both the folly of those that make mean and visible representations of God, as not the Gentiles only, but even some of the Jews did; and the utter inability of men or idols to give any opposition to God in the doing of these great works. And this discourse of the madness of idolaters, prosecuted both here and in the following chapter, was designed by God, as a necessary antidote whereby the Jews might be preserved from the contagion of idolatry, to which God saw they now had strong inclinations, and would have many and great temptations when they were in captivity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To whom then will ye liken God?.... There is nothing in the whole creation that can bear any resemblance to him, or he to them; since all nations are as a drop of the bucket, as the small dust of the balance, as nothing, yea, less than nothing, and vanity: \"or what likeness will ye compare unto him\", (w) order, ordain, and appoint for him? in what rank can he be placed? to what class of beings can he be likened? what similitude can be given of him? what is there that is fit to be named with him, or compared to him? this, with what follows, is mentioned as an antidote to prevent the Jews falling into idolatry in Babylon, where they would be exposed unto it; or rather to prevent Christians in Gospel times from going into the idolatry of the Papists; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(w)    \"et quid similitudinis ponetis ei\", Pagninus; \"ordinabitis\", Montanus; \"disponetis\", Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w)    \"et quid similitudinis ponetis ei\", Pagninus; \"ordinabitis\", Montanus; \"disponetis\", Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "To whom then {u} will ye liken God? or what likeness will ye compare to him?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To whom then ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{u}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " will ye liken God? or what likeness will ye compare to him?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) By this he arms them against the idolatry with which they would be tempted in Babylon.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18–20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “To whom will ye liken God?” This question introduces the second distinct theme of the argument, the folly of idolatry. Although the prophet has in his mind the difficulties of Jews impressed by the fascinations of idolatry, his words are addressed not to them directly, but to men in general. The error he exposes is not the worshipping of Jehovah by images, but the universal error of thinking that the Deity (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "’çl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") can be represented by the works of human hands. His point of view is that of Paul’s speech to the Athenians: “we ought not to think that the Godhead is like unto gold or silver or stone, graven by art and device of man” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In order to see how absurd this is, one has but to observe how the images are manufactured; and the various processes are described with an unmistakeable irony. After ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Duhm and Cheyne (following out a hint of Lagarde’s) insert ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 40:6-7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:6-7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " of the next chapter. The description would then fall into two unequal parts; first, the construction of a metal idol (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 40:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and second, that of a wooden idol (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 40:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); each ending naturally with the fastening of the image to its pedestal.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is more the complement of what precedes than the introduction to what follows (comp. ver. 25). If God be all that has been said of him in vers. 12-17, must he not be wholly unique and incomparable? Then, out of this, the thought arises of the strange, the poor, the mean \"likenesses\" of God, which men have in their folly set up in various times and places. It has been said that Israel in captivity did not need to be warned against idolatry, of the inclination to which the Captivity is supposed at once to have cured them (Urwick, 'Servant of Jehovah,' p. 15). But there is no evidence of this. Rather, considering the few that returned, and the many that remained behind (Joseph., 'Ant Jud.,' 11:1), we may conclude that a large number adopted the customs, religion, and general mode of life of their masters.'  Isaiah 40:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The conclusion drawn from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that Jehovah is therefore the matchless Being, shapes itself into a question, which is addressed not to idolaters, but to such of the Israelites as needed to be armed against the seductive power of idolatry, to which the majority of mankind had yielded. \"And to whom can ye liken God, and what kind of image can ye place beside Him!\" The ו before ואל is conclusive, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the futures are modi potent.: with what can ye bring into comparison (אל as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") El, i.e., God, the one Being who is absolutely the Mighty? and what kind of demūth (i.e., divine, like Himself) can ye place by His side? ",
        "children": []
      }
    ]
  }
]