[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "O Zion, that bringest good tidings.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A new section begins. In some versions (LXX. and Targum) and by some interpreters “Zion",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "” ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is taken as in the objective case, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O thou that bringest glad tidings to Zion; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but as the participle, “thou that bringest,” is in the feminine, and a female evangeliser other than Jerusalem has not appeared on the scene, the Authorised Version is preferable. In that rendering the ideal Zion, seeing or hearing of the return of the exiles, becomes the bearer of the good news to the other cities of Judah. It is not without emotion that we note the first occurrence of the word which, passing through the Greek of the LXX. and the New Testament (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ευαγγελίςεσθαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "has had so fruitful a history, as embodying the message of the Gospel—good-spell, glad tidings—to mankind. The primary meaning of the Hebrew word is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to make smooth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or bright, and so “to gladden.” (Comp. the connection of this English word with the German ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "glatten.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The high mountain.—There is no article in the Hebrew, but the word is probably connected with the ideal exaltation of the holy city, as in Isaiah 2:1.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The high mountain.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—There is no article in the Hebrew, but the word is probably connected with the ideal exaltation of the holy city, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Behold your God!—The words have, in one sense, only an ideal fulfilment; but the prophet contemplates the return of the exiles and the restoration of the Temple worship, as involving the renewed presence of Jehovah in the sanctuary which He had apparently abandoned. He would come back with His people, and abide with them.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Behold your God!",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The words have, in one sense, only an ideal fulfilment; but the prophet contemplates the return of the exiles and the restoration of the Temple worship, as involving the renewed presence of Jehovah in the sanctuary which He had apparently abandoned. He would come back with His people, and abide with them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 40:9. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Zion, thou bringest good tidings ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Of deliverance from the Babylonish captivity, to other cities, and parts of the country; and of redemption by Christ to other nations. Lowth, and many other interpreters, think the marginal reading is to be preferred, as giving a better sense, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O thou that bringest good tidings to Zion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. According to which, Zion is not the deliverer, but the receiver of the tidings, as she is in the parallel place, chap. 52:7. But the translation in our text agrees better with the Hebrew, in which the word for the bringer of the tidings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "מבשׂרת",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עריו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "get thee up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are both in the feminine gender, and agree with Zion and Jerusalem, continually spoken of, as cities generally are, in that gender, but not with any prophet, apostle, or other messenger of God in the masculine gender. It is true, Bishop Lowth supplies a word to suit the text, as to this particular, and reads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O daughter, that bringest good tidings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But that seems to be taking a liberty with the text which necessity only could warrant, a necessity which certainly does not here exist. For the passage, as we have it rendered, makes good sense, representing Zion or Jerusalem, collectively considered, and including its inhabitants, as the publisher, and the cities of Judah as the hearers of the good tidings. The glad tidings of the coming of Christ into the world, and of the salvation of mankind through him, having been made known to Zion, or Jerusalem, were carried from thence, first to all the cities of Judah, and then to the most distant nations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For out of Zion went forth the ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "gospel ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "law, and the word of the Lord from Jerusalem: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the rod of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Messiah’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strength, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the gospel word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was sent forth out of Zion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 110:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Get thee up upon the high mountain — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That thy voice may be better heard. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lift up thy voice; be not afraid ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Lest thou shouldest be found a false witness, for the declaration shall certainly be verified; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "say to the cities of Judah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To all my people in the several places of their abode, whether cities or countries; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "behold your God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Take notice of God’s appearance for your comfort and deliverance; and also that the Messiah, so long expected, is now at last exhibited, in and through whom God will be so present with you, that men may point at him, and say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, here he is! ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:32-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "40:1-11 All human life is a warfare; the Christian life is the most so; but the struggle will not last always. Troubles are removed in love, when sin is pardoned. In the great atonement of the death of Christ, the mercy of God is exercised to the glory of his justice. In Christ, and his sufferings, true penitents receive of the Lord's hand double for all their sins; for the satisfaction Christ made by his death was of infinite value. The prophet had some reference to the return of the Jews from Babylon. But this is a small event, compared with that pointed out by the Holy Ghost in the New Testament, when John the Baptist proclaimed the approach of Christ. When eastern princes marched through desert countries, ways were prepared for them, and hinderances removed. And may the Lord prepare our hearts by the teaching of his word and the convictions of his Spirit, that high and proud thoughts may be brought down, good desires planted, crooked and rugged tempers made straight and softened, and every hinderance removed, that we may be ready for his will on earth, and prepared for his heavenly kingdom. What are all that belongs to fallen man, or all that he does, but as the grass and the flower thereof! And what will all the titles and possessions of a dying sinner avail, when they leave him under condemnation! The word of the Lord can do that for us, which all flesh cannot. The glad tidings of the coming of Christ were to be sent forth to the ends of the earth. Satan is the strong man armed; but our Lord Jesus is stronger; and he shall proceed, and do all that he purposes. Christ is the good Shepherd; he shows tender care for young converts, weak believers, and those of a sorrowful spirit. By his word he requires no more service, and by his providence he inflicts no more trouble, than he will strengthen them for. May we know our Shepherd's voice, and follow him, proving ourselves his sheep.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Zion, that bringest good tidings - This is evidently the continuance of what the 'voice' said, or of the annunciation which was to give joy to an afflicted and oppressed people. There has been, however, much diversity of opinion in regard to the meaning of the passage. The margin renders it, 'Thou that tellest good tidings to Zion,' making Zion the receiver, and not the publisher of the message that was to convey joy. The Vulgate, in a similar way, renders it, 'Ascend a high mountain, thou who bringest good tidings to Zion' (qui evangelizas Zion). So the Chaldee, understanding this as an address to the prophet, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 'Ascend a high mountain, ye prophets, who bring glad tidings to Zion.' So Lowth, Noyes, Gesenius. Grotius, and others. The word מבשׂרת  mebas'eret, from בשׂר  bâs'ar, means cheering with good tidings; announcing good news; bearing joyful intelligence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is a participle in the feminine gender; and is appropriately applicable to some one that bears good tidings to Zion, and not to Zion as appointed to bear glad titlings. Lowth supposes that it is applicable to some female whose office it was to announce glad tidings, and says that it was the common practice for females to engage in the office of proclaiming good news. On an occasion of a public victory or rejoicing, it was customary, says he, for females to assemble together, and to celebrate it with songs, and dances, and rejoicings; and he appeals to the instance of Miriam and the chorus of women Exodus 15:20-21, and to the instance where, after the victory of David over Goliath, 'all the women came out of the cities of Israel singing and dancing to meet Saul' 1 Samuel 18:7. But there are objections to this interpretation; first, if this was the sense, the word would bare been in the plural number, since there is no instance in which a female is employed alone in this service; and, secondly, it was not, according to this, the office of the female to announce good tidings, or to communicate a joyful message, but to celebrate some occasion of triumph or victory.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is a participle in the feminine gender; and is appropriately applicable to some one that bears good tidings to Zion, and not to Zion as appointed to bear glad titlings. Lowth supposes that it is applicable to some female whose office it was to announce glad tidings, and says that it was the common practice for females to engage in the office of proclaiming good news. On an occasion of a public victory or rejoicing, it was customary, says he, for females to assemble together, and to celebrate it with songs, and dances, and rejoicings; and he appeals to the instance of Miriam and the chorus of women ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:20-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and to the instance where, after the victory of David over Goliath, 'all the women came out of the cities of Israel singing and dancing to meet Saul' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 18:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But there are objections to this interpretation; first, if this was the sense, the word would bare been in the plural number, since there is no instance in which a female is employed alone in this service; and, secondly, it was not, according to this, the office of the female to announce good tidings, or to communicate a joyful message, but to celebrate some occasion of triumph or victory.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Grotius supposes that the word is 'feminine in its sound, but common in its signification;' and thus denotes any whose office it was to communicate glad tidings. Gesenius (Commentary in loc.) says, that the feminine form here is used in a collective sense for מבשׂרים  mebas'eriym in the plural; and supposes that it thus refers to the prophets, or others who were to announce the glad tidings to Zion. Vitringa coincides with our translation, and supposes that the sense is, that Zion was to make proclamation to the other cities of Judah of the deliverance; that the news was first to be communicated to Jerusalem, and that Jerusalem was entrusted with the office of announcing this to the other cities of the land; and that the meaning is, that the gospel was to be preached first at Jerusalem, and then from Jerusalem as a center to the ether cities of the land, agreeably to Luke 24:49. In this view, also, Hengstenberg coincides (Christol. vol. i. p. 424). But that the former interpretation, which regards Zion as the receiver, and not the promulgator, of the intelligence, is the true one, is apparent, I think, from the following considerations:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Grotius supposes that the word is 'feminine in its sound, but common in its signification;' and thus denotes any whose office it was to communicate glad tidings. Gesenius (Commentary in loc.) says, that the feminine form here is used in a collective sense for מבשׂרים  mebas'eriym in the plural; and supposes that it thus refers to the prophets, or others who were to announce the glad tidings to Zion. Vitringa coincides with our translation, and supposes that the sense is, that Zion was to make proclamation to the other cities of Judah of the deliverance; that the news was first to be communicated to Jerusalem, and that Jerusalem was entrusted with the office of announcing this to the other cities of the land; and that the meaning is, that the gospel was to be preached first at Jerusalem, and then from Jerusalem as a center to the ether cities of the land, agreeably to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this view, also, Hengstenberg coincides (Christol. vol. i. p. 424). But that the former interpretation, which regards Zion as the receiver, and not the promulgator, of the intelligence, is the true one, is apparent, I think, from the following considerations:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "1. It is that which is the obvious and most correct construction of the Hebrew.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. It is that which is found in the ancient versions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. It accords with the design of the passage.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The main scope of the passage is not to call upon Jerusalem to make known the glad tidings, but it is to convey the good news to Jerusalem; to announce to her, lying desolate and waste, that her hard service was at an end, and that she was to be blessed with the return of happier and better times (see Isaiah 40:2). It would be a departure from this, to suppose that the subject was diverted in order to give Jerusalem a command to make the proclamation to the other cities of the land to say nothing of the impropriety of calling on a city to go up into a high mountain, and to lift up its voice. On the meaning of the word 'Zion,' see the note at Isaiah 1:8.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The main scope of the passage is not to call upon Jerusalem to make known the glad tidings, but it is to convey the good news to Jerusalem; to announce to her, lying desolate and waste, that her hard service was at an end, and that she was to be blessed with the return of happier and better times (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It would be a departure from this, to suppose that the subject was diverted in order to give Jerusalem a command to make the proclamation to the other cities of the land to say nothing of the impropriety of calling on a city to go up into a high mountain, and to lift up its voice. On the meaning of the word 'Zion,' see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Get thee up into a high mountain - You who make this proclamation to Zion. It was not uncommon in ancient times, when a multitude were to be addressed, or a proclamation to be made, for the crier to go into a mountain, where he could be seen and heard. Thus Jotham, addressing the men of Shechem, is said to have gone and 'stood on the top of mount Gerizim, and lifted up his voice' (Judges 9:7; compare Matthew 5:1). The sense is, that the messengers of the joyful news to Zion were to make themselves distinctly heard by all the inhabitants of the city, and of the land.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Get thee up into a high mountain - You who make this proclamation to Zion. It was not uncommon in ancient times, when a multitude were to be addressed, or a proclamation to be made, for the crier to go into a mountain, where he could be seen and heard. Thus Jotham, addressing the men of Shechem, is said to have gone and 'stood on the top of mount Gerizim, and lifted up his voice' (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The sense is, that the messengers of the joyful news to Zion were to make themselves distinctly heard by all the inhabitants of the city, and of the land.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Lift up thy voice - As with a glad and important message. Do not deliver the message as if you were afraid that it should be heard. It is one of joy; and it should be delivered in a clear, decided, animated manner, as if it were important that it should be heard.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With strength - Aloud; with effort; with power (compare Isaiah 35:3-4).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With strength - Aloud; with effort; with power (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:3-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Lift it up - Lift up the voice. The command is repeated, to denote emphasis. The mind is full of the subject, and the prophet repeats the command, as a man often does when his mind is full of an idea. The command to deliver the message of God with animation, earnestness, and zeal is one that is not unusual in Isaiah. It should be delivered as if it were true, and as if it were believed to be true. This will not justify, however, boisterous preaching, or a loud and unnatural tone of voice - alike offensive to good taste, injurious to the health, and destructive of the life of the preacher. It is to be remarked, also, that this command to lift up the voice, pertains to the glad tidings of the gospel, and not to the terrors of wrath; to the proclamation of mercy, and not to the denunciation of woe. The glad tidings of salvation should be delivered in an animated and ardent manner; the future punishment of the wicked in a tone serious, solemn, subdued.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Say unto the cities of Judah - Not to Jerusalem only, but to all the cities of the land. They were alike to be blessed on the return from the captivity - Mike in the preaching of the gospel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Behold your God! - Lo! your God returns to the city, the temple, and the land! Lo! he comes (note, Isaiah 40:3), conducting his people as a king to their land! Lo! he will come - under the Messiah in future times - to redeem and save! What a glad announcement was this to the desolate and forsaken cities of Judah! What a glad announcement to the wide world, 'Lo! God has come to redeem and save; and the desolate world shall be visited with his salvation and smile, in his mercy through the Messiah!' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Behold your God! - Lo! your God returns to the city, the temple, and the land! Lo! he comes (note, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), conducting his people as a king to their land! Lo! he will come - under the Messiah in future times - to redeem and save! What a glad announcement was this to the desolate and forsaken cities of Judah! What a glad announcement to the wide world, 'Lo! God has come to redeem and save; and the desolate world shall be visited with his salvation and smile, in his mercy through the Messiah!' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. Rather, \"Oh, thou that bringest good things to Zion; thou that bringest good tidings to Jerusalem.\" \"Thou\" is thus the collective personification of the messengers who announce God's gracious purpose to Zion (see on [779]Isa 40:1); Isa 52:7 confirms this [Vulgate and Gesenius]. If English Version be retained, the sense will be the glad message was first to be proclaimed to Jerusalem, and then from it as the center to all \"Judea, Samaria, and the uttermost parts of the earth\" (Lu 24:47, 49; Ac 1:8) [Vitringa and Hengstenberg].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "mountain—It was customary for those who were about to promulgate any great thing, to ascend a hill from which they could be seen and heard by all (Jud 9:7; Mt 5:1).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "be not afraid—to announce to the exiles that their coming return home is attended with danger in the midst of the Babylonians. The gospel minister must \"open his mouth boldly\" (Pr 29:25; Eph 6:19).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Behold—especially at His second coming (Zec 12:10; 14:5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "O Zion, that bringest good tidings; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " O Zion, to whom the glad tidings of the coming of Christ into the world, and of the salvation of mankind by him, were first published by Christ and his apostles, and by whom they were published to all nations. But the words are otherwise rendered in the margin, and by others, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O thou",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (whosoever thou art, prophet or apostle) ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that bringest good tidings to Zion.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So Zion is not the deliverer, but the receiver, of these good tidings, as she is in the parallel place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 52:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". But our translation seems to agree better with the Hebrew text, in which the particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not here expressed, as it is in the latter part of the verse; by comparing which part with the former, it seems most probable that Zion or Jerusalem is the speaker or publisher, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the cities of Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the hearers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Get thee up into the high mountain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that thy voice may be better heard, as appears from the next branch of the verse: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Judges 9:7 1 Samuel 26:13,14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 26:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Be not afraid, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " lest thou shouldst be found a false prophet; for it shall certainly be fulfilled. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Say unto the cities of Judah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to all my people in the several places of their abode, whether cities or countries. Only he names ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cities",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to intimate that they also, though they should be destroyed, yet should afterwards be rebuilt, and inhabited again. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold your God!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " take notice of this wonderful work and glorious appearance of your God, who will be visibly present with you, so that men may point at him, and say, Behold, here he is. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Zion, that bringest good tidings,.... Or, \"O thou that bringest good tidings to Zion (n)\"; which rendering of the words is more agreeable to the latter part of the verse, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "say unto the cities of Judah, &c. and to some parallel places, Isaiah 41:27 and to the type, the deliverance of the Jews from Babylon; the tidings of which came from Babylon to Zion, or Jerusalem; and to the Targum which paraphrases the words thus, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "say unto the cities of Judah, &c. and to some parallel places, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and to the type, the deliverance of the Jews from Babylon; the tidings of which came from Babylon to Zion, or Jerusalem; and to the Targum which paraphrases the words thus, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"O ye prophets, that bring good tidings to Zion;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and so may be applied to Gospel ministers, who bring the good tidings of the good will, grace, and favour of God, to men, through Christ; of the grace of Christ, in his suretyship engagements and performances; in his incarnation, sufferings, and death, and in his advocacy and intercession; and of the good things that come by him, as peace, pardon, righteousness, salvation, and eternal life: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "get thee up into the high mountain; to declare these good tidings, in the most open and public manner, that all might hear and receive them, and rejoice at them; it may also point at the place, the church of God, comparable to a high mountain for its visibility and immovableness, where the Gospel is to be published: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O Jerusalem, that bringest good tidings: the church of God so called, to whom the faith of the Gospel is delivered, which is the pillar and ground of truth; which receives, retains, and maintains it, and sends forth ministers to proclaim it; particularly the first church at Jerusalem, where it was first preached, and from whence it went forth into other parts of Judea, and into all the world; here the apostles of Christ were, and from hence they set out, and published the Gospel all the world over, and who seem to be chiefly meant; for the words may be rendered, as the other clause, \"O thou that bringest good tidings to Jerusalem (o)\"; so the Targum: \"lift up thy voice with strength\"; or preach the Gospel with a strong voice, speak it out; do not mutter it over, or whisper it in a corner; proclaim it on the housetops, cry aloud that all may hear; lift up thy voice like a trumpet; blow the trumpet of the Gospel with all the strength thou hast; cause the joyful sound to be heard far and near: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lift it up, and be not afraid; of the reproaches and revilings of men on account of it, or of their persecutions for it; or lest it should not be welcome, or be received as truth: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "say unto the cities of Judah; the inhabitants of them literally understood, and to the several churches and congregations of the saints everywhere: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "behold your God! that divine Person is come, that was promised, prophesied of, and expected; even Immanuel, God with us, God in our nature, God manifest in the flesh, God your Saviour, and who being God, truly God, is able to save to the uttermost; look to him with an eye of faith, and be saved; behold the Son of God, the Lamb of God, that has bore your sins, and took them away; behold him now, as your King and your God, on the throne, made and declared, Lord and Christ, crowned with glory and honour, on the same throne with his divine Father, having all power in heaven and earth; and let the echo of your faith be, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "my Lord and my God. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the kingdom of your God is revealed; see Matthew 3:2.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"the kingdom of your God is revealed; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n)  \"O quae evangelizas Tsijoni\", Juntas & Tremellius, Piscator. (o)  \"O quae evangelizas Jeruschalaimo\", Junius & Tremellius, Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n)  \"O quae evangelizas Tsijoni\", Juntas & Tremellius, Piscator. (o)  \"O quae evangelizas Jeruschalaimo\", Junius & Tremellius, Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "O Zion, that bringest good tidings, go up upon the high {n} mountain; O Jerusalem, that bringest good tidings, lift up thy voice with strength; lift it up, be not afraid; say to the cities of Judah, Behold {o} your God!",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O Zion, that bringest good tidings, go up upon the high ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mountain; O Jerusalem, that bringest good tidings, lift up thy voice with strength; lift ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " up, be not afraid; say to the cities of Judah, Behold ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " your God!",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) To publish this benefit through all the world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) He shows in one word the perfection of all man's happiness, which is to have God's presence.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9–11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet announces the triumphal approach of Jehovah to Zion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Zion … tidings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. has ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "O thou that tellest good tidings to Zion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Either translation is grammatically admissible; but the second is to be preferred, (1) because of the analogous passages ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and (2) because Zion always in this prophecy represents the community as the passive recipient of salvation. The other rendering might seem to be recommended by the apparent distinction between Jerusalem and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the cities of Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but this is probably not intended; Zion itself is included among the cities of Judah. The verb employed (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "měbasséreth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is the Hebrew basis (through the LXX.) of the N.T. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐαγγελίζειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the fem. partic. is collective, denoting an ideal band of messengers (less probably the company of prophets). These Evangelists are bidden to “go up to a high mountain” to see from afar the coming of Jehovah, then to “lift up their voice without fear” (of being put to shame) and proclaim the glad tidings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 9-11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The time of Israel's restoration has drawn nigh. The preparation has been made. The voice calling to preparation is silent. The promises are now on the verge of receiving their accomplishment. It is fitting that some one should announce the fact to the nation. Isaiah calls on the company of prophets living at the time to do so (ver. 9). They are to take up a commanding position, to speak with a loud voice, and to proclaim the good tidings to Zion, to Jerusalem, and to the cities of Judah (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The terms of the proclamation are then given (vers. 10, 11). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "O Zion, that bringest good tidings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; rather, as in the margin, O ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thou that tellest good tidings to Zion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so the LXX., Gesenius, Rosenmuller, Maurer, Hitzig, Knobel, and Kay). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Get thee up into the high mountain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "into a high mountain.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Choose an elevated spot from which to make proclamation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "O Jerusalem, that bringest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; again, as in the margin, O ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thou that tellest good tidings to Jerusalem.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The repetition, with a slight change, is quite in the manner of Isaiah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The cities of Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These would be in rains, no less than Jerusalem herself (see Isaiah 46:26; 64:10). Isaiah 40:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prophet accordingly now takes, as his standpoint, the time when Jehovah will already have come. \"Upon a high mountain get thee up, O evangelistess Zion; lift up they voice with strength, evangelistess Jerusalem: lift up, be not afraid; say to the cities of Judah, Behold your God.\" Knobel and others follow the lxx and Targum, and regard Zion and Jerusalem as accusatives of the object, viz., \"preacher of salvation (i.e., a chorus of preachers) to Zion-Jerusalem;\" but such parallels as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 62:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are misleading here. The words are in apposition (A. S. Th. εὐαγγελιζομένη Σιών). Zion-Jerusalem herself is called an evangelistess: the personification as a female renders this probable at the outset, and it is placed beyond all doubt by the fact, that it is the cities of Judah (the daughters of Zion-Jerusalem) that are to be evangelized. The prophet's standpoint here is in the very midst of the parousia. When Jerusalem shall have her God in the midst of her once more, after He has broken up His home there for so long a time; she is then, as the restored mother-community, to ascend a high mountain, and raising her voice with fearless strength, to bring to her daughters the joyful news of the appearance of their God. The verb bissēr signifies literally to smooth, to unfold, then to make glad, more especially with joyful news.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The verb bissēr signifies primarily to stroke, rub, shave, or scratch the surface of anything; then to stroke off or rub off the surface, or anything which covers it; then, suggested by the idea of \"rubbing smooth\" (glatt), \"to smooth a person\" (jemanden gltten; compare the English, to gladden a person), i.e., vultum ejus diducere, to make him friendly and cheerful, or \"to look smoothly upon a person,\" i.e., to show him a friendly face; and also as an intransitive, \"to be glad,\" to be friendly and cheerful; and lastly, in a general sense, aliquid attingere, tractare, attrectare, to grasp or handle a thing (from which comes bâsâr, the flesh, as something tangible or material). In harmony with the Hebrew bissēr (Jeremiah 20:15), they say in Arabic basarahu (or intensive, bassarahu) bi-maulûdin, he has gladdened him with the news of the birth of a son.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The verb bissēr signifies primarily to stroke, rub, shave, or scratch the surface of anything; then to stroke off or rub off the surface, or anything which covers it; then, suggested by the idea of \"rubbing smooth\" (glatt), \"to smooth a person\" (jemanden gltten; compare the English, to gladden a person), i.e., vultum ejus diducere, to make him friendly and cheerful, or \"to look smoothly upon a person,\" i.e., to show him a friendly face; and also as an intransitive, \"to be glad,\" to be friendly and cheerful; and lastly, in a general sense, aliquid attingere, tractare, attrectare, to grasp or handle a thing (from which comes bâsâr, the flesh, as something tangible or material). In harmony with the Hebrew bissēr (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 20:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), they say in Arabic basarahu (or intensive, bassarahu) bi-maulûdin, he has gladdened him with the news of the birth of a son.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It lies at the root of the New Testament εὐαγγελίζειν (evangelize), and is a favourite word of the author of chapters 40-66, that Old Testament evangelist, though it is no disproof of Isaiah's authorship (cf., Nahum 2:1). Hitherto Jerusalem has been in despair, bowed down under the weight of the punishment of her sins, and standing in need of consolation. But now that she has Jehovah with her again, she is to lift up her voice with the most joyful confidence, without further anxiety, and to become, according to her true vocation, the messenger of good tidings to all Judaea. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It lies at the root of the New Testament εὐαγγελίζειν (evangelize), and is a favourite word of the author of chapters 40-66, that Old Testament evangelist, though it is no disproof of Isaiah's authorship (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Hitherto Jerusalem has been in despair, bowed down under the weight of the punishment of her sins, and standing in need of consolation. But now that she has Jehovah with her again, she is to lift up her voice with the most joyful confidence, without further anxiety, and to become, according to her true vocation, the messenger of good tidings to all Judaea. ",
            "children": []
          }
        ]
      }
    ]
  }
]