[{"header":"King Uzziah of Judah(A)"},{"num":15,"verse":"In the twenty-seventh year of the reign of King Jeroboam II of Israel, Uzziah son of Amaziah became king of Judah "},{"num":2,"verse":"at the age of sixteen, and he ruled in Jerusalem for fifty-two years. His mother was Jecoliah from Jerusalem. "},{"num":3,"verse":"Following the example of his father, he did what was pleasing to the Lord. "},{"num":4,"verse":"But the pagan places of worship were not destroyed, and the people continued to offer sacrifices and burn incense there. "},{"num":5,"verse":"The Lord struck Uzziah with a dreaded skin disease that stayed with him the rest of his life. He lived in a separate house, relieved of all duties, while his son Jotham governed the country."},{"num":6,"verse":"Everything else that Uzziah did is recorded in The History of the Kings of Judah. "},{"num":7,"verse":"Uzziah died and was buried in the royal burial ground in David's City, and his son Jotham succeeded him as king."},{"header":"King Zechariah of Israel"},{"num":8,"verse":"In the thirty-eighth year of the reign of King Uzziah of Judah, Zechariah son of Jeroboam II became king of Israel, and he ruled in Samaria for six months. "},{"num":9,"verse":"He, like his predecessors, sinned against the Lord. He followed the wicked example of King Jeroboam son of Nebat, who led Israel into sin. "},{"num":10,"verse":"Shallum son of Jabesh conspired against King Zechariah, assassinated him at Ibleam, and succeeded him as king."},{"num":11,"verse":"Everything else that Zechariah did is recorded in The History of the Kings of Israel."},{"num":12,"verse":"So the promise was fulfilled which the Lord had made to King Jehu: “Your descendants down to the fourth generation will be kings of Israel.”"},{"header":"King Shallum of Israel"},{"num":13,"verse":"In the thirty-ninth year of the reign of King Uzziah of Judah, Shallum son of Jabesh became king of Israel, and he ruled in Samaria for one month."},{"num":14,"verse":"Menahem son of Gadi went from Tirzah to Samaria, assassinated Shallum, and succeeded him as king. "},{"num":15,"verse":"Everything else that Shallum did, including an account of his conspiracy, is recorded in The History of the Kings of Israel. "},{"num":16,"verse":"As Menahem was on his way from Tirzah, he completely destroyed the city of Tappuah, its inhabitants, and the surrounding territory, because the city did not surrender to him. He even ripped open the bellies of all the pregnant women."},{"header":"King Menahem of Israel"},{"num":17,"verse":"In the thirty-ninth year of the reign of King Uzziah of Judah, Menahem son of Gadi became king of Israel, and he ruled in Samaria for ten years. "},{"num":18,"verse":"He sinned against the Lord, for until the day of his death he followed the wicked example of King Jeroboam son of Nebat, who led Israel into sin. "},{"num":19,"verse":"Tiglath Pileser, the emperor of Assyria, invaded Israel, and Menahem gave him thirty-eight tons of silver to gain his support in strengthening Menahem's power over the country. "},{"num":20,"verse":"Menahem got the money from the rich men of Israel by forcing each one to contribute fifty pieces of silver. So Tiglath Pileser went back to his own country."},{"num":21,"verse":"Everything else that Menahem did is recorded in The History of the Kings of Israel. "},{"num":22,"verse":"He died and was buried, and his son Pekahiah succeeded him as king."},{"header":"King Pekahiah of Israel"},{"num":23,"verse":"In the fiftieth year of the reign of King Uzziah of Judah, Pekahiah son of Menahem became king of Israel, and he ruled in Samaria for two years. "},{"num":24,"verse":"He sinned against the Lord, following the wicked example of King Jeroboam son of Nebat, who led Israel into sin. "},{"num":25,"verse":"An officer of Pekahiah's forces, Pekah son of Remaliah, plotted with fifty men from Gilead, assassinated Pekahiah in the palace's inner fortress in Samaria, and succeeded him as king."},{"num":26,"verse":"Everything else that Pekahiah did is recorded in The History of the Kings of Israel."},{"header":"King Pekah of Israel"},{"num":27,"verse":"In the fifty-second year of the reign of King Uzziah of Judah, Pekah son of Remaliah became king of Israel, and he ruled in Samaria for twenty years. "},{"num":28,"verse":"He sinned against the Lord, following the wicked example of King Jeroboam son of Nebat, who led Israel into sin."},{"num":29,"verse":"It was while Pekah was king that Tiglath Pileser, the emperor of Assyria, captured the cities of Ijon, Abel Beth Maacah, Janoah, Kedesh, and Hazor, and the territories of Gilead, Galilee, and Naphtali, and took the people to Assyria as prisoners."},{"num":30,"verse":"In the twentieth year of the reign of Jotham son of Uzziah as king of Judah, Hoshea son of Elah plotted against King Pekah, assassinated him, and succeeded him as king. "},{"num":31,"verse":"Everything else that Pekah did is recorded in The History of the Kings of Israel."},{"header":"King Jotham of Judah(D)"},{"num":32,"verse":"In the second year of the reign of Pekah son of Remaliah as king of Israel, Jotham son of Uzziah became king of Judah "},{"num":33,"verse":"at the age of twenty-five, and he ruled in Jerusalem for sixteen years. His mother was Jerusha, the daughter of Zadok. "},{"num":34,"verse":"Following the example of his father Uzziah, Jotham did what was pleasing to the Lord. "},{"num":35,"verse":"But the pagan places of worship were not destroyed, and the people continued to offer sacrifices and burn incense there. It was Jotham who built the North Gate of the Temple."},{"num":36,"verse":"Everything else that Jotham did is recorded in The History of the Kings of Judah. "},{"num":37,"verse":"It was while he was king that the Lord first sent King Rezin of Syria and King Pekah of Israel to attack Judah. "},{"num":38,"verse":"Jotham died and was buried in the royal tombs in David's City, and his son Ahaz succeeded him as king."}]