[{"header":"Azariah’s Reign over Judah"},{"num":15,"verse":"In the twenty-seventh year of King Jeroboam’s reign over Israel, Amaziah’s son Azariah became king over Judah. "},{"num":2,"verse":"He was sixteen years old when he began to reign, and he reigned for fifty-two years in Jerusalem. His mother’s name was Jecholiah, who was from Jerusalem. "},{"num":3,"verse":"He did what the Lord approved, just as his father Amaziah had done. "},{"num":4,"verse":"But the high places were not eliminated; the people continued to offer sacrifices and burn incense on the high places. "},{"num":5,"verse":"The Lord afflicted the king with an illness; he suffered from a skin disease until the day he died. He lived in separate quarters, while his son Jotham was in charge of the palace and ruled over the people of the land."},{"num":6,"verse":"The rest of the events of Azariah’s reign, including all his accomplishments, are recorded in the scroll called the Annals of the Kings of Judah. "},{"num":7,"verse":"Azariah passed away and was buried with his ancestors in the City of David. His son Jotham replaced him as king."},{"header":"Zechariah’s Reign over Israel"},{"num":8,"verse":"In the thirty-eighth year of King Azariah’s reign over Judah, Jeroboam’s son Zechariah became king over Israel. He reigned in Samaria for six months. "},{"num":9,"verse":"He did evil in the sight of the Lord, as his ancestors had done. He did not repudiate the sinful ways of Jeroboam son of Nebat who encouraged Israel to sin. "},{"num":10,"verse":"Shallum son of Jabesh conspired against him; he assassinated him in Ibleam and took his place as king. "},{"num":11,"verse":"The rest of the events of Zechariah’s reign are recorded in the scroll called the Annals of the Kings of Israel. "},{"num":12,"verse":"His assassination fulfilled the Lord’s message to Jehu, “Four generations of your descendants will rule on Israel’s throne.” And that is how it happened."},{"num":13,"verse":"Shallum son of Jabesh became king in the thirty-ninth year of King Uzziah’s reign over Judah. He reigned for one month in Samaria. "},{"num":14,"verse":"Menahem son of Gadi went up from Tirzah to Samaria and attacked Shallum son of Jabesh. He killed him and took his place as king. "},{"num":15,"verse":"The rest of the events of Shallum’s reign, including the conspiracy he organized, are recorded in the scroll called the Annals of the Kings of Israel. "},{"num":16,"verse":"At that time Menahem came from Tirzah and attacked Tiphsah. He struck down all who lived in the city and the surrounding territory, because they would not surrender. He even ripped open the pregnant women."},{"header":"Menahem’s Reign over Israel"},{"num":17,"verse":"In the thirty-ninth year of King Azariah’s reign over Judah, Menahem son of Gadi became king over Israel. He reigned for ten years in Samaria. "},{"num":18,"verse":"He did evil in the sight of the Lord; he did not repudiate the sinful ways of Jeroboam son of Nebat, who encouraged Israel to sin."},{"num":19,"verse":"Pul king of Assyria invaded the land, and Menahem paid him 1,000 talents of silver to gain his support and to solidify his control of the kingdom. "},{"num":20,"verse":"Menahem got this silver by taxing all the wealthy men in Israel; he took fifty shekels of silver from each one of them and paid it to the king of Assyria. Then the king of Assyria left; he did not stay there in the land."},{"num":21,"verse":"The rest of the events of Menahem’s reign, including all his accomplishments, are recorded in the scroll called the Annals of the Kings of Israel. "},{"num":22,"verse":"Menahem passed away and his son Pekahiah replaced him as king."},{"header":"Pekahiah’s Reign over Israel"},{"num":23,"verse":"In the fiftieth year of King Azariah’s reign over Judah, Menahem’s son Pekahiah became king over Israel. He reigned in Samaria for two years. "},{"num":24,"verse":"He did evil in the sight of the Lord; he did not repudiate the sinful ways of Jeroboam son of Nebat who encouraged Israel to sin. "},{"num":25,"verse":"His officer Pekah son of Remaliah conspired against him. He and fifty Gileadites assassinated Pekahiah, as well as Argob and Arieh, in Samaria in the fortress of the royal palace. Pekah then took his place as king."},{"num":26,"verse":"The rest of the events of Pekahiah’s reign, including all his accomplishments, are recorded in the scroll called the Annals of the Kings of Israel."},{"header":"Pekah’s Reign over Israel"},{"num":27,"verse":"In the fifty-second year of King Azariah’s reign over Judah, Pekah son of Remaliah became king over Israel. He reigned in Samaria for twenty years. "},{"num":28,"verse":"He did evil in the sight of the Lord; he did not repudiate the sinful ways of Jeroboam son of Nebat who encouraged Israel to sin. "},{"num":29,"verse":"During Pekah’s reign over Israel, King Tiglath-Pileser of Assyria came and captured Ijon, Abel Beth Maacah, Janoah, Kedesh, Hazor, Gilead, and Galilee, including all the territory of Naphtali. He deported the people to Assyria. "},{"num":30,"verse":"Hoshea son of Elah conspired against Pekah son of Remaliah. He assassinated him and took his place as king, in the twentieth year of the reign of Jotham son of Uzziah."},{"num":31,"verse":"The rest of the events of Pekah’s reign, including all his accomplishments, are recorded in the scroll called the Annals of the Kings of Israel."},{"header":"Jotham’s Reign over Judah"},{"num":32,"verse":"In the second year of the reign of Israel’s King Pekah son of Remaliah, Uzziah’s son Jotham became king over Judah. "},{"num":33,"verse":"He was twenty-five years old when he began to reign, and he reigned for sixteen years in Jerusalem. His mother was Jerusha the daughter of Zadok. "},{"num":34,"verse":"He did what the Lord approved, just as his father Uzziah had done. "},{"num":35,"verse":"But the high places were not eliminated; the people continued to offer sacrifices and burn incense on the high places. He built the Upper Gate to the Lord’s temple."},{"num":36,"verse":"The rest of the events of Jotham’s reign, including his accomplishments, are recorded in the scroll called the Annals of the Kings of Judah. "},{"num":37,"verse":"In those days the Lord prompted King Rezin of Syria and Pekah son of Remaliah to attack Judah. "},{"num":38,"verse":"Jotham passed away and was buried with his ancestors in the city of his ancestor David. His son Ahaz replaced him as king."}]