[{"num":24,"verse":"3 The people promise to obey God. 4 Moses writeth the civil Laws. 9, 13 Moses returneth into the mountain. 14 Aaron and Hur have the charge of the people.  18 Moses was forty days and forty nights in the mountain."},{"num":1,"verse":"Now he had said unto Moses, Come up to the Lord, thou, and Aaron, Nadab, and Abihu, and seventy of the Elders of Israel, and ye shall worship afar off."},{"num":2,"verse":"And Moses himself alone shall come near to the Lord, but they shall not come near, neither shall the people go up with him."},{"num":3,"verse":"¶ Afterward Moses came and told the people all the words of the Lord, and all the Laws: and all the people answered with one voice, and said, All the things which the Lord hath said, will we do."},{"num":4,"verse":"And Moses wrote all the words of the Lord and rose up early, and set up an altar under the mountain, and twelve pillars according to the twelve tribes of Israel."},{"num":5,"verse":"And he sent young men of the children of Israel, which offered burnt offerings of beeves, and sacrificed peace offerings unto the Lord."},{"num":6,"verse":"Then Moses took half of the blood, and put it in basins, and half of the blood he sprinkled on the altar."},{"num":7,"verse":"After, he took the book of the covenant, and read it in the audience of the people: who said, All that the Lord hath said, we will do, and be obedient."},{"num":8,"verse":"Then Moses took the blood, and sprinkled it on the people, and said, Behold the blood of the covenant, which the Lord hath made with you concerning all these things."},{"num":9,"verse":"¶ Then went up Moses, and Aaron, Nadab, and Abihu, and seventy of the Elders of Israel."},{"num":10,"verse":"And they saw the God of Israel, and under his feet was as it were a work of a Sapphire stone, and as the very heaven when it is clear."},{"num":11,"verse":"And upon the nobles of the children of Israel he laid not his hand: also they saw God, and did eat and drink."},{"num":12,"verse":"¶ And the Lord said unto Moses, Come up to me into the mountain, and be there, and I will give thee tables of stone, and the Law, and the Commandment, which I have written, for to teach them."},{"num":13,"verse":"Then Moses rose up, and his minister Joshua, and Moses went up into the mountain of God,"},{"num":14,"verse":"And said unto the Elders, Tarry us here until we come again unto you: and behold, Aaron and Hur are with you: whosoever hath any matters, let him come to them."},{"num":15,"verse":"Then Moses went up to the mount, and the cloud covered the mountain,"},{"num":16,"verse":"And the glory of the Lord abode upon mount Sinai, and the cloud covered it six days: and the seventh day he called unto Moses out of the midst of the cloud."},{"num":17,"verse":"And the sight of the glory of the Lord was like consuming fire on the top of the mountain, in the eyes of the children of Israel."},{"num":18,"verse":"And Moses entered into the midst of the cloud, and went up to the mountain and Moses was in the mount forty days and forty nights."}]