[{"header":"God and Israel Make Their Agreement"},{"num":24,"verse":"The Lord told Moses, “You, Aaron, Nadab, Abihu and 70 of the elders of Israel must come up to me. You must worship me from a distance. "},{"num":2,"verse":"Then Moses alone must come near me. The other men must not come near. And the rest of the people must not come up the mountain with Moses.”"},{"num":3,"verse":"So Moses told the people all the Lord’s words and laws for living. Then all of the people answered out loud together. They said, “We will do all the things that the Lord has said.” "},{"num":4,"verse":"So Moses wrote down all the words of the Lord. And he got up early the next morning. He built an altar near the bottom of the mountain. He set up 12 stones, 1 stone for each of the 12 tribes of Israel. "},{"num":5,"verse":"Then Moses sent young Israelite men to offer whole burnt offerings. They also sacrificed young bulls as fellowship offerings to the Lord. "},{"num":6,"verse":"Moses took the blood of these animals. He put half of it in bowls. And he sprinkled the other half of the blood on the altar. "},{"num":7,"verse":"Then Moses took the book with the agreement written in it. He read it so the people could hear him. And they said, “We will do everything that the Lord has said. We will obey.”"},{"num":8,"verse":"Then Moses took the blood from the bowls. He sprinkled it on the people. He said, “This is the blood that begins the agreement. This is the agreement which the Lord has made with you about all these things.”"},{"num":9,"verse":"Moses, Aaron, Nadab, Abihu and 70 of the elders of Israel went up the mountain. "},{"num":10,"verse":"They saw the God of Israel. Under his feet was a surface. It looked as if it were paved with blue sapphire stones. And it was as clear as the sky! "},{"num":11,"verse":"These leaders of the Israelites saw God. But God did not destroy them. Then they ate and drank together."},{"header":"Moses Gets the Stone Tablets"},{"num":12,"verse":"The Lord said to Moses, “Come up the mountain to me. Wait there, and I will give you two stone tablets. On these are the teachings and the commandments. I have written these to teach the people.”"},{"num":13,"verse":"So Moses and his helper Joshua set out. Moses went up Sinai, the mountain of God. "},{"num":14,"verse":"Moses said to the elders, “Wait here for us until we come back to you. Aaron and Hur are with you. Anyone who has a disagreement with others can take it to them.”"},{"header":"Moses Meets with God"},{"num":15,"verse":"When Moses went up on the mountain, the cloud covered it. "},{"num":16,"verse":"The greatness of the Lord came down on Mount Sinai. The cloud covered the mountain for six days. On the seventh day the Lord called to Moses from inside the cloud. "},{"num":17,"verse":"The Israelites could see the greatness of the Lord. It looked like a fire burning on top of the mountain. "},{"num":18,"verse":"Then Moses went into the cloud and went higher up the mountain. Moses was on the mountain for 40 days and 40 nights."}]