[{"header":"The Promise Sealed with Blood"},{"num":24,"verse":"Yahweh said to Moses, “You and Aaron, Nadab, Abihu, and 70 of Israel’s leaders come up the mountain to me and worship at a distance. "},{"num":2,"verse":"Moses may come near Yahweh, but the others may not. The people must not come along with Moses.”"},{"num":3,"verse":"Moses went and told the people all Yahweh’s words and legal decisions. Then all the people answered with one voice, “We will do everything Yahweh has told us to do.” "},{"num":4,"verse":"So Moses wrote down all Yahweh’s words."},{"num":5,"verse":"Then he sent young Israelite men, and they sacrificed bulls as burnt offerings and fellowship offerings to Yahweh. "},{"num":6,"verse":"Moses took half of the blood and put it into bowls, and he threw the other half against the altar. "},{"num":7,"verse":"Then he took the Book of the Lord’s Promise and read it while the people listened. They said, “We will obey and do everything Yahweh has said.”"},{"num":8,"verse":"Moses took the blood and sprinkled it on the people and said, “Here is the blood which seals the promise that Yahweh has made to you based on everything you have just heard.”"},{"num":9,"verse":"Moses went up with Aaron, Nadab, Abihu, and 70 of Israel’s leaders. "},{"num":10,"verse":"They saw the Elohim of Israel. Under his feet was something like a pavement made out of sapphire as clear and blue as the sky itself. "},{"num":11,"verse":"Elohim didn’t harm these leaders of the Israelites. So they saw Elohim, and then they ate and drank."},{"header":"Moses Goes up the Mountain to Receive God’s Words Written on Stone"},{"num":12,"verse":"Yahweh said to Moses, “Come up to me on the mountain. Stay there, and I will give you the stone tablets with the teachings and the commandments I have written for the people’s instruction.”"},{"num":13,"verse":"Moses set out with his assistant Joshua, and Moses went up on the mountain of Elohim. "},{"num":14,"verse":"He said to the leaders, “Wait here for us until we come back to you. Aaron and Hur are here with you. Take all your disagreements to them.”"},{"num":15,"verse":"So Moses went up on the mountain, and the cloud covered it. "},{"num":16,"verse":"The glory of Yahweh settled on Mount Sinai. For six days the cloud covered it, and on the seventh day Yahweh called to Moses from inside the cloud. "},{"num":17,"verse":"To the Israelites, the glory of Yahweh looked like a raging fire on top of the mountain. "},{"num":18,"verse":"Moses entered the cloud as he went up the mountain. He stayed on the mountain 40 days and 40 nights."}]