[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Went in their simplicity.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The two hundred guests whom Absalom had invited to take part with him in his sacrifices, were doubtless prominent and influential citizens of Jerusalem. That they were entirely ignorant of Absalom’s purposes shows the extreme secrecy with which the affair was managed. Absalom, no doubt, hoped when he once had them at Hebron, to secure them for his side, or, failing this, forcibly to prevent their opposition. In any case it would appear to the people that they were with him, and he would thus secure additional prestige.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 15:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With Absalom went two hundred men that were called — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, that were invited by him to feast with him on his sacrifice, and were such as he had picked out as fit for his purpose; principal persons of the city, no doubt, and of some reputation with the king and people. These he took with him that they might give a countenance to his undertaking, and cause the people at first to think that he was acting in all this by his father’s consent and approbation, as being now aged and infirm, and willing to resign the kingdom to his son. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They went in their simplicity, and knew not anything — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Of his design, but only went to attend him, and pay him respect as the king’s son, who did them the honour to invite them to a holy feast. It is no new thing for good men to be made use of by designing men, to put a colour on ill practices.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:7-12 See how willing tender parents are to believe the best concerning their children. But how easy and how wicked is it, for children to take advantage of good parents, and to deceive them with the show of religion! The principal men of Jerusalem joined Absalom's feast upon his sacrifice. Pious persons are glad to see others appear religious, and this gives occasion for deceptions. The policy of wicked men, and the subtlety of Satan, are exerted to draw good persons to countenance base designs.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Forty years - An obvious clerical error, though a very ancient one for four years, which may date from Absalom's return from Geshur, or from his reconciliation with David, or from the commencement of the criminal schemes to which ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hebron - This, as having been the old capital of David's kingdom and Absalom's birthplace, was well chosen. It was a natural center, had probably many inhabitants discontented at the transfer of the government to Jerusalem, and contained many of the friends of Absalom's youth. As the place of his birth (compare 1 Samuel 20:6), it afforded a plausible pretext for holding there the great sacrificial feast (\"the serving the Lord,\" 2 Samuel 15:8), which Absalom pretended to have vowed to hold to the glory of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hebron - This, as having been the old capital of David's kingdom and Absalom's birthplace, was well chosen. It was a natural center, had probably many inhabitants discontented at the transfer of the government to Jerusalem, and contained many of the friends of Absalom's youth. As the place of his birth (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 20:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), it afforded a plausible pretext for holding there the great sacrificial feast (\"the serving the Lord,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which Absalom pretended to have vowed to hold to the glory of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. with Absalom went two hundred men … that were called—From their quality, reputation, and high standing, such as would create the impression that the king patronized the movement and, being aged and infirm, was willing to adopt his oldest and noblest son to divide with him the cares and honors of government.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That were called; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " such as Absalom had picked out as fit for his purpose; such as were of some quality and reputation with the king and people, which would give a great countenance to his undertaking, and give occasion to people at first to think that this was done by his father’s consent or connivance, as being now aged, and infirm, and willing to resign the kingdom to him, as his eldest son, and the noblest too, as being descended from a king by both parents; and such as by their wisdom and interest in the people might have done David much service in this needful time; yet such as were not very martial men, nor likely with violence to oppose his proceedings. They knew not any thing concerning Absalom’s design. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And with Absalom went two hundred men out of Jerusalem, that were called,.... Invited by him to go with him and partake of his peace offerings, as the payment of his vow in Hebron; part of which was made a feast of for his friends, whomsoever he should think fit to invite, as he did to the number of two hundred, and for the entertainment of whom a large provision ought to be made; the Jews (h) have a tradition, that he had leave of his father only to invite two to go with him, and that he asked two more unknown to the first, and so on, two after two, until they amounted to two hundred: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they went in their simplicity; to partake of the feast of the peace offerings, to which they were invited; being quite harmless and upright in their intentions, having no thought of disloyalty and rebellion in their breasts: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they knew not anything; of an intended conspiracy; howbeit, doubtless many of them were drawn into it when got thither; and as these may be supposed to be some of the principal men of Jerusalem, it was a great weakening of David's interest, and laid a considerable foundation for Absalom to begin upon. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Bemidbar Rabba, sect. 9. fol. 194. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) Bemidbar Rabba, sect. 9. fol. 194. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And with Absalom went two hundred men out of Jerusalem, that were {g} called; and they went in their simplicity, and they knew not any thing.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And with Absalom went two hundred men out of Jerusalem, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " called; and they went in their simplicity, and they knew not any thing.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) And bid to his feast in Hebron.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two hundred men … that were called",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Invited to the sacrificial feast as Absalom’s guests. In all probability they were men of distinction, and would naturally be regarded, both at Jerusalem and at Hebron, as accomplices in the conspiracy. No doubt Absalom hoped that many of them, finding themselves thus compromised, and seeing the number of his supporters, would decide to join him; or failing this, they might be held as hostages.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Two hundred men.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " These, doubtless, were courtiers and men of rank, who were so accustomed to Absalom's love of display, that, when ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "called",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that is, invited, they would go without suspicion. To Absalom their attendance was most important, not only because, being compromised, many would join him, and even all of them for a time be forced to yield obedience, but because they would make the people of Hebron suppose that Absalom had a powerful body of supporters at Jerusalem. It is quite possible that at Hebron, and generally in Judah, there was great discontent because David had left their tribe to choose a capital elsewhere, and because he did not show them any decided preference over the other tribes, whose good will he would rightly seek to conciliate. The existence of much jealousy between Judah and the ten tribes is plain from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 19:41-43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 2 Samuel 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Absalom went to Hebron, he sent spies into all the tribes of Israel to say, \"When ye hear the sound of the trumpet, say, Absalom has become king in Hebron.\" We must suppose the sending the spies to have been contemporaneous with the removal of Absalom to Hebron, so that ויּשׁלח is used quite regularly, and there is no reason for translating it as a pluperfect. The messengers sent out are called \"spies,\" because they were first of all to ascertain the feelings of the people in the different tribes, and were only to execute their commission in places where they could reckon upon support. The conspiracy had hitherto been kept very secret, as we may see from the statement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"With Absalom there had gone two hundred men out of Jerusalem, invited (to the sacrificial festival), and going in their simplicity, who knew nothing at all of the affair.\" (כּל־דּבר לא: nothing at all.)  ",
        "children": []
      }
    ]
  }
]