[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 15:25-26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:25-26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The king said unto Zadok, Carry back the ark — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This he ordered, 1st, Through his care of and reverence for the ark, which, though it might be carried out to a certain place, yet, he might justly think, ought not to be taken about from place to place, he knew not whither. And, 2d, Lest, if he had carried it about with him everywhere, he should seem to trust in that which was but the token of God’s presence, more than he did in God himself, who had preserved him in the persecution of Saul, when he had not the ark with him. But was he not exposing the priests to the violence of the usurper, by thus sending them back to Jerusalem; especially as they had just given such evidence of their fidelity to their king? To this it may be answered, that David hoped the sacredness of their character would be a security to them against all violence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If I find favour in the eyes of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — If he shall be pleased to pardon the sins for which he is now justly, although so severely, chastising me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He will bring me again, and show me both it and his habitation ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Will restore me to the enjoyment of the privileges of his house, and the ordinances of his worship, which I shall consider one of the greatest evidences of the return of his favour, and one of the greatest blessings his goodness can confer upon me, even greater than the being restored to my palace and throne. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But if he say, I have no delight in thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I will not receive thee into my favour, nor restore thee to thy throne and city, and to the enjoyment of my ordinances. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Here I am — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Ready to obey him, and to submit to his will and pleasure concerning me. David saw plainly that God, according to his threatening, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "had raised up this evil to him out of his own house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and was punishing him for his sins, and he receives the chastisement with resignation. “I imagine,” says Dr. Delaney, “I now hear him taking up the same lamentation which Alphonsus the Wise, king of Arragon, afterward did upon a like occasion: ‘I wonder not so much at my people’s ingratitude to me, as at my own to God.’ Hence, in this spirit of humiliation, David would not presume to have the ark, the symbol of the divine presence borne before him in that war: that was an honour of which he deemed himself utterly unworthy. And, therefore, referring himself and his affairs to the disposal of the Divine Providence, he remanded Zadok and Abiathar back to the city with the ark.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let him do with me as seemeth him good — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I have nothing to object; it is all well that God doth. Thus ought we cheerfully to acquiesce in the will of God, whatever befalls us. And that we may not complain of what ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "let us see God’s hand in all events. And that we may not be afraid of what ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "let us see all events in God’s hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:24-30 David is very careful for the safety of the ark. It is right to be more concerned for the church's prosperity than our own; to prefer the success of the gospel above our own wealth, credit, ease, and safety. Observe with what satisfaction and submission David speaks of the Divine disposal. It is our interest, as well as our duty, cheerfully to acquiesce in the will of God, whatever befalls us. Let us see God's hand in all events; and that we may not be afraid of what shall be, let us see all events in God's hand. David's sin was ever before him, Ps 51:3; but never so plain, nor ever appearing so black as now. He never wept thus when Saul hunted him, but a wounded conscience makes troubles lie heavy, Ps 38:4.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abiathar went up - i. e., continued to ascend the Mount of Olives. Abiathar was high priest ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 2:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Perhaps Zadok is addressed by David ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the chief of those who were actually bearing the ark. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24, 25. Zadok also, and all the Levites …, bearing the ark—Knowing the strong religious feelings of the aged king, they brought it to accompany him in his distress. But as he could not doubt that both the ark and their sacred office would exempt them from the attacks of the rebels, he sent them back with it—not only that they might not be exposed to the perils of uncertain wandering, for he seems to place more confidence in the symbol of the divine presence than in God Himself—but that, by remaining in Jerusalem, they might render him greater service by watching the enemy's movements.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Carry back the ark of God into the city; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " partly, out of care and reverence to the ark, which though sometimes it was and might be carried out to a certain place; yet he might justly think unfit to carry it from place to place he knew not whither, and to expose it to all the hazards and inconveniences to which he himself was likely to exposed; partly, out of respect to the priests, whom, by this means, he thought he should expose to the rage of Absalom, as he had before exposed them to Saul’s fury on another occasion ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " 1Sa 22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and partly, that by this, means he might have the better opportunity to search out and to counterwork Absalom’s plots; which was so necessary, not only for himself, but for the defence and maintenance of the ark, and all God’s ordinances, and of the true religion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His habitation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the tabernacle which David had lately built for it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Samuel 6:17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 6:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which the ark, and God, by means thereof, ordinarily dwelt. And hereby he insinuates another reason of his returning the ark to Jerusalem, be cause there was the tabernacle made for the receipt of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the king said unto Zadok, carry back the ark of God into the city,.... The reason of which is not easy to account for, since being carried back it would fall into the hands of the conspirators; and now the priests were with it to take care of it, and there might be occasion to inquire at it before the Lord; but David thought it being a sacred thing would not be violated by Absalom and his men, and that it would be safest in its own habitation or tabernacle, which David had built for it; for, that the reason of it should be, what Procopius Gazaeus suggests, cannot be given into, that he could not bear to carry about him the law, which accused of adulteries and murders: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "if I shall find favour in the eyes of the Lord: if he will appear for me, be on my side, and deliver me from those who have risen up against me: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he will bring me again: to Jerusalem, and to his palace there: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and show me both it and his habitation; the ark, and the tabernacle he had erected for it, 2 Samuel 6:17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and show me both it and his habitation; the ark, and the tabernacle he had erected for it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 6:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the king said unto Zadok, Carry back the ark of God into the city: if I shall find favor in the eyes of the LORD, he will bring me again, and show me both it, and his habitation:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his habitation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Jerusalem, and in particular the tent where the Ark was kept, was “the habitation” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the earthly “dwelling-place,” of Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so far as that could be said of any special locality (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For the thought cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2 Samuel 15:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then the king said to Zadok, \"Take back the ark of God into the city! If I find favour in the eyes of Jehovah, He will bring me back and let me see Him (i.e., himself: the reference is to God) and His dwelling (i.e., the ark of the covenant as the throne of the divine glory in the tent that had been set up for it). But if He thus say, I have not delight in thee; behold, here am I, let Him do to me as seemeth good to Him.\" Thus David put his fate in believing confidence into the hand of the Lord, because he felt that it was the Lord who was chastising him for his sons through this rebellion.",
        "children": []
      }
    ]
  }
]