[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 15:8-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:8-9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If the Lord shall bring me again to Jerusalem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This vow, we see, of Absalom is conceived exactly in the style of the patriarchal piety; and plainly implies, that however he was tempted by his grandfather to serve the gods of Geshur, yet he continued steady to the true religion, and determined against idolatry. This, we may be sure, David was highly delighted to hear, and therefore gave a ready consent to the performance of his vow, saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Go in peace. So he arose and went to Hebron — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This place he chose as being an eminent city, and next to Jerusalem, the chief city of the tribe of Judah. It was also the place of his birth, the place where his father had begun his kingdom, which he took for a good omen, and where the seat of government had been several years. Here, likewise, they were wont to sacrifice till the temple was built. It was at a convenient distance from Jerusalem, and, no doubt, he had here secured many friends. He therefore thought it the most commodious place for his purpose, next to Jerusalem.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:7-12 See how willing tender parents are to believe the best concerning their children. But how easy and how wicked is it, for children to take advantage of good parents, and to deceive them with the show of religion! The principal men of Jerusalem joined Absalom's feast upon his sacrifice. Pious persons are glad to see others appear religious, and this gives occasion for deceptions. The policy of wicked men, and the subtlety of Satan, are exerted to draw good persons to countenance base designs.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Forty years - An obvious clerical error, though a very ancient one for four years, which may date from Absalom's return from Geshur, or from his reconciliation with David, or from the commencement of the criminal schemes to which ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hebron - This, as having been the old capital of David's kingdom and Absalom's birthplace, was well chosen. It was a natural center, had probably many inhabitants discontented at the transfer of the government to Jerusalem, and contained many of the friends of Absalom's youth. As the place of his birth (compare 1 Samuel 20:6), it afforded a plausible pretext for holding there the great sacrificial feast (\"the serving the Lord,\" 2 Samuel 15:8), which Absalom pretended to have vowed to hold to the glory of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hebron - This, as having been the old capital of David's kingdom and Absalom's birthplace, was well chosen. It was a natural center, had probably many inhabitants discontented at the transfer of the government to Jerusalem, and contained many of the friends of Absalom's youth. As the place of his birth (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 20:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), it afforded a plausible pretext for holding there the great sacrificial feast (\"the serving the Lord,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which Absalom pretended to have vowed to hold to the glory of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7-9. after forty years—It is generally admitted that an error has here crept into the text, and that instead of \"forty,\" we should read with the Syriac and Arabic versions, and Josephus, \"four years\"—that is, after Absalom's return to Jerusalem, and his beginning to practice the base arts of gaining popularity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "my vow, which I have vowed unto the Lord—during his exile in Geshur. The purport of it was, that whenever God's providence should pave the way for his re-establishment in Jerusalem, he would offer a sacrifice of thanksgiving. Hebron was the spot selected for the performance of this vow, ostensibly as being his native place (2Sa 3:3), and a famous high place, where sacrifices were frequently offered before the temple was built; but really as being in many respects the most suitable for the commencement of his rebellious enterprise. David, who always encouraged piety and desired to see religious engagements punctually performed, gave his consent and his blessing.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " i.e. Worship him by the offering of sacrifices of thanksgiving to God, for restoring me to the place of his presence and service, and to my father’s favour. But why should not this service have been performed at Zion, or at Gibeon? Here was some ground of suspicion; but God blinded David’s eyes, that he might bring upon David and upon Absalom the judgments which they deserved, and he designed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For thy servant vowed a vow while I abode at Geshur in Syria,.... When at his grandfather's court there: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, if the Lord will bring me again indeed to Jerusalem; which he might be sincerely desirous of: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then I will serve the Lord; but it is a question whether he ever made a vow to this purpose, or concerned himself about serving the Lord; but it rather may be, this was a lie of his, now framed in order to get leave of the king to go to Hebron. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "then I will serve the Lord; but it is a question whether he ever made a vow to this purpose, or concerned himself about serving the Lord; but it rather may be, this was a lie of his, now framed in order to get leave of the king to go to Hebron. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For thy servant vowed a vow while I abode at Geshur in Syria, saying, If the LORD shall bring me again indeed to Jerusalem, then I will {f} serve the LORD.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For thy servant vowed a vow while I abode at Geshur in Syria, saying, If the LORD shall bring me again indeed to Jerusalem, then I will ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " serve the LORD.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) By offering a peace-offering, which was lawful to do in any place.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "then will I serve the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Lord] By offering a sacrifice in accordance with his vow. Cp. Jacob’s similar vow (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:20-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2 Samuel 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Absalom's rebellion. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After the lapse of forty (?) years Absalom said to the king, \"Pray I will go (i.e., pray allow me to go) and perform a vow in Hebron which I vowed to the Lord during my stay at Geshur\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The number forty is altogether unsuitable, as it cannot possibly be understood either as relating to the age of Absalom or to the year of David's reign: for Absalom was born at Hebron after David had begun to reign, and David only reigned forty years and a half in all, and Absalom's rebellion certainly did not take place in the last few weeks of his reign. It is quite as inappropriate to assume, as the terminus a quo of the forty years, either the commencement of Saul's reign, as several of the Rabbins have done, as well as the author of the marginal note in Cod. 380 of De Rossi (שאול למלכות), or the anointing of David at Bethlehem, as Luther (in the marginal note) and Lightfoot do; for the word \"after\" evidently refers to some event in the life of Absalom, to which allusion has previously been made, namely, either to the time of his reconciliation with David (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 14:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or (what is not so probable) to the period of his return from Geshur to Jerusalem (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 14:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Consequently the reading adopted by the Syriac, Arabic, and Vulgate, also by Theodoret and others, viz., \"four years,\" must certainly be the correct one, and not \"forty days,\" which we find in Codd. 70 and 96 in Kennicott, since forty days would be far too short a time for maturing the rebellion. It is true, that with the reading ארבּע we should expect, as a rule, the plural שׁנים. At the same time, the numbers from two to ten are sometimes construed with a singular noun (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. Gesenius, 120, 2). The pretended vow was, that if Jehovah would bring him back to Jerusalem, he would serve Jehovah. את־יהוה עבד, \"to do a service to Jehovah,\" can only mean to offer a sacrifice, which is the explanation given by Josephus. The Chethib ישׁיב is not the infinitive, but the imperfect Hiphil: si reduxerit, reduxerit me, which is employed in an unusual manner instead of the inf. absol., for the sake of emphasis. The Keri ישׁוּב would have to be taken as an adverb \"again;\" but this is quite unnecessary. ",
        "children": []
      }
    ]
  }
]