[{"num":3,"verse":"And the word of the Lord was made the second time to Jonah, and said,"},{"num":2,"verse":"Rise thou, and go into Nineveh, the great city, and preach thou in it the preaching which I speak to thee. (Rise thou up, and go to the great city Nineveh, and preach thou in it the preaching which I tell thee/which I told thee before.)"},{"num":3,"verse":"And Jonah rose, and went into Nineveh, by the word of the Lord. And Nineveh was a great city, of the journey of three days. (And Jonah rose up, and went to Nineveh, by the word of the Lord. And Nineveh was such a great, or such a large, city, that it took three days’ journey to walk across it.)"},{"num":4,"verse":"And Jonah began for to enter into the city, by the journey of one day, and cried, and said, Yet forty days, and Nineveh shall be overturned, or destroyed. (And after one day’s journey in the city, Jonah cried aloud, and said, In forty days, Nineveh shall be destroyed!)"},{"num":5,"verse":"And men of Nineveh believed to the Lord, and preached fasting, and were clothed with sackcloths, from the more till to the less. (And the people of Nineveh believed the word of the Lord, and proclaimed a fast, and were clothed with sackcloths, from the greatest unto the least.)"},{"num":6,"verse":"And the word came to the king of Nineveh; and he rose off his seat, and casted away his clothing from him (and he rose up off his throne, and threw off his clothes), and was clothed with sackcloth, and sat in ashes."},{"num":7,"verse":"And he cried, and said in Nineveh of the mouth of the king and of his princes, saying, Men, and work beasts, and oxen, and sheep, taste not anything, neither be fed, neither drink water. (And he cried aloud, and had it said in Nineveh by the command of the king and of his princes, saying, People, and work beasts, and oxen, and sheep, taste not anything, neither be fed, nor drink water.)"},{"num":8,"verse":"And men be covered with sackcloths, and work beasts, (and) cry to the Lord in strength; and be a man converted, or all-turned, from his evil way, and from (the) wickedness that is in the hands of them. (And let everyone, and their work beasts, be covered with sackcloths, and cry out to the Lord with all their strength; let everyone be turned, or converted, from their evil ways, and from the wickedness that they do.)"},{"num":9,"verse":"Who knoweth, if God be converted, and forgive, and be turned away from strong vengeance of his wrath, and we shall not perish? (Who knoweth, if God shall not be converted, or shall not change his thinking, and forgive us, and turn away from the strong vengeance of his anger, and then we shall not perish!)"},{"num":10,"verse":"And God saw the works of them, that they were converted from their evil way; and God had mercy on the malice which he spake, that he would do to them, and did not. (And indeed God saw their works, and that they were converted, or were turned, from their evil ways; and God repented for the malice, which he had said he would do to them, and so he did not harm them.)"}]