[{"num":15,"verse":"And I saw another ot (miraculous sign) in Shomayim, great and marvelous: shiva (seven) malachim (angels) having sheva (seven) makkot (plagues), the last makkot (plagues), because by them is completed the Charon Af Hashem (the burning fury of G-d). [VAYIKRA 26:21]"},{"num":2,"verse":"And I saw, as it were, a yam (sea) of glass, having been mingled with eish (fire); and I saw the menatzakhat HaChayyah (overcomers of the Beast, Anti-Moshiach) and of its Atzav (image) and of the mispar (number) of its name; and I saw them having taken their stand on the yam (sea) of glass, holding nevalim (harps) of Hashem."},{"num":3,"verse":"And they sing the Shir of Moshe [Rabbeinu], the eved Hashem, and the Shir of the SEH (Lamb, SHEMOT 12:3; YESHAYAH 53:7 Moshiach), saying, \"Great and marvelous are your ma’asim (works), Hashem Adonoi Tzva’ot; Tzedek (Righteousness) and Emes (Truth) are your derakhim (ways, paths), Melech kol HaGoyim (King of all the Nations). [SHEMOT 15:1; YEHOSHUA 1:1; TEHILLIM 111:2; 145:17]"},{"num":4,"verse":"“Adonoi, who would not fear You and ascribe kavod to your Name? Because You only are HaKadosh, for kol HaGoyim will come and will worship before You because Your tzedakot (righteous acts) were made known.\" [YIRMEYAH 10:7; TEHILLIM 86:9; YESHAYAH 66:23]"},{"num":5,"verse":"And after these things I looked, and the Heikhal was opened, that is, the Mishkan HaEdut in Shomayim. [SHEMOT 38:21; BAMIDBAR 1:50]"},{"num":6,"verse":"And the shivat hamalachim (seven angels) having the sheva hamakkot (seven plagues) came out of the Heikhal, having been clothed in linen, tahor (clean) and bright, and having been wrapped around the chests with golden gartels. [YECHEZKEL 9:2; DANIEL 10:5]"},{"num":7,"verse":"And one of the Arbah Chayyot (four living beings) gave to the shivat hamalachim (seven angels) golden ke’arot (bowls) being full of the Charon Af HaElohim HaChai l’olemei haolamim (the wrath of the living G-d who lives for ever and ever)."},{"num":8,"verse":"And the Heikhal was filled with smoke from the kavod (glory) of Hashem and from His oz (power); and no one was being able to enter into the Heikhal until should be completed the sheva hamakkot (seven plagues) of the shiva malachim (seven angels). [Isa 6:4; Ex 40:34,35; 1Kgs 8:10,11; 2Ch 5:13,14]"}]