[{"num":35,"verse":"O Lord, fight those fighting me; declare war on them for their attacks on me. "},{"num":2,"verse":"Put on your armor, take your shield and protect me by standing in front. "},{"num":3,"verse":"Lift your spear in my defense, for my pursuers are getting very close. Let me hear you say that you will save me from them. "},{"num":4,"verse":"Dishonor those who are trying to kill me. Turn them back and confuse them. "},{"num":5,"verse":"Blow them away like chaff in the wind—wind sent by the Angel of the Lord. "},{"num":6,"verse":"Make their path dark and slippery before them, with the Angel of the Lord pursuing them. "},{"num":7,"verse":"For though I did them no wrong, yet they laid a trap for me and dug a pitfall in my path. "},{"num":8,"verse":"Let them be overtaken by sudden ruin, caught in their own net and destroyed."},{"num":9,"verse":"But I will rejoice in the Lord. He shall rescue me! "},{"num":10,"verse":"From the bottom of my heart praise rises to him. Where is his equal in all of heaven and earth? Who else protects the weak and helpless from the strong, and the poor and needy from those who would rob them?"},{"num":11,"verse":"These evil men swear to a lie. They accuse me of things I have never even heard about. "},{"num":12,"verse":"I do them good, but they return me harm. I am sinking down to death. "},{"num":13,"verse":"When they were ill, I mourned before the Lord in sackcloth, asking him to make them well; I refused to eat; I prayed for them with utmost earnestness, but God did not listen. "},{"num":14,"verse":"I went about sadly as though it were my mother, friend, or brother who was sick and nearing death. "},{"num":15,"verse":"But now that I am in trouble they are glad; they come together in meetings filled with slander against me—I didn’t even know some of those who were there. "},{"num":16,"verse":"For they gather with the worthless fellows of the town and spend their time cursing me."},{"num":17,"verse":"Lord, how long will you stand there, doing nothing? Act now and rescue me, for I have but one life and these young lions are out to get it. "},{"num":18,"verse":"Save me, and I will thank you publicly before the entire congregation, before the largest crowd I can find."},{"num":19,"verse":"Don’t give victory to those who fight me without any reason! Don’t let them rejoice at my fall—let them die. "},{"num":20,"verse":"They don’t talk of peace and doing good, but of plots against innocent men who are minding their own business. "},{"num":21,"verse":"They shout that they have seen me doing wrong! “Aha!” they say. “With our own eyes we saw him do it.” "},{"num":22,"verse":"Lord, you know all about it. Don’t stay silent! Don’t desert me now!"},{"num":23,"verse":"Rise up, O Lord my God; vindicate me. "},{"num":24,"verse":"Declare me “not guilty,” for you are just. Don’t let my enemies rejoice over me in my troubles. "},{"num":25,"verse":"Don’t let them say, “Aha! Our dearest wish against him will soon be fulfilled!” and, “At last we have him!” "},{"num":26,"verse":"Shame them; let these who boast against me and who rejoice at my troubles be themselves overcome by misfortune that strips them bare of everything they own. Bare them to dishonor. "},{"num":27,"verse":"But give great joy to all who wish me well. Let them shout with delight, “Great is the Lord who enjoys helping his child!” "},{"num":28,"verse":"And I will tell everyone how great and good you are; I will praise you all day long."}]