[{"header":"Testing the Spirits"},{"num":4,"verse":"Beloved, do not believe every spirit [speaking through a self-proclaimed prophet]; instead test the spirits to see whether they are from God, because many false prophets and teachers have gone out into the world. "},{"num":2,"verse":"By this you know and recognize the Spirit of God: every spirit that acknowledges and confesses [the fact] that Jesus Christ has [actually] come in the flesh [as a man] is from God [God is its source]; "},{"num":3,"verse":"and every spirit that does not confess Jesus [acknowledging that He has come in the flesh, but would deny any of the Son’s true nature] is not of God; this is the spirit of the antichrist, which you have heard is coming, and is now already in the world. "},{"num":4,"verse":"Little children (believers, dear ones), you are of God and you belong to Him and have [already] overcome them [the agents of the antichrist]; because He who is in you is greater than he (Satan) who is in the world [of sinful mankind]. "},{"num":5,"verse":"They [who teach twisted doctrine] are of the world and belong to it; therefore they speak from the [viewpoint of the] world [with its immoral freedom and baseless theories—demanding compliance with their opinions and ridiculing the values of the upright], and the [gullible one of the] world listens closely and pays attention to them. "},{"num":6,"verse":"We [who teach God’s word] are from God [energized by the Holy Spirit], and whoever knows God [through personal experience] listens to us [and has a deeper understanding of Him]. Whoever is not of God does not listen to us. By this we know [without any doubt] the spirit of truth [motivated by God] and the spirit of error [motivated by Satan]."},{"header":"God Is Love"},{"num":7,"verse":"Beloved, let us [unselfishly] love and seek the best for one another, for love is from God; and everyone who loves [others] is born of God and knows God [through personal experience]. "},{"num":8,"verse":"The one who does not love has not become acquainted with God [does not and never did know Him], for God is love. [He is the originator of love, and it is an enduring attribute of His nature.] "},{"num":9,"verse":"By this the love of God was displayed in us, in that God has sent His [One and] only begotten Son [the One who is truly unique, the only One of His kind] into the world so that we might live through Him. "},{"num":10,"verse":"In this is love, not that we loved God, but that He loved us and sent His Son to be the propitiation [that is, the atoning sacrifice, and the satisfying offering] for our sins [fulfilling God’s requirement for justice against sin and placating His wrath]. "},{"num":11,"verse":"Beloved, if God so loved us [in this incredible way], we also ought to love one another. "},{"num":12,"verse":"No one has seen God at any time. But if we love one another [with unselfish concern], God abides in us, and His love [the love that is His essence abides in us and] is completed and perfected in us. "},{"num":13,"verse":"By this we know [with confident assurance] that we abide in Him and He in us, because He has given to us His [Holy] Spirit. "},{"num":14,"verse":"We [who were with Him in person] have seen and testify [as eye-witnesses] that the Father has sent the Son to be the Savior of the world."},{"num":15,"verse":"Whoever confesses and acknowledges that Jesus is the Son of God, God abides in him, and he in God. "},{"num":16,"verse":"We have come to know [by personal observation and experience], and have believed [with deep, consistent faith] the love which God has for us. God is love, and the one who abides in love abides in God, and God abides continually in him. "},{"num":17,"verse":"In this [union and fellowship with Him], love is completed and perfected with us, so that we may have confidence in the day of judgment [with assurance and boldness to face Him]; because as He is, so are we in this world. "},{"num":18,"verse":"There is no fear in love [dread does not exist]. But perfect (complete, full-grown) love drives out fear, because fear involves [the expectation of divine] punishment, so the one who is afraid [of God’s judgment] is not perfected in love [has not grown into a sufficient understanding of God’s love]. "},{"num":19,"verse":"We love, because He first loved us. "},{"num":20,"verse":"If anyone says, “I love God,” and hates (works against) his [Christian] brother he is a liar; for the one who does not love his brother whom he has seen, cannot love God whom he has not seen. "},{"num":21,"verse":"And this commandment we have from Him, that the one who loves God should also [unselfishly] love his brother and seek the best for him."}]