[{"header":"Test the Spirits"},{"num":4,"verse":"Dear friends, do not believe every spirit, but test the spirits to see if they are from God, for many false prophets have gone out into the world. "},{"num":2,"verse":"This is how you can recognize the Spirit of God: Every spirit who confesses that Jesus Christ has come in the flesh is from God, "},{"num":3,"verse":"and every spirit who does not confess Jesus is not from God. This is the spirit of the Antichrist, which you have heard is coming and is already in the world. "},{"num":4,"verse":"You are from God, dear children, and you have overcome the false prophets, because the one in you is greater than the one in the world. "},{"num":5,"verse":"They are from the world. That is why they speak from a worldly perspective and the world listens to them. "},{"num":6,"verse":"We are from God. The one who knows God listens to us, but whoever is not from God does not listen to us. That is how we can distinguish between the spirit of truth and the spirit of error."},{"header":"God Is Love"},{"num":7,"verse":"Dear friends, let us love one another, because love comes from God. Everyone who loves has been born of God and knows God. "},{"num":8,"verse":"The one who does not love has not known God, because God is love. "},{"num":9,"verse":"This is how God’s love for us was revealed: God has sent his only-begotten Son into the world so that we may live through him. "},{"num":10,"verse":"This is love: not that we have loved God, but that he loved us and sent his Son to be the atoning sacrifice for our sins. "},{"num":11,"verse":"Dear friends, if God loved us so much, we also should love one another."},{"num":12,"verse":"No one has ever seen God. If we love one another, God remains in us and his love has been brought to its goal in us. "},{"num":13,"verse":"This is how we know that we remain in him and he in us: He has given us of his Spirit. "},{"num":14,"verse":"We have seen and testify that the Father has sent his Son to be the Savior of the world. "},{"num":15,"verse":"If anyone confesses that Jesus is the Son of God, God remains in him and he in God. "},{"num":16,"verse":"We also have come to know and trust the love that God has for us."},{"num":17,"verse":"In this way his love has been brought to its goal among us, so that we may have confidence on the day of judgment, because in this world we are just like Jesus. "},{"num":18,"verse":"There is no fear in love, but complete love drives out fear, because fear has to do with punishment. The one who continues to be afraid has not been brought to the goal in love."},{"num":19,"verse":"We love because he first loved us. "},{"num":20,"verse":"If anyone says, “I love God,” but hates his brother, he is a liar. For how can anyone who does not love his brother, whom he has seen, love God, whom he has not seen? "},{"num":21,"verse":"This then is the command we have from him: The one who loves God should also love his brother."}]