[{"header":"John Warns Against False Teachers"},{"num":4,"verse":"My dear friends, many false prophets are in the world now. So don’t believe every spirit, but test the spirits to see if they are from God."},{"num":2,"verse":"This is how you can recognize God’s Spirit. One spirit says, “I believe that Jesus is the Messiah who came to earth and became a man.” That Spirit is from God."},{"num":3,"verse":"Another spirit refuses to say this about Jesus. That spirit is not from God. This is the spirit of the enemy of Christ. You have heard that the enemy of Christ is coming, and now he is already in the world."},{"num":4,"verse":"My dear children, you belong to God, so you have already defeated these false prophets. That’s because the one who is in you is greater than the one who is in the world."},{"num":5,"verse":"And they belong to the world, so what they say is from the world too. And the world listens to what they say."},{"num":6,"verse":"But we are from God. So the people who know God listen to us. But the people who are not from God don’t listen to us. This is how we know the Spirit that is true and the spirit that is false."},{"header":"Love Comes From God"},{"num":7,"verse":"Dear friends, we should love each other, because love comes from God. Everyone who loves has become God’s child. And so everyone who loves knows God."},{"num":8,"verse":"Anyone who does not love does not know God, because God is love."},{"num":9,"verse":"This is how God showed his love to us: He sent his only Son into the world to give us life through him."},{"num":10,"verse":"True love is God’s love for us, not our love for God. He sent his Son as the way to take away our sins."},{"num":11,"verse":"That is how much God loved us, dear friends! So we also must love each other."},{"num":12,"verse":"No one has ever seen God. But if we love each other, God lives in us. If we love each other, God’s love has reached its goal—it is made perfect in us."},{"num":13,"verse":"We know that we live in God and God lives in us. We know this because he gave us his Spirit."},{"num":14,"verse":"We have seen that the Father sent his Son to be the Savior of the world, and this is what we tell people now."},{"num":15,"verse":"Anyone who says, “I believe that Jesus is the Son of God,” is a person who lives in God, and God lives in that person."},{"num":16,"verse":"So we know the love that God has for us, and we trust that love."},{"num":17,"verse":"If God’s love is made perfect in us, we can be without fear on the day when God judges the world. We will be without fear, because in this world we are like Jesus."},{"num":18,"verse":"Where God’s love is, there is no fear, because God’s perfect love takes away fear. It is his punishment that makes a person fear. So his love is not made perfect in the one who has fear."},{"num":19,"verse":"We love because God first loved us."},{"num":20,"verse":"If we say we love God but hate any of our brothers or sisters in his family, we are liars. If we don’t love someone we have seen, how can we love God? We have never even seen him."},{"num":21,"verse":"God gave us this command: If we love God, we must also love each other as brothers and sisters."}]