[{"num":4,"verse":"¶ Beloved, do not believe every spirit, but try the spirits whether they are of God because many false prophets are gone out into the world."},{"num":2,"verse":"In this know ye the Spirit of God: Every spirit that confesses that Jesus Christ is come in flesh is of God:"},{"num":3,"verse":"And every spirit that does not confess that Jesus Christ is come in flesh is not of God: and this is that spirit of antichrist, of which ye have heard that it should come, and that now it is already in the world."},{"num":4,"verse":"¶ Ye are of God, little children, and have overcome them because greater is he that is in you than he that is in the world."},{"num":5,"verse":"They are of the world; therefore, they speak of the world, and the world hears them."},{"num":6,"verse":"We are of God; he that knows God hears us; he that is not of God does not hear us. By this we know the spirit of truth and the spirit of error."},{"num":7,"verse":"¶ Beloved, let us love one another, for charity is of God. Anyone that loves is born of God and knows God."},{"num":8,"verse":"He that does not love does not know God, for God is charity."},{"num":9,"verse":"In this was the charity of God demonstrated in us, in that God sent his only begotten Son into the world, that we might live through him."},{"num":10,"verse":"In this does the charity consist, not because we had loved God, but because he loved us and has sent his Son to be the reconciliation for our sins."},{"num":11,"verse":"Beloved, if God so loved us, we also ought to love one another."},{"num":12,"verse":"No one has seen God at any time. If we love one another, God abides in us, and his charity is completed in us."},{"num":13,"verse":"In this we know that we abide in him, and he in us, in that he has given us of his Spirit."},{"num":14,"verse":"¶ And we have seen and do testify that the Father sent the Son to be the Saviour of the world."},{"num":15,"verse":"Whosoever shall confess that Jesus is the Son of God, God abides in him, and he in God."},{"num":16,"verse":"And we have known and believed the charity that God has in us. God is charity, and he that abides in charity abides in God, and God in him."},{"num":17,"verse":"¶ In this the charity with us is made perfect, that we may have confidence in the day of judgment, that as he is, so are we in this world."},{"num":18,"verse":"In charity there is no fear; but charity that is perfect casts out fear; because fear has torment; from which he that fears is not complete in charity."},{"num":19,"verse":"We love him, because he first loved us."},{"num":20,"verse":"If anyone says, I love God and hates his brother, he is a liar; for he that does not love his brother whom he has seen, how can he love God whom he has not seen?"},{"num":21,"verse":"And we have this commandment from him, That he who loves God loves his brother also."}]