[{"header":"Chapter 4"},{"num":1,"verse":"Testing the Spirits. Beloved, do not trust every spirit but test the spirits to see whether they belong to God, because many false prophets have gone out into the world. "},{"num":2,"verse":"This is how you can know the Spirit of God: every spirit that acknowledges Jesus Christ come in the flesh belongs to God, "},{"num":3,"verse":"and every spirit that does not acknowledge Jesus does not belong to God. This is the spirit of the antichrist that, as you heard, is to come, but in fact is already in the world. "},{"num":4,"verse":"You belong to God, children, and you have conquered them, for the one who is in you is greater than the one who is in the world. "},{"num":5,"verse":"They belong to the world; accordingly, their teaching belongs to the world, and the world listens to them. "},{"num":6,"verse":"We belong to God, and anyone who knows God listens to us, while anyone who does not belong to God refuses to hear us. This is how we know the spirit of truth and the spirit of deceit."},{"num":7,"verse":"God’s Love and Christian Life. Beloved, let us love one another, because love is of God; everyone who loves is begotten by God and knows God. "},{"num":8,"verse":"Whoever is without love does not know God, for God is love. "},{"num":9,"verse":"In this way the love of God was revealed to us: God sent his only Son into the world so that we might have life through him. "},{"num":10,"verse":"In this is love: not that we have loved God, but that he loved us and sent his Son as expiation for our sins. "},{"num":11,"verse":"Beloved, if God so loved us, we also must love one another. "},{"num":12,"verse":"No one has ever seen God. Yet, if we love one another, God remains in us, and his love is brought to perfection in us."},{"num":13,"verse":"This is how we know that we remain in him and he in us, that he has given us of his Spirit. "},{"num":14,"verse":"Moreover, we have seen and testify that the Father sent his Son as savior of the world. "},{"num":15,"verse":"Whoever acknowledges that Jesus is the Son of God, God remains in him and he in God. "},{"num":16,"verse":"We have come to know and to believe in the love God has for us."},{"num":17,"verse":"In this is love brought to perfection among us, that we have confidence on the day of judgment because as he is, so are we in this world. "},{"num":18,"verse":"There is no fear in love, but perfect love drives out fear because fear has to do with punishment, and so one who fears is not yet perfect in love. "},{"num":19,"verse":"We love because he first loved us. "},{"num":20,"verse":"If anyone says, “I love God,” but hates his brother, he is a liar; for whoever does not love a brother whom he has seen cannot love God whom he has not seen. "},{"num":21,"verse":"This is the commandment we have from him: whoever loves God must also love his brother."}]