[{"header":"The Man of Sin"},{"num":2,"verse":"Brothers and sisters, we want to ask you something. It has to do with the coming of our Lord Jesus Christ. It concerns the time when we will go to be with him. "},{"num":2,"verse":"What if you receive a message that is supposed to have come from us? What if it says that the day of the Lord has already come? If it does, we ask you not to become easily upset or alarmed. Don’t be upset whether that message is spoken or written or prophesied. "},{"num":3,"verse":"Don’t let anyone trick you in any way. That day will not come until people rise up against God. It will not come until the man of sin appears. He is a marked man. He is headed for ruin. "},{"num":4,"verse":"He will oppose everything that is called God. He will oppose everything that is worshiped. He will give himself power over everything. He will set himself up in God’s temple. He will announce that he himself is God."},{"num":5,"verse":"Don’t you remember? When I was with you, I used to tell you these things. "},{"num":6,"verse":"Now you know what is holding back the man of sin. He is held back so that he can make his appearance at the right time. "},{"num":7,"verse":"The secret power of sin is already at work. But the one who now holds back that power will keep doing it until he is taken out of the way. "},{"num":8,"verse":"Then the man of sin will appear. The Lord Jesus will overthrow him with the breath of his mouth. The glorious brightness of Jesus’ coming will destroy the man of sin. "},{"num":9,"verse":"The coming of the man of sin will fit how Satan works. The man of sin will show his power through all kinds of signs and wonders. These signs and wonders will lead people astray. "},{"num":10,"verse":"So people who are dying will be fooled by this evil. These people are dying because they refuse to love the truth. The truth would save them. "},{"num":11,"verse":"So God will fool them completely. Then they will believe the lie. "},{"num":12,"verse":"Many will not believe the truth. They will take pleasure in evil. They will be judged."},{"header":"Remain Strong in the Faith"},{"num":13,"verse":"Brothers and sisters, we should always thank God for you. The Lord loves you. That’s because God chose you as the first to be saved. Salvation comes through the Holy Spirit’s work. He makes people holy. It also comes through believing the truth. "},{"num":14,"verse":"He chose you to be saved by accepting the good news that we preach. And you will share in the glory of our Lord Jesus Christ."},{"num":15,"verse":"Brothers and sisters, remain strong in the faith. Hold on to what we taught you. We passed our teachings on to you by what we preached and wrote."},{"num":16,"verse":"Our Lord Jesus Christ and God our Father loved us. By his grace God gave us comfort that will last forever. The hope he gave us is good. May our Lord Jesus Christ and God our Father "},{"num":17,"verse":"comfort your hearts. May they make you strong in every good thing you do and say."}]