[{"num":2,"verse":"Now we urge you, brothers, by the coming of our Lord Jesus Christ (and by our assembling to Him),"},{"num":2,"verse":"to not waver suddenly in your mind or be troubled by spirit or word or letter which seems to come from us, as though the day of Christ were at hand."},{"num":3,"verse":"Let no one deceive you in any way. For that Day shall not come unless an apostasy comes first and the man of sin is revealed - the Son of Perdition -"},{"num":4,"verse":"who is an adversary and exalts himself against all that is called God or that is worshipped; so that he sits as God, in the Temple of God, showing himself that he is God."},{"num":5,"verse":"Do you not remember that when I was still with you, I told you these things?"},{"num":6,"verse":"And now you know what is restrained, so that he might be revealed in his time."},{"num":7,"verse":"For the mystery of iniquity is already at work. He who is now restrained shall be so only until He is taken out of the way."},{"num":8,"verse":"And then that wicked man shall be revealed, whom the Lord shall consume with the Spirit of His mouth and abolish with the brightness of His coming;"},{"num":9,"verse":"that is, whose coming is by the working of Satan (with all power and signs and lying wonders)"},{"num":10,"verse":"and in all deceit of unrighteousness among those who perish, because they did not receive the love of the truth (so that they might be saved)."},{"num":11,"verse":"And therefore, God shall send them strong delusion, so that they would believe lies,"},{"num":12,"verse":"so that all who did not believe the truth but had pleasure in unrighteousness might be damned."},{"num":13,"verse":"But we ought always to give thanks to God for you, brothers (beloved of the Lord) because God has chosen you for salvation from the beginning, through sanctification of the Spirit and the faith of truth;"},{"num":14,"verse":"to which He called you by our Gospel to obtain the glory of our Lord Jesus Christ."},{"num":15,"verse":"Therefore, brothers, stand fast and keep the instructions which you have been taught, either by word or by our letter."},{"num":16,"verse":"Now may the same Jesus Christ our Lord, and our God, even the Father, Who has loved us and has given us everlasting consolation and good hope through grace,"},{"num":17,"verse":"comfort your hearts and establish you in every word and good work."}]