[{"header":"Dealing with foreign worship"},{"num":7,"verse":"Now once the Lord your God brings you into the land you are entering to take possession of, and he drives out numerous nations before you—the Hittites, the Girgashites, the Amorites, the Canaanites, the Perizzites, the Hivites, and the Jebusites: seven nations that are larger and stronger than you—"},{"num":2,"verse":"once the Lord your God lays them before you, you must strike them down, placing them under the ban. Don’t make any covenants with them, and don’t be merciful to them."},{"num":3,"verse":"Don’t intermarry with them. Don’t give your daughter to one of their sons to marry, and don’t take one of their daughters to marry your son,"},{"num":4,"verse":"because they will turn your child away from following me so that they end up serving other gods. That will make the Lord’s anger burn against you, and he will quickly annihilate you."},{"num":5,"verse":"Instead, this is what you must do with these nations: rip down their altars, smash their sacred stones, cut down their sacred poles, and burn their idols"},{"num":6,"verse":"because you are a people holy to the Lord your God. The Lord your God chose you to be his own treasured people beyond all others on the fertile land."},{"num":7,"verse":"It was not because you were greater than all other people that the Lord loved you and chose you. In fact, you were the smallest of peoples!"},{"num":8,"verse":"No, it is because the Lord loved you and because he kept the solemn pledge he swore to your ancestors that the Lord brought you out with a strong hand and saved you from the house of slavery, from the power of Pharaoh, Egypt’s king."},{"num":9,"verse":"Know now then that the Lord your God is the only true God! He is the faithful God, who keeps the covenant and proves loyal to everyone who loves him and keeps his commands—even to the thousandth generation!"},{"num":10,"verse":"He is the God who personally repays anyone who hates him, ultimately destroying that kind of person. The Lord does not waste time with anyone who hates him; he repays them personally."},{"num":11,"verse":"So make sure you carefully keep the commandment, the regulations, and the case laws that I am commanding you right now."},{"num":12,"verse":"If you listen to these case laws and follow them carefully, the Lord your God will keep the covenant and display the loyalty that he promised your ancestors."},{"num":13,"verse":"He will love you, bless you, and multiply you. He will bless the fruit of your wombs and the fruit of your fertile land—all your grain, your wine, your oil, and the offspring of your cattle and flocks—upon the very fertile land that he swore to your ancestors to give to you."},{"num":14,"verse":"You will be more blessed than any other group of people. No one will be sterile or infertile—not among you or your animals."},{"num":15,"verse":"The Lord will remove all sickness from you. As for all those dreadful Egyptian diseases you experienced, the Lord won’t put them on you but will inflict them on all who hate you."},{"num":16,"verse":"You will destroy all the peoples that the Lord your God is handing over to you. Show them no pity. And don’t serve their gods because that would be a trap for you."},{"header":"Against power and lack of trust"},{"num":17,"verse":"If you happen to think to yourself, These nations are greater than we are; how can we possibly possess their land?"},{"num":18,"verse":"don’t be afraid of them! Remember, instead, what the Lord your God did to Pharaoh and all Egypt:"},{"num":19,"verse":"the great trials that you saw with your own eyes, the signs and wonders, and the strong hand and outstretched arm the Lord your God used to rescue you. That’s what the Lord your God will do to any people you fear."},{"num":20,"verse":"The Lord your God will send terror on them until even the survivors and those hiding from you are destroyed."},{"num":21,"verse":"Don’t dread these nations because the Lord your God, the great and awesome God, is with you and among you."},{"num":22,"verse":"(The Lord your God will drive out these nations before you bit by bit. You won’t be able to finish them off quickly; otherwise, the wild animals would become too much for you to handle.)"},{"num":23,"verse":"The Lord your God will lay these nations before you, throwing them into a huge panic until they are destroyed."},{"num":24,"verse":"He will hand their kings over to you, and you will wipe their names out from under the skies. No one will be able to stand before you; you will crush them."},{"num":25,"verse":"Burn the images of their gods. Don’t desire the silver or the gold that is on them and take it for yourself, or you will be trapped by it. That is detestable to the Lord your God."},{"num":26,"verse":"Don’t bring any detestable thing into your house, or you will be placed under the ban too, just like it is! You must utterly detest these kinds of things, despising them completely, because they are under the ban."}]