[{"header":"Instructions Regarding the Tribal Nations"},{"num":7,"verse":"“When the Lord your God brings you into the land that you are entering to possess, he will drive out many nations before you: the Hittites, Girgashites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites— seven nations who are more numerous and stronger than you. "},{"num":2,"verse":"So when the Lord your God delivers them to you and you have defeated them, then utterly destroy them. You are not to make any covenant with them nor be gracious to them. "},{"num":3,"verse":"You are not to intermarry with them. You are not to give your daughters to their sons nor take their daughters for your sons, "},{"num":4,"verse":"because they will turn your children from me to serve other gods so that the Lord’s anger blazes against you and swiftly destroys you by fire. "},{"num":5,"verse":"This is what you are to do to them: tear down their altars, break their pillars, cut down their ritual pillars, and burn their carved idols in fire, "},{"num":6,"verse":"because you are a holy people to the Lord your God. The Lord your God chose you to be his people, his treasured possession from all the nations on the face of the earth.”"},{"header":"The Lord Keeps His Covenant"},{"num":7,"verse":"“It wasn’t because you were more numerous than other nations of the earth that the Lord committed himself to you and chose you. In fact, you were the least numerous of all the nations. "},{"num":8,"verse":"But the Lord loved you and kept his oath that he made to your ancestors. The Lord brought you out with great power from slavery, from the control of Pharaoh, king of Egypt. "},{"num":9,"verse":"Know that the Lord your God is God, the trusted God who faithfully keeps his covenant to the thousandth generation of those who love him and obey his commands. "},{"num":10,"verse":"But for the one who hates him, he will repay him by destroying him. He will not delay dealing with someone who hates him. "},{"num":11,"verse":"Therefore, keep the commands, decrees, and ordinances that I am instructing you to obey today.”"},{"header":"The Lord Blesses Obedience"},{"num":12,"verse":"“If you pay attention to these laws and obey them, then the Lord your God will continue his covenant of gracious love with you that he promised with an oath to your ancestors. "},{"num":13,"verse":"He’ll love you and increase your numbers. He’ll bless the fruit of your womb, the fruit of your land (the grain, new wine, and oil), the offspring of your herds, and the lambs of your flock in the land that the Lord promised your ancestors he would give you. "},{"num":14,"verse":"You’ll be blessed among all the nations. There’ll be no infertility among you, not even among your herds. "},{"num":15,"verse":"The Lord will turn aside every disease from you. He won’t inflict on you the terrible diseases you knew in Egypt, but will inflict them instead on all who hate you. "},{"num":16,"verse":"You are to utterly destroy everyone whom the Lord your God will deliver to you. Don’t have pity on them nor serve their gods. Otherwise, they will become a snare for you.”"},{"header":"The Lord will Fight for You"},{"num":17,"verse":"“You may say to yourselves, ‘These nations are more numerous than we are. How can we dispossess them?’ "},{"num":18,"verse":"But you mustn’t fear them. Be sure to remember what the Lord your God did to Pharaoh and all of Egypt. "},{"num":19,"verse":"Your eyes saw the great trials, the signs and wonders, and the awesome power with which the Lord your God brought you out. The Lord your God will do the same to all the people whom you fear. "},{"num":20,"verse":"He’ll send plagues against them until the survivors who hide from you have perished. "},{"num":21,"verse":"Don’t tremble before them, because the Lord your God, who is among you, is a great and awesome God. "},{"num":22,"verse":"He slowly will dislodge these nations before you, but he won’t destroy them quickly, so the wild animals won’t multiply around you. "},{"num":23,"verse":"But the Lord your God will deliver them over to you, throwing them into great confusion, until they are destroyed. "},{"num":24,"verse":"He will deliver kings into your control and you are to wipe out the memory of them from under heaven. No one will be able to stand before you. You are utterly to destroy them. "},{"num":25,"verse":"Burn the images of their gods in the fire. Desire neither the silver nor the gold that adorns them, nor take them for yourselves, so you won’t be ensnared by them, because the gold and silver are detestable to the Lord your God. "},{"num":26,"verse":"Don’t bring any detestable thing to your house, because you yourself will be utterly destroyed along with these detestable things. You must absolutely abhor and detest all of it, because it has been devoted to destruction.”"}]