[{"num":20,"verse":"And the Israelites, the whole congregation, came into the Wilderness of Zin in the first month. And the people dwelt in Kadesh. Miriam died and was buried there."},{"num":2,"verse":"Now there was no water for the congregation, and they assembled together against Moses and Aaron."},{"num":3,"verse":"And the people contended with Moses, and said, Would that we had died when our brethren died [in the plague] before the Lord!"},{"num":4,"verse":"And why have you brought up the congregation of the Lord into this wilderness, that we should die here, we and our livestock?"},{"num":5,"verse":"And why have you made us come up out of Egypt to bring us into this evil place? It is no place of grain or of figs or of vines or of pomegranates. And there is no water to drink."},{"num":6,"verse":"Then Moses and Aaron went from the presence of the assembly to the door of the Tent of Meeting and fell on their faces. Then the glory of the Lord appeared to them."},{"num":7,"verse":"And the Lord said to Moses,"},{"num":8,"verse":"Take the rod, and assemble the congregation, you and Aaron your brother, and tell the rock before their eyes to give forth its water, and you shall bring forth to them water out of the rock; so you shall give the congregation and their livestock drink."},{"num":9,"verse":"So Moses took the rod from before the Lord, as He commanded him."},{"num":10,"verse":"And Moses and Aaron assembled the congregation before the rock and Moses said to them, Hear now, you rebels; must we bring you water out of this rock?"},{"num":11,"verse":"And Moses lifted up his hand and with his rod he smote the rock twice. And the water came out abundantly, and the congregation drank, and their livestock."},{"num":12,"verse":"And the Lord said to Moses and Aaron, Because you did not believe in (rely on, cling to) Me to sanctify Me in the eyes of the Israelites, you therefore shall not bring this congregation into the land which I have given them."},{"num":13,"verse":"These are the waters of Meribah [strife], where the Israelites contended with the Lord and He showed Himself holy among them."},{"num":14,"verse":"And Moses sent messengers from Kadesh to the king of Edom, saying, Thus says your kinsman Israel: You know all the adversity and birth pangs that have come upon us [as a nation]:"},{"num":15,"verse":"How our fathers went down to Egypt; we dwelt there a long time, and the Egyptians dealt evilly with us and our fathers."},{"num":16,"verse":"But when we cried to the Lord, He heard us and sent an angel and brought us forth out of Egypt. Now behold, we are in Kadesh, a city on your country’s edge."},{"num":17,"verse":"Let us pass, I pray you, through your country. We will not pass through field or vineyard, or drink of the water of the wells. We will go along the king’s highway; we will not turn aside to the right hand or to the left until we have passed your borders."},{"num":18,"verse":"But Edom said to him, You shall not go through, lest I come out against you with the sword."},{"num":19,"verse":"And the Israelites said to him, We will go by the highway, and if I and my livestock drink of your water, I will pay for it. Only let me pass through on foot, nothing else."},{"num":20,"verse":"But Edom said, You shall not go through. And Edom came out against Israel with many people and a strong hand."},{"num":21,"verse":"Thus Edom refused to give Israel passage through his territory, so Israel turned away from him."},{"num":22,"verse":"They journeyed from Kadesh, and the Israelites, even the whole congregation, came to Mount Hor."},{"num":23,"verse":"And the Lord said to Moses and Aaron at Mount Hor, on the border of the land of Edom,"},{"num":24,"verse":"Aaron shall be gathered to his people. For he shall not enter the land which I have given to the Israelites, because you both rebelled against My instructions at the waters of Meribah."},{"num":25,"verse":"Take Aaron and Eleazar his son and bring them up to Mount Hor."},{"num":26,"verse":"Strip Aaron of his vestments and put them on Eleazar his son, and Aaron shall be gathered to his people, and shall die there."},{"num":27,"verse":"And Moses did as the Lord commanded; and they went up Mount Hor in the sight of all the congregation."},{"num":28,"verse":"And Moses stripped Aaron of his [priestly] garments and put them on Eleazar his son. And Aaron died there on the mountain top; and Moses and Eleazar came down from the mountain."},{"num":29,"verse":"When all the congregation saw that Aaron was dead, they wept and mourned for him thirty days, all the house of Israel."}]