[{"header":"Warning of Jerusalem’s Fall"},{"num":22,"verse":"Thus says the Lord, “Go down to the house of the king of Judah and speak this word there: "},{"num":2,"verse":"‘Hear the word of the Lord, O king of Judah, you who sit on the throne of David—you and your servants and your people who enter by these gates. "},{"num":3,"verse":"Thus says the Lord, “Execute justice and righteousness, and rescue the one who has been robbed from the hand of his oppressor. And do no wrong; do no violence to the stranger, the fatherless, or the widow, nor shed innocent blood in this place. "},{"num":4,"verse":"For if you will indeed obey this word, then kings will enter through the gates of this palace, sitting in David’s place on his throne, riding in chariots and on horses, even the king himself and his servants and his people. "},{"num":5,"verse":"But if you will not hear and obey these words, I swear [an oath] by Myself,” says the Lord, “that this house will become a desolation.”’” "},{"num":6,"verse":"For thus says the Lord in regard to the house of the king of Judah:"},{"num":8,"verse":"“Many nations will pass by this city; and each man will say to another, ‘Why has the Lord done this to this great city?’ "},{"num":9,"verse":"Then they will answer, ‘Because the people ignored and abandoned the [solemn] covenant with the Lord their God and worshiped other gods and served them.’”"},{"num":11,"verse":"For thus says the Lord in regard to Shallum (Jehoahaz) the [third] son of Josiah, king of Judah, who reigned instead of Josiah his father and who went from this place, “Shallum will not return here anymore; "},{"num":12,"verse":"he will die in the place where they led him captive and not see this land again."},{"header":"Messages about the Kings"},{"num":18,"verse":"Therefore thus says the Lord in regard to Jehoiakim the [second] son of Josiah, king of Judah,"},{"num":24,"verse":"“As I live,” says the Lord, “though Coniah the son of Jehoiakim king of Judah were the signet [ring] on My right hand, yet would I pull you (Coniah) off. "},{"num":25,"verse":"And I will place you in the hand of those who seek your life and in the hand of those whom you fear, even into the hand of Nebuchadnezzar king of Babylon and into the hand of the Chaldeans. "},{"num":26,"verse":"I will hurl you and the mother who gave you birth into another country where you were not born, and there you will die. "},{"num":27,"verse":"But as for the land to which they long to return, they will not return to it."},{"num":30,"verse":"Thus says the Lord,"}]