[{"header":"Instructions for the Kings of Judah"},{"num":22,"verse":"This is what the Lord says: “Go down to the house of the king of Judah and tell him this: "},{"num":2,"verse":"‘Listen to this message from the Lord, king of Judah, you who sit on the throne of David—you, your officials, and your people who enter these gates. "},{"num":3,"verse":"This is what the Lord says: “Uphold justice and righteousness. Deliver from their oppressor those who have been robbed. Don’t mistreat or do violence to the alien, the orphan, or the widow, or shed the blood of innocent people in this place. "},{"num":4,"verse":"Rather, carefully obey this message, and then kings sitting for David on his throne and riding in chariots and on horses will enter the gates of this house. The king will enter along with his officials and his people. "},{"num":5,"verse":"But if you don’t listen to these words, I swear,” declares the Lord, “that this house will become a ruin.”’” "},{"num":6,"verse":"For this is what the Lord says about the house of the king of Judah,"},{"num":8,"verse":"“Many nations will pass by this city and say to one another, ‘Why did the Lord do this to this great city?’ "},{"num":9,"verse":"Then people will respond, ‘It is because they have forsaken the covenant of the Lord their God and have bowed down to other gods and served them.’"},{"num":11,"verse":"“For this is what the Lord says about Josiah’s son Shallum, king of Judah, who reigned in place of his father Josiah: ‘He went out from this place and won’t return to it again. "},{"num":12,"verse":"He will die in the place where they exiled him, and he won’t ever see this land again.’”"},{"header":"An Oracle against Jehoiakim"},{"num":18,"verse":"Therefore, this is what the Lord says about Josiah’s son Jehoiakim, king of Judah,"},{"header":"An Oracle against Jerusalem"},{"header":"An Oracle against Jehoiachin"},{"num":24,"verse":"“As certainly as I’m alive and living,” declares the Lord, “even if Jehoiakim’s son King Jehoiachin of Judah were a signet ring on my right hand, I would pull you off "},{"num":25,"verse":"and give you to those who are trying to kill you, whom you fear—that is, to King Nebuchadnezzar of Babylon and the Chaldeans. "},{"num":26,"verse":"I’ll hurl you and the mother who gave birth to you into another land where you were not born, and there you will die. "},{"num":27,"verse":"As for the land to which you want to return, you won’t return there!"}]