[[],[],[{"type":"header","content":"Walking Out on the Covenant of God"},{"type":"prose","content":"’s orders: “Go to the royal palace and deliver this Message. Say, ‘Listen to what  says, O King of Judah, you who sit on David’s throne—you and your officials and all the people who go in and out of these palace gates. This is ’s Message: Attend to matters of justice. Set things right between people. Rescue victims from their exploiters. Don’t take advantage of the homeless, the orphans, the widows. Stop the murdering!"}],[{"type":"prose","content":"“‘If you obey these commands, then kings who follow in the line of David will continue to go in and out of these palace gates mounted on horses and riding in chariots—they and their officials and the citizens of Judah. But if you don’t obey these commands, then I swear—’s Decree!—this palace will end up a heap of rubble.’”* * *"}],[{"type":"prose","content":"This is ’s verdict on Judah’s royal palace:"},{"type":"poetry","content":"“I number you among my favorite places—"},{"type":"poetry","content":"Yet I swear I’ll turn you into a wasteland,"},{"type":"poetry","content":"I’ll hire a demolition crew,"},{"type":"poetry","content":"Pound the country to a pulp"}],[{"type":"prose","content":"“Travelers from all over will come through here and say to one another, ‘Why would  do such a thing to this wonderful city?’ They’ll be told, ‘Because they walked out on the covenant of their , took up with other gods and worshiped them.’”"}],[{"type":"header","content":"Building a Fine House but Destroying Lives"},{"type":"poetry","content":"Don’t weep over dead King Josiah."},{"type":"poetry","content":"Weep for his exiled son:"}],[{"type":"prose","content":"For this is ’s Word on Shallum son of Josiah, who succeeded his father as king of Judah: “He’s gone from here, gone for good. He’ll die in the place they’ve taken him to. He’ll never see home again.”* * *"}],[{"type":"poetry","content":"“Doom to him who builds palaces but bullies people,"},{"type":"poetry","content":"Who cheats his workers"},{"type":"poetry","content":"Who says, ‘I’ll build me an elaborate mansion"},{"type":"poetry","content":"I’ll bring in rare and expensive woods"},{"type":"poetry","content":"So, that makes you a king—"},{"type":"poetry","content":"Your father got along just fine, didn’t he?"},{"type":"poetry","content":"And things went well with him."},{"type":"poetry","content":"And things went well for Judah."},{"type":"poetry","content":"“But you’re blind and brainless."},{"type":"poetry","content":"Taking advantage of the weak,"}],[{"type":"header","content":"You’ve Made a Total Mess of Your Life"},{"type":"poetry","content":"“People of Jerusalem, climb a Lebanon peak and weep,"},{"type":"poetry","content":"Climb the Abarim ridge and cry—"},{"type":"poetry","content":"I spoke to you when everything was going your way."},{"type":"poetry","content":"You’ve been that way as long as I’ve known you,"},{"type":"poetry","content":"All your leaders will be blown away,"},{"type":"poetry","content":"And you’ll find yourself in the gutter,"},{"type":"poetry","content":"You big-city people thought you were so important,"},{"type":"poetry","content":"You’re soon going to be doubled up in pain,"},{"type":"prose","content":"* * *"}],[{"type":"prose","content":"“As sure as I am the living God”—’s Decree—“even if you, Jehoiachin son of Jehoiakim king of Judah, were the signet ring on my right hand, I’d pull you off and give you to those who are out to kill you, to Nebuchadnezzar king of Babylon and the Chaldeans, and then throw you, both you and your mother, into a foreign country, far from your place of birth. There you’ll both die."}],[{"type":"prose","content":"“You’ll be homesick, desperately homesick, but you’ll never get home again.”"}],[{"type":"poetry","content":"Is Jehoiachin a leaky bucket,"},{"type":"poetry","content":"Why else would he be thrown away, he and his children,"},{"type":"poetry","content":"O land, land, land,"},{"type":"poetry","content":"This is ’s verdict:"},{"type":"poetry","content":"“Write this man off as if he were childless,"},{"type":"poetry","content":"Nothing will ever come of his life."}]]