[{"num":22,"verse":"The Lord told me, “Go down to the palace of the king of Judah. Give him a message from me there. "},{"num":2,"verse":"Say: ‘Listen, O king of Judah who follows in David’s succession. You, your officials, and your subjects who pass through the gates of this palace must listen to the Lord’s message. "},{"num":3,"verse":"The Lord says, “Do what is just and right. Deliver those who have been robbed from those who oppress them. Do not exploit or mistreat resident foreigners who live in your land, children who have no fathers, or widows. Do not kill innocent people in this land. "},{"num":4,"verse":"If you are careful to obey these commands, then the kings who follow in David’s succession and ride in chariots or on horses will continue to come through the gates of this palace, as will their officials and their subjects. "},{"num":5,"verse":"But, if you do not obey these commands, I solemnly swear that this palace will become a pile of rubble. I, the Lord, affirm it!”’"},{"num":6,"verse":"“For the Lord says concerning the palace of the king of Judah,"},{"num":8,"verse":"“‘People from other nations will pass by this city. They will ask one another, “Why has the Lord done such a thing to this great city?” "},{"num":9,"verse":"The answer will come back, “It is because they broke their covenant with the Lord their God and worshiped and served other gods.”"},{"header":"Judgment on Jehoahaz"},{"num":11,"verse":"“‘For the Lord has spoken about Shallum son of Josiah, who succeeded his father as king of Judah but was carried off into exile. He has said, “He will never return to this land. "},{"num":12,"verse":"For he will die in the country where they took him as a captive. He will never see this land again.”"},{"header":"Judgment on Jehoiakim"},{"num":18,"verse":"So the Lord has this to say about Josiah’s son, King Jehoiakim of Judah:"},{"header":"Warning to Jerusalem"},{"header":"Jeconiah Will Be Permanently Exiled"},{"num":24,"verse":"The Lord says, “As surely as I am the living God, you, Jeconiah, king of Judah, son of Jehoiakim, will not be the earthly representative of my authority. Indeed, I will take that right away from you. "},{"num":25,"verse":"I will hand you over to those who want to take your life and of whom you are afraid. I will hand you over to King Nebuchadnezzar of Babylon and his Babylonian soldiers. "},{"num":26,"verse":"I will force you and your mother who gave you birth into exile. You will be exiled to a country where neither of you were born, and you will both die there. "},{"num":27,"verse":"You will never come back to this land that you will long to return to!"},{"num":30,"verse":"The Lord says,"}]