[{"header":"A Message for Judah’s Kings"},{"num":22,"verse":"This is what the Lord said to me: “Go over and speak directly to the king of Judah. Say to him,"},{"num":2,"verse":"‘Listen to this message from the Lord, you king of Judah, sitting on David’s throne. Let your attendants and your people listen, too."},{"num":3,"verse":"This is what the Lord says: Be fair-minded and just. Do what is right! Help those who have been robbed; rescue them from their oppressors. Quit your evil deeds! Do not mistreat foreigners, orphans, and widows. Stop murdering the innocent!"},{"num":4,"verse":"If you obey me, there will always be a descendant of David sitting on the throne here in Jerusalem. The king will ride through the palace gates in chariots and on horses, with his parade of attendants and subjects."},{"num":5,"verse":"But if you refuse to pay attention to this warning, I swear by my own name, says the Lord, that this palace will become a pile of rubble.’”"},{"header":"A Message about the Palace"},{"num":6,"verse":"Now this is what the Lord says concerning Judah’s royal palace:"},{"num":8,"verse":"“People from many nations will pass by the ruins of this city and say to one another, ‘Why did the Lord destroy such a great city?’"},{"num":9,"verse":"And the answer will be, ‘Because they violated their covenant with the Lord their God by worshiping other gods.’”"},{"header":"A Message about Jehoahaz"},{"num":11,"verse":"For this is what the Lord says about Jehoahaz, who succeeded his father, King Josiah, and was taken away as a captive: “He will never return."},{"num":12,"verse":"He will die in a distant land and will never again see his own country.”"},{"header":"A Message about Jehoiakim"},{"num":18,"verse":"Therefore, this is what the Lord says about Jehoiakim, son of King Josiah:"},{"header":"A Message for Jehoiachin"},{"num":24,"verse":"“As surely as I live,” says the Lord, “I will abandon you, Jehoiachin son of Jehoiakim, king of Judah. Even if you were the signet ring on my right hand, I would pull you off."},{"num":25,"verse":"I will hand you over to those who seek to kill you, those you so desperately fear—to King Nebuchadnezzar of Babylon and the mighty Babylonian army."},{"num":26,"verse":"I will expel you and your mother from this land, and you will die in a foreign country, not in your native land."},{"num":27,"verse":"You will never again return to the land you yearn for."}]