[[],[{"type":"header","content":"Exhortation to Repent"},{"type":"prose","content":"Thus says the LORD: Go down to the house of the king of Judah, and speak there this word, "}],[{"type":"prose","content":"and say: Hear the word of the LORD, O King of Judah sitting on the throne of David—you, and your servants, and your people who enter these gates. "}],[{"type":"prose","content":"Thus says the LORD: Act with justice and righteousness, and deliver from the hand of the oppressor anyone who has been robbed. And do no wrong or violence to the alien, the orphan, and the widow, or shed innocent blood in this place. "}],[{"type":"prose","content":"For if you will indeed obey this word, then through the gates of this house shall enter kings who sit on the throne of David, riding in chariots and on horses, they, and their servants, and their people. "}],[{"type":"prose","content":"But if you will not heed these words, I swear by myself, says the LORD, that this house shall become a desolation. "}],[{"type":"prose","content":"For thus says the LORD concerning the house of the king of Judah:"},{"type":"poetry","content":"You are like Gilead to me,"},{"type":"poetry","content":"but I swear that I will make you a desert,"}],[{"type":"poetry","content":"I will prepare destroyers against you,"},{"type":"poetry","content":"they shall cut down your choicest cedars"}],[{"type":"prose","content":"And many nations will pass by this city, and all of them will say one to another, “Why has the LORD dealt in this way with that great city?” "}],[{"type":"prose","content":"And they will answer, “Because they abandoned the covenant of the LORD their God, and worshiped other gods and served them.”"}],[{"type":"header","content":"Message to the Sons of Josiah"},{"type":"prose","content":"For thus says the LORD concerning Shallum son of King Josiah of Judah, who succeeded his father Josiah, and who went away from this place: He shall return here no more, "}],[{"type":"prose","content":"but in the place where they have carried him captive he shall die, and he shall never see this land again."}],[{"type":"prose","content":"Therefore thus says the LORD concerning King Jehoiakim son of Josiah of Judah:"},{"type":"poetry","content":"They shall not lament for him, saying,"},{"type":"poetry","content":"They shall not lament for him, saying,"}],[{"type":"poetry","content":"With the burial of a donkey he shall be buried—"}],[{"type":"header","content":"Judgment on Coniah (Jehoiachin)"},{"type":"prose","content":"As I live, says the LORD, even if King Coniah son of Jehoiakim of Judah were the signet ring on my right hand, even from there I would tear you off "}],[{"type":"prose","content":"and give you into the hands of those who seek your life, into the hands of those of whom you are afraid, even into the hands of King Nebuchadrezzar of Babylon and into the hands of the Chaldeans. "}],[{"type":"prose","content":"I will hurl you and the mother who bore you into another country, where you were not born, and there you shall die. "}],[{"type":"prose","content":"But they shall not return to the land to which they long to return."}],[{"type":"poetry","content":"Is this man Coniah a despised broken pot,"},{"type":"poetry","content":"Why are he and his offspring hurled out"}],[{"type":"poetry","content":"O land, land, land,"}],[{"type":"poetry","content":"Thus says the :"},{"type":"poetry","content":"Record this man as childless,"},{"type":"poetry","content":"for none of his offspring shall succeed"}]]