[{"num":1,"verse":"From Simon Peter, a servant and apostle of Jesus Christ."},{"num":2,"verse":"Grace and peace be given to you more and more, because you truly know God and Jesus our Lord."},{"header":"God Has Given Us Blessings"},{"num":3,"verse":"Jesus has the power of God, by which he has given us everything we need to live and to serve God. We have these things because we know him. Jesus called us by his glory and goodness. "},{"num":4,"verse":"Through these he gave us the very great and precious promises. With these gifts you can share in God’s nature, and the world will not ruin you with its evil desires."},{"num":5,"verse":"Because you have these blessings, do your best to add these things to your lives: to your faith, add goodness; and to your goodness, add knowledge; "},{"num":6,"verse":"and to your knowledge, add self-control; and to your self-control, add patience; and to your patience, add service for God; "},{"num":7,"verse":"and to your service for God, add kindness for your brothers and sisters in Christ; and to this kindness, add love. "},{"num":8,"verse":"If all these things are in you and are growing, they will help you to be useful and productive in your knowledge of our Lord Jesus Christ. "},{"num":9,"verse":"But anyone who does not have these things cannot see clearly. He is blind and has forgotten that he was made clean from his past sins."},{"num":10,"verse":"My brothers and sisters, try hard to be certain that you really are called and chosen by God. If you do all these things, you will never fall. "},{"num":11,"verse":"And you will be given a very great welcome into the eternal kingdom of our Lord and Savior Jesus Christ."},{"num":12,"verse":"You know these things, and you are very strong in the truth, but I will always help you remember them. "},{"num":13,"verse":"I think it is right for me to help you remember as long as I am in this body. "},{"num":14,"verse":"I know I must soon leave this body, as our Lord Jesus Christ has shown me. "},{"num":15,"verse":"I will try my best so that you may be able to remember these things even after I am gone."},{"header":"We Saw Christ’s Glory"},{"num":16,"verse":"When we told you about the powerful coming of our Lord Jesus Christ, we were not telling just clever stories that someone invented. But we saw the greatness of Jesus with our own eyes. "},{"num":17,"verse":"Jesus heard the voice of God, the Greatest Glory, when he received honor and glory from God the Father. The voice said, “This is my Son, whom I love, and I am very pleased with him.” "},{"num":18,"verse":"We heard that voice from heaven while we were with Jesus on the holy mountain."},{"num":19,"verse":"This makes us more sure about the message the prophets gave. It is good for you to follow closely what they said as you would follow a light shining in a dark place, until the day begins and the morning star rises in your hearts. "},{"num":20,"verse":"Most of all, you must understand this: No prophecy in the Scriptures ever comes from the prophet’s own interpretation. "},{"num":21,"verse":"No prophecy ever came from what a person wanted to say, but people led by the Holy Spirit spoke words from God."}]