[{"num":1,"verse":"The vision of Isaiah the son of Amos, which he saw concerning Judah and Jerusalem in the days of Uzziah, Jotham, Ahaz, Hezekiah, kings of Judah."},{"num":2,"verse":"Hear, [ye] heavens, and give ear, [thou] earth! for Jehovah hath spoken: I have nourished and brought up children; and they have rebelled against me."},{"num":3,"verse":"The ox knoweth his owner, and the ass his master's crib; Israel doth not know, my people hath no intelligence."},{"num":4,"verse":"Ah sinful nation, a people laden with iniquity, a seed of evildoers, children that corrupt themselves! They have forsaken Jehovah; they have despised the Holy One of Israel; they are turned away backward."},{"num":5,"verse":"Why should ye be smitten any more? ye will revolt more and more: the whole head is sick, and the whole heart faint."},{"num":6,"verse":"From the sole of the foot even unto the head there is no soundness in him; wounds, and weals, and open sores: they have not been dressed, nor bound up, nor mollified with oil."},{"num":7,"verse":"Your country is desolate; your cities are burned with fire; your land, strangers eat it up in your presence, and it is desolate, as overthrown by strangers."},{"num":8,"verse":"And the daughter of Zion is left, as a booth in a vineyard, as a night-lodge in a cucumber-garden, as a besieged city."},{"num":9,"verse":"Unless Jehovah of hosts had left us a very small residue, we should have been as Sodom, we should have been like unto Gomorrah."},{"num":10,"verse":"Hear the word of Jehovah, rulers of Sodom; give ear unto the law of our God, people of Gomorrah!"},{"num":11,"verse":"To what purpose is the multitude of your sacrifices unto me? saith Jehovah. I am sated with burnt-offerings of rams, and the fat of fed beasts; and in the blood of bullocks, and of lambs, and of he-goats I take no pleasure."},{"num":12,"verse":"When ye come to appear before me, who hath required this from your hand—to tread my courts?"},{"num":13,"verse":"Bring no more vain oblations! Incense is an abomination unto me,—new moon and sabbath, the calling of convocations—wickedness and the solemn meeting I cannot bear."},{"num":14,"verse":"Your new moons and your set feasts my soul hateth: they are a burden to me; I am wearied of bearing [them]."},{"num":15,"verse":"And when ye spread forth your hands, I will hide mine eyes from you; yea, when ye make many prayers, I will not hear: your hands are full of blood."},{"num":16,"verse":"Wash you, make you clean; put away the evil of your doings from before mine eyes;—cease to do evil,"},{"num":17,"verse":"learn to do well: seek judgment, gladden the oppressed, do justice to the fatherless, plead for the widow."},{"num":18,"verse":"Come now, let us reason together, saith Jehovah: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool."},{"num":19,"verse":"If ye be willing and hearken, ye shall eat the good of the land;"},{"num":20,"verse":"but if ye refuse and rebel, ye shall be devoured with the sword: for the mouth of Jehovah hath spoken."},{"num":21,"verse":"How is the faithful city become a harlot! It was full of judgment; righteousness used to lodge in it, but now murderers."},{"num":22,"verse":"Thy silver is become dross, thy wine is mixed with water:"},{"num":23,"verse":"thy princes are rebellious, and companions of thieves; every one loveth presents, and hunteth after rewards; they judge not the fatherless, and the cause of the widow cometh not unto them."},{"num":24,"verse":"Therefore saith the Lord, Jehovah of hosts, the Mighty One of Israel: Ah! I will ease me of mine adversaries, and avenge me of mine enemies."},{"num":25,"verse":"And I will turn my hand upon thee, and will thoroughly purge away thy dross, and take away all thine alloy;"},{"num":26,"verse":"and I will restore thy judges as at the first, and thy counsellors as at the beginning. Afterwards thou shalt be called, Town of righteousness, Faithful city."},{"num":27,"verse":"Zion shall be redeemed with judgment, and they that return of her with righteousness."},{"num":28,"verse":"But the ruin of the transgressors and of the sinners [shall be] together; and they that forsake Jehovah shall be consumed."},{"num":29,"verse":"For they shall be ashamed of the terebinths that ye have desired, and ye shall blush for the gardens that ye have chosen."},{"num":30,"verse":"For ye shall be as a terebinth whose leaf fadeth, and as a garden that hath no water."},{"num":31,"verse":"And the strong shall be for tow, and his work a spark; and they shall both burn together, and there shall be none to quench [them]."}]