[{"header":"Christ Gives Freedom"},{"num":5,"verse":"Christ has set us free! This means we are really free. Now hold on to your freedom and don’t ever become slaves of the Law again."},{"num":2,"verse":"I, Paul, promise you that Christ won’t do you any good if you get circumcised. "},{"num":3,"verse":"If you do, you must obey the whole Law. "},{"num":4,"verse":"And if you try to please God by obeying the Law, you have cut yourself off from Christ and his wonderful kindness. "},{"num":5,"verse":"But the Spirit makes us sure that God will accept us because of our faith in Christ. "},{"num":6,"verse":"If you are a follower of Christ Jesus, it makes no difference whether you are circumcised or not. All that matters is your faith that makes you love others."},{"num":7,"verse":"You were doing so well until someone made you turn from the truth. "},{"num":8,"verse":"And that person was certainly not sent by the one who chose you. "},{"num":9,"verse":"A little yeast can change a whole batch of dough, "},{"num":10,"verse":"but you belong to the Lord. That makes me certain that you will do what I say, instead of what someone else tells you to do. Whoever is causing trouble for you will be punished."},{"num":11,"verse":"My friends, if I still preach that people need to be circumcised, why am I in so much trouble? The message about the cross would no longer be a problem, if I told people to be circumcised. "},{"num":12,"verse":"I wish that everyone who is upsetting you would not only get circumcised, but would cut off much more!"},{"num":13,"verse":"My friends, you were chosen to be free. So don’t use your freedom as an excuse to do anything you want. Use it as an opportunity to serve each other with love. "},{"num":14,"verse":"All that the Law says can be summed up in the command to love others as much as you love yourself. "},{"num":15,"verse":"But if you keep attacking each other like wild animals, you had better watch out or you will destroy yourselves."},{"header":"God’s Spirit and Our Own Desires"},{"num":16,"verse":"If you are guided by the Spirit, you won’t obey your selfish desires. "},{"num":17,"verse":"The Spirit and your desires are enemies of each other. They are always fighting each other and keeping you from doing what you feel you should. "},{"num":18,"verse":"But if you obey the Spirit, the Law of Moses has no control over you."},{"num":19,"verse":"People’s desires make them give in to immoral ways, filthy thoughts, and shameful deeds. "},{"num":20,"verse":"They worship idols, practice witchcraft, hate others, and are hard to get along with. People become jealous, angry, and selfish. They not only argue and cause trouble, but they are "},{"num":21,"verse":"envious. They get drunk, carry on at wild parties, and do other evil things as well. I told you before, and I am telling you again: No one who does these things will share in the blessings of God’s kingdom."},{"num":22,"verse":"God’s Spirit makes us loving, happy, peaceful, patient, kind, good, faithful, "},{"num":23,"verse":"gentle, and self-controlled. There is no law against behaving in any of these ways. "},{"num":24,"verse":"And because we belong to Christ Jesus, we have killed our selfish feelings and desires. "},{"num":25,"verse":"God’s Spirit has given us life, and so we should follow the Spirit. "},{"num":26,"verse":"But don’t be conceited or make others jealous by claiming to be better than they are."}]