[{"num":37,"verse":"Ya‘akov continued living in the land where his father had lived as a foreigner, the land of Kena‘an."},{"num":2,"verse":"Here is the history of Ya‘akov. When Yosef was seventeen years old he used to pasture the flock with his brothers, even though he was still a boy. Once when he was with the sons of Bilhah and the sons of Zilpah, his father’s wives, he brought a bad report about them to their father. "},{"num":3,"verse":"Now Isra’el loved Yosef the most of all his children, because he was the son of his old age; and he made him a long-sleeved robe. "},{"num":4,"verse":"When his brothers saw that their father loved him more than all his brothers, they began to hate him and reached the point where they couldn’t even talk with him in a civil manner."},{"num":5,"verse":"Yosef had a dream which he told his brothers, and that made them hate him all the more. "},{"num":6,"verse":"He said to them, “Listen while I tell you about this dream of mine. "},{"num":7,"verse":"We were tying up bundles of wheat in the field when suddenly my bundle got up by itself and stood upright; then your bundles came, gathered around mine and prostrated themselves before it.” "},{"num":8,"verse":"His brothers retorted, “Yes, you will certainly be our king. You’ll do a great job of bossing us around!” And they hated him still more for his dreams and for what he said."},{"num":9,"verse":"He had another dream which he told his brothers: “Here, I had another dream, and there were the sun, the moon and eleven stars prostrating themselves before me.” "},{"num":10,"verse":"He told his father too, as well as his brothers, but his father rebuked him: “What is this dream you have had? Do you really expect me, your mother and your brothers to come and prostrate ourselves before you on the ground?” "},{"num":11,"verse":"His brothers were jealous of him, but his father kept the matter in mind."},{"num":12,"verse":"(ii) After this, when his brothers had gone to pasture their father’s sheep in Sh’khem, "},{"num":13,"verse":"Isra’el asked Yosef, “Aren’t your brothers pasturing the sheep in Sh’khem? Come, I will send you to them.” He answered, “Here I am.” "},{"num":14,"verse":"He said to him, “Go now, see whether things are going well with your brothers and with the sheep, and bring word back to me.” So he sent him away from the Hevron Valley, and he went to Sh’khem, "},{"num":15,"verse":"where a man found him wandering around in the countryside. The man asked him, “What are you looking for?” "},{"num":16,"verse":"“I’m looking for my brothers,” he answered. “Tell me, please, where are they pasturing the sheep?” "},{"num":17,"verse":"The man said, “They’ve left here; because I heard them say, ‘Let’s go to Dotan.’” Yosef went after his brothers and found them in Dotan."},{"num":18,"verse":"They spotted him in the distance, and before he had arrived where they were, they had already plotted to kill him. "},{"num":19,"verse":"They said to each other, “Look, this dreamer is coming! "},{"num":20,"verse":"So come now, let’s kill him and throw him into one of these water cisterns here. Then we’ll say some wild animal devoured him. We’ll see then what becomes of his dreams!” "},{"num":21,"verse":"But when Re’uven heard this, he saved him from being destroyed by them. He said, “We shouldn’t take his life. "},{"num":22,"verse":"Don’t shed blood,” Re’uven added. “Throw him into this cistern here in the wilds, but don’t lay hands on him yourselves.” He intended to rescue him from them later and restore him to his father."},{"num":23,"verse":"(iii) So it was that when Yosef arrived to be with his brothers, they stripped off his robe, the long-sleeved robe he was wearing, "},{"num":24,"verse":"and took him and threw him into the cistern (the cistern was empty; without any water in it). "},{"num":25,"verse":"Then they sat down to eat their meal; but as they looked up, they saw in front of them a caravan of Yishma‘elim coming from Gil‘ad, their camels loaded with aromatic gum, healing resin and opium, on their way down to Egypt. "},{"num":26,"verse":"Y’hudah said to his brothers, “What advantage is it to us if we kill our brother and cover up his blood? "},{"num":27,"verse":"Come, let’s sell him to the Yishma‘elim, instead of putting him to death with our own hands. After all, he is our brother, our own flesh.” His brothers paid attention to him. "},{"num":28,"verse":"So when the Midyanim, merchants, passed by, they drew and lifted Yosef up out of the cistern and sold him for half a pound of silver shekels to the Yishma‘elim, who took Yosef on to Egypt."},{"num":29,"verse":"Re’uven returned to the cistern, and, upon seeing that Yosef wasn’t in it, tore his clothes in mourning. "},{"num":30,"verse":"He returned to his brothers and said, “The boy isn’t there! Where can I go now?”"},{"num":31,"verse":"They took Yosef’s robe, killed a male goat and dipped the robe in the blood. "},{"num":32,"verse":"Then they sent the long-sleeved robe and brought it to their father, saying, “We found this. Do you know if it’s your son’s robe or not?” "},{"num":33,"verse":"He recognized it and cried, “It’s my son’s robe! Some wild animal has torn Yosef in pieces and eaten him!” "},{"num":34,"verse":"Ya‘akov tore his clothes and, putting sackcloth around his waist, mourned his son for many days. "},{"num":35,"verse":"Though all his sons and daughters tried to comfort him, he refused all consolation, saying, “No, I will go down to the grave, to my son, mourning.” And his father wept for him."},{"num":36,"verse":"In Egypt the Midyanim sold Yosef to Potifar, one of Pharaoh’s officials, a captain of the guard."}]