[{"num":37,"verse":"2 Joseph accuseth his brethren. 5 He dreameth and is hated of his brethren. 28 They sell him to the Ishmaelites. 34 Jacob bewaileth Joseph."},{"num":1,"verse":"Jacob now dwelt in the land, wherein his father was a stranger, in the land of Canaan."},{"num":2,"verse":"These are the generations of Jacob when Joseph was seventeen years old, he kept sheep with his brethren, and the child was with the sons of Bilhah, and with the sons of Zilpah, his father’s wives, And Joseph brought unto their father their evil saying."},{"num":3,"verse":"Now Israel loved Joseph more than all his sons, because he begat him in his old age and he made him a coat of many colors."},{"num":4,"verse":"So when his brethren saw that their father loved him more than all his brethren, then they hated him, and could not speak peaceably unto him."},{"num":5,"verse":"¶ And Joseph dreamed a dream, and told his brethren, who hated him so much the more."},{"num":6,"verse":"For he said unto them, Hear, I pray you this dream which I have dreamed."},{"num":7,"verse":"Behold now, we were binding sheaves in the midst of the field: and lo, my sheaf arose and also stood upright, and behold, your sheaves compassed round about, and did reverence to my sheaf."},{"num":8,"verse":"Then his brethren said to him, What, shalt thou reign over us, and rule us? or shalt thou have altogether dominion over us? And they hated him so much the more, for his dreams, and for his words."},{"num":9,"verse":"¶ Again he dreamed another dream, and told it his brethren, and said, Behold, I have had one dream more, and behold, the Sun and the Moon and eleven stars did reverence to me."},{"num":10,"verse":"Then he told it unto his father and to his brethren, and his father rebuked him, and said unto him, What is this thy dream, which thou hast dreamed? shall I, and thy mother, and thy brethren come indeed and fall on the ground before thee?"},{"num":11,"verse":"And his brethren envied him, but his father noted the saying."},{"num":12,"verse":"¶ Then his brethren went to keep their father’s sheep in Shechem."},{"num":13,"verse":"And Israel said unto Joseph, Do not thy brethren keep in Shechem? come and I will send thee to them."},{"num":14,"verse":"And he answered him, I am here. Then he said unto him, Go now, see whether it be well with thy brethren, and how the flocks prosper, and bring me word again: so he sent him from the vale of Hebron, and he came to Shechem."},{"num":15,"verse":"¶ Then a man found him: for lo, he was wandering in the field, and the man asked him, saying, what seekest thou?"},{"num":16,"verse":"And he answered, I seek my brethren: tell me, I pray thee, where they keep sheep."},{"num":17,"verse":"And the man said, they are departed hence: for I heard them say, Let us go unto Dothan. Then went Joseph after his brethren, and found them in Dothan."},{"num":18,"verse":"And when they saw him afar off, even before he came at them, they conspired against him for to slay him."},{"num":19,"verse":"For they said one to another, Behold, this dreamer cometh."},{"num":20,"verse":"Come now therefore, and let us slay him, and cast him into some pit, and we will say, A wicked beast hath devoured him: then we shall see, what will come of his dreams."},{"num":21,"verse":"But when Reuben heard that, he delivered him out of their hands, and said, Let us not kill him."},{"num":22,"verse":"Also Reuben said unto them, Shed not blood, but cast him into this pit that is in the wilderness, and lay no hand upon him. Thus he said, that he might deliver him out of their hand, and restore him to his father."},{"num":23,"verse":"¶ Now when Joseph was come unto his brethren, they stripped Joseph out of his coat, his parti-colored coat that was upon him."},{"num":24,"verse":"And they took him, and cast him into a pit, and the pit was empty, without water in it."},{"num":25,"verse":"Then they sat them down to eat bread: and lift up their eyes and looked, and behold, there came a company of Ishmaelites from Gilead, and their camels laden with spicery, and balm, and myrrh, and were going to carry it down into Egypt."},{"num":26,"verse":"Then Judah said to his brethren, What availeth it, if we slay our brother, though we keep his blood secret?"},{"num":27,"verse":"Come and let us sell him to the Ishmaelites, and let not our hands be upon him: for he is our brother, and our flesh: and his brethren obeyed."},{"num":28,"verse":"Then the Midianites’ merchant men passed by, and they drew forth, and lift Joseph out of the pit, and sold Joseph to the Ishmaelites for twenty pieces of silver: who brought Joseph into Egypt."},{"num":29,"verse":"¶ Afterward Reuben returned to the pit, and behold, Joseph was not in the pit: then he rent his clothes,"},{"num":30,"verse":"And returned to his brethren, and said, The child is not yonder, and I, whither shall I go?"},{"num":31,"verse":"And they took Joseph’s coat, and killed a kid of the goats, and dipped the coat in the blood."},{"num":32,"verse":"So they sent that parti-colored coat, and they brought it unto their father, and said, This have we found: see now, whether it be thy son’s coat, or no."},{"num":33,"verse":"Then he knew it, and said, It is my son’s coat: a wicked beast hath devoured him: Joseph is surely torn in pieces."},{"num":34,"verse":"And Jacob rent his clothes, and put sackcloth about his loins, and sorrowed for his son a long season."},{"num":35,"verse":"Then all his sons and his daughters arose up to comfort him, but he would not be comforted, but said, Surely I will go down into the grave unto my son mourning: so his father wept for him."},{"num":36,"verse":"And the Midianites sold him into Egypt unto Potiphar an Eunuch of Pharaoh’s and his chief steward."}]