[{"header":"Joseph, the Suffering Righteous One[a]"},{"header":"Chapter 37"},{"num":2,"verse":"This is the story of the descendants of Jacob."},{"num":3,"verse":"Israel loved Joseph more than all his other sons because he was the son of his old age, and he had a long tunic made for him."},{"num":4,"verse":"His brothers, seeing that their father loved him most of all his sons, hated him and could not speak peaceably with him."},{"num":5,"verse":"Now Joseph had a dream and told it to his brothers, which made them hate him all the more."},{"num":6,"verse":"He told them, “Listen to this dream that I had."},{"num":7,"verse":"We were tying sheaves of grain in the fields, and my sheaf rose up and stood straight, while your sheaves came around and bowed before mine.”"},{"num":8,"verse":"His brothers said, “Would you like to reign over us and be our master?” And they hated him all the more because of his dream and for what he had told them."},{"num":9,"verse":"He had another dream and told it to his brothers saying, “I had another dream; listen. The sun and the moon and eleven stars bowed down before me.”"},{"num":10,"verse":"He told it to his father and brothers, and his father scolded him and said, “What type of dream is this? Must I and your mother and your brothers bow down to the ground in front of you?”"},{"num":11,"verse":"His brothers were jealous of him, but his father kept these things in mind."},{"num":12,"verse":"Sold as a Slave. His brothers went out to pasture the flocks of their father at Shechem."},{"num":13,"verse":"Israel said to Joseph, “You know that your brothers have gone to pasture at Shechem. Come, I wish to send you to them.”"},{"num":14,"verse":"He said, “Go to see how things are going for your brothers and the animals, then return and tell me.” He had him leave from the Valley of Hebron and travel to Shechem."},{"num":15,"verse":"As Joseph was wandering through the fields, he found a man who asked him, “For whom are you looking?”"},{"num":16,"verse":"He answered, “I am looking for my brothers. Tell me how to find where they are pasturing their flocks.”"},{"num":17,"verse":"That man said, “They pulled up their camp from here and I heard them say, ‘Let us go to Dothan.’ ”"},{"num":19,"verse":"They said to one another, “Here comes the dreamer."},{"num":20,"verse":"Come, let us kill him and throw him in some cistern. We will say, ‘A wild animal devoured him.’ Then we will see what becomes of his dreams.”"},{"num":21,"verse":"But Reuben heard this and wanted to save him from their hands. He said, “Let us not take his life.”"},{"num":22,"verse":"Then he said to them, “Do not spill his blood. Throw him into this cistern in the desert, but do not lay your hands upon him.” He intended to save him from their hands and restore him to their father."},{"num":23,"verse":"When Joseph reached his brothers, they stripped him of his tunic, the long tunic that he wore."},{"num":24,"verse":"They took him and cast him into a dry cistern."},{"num":25,"verse":"They then sat down to eat. When they looked up, they saw a caravan of Ishmaelites from Gilead with camels laden with gums, balm, and myrrh. It was carrying these things to Egypt."},{"num":26,"verse":"Judah said to his brothers, “What would we gain if we killed our brother and concealed his blood?"},{"num":27,"verse":"Come, let us sell him to the Ishmaelites. This way, we will not have laid hands on him, for he is our brother and our flesh.” His brothers agreed with him."},{"num":28,"verse":"Now some Ishmaelite traders passed by, and his brothers pulled Joseph up out of the cistern and sold Joseph to the Ishmaelites for twenty pieces of silver. Thus Joseph was brought into Egypt."},{"num":29,"verse":"When Reuben returned to the cistern, he found that Joseph was no longer there. He ripped his garments,"},{"num":30,"verse":"and he returned to his brothers and said, “The boy is gone! Where can I turn?”"},{"num":31,"verse":"They took Joseph’s tunic, slaughtered a goat, and dipped the tunic in its blood."},{"num":32,"verse":"They then sent their father the long tunic and dispatched this message, “We have found this; do you know if this is your son’s tunic?”"},{"num":33,"verse":"He recognized it and said, “It is my son’s tunic! A wild animal has devoured him. Joseph has been torn to pieces.”"},{"num":34,"verse":"Then Jacob ripped his clothes, put sackcloth on his loins, and mourned his son for many days."},{"num":35,"verse":"All his sons and his daughters came to console him, but he did not want to be consoled. He said, “No! I wish to go down into the netherworld mourning my son!” Thus did his father weep for him."},{"num":36,"verse":"Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, a counselor of Pharaoh and a commander of the guard."}]