[{"num":37,"verse":"Jacob ended up settling in the land where his father had lived as a foreigner for many years—in the land of Canaan. "},{"num":2,"verse":"Here now is the story of Jacob and his family:"},{"num":3,"verse":"Now Israel loved Joseph more than any of his other children because he came along when he was an old man. So Israel presented Joseph with a special robe he had made for him—a spectacularly colorful robe with long sleeves in it. "},{"num":4,"verse":"But when his brothers saw that their father loved him more than the rest, they grew to hate him and couldn’t find it in themselves to speak to him without resentment or argument."},{"num":5,"verse":"One day Joseph had a dream. When he told the dream to his brothers, they hated him even more."},{"num":9,"verse":"But Joseph had another dream, and he made the mistake of telling them about this dream too."},{"num":10,"verse":"When he told this dream to his father and brothers, even his father scolded him."},{"num":11,"verse":"Joseph’s brothers had become extremely jealous of him. But his father—though he scolded Joseph—kept this dream in the back of his mind."},{"num":12,"verse":"About this time, Joseph’s brothers went north toward Shechem in search of better pasture for their father’s flocks."},{"num":15,"verse":"a man found him wandering around in a field. The man asked him what he was looking for."},{"num":18,"verse":"They saw him coming even though he was still a long way off. Before he was near enough to hear them, they conspired to kill him."},{"num":21,"verse":"When Reuben heard the plan, he tried to help Joseph."},{"num":23,"verse":"When Joseph arrived, they ripped his robe off of him—the fancy, colorful robe he always wore that his father had made for him, "},{"num":24,"verse":"and they threw him into the pit. Now this pit happened to be an empty cistern; there was no water in it."},{"num":25,"verse":"Then they sat down to eat. Soon they looked up and saw a caravan of Ishmaelite traders approaching from Gilead. Their camels were loaded with gum, balm, and a fragrant resin; and they were on their way down to Egypt with their goods."},{"num":28,"verse":"As the Midianite traders were passing by, they brought Joseph up out of the pit and sold him to the Ishmaelites for about eight ounces of silver, the usual price of young male slaves. The traders set off with Joseph in the direction of Egypt."},{"num":29,"verse":"Now Reuben had not been around when the caravan came by, so when Reuben came back to the cistern later and saw that Joseph was not there, he tore his clothing in agony and despair. "},{"num":30,"verse":"He went back to his brothers."},{"num":31,"verse":"The brothers took Joseph’s fancy, colorful robe, slaughtered a male goat, and dipped it in the blood. Then they took the special robe to their father."},{"num":34,"verse":"Then Jacob wailed in agony and tore his clothes with the depth of emotional pain only a father could feel upon losing a child. He dressed in sackcloth and mourned his son for a long time. "},{"num":35,"verse":"All of his sons and daughters tried to comfort him, but he refused to be comforted."},{"num":36,"verse":"Meanwhile, the Midianites arrived in Egypt and sold Joseph to Potiphar, one of Pharaoh’s officers and the captain of the guard."}]