[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "More than",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—This number of infants, 120,000, according to the usual reckoning, gives a population of 600,000.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And also much cattle.—This, which at first reads like an anti-climax, is really, perhaps, the most striking thing in the whole of this marvellous book. Already the idea that a sympathy could exist between Jonah and the gourd has seemed to anticipate by thousands of years the feeling of modern poetry expressed in the lines,",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And also much cattle.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This, which at first reads like an anti-climax, is really, perhaps, the most striking thing in the whole of this marvellous book. Already the idea that a sympathy could exist between Jonah and the gourd has seemed to anticipate by thousands of years the feeling of modern poetry expressed in the lines,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“To me the meanest flower that blows can give",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thoughts that too often lie too deep for tears;”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and now the final touch, laying especial emphasis on the thought that even the cattle are an interest and care to God, seems at once to leap to the truth which even our own age has been slow to learn.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“He prayeth best who loveth best,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All creatures great and small,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the dear God who loveth us,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He made and loveth all.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jonah 4:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 4:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And should not I — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The God of infinite compassion; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spare Nineveh, that great city? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Wouldest thou have me to be less merciful to such a large and populous city as Nineveh, than thou art to a shrub? Surely the lives of so many thousand men, to say nothing of their immortal souls, are much more valuable than the life of a single contemptible plant. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wherein ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(in which city) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are more than six-score thousand persons that cannot discern, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That is, infants, who ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have no knowledge between good and evil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as it is expressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If we compute these as a fifth part of the inhabitants of Nineveh, the whole sum will amount to six hundred thousand persons, which are as few as can well be supposed to have inhabited a city of such large dimensions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And also much cattle — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Besides men, women, and children in Nineveh, there are many other of my creatures that are not sinful, and my tender mercies are, and shall be, over all my works. If thou wouldest be their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "destroyer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "yet I will be their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saviour. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Go, Jonah, rest thyself content, and be thankful that the goodness which spared Nineveh hath spared thee, in this thy inexcusable frowardness, peevishness, and impatience. I will be to repenting Nineveh what I am to thee, a God gracious and merciful, slow to anger and of great kindness, and I will turn from the evil which thou and they deserve. This reasoning seems to have silenced Jonah’s complaints, and made him sensible of his fault in repining at God’s mercy. It has been observed, that the book of Jonah ends as abruptly as it begins. It begins with a conjunction copulative, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the word came unto Jonah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c., which has made some commentators think that it was but an appendix to some of his other writings: and it ends without giving us any manner of account, either of what became of the Ninevites, or of Jonah himself after this expedition. It is likely, indeed, from the compassionate expressions which God makes use of toward the Ninevites, that for this time he reversed their doom; and it is not improbable that Jonah, when he had executed his commission, and been satisfied by God concerning his merciful procedure, returned into Judea. We may presume, however, that the repentance of the Ninevites was of no long continuance; for, not many years after, we find the Prophet Nahum foretelling the total destruction of that city. See Calmet and Bishop Newton. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:5-11 Jonah went out of the city, yet remained near at hand, as if he expected and desired its overthrow. Those who have fretful, uneasy spirits, often make troubles for themselves, that they may still have something to complain of. See how tender God is of his people in their afflictions, even though they are foolish and froward. A thing small in itself, yet coming seasonably, may be a valuable blessing. A gourd in the right place may do us more service than a cedar. The least creatures may be great plagues, or great comforts, as God is pleased to make them. Persons of strong passions are apt to be cast down with any trifle that crosses them, or to be lifted up with a trifle that pleases them. See what our creature-comforts are, and what we may expect them to be; they are withering things. A small worm at the root destroys a large gourd: our gourds wither, and we know not what is the cause. Perhaps creature-comforts are continued to us, but are made bitter; the creature is continued, but the comfort is gone. God prepared a wind to make Jonah feel the want of the gourd. It is just that those who love to complain, should never be left without something to complain of. When afflicting providences take away relations, possessions, and enjoyments, we must not be angry at God. What should especially silence discontent, is, that when our gourd is gone, our God is not gone. Sin and death are very dreadful, yet Jonah, in his heat, makes light of both. One soul is of more value than the whole world; surely then one soul is of more value than many gourds: we should have more concern for our own and others' precious souls, than for the riches and enjoyments of this world. It is a great encouragement to hope we shall find mercy with the Lord, that he is ready to show mercy. And murmurers shall be made to understand, that how willing soever they are to keep the Divine grace to themselves and those of their own way, there is one Lord over all, who is rich in mercy to all that call upon him. Do we wonder at the forbearance of God towards his perverse servant? Let us study our own hearts and ways; let us not forget our own ingratitude and obstinacy; and let us be astonished at God's patience towards us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Should I not spare? - literally \"have pity\" and so \"spare.\" God waives for the time the fact of the repentance of Nineveh, and speaks of those on whom man must have pity, those who never had any share in its guilt, the 120,000 children of Nineveh, \"I who, in the weakness of infancy, knew not which hand, \"the right\" or \"the left,\" is the stronger and fitter for every use.\" He who would have spared Sodom \"for ten's sake,\" might well be thought to spare Nineveh for the 120,000's sake, in whom the inborn corruption had not developed into the malice of willful sin. If these 120,000 were the children under three years old, they were 15 (as is calculated) of the whole population of Nineveh. If of the 600,000 of Nineveh all were guilty, who by reason of age could be, above 15 were innocent of actual sin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To Jonah, whose eye was evil to Nineveh for his people's sake, God says, as it were , \"Let the \"spirit\" which \"is willing\" say to the \"flesh\" which \"is weak,\" Thou grievest for the palm-christ, that is, thine own kindred, the Jewish people; and shall not I spare Nineveh that great city, shall not I provide for the salvation of the Gentiles in the whole world, who are in ignorance and error? For there are many thousands among the Gentiles, who go after 1 Corinthians 12:2. mute idols even as they are led: not out of malice but out of ignorance, who would without doubt correct their ways, if they had the knowledge of the truth, if they were shewn the difference \"between their right hand and their left,\" i. e., between the truth of God and the lie of men.\" But, beyond the immediate teaching to Jonah, God lays down a principle of His dealings at all times, that, in His visitations of nations, He Psalm 68:5, \"the Father of the fatherless and judge of the widows,\" takes special account of those who are of no account in man's sight, and defers the impending judgment, not for the sake of the wisdom of the wise or the courage of the brave, but for the helpless, weak, and, as yet, innocent as to actual sin. How much more may we think that He regards those with pity who have on them not only the recent uneffaced traces of their Maker's Hands, but have been reborn in the Image of Christ His Only Begotten Son! The infants clothed with Christ Galatians 3:27 must be a special treasure of the Church in the Eyes of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To Jonah, whose eye was evil to Nineveh for his people's sake, God says, as it were , \"Let the \"spirit\" which \"is willing\" say to the \"flesh\" which \"is weak,\" Thou grievest for the palm-christ, that is, thine own kindred, the Jewish people; and shall not I spare Nineveh that great city, shall not I provide for the salvation of the Gentiles in the whole world, who are in ignorance and error? For there are many thousands among the Gentiles, who go after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". mute idols even as they are led: not out of malice but out of ignorance, who would without doubt correct their ways, if they had the knowledge of the truth, if they were shewn the difference \"between their right hand and their left,\" i. e., between the truth of God and the lie of men.\" But, beyond the immediate teaching to Jonah, God lays down a principle of His dealings at all times, that, in His visitations of nations, He ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"the Father of the fatherless and judge of the widows,\" takes special account of those who are of no account in man's sight, and defers the impending judgment, not for the sake of the wisdom of the wise or the courage of the brave, but for the helpless, weak, and, as yet, innocent as to actual sin. How much more may we think that He regards those with pity who have on them not only the recent uneffaced traces of their Maker's Hands, but have been reborn in the Image of Christ His Only Begotten Son! The infants clothed with Christ ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 3:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " must be a special treasure of the Church in the Eyes of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": " \"How much greater the mercy of God than that even of a holy man; how far better to flee to the judgment-seat of God than to the tribunal of man. Had Jonah been judge in the cause of the Ninevites, he would have passed on them all, although penitent, the sentence of death for their past guilt, because God had passed it before their repentance. So David said to God 2 Samuel 24:14; \"Let us fall now into the hand of the Lord, for His mercies are great; and let me not fall into the hand of man.\" Whence the Church professes to God, that mercy is the characteristic of His power ; 'O God, who shewest Thy Almighty power most chiefly in shewing mercy and pity, mercifully grant unto us such a measure of Thy grace, that we, running the way of Thy commandments, may obtain Thy gracious promises, and be made partakers of Thy heavenly treasure. '\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " \"How much greater the mercy of God than that even of a holy man; how far better to flee to the judgment-seat of God than to the tribunal of man. Had Jonah been judge in the cause of the Ninevites, he would have passed on them all, although penitent, the sentence of death for their past guilt, because God had passed it before their repentance. So David said to God ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 24:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"Let us fall now into the hand of the Lord, for His mercies are great; and let me not fall into the hand of man.\" Whence the Church professes to God, that mercy is the characteristic of His power ; 'O God, who shewest Thy Almighty power most chiefly in shewing mercy and pity, mercifully grant unto us such a measure of Thy grace, that we, running the way of Thy commandments, may obtain Thy gracious promises, and be made partakers of Thy heavenly treasure. '\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Again, God here teaches Jonah and us all to conform ourselves in all things to the Divine Will, that, when He commandeth any work, we should immediately begin and continue it with alacrity and courage; when He bids us cease from it, or deprives it of its fruit and effect, we should immediately tranquilly cease, and patiently allow our work and toil to lack its end and fruit. For what is our aim, save to do the will of God, and in all things to confirm ourselves to it? But now the will of God is, that thou shouldest resign, yea destroy, the work thou hast begun. Acquiesce then in it. Else thou servest not the will of God, but thine own fancy and cupidity. And herein consists the perfection of the holy soul, that, in all acts and events, adverse or prosperous, it should with full resignation resign itself most humbly and entirely to God, and acquiesce, happen what will, yea, and rejoice that the will of God is fulfilled in this thing, and say with holy Job, \"The Lord gave, The Lord hath taken away; blessed be the Name of the Lord\" Ignatius had so transferred his own will into the will of God, that the said, 'If perchance the society, which I have begun and furthered with such toil, should be dissolved or perish, after passing half an hour in prayer, I should, by God's help, have no trouble from this thing, than which none sadder could befall me.' The saints let themselves be turned this way and that, round and round, by the will of God, as a horse by its rider.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Again, God here teaches Jonah and us all to conform ourselves in all things to the Divine Will, that, when He commandeth any work, we should immediately begin and continue it with alacrity and courage; when He bids us cease from it, or deprives it of its fruit and effect, we should immediately tranquilly cease, and patiently allow our work and toil to lack its end and fruit. For what is our aim, save to do the will of God, and in all things to confirm ourselves to it? But now the will of God is, that thou shouldest resign, yea destroy, the work thou hast begun. Acquiesce then in it. Else thou servest not the will of God, but thine own fancy and cupidity. And herein consists the perfection of the holy soul, that, in all acts and events, adverse or prosperous, it should with full resignation resign itself most humbly and entirely to God, and acquiesce, happen what will, yea, and rejoice that the will of God is fulfilled in this thing, and say with holy Job, \"The Lord gave, The Lord hath taken away; blessed be the Name of the Lord\" Ignatius had so transferred his own will into the will of God, that the said, 'If perchance the society, which I have begun and furthered with such toil, should be dissolved or perish, after passing half an hour in prayer, I should, by God's help, have no trouble from this thing, than which none sadder could befall me.' The saints let themselves be turned this way and that, round and round, by the will of God, as a horse by its rider.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. that cannot discern between their right hand and their left—children under three of four years old (De 1:39). Six score thousand of these, allowing them to be a fifth of the whole, would give a total population of six hundred thousand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "much cattle—God cares even for the brute creatures, of which man takes little account. These in wonderful powers and in utility are far above the shrub which Jonah is so concerned about. Yet Jonah is reckless as to their destruction and that of innocent children. The abruptness of the close of the book is more strikingly suggestive than if the thought had been followed out in detail.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And should not; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may not by virtue of my sovereignty, pity, spare, or pardon if I will? or is there not good reason to incline me to do it, and to justify my doing it? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God of infinite compassions and goodness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Spare Nineveh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a mighty city: Jonah, thou hast pity on a sorry shrub, and shall thy God be by thee confined that he should not have pity on a vast and mighty city? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That great city; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a stately structure, which cost immense treasures, was the labour of almost one million and half of labourers, through eight years, the great wonder of that world. Thy gourd, Jonah, may not be named in the day with this; only in a passion this must be ruined to please thee, and thy gourd must not lest it displease thee. Is this equal? wouldst thou have me less merciful to such a goodly city, than thou art to a weed? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wherein are more than sixscore thousand persons that cannot discern between their right hand and their left hand:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it was a single gourd Jonah pitied, and is angry that it was smitten; here are many hundred thousands of men and women, which I have pitied and spared. Here are more than sixscore thousand innocents who are infants, who are my creatures made for eternity, who grow slowly under my care and charge, whom I value as my own; and, peevish Jonah, wilt thou not allow me (who can) to show pity to mine own invaluable creatures, when thou pitiest what is neither thine nor valuable? Had it been thine, this might have required thy affection; had it been of worth, this might have excused thy earnestness for it; but all this aggravates thy fierce and cruel passion against Nineveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And also much cattle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": beside men, women, and children who are in Nineveh, there are many others of my creatures that are not sinful, and my tender mercies are and shall be over all my works. If thou wouldst be their butcher, yet I will be their God. I know what becomes me, God of prophets; and though once I hearkened to Elijah to send fire from heaven on contemptuous sinners, yet it is not meet to send fire from heaven upon repenting Nineveh. I know how to impress their minds with a continued belief that Jonah came from God to preach repentance, and that it was their repentance prevented their overthrow; I can salve thy credit, Jonah, and yet not humour thy cruelty. Go, Jonah, rest thyself content, and be thankful: that goodness, mercy, and kindness which spared Nineveh, hath spared thee in this thy inexcusable frowardness. I will be to repenting Nineveh what I am to thee, God gracious and merciful, slow to anger and of great kindness, and I will turn from the evil thou and they deserve. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And should not I spare Nineveh, that great city?.... See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; what is such a gourd or plant to that? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "wherein are more than sixscore thousand persons; or twelve myriads; that is, twelve times ten thousand, or a hundred and twenty thousand; meaning not all the inhabitants of Nineveh; for then it would not have appeared to be so great a city; but infants only, as next described: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that cannot discern between their right hand and their left hand; do not know one from another; cannot distinguish between good and evil, right and wrong; are not come to years of maturity and discretion; and therefore there were room and reason for pity and sparing mercy; especially since they had not been guilty of actual transgressions, at least not very manifest; and yet must have perished with their parents had Nineveh been overthrown. The number of infants in this city is a proof of the greatness of it, though not so as to render the account incredible; for, admitting these to be a fifth part of its inhabitants, as they usually are of any place, as Bochart (e) observes, it makes the number of its inhabitants to be but six or seven hundred thousand; and as many there were in Seleucia and Thebes, as Pliny (f) relates of the one, and Tacitus (g) of the other: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and also much cattle; and these more valuable than goods, as animals are preferable to, and more useful than, vegetables; and yet these must have perished in the common calamity. Jarchi understands by these grown up persons, whose knowledge is like the beasts that know not their Creator. No answer being returned, it may be reasonably supposed Jonah, was convinced of his sin and folly; and, to show his repentance for it, penned this, narrative, which records his infirmities and weaknesses, for the good of the church, and the instruction of saints in succeeding ages. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Phaleg. l. 4. c. 20. p. 253. (f) Nat. Hist. l. 6. c. 26. (g) Annal. l. 2. c. 60. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Phaleg. l. 4. c. 20. p. 253. (f) Nat. Hist. l. 6. c. 26. (g) Annal. l. 2. c. 60. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And should {h} not I spare Nineveh, that great city, wherein are more than sixscore thousand persons that {i} cannot discern between their right hand and their left hand; and also much cattle?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And should ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not I spare Nineveh, that great city, wherein are more than sixscore thousand persons that ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cannot discern between their right hand and their left hand; and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "also",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " much cattle?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Thus God mercifully reproves him who would pity himself and this gourd, and yet would keep God from showing his compassion to so many thousand people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Meaning that they were children and infants.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that cannot discern &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The idea that the whole population of Nineveh is thus described, the reference being to their moral condition of heathen ignorance and darkness, has nothing to recommend it. On the contrary, the moral susceptibility of the Ninevites, although they are heathen, is, as we have seen, a prominent feature in the history. The reference is no doubt to the children of tender age who were as yet incapable of moral discrimination, and could not therefore be regarded as responsible agents. The same thought is expressed, without a metaphor, by the phrases, “having no knowledge between good and evil,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; “Knowing to refuse the evil, and choose the good,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Between these helpless and innocent children, together with the great multitude of unoffending animals which the vast area of Nineveh contained, and the plant over which Jonah mourned, regarded simply as objects of human compassion, all moral considerations apart, the comparison lies.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Any attempt to compute the whole population of Nineveh from the data thus given must necessarily be precarious, from the difficulty of deciding at what age the line is to be drawn. But in any case the total would not be excessive, for the population of so large an area as we have seen that Nineveh enclosed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Should not I spare Ninevah?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The contrast between the feeling and conduct of God and those of the prophet is very forcible. Thou hast compassion for a plant of little worth, in whose growth thou hast had no concern, to which thou hast no right; should I not pity a great city which is mine, which I have permitted to grow into power? Thou hast compassion on a flower which sprang up in a day and withered in a day; should I not pity this town with its teeming population and its multitude of cattle, the least of which is more worth than any senseless plant, and which I uphold daily with my providence? ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Six score thousand persons that cannot discern between their right hand and their left hand;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " children of tender years, who did not know which hand was the strongest and fittest for use; or, metaphorically, who had no knowledge between good and evil\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), at present incapable of moral discernment. This limitation would include children of three or four years old; and, taking these as one-fifth of the population, we should set the inhabitants at six hundred thousand in number. The multitude of these innocent children, who must needs perish if the city were destroyed, is an additional reason why it should be spared. A still further claim for compassion is appended. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And also much cattle.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God's mercy is over all his works; he preserveth man and beast (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 145:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and as man is superior to other animals, so are cattle better than plants. The book ends abruptly, but its object is accomplished. Jonah is silenced; he can make no reply; he can only confess that he is entirely wrong, and that God is righteous. He learns the lesson that God would have all men saved, and that that narrow-mindedness which would exclude heathen from his kingdom is displeasing to him and alien from his design. \"For thou hast mercy upon all; for thou canst do all things, and winkest at the sins of men in order that they should repent. For thou lovest all the things that are, and abhorrest nothing that thou hast made; for never wouldst thou have made anything if thou hadst hated it But thou sparest all; for they are thine, O Lord, thou Lover of souls\" (Wisd. 11:23, etc.).  ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Jonah 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the rising of the dawn of the very next day, God appointed a worm, which punctured the miraculous tree so that it withered away; and when the sun arose He also appointed a sultry east wind, and the sun smote upon Jonah's head, so that he fainted away. Chărı̄shıth, from chârash, to be silent or quiet, is to be taken when used of the wind in the sense of sultry, as in the Chaldee (lxx συγκαίων). The meaning ventus, qualis flat tempore arandi, derived from chârish, the ploughing (Abulw.), or autumnal east wind (Hitzig), is far less suitable. When Jonah fainted away in consequence of the sun-stroke (for hith‛allēph, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he wished himself dead, since death was better for him than life (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ישׁאל את־נפשׁו למוּת, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"he wished that his soul might die,\" a kind of accusative with the infinitive (cf. Ewald, 336, b). But God answered, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by asking whether he was justly angry. Instead of Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") we have Elohim mentioned here, and Jehovah is not introduced as speaking till ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We have here an intimation, that just as Jonah's wish to die was simply an expression of the feelings of his mind, so the admonitory word of God was simply a divine voice within him setting itself against his murmuring. It was not till he had persisted in his ill-will, even after this divine admonition within, that Jehovah pointed out to him how wrong his murmuring was. Jehovah's speaking in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a manifestation of the divine will by supernatural inspiration. Jehovah directs Jonah's attention to the contradiction into which he has fallen, by feeling compassion for the withering of the miraculous tree, and at the same time murmuring because God has had compassion upon Nineveh with its many thousands of living beings, and has spared the city for the sake of these souls, many of whom have no idea whatever of right or wrong. Chastâ: \"Thou hast pitied the Qiqayon, at which thou hast not laboured, and which thou hast not caused to grow; for (שׁבּן  equals  אשׁר בּן) son of a night\" - i.e., in a night, or over night - \"has it grown, and over night perished, and I should not pity Nineveh?\" ואני is a question; but this is only indicated by the tone. If Jonah feels pity for the withering of a small shrub, which he neither planted nor tended, nor caused to grow, shall God not have pity with much greater right upon the creatures whom He has created and has hitherto sustained, and spare the great city Nineveh, in which more than 120,000 are living, who cannot distinguish their right hand from the left, and also much cattle? Not to be able to distinguish between the right hand and the left is a sign of mental infancy. This is not to be restricted, however, to the very earliest years, say the first three, but must be extended to the age of seven years, in which children first learn to distinguish with certainty between right and left, since, according to M. v. Niebuhr (p. 278), \"the end of the seventh year is a very common division of age (it is met with, for example, even among the Persians), and we may regard it as certain that it would be adopted by the Hebrews, on account of the importance they attached to the number seven.\" A hundred and twenty thousand children under seven years of age would give a population of six hundred thousand, since, according to Niebuhr, the number of children of the age mentioned is one-fifth the whole population, and there is no ground for assuming that the proportion in the East would be essentially different. This population is quite in accordance with the size of the city.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"Nineveh, in the broader sense,\" says M. v. Niebuhr, \"covers an area of about 400 English square miles. Hence there were about 40,000 persons to the square mile. Jones (in a paper on Nineveh) estimates the population of the chief city, according to the area, at 174,000 souls. So that we may reckon the population of the four larger walled cities at 350,000. There remain, therefore, for the smaller places and the level ground, 300,000 men on about sixteen square miles; that is to say, nearly 20,000 men upon the square mile.\" He then shows, from the agricultural conditions in the district of Elberfeld and the province of Naples, how thoroughly this population suits such a district. In the district of Elberfeld there are, in round numbers, 22,000 persons to the square mile, or, apart from the two large towns, 10,000. And if we take into account the difference in fertility, this is about the same density of population as that of Nineveh. The province of Naples bears a very great resemblance to Nineveh, not only in the kind of cultivation, but also in the fertility of the soil. And there, in round numbers, 46,000 are found to the square mile, or, exclusive of the capital, 22,000 souls.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Children who cannot distinguish between right and left, cannot distinguish good from evil, and are not yet accountable. The allusion to the multitude of unaccountable children contains a fresh reason for sparing the city: God would have been obliged to destroy so many thousand innocent ones along with the guilty. Besides this, there was \"much cattle\" in the city. \"Oxen were certainly superior to shrubs. If Jonah was right in grieving over one withered shrub, it would surely be a harder and more cruel thing for so many innocent animals to perish\" (Calvin). \"What could Jonah say to this? He was obliged to keep silence, defeated, as it were, by his own sentence\" (Luther). The history, therefore, breaks off with these words of God, to which Jonah could make no reply, because the object of the book was now attained, - namely, to give the Israelites an insight into the true nature of the compassion of the Lord, which embracers all nations with equal love. Let us, however, give heed to the sign of the prophet Jonah, and hold fast to the confession of Him who could say of Himself, \"Behold, a greater than Jonah is here!\" ",
        "children": []
      }
    ]
  }
]