[{"num":2,"verse":"Thus saith Hashem: For shloshah peysha’im of Moav, even for arba’ah, I will not turn away the punishment thereof; because he burned the bones of Melech Edom into lime;"},{"num":2,"verse":"But I will send an eish upon Moav, and it shall devour the fortresses of Keriyot; and Moav shall die with tumult, with war cries, and with the blast of the shofar;"},{"num":3,"verse":"And I will cut off the shofet (judge) from the midst thereof, and will slay all the sarim (princes) thereof with him, saith Hashem."},{"num":4,"verse":"Thus saith Hashem: For shloshah peysha’im of Yehudah, even for arba’ah, I will not turn away the punishment thereof; because they have despised the torat Hashem, and have not been shomer over His chukkim, and their lies caused them to err, after the halakhah of their avot;"},{"num":5,"verse":"But I will send an eish upon Yehudah, and it shall devour the fortresses of Yerushalayim."},{"num":6,"verse":"Thus saith Hashem: For shloshah peysha’im of Yisroel, even for arba’ah, I will not turn away the punishment thereof; because they sold the tzaddik for kesef, and the needy for a pair of sandals;"},{"num":7,"verse":"They who pant after the dust of the ground on the rosh of the poor, and turn aside the derech of the anavim; and an ish and his av will go in unto the same na’arah, to commit chillul Hashem against My Shem kodesh;"},{"num":8,"verse":"And they lay themselves down upon clothes taken in pledge by every mizbe’ach, and they guzzle the yayin of the fined in the Beis Eloheichem."},{"num":9,"verse":"Yet destroyed I HaEmori before them, whose height was like the height of the cedars, and he was strong as the oaks; yet I destroyed his p’ri from above, and his shorashim from beneath."},{"num":10,"verse":"Also I brought you up from Eretz Mitzrayim, and led you arba’im shanah through the midbar, to possess the Eretz HaEmori (land of the Amorite)."},{"num":11,"verse":"And I raised up of your banim for nevi’im, and of your bochurim for Nezirim. Is it not even thus, O ye Bnei Yisroel? saith Hashem."},{"num":12,"verse":"But ye gave the Nezirim yayin to drink; and commanded the nevi’im, saying, Prophesy not."},{"num":13,"verse":"Hinei, I am pressed under you, as a cart is pressed that is full of sheaves."},{"num":14,"verse":"Therefore flight shall perish from the swift, and the chazak shall not strengthen his ko’ach, neither shall the gibbor deliver his own nefesh;"},{"num":15,"verse":"Neither shall he stand that handleth the keshet; and he that is swift of foot shall not deliver his own nefesh; neither shall he that rideth the sus deliver himself."},{"num":16,"verse":"And he that is courageous among the gibborim shall flee away naked in that Yom, saith Hashem."}]