[{"num":2,"verse":"The Lord says, “The people of Moab have sinned again and again, and I will not forget it. I will not leave them unpunished anymore. For they desecrated the tombs of the kings of Edom, with no respect for the dead. "},{"num":2,"verse":"Now in return I will send fire upon Moab, and it will destroy all the palaces in Kerioth. Moab shall go down in tumult as the warriors shout and trumpets blare. "},{"num":3,"verse":"And I will destroy their king and slay all the leaders under him.” The Lord has spoken."},{"num":4,"verse":"The Lord says, “The people of Judah have sinned again and again, and I will not forget it. I will not leave them unpunished anymore. For they have rejected the laws of God, refusing to obey him. They have hardened their hearts and sinned as their fathers did. "},{"num":5,"verse":"So I will destroy Judah with fire and burn down all Jerusalem’s palaces and forts.”"},{"num":6,"verse":"The Lord says, “The people of Israel have sinned again and again, and I will not forget it. I will not leave them unpunished anymore. For they have perverted justice by accepting bribes and sold into slavery the poor who can’t repay their debts; they trade them for a pair of shoes. "},{"num":7,"verse":"They trample the poor in the dust and kick aside the meek."},{"num":8,"verse":"At their religious feasts they lounge in clothing stolen from their debtors, and in my own Temple they offer sacrifices of wine they purchased with stolen money."},{"num":9,"verse":"“Yet think of all I did for them! I cleared the land of the Amorites before them—the Amorites, as tall as cedar trees, and strong as oaks! But I lopped off their fruit and cut their roots. "},{"num":10,"verse":"And I brought you out from Egypt and led you through the desert forty years, to possess the land of the Amorites. "},{"num":11,"verse":"And I chose your sons to be Nazirites and prophets—can you deny this, Israel?” asks the Lord. "},{"num":12,"verse":"“But you caused the Nazirites to sin by urging them to drink your wine, and you silenced my prophets, telling them, ‘Shut up!’"},{"num":13,"verse":"“Therefore, I will make you groan as a wagon groans that is loaded with sheaves. "},{"num":14,"verse":"Your swiftest warriors will stumble in flight. The strong will all be weak, and the great ones can no longer save themselves. "},{"num":15,"verse":"The archer’s aim will fail, the swiftest runners won’t be fast enough to flee, and even the best of horsemen can’t outrun the danger then. "},{"num":16,"verse":"The most courageous of your mighty men will drop their weapons and run for their lives that day.” The Lord God has spoken."}]