[{"header":"Chapter 5"},{"num":1,"verse":"The Ark in the Temple of Dagon. The Philistines, having captured the ark of God, transferred it from Ebenezer to Ashdod. "},{"num":2,"verse":"They then took the ark of God and brought it into the temple of Dagon, placing it beside Dagon. "},{"num":3,"verse":"When the people of Ashdod rose early the next morning, Dagon was lying face down on the ground before the ark of the Lord. So they picked Dagon up and put him back in his place. "},{"num":4,"verse":"But early the next morning, when they arose, Dagon lay face down on the ground before the ark of the Lord, his head and hands broken off and lying on the threshold, his trunk alone intact. "},{"num":5,"verse":"For this reason, neither the priests of Dagon nor any others who enter the temple of Dagon tread on the threshold of Dagon in Ashdod to this very day."},{"num":6,"verse":"The Ark Is Carried About. Now the hand of the Lord weighed heavily on the people of Ashdod, ravaging them and afflicting the city and its vicinity with tumors. "},{"num":7,"verse":"On seeing how matters stood, the people of Ashdod decided, “The ark of the God of Israel must not remain with us, for his hand weighs heavily on us and Dagon our god.” "},{"num":8,"verse":"So they summoned all the Philistine leaders and inquired of them, “What shall we do with the ark of the God of Israel?” The people of Gath replied, “Let them move the ark of the God of Israel to us.” So they moved the ark of the God of Israel to Gath. "},{"num":9,"verse":"But after it had been brought there, the hand of the Lord was against the city, resulting in utter turmoil: the Lord afflicted its inhabitants, young and old, and tumors broke out on them. "},{"num":10,"verse":"The ark of God was next sent to Ekron; but as it entered that city, the people there cried out, “Why have they brought the ark of the God of Israel here to kill us and our kindred?” "},{"num":11,"verse":"Then they, too, sent a summons to all the Philistine leaders and pleaded: “Send away the ark of the God of Israel. Send it back to its place so it does not kill us and our kindred.” A deadly panic had seized the whole city, since the hand of God lay heavy upon it. "},{"num":12,"verse":"Those who escaped death were afflicted with tumors. Thus the outcry from the city went up to the heavens."}]