[[],[{"type":"header","content":"Capture of the Ark Provokes God"},{"type":"prose","content":"Now the Philistines took the ark of God and brought it from Ebenezer to Ashdod."}],[{"type":"prose","content":"Then the Philistines took the ark of God and brought it into the house of Dagon, and placed it beside Dagon."}],[{"type":"prose","content":"When the Ashdodites got up early the next day, behold, Dagon had fallen on his face to the ground before the ark of the . So they took Dagon and set him back in his place."}],[{"type":"prose","content":"But when they got up early the next morning, behold, Dagon had fallen on his face to the ground before the ark of the . And the head of Dagon and both palms of his hands  cut off on the threshold; only the torso of Dagon was left."}],[{"type":"prose","content":"For that reason neither the priests of Dagon nor any who enter Dagon’s house step on the threshold of Dagon in Ashdod to this day."}],[{"type":"prose","content":"Now the hand of the  was heavy on the Ashdodites, and He made them feel devastated and struck them with tumors,  Ashdod and its territories."}],[{"type":"prose","content":"When the men of Ashdod saw that it was so, they said, “The ark of the God of Israel must not remain with us, because His hand is severe on us and on Dagon our god.”"}],[{"type":"prose","content":"So they sent  and gathered all the governors of the Philistines to them, and said, “What shall we do with the ark of the God of Israel?” And they said, “Have the ark of the God of Israel brought to Gath.” So they took the ark of the God of Israel away."}],[{"type":"prose","content":"After they had taken it away, the hand of the  was against the city,  a very great panic; and He struck the people of the city, from the young to the old, so that tumors broke out on them."}],[{"type":"prose","content":"So they sent the ark of God to Ekron. And as the ark of God came to Ekron, the Ekronites cried out, saying, “They have brought the ark of the God of Israel to us, to kill us and our people!”"}],[{"type":"prose","content":"Therefore they sent  and gathered all the governors of the Philistines, and said, “Send away the ark of the God of Israel and let it return to its own place, so that it will not kill us and our people!” For there was a deadly panic throughout the city; the hand of God was very heavy there."}],[{"type":"prose","content":"And the people who did not die were struck with tumors, and the outcry of the city went up to heaven."}]]