[{"num":2,"verse":"I would like you to know what a great struggle I am having for you, and for those at Laodicea, and for everyone who has not seen my face in the flesh, "},{"num":2,"verse":"that their hearts may be comforted, being knit together in love, and receive all the riches and assurance of full understanding, and knowledge of the mystery of God, both of the Father and of Christ, "},{"num":3,"verse":"in whom are hidden all the treasures of wisdom and knowledge. "},{"num":4,"verse":"Now this I say lest anyone beguile you with enticing words. "},{"num":5,"verse":"For though I am absent in the flesh, yet I am with you in spirit, rejoicing and seeing your orderliness and the steadfastness of your faith in Christ."},{"header":"Fullness of Life in Christ"},{"num":6,"verse":"As you have received Christ Jesus the Lord, so walk in Him, "},{"num":7,"verse":"rooted and built up in Him and established in the faith, as you have been taught, and abounding with thanksgiving."},{"num":8,"verse":"Beware lest anyone captivate you through philosophy and vain deceit, in the tradition of men and the elementary principles of the world, and not after Christ."},{"num":9,"verse":"For in Him lives all the fullness of the Godhead bodily. "},{"num":10,"verse":"And you are complete in Him, who is the head of all authority and power. "},{"num":11,"verse":"In Him you were also circumcised with the circumcision made without hands, by putting off the body of the sins of the flesh, by the circumcision of Christ, "},{"num":12,"verse":"buried with Him in baptism, in which also you were raised with Him through the faith of the power of God, who has raised Him from the dead."},{"num":13,"verse":"And you, being dead in your sins and the uncircumcision of your flesh, He has resurrected together with Him, having forgiven you all sins. "},{"num":14,"verse":"He blotted out the handwriting of ordinances that was against us and contrary to us, and He took it out of the way, nailing it to the cross. "},{"num":15,"verse":"And having disarmed authorities and powers, He made a show of them openly, triumphing over them by the cross."},{"num":16,"verse":"Therefore let no one judge you regarding food, or drink, or in respect of a holy day or new moon or sabbath days. "},{"num":17,"verse":"These are shadows of things to come, but the substance belongs to Christ. "},{"num":18,"verse":"Do not let anyone cheat you of your reward by delighting in false humility and the worship of angels, dwelling on those things which he has not seen, vainly arrogant due to his unspiritual mind, "},{"num":19,"verse":"and not supporting the head, from which the entire body, nourished and knit together by joints and sinews, grows as God gives the increase."},{"header":"The New Life in Christ"},{"num":20,"verse":"Therefore, if you died with Christ to the elementary principles of the world, why, as if you were living in the world, do you subject yourself to legalistic rules? "},{"num":21,"verse":"“Do not touch! Do not taste! Do not handle!” "},{"num":22,"verse":"These all are to perish with use and are aligned with the commandments and doctrines of men. "},{"num":23,"verse":"These things have indeed a show of wisdom in self-imposed worship and humility and neglecting of the body, but are worthless against the indulgence of the flesh."}]