[{"num":2,"verse":"For gar I  want thelō you hymeis to  know oida how  great hēlikos a  struggle agōn I  have echō for hyper you hymeis and kai for  those ho in en Laodicea Laodikeia and kai for  all hosos who  have  not ou seen horaō · ho my egō face prosōpon in en the  flesh sarx. "},{"num":2,"verse":"My goal is  that hina their autos hearts kardia may  be  encouraged parakaleō · ho and  knit symbibazō together  in en love agapē,  · kai so eis that  they may have  all pas the  wealth ploutos of ho full  assurance plērophoria of ho understanding synesis,  for eis knowledge epignōsis of ho God’ s theos mystery mystērion,  · ho which is  Christ Christos, "},{"num":3,"verse":"in en whom hos are eimi hidden apokryphos all pas the ho treasures thēsauros of ho wisdom sophia and kai knowledge gnōsis. "},{"num":4,"verse":"I  am  telling legō you  this houtos so hina that  no mēdeis one  may  deceive paralogizomai you hymeis with en specious  arguments pithanologia. "},{"num":5,"verse":"Even ei though  · kai I  am  absent apeimi in ho body sarx,  I  am eimi with syn you hymeis in ho spirit pneuma, and  I  rejoice chairō · kai to  see blepō your hymeis · ho orderly taxis conduct  and kai the ho stability stereōma of ho your hymeis faith pistis in eis Christ Christos. "},{"num":6,"verse":"So  then oun,  just  as hōs you  received paralambanō · ho Christ Christos Jesus Iēsous as ho Lord kyrios,  continue  to  live peripateō in en him autos, "},{"num":7,"verse":"rooted rhizoō and kai built epoikodomeō up  in en him autos,  · kai established bebaioō in  the ho faith pistis just kathōs as  you  were  taught didaskō, and  abounding perisseuō in en thanksgiving eucharistia. "},{"num":8,"verse":"See blepō to  it  that  no mē one tis takes eimi you hymeis · ho captive sylagōgeō by dia means  of  · ho philosophy philosophia and kai empty kenos deceit apatē,  according kata to  the ho tradition paradosis of ho men anthrōpos,  according kata to  the ho elemental stoicheion spirits  of ho the  world kosmos,  and kai not ou according kata to  Christ Christos. "},{"num":9,"verse":"For hoti in en him autos the ho whole pas fullness plērōma of ho deity theotēs dwells katoikeō in  bodily sōmatikōs form , "},{"num":10,"verse":"and kai you  have eimi come  to  fullness plēroō in en him autos,  who hos is eimi the ho head kephalē of  every pas principality archē and kai power exousia. "},{"num":11,"verse":"In en him hos you  also kai were  circumcised peritemnō with  a  circumcision peritomē not acheiropoiētos made  with  hands ,  by en the ho putting apekdysis off  of ho the  body sōma of ho flesh sarx,  by en the ho circumcision peritomē of ho Christ Christos. "},{"num":12,"verse":"Having  been  buried synthaptō with  him autos in en · ho baptism baptismos,  you  have  also kai been  raised synegeirō with  him  through dia · ho faith pistis in  the ho powerful  working energeia of ho God theos,  who ho raised egeirō him autos from ek the  dead nekros. "},{"num":13,"verse":"And kai although eimi you hymeis were eimi dead nekros in en your ho trespasses paraptōma and kai the ho uncircumcision akrobystia of ho your hymeis flesh sarx, God  made  you hymeis alive syzōopoieō with syn Christ autos.  He  forgave charizomai us hēmeis all pas our ho transgressions paraptōma, "},{"num":14,"verse":"having  canceled exaleiphō the ho certificate cheirographon of  debt  with  its ho legal  demands dogma against kata us hēmeis,  which hos was eimi hostile hypenantios to  us hēmeis.  · kai He  has  taken airō it autos away ek ho · ho by  nailing prosēloō it autos to  the ho cross stauros. "},{"num":15,"verse":"He  stripped apekdyomai the ho principalities archē and kai · ho powers exousia of  their  authority  and  disgraced deigmatizō them  in en public parrēsia by  triumphing thriambeuō over  them autos in en Christ autos. "},{"num":16,"verse":"Therefore oun do krinō not mē let krinō anyone tis judge krinō you hymeis with en respect  to  food brōsis and kai drink posis,  or ē in en regard  to  a  religious meros festival heortē,  a  new neomēnia moon ,  or ē a  Sabbath sabbaton day. "},{"num":17,"verse":"These hos are eimi but a  shadow skia of  what ho was  to  come mellō,  but de the ho reality sōma is found  in ho Christ Christos. "},{"num":18,"verse":"Let katabrabeuō no mēdeis one  rob katabrabeuō you hymeis of your prize,  insisting thelō on en self-abasement tapeinophrosynē and kai the  worship thrēskeia of ho angels angelos, taking his stand  on hos visions horaō,  puffed embateuō up  with  empty eikē notions physioō by hypo · ho his autos earthly sarx way  of  thinking nous.  · ho"},{"num":19,"verse":"· kai That person is  not ou holding krateō fast  to  the ho head kephalē,  from ek whom hos the ho whole pas body sōma,  nourished epichorēgeō and kai held  together symbibazō by dia its ho joints haphē and kai ligaments syndesmos,  grows auxō with  a ho growth auxēsis that is  from ho God theos. "},{"num":20,"verse":"Since ei you  died apothnēskō with syn Christ Christos to apo the ho elemental stoicheion spirits  of  the ho world kosmos,  why tis,  as hōs though  you  were  still  living zaō in en the  world kosmos,  do  you  submit dogmatizō to  regulations  such as, "},{"num":21,"verse":"“ Do  not mē handle haptō!  Do  not mēde taste geuomai!  Do  not mēde touch thinganō!”? "},{"num":22,"verse":"These hos are eimi all pas destined eis to  perish phthora with ho use apochrēsis,  based kata as they are  on  · ho human anthrōpos commands entalma and kai teachings didaskalia.  · ho"},{"num":23,"verse":"Such hostis regulations logos indeed men have echō the appearance  of  wisdom sophia with en their  self-imposed  religious  piety ethelothrēskia,  · kai false  humility tapeinophrosynē,  and kai harsh apheidia control  over  the  body sōma, but they are of  no ou value en timē against pros the  gratification plēsmonē of  the ho flesh sarx. "}]