[{"num":2,"verse":"I want you to know how hard I work for you, those in Laodicea, and others who have never seen me. "},{"num":2,"verse":"I want them to be strengthened and joined together with love so that they may be rich in their understanding. This leads to their knowing fully God’s secret, that is, Christ himself. "},{"num":3,"verse":"In him all the treasures of wisdom and knowledge are safely kept."},{"num":4,"verse":"I say this so that no one can fool you by arguments that seem good, but are false. "},{"num":5,"verse":"Though I am absent from you in my body, my heart is with you, and I am happy to see your good lives and your strong faith in Christ."},{"header":"Continue to Live in Christ"},{"num":6,"verse":"As you received Christ Jesus the Lord, so continue to live in him. "},{"num":7,"verse":"Keep your roots deep in him and have your lives built on him. Be strong in the faith, just as you were taught, and always be thankful."},{"num":8,"verse":"Be sure that no one leads you away with false and empty teaching that is only human, which comes from the ruling spirits of this world, and not from Christ. "},{"num":9,"verse":"All of God lives fully in Christ (even when Christ was on earth), "},{"num":10,"verse":"and you have a full and true life in Christ, who is ruler over all rulers and powers."},{"num":11,"verse":"Also in Christ you had a different kind of circumcision, a circumcision not done by hands. It was through Christ’s circumcision, that is, his death, that you were made free from the power of your sinful self. "},{"num":12,"verse":"When you were baptized, you were buried with Christ, and you were raised up with him through your faith in God’s power that was shown when he raised Christ from the dead. "},{"num":13,"verse":"When you were spiritually dead because of your sins and because you were not free from the power of your sinful self, God made you alive with Christ, and he forgave all our sins. "},{"num":14,"verse":"He canceled the debt, which listed all the rules we failed to follow. He took away that record with its rules and nailed it to the cross. "},{"num":15,"verse":"God stripped the spiritual rulers and powers of their authority. With the cross, he won the victory and showed the world that they were powerless."},{"header":"Don’t Follow People’s Rules"},{"num":16,"verse":"So do not let anyone make rules for you about eating and drinking or about a religious feast, a New Moon Festival, or a Sabbath day. "},{"num":17,"verse":"These things were like a shadow of what was to come. But what is true and real has come and is found in Christ. "},{"num":18,"verse":"Do not let anyone disqualify you by making you humiliate yourself and worship angels. Such people enter into visions, which fill them with foolish pride because of their human way of thinking. "},{"num":19,"verse":"They do not hold tightly to Christ, the head. It is from him that all the parts of the body are cared for and held together. So it grows in the way God wants it to grow."},{"num":20,"verse":"Since you died with Christ and were made free from the ruling spirits of the world, why do you act as if you still belong to this world by following rules like these: "},{"num":21,"verse":"“Don’t handle this,” “Don’t taste that,” “Don’t even touch that thing”? "},{"num":22,"verse":"These rules refer to earthly things that are gone as soon as they are used. They are only human commands and teachings. "},{"num":23,"verse":"They seem to be wise, but they are only part of a human religion. They make people pretend not to be proud and make them punish their bodies, but they do not really control the evil desires of the sinful self."}]