[{"num":2,"verse":"For I want you to know how greatly I strive for you, and for those at La-odice′a, and for all who have not seen my face, "},{"num":2,"verse":"that their hearts may be encouraged as they are knit together in love, to have all the riches of assured understanding and the knowledge of God’s mystery, of Christ, "},{"num":3,"verse":"in whom are hid all the treasures of wisdom and knowledge. "},{"num":4,"verse":"I say this in order that no one may delude you with beguiling speech. "},{"num":5,"verse":"For though I am absent in body, yet I am with you in spirit, rejoicing to see your good order and the firmness of your faith in Christ."},{"header":"Fullness of Life in Christ"},{"num":6,"verse":"As therefore you received Christ Jesus the Lord, so live in him, "},{"num":7,"verse":"rooted and built up in him and established in the faith, just as you were taught, abounding in thanksgiving."},{"num":8,"verse":"See to it that no one makes a prey of you by philosophy and empty deceit, according to human tradition, according to the elemental spirits of the universe, and not according to Christ. "},{"num":9,"verse":"For in him the whole fulness of deity dwells bodily, "},{"num":10,"verse":"and you have come to fulness of life in him, who is the head of all rule and authority. "},{"num":11,"verse":"In him also you were circumcised with a circumcision made without hands, by putting off the body of flesh in the circumcision of Christ; "},{"num":12,"verse":"and you were buried with him in baptism, in which you were also raised with him through faith in the working of God, who raised him from the dead. "},{"num":13,"verse":"And you, who were dead in trespasses and the uncircumcision of your flesh, God made alive together with him, having forgiven us all our trespasses, "},{"num":14,"verse":"having canceled the bond which stood against us with its legal demands; this he set aside, nailing it to the cross. "},{"num":15,"verse":"He disarmed the principalities and powers and made a public example of them, triumphing over them in him."},{"num":16,"verse":"Therefore let no one pass judgment on you in questions of food and drink or with regard to a festival or a new moon or a sabbath. "},{"num":17,"verse":"These are only a shadow of what is to come; but the substance belongs to Christ. "},{"num":18,"verse":"Let no one disqualify you, insisting on self-abasement and worship of angels, taking his stand on visions, puffed up without reason by his sensuous mind, "},{"num":19,"verse":"and not holding fast to the Head, from whom the whole body, nourished and knit together through its joints and ligaments, grows with a growth that is from God."},{"header":"Warnings against False Teachers"},{"num":20,"verse":"If with Christ you died to the elemental spirits of the universe, why do you live as if you still belonged to the world? Why do you submit to regulations, "},{"num":21,"verse":"“Do not handle, Do not taste, Do not touch” "},{"num":22,"verse":"(referring to things which all perish as they are used), according to human precepts and doctrines? "},{"num":23,"verse":"These have indeed an appearance of wisdom in promoting rigor of devotion and self-abasement and severity to the body, but they are of no value in checking the indulgence of the flesh."}]