[{"header":"Paul’s Love for the Colossians"},{"num":2,"verse":"I wish you could know how much I have struggled for you and for the church in Laodicea, and for the many other friends I’ve yet to meet. "},{"num":2,"verse":"I am contending for you that your hearts will be wrapped in the comfort of heaven and woven together into love’s fabric. This will give you access to all the riches of God as you experience the revelation of God’s great mystery—Christ."},{"num":3,"verse":"For our spiritual wealth is in him, like hidden treasure waiting to be discovered—heaven’s wisdom and endless riches of revelation knowledge."},{"num":4,"verse":"I want you to know this so that no one will come and lead you into error through their persuasive arguments and clever words. "},{"num":5,"verse":"Even though I’m separated from you geographically, my spirit is present there with you. And I’m overjoyed to see how disciplined and deeply committed you are because you have such a solid faith in Christ, the Anointed One."},{"header":"New Life in Christ"},{"num":6,"verse":"In the same way you received Jesus our Lord and Messiah by faith, continue your journey of faith, progressing further into your union with him! "},{"num":7,"verse":"Your spiritual roots go deeply into his life as you are continually infused with strength, encouraged in every way. For you are established in the faith you have absorbed and enriched by your devotion to him!"},{"num":8,"verse":"Beware that no one distracts you or intimidates you in their attempt to lead you away from Christ’s fullness by pretending to be full of wisdom when they’re filled with endless arguments of human logic. For they operate with humanistic and clouded judgments based on the mindset of this world system, and not the anointed truths of the Anointed One."},{"num":9,"verse":"For he is the complete fullness of deity living in human form. "},{"num":10,"verse":"And our own completeness is now found in him. We are completely filled with God as Christ’s fullness overflows within us. He is the Head of every kingdom and authority in the universe!"},{"num":11,"verse":"Through our union with him we have experienced circumcision of heart. All of the guilt and power of sin has been cut away and is now extinct because of what Christ, the Anointed One, has accomplished for us."},{"num":12,"verse":"For we’ve been buried with him into his death. Our “baptism into death” also means we were raised with him when we believed in God’s resurrection power, the power that raised him from death’s realm. "},{"num":13,"verse":"This “realm of death” describes our former state, for we were held in sin’s grasp. But now, we’ve been resurrected out of that “realm of death” never to return, for we are forever alive and forgiven of all our sins!"},{"num":14,"verse":"He canceled out every legal violation we had on our record and the old arrest warrant that stood to indict us. He erased it all—our sins, our stained soul—he deleted it all and they cannot be retrieved! Everything we once were in Adam has been placed onto his cross and nailed permanently there as a public display of cancellation."},{"num":15,"verse":"Then Jesus made a public spectacle of all the powers and principalities of darkness, stripping away from them every weapon and all their spiritual authority and power to accuse us. And by the power of the cross, Jesus led them around as prisoners in a procession of triumph. He was not their prisoner; they were his!"},{"header":"Liberty in Christ"},{"num":16,"verse":"So why would you allow anyone to judge you because of what you eat or drink, or insist that you keep the feasts, observe new moon celebrations, or the Sabbath? "},{"num":17,"verse":"All of these were but a prophetic shadow and the evidence of what would be fulfilled, for the body is now Christ!"},{"num":18,"verse":"Don’t let anyone disqualify you from your prize! Don’t let their pretended sincerity fool you as they deliberately lead you into their initiation of angel worship. For they take pleasure in pretending to be experts of something they know nothing about. Their reasoning is meaningless and comes only from their own opinions. "},{"num":19,"verse":"They refuse to take hold of the true source."},{"num":20,"verse":"For you were included in the death of Christ and have died with him to the religious system and powers of this world. Don’t retreat back to being bullied by the standards and opinions of religion—"},{"num":21,"verse":"for example, their strict requirements, “You can’t associate with that person!” or, “Don’t eat that!” or, “You can’t touch that!” "},{"num":22,"verse":"These are the doctrines of men and corrupt customs that are worthless to help you spiritually. "},{"num":23,"verse":"For though they may appear to possess the promise of wisdom in their submission to God through the deprivation of their physical bodies, it is actually nothing more than empty rules rooted in religious rituals!"}]