[{"num":23,"verse":"And David being old and full of days, made Solomon his son king over Israel."},{"num":2,"verse":"And he gathered together all the princes of Israel, and the priests and Levites."},{"num":3,"verse":"And the Levites were numbered from the age of thirty years, and upwards: and there were found of them thirty-eight thousand men."},{"num":4,"verse":"Of these twenty-four thousand were chosen, and distributed unto the ministry of the house of the Lord: and six thousand were the overseers and judges."},{"num":5,"verse":"Moreover four thousand were porters: and as many singers singing to the Lord with the instruments, which he had made to sing with."},{"num":6,"verse":"And David distributed them into courses by the families of the sons of Levi, to wit, of Gerson, and of Caath, and of Merari."},{"num":7,"verse":"The sons of Gerson were Leedan and Semei."},{"num":8,"verse":"The sons of Leedan: the chief Jahiel, and Zethan, and Joel, three."},{"num":9,"verse":"The sons of Semei: Salomith, and Hosiel, and Aran, three: these were the heads of the families of Leedan."},{"num":10,"verse":"And the sons of Semei were Leheth, and Ziza, and Jaus, and Baria: these were the sons of Semei, four."},{"num":11,"verse":"And Leheth was the first, Ziza the second: but Jaus and Baria had not many children, and therefore they were counted in one family, and in one house."},{"num":12,"verse":"The sons of Caath were Amram, and Isaar, Hebron, and Oziel, four."},{"num":13,"verse":"The sons of Amram, Aaron, and Moses. And Aaron was separated to minister in the holy of holies, he and his sons for ever, and to burn incense before the Lord, according to his ceremonies, and to bless his name for ever."},{"num":14,"verse":"The sons also of Moses, the man of God, were numbered in the tribe of Levi."},{"num":15,"verse":"The sons of Moses were Gersom and Eliezer:"},{"num":16,"verse":"The sons of Gersom: Subuel the first."},{"num":17,"verse":"And the sons of Eliezer were: Rohobia the first: and Eliezer had no more sons. But the sons of Rohobia were multiplied exceedingly."},{"num":18,"verse":"The sons of Isaar: Salomith the first."},{"num":19,"verse":"The sons of Hebron: Jeriau the first, Amarias the second, Jahaziel the third, Jecmaam the fourth."},{"num":20,"verse":"The sons of Oziel: Micha the first, Jesia the second."},{"num":21,"verse":"The sons of Merari: Moholi, and Musi. The sons of Moholi: Eleazar and Cia."},{"num":22,"verse":"And Eleazar died, and had no sons but daughters: and the sons of Cis their brethren took them."},{"num":23,"verse":"The sons of Musi: Moholi, and Eder, and Jerimoth, three."},{"num":24,"verse":"These are the sons of Levi in their kindreds and families, princes by their courses, and the number of every head that did the works of the ministry of the house of the Lord from twenty years old and upward."},{"num":25,"verse":"For David said: The Lord the God of Israel hath given rest to his people, and a habitation in Jerusalem for ever."},{"num":26,"verse":"And it shall not be the office of the Levites to carry any more the tabernacle, and all the vessels for the service thereof."},{"num":27,"verse":"So according to the last precepts of David, the sons of Levi are to be numbered from twenty years old and upward."},{"num":28,"verse":"And they are to be under the hand of the sons of Aaron for the service of the house of the Lord, in the porches, and in the chambers, and in the place of purification, and in the sanctuary, and in all the works of the ministry of the temple of the Lord."},{"num":29,"verse":"And the priests have the charge of the leaves of proposition, and of the sacrifice of fine flour, and of the unleavened cakes, and of the fryingpan, and of the roasting, and of every weight and measure."},{"num":30,"verse":"And the Levites are to stand in the morning to give thanks, and to sing praises to the Lord: and in like manner in the evening,"},{"num":31,"verse":"As well in the oblation of the holocausts of the Lord, as in the sabbaths and in the new moons, and the rest of the solemnities, according to the number and ceremonies prescribed for every thing, continually before the Lord."},{"num":32,"verse":"And let them keep the observances of the tabernacle of the covenant, and the ceremonies of the sanctuary, and the charge of the sons of Aaron their brethren, that they may minister in the house of the Lord."}]