[{"header":"The Family Line of Levi"},{"num":23,"verse":"David had become very old. So he made his son Solomon king over Israel."},{"num":2,"verse":"He gathered together all the leaders of Israel. He also gathered the priests and the Levites together. "},{"num":3,"verse":"The Levites who were 30 years old or more were counted. The total number of men was 38,000. "},{"num":4,"verse":"David said, “From them, 24,000 will be in charge of the work of the Lord’s temple. And 6,000 will be officials and judges. "},{"num":5,"verse":"Another 4,000 will guard the gates. And 4,000 will praise the Lord with the instruments of music I’ve provided for that purpose.”"},{"num":6,"verse":"David separated the Levites into groups. He did it according to the sons of Levi. The sons were Gershon, Kohath and Merari."},{"num":24,"verse":"Those were the family lines of Levi. They were recorded under the names of the family leaders. Each worker who was 20 years old or more was counted. They served in the Lord’s temple. "},{"num":25,"verse":"David had said, “The Lord is the God of Israel. He has given peace and rest to his people. He has come to Jerusalem to live there forever. "},{"num":26,"verse":"So the Levites don’t need to carry the holy tent anymore. They don’t need to carry any of its objects anymore. Those were the things that were used to serve there.” "},{"num":27,"verse":"The Levites who were 20 years old or more were counted. That was in keeping with David’s final directions."},{"num":28,"verse":"The Levites had the duty of helping the members of Aaron’s family line. They helped them serve in the Lord’s temple. They were in charge of the courtyards and the side rooms. They made all the sacred things pure and “clean.” They also had other duties at the house of God. "},{"num":29,"verse":"They were in charge of setting the holy bread out on the table. They prepared the special flour for the grain offerings. They made the thin loaves without using any yeast. They did the baking and the mixing. They measured the amount and size of everything. "},{"num":30,"verse":"They stood every morning to thank and praise the Lord. They did the same thing every evening. "},{"num":31,"verse":"They also did it every time burnt offerings were brought to the Lord. Those offerings were brought every Sabbath day. They were also brought at every New Moon feast and during the appointed yearly feasts. The Levites served in front of the Lord at regular times. The proper number of Levites was always used when they served. They served in the way the law required."},{"num":32,"verse":"So the Levites carried out their duties for the tent of meeting and for the Holy Room. They worked under their relatives who were in the family line of Aaron. They helped them serve at the Lord’s temple."}]