[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:4-12 The ark rested upon a mountain, whither it was directed by the wise and gracious providence of God, that might rest the sooner. God has times and places of rest for his people after their tossing; and many times he provides for their seasonable and comfortable settlement, without their own contrivance, and quite beyond their own foresight. God had told Noah when the flood would come, yet he did not give him an account by revelation, at what times and by what steps it should go away. The knowledge of the former was necessary to his preparing the ark; but the knowledge of the latter would serve only to gratify curiosity; and concealing it from him would exercise his faith and patience. Noah sent forth a raven from the ark, which went flying about, and feeding on the carcasses that floated. Noah then sent forth a dove, which returned the first time without good news; but the second time, she brought an olive leaf in her bill, plucked off, plainly showing that trees, fruit trees, began to appear above water. Noah sent forth the dove the second time, seven days after the first, and the third time was after seven days also; probably on the sabbath day. Having kept the sabbath with his little church, he expected especial blessings from Heaven, and inquired concerning them. The dove is an emblem of a gracious soul, that, finding no solid peace of satisfaction in this deluged, defiling world, returns to Christ as to its ark, as to its Noah, its rest. The defiling world, returns to Christ as to its ark, as to its Noah, its rest. The carnal heart, like the raven, takes up with the world, and feeds on the carrion it finds there; but return thou to my rest, O my soul; to thy Noah, so the word is, Ps 116:7. And as Noah put forth his hand, and took the dove, and pulled her to him, into the ark, so Christ will save, and help, and welcome those that flee to him for rest.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The raven and the dove are sent out to bring tidings of the external world. \"Forty days.\" Before Noah made any experiment he seems to have allowed the lapse of forty days to undo the remaining effect of the forty days' rain. \"The window.\" He seems to have been unable to take any definite observations through the aperture here called a window. The raven found carrion in abundance, floated probably on the waters, and did not need to return. This was such a token of the state of things as Noah might expect from such a messenger. He next sends the dove, who returns to him. \"Yet other seven days.\" This intimates that he stayed seven days also after the raven was sent out. The olive leaf plucked off was a sign of returning safety to the land. It is said by Theophrastus (Hist. Plant. 4, 7) and Pliny (H. N. 13, 50) that the olive strikes leaves even under water. From this event, the olive branch became the symbol of peace, and the dove the emblem of the Comforter, the messenger of peace. After seven other days, the dove being despatched, returns no more. The number seven figures very conspicuously in this narrative. Seven days before the showers commence the command to enter the ark is given; and at intervals of seven days the winged messengers are sent out. These intervals point evidently to the period of seven days, determined by the six days of creation and the seventh day of rest. The clean beasts also and the birds are admitted into the ark by seven pairs. This points to the sacredness associated with the number arising from the hallowed character of the seventh day. The number forty also, the product of four, the number of the world or universe, and ten the number of completeness, begins here to be employed for a complete period in which a process will have run its course.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8-11. Also he sent forth a dove—a bird flying low and naturally disposed to return to the place of her abode.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The dove found no rest for the sole of her foot; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because the tops of the hills which then appeared were either muddy and dirty, or unobserved by the dove, as not soaring so high; whence the doves are emphatically called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the doves of the valleys, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Ezekiel 7:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 7:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He took her, and pulled her in; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " her former acquaintance with Noah, and her present necessity, making her more tractable. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But the dove found no rest for the sole of her foot, and she returned unto him into the ark,.... It being a creature that feeds upon seeds it picks off from the ground, and loving cleanness, it could find no place where it could alight, and have food to live upon, and retain its cleanness; for though the tops of the mountains were clear of the waters, yet they might be muddy and filthy with what the waters had raised up in them, or left upon them; and therefore it returned to Noah again, and not only like the raven unto the ark, but into it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the waters were on the face of the whole earth: there was no place dry, and so neither food nor footing for this creature; and which was an emblem of a sensible sinner, who finds no rest in anything short of Christ; not in worldly enjoyments; nor in external duties, not in hearing, reading, praying, fasting, nor in external humiliation and tears; nor in the law, and in the works of it; nor in natural descent, nor in education principles, nor in a profession of religion, and subjection to ordinances; only in Christ, where it finds rest from the burden and guilt of sin, and the tyrannical power of it; from the bondage, curse, and condemnation of the law, and from a sense of divine wrath and fear of it; and though not from afflictions, yet it finds rest in Christ amidst them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then he put forth his hand and took her, and pulled her in unto him into the ark: she hovered about it, and got near the window, which Noah opened and took her in; which may represent the gracious reception sensible souls meet with from Christ, who apply to him; he kindly embraces them, and they find room in his heart and affections, fulness of everything they want, and security from all danger. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "then he put forth his hand and took her, and pulled her in unto him into the ark: she hovered about it, and got near the window, which Noah opened and took her in; which may represent the gracious reception sensible souls meet with from Christ, who apply to him; he kindly embraces them, and they find room in his heart and affections, fulness of everything they want, and security from all danger. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But the dove found no rest for the sole of her foot, and she returned unto him into the ark, for the waters were on the face of the whole earth: then he {e} put forth his hand, and took her, and pulled her in unto him into the ark.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But the dove found no rest for the sole of her foot, and she returned unto him into the ark, for the waters ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " on the face of the whole earth: then he ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " put forth his hand, and took her, and pulled her in unto him into the ark.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) The raven flew to and fro, resting on the ark, but did not come into it, unlike the dove that was taken in.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Compare the Babylonian description, “the dove went to and fro; as there was no resting-place, it turned back.” Clearly the account in these verses implies that only water was visible: it represents an earlier stage than that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 8:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 8:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (P).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "put forth his hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The description is one of great beauty and simplicity. The dove trusted Noah: the ark was its only home. The dove was only for a short time absent from the ark.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Forty days after the appearance of the mountain tops, Noah opened the window of the ark and let a raven fly out (lit., the raven, i.e., the particular raven known from that circumstance), for the purpose of ascertaining the drying up of the waters. The raven went out and returned until the earth was dry, but without being taken back into the ark, as the mountain tops and the carcases floating upon the water afforded both resting-places and food. After that, Noah let a dove fly out three times, at intervals of seven days. It is not distinctly stated that he sent it out the first time seven days after the raven, but this is implied in the statement that he stayed yet other seven days before sending it out the second time, and the same again before sending it the third time (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The dove, when first sent out, \"found no rest for the sole of its foot;\" for a dove will only settle upon such places and objects as are dry and clean. It returned to the ark and let Noah take it in again (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The second time it returned in the evening, having remained out longer than before, and brought a fresh (טרף freshly plucked) olive-leaf in its mouth. Noah perceived from this that the water must be almost gone, had \"abated from off the earth,\" though the ground might not be perfectly dry, as the olive-tree will put out leaves even under water. The fresh olive-leaf was the first sign of the resurrection of the earth to new life after the flood, and the dove with the olive-leaf a herald of salvation. The third time it did not return; a sign that the waters had completely receded from the earth. The fact that Noah waited 40 days before sending the raven, and after that always left an interval of seven days, is not to be accounted for on the supposition that these numbers were already regarded as significant. The 40 days correspond to the 40 days during which the rain fell and the waters rose; and Noah might assume that they would require the same time to recede as to rise. The seven days constituted the week established at the creation, and God had already conformed to it in arranging their entrance into the ark (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The selection which Noah made of the birds may also be explained quite simply from the difference in their nature, with which Noah must have been acquainted; that is to say, from the fact that the raven in seeking its food settles upon every carcase that it sees, whereas the dove will only settle upon what is dry and clean. ",
        "children": []
      }
    ]
  }
]