[{"num":10,"verse":"And Nadav and Avihu, the bnei Aharon, each took his censer, and put eish therein, and put ketoret (incense) thereon, and offered eish zarah (strange, unauthorized fire) before Hashem, which He commanded them not."},{"num":2,"verse":"And there went out eish (fire) from the presence of Hashem, and devoured them, and they died before Hashem."},{"num":3,"verse":"Then Moshe said unto Aharon, This is it that Hashem spoke, saying, I will show Myself kadosh among them that come near Me, and before kol HaAm (all the People) I will be honored. And Aharon was silent."},{"num":4,"verse":"And Moshe called Mishael and Eltzaphan, the bnei Uzziel the dod (uncle) of Aharon, and said unto them, Come near, carry your brethren from before the Kodesh to the outside of the machaneh."},{"num":5,"verse":"So they went near, and carried them in the kuttanot of them out of the machaneh; as Moshe had said."},{"num":6,"verse":"And Moshe said unto Aharon, and unto Eleazar and unto Itamar, his banim, Don’t uncover your head, neither rend your clothes; lest ye die, and lest wrath come upon kol HaEdah; but let your brethren, the kol Bais Yisroel, bewail the burning which Hashem hath kindled."},{"num":7,"verse":"And ye shall not go out from the entrance of the Ohel Mo’ed, lest ye die; for the shemen mishchat (anointing oil) of Hashem is upon you. And they did according to the word of Moshe."},{"num":8,"verse":"And Hashem spoke unto Aharon, saying,"},{"num":9,"verse":"Do not drink yayin nor strong drink, thou, nor thy banim with thee, when ye go into the Ohel Mo’ed, lest ye die; it shall be chukkat olam throughout your generations;"},{"num":10,"verse":"And that ye may put difference between kodesh and chol (common, profane), and between tameh (unclean) and tahor (clean);"},{"num":11,"verse":"And that ye may teach the Bnei Yisroel all the chukkim which Hashem hath spoken unto them by the hand of Moshe."},{"num":12,"verse":"And Moshe spoke unto Aharon, and unto Eleazar and unto Itamar, his banim that were left, Take the minchah that remaineth of the offerings of Hashem made by eish, and eat it without leaven (i.e., matzot) beside the Mizbe’ach; for it is kodesh kodashim;"},{"num":13,"verse":"And ye shall eat it in the makom kadosh, because it is the chok (share, portion) of thee and thy banim, of the sacrifices of Hashem made by eish; for so I am commanded."},{"num":14,"verse":"And the breast of the waving and raised up thigh shall ye eat in a makom tahor; thou, and thy banim, and thy banot with thee; for they are thy chok, and the chok of thy banim, which are given out of the zevakhim of shelamim (peace offerings) of the Bnei Yisroel."},{"num":15,"verse":"The raised-up thigh and the breast of the waving shall they bring with the offerings made by eish of the chelavim (fat portions), to wave it for a wave offering before Hashem; and it shall be thine, and unto thy banim with thee, by a chok olam (portion forever); as Hashem hath commanded."},{"num":16,"verse":"And Moshe diligently inquired about the sa’ir of the chattat, and, hinei, it was burned up; and he was angry with Eleazar and Itamar, the bnei Aharon which were left alive, saying,"},{"num":17,"verse":"Why have ye not eaten the chattat in the makom hakodesh, seeing it is kodesh kodashim, and G-d hath given it you to bear away the avon HaEdah, to make kapporah for them before Hashem?"},{"num":18,"verse":"Since the dahm of it was not brought in within HaKodesh, ye should indeed have eaten it in the Kodesh, as I commanded."},{"num":19,"verse":"And Aharon said unto Moshe, See, today have they offered their chattat (sin offering) and their olah (burnt offering) before Hashem; and such things have befallen me; and if I had eaten the chattat today, should it have been accepted in the sight of Hashem?"},{"num":20,"verse":"And when Moshe heard that, he was satisfied."}]