[[],[{"type":"header","content":"Jeremiah Appeals to God"},{"type":"poetry","content":"whenever I have complained to you."},{"type":"poetry","content":"However, I would like to speak with you about the disposition of justice."},{"type":"poetry","content":"Why are wicked people successful?"},{"type":"poetry","content":"Why do all dishonest people have such easy lives?"}],[{"type":"poetry","content":"You plant them like trees and they put down their roots."},{"type":"poetry","content":"They grow prosperous and are very fruitful."},{"type":"poetry","content":"They always talk about you,"},{"type":"poetry","content":"but they really care nothing about you."}],[{"type":"poetry","content":"But you, , know all about me."},{"type":"poetry","content":"You watch me and test my devotion to you."},{"type":"poetry","content":"Drag these wicked men away like sheep to be slaughtered!"},{"type":"poetry","content":"Appoint a time when they will be killed!"}],[{"type":"poetry","content":"How long must the land be parched"},{"type":"poetry","content":"and the grass in every field be withered?"},{"type":"poetry","content":"How long must the animals and the birds die"},{"type":"poetry","content":"because of the wickedness of the people who live in this land?"},{"type":"poetry","content":"For these people boast,"},{"type":"poetry","content":"“God will not see what happens to us.”"}],[{"type":"header","content":"God Answers Jeremiah"},{"type":"prose","content":"The LORD answered,"}],[{"type":"prose","content":"“I, the LORD, also have something to say concerning the wicked nations who surround my land and have attacked and plundered the land that I gave to my people as a permanent possession. I say: ‘I will uproot the people of those nations from their land and I will free the people of Judah who have been taken there. "}],[{"type":"prose","content":"But after I have uprooted the people of those nations, I will relent and have pity on them. I will restore the people of each of those nations to their own lands and to their own country. "}],[{"type":"prose","content":"But they must make sure to learn to follow the religious practices of my people. Once they taught my people to swear their oaths using the name of the god Baal. But then, they must swear oaths using my name, saying, “As surely as the LORD lives, I swear.” If they do these things, then they will be included among the people I call my own. "}],[{"type":"prose","content":"But I will completely uproot and destroy any of those nations that will not pay heed,’” says the LORD."}]]