[{"header":"Jesus Heals a Lame Man"},{"num":5,"verse":"Afterward Jesus returned to Jerusalem for one of the Jewish holy days."},{"num":2,"verse":"Inside the city, near the Sheep Gate, was the pool of Bethesda, with five covered porches."},{"num":3,"verse":"Crowds of sick people—blind, lame, or paralyzed—lay on the porches."},{"num":5,"verse":"One of the men lying there had been sick for thirty-eight years."},{"num":6,"verse":"When Jesus saw him and knew he had been ill for a long time, he asked him, “Would you like to get well?”"},{"num":7,"verse":"“I can’t, sir,” the sick man said, “for I have no one to put me into the pool when the water bubbles up. Someone else always gets there ahead of me.”"},{"num":8,"verse":"Jesus told him, “Stand up, pick up your mat, and walk!”"},{"num":9,"verse":"Instantly, the man was healed! He rolled up his sleeping mat and began walking! But this miracle happened on the Sabbath,"},{"num":10,"verse":"so the Jewish leaders objected. They said to the man who was cured, “You can’t work on the Sabbath! The law doesn’t allow you to carry that sleeping mat!”"},{"num":11,"verse":"But he replied, “The man who healed me told me, ‘Pick up your mat and walk.’”"},{"num":12,"verse":"“Who said such a thing as that?” they demanded."},{"num":13,"verse":"The man didn’t know, for Jesus had disappeared into the crowd."},{"num":14,"verse":"But afterward Jesus found him in the Temple and told him, “Now you are well; so stop sinning, or something even worse may happen to you.”"},{"num":15,"verse":"Then the man went and told the Jewish leaders that it was Jesus who had healed him."},{"header":"Jesus Claims to Be the Son of God"},{"num":16,"verse":"So the Jewish leaders began harassing Jesus for breaking the Sabbath rules."},{"num":17,"verse":"But Jesus replied, “My Father is always working, and so am I.”"},{"num":18,"verse":"So the Jewish leaders tried all the harder to find a way to kill him. For he not only broke the Sabbath, he called God his Father, thereby making himself equal with God."},{"num":19,"verse":"So Jesus explained, “I tell you the truth, the Son can do nothing by himself. He does only what he sees the Father doing. Whatever the Father does, the Son also does."},{"num":20,"verse":"For the Father loves the Son and shows him everything he is doing. In fact, the Father will show him how to do even greater works than healing this man. Then you will truly be astonished."},{"num":21,"verse":"For just as the Father gives life to those he raises from the dead, so the Son gives life to anyone he wants."},{"num":22,"verse":"In addition, the Father judges no one. Instead, he has given the Son absolute authority to judge,"},{"num":23,"verse":"so that everyone will honor the Son, just as they honor the Father. Anyone who does not honor the Son is certainly not honoring the Father who sent him."},{"num":24,"verse":"“I tell you the truth, those who listen to my message and believe in God who sent me have eternal life. They will never be condemned for their sins, but they have already passed from death into life."},{"num":25,"verse":"“And I assure you that the time is coming, indeed it’s here now, when the dead will hear my voice—the voice of the Son of God. And those who listen will live."},{"num":26,"verse":"The Father has life in himself, and he has granted that same life-giving power to his Son."},{"num":27,"verse":"And he has given him authority to judge everyone because he is the Son of Man."},{"num":28,"verse":"Don’t be so surprised! Indeed, the time is coming when all the dead in their graves will hear the voice of God’s Son,"},{"num":29,"verse":"and they will rise again. Those who have done good will rise to experience eternal life, and those who have continued in evil will rise to experience judgment."},{"num":30,"verse":"I can do nothing on my own. I judge as God tells me. Therefore, my judgment is just, because I carry out the will of the one who sent me, not my own will."},{"header":"Witnesses to Jesus"},{"num":31,"verse":"“If I were to testify on my own behalf, my testimony would not be valid."},{"num":32,"verse":"But someone else is also testifying about me, and I assure you that everything he says about me is true."},{"num":33,"verse":"In fact, you sent investigators to listen to John the Baptist, and his testimony about me was true."},{"num":34,"verse":"Of course, I have no need of human witnesses, but I say these things so you might be saved."},{"num":35,"verse":"John was like a burning and shining lamp, and you were excited for a while about his message."},{"num":36,"verse":"But I have a greater witness than John—my teachings and my miracles. The Father gave me these works to accomplish, and they prove that he sent me."},{"num":37,"verse":"And the Father who sent me has testified about me himself. You have never heard his voice or seen him face to face,"},{"num":38,"verse":"and you do not have his message in your hearts, because you do not believe me—the one he sent to you."},{"num":39,"verse":"“You search the Scriptures because you think they give you eternal life. But the Scriptures point to me!"},{"num":40,"verse":"Yet you refuse to come to me to receive this life."},{"num":41,"verse":"“Your approval means nothing to me,"},{"num":42,"verse":"because I know you don’t have God’s love within you."},{"num":43,"verse":"For I have come to you in my Father’s name, and you have rejected me. Yet if others come in their own name, you gladly welcome them."},{"num":44,"verse":"No wonder you can’t believe! For you gladly honor each other, but you don’t care about the honor that comes from the one who alone is God."},{"num":45,"verse":"“Yet it isn’t I who will accuse you before the Father. Moses will accuse you! Yes, Moses, in whom you put your hopes."},{"num":46,"verse":"If you really believed Moses, you would believe me, because he wrote about me."},{"num":47,"verse":"But since you don’t believe what he wrote, how will you believe what I say?”"}]