[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Go, call thy husband.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—She has asked for this living water. She knows not that the well must first be dug. In the depth of her spirit there is a power of life; but like the source of a spring, it is hidden. Many a hard rock of impenitence was there, and many a layer of every-day transgression, and many a habit once formable as clay, now hard as adamant, and many a deposit of carnal thought which had left nothing but its dregs behind. All this must be dug through before she can have the living water, and this well, too, must be deep. The command, “Go, call thy husband,” is the first stroke breaking up the surface of that fair appearance, and revealing the foulness of the life beneath it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "John 4:16-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:16-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus saith, Go call thy husband — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "What Christ had said to her concerning his grace and eternal life, he found had made little impression upon her, because she had not been convinced of sin; therefore, waiving the discourse about the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "living water, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "he sets himself to awaken her conscience, and proceeds to open the wounds of her depravity and guilt, that she might better understand, and more readily receive, the remedy provided by grace. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The woman ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Conscious of the sinfulness of the way in which she had lived, but desirous to evade conviction, and thinking to conceal her shame; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "said, I have no husband ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— She wished to be thought a maid or a widow; whereas, though she had no husband, she was neither. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus said, Thou hast well said ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, thou hast spoken the truth, in saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have no husband; for, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I well know, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou hast had five husbands",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Doubtless it was not her affliction, the burying of so many husbands, but her sin, that Christ intended to upbraid her with. Either she had forsaken some of her husbands and married others, or by her undutiful, unchaste, or otherwise improper conduct, had provoked them to divorce her; or by indirect means, and contrary to the law, she had divorced them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He whom thou now hast is not thy husband ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Either she was never married to him at all; or, which is more probable, one or more of her former husbands were living, so that, in fact, she lived in adultery.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:4-26 There was great hatred between the Samaritans and the Jews. Christ's road from Judea to Galilee lay through Samaria. We should not go into places of temptation but when we needs must; and then must not dwell in them, but hasten through them. We have here our Lord Jesus under the common fatigue of travellers. Thus we see that he was truly a man. Toil came in with sin; therefore Christ, having made himself a curse for us, submitted to it. Also, he was a poor man, and went all his journeys on foot. Being wearied, he sat thus on the well; he had no couch to rest upon. He sat thus, as people wearied with travelling sit. Surely, we ought readily to submit to be like the Son of God in such things as these. Christ asked a woman for water. She was surprised because he did not show the anger of his own nation against the Samaritans. Moderate men of all sides are men wondered at. Christ took the occasion to teach her Divine things: he converted this woman, by showing her ignorance and sinfulness, and her need of a Saviour. By this living water is meant the Spirit. Under this comparison the blessing of the Messiah had been promised in the Old Testament. The graces of the Spirit, and his comforts, satisfy the thirsting soul, that knows its own nature and necessity. What Jesus spake figuratively, she took literally. Christ shows that the water of Jacob's well yielded a very short satisfaction. Of whatever waters of comfort we drink, we shall thirst again. But whoever partakes of the Spirit of grace, and the comforts of the gospel, shall never want that which will abundantly satisfy his soul. Carnal hearts look no higher than carnal ends. Give it me, saith she, not that I may have everlasting life, which Christ proposed, but that I come not hither to draw. The carnal mind is very ingenious in shifting off convictions, and keeping them from fastening. But how closely our Lord Jesus brings home the conviction to her conscience! He severely reproved her present state of life. The woman acknowledged Christ to be a prophet. The power of his word in searching the heart, and convincing the conscience of secret things, is a proof of Divine authority. It should cool our contests, to think that the things we are striving about are passing away. The object of worship will continue still the same, God, as a Father; but an end shall be put to all differences about the place of worship. Reason teaches us to consult decency and convenience in the places of our worship; but religion gives no preference to one place above another, in respect of holiness and approval with God. The Jews were certainly in the right. Those who by the Scriptures have obtained some knowledge of God, know whom they worship. The word of salvation was of the Jews. It came to other nations through them. Christ justly preferred the Jewish worship before the Samaritan, yet here he speaks of the former as soon to be done away. God was about to be revealed as the Father of all believers in every nation. The spirit or the soul of man, as influenced by the Holy Spirit, must worship God, and have communion with him. Spiritual affections, as shown in fervent prayers, supplications, and thanksgivings, form the worship of an upright heart, in which God delights and is glorified. The woman was disposed to leave the matter undecided, till the coming of the Messiah. But Christ told her, I that speak to thee, am He. She was an alien and a hostile Samaritan, merely speaking to her was thought to disgrace our Lord Jesus. Yet to this woman did our Lord reveal himself more fully than as yet he had done to any of his disciples. No past sins can bar our acceptance with him, if we humble ourselves before him, believing in him as the Christ, the Saviour of the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Go call thy husband - We may admire the manner which our Saviour took to lead her to perceive that he was the Christ. His instructions she did not understand. He therefore proceeded to show her that he was acquainted with her life and with her sins. His object, here, was to lead her to consider her own state and sinfulness - a delicate and yet pungent way of making her see that she was a sinner. By showing her, also, that he knew her life, though a stranger to her, he convinced her that he was qualified to teach her the way to heaven, and thus prepared her to admit that he was the Messiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. call thy husband—now proceeding to arouse her slumbering conscience by laying bare the guilty life she was leading, and by the minute details which that life furnished, not only bringing her sin vividly up before her, but preparing her to receive in His true character that wonderful Stranger to whom her whole life, in its minutest particulars, evidently lay open.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Not that Christ did not know, what she afterward confessed, that she lived in whoredom, and had no legitimate husband; but he said this probably to check her petulancy, and mocking at what he spake about the living water, and to bring her to a sense of her sin, that she might be more fit to receive the glad tidings of a Saviour, which he was about to publish to her; and this seems rather to be our Saviour’s design in bidding her go call her husband, than (as some of the ancients thought) that he might better instruct her, or avoid any scandal to himself, by a longer private discourse with a woman alone, who was of no better reputation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jesus saith unto her,.... Observing that she continued an ignorant scoffer at him, and his words, determined to take another method with her; and convince her, that he was not a common and ordinary person she was conversing with, as she took him to be; and also what a sinner she was, and what a vicious course of life she had lived; so that she might see that she stood in need of him, as the gift of God, and Saviour of men; and of the grace he had been speaking of, under the notion of living water: saying to her, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "go, call thy husband, and come hither; go directly from hence to the city of Sychar, and call thy husband, and come back hither along with him again: this Christ said, not to have him come to teach and instruct him, and as if he would more readily and easily understand him, and that he might be with her, a partaker of the same grace; but to bring on some further conversation, by which she would understand that he knew her state and condition, and what a course of life she now lived, and so bring her under a conviction of her sin and danger, and need of him and his grace. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "go, call thy husband, and come hither; go directly from hence to the city of Sychar, and call thy husband, and come back hither along with him again: this Christ said, not to have him come to teach and instruct him, and as if he would more readily and easily understand him, and that he might be with her, a partaker of the same grace; but to bring on some further conversation, by which she would understand that he knew her state and condition, and what a course of life she now lived, and so bring her under a conviction of her sin and danger, and need of him and his grace. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Jesus saith unto her, Go, call thy husband, and come hither.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To this request Jesus replies “",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γπαγε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φώνησον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐνθάδε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His purpose in this has been much debated. Calvin thinks He meant to rebuke her scurrility in mockingly asking for the water. This does not show Calvin’s usual penetration. Westcott says that in the woman’s request “she confessed by implication that even the greatest gift was not complete unless it was shared by those to whom she was bound. If they thirsted, though she might not thirst, her toilsome labour must be continued still.” Jesus, reading this thought, bids her bring the man for whom she draws water. The gift is for him also. But this meaning is too obscure. Meyer thinks the request was not seriously intended: but this detracts from the simplicity of Christ. The natural interpretation is that in response to her request Jesus gives her now the first draught of the living water by causing her to face her guilty life and bring it to Him. He cannot give the water before thirst for it is awakened. The sure method of awaking the thirst is to make her acknowledge herself a sinful woman (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Alford).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Go, call thy husband",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Not that the man was wanted, either as a concession to Jewish propriety, which forbad a Rabbi to talk with a woman alone, or for any other reason. By a seemingly casual request Christ lays hold of her inner life, convinces her of sin, and leads her to repentance, without which her request, ‘Give me this water,’ could not be granted. The husband who was no husband was the plague-spot where her healing must begin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Λέγει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He saith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Now He makes an avenue for giving to the woman, who begs for water, a better kind of it, than that which she had begged for.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄνδρα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "husband",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The woman seems to have supposed, that the reason why she is desired to call her husband is, in order that he may help her in taking up and carrying home the water, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", promised [by Jesus], ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But Jesus by this address throws open the inmost conscience of the woman, and causes repentance, and elicits confession, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".[83] Nor does He say that “Go, call thy husband,” altogether abruptly; but those words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and that I come not hither",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the words here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Come hither",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", correspond to one another. In that place, which the woman thinks to avoid hereafter, there is given to her the living water.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[83] “Come see a man which told me all things that over I did.” A ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "confession",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of her guilt, and a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "profession",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of her belief in Christ—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 16-20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(c)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The heart-searching issuing in perception of the prophetic rank of Jesus.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - [",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "saith unto her, fie, call thy husband, and come hither.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Our Lord, by that Divine penetration and thought reading which the evangelist attributes to him (ch. 2), knew exactly what manner of woman this was, and wished to bring her secret sins to the light of her own conscience. The demand touched her heart at its most tender place, and was indeed a partial answer to her prayer, \"Give me this water.\" Conviction of sin is the beginning of the great work of the Paraclete; it will end in full assurance of faith (so Neander, Stier, Tholuck, Luthardt, Weiss, and Edersheim). Numerous have been the explanations of the Saviour's demand, but none of them so congruous as this: ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Lucke supposes that Christ would have the husband share in the bounty. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Meyer suggests that the Lord, by proving to her his prophetic glance in a region she could verify, was preparing her for similar confidence in himself in a higher and more momentous region. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hengstenberg makes it part of his curious, mystical interpretation of the entire narrative, and by \"husband\" thinks that Jesus meant the true Lord and Husband of the kingdom of God, in contrast to the heathen lordships and polluting idolatries which Samaritans had blended with their Jehovism (of which more in the next verse). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Lange has supposed that Jesus here conforms to law and custom with reference to the superior claim of the husband, and declares that the wife must submit to it in receiving the gift of the kingdom of God; and Godet says, \"Jesus did not wish to influence a dependent person without the participation of the man with whom she was united.\" Jesus surely never waits upon conventionalisms, sabbatic rules, current fashions of any kind; and some deeper reason than this is more than apparent from the startling response. John 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Husband (ἄνδρα)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on John 1:30. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]