[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God is a Spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " His will has been expressed in the seeking. But His very nature and essence is spirit, and it follows from this that all true worship must be spiritual. The appeal is here made to a doctrine of special prominence in the Samaritan theology. They had altered a number of passages in the Pentateuch, which seemed to them to speak of God in language properly applicable to man, and to ascribe to Him human form and feelings. But to believe in the spiritual essence of God contained its own answer both as to place and mode of worship.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The second “Him” (“they that worship Him”) should be omitted, as the italics show.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "John 4:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is a Spirit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “As a further answer to the woman’s question, our Lord delivered a doctrine which may justly be called his own, as it exhibits an idea of God, and of the worship which is due to him, far more sublime than the best things said by the philosophers on that subject.” Christ came to declare God to us, and this he has declared concerning him, that he is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a Spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and he declared it to this poor Samaritan woman, for the meanest are concerned to know God; and with this design, to rectify her mistakes concerning religious worship, to which nothing could contribute more than the right knowledge of God. 1st, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is a Spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for he is an infinite and eternal mind; an intelligent being, yea, the supreme Intelligence, who by one act sees the thoughts of all other intelligences whatever, and so may be worshipped in every place; he is incorporeal, immaterial, invisible, and incorruptible: for it is easier to say what he is not than what he is. If God were not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a Spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "he could not be perfect, nor infinite, nor eternal, nor independent, nor the Father of spirits. Now, 2d, on this spirituality of the divine nature is founded the necessity of the spirituality of divine worship; for the worship of God must partake of his nature: as his nature is spiritual, his worship, to be acceptable, must be so likewise. If we do not worship God, who is a Spirit, in spirit, we neither give him the glory due to his name, and so do not perform a real and proper act of worship, nor can we hope to attain his favour, and acceptance with him, and so we miss the end of worship. The exercise of faith and love, therefore, and of other graces, must constitute the true spiritual worship which we owe to the God and Father of our Lord Jesus Christ, and which cannot but be acceptable to him, wherever it is offered, in whatever place, and by whatever person.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:4-26 There was great hatred between the Samaritans and the Jews. Christ's road from Judea to Galilee lay through Samaria. We should not go into places of temptation but when we needs must; and then must not dwell in them, but hasten through them. We have here our Lord Jesus under the common fatigue of travellers. Thus we see that he was truly a man. Toil came in with sin; therefore Christ, having made himself a curse for us, submitted to it. Also, he was a poor man, and went all his journeys on foot. Being wearied, he sat thus on the well; he had no couch to rest upon. He sat thus, as people wearied with travelling sit. Surely, we ought readily to submit to be like the Son of God in such things as these. Christ asked a woman for water. She was surprised because he did not show the anger of his own nation against the Samaritans. Moderate men of all sides are men wondered at. Christ took the occasion to teach her Divine things: he converted this woman, by showing her ignorance and sinfulness, and her need of a Saviour. By this living water is meant the Spirit. Under this comparison the blessing of the Messiah had been promised in the Old Testament. The graces of the Spirit, and his comforts, satisfy the thirsting soul, that knows its own nature and necessity. What Jesus spake figuratively, she took literally. Christ shows that the water of Jacob's well yielded a very short satisfaction. Of whatever waters of comfort we drink, we shall thirst again. But whoever partakes of the Spirit of grace, and the comforts of the gospel, shall never want that which will abundantly satisfy his soul. Carnal hearts look no higher than carnal ends. Give it me, saith she, not that I may have everlasting life, which Christ proposed, but that I come not hither to draw. The carnal mind is very ingenious in shifting off convictions, and keeping them from fastening. But how closely our Lord Jesus brings home the conviction to her conscience! He severely reproved her present state of life. The woman acknowledged Christ to be a prophet. The power of his word in searching the heart, and convincing the conscience of secret things, is a proof of Divine authority. It should cool our contests, to think that the things we are striving about are passing away. The object of worship will continue still the same, God, as a Father; but an end shall be put to all differences about the place of worship. Reason teaches us to consult decency and convenience in the places of our worship; but religion gives no preference to one place above another, in respect of holiness and approval with God. The Jews were certainly in the right. Those who by the Scriptures have obtained some knowledge of God, know whom they worship. The word of salvation was of the Jews. It came to other nations through them. Christ justly preferred the Jewish worship before the Samaritan, yet here he speaks of the former as soon to be done away. God was about to be revealed as the Father of all believers in every nation. The spirit or the soul of man, as influenced by the Holy Spirit, must worship God, and have communion with him. Spiritual affections, as shown in fervent prayers, supplications, and thanksgivings, form the worship of an upright heart, in which God delights and is glorified. The woman was disposed to leave the matter undecided, till the coming of the Messiah. But Christ told her, I that speak to thee, am He. She was an alien and a hostile Samaritan, merely speaking to her was thought to disgrace our Lord Jesus. Yet to this woman did our Lord reveal himself more fully than as yet he had done to any of his disciples. No past sins can bar our acceptance with him, if we humble ourselves before him, believing in him as the Christ, the Saviour of the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "God is A spirit - This is the second reason why men should worship him in spirit and in truth. By this is meant that God is without a body; that he is not material or composed of parts; that he is invisible, in every place, pure and holy. This is one of the first truths of religion, and one of the sublimest ever presented to the mind of man. Almost all nations have had some idea of God as gross or material, but the Bible declares that he is a pure spirit. As he is such a spirit, he dwells not in temples made with hands ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", neither is worshipped with men's hands as though he needed anything, seeing he giveth to all life, and breath, and all things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A pure, a holy, a spiritual worship, therefore, is such as he seeks - the offering of the soul rather than the formal offering of the body - the homage of the heart rather than that of the lips. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. hour cometh, and now is—evidently meaning her to understand that this new economy was in some sense being set up while He was talking to her, a sense which would in a few minutes so far appear, when He told her plainly He was the Christ.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " God is not a corporeal being, made up of blood, and flesh, and bones, having senses as bodies have, to be pleased with sensible things; but he is a spiritual Being, the Father of spirits, and requireth a spiritual service proportioned to his being; and therefore those that pay a religious homage to him, must do it with their spirits, and according to the rule that he hath prescribed, in truth and reality. This is now the will of God; and though he required of his people under the law a more ritual, figurative service, yet that is now to cease; and therefore the woman of Samaria need not trouble herself which was the truest worship, that at Mount Gerizim, or at Mount Zion, for both of them were very suddenly to determine, and a new and more substantial spiritual worship was to succeed, to the learning of the way and method of which she was more to attend, and not to spend her thoughts about these things which were of no significance, and tended only to minister questions of no use. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "God is a spirit,.... Or \"the Spirit is God\"; a divine person, possessed of all divine perfections, as appears from his names, works, and worship ascribed unto him; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; though the Arabic and Persic versions, and others, read as we do, \"God is a spirit\"; that is, God, Father, Son, and Holy Ghost: for taking the words in this light, not one of the persons is to be understood exclusive of the other; for this description, or definition, agrees with each of them, and they are all the object of worship, and to be worshipped in a true and spiritual manner. God is a spirit, and not a body, or a corporeal substance: the nature and essence of God is like a spirit, simple and uncompounded, not made up of parts; nor is it divisible; nor does it admit of any change and alteration. God, as a spirit, is immaterial, immortal, invisible, and an intelligent, willing, and active being; but differs from other spirits, in that he is not created, but an immense and infinite spirit, and an eternal one, which has neither beginning nor end: he is therefore a spirit by way of eminency, as well as effectively, he being the author and former of all spirits: whatever excellence is in them, must be ascribed to God in the highest manner; and whatever is imperfect in them, must be removed from him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they that worship him; worship is due to him on account of his nature and perfections, both internal and external; with both the bodies and souls of men; and both private and public; in the closet, in the family, and in the church of God; as prayer, praise, attendance on the word and ordinances: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "must worship him in spirit and in truth; in the true and spiritual manner before described, which is suitable to his nature, and agreeably to his will. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "must worship him in spirit and in truth; in the true and spiritual manner before described, which is suitable to his nature, and agreeably to his will. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "God is a {h} Spirit: and they that worship him must worship him in spirit and in truth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Spirit: and they that worship him must worship ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "him",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in spirit and in truth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) By the word spirit he means the nature of the Godhead, and not the third person in the Trinity.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reason of all this is found in the determining statement ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πνεῦμα ὁ θεός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", God is Spirit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God is Light; God is Love. The predication involves much; that God is personal, and much else. But primarily it here indicates that God is not corporeal, and therefore needs no temple. Rarely is the fundamental fact of God’s spirituality carried to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " its conclusions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jam 1:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God is spirit, and must be approached in that part of us which is spirit, in the true temple of God, ‘which temple ye are.’ Even to the chosen three Christ imparts no truths more profound than these. He admits this poor schismatic to the very fountain-head of religion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Πνεῦμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a Spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") When God is called a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", we must not merely think of a Being separate from body and place, but also one having spiritual qualities, truth, wisdom, holiness, power, etc. To this nature of God ought to correspond our worship: and to the living God living gifts ought to be offered: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “How much more shall the blood of Christ, etc., purge your conscience from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dead",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " works to serve the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "living",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God?” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “I beseech you, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service.” He holds a profound and striking conversation with an ordinary woman, whom He had scarcely seen. He did not commit to His disciples more lofty truths.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - A still more explicit and  comprehensive reason is given for the previous assertion, based on the essential nature of God himself in the fulness of his eternal Being. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "God is Spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Πνεῦμα ὁ Θεός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Θεὸς η΅ν ὁ Λόγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - the article indicates the subject, and the predicate is here generic, and not an indefinite; therefore we do not render it, \"God is a Spirit\"). The most comprehensive and far-reaching metaphor or method by which Jesus endeavoured to portray the fundamental essence of the Divine Being is \"Spirit,\" not body, not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὕλη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κόσμος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but that deep inner verity presented in self-conscious ego; the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "substantia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of which mind may be predicated, and all its states and faculties. The Father ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Spirit, the Son is Spirit, and Spirit is the unity of the Father and the Son. St. John has recorded elsewhere that \"God is Light,\" and \"God is Love.\" These three Divine utterances are the sublimest ever formed to express the metaphysical, intellectual, and moral essence of the Deity. They are unfathomably deep, and quite inexhaustible in their suggestions, and yet they are not too profound for even a little child or a poor Samaritaness to grasp for practical purposes. If God be Spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "then they who worship him,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "must",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the nature of the case, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "must",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the force of a Divine arrangement, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "worship him,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " if they worship him at all, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in spirit and in truth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The truth which our Lord uttered was not unknown in the Old Testament. From Genesis to Malachi, in the Psalms, in the historical books, in Judges, Samuel, and Kings, the Spirit and the spirituality of God are presupposed; but the Lord has generalized these teachings, cited them from darkness and neglect, combined them in one eternal oracle of Divine truth. The Galilaean Peasant has thus uttered the profoundest truth of ethic and religion - one which no sage in East or West had ever surpassed, and towards which the highest minds in all the ages of Christendom have been slowly making approach. Forms, postures, ceremonial, sacraments, liturgies, holy days, and places are not condemned, but they all are inefficacious if this prime condition be not present, and they can all be dispensed with if it be. Only the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of man can really touch or commune with the Spirit of spirits, and the history of the new dispensation is the history of a progress from forms to realities, from the sensuous to the spiritual, from the outward to the inward, from the earthly to the heavenly. John 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "God is a Spirit (πνεῦμα ὁ Θεός)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or, as Rev., in margins, God is spirit. Spirit is the emphatic word; Spirit is God. The phrase describes the nature, not the personality of God. Compare the expressions, God is light; God is love (1 John 1:5; 1 John 4:8). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Or, as Rev., in margins, God is spirit. Spirit is the emphatic word; Spirit is God. The phrase describes the nature, not the personality of God. Compare the expressions, God is light; God is love (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 4:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]