[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(32) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have meat to eat that ye know not of.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The emphasis is on the pronouns, which are opposed to each other. “Meat” is better rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "food",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Greek word here is the same as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE WEARIED CHRISTJohn 4:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE WEARIED CHRIST",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Two pictures result from these two verses, each striking in itself, and gaining additional emphasis by the contrast. It was during a long hot day’s march that the tired band of pedestrians turned into the fertile valley. There, whilst the disciples went into the little hill-village to purchase, if they could, some food from the despised inhabitants, Jesus, apparently too exhausted to accompany them, ‘sat thus on the well.’ That little word thus seems to have a force difficult to reproduce in English. It is apparently intended to enhance the idea of utter weariness, either because the word ‘wearied’ is in thought to be supplied, ‘sat, being thus wearied, on the well’; or because it conveys the notion which might be expressed by our ‘just as He was’; as a tired man flings Himself down anywhere and anyhow, without any kind of preparation beforehand, and not much caring where it is that he rests.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus, utterly worn out, Jesus Christ sits on the well, whilst the western sun lengthens out the shadows on the plain. The disciples come back, and what a change they find. Hunger gone, exhaustion ended, fresh vigour in their wearied Master. What had made the difference? The woman’s repentance and joy. And He unveils the secret of His reinvigoration when He says, ‘I have meat to eat that ye know not of’-the hidden manna. ‘My meat is to do the will of Him that sent Me, and to finish His work.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, I think if we take just three points of view, we shall gain the lessons of this remarkable contrast. Note, then, the wearied Christ; the devoted Christ; the reinvigorated Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The wearied Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The wearied Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "How precious it is to us that this Gospel, which has the loftiest things to say about the manifest divinity of our Lord, and the glory that dwelt in Him, is always careful to emphasise also the manifest limitations and weaknesses of the Manhood. John never forgets either term of his great sentence in which all the gospel is condensed, ‘the Word became flesh.’ Ever he shows us ‘the Word’; ever ‘the flesh.’ Thus it is he only who records the saying on the Cross, ‘I thirst.’ It is he who tells us how Jesus Christ, not merely for the sake of getting a convenient opening of a conversation, or to conciliate prejudices, but because He needed what He asked, said to the woman of Samaria, ‘Give Me to drink.’ So the weariness of the Master stands forth for us as pathetic proof that it was no shadowy investiture with an apparent Manhood to which He stooped, but a real participation in our limitations and weaknesses, so that work to Him was fatigue, even though in Him dwelt the manifest glory of that divine nature which ‘fainteth not, neither is weary.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Not only does this pathetic incident teach us for our firmer faith, and more sympathetic and closer apprehension, the reality of the Manhood of Jesus Christ, but it supplies likewise some imperfect measure of His love, and reveals to us one condition of His power. Ah! if He had not Himself known weariness He never could have said, ‘Come unto Me, all ye that are weary and heavy laden, and I will give you rest.’ It was because Himself ‘took our infirmities,’ and amongst these the weakness of tired muscles and exhausted frame, that ‘He giveth power to the faint, and to them that have no might He increaseth strength.’ The Creator must have no share in the infirmities of the creature. It must be His unwearied power that calls them all by their names; and because He is great in might ‘not one’ of the creatures of His hand can ‘fail.’ But the Redeemer must participate in that from which He redeems; and the condition of His strength being ‘made perfect in our weakness’ is that our weakness shall have cast a shadow upon the glory of His strength. The measure of His love is seen in that, long before Calvary, He entered into the humiliation and sufferings and sorrows of humanity; a condition of His power is seen in that, forasmuch as the ‘children were partakers of flesh and blood, He also Himself likewise took part of the same,’ not only that ‘through death He might deliver’ from death, but that in life He might redeem from the ills and sorrows of life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor does that exhausted Figure, reclining on Jacob’s Well, preach to us only what He was. It proclaims to us likewise what we should be. For if His work was carried on to the edge of His capacity, and if He shrank not from service because it involved toil, what about the professing followers of Jesus Christ, who think that they are exempted from any form of service because they can plead that it will weary them? What about those who say that they tread in His footsteps, and have never known what it was to yield up one comfort, one moment of leisure, one thrill of enjoyment, or to encounter one sacrifice, one act of self-denial, one aching of weariness for the sake of the Lord who bore all for them? The wearied Christ proclaims His manhood, proclaims His divinity and His love, and rebukes us who consent to ‘walk in the way of His commandments’ only on condition that it can be done without dust or heat; and who are ready to run the race that is set before us, only if we can come to the goal without perspiration or turning a hair. ‘Jesus, being wearied with His journey, sat thus on the well.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Still further, notice here the devoted Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Still further, notice here the devoted Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is not often that He lets us have a glimpse into the innermost chambers of His heart, in so far as the impelling motives of His course are concerned. But here He lays them bare. ‘My meat is to do the will of Him that sent Me, and to finish His work.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, it is no mere piece of grammatical pedantry when I ask you to notice that the language of the original is so constructed as to give prominence to the idea that the aim of Christ’s life was the doing of the Father’s will; and that it is the aim rather than the actual performance and realisation of the aim which is pointed at by our Lord. The words would be literally rendered ‘My meat is that I may do the will of Him that sent Me and finish His work’-that is to say, the very nourishment and refreshment of Christ was found in making the accomplishment of the Father’s commandment His ever-impelling motive, His ever-pursued goal. The expression carries us into the inmost heart of Jesus, dealing, as it does, with the one all-pervading motive rather than with the resulting actions, fair and holy as these were.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren, the secret of our lives, if they are at all to be worthy and noble, must be the same-the recognition, not only as they say now, that we have a mission, but that there is a Sender; which is a wholly different view of our position, and that He who sends is the loving Father, who has spoken to us in that dear Son, who Himself made it His aim thus to obey, in order that it might be possible for us to re-echo His voice, and to repeat His aim. The recognition of the Sender, the absolute submission of our wills to His, must run through all the life. You may do your daily work, whatever it be, with this for its motto, ‘the will of the Lord be done’; and they who thus can look at their trade, or profession, and see the trivialities and monotonies of their daily occupations, in the transfiguring light of that great thought, will never need to complain that life is small, ignoble, wearisome, insignificant. As with pebbles in some clear brook with the sunshine on it, the water in which they are sunk glorifies and magnifies them. If you lift them out, they are but bits of dull stone; lying beneath the sunlit ripples they are jewels. Plunge the prose of your life, and all its trivialities, into that great stream, and it will magnify and glorify the smallest and the homeliest. Absolute submission to the divine will, and the ever-present thrilling consciousness of doing it, were the secret of Christ’s life, and ought to be the secret of ours.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Note the distinction between doing the will and perfecting the work. That implies that Jesus Christ, like us, reached forward, in each successive act of obedience to the successive manifestations of the Father’s will, to something still undone. The work will never be perfected or finished except on condition of continual fulfilment, moment by moment, of the separate behests of that divine will. For the Lord, as for His servants, this was the manner of obedience, that He ‘pressed towards the mark,’ and by individual acts of conformity secured that at last the whole ‘work’ should have been so completely accomplished that He might be able to say upon the Cross, ‘It is finished.’ If we have any right to call ourselves His, we too have thus to live.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, notice the reinvigorated Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Lastly, notice the reinvigorated Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I have already pointed out the lovely contrast between the two pictures, the beginning and the end of this incident; so I need not dwell upon that. The disciples wondered when they found that Christ desired and needed none of the homely sustenance that they had brought to Him. And when He answered their sympathy rather than their curiosity-for they did not ask Him any questions, but they said to Him, ‘Master, eat’-with ‘I have meat to eat that ye know not of,’ they, in their blind, blundering fashion, could only imagine that some one had brought Him something. So they gave occasion for the great words upon which we have been touching.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Notice, however, that Christ here sets forth the lofty aim at conformity to the divine will and fulfilment of the divine Work as being the meat of the soul. It is the true food for us all. The spirit which feeds upon such food will grow and be nourished. And the soul which feeds upon its own will and fancies, and not upon the plain brown bread of obedience, which is wholesome, though it be often bitter, will feed upon ashes, which will grate upon the teeth and hurt the palate. Such a soul will be like those wretched infants that are discovered sometimes at ‘baby-farms,’ starved and stunted, and not grown to half their right size. If you would have your spirits strong, robust, well nourished, live by obedience, and let the will of God be the food of your souls, and all will be well.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Souls thus fed can do without a good deal that others need. Why, enthusiasm for anything lifts a man above physical necessities and lower desires, even in its poorest forms. A regiment of soldiers making a forced march, or an athlete trying to break the record, will tramp, tramp on, not needing food, or rest, or sleep, until they have achieved their purpose, poor and ignoble though it may be. In all regions of life, enthusiasm and lofty aims make the soul lord of the body and of the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And in the Christian life we shall be thus lords, exactly in proportion to the depth and earnestness of our desires to do the will of God. They who thus are fed can afford ‘to scorn delights and live laborious days.’ They who thus are fed can afford to do with plain living, if there be high impulses as well as high thinking. And sure I am that nothing is more certain to stamp out the enthusiasm of obedience which ought to mark the Christian life than the luxurious fashion of living which is getting so common to-day amongst professing Christians.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is not in vain that we read the old story about the Jewish boys whose faces were radiant and whose flesh was firmer when they were fed on pulse and water than on all the wine and dainties of the Babylonish court. ‘Set a knife to thy throat if thou be a man given to appetite,’ and let us remember that the less we use, and the less we feel that we need, of outward goods, the nearer do we approach to the condition in which holy desires and lofty aims will visit our spirits.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I commend to you, brethren, the story of our text, in its most literal application, as well as in the loftier spiritual lessons that may be drawn from it. To be near Christ, and to desire to live for Him, delivers us from dependence upon earthly things; and in those who thus do live the old word shall be fulfilled, ‘Better is a little that a righteous man hath, than the abundance of many wicked.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:27-42 The disciples wondered that Christ talked thus with a Samaritan. Yet they knew it was for some good reason, and for some good end. Thus when particular difficulties occur in the word and providence of God, it is good to satisfy ourselves that all is well that Jesus Christ says and does. Two things affected the woman. The extent of his knowledge. Christ knows all the thoughts, words, and actions, of all the children of men. And the power of his word. He told her secret sins with power. She fastened upon that part of Christ's discourse, many would think she would have been most shy of repeating; but the knowledge of Christ, into which we are led by conviction of sin, is most likely to be sound and saving. They came to him: those who would know Christ, must meet him where he records his name. Our Master has left us an example, that we may learn to do the will of God as he did; with diligence, as those that make a business of it; with delight and pleasure in it. Christ compares his work to harvest-work. The harvest is appointed and looked for before it comes; so was the gospel. Harvest-time is busy time; all must be then at work. Harvest-time is a short time, and harvest-work must be done then, or not at all; so the time of the gospel is a season, which if once past, cannot be recalled. God sometimes uses very weak and unlikely instruments for beginning and carrying on a good work. Our Saviour, by teaching one poor woman, spread knowledge to a whole town. Blessed are those who are not offended at Christ. Those taught of God, are truly desirous to learn more. It adds much to the praise of our love to Christ and his word, if it conquers prejudices. Their faith grew. In the matter of it: they believed him to be the Saviour, not only of the Jews but of the world. In the certainty of it: we know that this is indeed the Christ. And in the ground of it, for we have heard him ourselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I have meat to eat - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32. meat ye know not of—What spirituality of mind! \"I have been eating all the while, and such food as ye dream not of.\" What can that be? they ask each other; have any supplies been brought Him in our absence? He knows what they are saying though He hears it not.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " But our blessed Lord was more intent upon gospelizing the Samaritans, than satisfying his hunger: what this meat was, he opens himself, (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 4:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But he said unto them,.... That is, \"Jesus\", as the Persic, or the Lord Jesus, as the Ethiopic versions express it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I have meat to eat that ye know not of: meaning the conversion of the Samaritan woman, and of other Samaritans, who were flocking in great numbers to him, which he knew, though his disciples did not; and the harvest of souls he had a prospect of, see John 4:35, was as meat unto him, delightful and refreshing; and his mind and thoughts were so taken up with these things, that he had no inclination to any corporeal food. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I have meat to eat that ye know not of: meaning the conversion of the Samaritan woman, and of other Samaritans, who were flocking in great numbers to him, which he knew, though his disciples did not; and the harvest of souls he had a prospect of, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", was as meat unto him, delightful and refreshing; and his mind and thoughts were so taken up with these things, that he had no inclination to any corporeal food. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{4} But he said unto them, I have meat to eat that ye know not of.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{4}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " But he said unto them, I have meat to eat that ye know not of.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) We may have care of our bodies, but in such a way that we prefer willingly and freely the occasion which is offered us to enlarge the kingdom of God before all necessities of this life, whatever else they may be.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have meat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The pronouns ‘I’ and ‘ye’ are emphatically opposed. His joy at the woman’s conversion prompts Him to refuse food: not of course that His human frame could do without it, but that in His delight He feels for the moment no want of food.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὁ δέ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but He",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He therefore dispensed with dinner, His spiritual ardour taking away hunger.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ οἴδατε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye know not of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This tended to increase their wonder and eagerness to learn. A most sweet enigma!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 32.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But he saith to them, I have food to eat that ye know not;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of which you are ignorant, but which you may come to know by and by. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Βρῶσιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "βρῶμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are both used. The first denotes, strictly speaking, the act of eating; and the second the material for food; but they are, in Greek literature, generally used almost interchangeably. There were Divine desires and sacred satisfactions which discriminated the Lord's consciousness from that of his disciples. Thoma refers to the mighty fasts of the great lawgiver and prophet as the literary antecedent of this significant event; but this superiority to food is true of every great soul. The men of the spirit are consumed with desires which dwarf the desires of the flesh, and they forget to eat their bread. Nor can we forget that the synoptic narrative places the forty dave' fast in this very epoch of Christ's life, chronologically speaking. (See note at end of this chapter.) John 4:32",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Meat (βρῶσιν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Originally the act of eating (Colossians 2:16), but often of that which is eaten. A parallel is found in the vulgar phrase, a thing is good or poor eating. The word is always used by Paul in its original sense.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Originally the act of eating (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but often of that which is eaten. A parallel is found in the vulgar phrase, a thing is good or poor eating. The word is always used by Paul in its original sense.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Know not of (οὐκ οἴδατε)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Incorrect. Rev., rightly, ye know not; i.e., you do not know its virtue. ",
        "children": []
      }
    ]
  }
]