[{"header":"Concerning Food Sacrificed To Idols: Let Love Guide Your Exercise of “Rights”"},{"num":8,"verse":"Now concerning the foods-sacrificed-to-idols, we know that we all have knowledge. Knowledge puffs-up, but love builds-up. "},{"num":2,"verse":"If anyone thinks that he has come-to-know anything, he did not-yet know as he ought-to know. "},{"num":3,"verse":"But if one loves God, this one has been known by Him. "},{"num":4,"verse":"Therefore concerning the eating of the foods-sacrificed-to-idols— we know that an idol is nothing in the world, and that there is no God except one. "},{"num":5,"verse":"For even if-indeed there are ones being called gods, whether in heaven or on earth— as-indeed there are many gods and many lords— "},{"num":6,"verse":"yet for us there is One God the Father, from Whom are all things, and we are for Him; and one Lord Jesus Christ, through Whom are all things, and we are through Him. "},{"num":7,"verse":"But this knowledge is not in all people. But some, by the accustomed-habit of the idol until now, eat this food as food-sacrificed-to-an-idol. And their conscience, being weak, is stained. "},{"num":8,"verse":"But food will not bring us near to God— neither if we do not eat are we lacking, nor if we eat are we abounding. "},{"num":9,"verse":"But be watching-out that this right of yours does not somehow become an opportunity-for-stumbling to the weak ones. "},{"num":10,"verse":"For if someone sees you, the one having knowledge, reclining [to eat] in an idol-temple, will not his conscience, being weak, be built-up so as to eat the foods-sacrificed-to-idols? "},{"num":11,"verse":"For the one being weak is being destroyed by your knowledge— the brother for the sake of whom Christ died! "},{"num":12,"verse":"And in this manner sinning against the brothers and striking their conscience while being weak, you are sinning against Christ."},{"header":"On The One Hand, I Will Not Do Anything That Hinders People’s Spiritual Advance"},{"num":13,"verse":"For-this-very-reason, if food causes my brother to fall, I will never eat meats, ever— in-order-that I may not cause my brother to fall."}]