[{"num":8,"verse":"As to the concern of eating food dedicated to idols: we know that all of us have knowledge, but knowledge can be risky. Knowledge promotes overconfidence and worse arrogance, but charity of the heart (love, that is) looks to build up others. "},{"num":2,"verse":"Just because a person presumes to have some bit of knowledge, that person doesn’t necessarily have the right kind of knowledge. "},{"num":3,"verse":"But if someone loves God, it is certain that God has already known that one."},{"num":4,"verse":"So to address your concerns about eating food offered to idols, let me start with what we know. An idol is essentially nothing, as there is no other God but the One. "},{"num":5,"verse":"And even if the majority believes there are many so-called gods in heaven and on earth (certainly many worship such “gods” and “lords”), this is not our view. "},{"num":6,"verse":"For us, there is one God, the Father who is the ultimate source of all things and the goal of our lives. And there is one Lord—Jesus the Anointed, the Liberating King; through Him all things were created, and by Him we are redeemed."},{"num":7,"verse":"But this knowledge is not in everyone. Up until now, some have been so familiar with idols and what goes on in the temples that when they eat meat that has been offered first to some idol, their weak consciences are polluted. This is the issue. "},{"num":8,"verse":"Again, here’s what we know: what we eat will not bring us closer to God—we gain nothing in feasting and lose nothing by fasting. "},{"num":9,"verse":"Now let me warn you: don’t let your newfound liberty cause those who don’t know this to fall face-first. "},{"num":10,"verse":"Let’s say a person (someone who knows of Jesus) sees you eating in the temple of an idol; and because the person with a weaker conscience is still unsure of things, he becomes confident, follows your lead, and eats idol food. "},{"num":11,"verse":"Now, because of your knowledge on display in your conduct, the weaker brother or sister—for whom the Anointed One died—is destroyed! Ruined! "},{"num":12,"verse":"What’s more, by living according to your knowledge, you have sinned against these brothers and sisters and wounded their weak consciences—and because you sinned against them, you have sinned against the Anointed One, the Liberating King."},{"num":13,"verse":"So if any type of food is an issue that causes my brothers and sisters to fall away from God, then God forbid I should ever eat it again so that I would never be the crack, the rise, or the rock on the road that causes them to stumble."}]