[{"header":"Commanders of the Army"},{"num":27,"verse":"This is the list of the sons (descendants) of Israel, the heads of fathers’ households, the commanders of thousands and of hundreds, and their officers who served the king in all matters of the divisions which came in and went out month by month throughout the year, each division numbering 24,000:"},{"num":2,"verse":"Jashobeam the son of Zabdiel was in charge of the first division for the first month; and in his division were 24,000. "},{"num":3,"verse":"He was descended from Perez, and was chief of all the commanders of the army for the first month. "},{"num":4,"verse":"Dodai the Ahohite and his division was in charge of the division for the second month, Mikloth was the chief officer; and in his division were 24,000. "},{"num":5,"verse":"The third commander of the army for the third month was Benaiah, the son of Jehoiada the priest, as chief; and in his division were 24,000. "},{"num":6,"verse":"This is the Benaiah who was the mighty man of the thirty and was in charge of the thirty; and Ammizabad his son was over his division. "},{"num":7,"verse":"The fourth, for the fourth month was Asahel the brother of Joab, and Zebadiah his son after him; and in his division were 24,000. "},{"num":8,"verse":"The fifth, for the fifth month was the commander Shamhuth the Izrahite; and in his division were 24,000. "},{"num":9,"verse":"The sixth, for the sixth month was Ira the son of Ikkesh the Tekoite; and in his division were 24,000. "},{"num":10,"verse":"The seventh, for the seventh month was Helez the Pelonite of the sons of Ephraim; and in his division were 24,000. "},{"num":11,"verse":"The eighth, for the eighth month was Sibbecai the Hushathite of the Zerahites; and in his division were 24,000. "},{"num":12,"verse":"The ninth, for the ninth month was Abiezer of Anathoth, a Benjamite; and in his division were 24,000. "},{"num":13,"verse":"The tenth, for the tenth month was Maharai from Netophah of the Zerahites; and in his division were 24,000. "},{"num":14,"verse":"The eleventh, for the eleventh month was Benaiah the Pirathonite of the sons of Ephraim; and in his division were 24,000. "},{"num":15,"verse":"The twelfth, for the twelfth month was Heldai the Netophathite of Othniel; and in his division were 24,000."},{"header":"Chief Officers of the Tribes"},{"num":16,"verse":"Now in charge of the tribes of Israel [were the following]: chief officer of the Reubenites was Eliezer the son of Zichri; of the Simeonites, Shephatiah the son of Maacah; "},{"num":17,"verse":"of Levi, Hashabiah the son of Kemuel; of Aaron, Zadok; "},{"num":18,"verse":"of Judah, Elihu, one of David’s brothers; of Issachar, Omri the son of Michael; "},{"num":19,"verse":"of Zebulun, Ishmaiah the son of Obadiah; of Naphtali, Jeremoth the son of Azriel; "},{"num":20,"verse":"of the Ephraimites, Hoshea the son of Azaziah; of the half-tribe of Manasseh, Joel the son of Pedaiah; "},{"num":21,"verse":"of the half-tribe of Manasseh in Gilead, Iddo the son of Zechariah; of Benjamin, Jaasiel the son of Abner; "},{"num":22,"verse":"of Dan, Azarel the son of Jeroham. These were the leaders of the tribes of Israel. "},{"num":23,"verse":"But David did not count those twenty years of age and under, for the Lord had said he would multiply Israel as the stars of heaven. "},{"num":24,"verse":"Joab the son of Zeruiah began a census but did not finish; and because of this, [God’s] wrath came on Israel, and the number was not recorded in the chronicles of King David."},{"header":"Various Overseers"},{"num":25,"verse":"Azmaveth the son of Adiel was in charge of the king’s storerooms; and Jonathan the son of Uzziah was in charge of the storehouses in the country, in the cities, in the villages, and in the towers. "},{"num":26,"verse":"Ezri the son of Chelub was in charge of those who did the work of the field, tilling the soil. "},{"num":27,"verse":"Shimei the Ramathite was in charge of the vineyards; Zabdi the Shiphmite was in charge of the produce of the vineyards for the wine cellars. "},{"num":28,"verse":"Baal-hanan the Gederite was in charge of the olive and sycamore trees in Shephelah (the lowlands); and Joash was in charge of the stores of [olive] oil. "},{"num":29,"verse":"Shitrai the Sharonite was in charge of the cattle grazing in Sharon; Shaphat the son of Adlai was in charge of the cattle in the valleys. "},{"num":30,"verse":"Obil the Ishmaelite was in charge of the camels; and Jehdeiah the Meronothite was in charge of the donkeys. "},{"num":31,"verse":"Jaziz the Hagrite was in charge of the flocks. All these were overseers and stewards of the property which belonged to King David."},{"header":"Counselors"},{"num":32,"verse":"Also Jonathan, David’s uncle, was a counselor and advisor, a man of understanding and wisdom, and a scribe; and Jehiel the son of Hachmoni attended (tutored) the king’s sons. "},{"num":33,"verse":"Ahithophel was counselor to the king; and Hushai the Archite was the king’s companion and friend. "},{"num":34,"verse":"Ahithophel was succeeded by Jehoiada the son of Benaiah and by Abiathar; and Joab was the commander of the king’s army."}]