[{"header":"The Captains of the Army"},{"num":27,"verse":"These were the sons of Israel, the heads of fathers’ houses. They were the leaders of thousands and of hundreds. These were the captains who worked for the king in anything to do with the armies which came in and went out every month of the year. There were 24,000 men in each army. "},{"num":2,"verse":"Jashobeam the son of Zabdiel was the leader of the first army for the first month. There were 24,000 in his army. "},{"num":3,"verse":"He was a son of Perez, and head of all the captains of the army for the first month. "},{"num":4,"verse":"Dodai the Ahohite was the leader of the army for the second month. Mikloth was the head captain. There were 24,000 in his army. "},{"num":5,"verse":"The third leader of the army for the third month was Benaiah, the son of Jehoiada the religious leader. There were 24,000 in his army. "},{"num":6,"verse":"This is the Benaiah who was the strong man of the thirty, and leader of the thirty. Ammizabad his son was captain of his army. "},{"num":7,"verse":"The fourth leader for the fourth month was Asahel the brother of Joab, and Zebadiah his son after him. There were 24,000 in his army. "},{"num":8,"verse":"The fifth leader for the fifth month was Shamhuth the Izrahite. There were 24,000 in his army. "},{"num":9,"verse":"The sixth for the sixth month was Ira the son of Ikkesh the Tekoite. There were 24,000 in his army. "},{"num":10,"verse":"The seventh for the seventh month was Helez the Pelonite of the sons of Ephraim. There were 24,000 in his army. "},{"num":11,"verse":"The eighth for the eighth month was Sibbecai the Hushathite of the Zerahites. There were 24,000 in his army. "},{"num":12,"verse":"The ninth for the ninth month was Abiezer the Anathothite of the Benjamites. There were 24,000 in his army. "},{"num":13,"verse":"The tenth for the tenth month was Maharai the Netophathite of the Zerahites. There were 24,000 in his army. "},{"num":14,"verse":"The eleventh for the eleventh month was Benaiah the Pirathonite of the sons of Ephraim. There were 24,000 in his army. "},{"num":15,"verse":"The twelfth for the twelfth month was Heldai the Netophathite of Othniel. There were 24,000 in his army."},{"header":"Leaders of Family Groups"},{"num":16,"verse":"The leaders of the family groups of Israel were: Eliezer the son of Zichri was the head captain of the Reubenites; Shephatiah the son of Maacah led the Simeonites. "},{"num":17,"verse":"Hashabiah the son of Kemuel led the sons of Levi; Zadok led the sons of Aaron. "},{"num":18,"verse":"Elihu, one of David’s brothers, led the sons of Judah; Omri the son of Michael led the sons of Issachar; "},{"num":19,"verse":"Ishmaiah the son of Obadiah led the sons of Zebulun; Jeremoth the son of Azriel led the sons of Naphtali; "},{"num":20,"verse":"Hoshea the son of Azaziah led the sons of Ephraim; Joel the son of Pedaiah led the half-family group of Manasseh; "},{"num":21,"verse":"Iddo the son of Zechariah led the half-family group of Manasseh in Gilead; Jaasiel the son of Abner led the sons of Benjamin; "},{"num":22,"verse":"And Azarel the son of Jeroham led the sons of Dan. These were the leaders of the families of Israel. "},{"num":23,"verse":"But David did not number those younger than twenty years old because the Lord had promised to make Israel many, as the stars of heaven. "},{"num":24,"verse":"Joab the son of Zeruiah had begun to number them, but did not finish. Anger came upon Israel because of this. So the number was not put into the book of the chronicles of King David."},{"num":25,"verse":"Azmaveth the son of Adiel was over the king’s store-houses. Jonathan the son of Uzziah was over the store-houses in the country, in the cities, in the towns, and in the towers. "},{"num":26,"verse":"Ezri the son of Chelub was over those who worked in the fields, plowing and planting. "},{"num":27,"verse":"Shimei the Ramathite was over the grape-fields. Zabdi the Shiphmite was over the fruit of the grape-fields for the wine. "},{"num":28,"verse":"Baalhanan the Gederite was over the olive and sycamore trees in the plains. Joash was captain of the stores of oil. "},{"num":29,"verse":"Shitrai the Sharonite was over the cattle which were eating in the fields of Sharon. Shaphat the son of Adlai was over the cattle in the valleys. "},{"num":30,"verse":"Obil the Ishmaelite was over the camels. Jehdeiah the Meronothite was over the donkeys. "},{"num":31,"verse":"And Jaziz the Hagrite was over the flocks. All these were over all that belonged to King David."},{"num":32,"verse":"Jonathan, the brother of David’s father, used much wisdom talking with people. And he was a writer. Jehiel the son of Hachmoni taught the king’s sons. "},{"num":33,"verse":"Ahithophel talked about problems with the king. Hushai the Archite was the king’s friend. "},{"num":34,"verse":"Jehoiada the son of Benaiah, and Abaiathar, talked with the king after Ahithophel. And Joab was the captain of the king’s army."}]