[{"header":"During This Time, King Herod Kills The Apostle James And Imprisons Peter"},{"num":12,"verse":"And about that time, Herod the king put hands on some of the ones from the church to mistreat them. "},{"num":2,"verse":"And he killed James, the brother of John, with a sword. "},{"num":3,"verse":"And having seen that it was pleasing to the Jews, he proceeded to arrest Peter also (now the days of the Feast of Unleavened-Bread were taking place)— "},{"num":4,"verse":"whom indeed having seized, he put into prison, having handed him over to four squads of soldiers to guard him, intending to bring him up to the people after the Passover [Feast]. "},{"num":5,"verse":"So indeed Peter was being kept in the prison. And prayer was fervently being made by the church to God for him."},{"header":"An Angel Releases Peter"},{"num":6,"verse":"And when Herod was about to bring him forth, on that night Peter was sleeping between two soldiers, having been bound with two chains. And guards in front of the door were keeping-watch-over the prison. "},{"num":7,"verse":"And behold— an angel of the Lord stood near, and light shined in the cell. And having struck the side of Peter, he woke him, saying, “Arise quickly”. And his chains fell off of his hands. "},{"num":8,"verse":"And the angel said to him, “Gird-yourself  and tie-on your sandals”. And he did so. And he says to him, “Put-on your cloak and be following me”. "},{"num":9,"verse":"And having gone forth, he was following. And he did not know that the thing taking place by-means-of the angel was real, but he was thinking that he was seeing a vision. "},{"num":10,"verse":"And having gone through a first guard-post and a second, they came to the iron gate leading into the city, which by-itself was opened for them. And having gone out, they went ahead one lane, and immediately the angel departed from him."},{"header":"Peter Goes To The House of The Mother of John Mark, Where They Were Praying"},{"num":11,"verse":"And Peter, having become within himself, said, “Now I know truly that the Lord sent-out His angel and rescued me from the hand of Herod, and from all the expectation of the people of the Jews”. "},{"num":12,"verse":"And having become-aware, he went to the house of Mary, the mother of John (the one being called Mark), where there were many assembled-together and praying. "},{"num":13,"verse":"And he having knocked-on the door of the gate, a servant-girl went to it to answer— Rhoda by name. "},{"num":14,"verse":"And having recognized the voice of Peter, because of her joy she did not open the gate, but having run in, she reported that Peter was standing in front of the gate. "},{"num":15,"verse":"But the ones said to her, “You are mad”. But the one was insisting that it was holding so. But the ones were saying, “It is his angel”. "},{"num":16,"verse":"But Peter was continuing-on knocking. And having opened, they saw him and were astonished. "},{"num":17,"verse":"And having motioned to them with his hand to be silent, he related to them how the Lord led him out of the prison. And he said, “Report these things to James and the brothers”. And having gone out, he proceeded to another place."},{"header":"When Peter Can’t Be Found, The Guards Are Executed. Herod Dies In Caesarea"},{"num":18,"verse":"Now having become day, there was no small disturbance among the soldiers as to what then became of Peter. "},{"num":19,"verse":"And Herod, having searched-for him and not having found him, having examined the guards, ordered that they be led away. And having gone down from Judea to Caesarea, he was spending-time there. "},{"num":20,"verse":"Now he was being very-angry with the Tyrians and Sidonians. And they were coming to him with-one-accord. And having won-over Blastus, the one over the bedroom of the king, they were asking-for peace, because of their country being provided-for from the royal land. "},{"num":21,"verse":"And on an appointed day, Herod— having put on the royal clothing, and having sat on the judgment-seat— was giving-a-public-address to them. "},{"num":22,"verse":"And the public-assembly was calling-out, “The voice of a god and not of a man!” "},{"num":23,"verse":"And at once an angel of the Lord struck him because he did not give the glory to God. And having become eaten-by-worms, he expired."},{"header":"Barnabas And Saul Return To Antioch From Judea, With John Mark"},{"num":24,"verse":"But the word of God was growing and being multiplied. "},{"num":25,"verse":"And Barnabas and Saul returned, having fulfilled the ministry to Jerusalem, having taken along John with them (the one having been called Mark)."}]