[{"header":"More Persecution"},{"num":12,"verse":"About this time King Herod began to persecute some members of the church. "},{"num":2,"verse":"He had James, the brother of John, put to death by the sword. "},{"num":3,"verse":"When he saw that this pleased the Jews, he went ahead and had Peter arrested. (This happened during the time of the Festival of Unleavened Bread.) "},{"num":4,"verse":"After his arrest Peter was put in jail, where he was handed over to be guarded by four groups of four soldiers each. Herod planned to put him on trial in public after Passover. "},{"num":5,"verse":"So Peter was kept in jail, but the people of the church were praying earnestly to God for him."},{"header":"Peter Is Set Free from Prison"},{"num":6,"verse":"The night before Herod was going to bring him out to the people, Peter was sleeping between two guards. He was tied with two chains, and there were guards on duty at the prison gate. "},{"num":7,"verse":"Suddenly an angel of the Lord stood there, and a light shone in the cell. The angel shook Peter by the shoulder, woke him up, and said, “Hurry! Get up!” At once the chains fell off Peter's hands. "},{"num":8,"verse":"Then the angel said, “Tighten your belt and put on your sandals.” Peter did so, and the angel said, “Put your cloak around you and come with me.” "},{"num":9,"verse":"Peter followed him out of the prison, not knowing, however, if what the angel was doing was real; he thought he was seeing a vision. "},{"num":10,"verse":"They passed by the first guard station and then the second, and came at last to the iron gate that opens into the city. The gate opened for them by itself, and they went out. They walked down a street, and suddenly the angel left Peter."},{"num":11,"verse":"Then Peter realized what had happened to him, and said, “Now I know that it is really true! The Lord sent his angel to rescue me from Herod's power and from everything the Jewish people expected to happen.”"},{"num":12,"verse":"Aware of his situation, he went to the home of Mary, the mother of John Mark, where many people had gathered and were praying. "},{"num":13,"verse":"Peter knocked at the outside door, and a servant named Rhoda came to answer it. "},{"num":14,"verse":"She recognized Peter's voice and was so happy that she ran back in without opening the door, and announced that Peter was standing outside. "},{"num":15,"verse":"“You are crazy!” they told her. But she insisted that it was true. So they answered, “It is his angel.”"},{"num":16,"verse":"Meanwhile Peter kept on knocking. At last they opened the door, and when they saw him, they were amazed. "},{"num":17,"verse":"He motioned with his hand for them to be quiet, and he explained to them how the Lord had brought him out of prison. “Tell this to James and the rest of the believers,” he said; then he left and went somewhere else."},{"num":18,"verse":"When morning came, there was a tremendous confusion among the guards—what had happened to Peter? "},{"num":19,"verse":"Herod gave orders to search for him, but they could not find him. So he had the guards questioned and ordered them put to death."},{"header":"The Death of Herod"},{"num":20,"verse":"Herod was very angry with the people of Tyre and Sidon, so they went in a group to see him. First they convinced Blastus, the man in charge of the palace, that he should help them. Then they went to Herod and asked him for peace, because their country got its food supplies from the king's country."},{"num":21,"verse":"On a chosen day Herod put on his royal robes, sat on his throne, and made a speech to the people. "},{"num":22,"verse":"“It isn't a man speaking, but a god!” they shouted. "},{"num":23,"verse":"At once the angel of the Lord struck Herod down, because he did not give honor to God. He was eaten by worms and died."},{"num":24,"verse":"Meanwhile the word of God continued to spread and grow."},{"num":25,"verse":"Barnabas and Saul finished their mission and returned from Jerusalem, taking John Mark with them."}]