[[],[{"type":"prose","content":"And about that time, Herod the king put forth his hands, to do evil to certain of those of the assembly,"}],[{"type":"prose","content":"and he killed James, the brother of John, with the sword,"}],[{"type":"prose","content":"and having seen that it is pleasing to the Jews, he added to lay hold of Peter also -- and they were the days of the unleavened food --"}],[{"type":"prose","content":"whom also having seized, he did put in prison, having delivered [him] to four quaternions of soldiers to guard him, intending after the passover to bring him forth to the people."}],[{"type":"prose","content":"Peter, therefore, indeed, was kept in the prison, and fervent prayer was being made by the assembly unto God for him,"}],[{"type":"prose","content":"and when Herod was about to bring him forth, the same night was Peter sleeping between two soldiers, having been bound with two chains, guards also before the door were keeping the prison,"}],[{"type":"prose","content":"and lo, a messenger of the Lord stood by, and a light shone in the buildings, and having smitten Peter on the side, he raised him up, saying, `Rise in haste,' and his chains fell from off [his] hands."}],[{"type":"prose","content":"The messenger also said to him, `Gird thyself, and bind on thy sandals;' and he did so; and he saith to him, `Put thy garment round and be following me;'"}],[{"type":"prose","content":"and having gone forth, he was following him, and he knew not that it is true that which is done through the messenger, and was thinking he saw a vision,"}],[{"type":"prose","content":"and having passed through a first ward, and a second, they came unto the iron gate that is leading to the city, which of its own accord did open to them, and having gone forth, they went on through one street, and immediately the messenger departed from him."}],[{"type":"prose","content":"And Peter having come to himself, said, `Now I have known of a truth that the Lord did sent forth His messenger, and did deliver me out of the hand of Herod, and all the expectation of the people of the Jews;'"}],[{"type":"prose","content":"also, having considered, he came unto the house of Mary, the mother of John, who is surnamed Mark, where there were many thronged together and praying."}],[{"type":"prose","content":"And Peter having knocked at the door of the porch, there came a damsel to hearken, by name Rhoda,"}],[{"type":"prose","content":"and having known the voice of Peter, from the joy she did not open the porch, but having run in, told of the standing of Peter before the porch,"}],[{"type":"prose","content":"and they said unto her, `Thou art mad;' and she was confidently affirming [it] to be so, and they said, `It is his messenger;'"}],[{"type":"prose","content":"and Peter was continuing knocking, and having opened, they saw him, and were astonished,"}],[{"type":"prose","content":"and having beckoned to them with the hand to be silent, he declared to them how the Lord brought him out of the prison, and he said, `Declare to James and to the brethren these things;' and having gone forth, he went on to another place."}],[{"type":"prose","content":"And day having come, there was not a little stir among the soldiers what then was become of Peter,"}],[{"type":"prose","content":"and Herod having sought for him, and not having found, having examined the guards, did command [them] to be led away to punishment, and having gone down from Judea to Cesarea, he was abiding [there]."}],[{"type":"prose","content":"And Herod was highly displeased with the Tyrians and Sidonians, and with one accord they came unto him, and having made a friend of Blastus, who [is] over the bed-chambers of the king, they were asking peace, because of their country being nourished from the king's;"}],[{"type":"prose","content":"and on a set day, Herod having arrayed himself in kingly apparel, and having sat down upon the tribunal, was making an oration unto them,"}],[{"type":"prose","content":"and the populace were shouting, `The voice of a god, and not of a man;'"}],[{"type":"prose","content":"and presently there smote him a messenger of the Lord, because he did not give the glory to God, and having been eaten of worms, he expired."}],[{"type":"prose","content":"And the word of God did grow and did multiply,"}],[{"type":"prose","content":"and Barnabas and Saul did turn back out of Jerusalem, having fulfilled the ministration, having taken also with [them] John, who was surnamed Mark."}]]