[[],[{"type":"header","content":"Paul in Macedonia and Greece"},{"type":"prose","content":"After the uproar had ended, Paul sent for the disciples, and when he had encouraged them he told them goodbye, and set off to go to Macedonia. "}],[{"type":"prose","content":"After he had gone through those districts and had encouraged the believers, he came to Greece. "}],[{"type":"prose","content":"And he stayed three months, and when a plot was formed against him by the Jews as he was about to set sail for Syria, he decided to return through Macedonia (northern Greece). "}],[{"type":"prose","content":"He was accompanied by Sopater of Berea,  of Pyrrhus, and by Aristarchus and Secundus of the Thessalonians, and by Gaius of Derbe, and Timothy, and Tychicus and Trophimus of Asia. "}],[{"type":"prose","content":"These men went on ahead and were waiting for us (including Luke) at Troas. "}],[{"type":"prose","content":"We sailed from Philippi after the days of Unleavened Bread (Passover week), and within five days we reached them at Troas, where we stayed for seven days."}],[{"type":"prose","content":"Now on the first day of the week (Sunday), when we were gathered together to break bread (share communion), Paul  talking with them, intending to leave the next day; and he kept on with his message until midnight. "}],[{"type":"prose","content":"Now there were many lamps in the upper room where we were assembled, "}],[{"type":"prose","content":"and there was a young man named Eutychus (“Lucky”) sitting on the window sill. He was sinking into a deep sleep, and as Paul kept on talking longer and longer, he was completely overcome by sleep and fell down from the third story; and he was picked up dead. "}],[{"type":"prose","content":"But Paul went down and threw himself on him and embraced him, and said [to those standing around him], “Do not be troubled, because he is alive.” "}],[{"type":"prose","content":"When Paul had gone back upstairs and had broken the bread and eaten, he talked [informally and confidentially] with them for a long time—until daybreak [in fact]—and then he left. "}],[{"type":"prose","content":"They took the boy [Eutychus] home alive, and were greatly comforted  encouraged."}],[{"type":"header","content":"Troas to Miletus"},{"type":"prose","content":"But we went on ahead to the ship and set sail for Assos, intending to take Paul on board there; for that was what he had arranged, intending himself to go [a shorter route] by land. "}],[{"type":"prose","content":"So when he met us at Assos, we took him on board and sailed on to Mitylene. "}],[{"type":"prose","content":"Sailing from there, we arrived the next day [at a point] opposite Chios; the following day we crossed over to Samos, and the next day we arrived at Miletus [about 30 miles south of Ephesus]. "}],[{"type":"prose","content":"Paul had decided to sail on past Ephesus so that he would not end up spending time [unnecessarily] in [the province of] Asia (modern Turkey); for he was in a hurry to be in Jerusalem, if possible, on the day of Pentecost."}],[{"type":"header","content":"Farewell to Ephesus"},{"type":"prose","content":"However, from Miletus he sent  to Ephesus and summoned the elders of the church [to meet him there]. "}],[{"type":"prose","content":"And when they arrived he said to them:“You know well how I [lived when I] was with you, from the first day that I set foot in Asia [until now], "}],[{"type":"prose","content":"serving the Lord with all humility and with tears and trials which came on me because of the plots of the Jews [against me]; "}],[{"type":"prose","content":"[you know] how I did not shrink back in fear from telling you anything that was for your benefit, or from teaching you in public meetings, and from house to house, "}],[{"type":"prose","content":"solemnly [and wholeheartedly] testifying to both Jews and Greeks, urging them to turn in repentance to God and [to have] faith in our Lord Jesus Christ [for salvation]. "}],[{"type":"prose","content":"And now, compelled by the Spirit  obligated by my convictions, I am going to Jerusalem, not knowing what will happen to me there, "}],[{"type":"prose","content":"except that the Holy Spirit solemnly [and emphatically] affirms to me in city after city that imprisonment and suffering await me. "}],[{"type":"prose","content":"But I do not consider my life as something of value  dear to me, so that I may [with joy] finish my course and the ministry which I received from the Lord Jesus, to testify faithfully of the good news of God’s [precious, undeserved] grace [which makes us free of the guilt of sin and grants us eternal life]."}],[{"type":"prose","content":"“And now, listen carefully: I know that none of you, among whom I went about preaching the kingdom, will see me again. "}],[{"type":"prose","content":"For that reason I testify to you on this [our parting] day that I am innocent of the blood of all people. "}],[{"type":"prose","content":"For I did not shrink from declaring to you the whole purpose  plan of God. "}],[{"type":"prose","content":"Take care  be on guard for yourselves and for the whole flock over which the Holy Spirit has appointed you as overseers, to shepherd (tend, feed, guide) the church of God which He bought with His own blood. "}],[{"type":"prose","content":"I know that after I am gone, [false teachers like] ferocious wolves will come in among you, not sparing the flock; "}],[{"type":"prose","content":"even from among your own selves men will arise, speaking perverse  distorted things, to draw away the disciples after themselves [as their followers]. "}],[{"type":"prose","content":"Therefore be  alert, remembering that for three years, night or day, I did not stop admonishing  advising each one [of you] with tears. "}],[{"type":"prose","content":"And now I commend you to God [placing you in His protective, loving care] and [I commend you] to the word of His grace [the counsel and promises of His unmerited favor]. His grace is able to build you up and to give you the [rightful] inheritance among all those who are sanctified [that is, among those who are set apart for God’s purpose—all believers]. "}],[{"type":"prose","content":"I had no desire for anyone’s silver or gold or [expensive] clothes. "}],[{"type":"prose","content":"You know personally that these hands ministered to my own needs [working in manual labor] and to [those of] the people who were with me. "}],[{"type":"prose","content":"In everything I showed you [by example] that by working hard in this way you must help the weak and remember the words of the Lord Jesus, that He Himself said,  [and brings greater joy] "}],[{"type":"prose","content":"When he had said these things, he knelt down and prayed with them all. "}],[{"type":"prose","content":"And they  to weep openly and threw their arms around Paul’s neck, and repeatedly kissed him, "}],[{"type":"prose","content":"grieving  distressed especially over the word which he had spoken, that they would not see him again. And they accompanied him to the ship."}]]