[{"header":"Paul Goes to Macedonia and Greece"},{"num":20,"verse":"When the trouble stopped, Paul invited the Lord’s followers to come visit him. After encouraging them, he told them goodbye and left for Macedonia."},{"num":2,"verse":"On his way through Macedonia he had many words of encouragement for the followers in various places. Then he went to Greece"},{"num":3,"verse":"and stayed there three months."},{"num":4,"verse":"These men were traveling with him: Sopater, the son of Pyrrhus, from the city of Berea; Aristarchus and Secundus, from the city of Thessalonica; Gaius, from the city of Derbe; Timothy; and two men from Asia, Tychicus and Trophimus."},{"num":5,"verse":"These men went first, ahead of Paul. They waited for us in the city of Troas."},{"num":6,"verse":"We sailed from the city of Philippi after the Festival of Unleavened Bread. We met these men in Troas five days later and stayed there seven days."},{"header":"Paul’s Last Visit to Troas"},{"num":7,"verse":"On Sunday we all met together to eat the Lord’s Supper. Paul talked to the group. Because he was planning to leave the next day, he continued talking until midnight."},{"num":8,"verse":"We were all together in a room upstairs, and there were many lights in the room."},{"num":9,"verse":"There was a young man named Eutychus sitting in the window. Paul continued talking, and Eutychus became very, very sleepy. Finally, he went to sleep and fell out of the window. He fell to the ground from the third floor. When the people went down and lifted him up, he was dead."},{"num":10,"verse":"Paul went down to where Eutychus was, knelt down beside him, and put his arms around him. He said to the other believers, “Don’t worry. He is alive now.”"},{"num":11,"verse":"Then Paul went upstairs again, broke off some pieces of bread and ate. He spoke to them a long time. It was early morning when he finished, and then he left."},{"num":12,"verse":"The Lord’s followers took Eutychus home alive, and they were all greatly comforted."},{"header":"The Trip From Troas to Miletus"},{"num":13,"verse":"We went on ahead of Paul and sailed for the city of Assos, planning to meet him there. This is what he told us to do because he wanted to go by land."},{"num":14,"verse":"When he caught up with us at Assos, we took him on board, and we all sailed to Mitylene."},{"num":15,"verse":"The next day, we sailed away from there and came to a place near the island of Chios. Then the next day, we sailed to the island of Samos. A day later, we came to the city of Miletus."},{"num":16,"verse":"Paul had already decided not to stop at Ephesus. He did not want to stay too long in Asia. He was hurrying because he wanted to be in Jerusalem on the day of Pentecost if possible."},{"header":"Paul Speaks to the Elders From Ephesus"},{"num":17,"verse":"In Miletus Paul sent a message back to Ephesus, telling the elders of the church in Ephesus to come to him."},{"num":18,"verse":"When they came, Paul said to them, “You know about my life from the first day I came to Asia. You know the way I lived all the time I was with you."},{"num":19,"verse":"The Jews planned things against me, and this gave me much trouble. But you know that I always served the Lord, sometimes with tears. I never thought about myself first."},{"num":20,"verse":"I always did what was best for you. I told you the Good News about Jesus in public before the people and also taught in your homes."},{"num":21,"verse":"I told everyone—Jewish and non-Jewish people—to change and turn to God. I told them all to believe in our Lord Jesus."},{"num":22,"verse":"“But now I must obey the Spirit and go to Jerusalem. I don’t know what will happen to me there."},{"num":23,"verse":"I know only that in every city the Holy Spirit tells me that troubles and even jail wait for me."},{"num":24,"verse":"I don’t care about my own life. The most important thing is that I finish my work. I want to finish the work that the Lord Jesus gave me to do—to tell people the Good News about God’s grace."},{"num":25,"verse":"“And now listen to me. I know that none of you will ever see me again. All the time I was with you, I told you the Good News about God’s kingdom."},{"num":26,"verse":"So today I can tell you one thing that I am sure of: God will not blame me if some of you are not saved."},{"num":27,"verse":"I can say this because I know that I told you everything that God wants you to know."},{"num":28,"verse":"Be careful for yourselves and for all the people God has given you. The Holy Spirit gave you the work of caring for this flock. You must be shepherds to the church of God, the people he bought with his own blood."},{"num":29,"verse":"I know that after I leave, some men will come into your group. They will be like wild wolves and will try to destroy the flock."},{"num":30,"verse":"Also, men from your own group will begin to teach things that are wrong. They will lead some of the Lord’s followers away from the truth to follow them."},{"num":31,"verse":"So be careful! And always remember what I did during the three years I was with you. I never stopped reminding each one of you how you should live, counseling you day and night and crying over you."},{"num":32,"verse":"“Now I am putting you in God’s care. I am depending on the message about his grace to make you strong. That message is able to give you the blessings that God gives to all his holy people."},{"num":33,"verse":"When I was with you, I never wanted anyone’s money or fine clothes."},{"num":34,"verse":"You know that I always worked to take care of my own needs and the needs of the people who were with me."},{"num":35,"verse":"I always showed you that you should work just as I did and help people who are weak. I taught you to remember the words of the Lord Jesus: ‘You will have a greater blessing when you give than when you receive.’”"},{"num":36,"verse":"When Paul finished speaking, he knelt down, and they all prayed together."},{"num":37,"verse":"They cried and cried. They were especially sad because Paul had said they would never see him again. They hugged him and kissed him. Then they went with him to the ship to say goodbye."}]