[{"header":"Paul Goes to Macedonia and Greece"},{"num":20,"verse":"After the uproar ceased, Paul sent for the disciples and having exhorted them took leave of them and departed for Macedo′nia. "},{"num":2,"verse":"When he had gone through these parts and had given them much encouragement, he came to Greece. "},{"num":3,"verse":"There he spent three months, and when a plot was made against him by the Jews as he was about to set sail for Syria, he determined to return through Macedo′nia. "},{"num":4,"verse":"Sop′ater of Beroe′a, the son of Pyrrhus, accompanied him; and of the Thessalo′nians, Aristar′chus and Secun′dus; and Ga′ius of Derbe, and Timothy; and the Asians, Tych′icus and Troph′imus. "},{"num":5,"verse":"These went on and were waiting for us at Tro′as, "},{"num":6,"verse":"but we sailed away from Philippi after the days of Unleavened Bread, and in five days we came to them at Tro′as, where we stayed for seven days."},{"header":"Paul’s Farewell Visit to Troas"},{"num":7,"verse":"On the first day of the week, when we were gathered together to break bread, Paul talked with them, intending to depart on the morrow; and he prolonged his speech until midnight. "},{"num":8,"verse":"There were many lights in the upper chamber where we were gathered. "},{"num":9,"verse":"And a young man named Eu′tychus was sitting in the window. He sank into a deep sleep as Paul talked still longer; and being overcome by sleep, he fell down from the third story and was taken up dead. "},{"num":10,"verse":"But Paul went down and bent over him, and embracing him said, “Do not be alarmed, for his life is in him.” "},{"num":11,"verse":"And when Paul had gone up and had broken bread and eaten, he conversed with them a long while, until daybreak, and so departed. "},{"num":12,"verse":"And they took the lad away alive, and were not a little comforted."},{"header":"The Voyage from Troas to Miletus"},{"num":13,"verse":"But going ahead to the ship, we set sail for Assos, intending to take Paul aboard there; for so he had arranged, intending himself to go by land. "},{"num":14,"verse":"And when he met us at Assos, we took him on board and came to Mityle′ne. "},{"num":15,"verse":"And sailing from there we came the following day opposite Chi′os; the next day we touched at Samos; and the day after that we came to Mile′tus. "},{"num":16,"verse":"For Paul had decided to sail past Ephesus, so that he might not have to spend time in Asia; for he was hastening to be at Jerusalem, if possible, on the day of Pentecost."},{"header":"Paul Speaks to the Ephesian Elders"},{"num":17,"verse":"And from Mile′tus he sent to Ephesus and called to him the elders of the church. "},{"num":18,"verse":"And when they came to him, he said to them:"},{"header":"Paul’s Journey to Jerusalem"},{"num":19,"verse":"serving the Lord with all humility and with tears and with trials which befell me through the plots of the Jews; "},{"num":20,"verse":"how I did not shrink from declaring to you anything that was profitable, and teaching you in public and from house to house, "},{"num":21,"verse":"testifying both to Jews and to Greeks of repentance to God and of faith in our Lord Jesus Christ. "},{"num":22,"verse":"And now, behold, I am going to Jerusalem, bound in the Spirit, not knowing what shall befall me there; "},{"num":23,"verse":"except that the Holy Spirit testifies to me in every city that imprisonment and afflictions await me. "},{"num":24,"verse":"But I do not account my life of any value nor as precious to myself, if only I may accomplish my course and the ministry which I received from the Lord Jesus, to testify to the gospel of the grace of God. "},{"num":25,"verse":"And now, behold, I know that all you among whom I have gone about preaching the kingdom will see my face no more. "},{"num":26,"verse":"Therefore I testify to you this day that I am innocent of the blood of all of you, "},{"num":27,"verse":"for I did not shrink from declaring to you the whole counsel of God. "},{"num":28,"verse":"Take heed to yourselves and to all the flock, in which the Holy Spirit has made you guardians, to feed the church of the Lord which he obtained with his own blood. "},{"num":29,"verse":"I know that after my departure fierce wolves will come in among you, not sparing the flock; "},{"num":30,"verse":"and from among your own selves will arise men speaking perverse things, to draw away the disciples after them. "},{"num":31,"verse":"Therefore be alert, remembering that for three years I did not cease night or day to admonish every one with tears. "},{"num":32,"verse":"And now I commend you to God and to the word of his grace, which is able to build you up and to give you the inheritance among all those who are sanctified. "},{"num":33,"verse":"I coveted no one’s silver or gold or apparel. "},{"num":34,"verse":"You yourselves know that these hands ministered to my necessities, and to those who were with me. "},{"num":35,"verse":"In all things I have shown you that by so toiling one must help the weak, remembering the words of the Lord Jesus, how he said, ‘It is more blessed to give than to receive.’”"},{"num":36,"verse":"And when he had spoken thus, he knelt down and prayed with them all. "},{"num":37,"verse":"And they all wept and embraced Paul and kissed him, "},{"num":38,"verse":"sorrowing most of all because of the word he had spoken, that they should see his face no more. And they brought him to the ship."}]