[{"num":20,"verse":"When it was all over, Paul sent for the disciples, preached a farewell message to them, said good-bye and left for Greece, "},{"num":2,"verse":"preaching to the believers along the way in all the cities he passed through. "},{"num":3,"verse":"He was in Greece three months and was preparing to sail for Syria when he discovered a plot by the Jews against his life, so he decided to go north to Macedonia first."},{"num":4,"verse":"Several men were traveling with him, going as far as Turkey; they were Sopater of Berea, the son of Pyrrhus; Aristarchus and Secundus, from Thessalonica; Gaius, from Derbe; and Timothy; and Tychicus and Trophimus, who were returning to their homes in Turkey, "},{"num":5,"verse":"and had gone on ahead and were waiting for us at Troas. "},{"num":6,"verse":"As soon as the Passover ceremonies ended, we boarded ship at Philippi in northern Greece and five days later arrived in Troas, Turkey, where we stayed a week."},{"num":7,"verse":"On Sunday we gathered for a Communion service, with Paul preaching. And since he was leaving the next day, he talked until midnight! "},{"num":8,"verse":"The upstairs room where we met was lighted with many flickering lamps; "},{"num":9,"verse":"and as Paul spoke on and on, a young man named Eutychus, sitting on the windowsill, went fast asleep and fell three stories to his death below. "},{"num":10,"verse":"Paul went down and took him into his arms. “Don’t worry,” he said, “he’s all right!” And he was! What a wave of awesome joy swept through the crowd! They all went back upstairs and ate the Lord’s Supper together; then Paul preached another long sermon—so it was dawn when he finally left them!"},{"num":13,"verse":"Paul was going by land to Assos, and we went on ahead by ship. "},{"num":14,"verse":"He joined us there and we sailed together to Mitylene; "},{"num":15,"verse":"the next day we passed Chios; the next, we touched at Samos; and a day later we arrived at Miletus."},{"num":16,"verse":"Paul had decided against stopping at Ephesus this time, as he was hurrying to get to Jerusalem, if possible, for the celebration of Pentecost."},{"num":17,"verse":"But when we landed at Miletus, he sent a message to the elders of the church at Ephesus asking them to come down to the boat to meet him."},{"num":18,"verse":"When they arrived he told them, “You men know that from the day I set foot in Turkey until now "},{"num":19,"verse":"I have done the Lord’s work humbly—yes, and with tears—and have faced grave danger from the plots of the Jews against my life. "},{"num":20,"verse":"Yet I never shrank from telling you the truth, either publicly or in your homes. "},{"num":21,"verse":"I have had one message for Jews and Gentiles alike—the necessity of turning from sin to God through faith in our Lord Jesus Christ."},{"num":22,"verse":"“And now I am going to Jerusalem, drawn there irresistibly by the Holy Spirit, not knowing what awaits me, "},{"num":23,"verse":"except that the Holy Spirit has told me in city after city that jail and suffering lie ahead. "},{"num":24,"verse":"But life is worth nothing unless I use it for doing the work assigned me by the Lord Jesus—the work of telling others the Good News about God’s mighty kindness and love."},{"num":25,"verse":"“And now I know that none of you among whom I went about teaching the Kingdom will ever see me again. "},{"num":26,"verse":"Let me say plainly that no man’s blood can be laid at my door, "},{"num":27,"verse":"for I didn’t shrink from declaring all God’s message to you."},{"num":28,"verse":"“And now beware! Be sure that you feed and shepherd God’s flock—his church, purchased with his blood—for the Holy Spirit is holding you responsible as overseers. "},{"num":29,"verse":"I know full well that after I leave you, false teachers, like vicious wolves, will appear among you, not sparing the flock. "},{"num":30,"verse":"Some of you yourselves will distort the truth in order to draw a following. "},{"num":31,"verse":"Watch out! Remember the three years I was with you—my constant watchcare over you night and day and my many tears for you."},{"num":32,"verse":"“And now I entrust you to God and his care and to his wonderful words that are able to build your faith and give you all the inheritance of those who are set apart for himself."},{"num":33,"verse":"“I have never been hungry for money or fine clothing—"},{"num":34,"verse":"you know that these hands of mine worked to pay my own way and even to supply the needs of those who were with me. "},{"num":35,"verse":"And I was a constant example to you in helping the poor; for I remembered the words of the Lord Jesus, ‘It is more blessed to give than to receive.’”"},{"num":36,"verse":"When he had finished speaking, he knelt and prayed with them, "},{"num":37,"verse":"and they wept aloud as they embraced him in farewell, "},{"num":38,"verse":"sorrowing most of all because he said that he would never see them again. Then they accompanied him down to the ship."}]