[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 34:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall not their cattle and substance be ours",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? — Either for our use and benefit in the way of trade and commerce, or because they will descend to the issue of our children as well as theirs. Thus they cover their private designs with the specious show of public good.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34:20-31 The Shechemites submitted to the sacred rite, only to serve a turn, to please their prince, and to enrich themselves, and it was just with God to bring punishment upon them. As nothing secures us better than true religion, so nothing exposes us more than religion only pretended to. But Simeon and Levi were most unrighteous. Those who act wickedly, under the pretext of religion, are the worst enemies of the truth, and harden the hearts of many to destruction. The crimes of others form no excuse for us. Alas! how one sin leads on to another, and, like flames of fire, spread desolation in every direction! Foolish pleasures lead to seduction; seduction produces wrath; wrath thirsts for revenge; the thirst of revenge has recourse to treachery; treachery issues in murder; and murder is followed by other lawless actions. Were we to trace the history of unlawful commerce between the sexes, we should find it, more than any other sin, ending in blood.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hamor and Shekem accept the terms, and immediately proceed to carry them into effect. It is testified of Shekem, that he delayed not to do the thing, and that he was more honorable than all his house. They bring the matter before their fellow-citizens, and urge them to adopt the rite of circumcision, on the ground that the men are peaceable, well-conducted, and they and their cattle and goods would be a valuable addition to the common wealth of their tribe. Hence, it appears that the population was still thin, that the neighboring territory was sufficient for a much larger number than its present occupants, and that a tribe found a real benefit in an accession to his numbers. The people were persuaded to comply with the terms proposed. There is nothing said here of the religious import of the rite, or of any diversity of worship that may have existed between the two parties. But it is not improbable that the Shekemites were prepared for mutual toleration, or even for the adoption of the religion of Israel in its external forms, though not perhaps to the exclusion of their own hereditary customs. It is also possible that the formal acknowledgment of the one true God was not yet extinct. Circumcision has been in use among the Egyptians, Colchians (Herodotus ii. 104), and other eastern nations; but when and how introduced we are not informed. The present narrative points out one way in which it may have spread from nation to nation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. Hamor and Shechem … came unto the gate of their city—That was the place where every public communication was made; and in the ready obsequious submission of the people to this measure we see an evidence either of the extraordinary affection for the governing family, or of the abject despotism of the East, where the will of a chief is an absolute command.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall not their substance be ours?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Either for our use and benefit in the way of commerce and trade; or because they will descend to the issue of our children as well as theirs; or because we being more numerous and potent than they, can easily overrule them, and when we think meet, dispose all things to our own advantage. Thus they cover their private design with the specious show of public good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall not their cattle, and their substance, and every beast of theirs, be ours?.... Which would in course come into their families in process of time, by intermarrying with them, or, being more numerous and powerful than they, could seize upon them when they pleased, and take all they had: thus they argue from the profit and advantage that would accrue to them by admitting them among them, upon their terms; and this argument, taken from worldly interest, they knew would have great influence upon them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "only let us consent unto them; in the affair of circumcision: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they will dwell with us; and what by trading with them, and marrying among them, all their wealth and riches will come into our hands. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they will dwell with us; and what by trading with them, and marrying among them, all their wealth and riches will come into our hands. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Shall not {h} their cattle and their substance and every beast of theirs be ours? only let us consent unto them, and they will dwell with us.",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "Shall",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " their cattle and their substance and every beast of theirs ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ours? only let us consent unto them, and they will dwell with us.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Thus they do not lack any form of perversion, who prefer their own convenience before the common good.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cattle … substance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It would be a good business transaction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 34:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The condition seemed reasonable to the two suitors, and by way of setting a good example, \"the young man did not delay to do this word,\" i.e., to submit to circumcision, \"as he was honoured before all his father's house.\" This is stated by anticipation in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 34:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but before submitting to the operation, he went with his father to the gate, the place of public assembly, to lay the matter before the citizens of the town. They knew so well how to make the condition palatable, by a graphic description of the wealth of Jacob and his family, and by expatiating upon the advantages of being united with them, that the Shechemites consented to the proposal. שׁלמים: integri, people whose bearing is unexceptionable. \"And the land, behold broad on both sides it is before them,\" i.e., it offers space enough in every direction for them to wander about with their flocks. And then the gain: \"Their cattle, and their possessions, and their beasts of burden...shall they not be ours?\" מקנה is used here for flocks and herds, בּהמה for beasts of burden, viz., camels and asses (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 32:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But notwithstanding the advantages here pointed out, the readiness of all the citizens of Shechem (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to consent to be circumcised, could only be satisfactorily explained from the fact that this religious rite was already customary in different nations (according to Herod. 2, 104, among the Egyptians and Colchians), as an act of religious or priestly consecration. ",
        "children": []
      }
    ]
  }
]