[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(30) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye have troubled me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Jacob’s timidity led him to think first of the danger that would result from the conduct of his sons, and only afterwards of the cruelty and treacherousness of their deed. He commented upon this on his dying bed in words of fitting reprobation, but his reproof now is singularly weak, and the retort of his sons just. If the danger were all, this could have no weight when a shameful wrong had been done; but in avenging this wrong they had committed a crime of a deeper dye",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 34:30",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:30",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ye have troubled me, to make me to stink ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, you have rendered me and my family odious among the inhabitants of the land. Abraham and Isaac had been much respected, though strangers in the country, and their wise, righteous, and benevolent conduct, and that of their families, had gained honour to their religion: but Jacob was apprehensive, and not without reason, that these shameful proceedings of his sons would cause him and his religion to be execrated among these Canaanites, whose crimes they had exceeded. Well might he say, they had ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "troubled him! ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Well might he always keep their conduct in remembrance and mention it with indignation on his death-bed, for nothing could be more treacherous, base, and cruel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I shall be destroyed, I and my house — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Indeed, what else could he expect, but that, numerous and formidable as the Canaanites were, they would unite together against him, and that he and his little family would be an easy prey to them? He knew, indeed, that God had promised to preserve his house; but he might justly fear that these vile practices of his children would amount to a forfeiture, and cut off the entail. When sin is in the house, there is reason to fear ruin at the door.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34:20-31 The Shechemites submitted to the sacred rite, only to serve a turn, to please their prince, and to enrich themselves, and it was just with God to bring punishment upon them. As nothing secures us better than true religion, so nothing exposes us more than religion only pretended to. But Simeon and Levi were most unrighteous. Those who act wickedly, under the pretext of religion, are the worst enemies of the truth, and harden the hearts of many to destruction. The crimes of others form no excuse for us. Alas! how one sin leads on to another, and, like flames of fire, spread desolation in every direction! Foolish pleasures lead to seduction; seduction produces wrath; wrath thirsts for revenge; the thirst of revenge has recourse to treachery; treachery issues in murder; and murder is followed by other lawless actions. Were we to trace the history of unlawful commerce between the sexes, we should find it, more than any other sin, ending in blood.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Simon and Levi, at the head no doubt of all their father's men, now fall upon the Shekemites, when feverish with the circumcision, and put them to the sword. Simon and Levi were the sons of Leah, and therefore, full brothers of Dinah. If Dinah was of the same year as Joseph, they would be respectively seven and six years older than she was. If she was in her thirteenth year, they would therefore, be respectively in their twentieth and nineteenth years, and therefore, suited by age and passion for such an enterprise. All the sons of Jacob joined in the sacking of the city. They seized all their cattle and goods, and made captives of their wives and little ones. Jacob is greatly distressed by this outrage, which is equally contrary to his policy and his humanity. He sets before his sons, in this expostulation, the danger attendant upon such a proceeding. The \"Kenaanite and the Perizzite,\" whom Abraham found in the land on his return from Egypt ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"I am a few men\" - men of number that might easily be counted. I here denotes the family or tribe with all its dependents. When expanded, therefore, it is, \"I and my house.\" Simon and Levi have their reply. It justifies the retribution which has fallen on the Shekemites for this and all their other crimes. But it does not justify the executioners for taking the law into their own hands, or proceeding by fraud and indiscriminate slaughter. The employment of circumcision, too, which was the sign of the covenant of grace, as a means of deception, was a heinous aggravation of their offence. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - The Death of Isaac",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "8. דברה  deborâh, Deborah, \"bee.\" בּכוּת אלּון  'alôn-bākût, Allon-bakuth, \"oak of weeping.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16. כברה  kı̂brâh, \"length stretch.\" A certain but unknown distance, a stadium or furlong (Josephus) a hippodrome (Septuagint) which was somewhat longer, a mile (Kimchi). אפרת  'ephrâth, Ephrath, \"fruitful or ashy.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18. בן־אוני  ben-'ônı̂y, Ben-oni, \"son of my pain.\" בנימין  bı̂nyāmı̂yn, Binjamin, \"son of the right hand.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19. לחם בית  bēyt-lechem, Beth-lechem, \"house of bread.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21. עדר  ‛ěder, 'Eder, \"flock, fold.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This chapter contains the return of Jacob to his father's house, and then appends the death of Isaac.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This chapter contains the return of Jacob to his father's house, and then appends the death of Isaac.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30. Jacob said … Ye have troubled me—This atrocious outrage perpetrated on the defenseless citizens and their families made the cup of Jacob's affliction overflow. We may wonder that, in speaking of it to his sons, he did not represent it as a heinous sin, an atrocious violation of the laws of God and man, but dwelt solely on the present consequences. It was probably because that was the only view likely to rouse the cold-blooded apathy, the hardened consciences of those ruffian sons. Nothing but the restraining power of God saved him and his family from the united vengeance of the people (compare Ge 35:5). All his sons had not been engaged in the massacre. Joseph was a boy, Benjamin not yet born, and the other eight not concerned in it. Simeon and Levi alone, with their retainers, had been the guilty actors in the bloody tragedy. But the Canaanites would not be discriminating in their vengeance; and if all the Shechemites were put to death for the offense of their chief's son, what wonder if the natives should extend their hatred to all the family of Jacob; and who probably equalled, in number, the inhabitants of that village.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " You have not only discomposed my mind, but perplexed my affairs, and brought me into such troubles and dangers as I am never likely to escape. You have made me odious to ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the inhabitants of the land, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who will impute this perfidious and bloody fact to my contrivance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Few in number; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men of number, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. few; for such can easily be numbered. So this phrase is used ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 4:27 33:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 4:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 33:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", opposite to which are men ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "without number, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Chronicles 12:3",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 12:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall slay me:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he could expect no other in human reason, and they were hindered from so doing only by the hand of the great God smiting them with terror, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 35:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jacob said to Simeon and Levi,.... who were the principals concerned in this affair: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ye have troubled me; because of the sin they had committed, because of the dishonour brought upon religion, and because of the danger he and his family were hereby exposed unto; it greatly disquieted him, made him very uneasy, he was at his wit's end almost, knew not what to do, what course to take to wipe off the scandal, and to defend himself and family; since it served, he says: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to make me to stink among the inhabitants of the land; to make him odious and abominable, to be hated and abhorred by all the people round about, and to be looked upon and treated as a deceitful, treacherous, and perfidious man, that had no regard to his word, to covenants and agreements made by him; as a cruel and bloodthirsty man that spared none, made no difference between the innocent and the guilty; and as a robber and plunderer, that stopped at nothing, committing the greatest outrages to get possession of the substance of others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "amongst the Canaanites and the Perizzites: who were the principal inhabitants of the land, the most numerous, and the most rustic and barbarous, and perhaps nearest, and from whom Jacob had most to fear: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I being few in number; or men of number (p); he and his sons and servants, in all, making but a small number in comparison of the nations about him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall gather themselves together against me, and slay me; and I shall be destroyed, I and my house; not that Jacob was afraid that this would be really the case, for he knew and believed the promises of God to him, of the multiplication of his seed, and of their inheriting the land of Canaan, and of the Messiah springing from him; but this he said to aggravate the sin and folly of his sons, in exposing him and themselves to so much danger, which not only on the face of things appeared probable, but even certain and inevitable, without the interposition of divine power and Providence. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(p)  \"viri numeri\", Montanus, Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p)  \"viri numeri\", Montanus, Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jacob said to Simeon and Levi, Ye have troubled me to make me to stink among the inhabitants of the land, among the Canaanites and the Perizzites: and I being few in number, they shall gather themselves together against me, and slay me; and I shall be destroyed, I and my house.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Jacob",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] This and the following verse continue the narrative of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 34:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jacob reproaches his two sons for the murder, on account of which the people of the land will be infuriated with Jacob and his house. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:5-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "troubled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The same word used in the story of Achan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 6:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 7:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jacob’s rebuke turns, not so much upon the dastardly treachery and cruelty of his sons, as upon the evil effects it will produce, and upon the insecurity it will bring upon himself and his house.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "make me to stink",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A common Heb. metaphor: cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“make savour to be abhorred”); ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“had in abomination”), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 27:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“made … abhor”); ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“made … odious”).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Canaanites and the Perizzites",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "being few in number",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 30.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Jacob said to Simeon and Levi, Ye have troubled me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " brought trouble upon me) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "to make me to stink",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - or, to cause me to become hateful; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μισητόν με",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πεποιήκατε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (LXX.) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "among the inhabitants of the land, among the Canaanites and the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Perizzites",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". with my attendants) being ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "few in number",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "men of number, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that can be easily numbered, a small band (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 105",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".. 12; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 44:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - they (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and they",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall gather themselves together against me, and slay me; and I shall be destroyed, I and my house.",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "shall gather themselves together against me, and slay me; and I shall be destroyed, I and my house.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That Jacob should have spoken to his sons only of his own danger, and not of their guilt, has been ascribed to his belief that this was the only motive which their carnal minds could understand (Keil, Gerlach); to a remembrance of his own deceitfulness, which disqualified him in a measure from being the censor of his sons (Kalisch, Wordsworth); to the lowered moral and spiritual tone of his own mind (Candlish, 'Speaker's Commentary'); to the circumstance that, having indulged his children in their youth, be was now afraid to reprove them (Inglis). That Jacob afterwards attained to a proper estimate of their bloody deed his last prophetic utterance reveals (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:5-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). By some it is supposed that he even now felt the crime in all its heinousness (Kalisch), though his reproach was somewhat leniently expressed in the word \"trouble\" (Lange); while others, believing Jacob's abhorrence of his sons' fanatical cruelty to have been deep and real, account for its omission by the historian on the ground that he aimed merely at showing \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " protection of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), through which Jacob escaped the evil consequences of their conduct\" (Hengstenberg, Kurtz). Genesis 34:30",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob reproved the originators of this act most severely for their wickedness: \"Ye have brought me into trouble (conturbare), to make me stink (an abomination) among the inhabitants of the land;...and yet I((with my attendants) am a company that can be numbered (lit., people of number, easily numbered, a small band, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and if they gather together against me, they will slay me,\" etc. If Jacob laid stress simply upon the consequences which this crime was likely to bring upon himself and his house, the reason was, that this was the view most adapted to make an impression upon his sons. For his last words concerning Simeon and Levi (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:5-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are a sufficient proof that the wickedness of their conduct was also an object of deep abhorrence. And his fear was not groundless. Only God in His mercy averted all the evil consequences from Jacob and his house (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But his sons answered, \"Are they to treat our sister like a harlot?\" עשׂה: as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. Their indignation was justifiable enough; and their seeking revenge, as Absalom avenged the violation of his sister on Amnon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 13:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), was in accordance with the habits of nomadic tribes. In this way, for example, seduction is still punished by death among the Arabs, and the punishment is generally inflicted by the brothers (cf. Niebuhr, Arab. p. 39; Burckhardt, Syr. p. 361, and Beduinen, p. 89, 224-5). In addition to this, Jacob's sons looked upon the matter not merely as a violation of their sister's chastity, but as a crime against the peculiar vocation of their tribe. But for all that, the deception they practised, the abuse of the covenant sign of circumcision as a means of gratifying their revenge, and the extension of that revenge to the whole town, together with the plundering of the slain, were crimes deserving of the strongest reprobation. The crafty character of Jacob degenerated into malicious cunning in Simeon and Levi; and jealousy for the exalted vocation of their family, into actual sin. This event \"shows us in type all the errors into which the belief in the pre-eminence of Israel was sure to lead in the course of history, whenever that belief was rudely held by men of carnal minds\" (O. v. Gerlach). ",
        "children": []
      }
    ]
  }
]