[{"num":12,"verse":"Don’t let the excitement of being young cause you to forget about your Creator. Honor him in your youth before the evil years come—when you’ll no longer enjoy living. "},{"num":2,"verse":"It will be too late then to try to remember him when the sun and light and moon and stars are dim to your old eyes, and there is no silver lining left among your clouds. "},{"num":3,"verse":"For there will come a time when your limbs will tremble with age, your strong legs will become weak, and your teeth will be too few to do their work, and there will be blindness too. "},{"num":4,"verse":"Then let your lips be tightly closed while eating when your teeth are gone! And you will waken at dawn with the first note of the birds; but you yourself will be deaf and tuneless, with quavering voice. "},{"num":5,"verse":"You will be afraid of heights and of falling—a white-haired, withered old man, dragging himself along: without sexual desire, standing at death’s door, and nearing his everlasting home as the mourners go along the streets."},{"num":6,"verse":"Yes, remember your Creator now while you are young—before the silver cord of life snaps and the gold bowl is broken; before the pitcher is broken at the fountain and the wheel is broken at the cistern; "},{"num":7,"verse":"then the dust returns to the earth as it was, and the spirit returns to God who gave it. "},{"num":8,"verse":"All is futile, says the Preacher; utterly futile."},{"num":9,"verse":"But then, because the Preacher was wise, he went on teaching the people all he knew; and he collected proverbs and classified them. "},{"num":10,"verse":"For the Preacher was not only a wise man but a good teacher; he not only taught what he knew to the people, but taught them in an interesting manner. "},{"num":11,"verse":"The wise man’s words are like goads that spur to action. They nail down important truths. Students are wise who master what their teachers tell them."},{"num":12,"verse":"But, my son, be warned: there is no end of opinions ready to be expressed. Studying them can go on forever and become very exhausting!"},{"num":13,"verse":"Here is my final conclusion: fear God and obey his commandments, for this is the entire duty of man. "},{"num":14,"verse":"For God will judge us for everything we do, including every hidden thing, good or bad."}]