[{"header":"Jesus Teaches at the Feast"},{"num":7,"verse":"After this, Jesus walked [from place to place] in Galilee, for He would not walk in Judea because the Jews were seeking to kill Him. "},{"num":2,"verse":"Now the Jewish Feast of Tabernacles (Booths) was approaching. "},{"num":3,"verse":"So His brothers said to Him, “Leave here and go to Judea, so that Your disciples [there] may also see the works that You do. "},{"num":4,"verse":"No one does anything in secret when he wants to be known publicly. If You [must] do these things, show Yourself openly to the world and make Yourself known!” "},{"num":5,"verse":"For not even His brothers believed in Him. "},{"num":6,"verse":"So Jesus said to them, “My time has not yet come; but any time is right for you. "},{"num":9,"verse":"Having said these things to them, He stayed behind in Galilee."},{"num":10,"verse":"But [afterward], when His brothers had gone up to the feast, He went up too, not publicly [with a caravan], but quietly [because He did not want to be noticed]. "},{"num":11,"verse":"So the Jews kept looking for Him at the feast and asking, “Where is He?” "},{"num":12,"verse":"There was a lot of whispered discussion and murmuring among the crowds about Him. Some were saying, “He is a good man”; others said, “No, on the contrary, He misleads the people [giving them false ideas].” "},{"num":13,"verse":"Yet no one was speaking out openly and freely about Him for fear of [the leaders of] the Jews."},{"num":14,"verse":"When the feast was already half over, Jesus went up into the temple [court] and began to teach. "},{"num":15,"verse":"Then the Jews were perplexed. They said, “How did this man become learned [so versed in the Scriptures and theology] without formal training?” "},{"num":16,"verse":"Jesus answered them by saying, “My teaching is not My own, but His who sent Me. "},{"num":20,"verse":"The crowd answered, “You have a demon [You are out of Your mind]! Who wants to kill You?” "},{"num":21,"verse":"Jesus replied, “I did one work, and you are all astounded. "},{"num":25,"verse":"Then some of the people of Jerusalem said, “Is this not the Man they want to kill? "},{"num":26,"verse":"Look, He is speaking publicly, and they say nothing to Him! Is it possible that the rulers really know that this is the Christ? "},{"num":27,"verse":"But we know where this Man is from; whenever the Christ comes, no one will know where He is from.” "},{"num":28,"verse":"Then Jesus called out as He taught in the temple, “You know Me and know where I am from; and I have not come on my own initiative [as self-appointed], but He who sent Me is true, and Him you do not know. "},{"num":30,"verse":"So they were eager to arrest Him; but no one laid a hand on Him, because His time had not yet come. "},{"num":31,"verse":"But many from the crowd believed in Him. And they kept saying, “When the Christ comes, will He do more signs and exhibit more proofs than this Man?”"},{"num":32,"verse":"The Pharisees heard the crowd muttering these things [under their breath] about Him, and the chief priests and Pharisees sent guards to arrest Him. "},{"num":33,"verse":"Therefore Jesus said, “For a little while longer I am [still] with you, and then I go to Him who sent Me. "},{"num":35,"verse":"Then the Jews said among themselves, “Where does this Man intend to go that we will not find Him? Does He intend to go to the Dispersion [of Jews scattered and living] among the Greeks, and teach the Greeks? "},{"num":36,"verse":"What does this statement of His mean, ‘You will look for Me, and will not [be able to] find Me; and where I am, you cannot come’?”"},{"num":37,"verse":"Now on the last and most important day of the feast, Jesus stood and called out [in a loud voice], “If anyone is thirsty, let him come to Me and drink! "},{"num":39,"verse":"But He was speaking of the [Holy] Spirit, whom those who believed in Him [as Savior] were to receive afterward. The Spirit had not yet been given, because Jesus was not yet glorified (raised to honor)."},{"header":"Division of People over Jesus"},{"num":40,"verse":"Listening to these words, some of the people said, “This is certainly the Prophet!” "},{"num":41,"verse":"Others said, “This is the Christ (the Messiah, the Anointed)!” But others said, “Surely the Christ is not going to come out of Galilee, is He? "},{"num":42,"verse":"Does the Scripture not say that the Christ comes from the descendants of David, and from Bethlehem, the village where David lived?” "},{"num":43,"verse":"So the crowd was divided because of Him. "},{"num":44,"verse":"Some of them wanted to arrest Him, but no one laid hands on Him."},{"num":45,"verse":"Then the guards went [back] to the chief priests and Pharisees, who asked them, “Why did you not bring Him [here with you]?” "},{"num":46,"verse":"The guards replied, “Never [at any time] has a man talked the way this Man talks!” "},{"num":47,"verse":"Then the Pharisees said to them, “Have you also been deluded and swept off your feet? "},{"num":48,"verse":"Has any of the rulers or Pharisees believed in Him? "},{"num":49,"verse":"But this [ignorant, contemptible] crowd that does not know the Law is accursed and doomed!” "},{"num":50,"verse":"Nicodemus (the one who came to Jesus before and was one of them) asked, "},{"num":51,"verse":"“Does our Law convict someone without first giving him a hearing and finding out what he is [accused of] doing?” "},{"num":52,"verse":"They responded, “Are you also from Galilee? Search [and read the Scriptures], and see [for yourself] that no prophet comes from Galilee!” "},{"num":53,"verse":"[And everyone went to his own house."}]