[{"header":"Jesus goes to the Festival of Tabernacles"},{"num":7,"verse":"After this, Jesus went around in Galilee. He did not want to go about in Judea because the Jewish leaders there were looking for a way to kill him. "},{"num":2,"verse":"But when the Jewish Festival of Tabernacles was near, "},{"num":3,"verse":"Jesus’ brothers said to him, ‘Leave Galilee and go to Judea, so that your disciples there may see the works you do. "},{"num":4,"verse":"No one who wants to become a public figure acts in secret. Since you are doing these things, show yourself to the world.’ "},{"num":5,"verse":"For even his own brothers did not believe in him."},{"num":6,"verse":"Therefore Jesus told them, ‘My time is not yet here; for you any time will do. "},{"num":7,"verse":"The world cannot hate you, but it hates me because I testify that its works are evil. "},{"num":8,"verse":"You go to the festival. I am not going up to this festival, because my time has not yet fully come.’ "},{"num":9,"verse":"After he had said this, he stayed in Galilee."},{"num":10,"verse":"However, after his brothers had left for the festival, he went also, not publicly, but in secret. "},{"num":11,"verse":"Now at the festival the Jewish leaders were watching for Jesus and asking, ‘Where is he?’"},{"num":12,"verse":"Among the crowds there was widespread whispering about him. Some said, ‘He is a good man.’"},{"num":13,"verse":"But no one would say anything publicly about him for fear of the leaders."},{"header":"Jesus teaches at the festival"},{"num":14,"verse":"Not until halfway through the festival did Jesus go up to the temple courts and begin to teach. "},{"num":15,"verse":"The Jews there were amazed and asked, ‘How did this man get such learning without having been taught?’"},{"num":16,"verse":"Jesus answered, ‘My teaching is not my own. It comes from the one who sent me. "},{"num":17,"verse":"Anyone who chooses to do the will of God will find out whether my teaching comes from God or whether I speak on my own. "},{"num":18,"verse":"Whoever speaks on their own does so to gain personal glory, but he who seeks the glory of the one who sent him is a man of truth; there is nothing false about him. "},{"num":19,"verse":"Has not Moses given you the law? Yet not one of you keeps the law. Why are you trying to kill me?’"},{"num":20,"verse":"‘You are demon-possessed,’ the crowd answered. ‘Who is trying to kill you?’"},{"num":21,"verse":"Jesus said to them, ‘I did one miracle, and you are all amazed. "},{"num":22,"verse":"Yet, because Moses gave you circumcision (though actually it did not come from Moses, but from the patriarchs), you circumcise a boy on the Sabbath. "},{"num":23,"verse":"Now if a boy can be circumcised on the Sabbath so that the law of Moses may not be broken, why are you angry with me for healing a man’s whole body on the Sabbath? "},{"num":24,"verse":"Stop judging by mere appearances, but instead judge correctly.’"},{"header":"Division over who Jesus is"},{"num":25,"verse":"At that point some of the people of Jerusalem began to ask, ‘Isn’t this the man they are trying to kill? "},{"num":26,"verse":"Here he is, speaking publicly, and they are not saying a word to him. Have the authorities really concluded that he is the Messiah? "},{"num":27,"verse":"But we know where this man is from; when the Messiah comes, no one will know where he is from.’"},{"num":28,"verse":"Then Jesus, still teaching in the temple courts, cried out, ‘Yes, you know me, and you know where I am from. I am not here on my own authority, but he who sent me is true. You do not know him, "},{"num":29,"verse":"but I know him because I am from him and he sent me.’"},{"num":30,"verse":"At this they tried to seize him, but no one laid a hand on him, because his hour had not yet come. "},{"num":31,"verse":"Still, many in the crowd believed in him. They said, ‘When the Messiah comes, will he perform more signs than this man?’"},{"num":32,"verse":"The Pharisees heard the crowd whispering such things about him. Then the chief priests and the Pharisees sent temple guards to arrest him."},{"num":33,"verse":"Jesus said, ‘I am with you for only a short time, and then I am going to the one who sent me. "},{"num":34,"verse":"You will look for me, but you will not find me; and where I am, you cannot come.’"},{"num":35,"verse":"The Jews said to one another, ‘Where does this man intend to go that we cannot find him? Will he go where our people live scattered among the Greeks, and teach the Greeks? "},{"num":36,"verse":"What did he mean when he said, “You will look for me, but you will not find me,” and “Where I am, you cannot come”?’"},{"num":37,"verse":"On the last and greatest day of the festival, Jesus stood and said in a loud voice, ‘Let anyone who is thirsty come to me and drink. "},{"num":38,"verse":"Whoever believes in me, as Scripture has said, rivers of living water will flow from within them.’ "},{"num":39,"verse":"By this he meant the Spirit, whom those who believed in him were later to receive. Up to that time the Spirit had not been given, since Jesus had not yet been glorified."},{"num":40,"verse":"On hearing his words, some of the people said, ‘Surely this man is the Prophet.’"},{"num":41,"verse":"Others said, ‘He is the Messiah.’"},{"num":42,"verse":"Does not Scripture say that the Messiah will come from David’s descendants and from Bethlehem, the town where David lived?’ "},{"num":43,"verse":"Thus the people were divided because of Jesus. "},{"num":44,"verse":"Some wanted to seize him, but no one laid a hand on him."},{"header":"Unbelief of the Jewish leaders"},{"num":45,"verse":"Finally the temple guards went back to the chief priests and the Pharisees, who asked them, ‘Why didn’t you bring him in?’"},{"num":46,"verse":"‘No one ever spoke the way this man does,’ the guards replied."},{"num":47,"verse":"‘You mean he has deceived you also?’ the Pharisees retorted. "},{"num":48,"verse":"‘Have any of the rulers or of the Pharisees believed in him? "},{"num":49,"verse":"No! But this mob that knows nothing of the law – there is a curse on them.’"},{"num":50,"verse":"Nicodemus, who had gone to Jesus earlier and who was one of their own number, asked, "},{"num":51,"verse":"‘Does our law condemn a man without first hearing him to find out what he has been doing?’"},{"num":52,"verse":"They replied, ‘Are you from Galilee, too? Look into it, and you will find that a prophet does not come out of Galilee.’"}]