[{"num":7,"verse":"And after these things Rebbe, Melech HaMoshiach itinerated in the Galil, for he was not wanting to move about in Yehudah, because those of Yehudah were seeking to kill him."},{"num":2,"verse":"Now the Chag of Sukkot was near. [VAYIKRA 23:34; DEVARIM 16:16]"},{"num":3,"verse":"His achim then said to him, Leave here and go away into the land of Yehudah, that also your talmidim will see your ma’asim which you do."},{"num":4,"verse":"For no one who seeks public notice does anything besod (secretly). If these things you do, then manifest yourself to HaOlam."},{"num":5,"verse":"For not even the achim of Rebbe, Melech HaMoshiach were believing in him. [TEHILLIM 69:8]"},{"num":6,"verse":"Therefore, Rebbe, Melech HaMoshiach says to them, My sha’ah has not yet come, but your time is always ready."},{"num":7,"verse":"The Olam Hazeh is not capable of sin’ah (hatred) toward you, but the Olam Hazeh hates me, and for this reason: I give solemn edut (testimony) about it because the ma’asim of the Olam Hazeh are ra’'im (evil)."},{"num":8,"verse":"You make aliyah leregel up to the Chag (Feast). I am not going up to this Chag (Feast), because my time has not yet been fulfilled."},{"num":9,"verse":"And having said these things, Rebbe, Melech HaMoshiach remained in the Galil."},{"num":10,"verse":"But when the achim of him made aliyah leregel to the Chag (Feast), then also Rebbe, Melech HaMoshiach went up [Yochanan 5:30] not publicly but besod (secretly)."},{"num":11,"verse":"Then those of Yehudah were seeking Rebbe, Melech HaMoshiach in the Chag (Feast) and were saying, Where is that man?"},{"num":12,"verse":"And there was much telunnah (murmuring) about Rebbe, Melech HaMoshiach among the multitudes. Some were saying, He is tov (good), but others were saying, Lo (no), he deceives the multitude."},{"num":13,"verse":"No one, however, was speaking openly about Rebbe, Melech HaMoshiach because of the fear of those of Yehudah."},{"num":14,"verse":"But around the middle period of the Chag (Feast), Rebbe, Melech HaMoshiach went up to the Beis Hamikdash and was saying shiurim (teaching torah)."},{"num":15,"verse":"Therefore, those of Yehudah were marveling, saying, How has this man binah (understanding) of a Yeshiva yode’a sefer (scholar), not having learned?"},{"num":16,"verse":"Therefore, in reply, Rebbe, Melech HaMoshiach said, My Torah (teaching) is not mine but of the One having sent me."},{"num":17,"verse":"If anyone wants to do the ratzon Hashem, he will have da’as about my Torah, whether it is of Hashem or I speak only from myself. [TEHILLIM 25:14; 92:16; BAMIDBAR 16:28]"},{"num":18,"verse":"The one speaking from himself seeks his own kavod (glory), but he who is seeking the kavod of the One having sent him, this one is ne’eman and there is no avlah (injustice) in him."},{"num":19,"verse":"Has not Moshe given you the Torah? None of you is able to be shomer chukkat Torah. Why are you seeking to kill me? [DEVARIM 32:46; MISHLE 20:9; KOHELET 7:20; YESHAYAH 53:6]"},{"num":20,"verse":"The multitude said, You have a shed (demon). Who is seeking to kill you?"},{"num":21,"verse":"In reply, Rebbe, Melech HaMoshiach said to them, Of the Pe’ulot of Hashem, I accomplished echad, one pe’ulah, and everyone marvels."},{"num":22,"verse":"Moshe has given you bris milah not that bris milah is of Moshe, but it is of the Avot, and on a Shabbos you perpetually perform bris milah. [BERESHIS 17:10-14; 21:4; VAYIKRA 12:3]"},{"num":23,"verse":"If a man receives bris milah on Shabbos and lo tufar Torat Moshe (the Torah of Moses may not be broken, BERESHIS 17:14) are you angry with me because I gave a man refu’ah shleimah on Shabbos?"},{"num":24,"verse":"Do not judge according to appearance but judge with mishpat tzedek. [ZECHARYAH 7:9; SHMUEL ALEF 16:7; YESHAYAH 11:3 4; VAYIKRA 19:15]"},{"num":25,"verse":"Therefore, some of the ones of Yerushalayim were saying, Is it not this man whom they are seeking to kill?"},{"num":26,"verse":"And, hinei, he speaks publicly and they say nothing to him. Perhaps the manhigim (the gedolim of Judaism) have da’as that this man is the Rebbe, Melech HaMoshiach?"},{"num":27,"verse":"But this man, we have da’as where he is from; but the Rebbe, Melech HaMoshiach, whenever he comes, no one has da’as where he is from."},{"num":28,"verse":"Therefore, in the Beis Hamikdash while teaching, Rebbe, Melech HaMoshiach cried out, saying, You have da’as of me, and you have da’as of where I am from. I have not come on my own, but the One Who sent me is ne’eman. He is the One of Whom you do not have da’as."},{"num":29,"verse":"I have da’as of Him, because from Him Ani Hu, and He is the One Who sent me."},{"num":30,"verse":"Therefore, they were seeking to arrest him, and no one laid a hand on him, because his sha’ah (hour, time) had not yet come."},{"num":31,"verse":"From the multitude, however, many put their emunah, their bitachon, in him, and were saying, The Rebbe, Melech HaMoshiach, whenever he comes, surely he will not do more otot (miraculous signs) than the things which this man did?"},{"num":32,"verse":"The Perushim heard the telunnah (murmuring) of these things from the multitude, the talk about Rebbe, Melech HaMoshiach, and they sent the Rashei Hakohanim and the mesharetim of the Perushim that they might arrest him."},{"num":33,"verse":"Therefore, he said, Yet a little time I am with you and I go away to the One having sent me."},{"num":34,"verse":"You will seek me and not find me and where Ani Hu you are not able to come."},{"num":35,"verse":"Therefore, those of Yehudah said to themselves, Where is this man about to journey that we will not find him? Surely he is not about to sojourn to the Golus of the Yevanim (Greeks) to teach the Yevanim? [MISHLE 1:28]"},{"num":36,"verse":"What is this dvar which he said, You will seek me and will not find me and where Ani Hu, you are not able to come?"},{"num":37,"verse":"Now on the last day of the Chag, Hoshana Rabbah, Rebbe, Melech HaMoshiach cried out, saying, If anyone thirsts let him come to me and drink. [Lv 23:36; Isa 55:1; 12:3; 49:10]"},{"num":38,"verse":"The one with emunah in me, as the Kitvei Hakodesh said, ‘Out of the midst of him, rivers of MAYIM CHAYYIM [Zech 14:8] will flow.’ [Prov 18:4; Isa 44:3; 58:11; 43:19f, Ezek 47:1-12; Joel 4:18; Song 4:15]."},{"num":39,"verse":"But this he said about the Ruach Hakodesh which the ones having emunah (faith) in him were about to receive, for the Ruach Hakodesh had not yet been given, because he had not yet received kavod. [YOEL 2:28 (3:1)]"},{"num":40,"verse":"Some of the multitude, therefore, having heard these dvarim were saying, This man is beemes the Navi."},{"num":41,"verse":"Others were saying, This man is the Rebbe, Melech HaMoshiach. But some were saying, Surely the Rebbe, Melech HaMoshiach comes not from the Galil, does he?"},{"num":42,"verse":"Has not the Kitvei Hakodesh said that the Rebbe, Melech HaMoshiach is from the zera Dovid and from Beit-Lechem, the shtetl where Dovid lived? [2Sm 7:12; Psa 89:3-4; Mic 5:1(2); Jer 23:5]"},{"num":43,"verse":"A machloket (controversy), therefore, occurred among the multitude because of Rebbe, Melech HaMoshiach."},{"num":44,"verse":"And some of them were wanting to arrest him, but no one laid his hands on him."},{"num":45,"verse":"Then the avadim of the Rashei Hakohanim and Perushim came and the Rashei Hakohanim and Perushim said to them, Why did you not bring him?"},{"num":46,"verse":"In reply, the avadim said, Never Ish spoke like this Ish."},{"num":47,"verse":"In reply, therefore, the Perushim said, Surely not you also have been deceived?"},{"num":48,"verse":"Has any of the manhigim put their emunah (faith) in him, or any of the Perushim [T.N.but cf Yn 7:50; 19:39]?"},{"num":49,"verse":"But this am ha’aretz crowd has no da’as of Torah and is cursed. [DEVARIM 27:26]"},{"num":50,"verse":"Rav Nakdimon, the one having come to Rebbe, Melech HaMoshiach earlier, being one of their own, says to them,"},{"num":51,"verse":"Surely Torateinu (Our Torah) judges not the Man unless it hears first from the Man himself and has da’as of what he does, does it? [Dt 1:16; 17:6; Ex 23:1]"},{"num":52,"verse":"They answered and said to Rav Nakdimon, Surely not you also are from the Galil, are you? Search [the Kitvei Hakodesh] and see that from the Galil a Navi does not arise. [T.N. but cf 2Kgs 14:25; Isa 9:1,2]"},{"num":53,"verse":"And they went each one to his bais."}]