[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That good thing which was committed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "unto thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—“The good thing committed unto thee,” or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the deposit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "differs from the “deposit” of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", inasmuch as the “deposit” of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was something committed by St. Paul to God; while, on the other hand, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Timothy 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a trust committed by God to Timothy is spoken of. But the Apostle, remembering the solemn meaning of the word in the first instance, uses it with especial emphasis on this second occasion. Yes, he seems to say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " will keep the most precious deposit you or I shall intrust to Him—our soul—safe against that day; do ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in thy turn, keep safe, unharmed, the deposit He, through me, has intrusted to thee. In what God’s deposit with men like Timothy and St. Paul consisted has been discussed in the Note to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Timothy 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “The treasure of the Catholic faith”—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was to be kept unchanged, unalloyed. The epithet “good,” which is here applied to this most sacred trust, we find joined to “the doctrine” (“the good doctrine,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Timothy 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and to “the fight” (“the good fight,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Timothy 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Keep by the Holy Ghost which dwelleth in us.—But this glorious deposit of the Catholic faith must be preserved, let Timothy and others holding a like position with Timothy mark well, by no human agencies. He indicates here the only means that must be employed to preserve this sacred charge safe and pure, when he bids us keep the deposit by the Holy Ghost—the Holy Ghost which, St. Paul adds, dwells in us.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Keep by the Holy Ghost which dwelleth in us.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—But this glorious deposit of the Catholic faith must be preserved, let Timothy and others holding a like position with Timothy mark well, by no human agencies. He indicates here the only means that must be employed to preserve this sacred charge safe and pure, when he bids us keep the deposit by the Holy Ghost—the Holy Ghost which, St. Paul adds, dwells in us.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It would seem that the Apostle here was warning Timothy, as the representative Christian teacher, that the sacred deposit of the Catholic faith was to be preserved by no weak compliance with the scruples of false teachers or of doubting men, by no timid accommodation, by no yielding a little here and a little there to prejudice or vanity. By no such or any other short-sighted human arts of defence was the deposit of faith to be guarded. But the Holy Ghost will keep His own, and will show His faithful teachers in every age how to hand down the lamp of holy Catholic doctrine still burning brightly, with flame undimmed, to their successors in the race of life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2 Timothy",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "GOD’S STEWARDS",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "THE Apostle has just been expressing his confidence for himself that ‘God is able to keep that which I have committed’ unto him ‘against that day.’ Here, with intentional parallelism, he repeats the leading ideas and key-words of that great confidence, but in a wholly different connection. Whether we suppose that the rendering of our version in the twelfth verse is correct or no, there still remains the intentional parallelism between the two verses. In discoursing upon that twelfth verse, I gave reasons for adhering to the translation of our version and regarding the parallel as double. There are two committals. God commits something to us; we commit something to God. But whether that be so or no, there are, at all events, two keepings. God keeps, and we have to keep. And if, on the other hand, in both verses the Apostle speaks of a charge committed to men by God, then the contrasted parallel between the two keepings remains and is even increased, because then it is the same thing which God keeps and which we keep. So the whole connection between man’s faithfulness and God’s protection is suggested here. The true Christian life in its entirety may either be regarded as God’s work or the believer’s. We keep ourselves when we let God keep us, and God keeps us by making us able to keep ourselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Note then, first, our charge.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Apostle is evidently thinking mainly of the gospel message which was entrusted to Himself and to Timothy. That is shown by the whole context. The previous verse is, ‘ Hold fast the form of sound words, which thou hast heard of me, in faith and love which is in Christ Jesus.’ And the same connection appears in the First Epistle to Timothy, where the same exhortation is repeated: ‘Keep that. which is committed to thy trust, avoiding profane and vain babblings, ‘which some professing have erred concerning the faith.’ The same idea of the gospel as the deposit committed to the trust of Christian men lies in other words of the first epistle, where the Apostle speaks of the ‘gospel of the glory of the blessed God which was committed to my trust.’ And it crops up in other expressions of his, such as that he was ‘put in trust of the gospel.’ It also underlies the very common representation of himself and his colleagues as being ‘stewards of the mysteries of God.’ But all these expressions describe no prerogative of an apostle, or of a teaching office or order in the Church, but declare the solemn responsibility laid by the great gift bestowed upon all Christian men. Whosoever has accepted the message of salvation for himself is, ipso facto, put in charge of that message for carrying it to others. The trust which I place in the gospel makes the gospel a trust which is committed to me. And every believer, howsoever imperfect may be his grasp of the truth, howsoever narrow may be the sphere of his agency, has given into his hands this great charge, that the Word of God is committed to his trust.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "You Christian people are responsible in this connection for two things, for the preservation of the truth and for the diffusion of the truth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "You are responsible for its preservation. Some of us, in a special manner, have it given to us in charge to oppose prevailing tendencies which rob the gospel of its glory and of its power, to try to preach it to men, whether they will hear or forbear, in its simplicity and its unwelcomeness, as well as in its sweetness and its graciousness. But for most of us, the responsibility for the preservation of the truth lies mainly in another direction, and we are bound to keep it for the food of our own souls, and to see that the atmosphere in which we live, and the prevailing tendencies around us, the worldliness, the selfishness, the absorption in the things seen to the exclusion of the things that axe unseen and eternal, do not rob us of the treasure which we say that we value. See to it that you keep it as what you profess that it is, the anchor of your hope and the guide of all your lives, binding it upon the palms of your hands that all your work may be sanctified; writing it between your eyes that all your thoughts may be enlightened; and inscribing it on the posts of your doors and your gates that, whensoever you go forth to work, you may go out under its guidance, and when you come back to rest and solitude, you may bear it with you for your meditation and refreshment. The charge that is given to us is the preservation of God’s Word, and the gospel which we have received we have received with this written upon it, ‘Hold fast that which thou hast; let no man take thy crown.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And then, further, all of us Christian people are responsible for the diffusion of that Word. It is given to us that we may spread it, and this is no exclusive prerogative of an apostolic class, or of an order of ministers or clergy in God’s Church, but every Christian man and woman who has the Word is thereby bound to tell the Word faithfully.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And then, subordinately and connected with this, I may put another thought, that the reputation and character of our Master are committed to us to keep. People take their notions of Jesus Christ a great deal more from you than from the Bible, and the Christian Church is the true scripture which most men know best. The written revelation is often negatived, or at all events neutralised, by the representation which we Christians make of Christ. He has given into our hands His reputation, as if He said: ‘Live so that men may know what sort of a Christ I am; and so set forth the spirit of life that was in Me that men may be led to believe that there is something in the truths and principles which make men like you.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But there is a wider application legitimately to be given to the words of my text, on which I touch for a moment. The great trust which is committed to us all is ourselves; and in connection therewith we are responsible for two things - first, for the development of character; and second, for the exercise of capacity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We are responsible for the development of character. We have to cut off and suppress, or, at least, to subordinate and regulate, a great deal within us in order that the true self may rise into sovereign majesty and power. We have to cultivate shy graces, unwelcome duties, sides of our character which are not naturally prominent. The faults that we have are not to be cured simply by the repression of them, but by the cultivation of their opposites. All this is given to us to do, and nobody can do it for us. We are stewards of many things, but the most precious gift of which we are stewards is this awful nature of ours, with possibilities that tower heaven-high, and evils that go down to the depths of hell, shut up within the narrow room of our hearts. The man who has himself put into his own hands can never want a field for diligent cultivation. And we are responsible for the use of capacities. God gives these to us that we may by exercise strengthen them. And so, brother, as a man, your natural self is your charge; as a Christian, the word which brings your’ better self, is that which is committed to you to keep.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now, secondly, notice our keeping of our charge. ",
        "children": [
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "II. Now, secondly, notice our keeping of our charge. ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The word rendered here ‘to keep’ rather means ‘to guard’ than to keep in the sense of preserving. ‘Keeping’ is the consequence of the ‘guarding’ which my text enjoins. We may get a picture which may help us to understand the drift of the apostolic exhortation, if I remind you of two of the uses of the word in its non-metaphorical sense in Scripture. It is the expression employed to describe the occupation of the shepherds on the upland slopes of Bethlehem on Christmas Eve. They were ‘keeping watch over their flocks by night.’ That is how you have to watch yourselves and the word that is committed to your care. Again, it is the word employed to describe the vigilant watchfulness of the sentry outside the prison gates where the apostles lay immured; or of the four quaternions of soldiers that had to take charge of Peter when he was chained to them. And that is how we have to watch, as the shepherd over his flock, as the sentry over the prison house, or as the guard over some treasure. So Christian men and women have to live, exercising all the care needful to prevent the stealing away some of the flock, the escape of some of the prisoners, the filching from them of some of their treasure. Let me expand the apostolic exhortation into two of three precepts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Cultivate the sense of stewardship. It is a very hard thing for us to keep fresh the feeling that all which we are and have is given to us, and that not for ourselves, but for God. The beginning of evil is the weakening of that sense of responsibility, and the dawning of the dream that we are our own. The prodigal son’s downfall began with saying, ‘Give me the portion of goods that falleth to me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And the next step came naturally after that: ‘He gathered all together and went away into a far country.’ And the next step came just as naturally after that: ‘He wasted his substance in riotous living.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If sense of stewardship and responsibility is weakened within us, the mainspring of all good is weakened within us, and we shall become self-willed, self-indulgent, self-asserting, God-forgetting. If we think that the talent or the pound is ours, we shall spend it for our own purposes, and that is ‘waste.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And is it not a sad commentary on the tendency of human nature to forget stewardship, and to lose the impression of responsibility, that that very word ‘talents,’ which is borrowed from Christ’s parable, is used in common speech without the slightest sense that it suggests anything about stewardship, faithfulness, or reckoning? Let us, then, take care to cultivate the sense of responsibility.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Again, let us exercise unslumbering vigilance. A great political thinker says, ‘The price of liberty is eternal vigilance.’ The price of keeping the treasure that God has given us is the same. There are old legends of fabulous riches hid away in some rocky cave amongst the mountains, guarded by mythological creatures, of whom it is said that their eyes have no lids. They cannot shut them, and they never sleep. And that is what Christians need to be, with lidless, wide-opened, vigilant eyes; watching ever against the evils that are ever around us, and the robbers who are ever seeking to drag the precious deposit from our hands. Live to watch, and watch that you may live.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Then, again, familiarise yourselves with the truth which you have in charge. I am not half so much afraid that intellectual doubts and the formulated conscious disbelief of this generation will affect Christian people, as I am afraid of the unconscious drift sweeping them away before they know. The writer of the Epistle to the Hebrews has a solemn figure in regard of this matter. He says: ‘Let us take the more earnest heed to the things which we have heard, lest at any time we should drift past them.’ And that is exactly what befalls Christian men and women who do not continually renew their familiarity with God’s Word and the gospel to which they trust. Before they know where they are, the silent-flowing, swift stream has swept them down, and the truths to which they fancied they were anchored are almost invisible on the far horizon. For one man who loses his Christianity by yielding to the arguments of the other side there are ten who lose it by evaporation. ‘As thy servant was busy here and there,’ was the lame excuse of the man in the Old Testament for letting his prisoner run away, ‘he was gone!’ And God knows how he has gone and Where he went.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That is true about a great many who are professing Christian people. The Word has slipped out of their hands, and they do not know how, nor exactly when it escaped from their slack fingers. If you will put plucked flowers into a glass without any water you cannot but expect them to wither; and if you will refrain from refreshing your belief and your trust by familiarity with the truths of the gospel, and by meditating upon these, you cannot wonder that they should shrivel up and lose their sweetness for you. Keep that word hid in your hearts that you sin not against Him and it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And then, further, exercise your gifts. The very worst way to keep the talent is to keep it in a napkin. The man who buried it in the earth, and then dug it up and presented it to his lord, did not know how much weight it",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "had lost by rust and decay while it was hidden away. For though gold does not rust, the gold of the talent that we possess does; and the sure way to make our gifts dwindle is that we neglect to use them. It seems an odd way to keep corn, to fling it broadcast out of a basket over the fields, but ‘there is that scattereth, and yet increaseth.’ Live your faith; let what you believe be the guide of your practice; increase your grasp upon it by meditation and by prayer, use your capacities, exercise your faculties, and they will grow, and you will be strong.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, note our Ally in our keeping of our charge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Through the Holy Ghost which dwelleth in us.’ Then all is to be done, not in our own strength, but in the strength of the great indwelling Guest and Helper. So, then, there arise two thoughts from this.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The one is that we keep ourselves best when we give ourselves to God to keep us. The Apostle has just been doing that for himself, and he now would exhort Timothy to do the same. Our faith brings this great Ally into the field. If we commit to God what God has committed to us, then, as the patriarch, upon his dangerous and doubtful path, beheld in the heavens above him the camp of the angels hovering over his little camp, so, if we commit the keeping of ourselves and of all our responsibility in connection with God’s work, to Him, we too may be sure that ‘the angel of the Lord encampeth round about them that fear Him,’ and that He will keep us. Then there will be a fourth in the furnace like unto the Son of Man, and no fire shall consume anything but the bonds of those who, in the very fire, trust themselves to the strong hands of God. We best keep ourselves when we give ourselves to God to keep.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But another thought here is that God keeps us by enabling us to keep ourselves. ‘Through the Holy Spirit that dwelleth in us’ - so His protection is no mere outward wall of defence around us, nor any change of circumstances which may avert danger, but it is the putting within us of a divine life-principle which shall mould our thoughts, regulate our desires, reinforce our weakness, and be in us a power that shall preserve us from all evil. God fights for us, not in the sense of fighting instead of us, but in the sense of fighting by our sides when we fight. A faith which says, ‘God will take care of me,’ and does not take care of itself, is no faith, but either hypocrisy or self-deceived presumption. Faith will intensify effort instead of leading to shirk it; and the more we trust Him, the more we should ourselves work. We keep ourselves when God keeps us; God keeps us",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "when we keep ourselves. Both things are true, and therefore our fitting temper is the double one of self-distrusting confidence and of earnest diligence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Dear brother, we travel on a dangerous road. We never can tell from behind what rock a gun barrel may be levelled at us, or where the highwayman may swoop down upon us to rob us of our treasure. That is no country to travel through carelessly, in loose order, with our gun upon another horse away at the back of the caravan, and we ourselves straying hither and thither gathering flowers, or seeking easy places to walk in; but it is a land in which we must be unslumberlngly vigilant, and screw ourselves up to all effort. And it is a country in which we shall certainly be robbed unless we commit ourselves unto Him who alone is able to keep us from falling.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Still let me guard the holy fire, And still stir up Thy gift in me.’",
        "children": [
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "‘Still let me guard the holy fire, And still stir up Thy gift in me.’",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If we say, in life and in death, ‘Father! into Thy hands I commit my spirit,’ then we may be humbly, but not idly confident that the old promise will be fulfilled to us:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘The Lord will keep thee ever more.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:6-14 God has not given us the spirit of fear, but the spirit of power, of courage and resolution, to meet difficulties and dangers; the spirit of love to him, which will carry us through opposition. And the spirit of a sound mind, quietness of mind. The Holy Spirit is not the author of a timid or cowardly disposition, or of slavish fears. We are likely to bear afflictions well, when we have strength and power from God to enable us to bear them. As is usual with Paul, when he mentions Christ and his redemption, he enlarges upon them; so full was he of that which is all our salvation, and ought to be all our desire. The call of the gospel is a holy call, making holy. Salvation is of free grace. This is said to be given us before the world began, that is, in the purpose of God from all eternity; in Christ Jesus, for all the gifts that come from God to sinful man, come in and through Christ Jesus alone. And as there is so clear a prospect of eternal happiness by faith in Him, who is the Resurrection and the Life, let us give more diligence in making his salvation sure to our souls. Those who cleave to the gospel, need not be ashamed, the cause will bear them out; but those who oppose it, shall be ashamed. The apostle had trusted his life, his soul, and eternal interests, to the Lord Jesus. No one else could deliver and secure his soul through the trials of life and death. There is a day coming, when our souls will be inquired after. Thou hadst a soul committed to thee; how was it employed? in the service of sin, or in the service of Christ? The hope of the lowest real Christian rests on the same foundation as that of the great apostle. He also has learned the value and the danger of his soul; he also has believed in Christ; and the change wrought in his soul, convinces the believer that the Lord Jesus will keep him to his heavenly kingdom. Paul exhorts Timothy to hold fast the Holy Scriptures, the substance of solid gospel truth in them. It is not enough to assent to the sound words, but we must love them. The Christian doctrine is a trust committed to us; it is of unspeakable value in itself, and will be of unspeakable advantage to us. It is committed to us, to be preserved pure and entire, yet we must not think to keep it by our own strength, but by the power of the Holy Spirit dwelling in us; and it will not be gained by those who trust in their own hearts, and lean to their own understandings.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That good thing which was committed unto thee; - see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reference here in the phrase, \"that good thing committed to thee,\" is to the sound Christian doctrine with which he had been intrusted, and which he was required to transmit to others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Keep by the Holy Ghost - By the aid of the Holy Spirit. One of the best methods of preserving the knowledge and the love of truth is to cherish the influences of the Holy Spirit. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Keep by the Holy Ghost - By the aid of the Holy Spirit. One of the best methods of preserving the knowledge and the love of truth is to cherish the influences of the Holy Spirit. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. Translate as Greek, \"That goodly deposit keep through the Holy Ghost,\" namely, \"the sound words which I have committed to thee\" (2Ti 1:13; 2Ti 2:2).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in us—in all believers, not merely in you and me. The indwelling Spirit enables us to keep from the robbers of the soul the deposit of His word committed to us by God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That good thing which was committed unto thee keep:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this is expounded by ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Timothy 6:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 6:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; he means the doctrine of the gospel, or his office in the publication of it; Be faithful in the ministerial work. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By the Holy Ghost which dwelleth in us; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to which purpose beg the assistance and operation of the Holy Spirit, which dwelleth both in all believers, and more particularly assisteth the ministers of the gospel. We can neither keep our minds sound in the faith, as to the doctrine of it, nor our souls steady in the exercises of faith or love, without the assistance of the Holy Spirit; which yet the Lord giveth to them that ask him, and it abides in them who do not vex, quench, grieve, or resist it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That good thing which was committed to thee,.... By which he means either his ministerial work and office, which is a good work, the dispensation of which was committed to him, and which it became him so to observe, as that the ministry might not be blamed; or else the good and excellent gifts of the Spirit, which qualified him for the discharge of that work, and which were not to be neglected, but to be stirred up, exercised, and improved, lest they should be lost, or took away; or rather the Gospel, which was committed to his trust, to preach: and this may be called a good thing, from the author of it, who is good, whence it is named the Gospel of God, and the Gospel of Christ; and from the matter of it, it consists of good things come by Christ, the High priest, and which it publishes, such as peace, pardon, righteousness, and eternal salvation by him; and from the end and use of it, it being both for the glory of God, the magnifying the riches of his grace, and the exaltation of Christ; and also is the power of God in regeneration and sanctification unto salvation to everyone that believes. And it being said to be \"committed to\" Timothy, denotes the excellency of it; that it is a treasure, as indeed it is a rich one, it contains the riches of grace, even the unsearchable riches of Christ, is more valuable than thousands of gold and silver: and that it is a trust, and requires faithfulness in ministers, who are the stewards of it; and that it is to be accounted for. Wherefore great care should be had in dispensing and keeping it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "keep by the Holy Ghost. It should be kept pure and incorrupt, free from all the adulterations and mixtures of men; and safe and sound, that it be not snatched away from the churches by false teachers. And whereas the apostle knew, that neither Timothy, nor any other, were sufficient of themselves, for these things, he directs to the keeping of it by the Holy Ghost; who makes men overseers of churches, bestows gifts upon them, to fit them for their work, and leads them into all the truths of the Gospel; and under his influence and teachings, and by the assistance of his grace, are they enabled to discharge their trust, abide by the Gospel, and persevere in the ministration of it to the end. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which dwelleth in us; in all believers, who are the temples of the Holy Ghost; and in all the churches, which are built up by him, an habitation for God; and in all the ministers of the word, to direct, instruct, support, and uphold them; and who dwells with them, and continues in them, and that for ever, John 14:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which dwelleth in us; in all believers, who are the temples of the Holy Ghost; and in all the churches, which are built up by him, an habitation for God; and in all the ministers of the word, to direct, instruct, support, and uphold them; and who dwells with them, and continues in them, and that for ever, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 14:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{9} That good thing which was committed unto thee keep {10} by the Holy Ghost which dwelleth in us.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{9}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " That good thing which was committed unto thee keep ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{10}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by the Holy Ghost which dwelleth in us.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(9) An amplification, taken from the dignity of so great a benefit committed to the ministers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(10) The taking away of an objection. It is a hard thing to do it, but the Spirit of God is mighty, who has inwardly endued us with his power.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The exhortation in this verse is most closely connected with that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παραθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is the ministry of the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν καλὴν παραθήκην φύλαξον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡ καλὴ παραθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is, like ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡ καλὴ διδασκαλία",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ καλὸς ἀγὼν κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., to be taken in a general objective sense. There is no sufficient reason for interpreting ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παραθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " otherwise than in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—whether, with Wiesinger and Hofmann, as equivalent to “the sound doctrine,” or, with van Oosterzee, as equivalent to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸ χάρισμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Since all that the apostle has enjoined on Timothy from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " onward has special reference to the discharge of his office, we may surely understand ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παραθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to have the same meaning here as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; besides, as already remarked, it is not conceivable that Paul, in two sentences so closely connected, should have used the same word with different meanings. It need not excite wonder that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Paul looks to God for the preservation of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παραθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", while here he lays it on Timothy as a duty; God’s working does not exclude the activity of man. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Φυλάσσειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is: “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to keep from harm uninjured",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” and from the tendency of the whole epistle it is clear that this exhortation referred to the heresy which perverted the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διὰ πνεύματος ἁγίου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Chrysostom: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐ γὰρ ἐστὶν ἀνθρωπίνης ψυχῆς οὐδὲ δυνάμεως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοσαῦτα ἐμπιστευθέντα ἀρκέσαι πρὸς τὴν φυλακήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Timothy is not to employ any human means for preserving the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παραθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the only means is to be the Holy Spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he is to let the Spirit work in him free and unconfined, and only do that to which the Spirit impels him. The Spirit, however, is not something distant from him, as is shown by the words: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ ἐνοικοῦντος ἐν ἡμῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐνοικοῦντος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐν ἡμῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " denotes the Spirit as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " principle of the new life, working in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " believers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἡμῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", must not be referred simply to Paul and Timothy; nor is it to be overlooked that Paul does not say ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν σοί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν καλὴν παραθήκην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": The faith, which is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑποτύπωσις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in relation to the growing apprehension of it by the Church, is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παραθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "deposit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the case of each individual. On the constant epithet ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καλός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and on ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παραθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is a special force in ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καλήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here, as distinguishing the precious faith from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν παραθήκην μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φύλαξον διὰ Πνεύματος Ἁγίου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φυλάσσειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is more than ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔχειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": it implies here final perseverance; and that can only be attained through the Holy Spirit. God must co-operate with man, if man’s efforts are to be successful. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “Work out your own salvation … for it is God which worketh in you” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Php 2:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Πνεύματος Ἁγίου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": This verse and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Titus 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are the only places in the Pastorals in which the Holy Spirit is mentioned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "good thing which was committed unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The good deposit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Timothy 1:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 1:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "catholicae fidei talentum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; see notes on both verses.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "keep by the Holy Ghost which dwelleth in us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Guard through the Holy Ghost",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The indwelling of the Holy Ghost is ‘the gift of God’ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ‘Grace of Holy Orders’ for the office and work of a priest; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τὴν καλὴν παραθήκην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this good deposit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") namely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the sound words",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [words of salvation] which I have committed to thee; comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διὰ Πνεύματος Ἁγίου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by the Holy Spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He is the earnest of the heavenly deposit, which he who keeps, also keeps the deposit committed to him; whence ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His indwelling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is pressed upon our notice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Guard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "keep",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "through",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. That good thing (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τὴν καλὴν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "παραθήκην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R.T., for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "παρακαταθήκην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and note. This naturally follows the preceding verse. Faithfulness in maintaining the faith was closely connected with the maintenance of sound words. 2 Timothy 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That good thing which was committed (τὴν καλὴν παραθήκην)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That fair, honorable trust, good and beautiful in itself, and honorable to him who receives it. The phrase N.T.o. See on 2 Timothy 1:12. Comp. the good warfare, 1 Timothy 1:18; teaching, 1 Timothy 4:6; fight, 1 Timothy 6:12; confession, 1 Timothy 6:12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That fair, honorable trust, good and beautiful in itself, and honorable to him who receives it. The phrase N.T.o. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Comp. the good warfare, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 1:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; teaching, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; fight, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; confession, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]