[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They went backward, and fell to the ground.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There is nothing in the narrative to suggest that our Lord put forth miraculous power to cause this terror. The impression is rather that it was produced by the majesty of His person, and by the answer which to Jewish ears conveyed the unutterable name, “Jehovah” (I AM). (Comp. Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Guilt trembled before the calmness of innocence. Man fell to the ground before the presence of God. To Judas the term must have been familiar, and have brought back a past which may well have made him tremble at the present. To the officers the voice came from Him of whom they had been convinced before that “Never man spake like this man” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). They have come to take Him by force, but conscience paralyses all their intentions, and they lay helpless before Him. He will surrender Himself because His hour is come (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 17:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but His life no one taketh from Him. For this sense of awe in the presence of Christ, comp. the account of the cleansing of the Temple in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "et seq.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "CHRIST AND HIS CAPTORSJohn 18:6 - John 18:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "CHRIST AND HIS CAPTORS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 18:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This remarkable incident is narrated by John only. It fits in with the purpose which he himself tells us governed his selection of the incidents which he records. ‘These things are written,’ says he, near the end of the Gospel, ‘that ye might believe that Jesus is the Son of God, and that, believing, ye might have life in His name.’ The whole of the peculiarities of the substance of John’s Gospel are to be explained on the two grounds that he was writing a supplement to, and not a substitute for, or a correction of, the Gospels already in existence; and that his special business was to narrate such facts and words as set forth the glory of Christ as ‘the Only Begotten of the Father.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The incident before us is, as I think, one of these. The Evangelist would have us see in it, as I gather from his manner of narrating it, mainly three things. He emphasises that strange recoil of the would-be captors before Christ’s majestic, calm ‘I am He’; that was a manifestation of Christ’s glory. He emphasises our Lord’s patient standing there, in the midst of the awe-struck crowd, and even inciting them, as it would seem, to do the work for which they had come out; that was a manifestation of the voluntariness of Christ’s sufferings. And He emphasises the self-forgetting care with which at that supreme moment He steps between His faithless, weak friends and danger, with the wonderful words, ‘If ye seek Me, let these go their way’; to the Evangelist that little incident is an illustration, on a very low level, and in regard to a comparatively trivial matter, of the very same principle by which salvation from all evil in time and in eternity, is guaranteed to all that believe on Him:-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, consider this remarkable, momentary manifestation of our Lord’s glory. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, then, consider this remarkable, momentary manifestation of our Lord’s glory.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘I am He!’ When the Band were thus doubly assured by the traitor’s kiss and by His own confession, why did they not lay hands upon Him? There He stood in the midst of them, alone, defenceless; there was nothing to hinder their binding Him on the spot. Instead of that they recoil, and fall in a huddled heap before Him. Some strange awe and terror, of which they themselves could have given no account, was upon their spirits. How came it about? Many things may have conspired to produce it. I am by no means anxious to insist that this was a miracle. Things of the same sort, though much less in degree, have been often enough seen; when some innocent and illustrious victim has for a moment paralysed the hands of his would-be captors and made them feel, though it were but transiently, ‘how awful goodness is.’ There must have been many in that band who had heard Him, though, in the uncertain light of quivering moonbeams and smoking torches, they failed to recognise Him till He spoke. There must have been many more who had heard of Him, and many who suspected that they were about to lay hands on a holy man, perhaps on a prophet. There must have been reluctant tools among the inferiors, and no doubt some among the leaders whoso consciences needed but a touch to be roused to action. To all, His calmness and dignity would appeal, and the manifest freedom from fear or desire to flee would tend to deepen the strange thoughts which began to stir in their hearts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the impression which the narrative seems intended to leave, appears to me to be of something more than this. It looks as if there were something more than human in Christ’s look and tone. It may have been the same in kind as the ascendency which a pure and calm nature has over rude and inferior ones. It may have been the same in kind as has sometimes made the headsman on the scaffold pause before he struck, and has bowed rude gaolers into converts before some grey-haired saint or virgin martyr; yet the difference is so great in degree as practically to become quite another thing. Though I do not want to insist upon any ‘miraculous’ explanation of the cause of this incident, yet I would ask, May it not be that here we see, perhaps apart from Christ’s will altogether, rising up for one moment to the surface, the indwelling majesty which was always there?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We do not know the laws that regulated the dwelling of the Godhead, bodily, within that human frame, but we do know that at one other time there came upon His features a transfiguration, and over His very garments a lustre which was not thrown upon them from without, but rose up from within. And I am inclined to think that here, as there, though under such widely different circumstances and to such various issues, there was for a moment a little rending of the veil of His flesh, and an emission of some flash of the brightness that always tabernacled within Him; and that, therefore, just as Isaiah, when He saw the King in His glory, said, ‘Woe is me, for I am undone!’ and just as Moses could not look upon the Face, but could only see the back parts, so here the one stray beam of manifest divinity that shot through the crevice, as it were, for an instant, was enough to prostrate with a strange awe even those rude and insensitive men. When He had said ‘I am He,’ there was something that made them feel, ‘This is One before whom violence cowers abashed, and in whose presence impurity has to hide its face.’ I do not assert that this is the explanation of that panic terror. I only ask, May it not be?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But whatever we may think was the reason, at all events the incident brings out very strikingly the elevation and dignity of Christ, and the powerful impressions made by His personality, even at such a time of humiliation. This Evangelist is always careful to bring out the glory of Christ, especially when that glory lies side by side with His lowliness. The blending of these two is one of the remarkable features in the New Testament portraiture of Jesus Christ. Wherever in our Lord’s life any incident indicates more emphatically than usual the lowliness of His humiliation, there, by the side of it, you get something that indicates the majesty of His glory. For instance, He is born a weak infant, but angels herald His birth; He lies in a manger, but a star hangs trembling above it, and leads sages from afar, with their myrrh, and incense, and gold. He submits Himself to the baptism of repentance, but the heavens open and a voice proclaims, ‘This is My beloved Son!’ He sits wearied, on the stone coping of the well, and craves for water from a peasant woman; but He gives her the Water of Life. He lies down and sleeps, from pure exhaustion, in the stern of the little fishing-boat, but He wakes to command the storm, and it is still. He weeps beside the grave, but He flings His voice into its inmost recesses, and the sheeted dead comes forth. He well-nigh faints under the agony in the garden, but an angel from Heaven strengthens Him. He stands a prisoner at a human bar, but He judges and condemns His judges. He dies, and that hour of defeat is His hour of triumph, and the union of shame and glory is most conspicuous in that hour when on the Cross the ‘Son of Man is glorified, and God is glorified in Him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This strange blending of opposites-the glory in the lowliness, and the abasement in the glory-is the keynote of this singular event. He will be ‘delivered into the hands of men.’ Yes; but ere He is delivered He pauses for an instant, and in that instant comes a flash ‘above the brightness of the noonday sun’ to tell of the hidden glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Do not forget that we may well look upon that incident as a prophecy of what shall be. As one of the suggestive, old commentators on this verse says: ‘He will say “I am He,” again, a third time. What will He do coming to reign, when He did this coming to die? And what will His manifestation be as a Judge when this was the effect of the manifestation as He went to be judged?’ ‘Every eye shall see Him’; and they that loved not His appearing shall fall before Him when He cometh to be our Judge; and shall call on the rocks and the hills to cover them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. There is here, secondly, a manifestation of the voluntariness of our Lord’s suffering. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. There is here, secondly, a manifestation of the voluntariness of our Lord’s suffering.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "When that terrified mob recoiled from Him, why did He stand there so patiently? The time was propitious for flight, if He had cared to flee. He might have ‘passed through the midst of them and gone His way.’ as He did once before, if He had chosen. He comes from the garden; there shall be no difficulty in finding Him. He tells who He is; there shall be no need for the traitor’s kiss. He lays them low for a moment, but He will not flee. When Peter draws his sword He rebukes his ill-advised appeal to force, and then He holds out His hands and lets them bind Him. It was not their fetters, but the ‘cords of love’ which held Him prisoner. It was not their power, but His own pity which drew Him to the judgment hall and the Cross.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us dwell upon that thought for a moment. The whole story of the Gospels is constructed upon the principle, and illustrates the fact, that our Lord’s life, as our Lord’s death, was a voluntary surrender of Himself for man’s sin, and that nothing led Him to, and fastened Him on, the Cross but His own will. He willed to be born. He ‘came into the world’ by His own choice. He ‘took upon Him the form of a servant.’ He ‘took part’ of the children’s ‘flesh and blood.’ His birth was His own act, the first of the long series of the acts, by which for the sake of the love which He bore us, He ‘humbled Himself.’ Step by step He voluntarily journeyed towards the Cross, which stood clear before Him from the very beginning as the necessary end, made necessary by His love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " As we get nearer and nearer to the close of the history, we see more and more distinctly that He willingly went towards the Cross, Take; for instance, the account of the last portion of our Lord’s life, and you see in the whole of it a deliberate intention to precipitate the final conflict. Hence the last journey to Jerusalem when ‘His face was set,’ and His disciples followed Him amazed. Hence the studied publicity of His triumphal entry into Jerusalem. Hence the studied, growing severity of His rebukes to the priests and rulers. The same impression is given, though in a somewhat different way, by His momentary retreat from the city and by the precautions taken against premature arrest, that He might not die before the Passover. In both the hastening toward the city and in the retreating from it, there is apparent the same design: that He Himself shall lay down His life, and shall determine the how, and the when, and the where as seems good to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If we look at the act of death itself, Jesus did not die because He must. It was not the nails of the Cross, the physical exhaustion, the nervous shock of crucifixion that killed Him. He died because He would. ‘I have power to lay down My life,’ He said, ‘and I have power’-of course-’to take it again.’ At that last moment, He was Lord and Master of death when He bowed His head to death, and, if I might so say, He summoned that grim servant with a ‘Come!’ and he came, and He set him his task with a ‘Do this!’ and he did it. He was manifested as the Lord of death, having its ‘keys’ in His hands, when He died upon the Cross.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now I pray you to ask yourselves the question, if it be true that Christ died because He would, why was it that He would die? If because He chose, what was it that determined His choice? And there are but two answers, which two are one. The divine motive that ruled His life is doubly expressed: ‘I must do the will of My Father,’ and ‘I must save the world.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The taunt that those Jewish rulers threw at Him had a deeper truth than they dreamed, and was an encomium, and not a taunt. ‘He saved others’-yes, and therefore, ‘Himself He cannot save.’ He cannot, because His choice and will to die are determined by His free love to us and to all the world. His fixed will ‘bore His body to the tree,’ and His love was the strong spring which kept His will fixed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You and I have our share in these voluntary sufferings, and our place in that loving heart which underwent them for us. Oh! should not that thought speak to all our hearts, and bind us in grateful service and lifelong surrender to Him who gave Himself for us; and must die because He loved us all so much that He could not leave us unsaved?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. We have, lastly, here, a symbol, or, perhaps, more accurately, an instance, on a small scale, of Christ’s self-sacrificing care for us. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. We have, lastly, here, a symbol, or, perhaps, more accurately, an instance, on a small scale, of Christ’s self-sacrificing care for us.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "His words: ‘If ye seek Me, let these go their way,’ sound more like the command of a prince than the intercession of a prisoner. The calm dignity of them strikes one just as much as the perfect self-forgetfulness of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It was a very small matter which He was securing thereby. The Apostles would have to die for Him some day, but they were not ready for it yet, and so He casts the shield of His protection round them for a moment, and interposes Himself between them and the band of soldiers in order that their weakness may have a little more time to grow strong. And though it was wrong and cowardly for them to forsake Him and flee, yet these words of my text more than half gave them permission and warrant for their departure: ‘Let these go their way.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now John did not think that this small deliverance was all that Christ meant by these great words: ‘Of them which Thou gavest Me have I lost none!’ He saw that it was one case, a very trifling one, a merely transitory one, yet ruled by the same principles which are at work in the immensely higher region to which the words properly refer. Of course they have their proper fulfilment in the spiritual realm, and are not fulfilled, in the highest sense, till all who have loved and followed Christ are presented faultless before the Father in the home above. But the little incident may be a result of the same cause as the final deliverance is. A dew-drop is shaped by the same laws which mould the mightiest of the planets. The old divines used to say that God was greatest in the smallest things, and the self-sacrificing care of Jesus Christ, as He gives Himself a prisoner that His disciples may go free, comes from the same deep heart of pitying love, which led Him to die, the ‘just for the unjust.’ It may then well stand for a partial fulfilment of His mighty words, even though these wait for their complete accomplishment till the hour when all the sheep are gathered into the one fold, and no evil beasts, nor weary journeys, nor barren pastures can harass them any more.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This trivial incident, then, becomes an exposition of highest truth. Let us learn from such an use of such an event to look upon all common and transitory circumstances as governed by the same loving hands, and working to the same ends, as the most purely spiritual. The visible is the veil which drapes the invisible, and clings so closely to it as to reveal its outline. The common events of life are all parables to the devout heart, which is the wise heart. They speak mystic meanings to ears that can hear. The redeeming love of Jesus is proclaimed by every mercy which perishes in the using; and all things should tell us of His self-forgetting, self-sacrificing care.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus, then, we may see in that picture of our Lord’s surrendering Himself that His trembling disciples might go free, an emblem of what He does for us, in regard to all our foes. He stands between us and them, receives their arrows into His own bosom, and says, ‘Let these go their way.’ God’s law comes with its terrors, with its penalties, to us who have broken it a thousand times. The consciousness of guilt and sin threatens us all more or less, and with varying intensity in different minds. The weariness of the world, ‘the ills that flesh is heir to,’ the last grim enemy, Death, and that which lies beyond them all, ring you round. My friends! what are you going to do in order to escape from them? You are a sinful man, you have broken God’s law. That law goes on crashing its way and crushing down all that is opposed to it. You have a weary life before you, however joyful it may sometimes be. Cares, and troubles, and sorrows, and tears, and losses, and disappointments, and hard duties that you will not be able to perform, and dark days in which you will be able to see but very little light, are all certain to come sooner or later; and the last moment will draw near when the King of Terrors will be at your side; and beyond death there is a life of retribution in which men reap the things that they have sown here. All that is true, much of it is true about you at this moment, and it will all be true some day. In view of that, what are you going to do?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I preach to you a Saviour who has endured all for us. As a mother might fling herself out of the sledge that her child might escape the wolves in full chase, here is One that comes and fronts all your foes, and says to them, ‘Let these go their way. Take Me.’ ‘By His stripes we are healed.’ ‘On Him was laid the iniquity of us all.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He died because He chose; He chose because He loved. His love had to die in order that His death might be our life, and that in it we should find our forgiveness and peace. He stands between our foes and us. No evil can strike us unless it strike Him first. He takes into His own heart the sharpest of all the darts which can pierce ours. He has borne the guilt and punishment of a world’s sin. These solemn penalties have fallen upon Him that we, trusting in Him, ‘may go our way,’ and that there may be ‘no condemnation’ to us if we are in Christ Jesus. And if there be no condemnation, we can stand whatever other blows may fall upon us. They are easier to bear, and their whole character is different, when we know that Christ has borne them already. Two of the three whom Christ protected in the garden died a martyr’s death; but do you not think that James bowed his neck to Herod’s sword, and Peter let them gird him and lead him to his cross, more joyfully and with a different heart, when they thought of Him that had died before them? The darkest prison cell will not be so very dark if we remember that Christ has been there before us, and death itself will be softened into sleep because our Lord has died. ‘If therefore,’ says He, to the whole pack of evils baying round us, with their cruel eyes and their hungry mouths, ‘ye seek Me, let these go their way.’ So, brother, if you will fix your trust, as a poor, sinful soul, on that dear Christ, and get behind Him, and put Him between you and your enemies, then, in time and in eternity, that saying will be fulfilled in you which He spake, ‘Of them which Thou gavest Me, have I lost none.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-12 Sin began in the garden of Eden, there the curse was pronounced, there the Redeemer was promised; and in a garden that promised Seed entered into conflict with the old serpent. Christ was buried also in a garden. Let us, when we walk in our gardens, take occasion from thence to mediate on Christ's sufferings in a garden. Our Lord Jesus, knowing all things that should come upon him, went forth and asked, Whom seek ye? When the people would have forced him to a crown, he withdrew, ch.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They went backward ... - The cause of their retiring in this manner is not mentioned. Various things might have produced it. The frank, open, and fearless manner in which Jesus addressed them may have convinced them of his innocence, and deterred them from prosecuting their wicked attempt. His disclosure of himself was sudden and unexpected; and while they perhaps anticipated that he would make an effort to escape, they were amazed at his open and bold profession. Their consciences reproved them for their crimes, and probably the firm, decided, and yet mild manner in which Jesus addressed them, the expression of his unequalled power in knowing how to find the way to the consciences of men, made them feel that they were in the presence of more than mortal man. There is no proof that there was here any miraculous power, any mere physical force, and to suppose that there was greatly detracts from the moral sublimity of the scene. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. As soon then as he said unto them, I am He, they went backward—recoiled.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and fell to the ground—struck down by a power such as that which smote Saul of Tarsus and his companions to the earth (Ac 26:14). It was the glorious effulgence of the majesty of Christ which overpowered them. \"This, occurring before His surrender, would show His power over His enemies, and so the freedom with which He gave Himself up\" [Meyer].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " For a further evidence to the world that Christ was the Son of the Everlasting Father, it pleased God in all the periods of his life to show forth by him some acts of the Divine power. What had Christ said or done here to prostrate his armed adversaries? He had only asked them whom they looked for; and hearing that it was for him, told them he was the man: they are struck with a terror, and instead of apprehending him, start from him, and fall down to the ground. If there were so much majesty in and such an effect of the voice of Christ in one of the lowest acts of his humiliation, what will the voice of a glorified Christ be to sinners, when he shall return as a Judge to condemn the world! And what will the effect of that be upon his enemies! How easily might our Saviour have escaped, now that his enemies were fallen to the ground! But he suffered them to rise up again, to take him, and to carry him away, to show that he had laid down his life freely. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As soon then as he had said unto them I am he,.... Immediately upon his speaking these words, which were delivered with so much majesty and authority, and were attended with such a divine power: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they went backward, and fell to the ground; they were confounded, surprised, and intimidated, and seemed as if they would have chose rather to have fled from him, than to have apprehended him; and as they retired and went backward, they fainted away, as it were, either at the majesty of his looks, or at the power of his words, or both, so that they became like ad men, falling to the ground. Sometimes the majesty of a man's person, or his fame for some remarkable things done by him, or the innocence and uprightness of his cause, have had such an influence upon his enemies, that they have not been able to execute upon him what they intended. It is reported of Caius Maxius that being reduced to the utmost misery, and shut up in a private house at Minturnae, (a town in Italy,) an executioner was sent to kill him; and though he was an old man, and unarmed, and in the most miserable condition, yet the executioner having drawn his sword, could not attempt to use it; but, as the historian (y) says, being struck with blindness at the glory of the man, ran away astonished and trembling. Now, besides the above things, in their highest perfection, there was in our Lord something more than human; he was God as well as man, and he displayed his divine majesty, glory, and power. This was done, not to make his escape from them; but to give proof of his deity, and a specimen of his power at the great day; and to let them know, that if he had not thought fit to have surrendered himself voluntarily to them, though he was an unarmed person, they, with all their men and arms, could never have laid hold on him; and to show them, that he could as easily have struck them dead, as to cause them to fall to the ground: and sometimes striking a person dead immediately, is expressed by this phrase of striking to the ground; and is ascribed to God, who does it by the ministry of angels: says R. Simeon ben Shetach (z), to some persons at variance, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"let the master of thoughts come, (i.e. the blessed God,) and take vengeance on you; immediately Gabriel came, , \"and smote them to the ground\"; and they died immediately.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The like is elsewhere said (a), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"if thou transgresseth thy father's command, immediately comes Gabriel, and \"smites to the ground\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) Valerius Maxim. l. 2. c. 5. (z) F. Bab. Sanhedrin, fol. 19. 2.((a) Shemot Rabba, sect. 1. fol. 91. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) Valerius Maxim. l. 2. c. 5. (z) F. Bab. Sanhedrin, fol. 19. 2.((a) Shemot Rabba, sect. 1. fol. 91. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "As soon then as he had said unto them, I am he, they went backward, and fell to the ground.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They gave way,—drew back",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:66",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and fell to the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χαμαί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χαμᾶζε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", very frequently in the classics also); this was regarded, first by Oeder in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Miscell. sacr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 503 ff., and recently by most expositors (including Lücke, Tholuck, Olshausen, De Wette, B. Crusius, Ewald, Baeumlein), as a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "natural",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " consequence of terror and of sudden awe, in support of which reference is made to the (weaker) analogies from the history of M. Antonius (Val. Max. viii. 9. 2), and of Marius (Velleius Paterc. ii. 19. 3), even of Coligny; whilst Brückner would conceive of the effect at least as “scarcely as purely human.” Lange, however, likewise deduces it from terror of conscience, and finds the miracle only in the fact that it was not unexpected by the Lord, and not undesigned by Him. But, presumptively, the falling to the ground of itself, and the circumstance that the text designates those who fell down generally and without an exception, so that even the Roman soldiers are to be understood along with the rest, justifies the view of the ancient commentators, also adopted by Strauss (who, however, as also Scholten, views the matter as unhistorical), Ebrard, Maier, Luthardt, Hengstenberg, Godet, that it was a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "miraculous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " result of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "power of Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Nonnus: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἰστρηθέντες ἀτευχέϊ λαίλαπι φωνῆς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Christ wished, before His surrender, to make known His might over His foes, and thus to show the voluntariness of His surrender. He ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "could",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " remain free, but He is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "willing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to surrender Himself, because He knows His hour is come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 17:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The immediate effect of His calm declaration was: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπῆλθον εἰς τὰ ὀπίσω καὶ ἔπεσον χαμαί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “they went backwards and fell to the ground”. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πεσὼν χαμαί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; similarly used by Homer, etc., as = ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χαμᾶζε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This might have been considered a fulfilment of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ θλίβοντές με",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔπεσαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The recoil, which necessarily causes stumbling and falling in a crowd, was natural, especially if the servants here employed were the same as those who had been sent to take Him on a former occasion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". No one wished to be the first to lay hands on Him. Similar effects were produced by Mohammed (when Durthur stood over him with drawn sword), Mark Antony, Marius, Coligny. But the object in narrating the circumstance may have been to illustrate the voluntariness of Christ’s surrender.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As soon then as he had said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "when therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John 18:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 18:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Evangelist intimates that what followed was the immediate consequence of Christ’s words.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "went backward, and fell",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Whether this was the natural effect of guilt meeting with absolute innocence, or a supernatural effect wrought by Christ’s will, is a question which we have not the means of determining. Moreover, the distinction may be an unreal one. Is it not His will that guilt should quail before innocence? The result in this case proved both to the disciples and to His foes that His surrender was entirely voluntary (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Once before, the majesty of His words had overwhelmed those who had come to arrest Him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and it would have been so now, had not He willed to be taken. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the expression ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "legions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of angels’ may have reference to the fragment of a legion that had come to superintend His capture.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἔπεσον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fell",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") They ought not after that to have continued to kick against the pricks, especially Judas.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "John 18:6",
        "children": []
      }
    ]
  }
]