[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:8-39 David once earnestly longed for the water at the well of Bethlehem. It seems to be an instance of weakness. He was thirsty; with the water of that well he had often refreshed himself when a youth, and it was without due thought that he desired it. Were his valiant men so forward to expose themselves, upon the least hint of their prince's mind, and so eager to please him, and shall not we long to approve ourselves to our Lord Jesus, by ready compliance with his will, as shown us by his word, Spirit, and providence? But David poured out the water as a drink-offering to the Lord. Thus he would cross his own foolish fancy, and punish himself for indulging it, and show that he had sober thoughts to correct his rash ones, and knew how to deny himself. Did David look upon that water as very precious which was got at the hazard of these men's blood, and shall not we much more value those benefits for purchasing which our blessed Saviour shed his blood? Let all beware of neglecting so great salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hararite - Interpreted to mean \"mountaineer,\" one from the hill country of Judah or Ephraim. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2Sa 23:8-39. A Catalogue of His Mighty Men.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "8. These be the names of the mighty men whom David had—This verse should be translated thus: He who sits in the seat of the Tachmonite (that is, of Jashobeam the Hachmonite), who was chief among the captains, the same is Adino the Eznite; he lift up his spear against eight hundred, whom he slew at one time. The text is corrupt in this passage; the number eight hundred should be three hundred [Davidson, Hermeneutics]. Under Joab he was chief or president of the council of war. The first or highest order was composed of him and his two colleagues, Eleazar and Shammah. Eleazar seems to have been left to fight the Philistines alone; and on his achieving the victory, they returned to the spoil. In like manner Shammah was left to stand alone in his glory, when the Lord, by him, wrought a great victory. It is not very easy to determine whether the exploits that are afterwards described were performed by the first or the second three.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Defended it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that the Philistines could neither burn, nor tread it down and spoil it or carry it away. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But he stood in the midst of the ground,.... The field of lentiles: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and defended it; the field, so that the Philistines could not ravage it, and get food and forage from it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and slew the Philistines; made a great slaughter among them, entirely routed them, so that they that escaped his sword were obliged to flee: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Lord wrought a great victory; to whom the glory of it belonged; a similar fact is ascribed to Eleazar before mentioned in 1 Chronicles 11:13; and, indeed, it seems to be the same, and in which they were both concerned; for it is plain from the account that there were more than one engaged in this action, since it is there said, \"and they set themselves in the midst of that parcel\"; and though that parcel of ground is said there to be full of barley, it may easily be reconciled by observing, that one part of it might be sowed with barley, and the other part with lentiles; so the Targum in 1 Chronicles 11:13; for it was half lentiles and half barley; and Eleazar might be placed to defend the one, and Shammah the other; from whence it appears it was about March when this action was, at the latter end of which barley harvest began. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the Lord wrought a great victory; to whom the glory of it belonged; a similar fact is ascribed to Eleazar before mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 11:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and, indeed, it seems to be the same, and in which they were both concerned; for it is plain from the account that there were more than one engaged in this action, since it is there said, \"and they set themselves in the midst of that parcel\"; and though that parcel of ground is said there to be full of barley, it may easily be reconciled by observing, that one part of it might be sowed with barley, and the other part with lentiles; so the Targum in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 11:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for it was half lentiles and half barley; and Eleazar might be placed to defend the one, and Shammah the other; from whence it appears it was about March when this action was, at the latter end of which barley harvest began. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But he stood in the midst of the ground, and defended it, and slew the Philistines: and the LORD wrought a {h} great victory.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But he stood in the midst of the ground, and defended it, and slew the Philistines: and the LORD wrought a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " great victory.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Which has no respect for many or few, when he will show his power.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The third leading hero was Shammah, the son of Age the Hararite (הררי is probably contracted from ההררי, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He also made himself renowned by a great victory over the Philistines. The enemy had gathered together לחיּה, \"as a troop,\" or in a crowd. This meaning of היּה (here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and possibly also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is thoroughly established by the Arabic (see Ges. Thes. p. 470). But it seems to have fallen into disuse afterwards, and in the Chronicles it is explained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by מלחמה, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by מחנה. \"On a portion of a field of lentils there,\" sc., where the Philistines had gathered together, the people (of Israel) were smitten. Then Shammah stationed himself in the midst of the field, and יצּילה, \"wrested it,\" from the foe, and smote the Philistines. Instead of עדשׁים, lentils, we find in the Chronicles שׁלעורים, barley, a very inconsiderable difference.",
        "children": []
      }
    ]
  }
]