[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The well of Bethlehem.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There are now no wells of living water at Bethlehem itself, the town being supplied by an aqueduct. Robinson could find none in the neighbourhood, and was assured that none existed (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bib. R. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ii. 157-163); but Ritter (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Geog. of Pal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "iii. 340) says that a little north of the town “is” David’s well, “with its deep shaft and its clear cool water.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2 Samuel",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A LIBATION TO JEHOVAH2 Samuel 23:15 - 2 Samuel 23:17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A LIBATION TO JEHOVAH",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " David’s fortunes were at a low ebb. He was in hiding in his cave of Adullam, and a Philistine garrison held Bethlehem, his native place. He was little different from an outlaw at the head of a band of ‘broken men,’ but there were depths of chivalry and poetry in his heart. Sweltering in his cave in the fierce heat of harvest, he thought of his native Bethlehem; he remembered the old days when he had watered his flock at the well by its gate, or mingled with the people of the little town, in their evening assemblies round it. The memories of boyhood rose up radiant before him, and as he was immersed in the past, the grim present, the perils that threatened his life, the savage, gaunt rocks without a trace of greenness that girded him, the privations to which he was exposed, were all forgotten, and he longed for one more draught of the water that tasted so cool and sweet to memory. Three of his ‘mighty men,’ bound to him by loyal devotion and unselfish love, were ready to die to win for their chief a momentary gratification. So they slipped away from Adullam, ‘brake through the host of the Philistines,’ and brought back the longed-for draught. David’s reception of the dearly-bought, sparkling gift was due to a noble impulse. The water seemed to him to be dyed with blood, and to be not water so much as ‘lives of men.’ It had become too precious to be used to satisfy his longing. It would be base self-indulgence to drink what had been won by such self-forgetting devotion. God only had the right to receive what men had risked their lives to obtain, and therefore he ‘poured it out unto the Lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The story gleams out of the fierce narratives in which it is embedded, like a flower blooming on some grim cliff. May we not learn lessons from it?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. David’s longing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. David’s longing.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "David, a fugitive in the cave, haunted by the ‘nostalgia’ that made Bethlehem seem so fair and dear, may stand for us as an example of the longings and thirsts that sometimes force themselves into consciousness in every soul. Below the bustle and strife of daily life, occupied as it must be with material and often ignoble things, below the hardness into which the world has compressed men’s surface nature, there lies a yearning for the cool water that rises hard by the gate of our native home. True, it is with many of us overlaid for the most part by coarser desires, and may be as unlike our usual dominant longings and aims, as David’s tender outbreak of sentiment was to the prevailing tenor of his life, in those days when he was an outlaw and a freebooter. But the longing, though often stifled, is not wholly quenched. It is misinterpreted by the man who is conscious of it, and far too often he tries to slake the thirst by fiery and drugged liquors which but make it more intense. Happy are they who know what it is that their parched palates crave, and have learned, while yet the knowledge avails, to say, ‘My soul thirsteth for God, for the living God’! ‘Blessed are they who thirst after’ the water of the well of Bethlehem, ‘for they shall be filled!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The three heroes’ devotion. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The three heroes’ devotion.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "These three rough soldiers, lawless and fierce as they were, had been so mastered by their chief that they were ready to dare anything to pleasure him. Who would have looked for such delicacy of feeling and such enthusiastic self-surrender in such men?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " They stand as grand instances of the height of devotion of which the rudest nature is capable, when once its love and loyalty to the Beloved are evoked.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How such deeds ennoble the lowest types of character, and make us think better of men, and more sadly of the contrast between their habitual characteristics and the possibilities that lie slumbering in their ignoble lives! There are sparks in the hard cold flint, if only they could be struck out. There is water in the rock, if only the right hand, armed with the wonder-working rod, smites it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us not judge men too harshly by what they do and are, but let us try to bring their sleeping possibilities into conscious exercise.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us remember that love and self-sacrifice, which is the very outcome and natural voice of love, ennoble the most degraded.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But these heroic three may suggest to us a sadder thought. They were ready to die for David; would they have been as ready to die for God? These noble emotions of love, leading to glad flinging away of life to pleasure the beloved, are freely given to men, but too often withheld from God, We lavish on our beloveds or on our chosen leaders, a devotion that ought to shame us, when contrasted with the scantiness of our grudging devotion and self-surrender to Him. If we loved God a tenth part as ardently as we love our wives or husbands or parents or children, and were willing to do and bear as much for Him as we are willing to bear for them, how different our lives would be! We can love utterly, enthusiastically, self-forget-tingly, absorbed in the beloved, and counting all surrender of self to, and the sacrifice of life itself for, him or her a delight. Many of us do love men so. Do we love God so?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But these heroic three may suggest another thought. Their self-sacrificing love was illustrious; but there is a nobler, more wonderful, more soul-subduing instance of such love. They broke through the ranks of the Philistines to bring David a draught from the well of Bethlehem. Jesus has broken through the ranks of our enemies to bring us the water of which ‘if a man drink, he shall live for ever.’ If we would see the highest example of self-sacrificing love, we must turn to look, not on the instances of it that shine through the ages on the page of history, and make men thrill as they gaze, and think better of the human nature that can do such things, but on the Christ hanging on the Cross because He loved those who did not love Him, and giving His life a ransom for sinners.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. David’s reception of the water. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. David’s reception of the water.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The chivalrous devotion of the three touched an answering chord in their chivalrous chief. His heart filled at the thought of what they had risked, and revolted from employing what had been thus won for no higher use than to gratify a piece of sentiment in himself. The sparkling water was too sacred to be taken for any baser use than as a libation to Jehovah. And who can doubt that the three were more fully repaid for their devotion, as David poured it out unto the Lord, than if he had drunk it eagerly up? His feeling and his act indicate beautiful delicacy of instinct, and swiftness of perception of how to requite the devotion of the three.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We may separate into its two parts the generous impulse which sprang as one whole in David’s breast. There was the shrinking from using the water to slake his thirst merely, and there was the resolve to pour it out as a libation to God. Both parts of that whole may yield us profitable thoughts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " To risk their lives for the water was noble in the three; to have quaffed it as if it had been drawn like any other water from a well, would have been ignoble in David. There are things that it may be noble to give and ignoble to accept. There are sacrifices which we are not entitled to allow others to make for our sakes. Gratifications which can only be procured at the hazard of men’s lives are too dearly bought.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Would not a civilisation, that draws much of its comforts and appliances from ‘sweated industries,’ and is languidly amused by seeing men and women performers peril their lives nightly, and lose them too, for its gratification, be the better for copying David’s recoil from drinking ‘the blood of men that went in jeopardy of their lives’? Is there not ‘blood’ on many a woman’s ball-dress, on many an article of luxury, on many an amusement?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are sacrifices which we have no right to accept from others. The three had no right to risk life for such a purpose, and David would have been selfish if he had drunk the water. Do not such thoughts lead us by contrast to Him who has done what none other can do? ‘None of them can by any means redeem his brother, nor give his life a ransom for him’; but Jesus can and Jesus does, and what it would be impossible, and wrong if it were possible, for one man to do for another, He has done for us all, and what it would be base for a man to accept from another if that other could give it, it is blessed and the beginning of all nobleness of character for us to accept from Him. David would not drink because the cup seemed to him to be red with blood. Jesus offers to us a cup, not of cold water only but of ‘water and blood,’ and bids us drink of it and remember Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The generous devotion of the three kindled answering emotions in David’s breast. It would be a churlish soul that was not warmed into some faint replica of such self-sacrifice, and most of us would be ashamed of ourselves if we were unmoved by such love. But does the supreme example of it affect us as much as the lesser examples of it do? How many of us stand before it like the peaks of the Alps that front full south, and lift an unmelted breastplate of snow to the midday sun! How many of us have lived all our lives in presence of Jesus’ infinite love and self-surrender for us each, and never have felt one transient touch of answering love!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The other part of David’s impulse was to offer to God what was too precious for his own use. That is the fitting destination of our most precious and prized possessions. And whatever is thus offered becomes more precious by being offered. The altar sanctifies and enhances the worth of the gift. What we give to God is more our own than if we had kept it to ourselves, and develops richer capacities of ministering to our delight. It is so with our greatest surrender, the surrender of ourselves. When we give ourselves to Jesus, He renders us back to ourselves, far better worth having than before. We are never so much our own as when we are wholly Christ’s. And the same thing is true as to all our riches of mind, heart, or worldly wealth. If we wish to taste their most delicate and refined sweetness, let us give them to Jesus, and the touch of His hand, as He accepts them and gives them back to us, will leave a lingering fragrance that nothing else can impart. Was not the water from the well of Bethlehem sweeter to David as he poured it out unto the Lord than if he had greedily gulped it down?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:8-39 David once earnestly longed for the water at the well of Bethlehem. It seems to be an instance of weakness. He was thirsty; with the water of that well he had often refreshed himself when a youth, and it was without due thought that he desired it. Were his valiant men so forward to expose themselves, upon the least hint of their prince's mind, and so eager to please him, and shall not we long to approve ourselves to our Lord Jesus, by ready compliance with his will, as shown us by his word, Spirit, and providence? But David poured out the water as a drink-offering to the Lord. Thus he would cross his own foolish fancy, and punish himself for indulging it, and show that he had sober thoughts to correct his rash ones, and knew how to deny himself. Did David look upon that water as very precious which was got at the hazard of these men's blood, and shall not we much more value those benefits for purchasing which our blessed Saviour shed his blood? Let all beware of neglecting so great salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A cistern of deep, clear, cool water, is called by the monks, David's Well, about three-quarters of a mile to the north of Bethlehem. Possibly the old well has been filled up since the town was supplied with water by the aqueduct. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15, 16. the well of Beth-lehem—An ancient cistern, with four or five holes in the solid rock, at about ten minutes distance to the north of the eastern corner of the hill of Beth-lehem, is pointed out by the natives as Bir-Daoud; that is, David's well. Dr. Robinson doubts the identity of the well; but others think that there are no good grounds for doing so. Certainly, considering this to be the ancient well, Beth-lehem must have once extended ten minutes further to the north, and must have lain in times of old, not as now, on the summit, but on the northern rise of the hill; for the well is by or (1Ch 11:7) at the gate. I find in the description of travellers, that the common opinion is, that David's captains had come from the southeast, in order to obtain, at the risk of their lives, the so-much-longed-for water; while it is supposed that David himself was then in the great cave that is not far to the southeast of Beth-lehem; which cave is generally held to have been that of Adullam. But (Jos 15:35) Adullam lay \"in the valley\"; that is, in the undulating plain at the western base of the mountains of Judea and consequently to the southwest of Beth-lehem. Be this as it may, David's men had in any case to break through the host of the Philistines, in order to reach the well; and the position of Bir-Daoud agrees well with this [Van De Velde].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Being hot and thirsty, he expresseth how acceptable a draught of that water would be to him, as is usual with men to do in such cases; but was far from desiring or expecting that any of his men should hazard their lives to procure it, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Samuel 23:17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And David longed, and said,.... It being harvest time, the summer season, and hot weather, and he thirsty: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "oh, that one would give me drink of the water of the well of Bethlehem,  ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which is by the gate! which he was well acquainted with, being his native place; and which might make it the more desirable, as well as its waters might be peculiarly cool and refreshing, and very excellent, as Kimchi suggests. This well was about a mile from Bethlehem, now called David's well, as some travellers say (y). It is said to be a very large well, with three mouths, and lies a little out of the road (z); and that there is now near Rachel's grave a good rich cistern, which is deep and wide; wherefore the people that go to dip water are provided with small leathern buckets, and a line, as usual in those countries (a); but Mr. Maundrell (b) says it is a well, or rather a cistern, supplied only with rain, without any excellency in its waters to make them desirable; but it seems, he adds, David's spirit had a further aim. Some think he meant by this to get Bethlehem out of the hands of the Philistines, and obtain the possession of it; others, as Jarchi, that he intended to ask some question of the sanhedrim that sat there; and others, that his desire was after the law of God, called waters, as in Isaiah 55:1; and some Christian writers, both ancient and modern (c), are of opinion, that not literal but spiritual water was desired by him, and that he thirsted after the coming of the Messiah, to be born at Bethlehem, and the living water which he only can give, John 4:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "which is by the gate! which he was well acquainted with, being his native place; and which might make it the more desirable, as well as its waters might be peculiarly cool and refreshing, and very excellent, as Kimchi suggests. This well was about a mile from Bethlehem, now called David's well, as some travellers say (y). It is said to be a very large well, with three mouths, and lies a little out of the road (z); and that there is now near Rachel's grave a good rich cistern, which is deep and wide; wherefore the people that go to dip water are provided with small leathern buckets, and a line, as usual in those countries (a); but Mr. Maundrell (b) says it is a well, or rather a cistern, supplied only with rain, without any excellency in its waters to make them desirable; but it seems, he adds, David's spirit had a further aim. Some think he meant by this to get Bethlehem out of the hands of the Philistines, and obtain the possession of it; others, as Jarchi, that he intended to ask some question of the sanhedrim that sat there; and others, that his desire was after the law of God, called waters, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and some Christian writers, both ancient and modern (c), are of opinion, that not literal but spiritual water was desired by him, and that he thirsted after the coming of the Messiah, to be born at Bethlehem, and the living water which he only can give, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) Egmont and Heyman's Travels, vol. 1. p. 363. (z) Le Bruyn's Voyage to the Levant, ch. 52. p. 204. (a) Rauwolff's Travels, part 3. p. 317, 318. (b) Journey from Aleppo, &c. p. 90. (c) Ambros. Apolog. David l. 1. c. 7. gloss. ordinar. & Schmidt in loc. Pfeiffer. Difficil. Loc. Script. cent. 2. loc. 91. Horn. Dissert. de desiderio David. sect. 10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) Egmont and Heyman's Travels, vol. 1. p. 363. (z) Le Bruyn's Voyage to the Levant, ch. 52. p. 204. (a) Rauwolff's Travels, part 3. p. 317, 318. (b) Journey from Aleppo, &c. p. 90. (c) Ambros. Apolog. David l. 1. c. 7. gloss. ordinar. & Schmidt in loc. Pfeiffer. Difficil. Loc. Script. cent. 2. loc. 91. Horn. Dissert. de desiderio David. sect. 10. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And David {i} longed, and said, Oh that one would give me drink of the water of the well of Bethlehem, which is by the gate!",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And David ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " longed, and said, Oh that one would give me drink of the water of the well of Bethlehem, which ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by the gate!",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Being overcome with weariness and thirst.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the well of Beth-lehem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The traditional “David’s well” is half a mile N.N.E. of Beth-lehem. Ritter (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Geogr. of Pal.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " III. 340) speaks of its “deep shaft and clear cool water;” but it is too far from the town to be described as “at the gate.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The well of Bethlehem, which is by the gate.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Bethlehem is now supplied with water by an aqueduct, and the wells close to the town have ceased to exist. The cistern of \"deep, clear, cool water,\" descsribed by Ritter, in his 'Geography of Palestine,' and now called David's Well, is three quarters of a mile to the north of Bethlehem, and too distant to be that which David meant. 2 Samuel 23:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To this deed there is appended a similar heroic feat performed by three of the thirty heroes whose names are not given. The Chethib שׁלשׁים is evidently a slip of the pen for שׁלשׁה (Keri and Chronicles). The thirty chiefs are the heroes named afterwards. As שׁלשׁה has no article either in our text or the Chronicles, the three intended are not the three already mentioned (Jashobeam, Eleazar, and Shammah), but three others out of the number mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These three came to David in the harvest time unto the cave of Adullam (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), when a troop of the Philistines was encamped in the valley of Rephaim, and David was on the mountain fortress, and a Philistian post was then in Bethlehem. And David longed for water, and said, \"Oh that one would bring me water to drink out of the well of Bethlehem at the gate!\" The encampment of the Philistines in the valley of Rephaim, and the position of David on the mountain fortress (בּמּצוּדה), render it probable that the feat mentioned here took place in the war with the Philistines described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Robinson could not discover any well in Bethlehem, \"especially none 'by the gate,' except one connected with the aqueduct on the south\" (Palestine, vol. ii. p. 158). בּשּׁער need not be understood, however, as signifying that the well was in or under the gate; but the well referred to may have been at the gate outside the city. The well to which tradition has given the name of \"David's well\" (cisterna David), is about a quarter of an hour's walk to the north-east of Bethlehem, and, according to Robinson's description, is \"merely a deep and wide cistern or cavern now dry, with three or four narrow openings cut in the rock.\" But Ritter (Erdk. xvi. p. 286) describes it as \"deep with clear cool water, into which there are three openings from above, which Tobler speaks of as bored;\" and again as a cistern \"built with peculiar beauty, from seventeen to twenty-one feet deep, whilst a house close by is pointed out to pilgrims as Jesse's house.\" ",
        "children": []
      }
    ]
  }
]