[{"header":"Jesus Teaches in Parables"},{"num":13,"verse":"That day Jesus went out of the house and was sitting by the sea."},{"num":2,"verse":"And large crowds gathered to Him, so He got into a boat and sat down, and the whole crowd was standing on the beach."},{"num":3,"verse":"And He spoke many things to them in parables, saying, “Behold, the sower went out to sow;"},{"header":"An Explanation"},{"num":10,"verse":"And the disciples came and said to Him, “Why do You speak to them in parables?”"},{"num":11,"verse":"Jesus answered them, “To you it has been granted to know the mysteries of the kingdom of heaven, but to them it has not been granted."},{"header":"The Sower Explained"},{"header":"Tares among Wheat"},{"num":24,"verse":"Jesus presented another parable to them, saying, “The kingdom of heaven may be compared to a man who sowed good seed in his field."},{"header":"The Mustard Seed"},{"num":31,"verse":"He presented another parable to them, saying, “The kingdom of heaven is like a mustard seed, which a man took and sowed in his field;"},{"header":"The Leaven"},{"num":33,"verse":"He spoke another parable to them, “The kingdom of heaven is like leaven, which a woman took and hid in three pecks of flour until it was all leavened.”"},{"num":34,"verse":"All these things Jesus spoke to the crowds in parables, and He did not speak to them without a parable."},{"num":35,"verse":"This was to fulfill what was spoken through the prophet:"},{"header":"The Tares Explained"},{"num":36,"verse":"Then He left the crowds and went into the house. And His disciples came to Him and said, “Explain to us the parable of the tares of the field.”"},{"num":37,"verse":"And He said, “The one who sows the good seed is the Son of Man,"},{"header":"Hidden Treasure"},{"header":"A Costly Pearl"},{"header":"A Dragnet"},{"num":52,"verse":"And Jesus said to them, “Therefore every scribe who has become a disciple of the kingdom of heaven is like a head of a household, who brings out of his treasure things new and old.”"},{"header":"Jesus Revisits Nazareth"},{"num":53,"verse":"When Jesus had finished these parables, He departed from there."},{"num":54,"verse":"He came to His hometown and began teaching them in their synagogue, so that they were astonished, and said, “Where did this man get this wisdom and these miraculous powers?"},{"num":55,"verse":"Is not this the carpenter’s son? Is not His mother called Mary, and His brothers, James and Joseph and Simon and Judas?"},{"num":56,"verse":"And His sisters, are they not all with us? Where then did this man get all these things?”"},{"num":57,"verse":"And they took offense at Him. But Jesus said to them, “A prophet is not without honor except in his hometown and in his own household.”"},{"num":58,"verse":"And He did not do many miracles there because of their unbelief."}]