[{"num":13,"verse":"On that day Jesus went out of the house and sat by the seaside. "},{"num":2,"verse":"Great multitudes gathered to him, so that he entered into a boat and sat; and all the multitude stood on the beach. "},{"num":3,"verse":"He spoke to them many things in parables, saying, “Behold, a farmer went out to sow. "},{"num":4,"verse":"As he sowed, some seeds fell by the roadside, and the birds came and devoured them. "},{"num":5,"verse":"Others fell on rocky ground, where they didn’t have much soil, and immediately they sprang up, because they had no depth of earth. "},{"num":6,"verse":"When the sun had risen, they were scorched. Because they had no root, they withered away. "},{"num":7,"verse":"Others fell among thorns. The thorns grew up and choked them. "},{"num":8,"verse":"Others fell on good soil and yielded fruit: some one hundred times as much, some sixty, and some thirty. "},{"num":9,"verse":"He who has ears to hear, let him hear.”"},{"num":10,"verse":"The disciples came, and said to him, “Why do you speak to them in parables?”"},{"num":11,"verse":"He answered them, “To you it is given to know the mysteries of the Kingdom of Heaven, but it is not given to them. "},{"num":12,"verse":"For whoever has, to him will be given, and he will have abundance; but whoever doesn’t have, from him will be taken away even that which he has. "},{"num":13,"verse":"Therefore I speak to them in parables, because seeing they don’t see, and hearing, they don’t hear, neither do they understand. "},{"num":14,"verse":"In them the prophecy of Isaiah is fulfilled, which says,"},{"num":16,"verse":"“But blessed are your eyes, for they see; and your ears, for they hear. "},{"num":17,"verse":"For most certainly I tell you that many prophets and righteous men desired to see the things which you see, and didn’t see them; and to hear the things which you hear, and didn’t hear them."},{"num":18,"verse":"“Hear, then, the parable of the farmer. "},{"num":19,"verse":"When anyone hears the word of the Kingdom and doesn’t understand it, the evil one comes and snatches away that which has been sown in his heart. This is what was sown by the roadside. "},{"num":20,"verse":"What was sown on the rocky places, this is he who hears the word and immediately with joy receives it; "},{"num":21,"verse":"yet he has no root in himself, but endures for a while. When oppression or persecution arises because of the word, immediately he stumbles. "},{"num":22,"verse":"What was sown among the thorns, this is he who hears the word, but the cares of this age and the deceitfulness of riches choke the word, and he becomes unfruitful. "},{"num":23,"verse":"What was sown on the good ground, this is he who hears the word and understands it, who most certainly bears fruit and produces, some one hundred times as much, some sixty, and some thirty.”"},{"num":24,"verse":"He set another parable before them, saying, “The Kingdom of Heaven is like a man who sowed good seed in his field, "},{"num":25,"verse":"but while people slept, his enemy came and sowed darnel weeds also among the wheat, and went away. "},{"num":26,"verse":"But when the blade sprang up and produced grain, then the darnel weeds appeared also. "},{"num":27,"verse":"The servants of the householder came and said to him, ‘Sir, didn’t you sow good seed in your field? Where did these darnel weeds come from?’"},{"num":28,"verse":"“He said to them, ‘An enemy has done this.’"},{"num":29,"verse":"“But he said, ‘No, lest perhaps while you gather up the darnel weeds, you root up the wheat with them. "},{"num":30,"verse":"Let both grow together until the harvest, and in the harvest time I will tell the reapers, “First, gather up the darnel weeds, and bind them in bundles to burn them; but gather the wheat into my barn.”’”"},{"num":31,"verse":"He set another parable before them, saying, “The Kingdom of Heaven is like a grain of mustard seed which a man took, and sowed in his field, "},{"num":32,"verse":"which indeed is smaller than all seeds. But when it is grown, it is greater than the herbs and becomes a tree, so that the birds of the air come and lodge in its branches.”"},{"num":33,"verse":"He spoke another parable to them. “The Kingdom of Heaven is like yeast which a woman took and hid in three measures of meal, until it was all leavened.”"},{"num":34,"verse":"Jesus spoke all these things in parables to the multitudes; and without a parable, he didn’t speak to them, "},{"num":35,"verse":"that it might be fulfilled which was spoken through the prophet, saying,"},{"num":36,"verse":"Then Jesus sent the multitudes away, and went into the house. His disciples came to him, saying, “Explain to us the parable of the darnel weeds of the field.”"},{"num":37,"verse":"He answered them, “He who sows the good seed is the Son of Man, "},{"num":38,"verse":"the field is the world, the good seeds are the children of the Kingdom, and the darnel weeds are the children of the evil one. "},{"num":39,"verse":"The enemy who sowed them is the devil. The harvest is the end of the age, and the reapers are angels. "},{"num":40,"verse":"As therefore the darnel weeds are gathered up and burned with fire; so will it be at the end of this age. "},{"num":41,"verse":"The Son of Man will send out his angels, and they will gather out of his Kingdom all things that cause stumbling and those who do iniquity, "},{"num":42,"verse":"and will cast them into the furnace of fire. There will be weeping and gnashing of teeth. "},{"num":43,"verse":"Then the righteous will shine like the sun in the Kingdom of their Father. He who has ears to hear, let him hear."},{"num":44,"verse":"“Again, the Kingdom of Heaven is like treasure hidden in the field, which a man found and hid. In his joy, he goes and sells all that he has and buys that field."},{"num":45,"verse":"“Again, the Kingdom of Heaven is like a man who is a merchant seeking fine pearls, "},{"num":46,"verse":"who having found one pearl of great price, he went and sold all that he had and bought it."},{"num":47,"verse":"“Again, the Kingdom of Heaven is like a dragnet that was cast into the sea and gathered some fish of every kind, "},{"num":48,"verse":"which, when it was filled, fishermen drew up on the beach. They sat down and gathered the good into containers, but the bad they threw away. "},{"num":49,"verse":"So will it be in the end of the world. The angels will come and separate the wicked from among the righteous, "},{"num":50,"verse":"and will cast them into the furnace of fire. There will be weeping and gnashing of teeth.” "},{"num":51,"verse":"Jesus said to them, “Have you understood all these things?”"},{"num":52,"verse":"He said to them, “Therefore every scribe who has been made a disciple in the Kingdom of Heaven is like a man who is a householder, who brings out of his treasure new and old things.”"},{"num":53,"verse":"When Jesus had finished these parables, he departed from there. "},{"num":54,"verse":"Coming into his own country, he taught them in their synagogue, so that they were astonished and said, “Where did this man get this wisdom and these mighty works? "},{"num":55,"verse":"Isn’t this the carpenter’s son? Isn’t his mother called Mary, and his brothers James, Joses, Simon, and Judas? "},{"num":56,"verse":"Aren’t all of his sisters with us? Where then did this man get all of these things?” "},{"num":57,"verse":"They were offended by him."},{"num":58,"verse":"He didn’t do many mighty works there because of their unbelief."}]