[{"header":"Laws about Sacrifices"},{"num":15,"verse":"The Lord told Moses "},{"num":2,"verse":"to give the Israelites the following laws about offering sacrifices:"},{"num":3,"verse":"Bulls or rams or goats are the animals that you may burn on the altar as sacrifices to please me. You may also offer sacrifices voluntarily or because you made a promise, or because they are part of your regular religious ceremonies. The smell of the smoke from these sacrifices is pleasing to me."},{"num":4,"verse":"If you sacrifice a young ram or goat, you must also offer two pounds of your finest flour mixed with a quart of olive oil as a grain sacrifice. A quart of wine must also be poured on the altar."},{"num":6,"verse":"And if the animal is a full-grown ram, you must offer four pounds of flour mixed with one and a half quarts of olive oil. One and a half quarts of wine must also be poured on the altar. The smell of this smoke is pleasing to me."},{"num":8,"verse":"If a bull is offered as a sacrifice to please me or to ask my blessing, "},{"num":9,"verse":"you must offer six pounds of flour mixed with two quarts of olive oil. "},{"num":10,"verse":"Two quarts of wine must also be poured on the altar. The smell of this smoke is pleasing to me."},{"num":11,"verse":"If you are a native Israelite, you must obey these rules each time you offer a bull, a ram, or a goat as a sacrifice. "},{"num":14,"verse":"And the foreigners who live among you must also follow these rules. "},{"num":15,"verse":"This law will never change. I am the Lord, and I consider all people the same, whether they are Israelites or foreigners living among you."},{"num":17,"verse":"When you eat food in the land that I am giving you, remember to set aside some of it as an offering to me. "},{"num":20,"verse":"From the first batch of bread dough that you make after each new grain harvest, make a loaf of bread and offer it to me, just as you offer grain. "},{"num":21,"verse":"All your descendants must follow this law and offer part of the first batch of bread dough."},{"num":22,"verse":"The Lord also told Moses to tell the people what must be done if they ever disobey his laws:"},{"num":24,"verse":"If all of you disobey one of my laws without meaning to, you must offer a bull as a sacrifice to please me, together with a grain sacrifice, a wine offering, and a goat as a sacrifice for sin. "},{"num":25,"verse":"Then the priest will pray and ask me to forgive you. And since you did not mean to do wrong, and you offered sacrifices, "},{"num":26,"verse":"the sin of everyone—both Israelites and foreigners among you—will be forgiven."},{"num":27,"verse":"But if one of you does wrong without meaning to, you must sacrifice a year-old female goat as a sacrifice for sin. "},{"num":28,"verse":"The priest will then ask me to forgive you, and your sin will be forgiven."},{"num":29,"verse":"The law will be the same for anyone who does wrong without meaning to, whether an Israelite or a foreigner living among you."},{"num":30,"verse":"But if one of you does wrong on purpose, whether Israelite or foreigner, you have sinned against me by disobeying my laws. You will be sent away and will no longer live among the people of Israel."},{"header":"A Man Put to Death for Gathering Firewood on the Sabbath"},{"num":32,"verse":"Once, while the Israelites were traveling through the desert, a man was caught gathering firewood on the Sabbath. "},{"num":33,"verse":"He was taken to Moses, Aaron, and the rest of the community. "},{"num":34,"verse":"But no one knew what to do with him, so he was not allowed to leave."},{"num":35,"verse":"Then the Lord said to Moses, “Tell the people to take that man outside the camp and stone him to death!” "},{"num":36,"verse":"So he was killed, just as the Lord had commanded Moses."},{"header":"The Tassels on the People’s Clothes"},{"num":37,"verse":"The Lord told Moses "},{"num":38,"verse":"to say to the people of Israel, “Sew tassels onto the bottom edge of your clothes and tie a purple string to each tassel. "},{"num":39,"verse":"These will remind you that you must obey my laws and teachings. And when you do, you will be dedicated to me and won’t follow your own sinful desires. "},{"num":41,"verse":"I am the Lord your God who led you out of Egypt.”"}]