[{"header":"Various Offerings"},{"num":15,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Say to the people of Israel, When you come into the land you are to inhabit, which I give you, "},{"num":3,"verse":"and you offer to the Lord from the herd or from the flock an offering by fire or a burnt offering or a sacrifice, to fulfil a vow or as a freewill offering or at your appointed feasts, to make a pleasing odor to the Lord, "},{"num":4,"verse":"then he who brings his offering shall offer to the Lord a cereal offering of a tenth of an ephah of fine flour, mixed with a fourth of a hin of oil; "},{"num":5,"verse":"and wine for the drink offering, a fourth of a hin, you shall prepare with the burnt offering, or for the sacrifice, for each lamb. "},{"num":6,"verse":"Or for a ram, you shall prepare for a cereal offering two tenths of an ephah of fine flour mixed with a third of a hin of oil; "},{"num":7,"verse":"and for the drink offering you shall offer a third of a hin of wine, a pleasing odor to the Lord. "},{"num":8,"verse":"And when you prepare a bull for a burnt offering, or for a sacrifice, to fulfil a vow, or for peace offerings to the Lord, "},{"num":9,"verse":"then one shall offer with the bull a cereal offering of three tenths of an ephah of fine flour, mixed with half a hin of oil, "},{"num":10,"verse":"and you shall offer for the drink offering half a hin of wine, as an offering by fire, a pleasing odor to the Lord."},{"num":11,"verse":"“Thus it shall be done for each bull or ram, or for each of the male lambs or the kids. "},{"num":12,"verse":"According to the number that you prepare, so shall you do with every one according to their number. "},{"num":13,"verse":"All who are native shall do these things in this way, in offering an offering by fire, a pleasing odor to the Lord. "},{"num":14,"verse":"And if a stranger is sojourning with you, or any one is among you throughout your generations, and he wishes to offer an offering by fire, a pleasing odor to the Lord, he shall do as you do. "},{"num":15,"verse":"For the assembly, there shall be one statute for you and for the stranger who sojourns with you, a perpetual statute throughout your generations; as you are, so shall the sojourner be before the Lord. "},{"num":16,"verse":"One law and one ordinance shall be for you and for the stranger who sojourns with you.”"},{"num":17,"verse":"The Lord said to Moses, "},{"num":18,"verse":"“Say to the people of Israel, When you come into the land to which I bring you "},{"num":19,"verse":"and when you eat of the food of the land, you shall present an offering to the Lord. "},{"num":20,"verse":"Of the first of your coarse meal you shall present a cake as an offering; as an offering from the threshing floor, so shall you present it. "},{"num":21,"verse":"Of the first of your coarse meal you shall give to the Lord an offering throughout your generations."},{"num":22,"verse":"“But if you err, and do not observe all these commandments which the Lord has spoken to Moses, "},{"num":23,"verse":"all that the Lord has commanded you by Moses, from the day that the Lord gave commandment, and onward throughout your generations, "},{"num":24,"verse":"then if it was done unwittingly without the knowledge of the congregation, all the congregation shall offer one young bull for a burnt offering, a pleasing odor to the Lord, with its cereal offering and its drink offering, according to the ordinance, and one male goat for a sin offering. "},{"num":25,"verse":"And the priest shall make atonement for all the congregation of the people of Israel, and they shall be forgiven; because it was an error, and they have brought their offering, an offering by fire to the Lord, and their sin offering before the Lord, for their error. "},{"num":26,"verse":"And all the congregation of the people of Israel shall be forgiven, and the stranger who sojourns among them, because the whole population was involved in the error."},{"num":27,"verse":"“If one person sins unwittingly, he shall offer a female goat a year old for a sin offering. "},{"num":28,"verse":"And the priest shall make atonement before the Lord for the person who commits an error, when he sins unwittingly, to make atonement for him; and he shall be forgiven. "},{"num":29,"verse":"You shall have one law for him who does anything unwittingly, for him who is native among the people of Israel, and for the stranger who sojourns among them. "},{"num":30,"verse":"But the person who does anything with a high hand, whether he is native or a sojourner, reviles the Lord, and that person shall be cut off from among his people. "},{"num":31,"verse":"Because he has despised the word of the Lord, and has broken his commandment, that person shall be utterly cut off; his iniquity shall be upon him.”"},{"header":"Penalty for Violating the Sabbath"},{"num":32,"verse":"While the people of Israel were in the wilderness, they found a man gathering sticks on the sabbath day. "},{"num":33,"verse":"And those who found him gathering sticks brought him to Moses and Aaron, and to all the congregation. "},{"num":34,"verse":"They put him in custody, because it had not been made plain what should be done to him. "},{"num":35,"verse":"And the Lord said to Moses, “The man shall be put to death; all the congregation shall stone him with stones outside the camp.” "},{"num":36,"verse":"And all the congregation brought him outside the camp, and stoned him to death with stones, as the Lord commanded Moses."},{"header":"Fringes on Garments"},{"num":37,"verse":"The Lord said to Moses, "},{"num":38,"verse":"“Speak to the people of Israel, and bid them to make tassels on the corners of their garments throughout their generations, and to put upon the tassel of each corner a cord of blue; "},{"num":39,"verse":"and it shall be to you a tassel to look upon and remember all the commandments of the Lord, to do them, not to follow after your own heart and your own eyes, which you are inclined to go after wantonly. "},{"num":40,"verse":"So you shall remember and do all my commandments, and be holy to your God. "},{"num":41,"verse":"I am the Lord your God, who brought you out of the land of Egypt, to be your God: I am the Lord your God.”"}]