[{"header":"Let Love Be Your Guide"},{"num":13,"verse":"I may speak in different languages, whether human or even of angels. But if I don’t have love, I am only a noisy bell or a ringing cymbal."},{"num":2,"verse":"I may have the gift of prophecy, I may understand all secrets and know everything there is to know, and I may have faith so great that I can move mountains. But even with all this, if I don’t have love, I am nothing."},{"num":3,"verse":"I may give away everything I have to help others, and I may even give my body as an offering to be burned. But I gain nothing by doing all this if I don’t have love."},{"num":4,"verse":"Love is patient and kind. Love is not jealous, it does not brag, and it is not proud."},{"num":5,"verse":"Love is not rude, it is not selfish, and it cannot be made angry easily. Love does not remember wrongs done against it."},{"num":6,"verse":"Love is never happy when others do wrong, but it is always happy with the truth."},{"num":7,"verse":"Love never gives up on people. It never stops trusting, never loses hope, and never quits."},{"num":8,"verse":"Love will never end. But all those gifts will come to an end—even the gift of prophecy, the gift of speaking in different kinds of languages, and the gift of knowledge."},{"num":9,"verse":"These will all end because this knowledge and these prophecies we have are not complete."},{"num":10,"verse":"But when perfection comes, the things that are not complete will end."},{"num":11,"verse":"When I was a child, I talked like a child, I thought like a child, and I made plans like a child. When I became a man, I stopped those childish ways."},{"num":12,"verse":"It is the same with us. Now we see God as if we are looking at a reflection in a mirror. But then, in the future, we will see him right before our eyes. Now I know only a part, but at that time I will know fully, as God has known me."},{"num":13,"verse":"So these three things continue: faith, hope, and love. And the greatest of these is love."}]