[{"header":"Love—the Greatest of All"},{"num":13,"verse":"I may be able to speak the languages of men and even of angels, but if I do not have love, it will sound like noisy brass. "},{"num":2,"verse":"If I have the gift of speaking God’s Word and if I understand all secrets, but do not have love, I am nothing. If I know all things and if I have the gift of faith so I can move mountains, but do not have love, I am nothing. "},{"num":3,"verse":"If I give everything I have to feed poor people and if I give my body to be burned, but do not have love, it will not help me."},{"num":4,"verse":"Love does not give up. Love is kind. Love is not jealous. Love does not put itself up as being important. Love has no pride. "},{"num":5,"verse":"Love does not do the wrong thing. Love never thinks of itself. Love does not get angry. Love does not remember the suffering that comes from being hurt by someone. "},{"num":6,"verse":"Love is not happy with sin. Love is happy with the truth. "},{"num":7,"verse":"Love takes everything that comes without giving up. Love believes all things. Love hopes for all things. Love keeps on in all things."},{"num":8,"verse":"Love never comes to an end. The gift of speaking God’s Word will come to an end. The gift of speaking in special sounds will be stopped. The gift of understanding will come to an end. "},{"num":9,"verse":"For we only know a part now, and we speak only a part. "},{"num":10,"verse":"When everything is perfect, then we will not need these gifts that are not perfect."},{"num":11,"verse":"When I was a child, I spoke like a child. I thought like a child. I understood like a child. Now I am a man. I do not act like a child anymore. "},{"num":12,"verse":"Now that which we see is as if we were looking in a broken mirror. But then we will see everything. Now I know only a part. But then I will know everything in a perfect way. That is how God knows me right now. "},{"num":13,"verse":"And now we have these three: faith and hope and love, but the greatest of these is love."}]