[{"num":13,"verse":"If in the leshonot of Bnei Adam and malachim I speak, but I do not have ahavah, I have become only a sounding gong or a clanging cymbal."},{"num":2,"verse":"And if I have nevu’ah and have da’as of all sodot and all da’as, and if I have all emunah so as to remove mountains, but ahavah I do not have, I am nothing."},{"num":3,"verse":"And if I’m a marbitz tzedaka and give all I possess in gemilut chasadim and if I give my body al kiddush ha-Shem for sereifah (death by burning), but ahavah I do not have, I have gained nothing. [DANIEL 3:28]"},{"num":4,"verse":"Ahavah suffers long; ahavah is kind; ahavah does not have kinah; ahavah does not brag; ahavah is not puffed up in ga’avah (conceit, pride);"},{"num":5,"verse":"ahavah does not behave shamelessly; ahavah does not in anochiyut insist on its own way; ahavah is not touchy and vindictive, keeping a record of wrongs (ZECHARYAH 8:17)."},{"num":6,"verse":"Ahavah does not find simcha in evil, but rejoices in HaEmes."},{"num":7,"verse":"Ahavah covers all things (MISHLE 10:12), believes all things, has tikvah (hope), even zitzfleisch, for all things."},{"num":8,"verse":"Ahavah never fails. However, divrei nevu’ah will be abolished; leshonot will cease; da’as will come to an end."},{"num":9,"verse":"For we have da’as in part, and we have divrei nevu’ah is part."},{"num":10,"verse":"But when shleimah (completion) comes, the teilvaiz (partial) will disappear."},{"num":11,"verse":"When I was a yeled, I used to speak like one, think like one, reason like one. But when I became mevugar (mature), I put away kinderyohrn. [Ps 131:2]"},{"num":12,"verse":"For still we see through a mirror indistinctly. But then [in the Olam Haba], distinctly, panim el panim. Now I have da’as only in part; then I will have da’as fully, even as also Hashem had full da’as of me. [Job 26:14; 36:26; Gn 32:30; Job 19:26]"},{"num":13,"verse":"But now remain emunah, tikvah, and ahavah, these shalosh (three). And the greatest of these is ahavah."}]