[{"header":"Love, the Motivation of Our Lives"},{"num":13,"verse":"If I were to speak with eloquence in earth’s many languages, and in the heavenly tongues of angels, yet I didn’t express myself with love, my words would be reduced to the hollow sound of nothing more than a clanging cymbal."},{"num":2,"verse":"And if I were to have the gift of prophecy with a profound understanding of God’s hidden secrets, and if I possessed unending supernatural knowledge, and if I had the greatest gift of faith that could move mountains, but have never learned to love, then I am nothing."},{"num":3,"verse":"And if I were to be so generous as to give away everything I owned to feed the poor, and to offer my body to be burned as a martyr, without the pure motive of love, I would gain nothing of value."},{"num":4,"verse":"Love is large and incredibly patient. Love is gentle and consistently kind to all. It refuses to be jealous when blessing comes to someone else. Love does not brag about one’s achievements nor inflate its own importance. "},{"num":5,"verse":"Love does not traffic in shame and disrespect, nor selfishly seek its own honor. Love is not easily irritated or quick to take offense. "},{"num":6,"verse":"Love joyfully celebrates honesty and finds no delight in what is wrong. "},{"num":7,"verse":"Love is a safe place of shelter, for it never stops believing the best for others. Love never takes failure as defeat, for it never gives up."},{"header":"Perfect Love"},{"num":8,"verse":"Love never stops loving. It extends beyond the gift of prophecy, which eventually fades away. It is more enduring than tongues, which will one day fall silent. Love remains long after words of knowledge are forgotten. "},{"num":9,"verse":"Our present knowledge and our prophecies are but partial, "},{"num":10,"verse":"but when love’s perfection arrives, the partial will fade away. "},{"num":11,"verse":"When I was a child, I spoke about childish matters, for I saw things like a child and reasoned like a child. But the day came when I matured, and I set aside my childish ways."},{"num":12,"verse":"For now we see but a faint reflection of riddles and mysteries as though reflected in a mirror, but one day we will see face-to-face. My understanding is incomplete now, but one day I will understand everything, just as everything about me has been fully understood. "},{"num":13,"verse":"Until then, there are three things that remain: faith, hope, and love—yet love surpasses them all. So above all else, let love be the beautiful prize for which you run."}]