[{"num":30,"verse":"Rachel saw that she was not giving birth to children for Jacob. So she envied her sister Leah. Rachel said to Jacob, “Give me children, or I’ll die!”"},{"num":2,"verse":"Jacob became angry with her. He said, “Can I do what only God can do? He is the one who has kept you from having children.”"},{"num":3,"verse":"Then Rachel said, “Here is my slave girl Bilhah. Have physical relations with her so she can give birth to a child for me. Then I can have my own family through her.”"},{"num":4,"verse":"So Rachel gave Bilhah, her slave girl, to Jacob as a wife. And he had physical relations with her. "},{"num":5,"verse":"She became pregnant and gave Jacob a son. "},{"num":6,"verse":"Rachel said, “God has declared me innocent. He has listened to my prayer and has given me a son.” So Rachel named this son Dan."},{"num":7,"verse":"Bilhah became pregnant again and gave Jacob a second son. "},{"num":8,"verse":"Rachel said, “I have struggled hard with my sister. And I have won.” So she named that son Naphtali."},{"num":9,"verse":"Leah saw that she had stopped having children. So she gave her slave girl Zilpah to Jacob as a wife. "},{"num":10,"verse":"Then Zilpah had a son. "},{"num":11,"verse":"Leah said, “I am lucky.” So she named her son Gad. "},{"num":12,"verse":"Zilpah gave birth to another son. "},{"num":13,"verse":"Leah said, “I am very happy! Now women will call me happy.” So she named that son Asher."},{"num":14,"verse":"During the wheat harvest Reuben went into the field and found some mandrake plants. He brought them to his mother Leah. But Rachel said to Leah, “Please give me some of your son’s mandrakes.”"},{"num":15,"verse":"Leah answered, “You have already taken away my husband. Now you are trying to take away my son’s mandrakes.”"},{"num":16,"verse":"When Jacob came in from the field that night, Leah went out to meet him. She said, “You will have intimate relations with me tonight. I have paid for you with my son’s mandrakes.” So Jacob slept with her that night."},{"num":17,"verse":"Then God answered Leah’s prayer, and she became pregnant again. She gave birth to a fifth son. "},{"num":18,"verse":"Leah said, “God has given me what I paid for, because I gave my slave girl to my husband.” So Leah named her son Issachar."},{"num":19,"verse":"Leah became pregnant again and gave birth to a sixth son. "},{"num":20,"verse":"She said, “God has given me a fine gift. Now surely Jacob will honor me, because I have given him six sons.” So Leah named the son Zebulun."},{"num":21,"verse":"Later Leah gave birth to a daughter. She named her Dinah."},{"num":22,"verse":"Then God remembered Rachel and answered her prayer. God made it possible for her to have children. "},{"num":23,"verse":"She became pregnant and gave birth to a son. She said, “God has taken away my shame.” "},{"num":24,"verse":"She named him Joseph. Rachel said, “I wish the Lord would give me another son.”"},{"header":"Jacob Tricks Laban"},{"num":25,"verse":"After the birth of Joseph, Jacob said to Laban, “Now let me go to my own home and country. "},{"num":26,"verse":"Give me my wives and my children, and let me go. I have earned them by working for you. You know that I served you well.”"},{"num":27,"verse":"Laban said to him, “If I have pleased you, please stay. I know the Lord has blessed me because of you. "},{"num":28,"verse":"Tell me what I should pay you, and I will give it to you.”"},{"num":29,"verse":"Jacob answered, “You know that I have worked hard for you. Your flocks have grown while I cared for them. "},{"num":30,"verse":"When I came, you had little. Now you have much. Every time I did something for you, the Lord blessed you. But when will I be able to do something for my own family?”"},{"num":31,"verse":"Laban asked, “Then what should I give you?”"},{"num":32,"verse":"Today let me go through all your flocks of white sheep and black goats. I will take every spotted or speckled lamb. I will take every black lamb and every spotted or speckled goat. That will be my pay. "},{"num":33,"verse":"In the future you can easily see if I am honest. You can come to look at my flocks. If I have any goat that isn’t speckled or spotted or any sheep that isn’t black, you will know I stole it.”"},{"num":34,"verse":"Laban answered, “Agreed! We will do what you ask.” "},{"num":35,"verse":"But that day Laban took away all the male goats that had streaks or spots. And he took all the speckled and spotted female goats (all those that had white on them). And he took all the black sheep. He told his sons to watch over them. "},{"num":36,"verse":"Laban took these animals to a place that was three days’ journey away from Jacob. Jacob took care of all the animals that were left."},{"num":37,"verse":"So Jacob cut green branches from poplar, almond and plane trees. He peeled off some of the bark so that the branches had white stripes on them. "},{"num":38,"verse":"He put the branches in front of the flocks at the watering places. When the animals came to drink, they also mated there. "},{"num":39,"verse":"So the goats mated in front of the branches. Then the young that were born were streaked, speckled or spotted. "},{"num":40,"verse":"Jacob separated the young animals from the others. And he made them face the streaked and dark animals in Laban’s flock. Jacob kept his animals separate from Laban’s. "},{"num":41,"verse":"When the stronger animals in the flock were mating, Jacob put the branches before their eyes. This was so the animals would mate near the branches. "},{"num":42,"verse":"But when the weaker animals mated, Jacob did not put the branches there. So the animals born from the weaker animals were Laban’s. And the animals born from the stronger animals were Jacob’s. "},{"num":43,"verse":"In this way Jacob became very rich. He had large flocks, many male and female servants, camels and donkeys."}]