[{"header":"Rachel’s Children by Bilhah"},{"num":30,"verse":"Rachel noticed that she was not bearing children for Jacob, so because she envied her sister Leah, she told Jacob, “If you don’t give me sons, I’m going to die!”"},{"num":2,"verse":"That made Jacob angry with Rachel, so he asked her, “Can I take God’s place, who has not allowed you to conceive?”"},{"num":3,"verse":"Rachel responded, “Here’s my handmaid Bilhah. Go have sex with her. She can bear children on my knees so I can have children through her.”"},{"num":4,"verse":"So Rachel gave Jacob her woman servant Bilhah to be his wife, and Jacob had sex with her. "},{"num":5,"verse":"Bilhah conceived and bore a son for Jacob. "},{"num":6,"verse":"Then Rachel said, “God has vindicated me! He has heard my voice and has given me a son.” Therefore, she named him Dan."},{"num":7,"verse":"Rachel’s servant conceived again and bore a second son for Jacob, "},{"num":8,"verse":"so Rachel said, “I’ve been through a mighty struggle with my sister and won.” She named him Naphtali."},{"num":9,"verse":"When Leah saw that she had stopped bearing children, she took her woman servant Zilpah and gave her to Jacob as a wife. "},{"num":10,"verse":"Leah’s servant Zilpah bore a son to Jacob, "},{"num":11,"verse":"and Leah exclaimed, “How fortunate!” So she named him Gad."},{"num":12,"verse":"Later, Leah’s servant Zilpah bore a second son for Jacob. "},{"num":13,"verse":"She said, “How happy I am, because women will call me happy!” So she named him Asher."},{"header":"Jacob and the Mandrakes"},{"num":14,"verse":"Some time later, during the wheat harvest season, Reuben went out and found some mandrakes in the field and brought them back for his mother Leah. Then Rachel told Leah, “Please give me your son’s mandrakes.”"},{"num":15,"verse":"In response, Leah asked her, “Wasn’t it enough that you’ve taken away my husband? Now you also want to take my son’s mandrakes!”"},{"num":16,"verse":"When Jacob came in from the field that evening, Leah went to meet him and told him, “You’re having sex with me tonight. I traded my son’s mandrakes for you!” So he slept with her that night."},{"num":17,"verse":"God heard what Leah had said, so she conceived and bore a fifth son for Jacob. "},{"num":18,"verse":"Then Leah said, “God has paid me for giving my servant to my husband as his wife.” So she named him Issachar."},{"num":19,"verse":"Later, Leah conceived again and bore a sixth son for Jacob. "},{"num":20,"verse":"Then Leah said, “God has given me a good gift. This time my husband will exalt me, because I’ve borne him six sons.” So she named him Zebulun."},{"num":21,"verse":"After that, Leah conceived, bore a daughter, and named her Dinah."},{"header":"Rachel’s Son Joseph is Born"},{"num":22,"verse":"Then God remembered Rachel. He listened to her and opened her womb, "},{"num":23,"verse":"so she conceived, bore a son, and remarked, “God has removed my shame.” "},{"num":24,"verse":"Because she had been asking, “May God give me another son,” she named him Joseph."},{"header":"Jacob and Laban’s Livestock"},{"num":25,"verse":"After Rachel had given birth to Joseph, Jacob told Laban, “Send me off so that I can go back to my place and country. "},{"num":26,"verse":"Give me my wives and children for whom I’ve served you. Then I’ll leave, since you’re aware of my service to you.”"},{"num":27,"verse":"Then Laban responded, “If I’ve found favor in your sight, please stay with me, because I’ve learned through divination that the Lord has blessed me because of you. "},{"num":28,"verse":"Name your wage, and I’ll give it to you.”"},{"num":29,"verse":"But Jacob replied to Laban, “You know how I’ve served you and how your cattle thrived under my care. "},{"num":30,"verse":"What you had previously was only a few head, but the herd has now multiplied, because the Lord has blessed you through my efforts. But now, when am I going to be able to provide for my own household?”"},{"num":31,"verse":"“What do I have to give you?” Laban asked."},{"num":32,"verse":"Let me walk among your flocks today and remove every speckled or spotted sheep, along with every black lamb, and let me do the same with the speckled and spotted goats. These will be my wages. "},{"num":33,"verse":"In the future, you’ll be able to verify my honesty because, when you come to check what I’ve earned, if you find a goat that’s not speckled or spotted or a sheep that’s not black, then it will have been stolen by me.”"},{"num":34,"verse":"“Very well,” Laban replied. “We’ll do it the way you’ve asked.” "},{"num":35,"verse":"That very day, Laban removed the male goats that were striped or spotted, all the female goats that were speckled or spotted—that is, every one that had white on them—and all the black lambs and placed them into the care of his sons. "},{"num":36,"verse":"He sent them as far away from Jacob as a three days’ journey could take them."},{"num":37,"verse":"Jacob took branches from white poplar trees, freshly cut almond trees, and some other trees, stripped off their bark to make white streaks, and uncovered the white part inside the branches. "},{"num":38,"verse":"Then he placed the branches that he had stripped bare in all the watering troughs where the flocks came to drink. He placed the branches in front of the flock, and they went into heat as they came to drink. "},{"num":39,"verse":"When the flocks mated in front of the branches, they would bear offspring that were striped, speckled, or spotted."},{"num":40,"verse":"Jacob kept the lambs separate, facing the striped and entirely black ones that belonged to Laban’s flock. He set his own herd by itself and would not let them be with Laban’s flock. "},{"num":41,"verse":"Whenever the more vigorous of the flock came into heat, Jacob would place the branches in the troughs in front of the flock to make them mate by the branches."},{"num":42,"verse":"But he didn’t put the branches in front of any of the feeble members of the flock. As a result, the feeble ones belonged to Laban, but the stronger ones belonged to Jacob. "},{"num":43,"verse":"Therefore the man Jacob prospered so much that he had large flocks, female and male servants, as well as camels and donkeys."}]