[{"num":30,"verse":"¶ And when Rachel saw that she gave Jacob no children, Rachel envied her sister and said unto Jacob, Give me sons, or else I will die."},{"num":2,"verse":"And Jacob’s anger was kindled against Rachel; and he said, Am I in God’s stead, who has withheld from thee the fruit of the womb?"},{"num":3,"verse":"And she said, Behold my maid Bilhah, go in unto her; and she shall bear upon my knees, that I may also have children by her."},{"num":4,"verse":"And she gave him Bilhah her handmaid to wife; and Jacob went in unto her."},{"num":5,"verse":"And Bilhah conceived and gave birth to a son unto Jacob."},{"num":6,"verse":"And Rachel said, God has judged me, and has also heard my voice, and has given me a son. Therefore she called his name Dan."},{"num":7,"verse":"And Bilhah Rachel’s maid conceived again and gave birth to a second son unto Jacob."},{"num":8,"verse":"And Rachel said, With great wrestlings I have wrestled with my sister, and I have prevailed; and she called his name Naphtali."},{"num":9,"verse":"When Leah saw that she had stopped bearing children, she took Zilpah, her maid and gave her Jacob to wife."},{"num":10,"verse":"And Zilpah, Leah’s maid, gave birth to a son unto Jacob."},{"num":11,"verse":"And Leah said, Good venture has come; and she called his name Gad."},{"num":12,"verse":"And Zilpah, Leah’s maid, gave birth to a second son unto Jacob."},{"num":13,"verse":"And Leah said, Blessed am I, for the daughters will call me blessed; and she called his name Asher."},{"num":14,"verse":"¶ And Reuben went in the days of wheat harvest and found mandrakes in the field and brought them unto his mother Leah. Then Rachel said to Leah, Give me, I pray thee, of thy son’s mandrakes."},{"num":15,"verse":"And she said unto her, Is it a small matter that thou hast taken my husband and would thou take away my son’s mandrakes also? And Rachel said, Therefore he shall lie with thee to night for thy son’s mandrakes."},{"num":16,"verse":"And Jacob came out of the field in the evening, and Leah went out to meet him and said, Thou must come in unto me; for surely I have hired thee with my son’s mandrakes. And he lay with her that night."},{"num":17,"verse":"And God hearkened unto Leah, and she conceived and gave birth to a fifth son unto Jacob."},{"num":18,"verse":"And Leah said, God has given me my hire, because I have given my maiden to my husband; and she called his name Issachar."},{"num":19,"verse":"And Leah conceived again and gave birth to the sixth son unto Jacob."},{"num":20,"verse":"And Leah said, God has endued me with a good dowry; now my husband will dwell with me because I have born him six sons; and she called his name Zebulun."},{"num":21,"verse":"And afterwards she gave birth to a daughter and called her name Dinah."},{"num":22,"verse":"And God remembered Rachel and God hearkened to her and opened her womb."},{"num":23,"verse":"And she conceived and gave birth to a son and said, God has taken away my reproach;"},{"num":24,"verse":"and she called his name Joseph, saying, Let the LORD add unto me another son."},{"num":25,"verse":"¶ And it came to pass when Rachel had given birth to Joseph, that Jacob said unto Laban, Send me away, and I shall go unto my place and to my land."},{"num":26,"verse":"Give me my wives and my children, for whom I have served thee, and let me go, for thou knowest my service which I have done thee."},{"num":27,"verse":"And Laban said unto him, Let me now find grace in thine eyes, I have learned by experience that the LORD has blessed me for thy sake."},{"num":28,"verse":"And he said, Appoint me thy wages, and I will give it."},{"num":29,"verse":"And he said unto him, Thou knowest how I have served thee and how many livestock thou hast with me."},{"num":30,"verse":"For it was little which thou hadst before I came, and it is now increased unto a multitude, and the LORD has blessed thee since my coming; and now when shall I provide for my own house also?"},{"num":31,"verse":"And he said, What shall I give thee? And Jacob said, Thou shalt not give me anything; if thou wilt do this thing for me, I will again feed and keep thy flock."},{"num":32,"verse":"I will pass through all thy flock today, setting apart all the speckled and spotted sheep, and all the brown rams among the rams, and the spotted and speckled among the goats; and of such shall be my hire."},{"num":33,"verse":"So shall my righteousness answer for me tomorrow, when my hire shall come before thy face; each one that is not speckled and spotted among my goats and brown among my sheep shall be counted stolen with me."},{"num":34,"verse":"And Laban said, Behold, I would it might be according to thy word."},{"num":35,"verse":"And he removed that day the he goats that were ringstraked and spotted and all the she goats that were speckled and spotted and every one that had some white in it, and all the brown among the sheep and gave them into the hand of his sons."},{"num":36,"verse":"And he set three days’ journey between himself and Jacob, and Jacob fed the rest of Laban’s flocks."},{"num":37,"verse":"¶ And Jacob took rods of green poplar and of the almond and chestnut tree and peeled white strakes in them and made the white appear which was in the rods."},{"num":38,"verse":"And he set the rods which he had peeled before the flocks in the gutters in the watering troughs when the flocks came to drink that they should conceive when they came to drink."},{"num":39,"verse":"And the flocks conceived before the rods and brought forth ringstraked, speckled, and spotted sheep."},{"num":40,"verse":"And Jacob separated the lambs, and put with his flock the ringstraked and all the brown in the flock of Laban; and he put his own flocks by themselves and did not put them together with Laban’s sheep."},{"num":41,"verse":"And it came to pass, whenever the stronger sheep conceived, that Jacob laid the rods before the eyes of the sheep in the gutters that they might conceive among the rods."},{"num":42,"verse":"But when the sheep were feeble, he did not put them in; so the feebler were Laban’s, and the stronger Jacob’s."},{"num":43,"verse":"And the man increased exceedingly, and had many sheep, and maidslaves and menslaves, and camels, and asses."}]