[[],[{"type":"header","content":"The Sons of Jacob"},{"type":"prose","content":"Now when Rachel saw that she had not borne Jacob  children, she became jealous of her sister; and she said to Jacob, “Give me children, or else I am going to die.”"}],[{"type":"prose","content":"Then Jacob’s anger burned against Rachel, and he said, “Am I in the place of God, who has withheld from you the fruit of the womb?”"}],[{"type":"prose","content":"Then she said, “Here is my female slave Bilhah: have relations with her that she may give birth on my knees, so that by her I too may obtain a child.”"}],[{"type":"prose","content":"So she gave him her slave Bilhah as a wife, and Jacob had relations with her."}],[{"type":"prose","content":"Bilhah conceived and bore Jacob a son."}],[{"type":"prose","content":"Then Rachel said, “God has vindicated me, and has indeed heard my voice and has given me a son.” Therefore she named him Dan."}],[{"type":"prose","content":"And Rachel’s slave Bilhah conceived again and bore Jacob a second son."}],[{"type":"prose","content":"So Rachel said, “ mighty wrestling I have wrestled with my sister,  I have indeed prevailed.” And she named him Naphtali."}],[{"type":"prose","content":"When Leah saw that she had stopped having children, she took her slave Zilpah and gave her to Jacob as a wife."}],[{"type":"prose","content":"And Leah’s slave Zilpah bore Jacob a son."}],[{"type":"prose","content":"Then Leah said, “How fortunate!” So she named him Gad."}],[{"type":"prose","content":"And Leah’s slave Zilpah bore Jacob a second son."}],[{"type":"prose","content":"Then Leah said, “Happy am I! For women will call me happy.” So she named him Asher."}],[{"type":"prose","content":"Now in the days of wheat harvest Reuben went and found mandrake fruits in the field, and brought them to his mother Leah. Then Rachel said to Leah, “Please give me some of your son’s mandrakes.”"}],[{"type":"prose","content":"But she said to her, “Is it a small matter for you to take my husband? And would you take my son’s mandrakes also?” So Rachel said, “Therefore he may sleep with you tonight in return for your son’s mandrakes.”"}],[{"type":"prose","content":"When Jacob came in from the field in the evening, Leah went out to meet him and said, “You must have relations with me, for I have indeed hired you with my son’s mandrakes.” So he slept with her that night."}],[{"type":"prose","content":"God listened to Leah, and she conceived and bore Jacob a fifth son."}],[{"type":"prose","content":"Then Leah said, “God has given me my reward, because I gave my slave to my husband.” So she named him Issachar."}],[{"type":"prose","content":"And Leah conceived again and bore a sixth son to Jacob."}],[{"type":"prose","content":"Then Leah said, “God has endowed me with a good gift; finally my husband will acknowledge me , because I have borne him six sons.” So she named him Zebulun."}],[{"type":"prose","content":"Afterward she gave birth to a daughter, and named her Dinah."}],[{"type":"prose","content":"Then God remembered Rachel, and God listened to her and opened her womb."}],[{"type":"prose","content":"So she conceived and gave birth to a son, and said, “God has taken away my disgrace.”"}],[{"type":"prose","content":"And she named him Joseph, saying, “May the LORD give me another son.”"}],[{"type":"header","content":"Jacob Prospers"},{"type":"prose","content":"Now it came about, when Rachel had given birth to Joseph, that Jacob said to Laban, “Send me away, so that I may go to my own place and to my own country."}],[{"type":"prose","content":"Give  my wives and my children for whom I have served you, and let me go; for you yourself know my service which I have rendered you.”"}],[{"type":"prose","content":"But Laban said to him, “If it pleases you at all, ; I have determined by divination that the LORD has blessed me on your account.”"}],[{"type":"prose","content":"He continued, “Name me your wages, and I will give them.”"}],[{"type":"prose","content":"But  said to him, “You yourself know how I have served you and how your livestock have fared with me."}],[{"type":"prose","content":"For you had little before I came, and it has increased to a multitude, and the LORD has blessed you wherever I turned. But now, when shall I provide for my own household also?”"}],[{"type":"prose","content":"So he said, “What shall I give you?” And Jacob said, “You shall not give me anything. If you will do this  thing for me, I will again pasture  keep your flock:"}],[{"type":"prose","content":"let me pass through your entire flock today, removing from there every speckled or spotted sheep and every black sheep among the lambs, and the spotted or speckled among the goats; and  shall be my wages."}],[{"type":"prose","content":"So my honesty will answer for me later, when you come concerning my wages. Every one that is not speckled or spotted among the goats, or black among the lambs,  with me, will be considered stolen.”"}],[{"type":"prose","content":"Laban said, “Good, let it be according to your word.”"}],[{"type":"prose","content":"So he removed on that day the striped or spotted male goats, and all the speckled or spotted female goats, every one with white on it, and all the black ones among the sheep, and put them in the care of his sons."}],[{"type":"prose","content":"And he put  three days’ journey between himself and Jacob, and Jacob fed the rest of Laban’s flocks."}],[{"type":"prose","content":"Then Jacob took fresh rods of poplar, almond, and plane trees, and peeled white stripes in them, exposing the white that  in the rods."}],[{"type":"prose","content":"He set the rods which he had peeled in front of the flocks in the drinking troughs, , in the watering channels where the flocks came to drink; and they mated when they came to drink."}],[{"type":"prose","content":"So the flocks mated by the rods, and the flocks delivered striped, speckled, and spotted ."}],[{"type":"prose","content":"Then Jacob separated the lambs, and made the flocks face toward the striped and all the black in the flock of Laban; and he put his own herds apart, and did not put them with Laban’s flock."}],[{"type":"prose","content":"Moreover, whenever the stronger of the flock were mating, Jacob would place the rods in the sight of the flock in the drinking troughs, so that they would mate by the rods;"}],[{"type":"prose","content":"but when the flock was sickly, he did not put  in; so the sickly were Laban’s, and the stronger  Jacob’s."}],[{"type":"prose","content":"So the man became exceedingly prosperous, and had large flocks, and female and male servants, and camels and donkeys."}]]