[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(41) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The chief priests mocking him, with the scribes and elders.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It would seem as if all, or nearly all, the members of the Sanhedrin—those, at least, who had taken part in the condemnation—had come to feast their eyes with the sight of their Victim’s sufferings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Matthew",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "THE CRUCIFIXION",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "TAUNTS TURNING TO TESTIMONIESMatthew 27:41 - Matthew 27:43",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "TAUNTS TURNING TO TESTIMONIES",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 27:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 27:43",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is an old saying that the corruption of the best is the worst. What is more merciful and pitiful than true religion? What is more merciless and malicious than hatred which calls itself ‘religious’? These priests, like many a persecutor for religion since, came to feast their eyes on the long-drawn-out agonies of their Victim, and their rank tongues blossomed into foul speech. Characteristically enough, though they shared in the mockeries of the mob, they kept themselves separate. The crowd pressed near enough to the cross to speak their gibes to Jesus; the dignified movers of the ignorant crowd stood superciliously apart, and talked scoffingly about Him. Whilst the populace yelled, ‘Thou that destroyest the Temple and buildest it in three days, come down,’ the chief priests, with the scribes, looked at each other with a smile, and said, ‘He saved others; Himself He cannot save.’ Now, these brutal taunts have lessons for us. They witness to the popular impression of Christ, and what His claims were. He asserted Himself to be a worker of miracles, the Messiah-King of Israel, the Son of God, therefore He died. And they witness to the misconception which ruled in the minds of these priests as to the relation of His claims to the Cross. They thought that it had finally burst the bubble, and disposed once for all of these absurd and blasphemous pretensions. Was it credible that a man who possessed miraculous power should not, in this supreme moment, use it to deliver Himself? Did not ‘Physician, heal Thyself,’ come in properly there? Would any of the most besotted followers of this pretender retain a rag of belief in His Messiahship if He was crucified? Could it be possible that, if there was a God at all, He should leave a man that really trusted in Him, not to say who was really His Son, to die thus? A cracked mirror gives a distorted image. The facts were seen, but their relation was twisted. If we will take the guidance of these gibes, and see what is the real explanation to the anomaly that they suggest, then we shall find that the taunts turn to Him for a testimony, and that ‘out of the mouths of mockers there is ‘perfected praise.’ The stones flung at the Master turn to roses strewed in His path.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. So, then, first the Cross shows us the Saviour who could not save Himself. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. So, then, first the Cross shows us the Saviour who could not save Himself.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The priests did not believe in Christ’s miracles, and they thought that this final token of his impotence, as they took it to be, was clear proof that the miracles were either tricks or mistakes. They saw the two things, they fatally misunderstood the relation between them. Let us put the two things together.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Here, on the one hand, is a Man who has exercised absolute authority in all the realms of the universe, who has spoken to dead matter, and it has obeyed; who by His word has calmed the storm, and hushed the winds by His word, has multiplied bread, has transmuted pale water into ruddy wine; who has moved omnipotent amongst the disturbed minds and diseased bodies of men, who has cast His sovereign word into the depth and darkness of the grave, and brought out the dead, stumbling and entangled in the grave-clothes. All these are facts on the one side. And on the other there is this-that there, passive, and, to superficial eyes, impotent, He hangs the helpless Victim of Roman soldiers and of Jewish priests. The short and easy vulgar way to solve the apparent contradiction was to deny the reality of the one of its members; to say ‘Miracles? Absurd! He never worked one, or He would have been working one now.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But let their error lead us into truth, and let us grasp the relation of the two apparently contradictory facts. ‘He saved others,’ that is certain. He did not ‘save Himself,’ that is as certain. Was the explanation ‘cannot’? The priests by ‘cannot’ meant physical impossibility, defect of power, and they were wrong. But there is a profound sense in which the word ‘cannot’ is absolutely true. For this is in all time, and in all human relations, the law of service-sacrifice; and no man can truly help humanity, or an individual, unless he is prepared to surrender himself in the service. The lamp burns away in giving light. The fire consumes in warming the hearth, and no brotherly sympathy or help has ever yet been rendered, or ever will be, except at the price of self-surrender. Now, some people think that this is the whole explanation of our Lord’s history, both in His life and in His death. I do not believe that it is the whole explanation, but I do believe it carries us some way towards the central sanctuary, where the explanation lies. And yet it is not complete or adequate, because, to parallel Christ’s work with the work of any of the rest of us to our brethren, however beautiful, disinterested, self-oblivious, and self-consuming it may be, seems to me-I say it with deference, though I must here remember considerations of brevity and be merely assertive-entirely to ignore the unique special characteristic of the work of Jesus Christ-viz., that it was the atonement for the sins of the world. He could not bear away our sins, unless the burden of them was laid on His own back, and He carried our griefs, our sorrows, our diseases, and our transgressions. ‘He saved others, Himself He cannot save.’ But the impossibility was purely the result of His own willing and obedient love; or, if I put it in more epigrammatic form, the priests’ ‘cannot’ was partially true, but if they had said ‘would not’ they would have hit the mark, and come to full truth. The reason for His death becomes clear, and each of the contrasted facts is enhanced, when we set side by side the opulence and ease of His manifold miracles and the apparent impotence and resourcelessness of the passive Victim on the cross.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That ‘cannot’ did not come from defect of power, but from plenitude of love, and it was a ‘will not’ in its deepest depths. For you will find scattered throughout Scripture, especially these Gospels, indications from our Lord’s own lips, and by His own acts, that, in the truest and fullest sense, His sufferings were voluntary. ‘No man taketh it from me’-He says about His life-’I have power to lay it down, and I have power to take it again.’ And once He did choose to flash out for a moment the always present power, that we might learn that when it did not appear, it was not because he could not, but because he would not. When the soldiers came to lay their hands upon Him, He presented Himself before them, saving them all the trouble of search, and when He asked a question, and received the answer that it was He of whom they were in search, there came one sudden apocalypse of His majesty, and they fell to the ground, and lay there prone before Him. They could have had no power at all against Him, except He had willed to surrender Himself to them. Again, though it is hypercritical perhaps to attach importance to what may only be natural idiomatic forms of speech, yet in this connection it is not to be overlooked that the language of all the Evangelists, in describing the supreme moment of Christ’s death, is congruous with the idea that He died neither from the exhaustion of crucifixion, nor from the thrust of the soldier’s spear, but because He would. For they all have expressions equivalent to that of one of them, ‘He gave up His spirit.’ Be that as it may, the ‘cannot’ was a ‘will not’; and it was neither nails that fastened Him to the tree, nor violence that slew Him, but He was fixed there by His own steadfast will, and He died because He would. So if we rightly understand the ‘cannot’ we may take up with thankfulness the taunt which, as I say, is tuned to a testimony, and reiterate adoringly, ‘He saved others, Himself He cannot save.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The Cross shows us the King on His throne. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The Cross shows us the King on His throne.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "To the priests it appeared ludicrous to suppose that a King of Israel should, by Israel, be nailed upon the cross. ‘Let Him come down, and we will believe Him.’ They saw the two facts, they misconceived their relation. There was a relation between them, and it is not difficult for us to apprehend it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Cross is Christ’s throne. There are two ways in which the tragedy of His crucifixion is looked at in the Gospels, one that prevails in the three first, another that prevails in the fourth. These two seem superficially to be opposite; they are complementary. It depends upon your station whether a point in the sky is your zenith or your nadir. Here it is your zenith; at the antipodes it is the nadir. In the first three gospels the aspect of humiliation, degradation, inanition, suffering, is prominent in the references to the Crucifixion. In the fourth gospel the aspect of glory and triumph is uppermost. ‘Even so must the Son of Man be lifted up’; ‘I, if I be lifted up, will draw all men unto Me’; ‘Now the hour is come that the Son of Man should be glorified.’ And it is His glory, for on that Cross Jesus Christ manifests, in transcendent and superlative form, at once power and love that are boundless and divine. The Cross is the foundation of His kingdom. In his great passage in Philippians the Apostle brings together, in the closest causal connection, His obedience unto death, the death of the Cross, and His exaltation and reception of ‘the name that is above every name, that at the name of Jesus every knee should bow.’ The title over the Cross was meant for a gibe. It was a prophecy. By the Cross He becomes the ‘King,’ and not only the ‘King of the Jews.’ The sceptre that was put in His hand, though it was meant for a sneer, was a forecast of a truth, for He rules, not with a rod of iron, but with the reed of gentleness; and the crown of thorns, that was pressed down on His wounded and bleeding head, foretold for our faith the great truth that suffering is the foundation of dominion, and that men will bow as to their King and Lord before Him who died for them, with a prostration of spirit, a loyalty of allegiance, and an alertness of service, which none other, monarch or superior, may even dream of attaining. The Cross establishes, not destroys, Christ’s dominion over men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Yes; and that Cross wins their faith as nothing else can. The blind priests said, ‘Let Him come down, and we will believe Him.’ Precisely because He did not come down, do sad and sorrowful and sinful hearts turn to Him from the ends of the earth, and from the distances of the ages pour the treasures of their trust and their love at His feet. Did you ever think how strange it is, except with one explanation, that the gibes of the priests did not turn out to be true? Why is it that Christ’s shameful death did not burst the bubble, as they thought it had done? Why is it that in His case-and I was going to say, and it would have been no exaggeration, in His case only-the death of the leader did not result in the dispersion of the led? Why is it that His fate and future were the opposite of that of multitudes of other pseudo-Messiahs, of whom it is true that when they were slain their followers came to nought? Why? There is only one explanation, I think, and that is that the death was not the end, but that He rose again from the dead. My brother, you will either have to accept the Resurrection, with all that comes from it, or else you will have to join the ranks of the priests, and consider that Christ’s death blew to atoms Christ’s pretensions. If we know anything about Him, we know that He asserted miraculous power, Messiahship, and a filial relation to God. These things are facts. Did He rise or did He not? If He did not, He was an enthusiast. If He did, He is the King to whom our hearts can cleave, and to whom our loyalty is due.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Now, lastly, the Cross shows us the Son, beloved of the Father. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Now, lastly, the Cross shows us the Son, beloved of the Father.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The priests thought that it was altogether incredible that His devotion should have been genuine, or His claim to be the Son of God should have any reality, since the Cross, to their vulgar eyes, disproved them both. Like all coarse-minded people, they estimated character by condition, but they who do that make no end of mistakes. They had forgotten their own Prophecies, which might have told them that ‘the Servant of the Lord in whom’ His ‘heart delighted,’ was a suffering Servant. But whilst they recognised the facts, here again, as in the other two cases, they misconceived the relation. We have the means of rectifying the distorted image.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We ought to know, and to be sure, that the Cross of Christ was the very token that this was God’s ‘beloved Son in whom He was well pleased.’ If we dare venture on the comparison of parts of that which is all homogeneous and perfect, we might say that in the moment of His death Jesus Christ was more than ever the object of the Father’s delight.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Why? It is not my purpose now to enlarge upon all the reasons which might be suggested. Let me put them together in a sentence or two. In that Cross Jesus Christ revealed God as God’s heart had always yearned to be revealed, infinite in love, pitifulness, forbearance, and pardoning mercy. There was the highest manifestation of the glory of God. ‘What?’ you say, ‘a poor weak Man, hanging on a cross, and dying in the dark-is that the very shining apex of all that humanity can know of divinity?’ Yes, for it is the pure manifestation that God is Love. Therefore the whole sunshine of the Father’s presence rested on the dying Saviour. It was the hour when God most delighted in Him, if I may venture the comparison, for the other reasons that then He carried filial obedience to its utmost perfection, that then His trust in God was deepest, even at the hour when His spirit was darkened by the cloud that the world’s sin, which He was carrying, had spread thunderous between Him and the sunshine of the Father’s face. For in that mysterious voice, which we can never understand in its depths, there were blended trust and desolation, each in its highest degree: ‘My God! my God! Why hast Thou forsaken Me?’ And the Cross was the complete carrying out of God’s dearest purpose for the world, that He might be ‘just, and the justifier of him that believeth in Jesus.’ Therefore, then-I was going to say as never before-was Christ His Son, in whom He delighted.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren, let us, led by the errors of these scoffers, grasp the truths that they pervert. Let us see that weak Man hanging helpless on the cross, whose ‘cannot’ is the impotence of omnipotence, imposed by His own loving will to save a world by the sacrifice of Himself. Let us crown Him our King, and let our deepest trust and our gladdest obedience be rendered to Him because He did not come down from, but ‘endured, the cross.’ Let us behold with wonder, awe, and endless love the Father not withholding His only Son, but ‘delivering Him up to the death for us all,’ and from the empty grave and the occupied Throne let us learn how the Father by both proclaims to all the world concerning Him hanging dying on the cross: ‘This is My beloved Son, in whom I am well pleased.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:35-44 It was usual to put shame upon malefactors, by a writing to notify the crime for which they suffered. So they set up one over Christ's head. This they designed for his reproach, but God so overruled it, that even his accusation was to his honour. There were crucified with him at the same time, two robbers. He was, at his death, numbered among the transgressors, that we, at our death, might be numbered among the saints. The taunts and jeers he received are here recorded. The enemies of Christ labour to make others believe that of religion and of the people of God, which they themselves know to be false. The chief priests and scribes, and the elders, upbraid Jesus with being the King of Israel. Many people could like the King of Israel well enough, if he would but come down from the cross; if they could but have his kingdom without the tribulation through which they must enter into it. But if no cross, then no Christ, no crown. Those that would reign with him, must be willing to suffer with him. Thus our Lord Jesus, having undertaken to satisfy the justice of God, did it, by submitting to the punishment of the worst of men. And in every minute particular recorded about the sufferings of Christ, we find some prediction in the Prophets or the Psalms fulfilled.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thou that destroyest the temple ... - Meaning, Thou that didst boast that thou couldst do it. This was one of the things that had been falsely charged on him. It was intended for painful sarcasm and derision. If he could destroy the \"temple,\" they thought he might easily come down from the cross. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mt 27:34-50. Crucifixion and Death of the Lord Jesus. ( = Mr 15:25-37; Lu 23:33-46; Joh 19:18-30).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the exposition, see on [1375]Joh 19:18-30.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 27:44\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 27:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Likewise also the chief priests,.... Who as they attended at his apprehension, and in their own council condemned him to death unanimously, and were very busy at his arraignment, examination, and trial before Pilate, and persuaded the people to be urgent for his crucifixion; they follow him to the cross to exult over him, and insult him, and to see that the execution was strictly performed: and forgetting their character, office, and education; and laying aside all humanity, decent, and good manners; instead of rebuking and restraining the populace from using him in an ill and unkind manner, they themselves stood ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "mocking him, with the Scribes and elders; who composed the whole sanhedrim of the nation. The Syriac, Arabic, and Persic versions, and several copies, read, \"and the Pharisees\": of which, no doubt, there were great numbers present, who had been indefatigable and implacable enemies of Christ every where, and to whom it must be a pleasing sight to see him hanging on the cross: these scoffed at him, gibed, and reproached him; anaid, as follows; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "mocking him, with the Scribes and elders; who composed the whole sanhedrim of the nation. The Syriac, Arabic, and Persic versions, and several copies, read, \"and the Pharisees\": of which, no doubt, there were great numbers present, who had been indefatigable and implacable enemies of Christ every where, and to whom it must be a pleasing sight to see him hanging on the cross: these scoffed at him, gibed, and reproached him; anaid, as follows; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Likewise also the chief priests mocking him, with the scribes and elders, said,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 27:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁμοίως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.: one might have expected the dignitaries, priests, scribes, elders, to have left that low-minded work to the mob. But they condescend to their level, yet with a difference. They speak ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "about",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Sufferer, not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him, and in a tone of affected seriousness and fairness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chief priests … scribes and elders",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] members of the Sanhedrin, the “rulers” of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 27:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὁμοίως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in like manner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) Now the chief men imitate the populace: a great confusion! but they surpass them in bitterness.[1198]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1198] Such persons scarcely at any other time betray in public what is the secret feeling which they cherish inwardly.—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 41.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Likewise also.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " All classes that composed the Sanhedrin were present at the execution, and took part in the reviling; but, unlike the soldiers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the mob, they did not address him personally, either from supreme contempt, or because they stood aloof from the herd, and spake among themselves. Some few authorities of no great weight, after \"elders\" add \"and Pharisees;\" but the words are an interpolation, though they are without doubt true in fact. That these leaders should presume thus to revile One whom they knew to be innocent is unspeakably iniquitous. Matthew 27:41",
        "children": []
      }
    ]
  }
]