[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Copy.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pathshegen.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A Persian word, only occurring here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Esther 3:14-15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 3:14-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The copy of the writing to be given in every province — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Copies of this original decree of the king were sent into every province, and there ordered to be published, requiring the people to be ready against the day appointed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The posts went out, being hastened by the king’s commandment — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either by this decree made in the king’s name, or by some particular and succeeding command which Haman obtained from the king. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the king and Haman sat down to drink — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Haman was afraid, probably, lest the king’s conscience should smite him for what he had done, and he should begin to wish it undone again; to prevent which he engrossed him to himself, and kept him drinking. This cursed method many take to drown their convictions, and harden their own hearts, and the hearts of others, in sin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But the city Shushan was perplexed — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not only the Jews, but a great number of the citizens, either because they were related to them, or engaged with them in worldly concerns; or out of humanity and compassion toward so vast a number of innocent people, appointed as sheep for the slaughter. They might apprehend likewise that, upon the execution of the decree, some sedition or tumult might ensue; that in so great a slaughter it was hard to tell who would escape without being killed or plundered, because those who were employed in this bloody work would be more mindful to enrich themselves than to observe their orders. They might also fear that a public judgment from God would come upon them all for so bloody a decree.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We see in the exaltation of Haman, recorded in this chapter, and in his subsequent fall, that God sometimes permits wicked men to arrive at the highest degree of honour and power, but that he soon brings them low, and exposes them to shame and misery. And we learn by the sequel of this history, that he suffered things to proceed to extremities, only the more effectually to confound Haman; and convince the Jews, in a more surprising manner, of his care and protection. We see also the sin and folly of Ahasuerus, in giving credit too easily to Haman’s suggestion against the Jews, by which credulity he had well nigh occasioned many millions of innocent persons to perish. This shows how dangerous it is to listen to detracters, and that we ought never to credit evil reports till we have first inquired and ascertained the truth of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:7-15 Without some acquaintance with the human heart, and the history of mankind, we should not think that any prince could consent to a dreadful proposal, so hurtful to himself. Let us be thankful for mild and just government. Haman inquires, according to his own superstitions, how to find a lucky day for the designed massacre! God's wisdom serves its own purposes by men's folly. Haman has appealed to the lot, and the lot, by delaying the execution, gives judgment against him. The event explains the doctrine of a particular providence over all the affairs of men, and the care of God over his church. Haman was afraid lest the king's conscience should smite him for what he had done; to prevent which, he kept him drinking. This cursed method many often take to drown convictions, and to harden their own hearts, and the hearts of others, in sin. All appeared in a favourable train to accomplish the project. But though sinners are permitted to proceed to the point they aim at, an unseen but almighty Power turns them back. How vain and contemptible are the strongest assaults against Jehovah! Had Haman obtained his wish, and the Jewish nation perished, what must have become of all the promises? How could the prophecies concerning the great Redeemer of the world have been fulfilled? Thus the everlasting covenant itself must have failed, before this diabolical project could take place.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Present, the Jews keep three days - the 13th, the 14th, and the 15th of Adar - as connected with \"the Feast of Purim;\" but they make the 13th a fast, commemorative of the fast of Esther Est 4:16, and keep the feast itself on the 14th and 15th of Adar. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12-15. Then were the king's scribes called … and there was written—The government secretaries were employed in making out the proclamation authorizing a universal massacre of the Jews on one day. It was translated into the dialects of all the people throughout the vast empire, and swift messengers were sent to carry it into all the provinces. On the day appointed, all Jews were to be put to death and their property confiscated; doubtless, the means by which Haman hoped to pay his stipulated tribute into the royal treasury. To us it appears unaccountable how any sane monarch could have given his consent to the extirpation of a numerous class of his subjects. But such acts of frenzied barbarity have, alas! been not rarely authorized by careless and voluptuous despots, who have allowed their ears to be engrossed and their policy directed by haughty and selfish minions, who had their own passions to gratify, their own ends to serve.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The copy of the writing, for a commandment to be given in every province, was published unto all people,.... Not only letters were sent to the governors, but a copy, or the sum of the contents of them, was published by heralds, or stuck up as with us, in various places, that it might be publicly known by the common people everywhere: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that they should be ready against that day; and fall upon the people of the Jews, and slay them, and seize on their goods as a prey. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that they should be ready against that day; and fall upon the people of the Jews, and slay them, and seize on their goods as a prey. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The copy of the writing for a commandment to be given in every province was published unto all people, that they should be ready against that day.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A copy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word in the original is of Persian origin, and occurs again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that the decree should be given out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The marg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to be given out for a decree",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is probably better, the writing and the decree being one and the same.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unto all the peoples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that they should be ready against that day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A few weeks would suffice for the edict to reach even remote provinces of the Empire. Thus the Jews’ enemies would have ample time to make preparations for the carrying out of its purpose. It is of course obvious that the intended victims would also hereby be given an opportunity of defending themselves; and this must be acknowledged to be a difficulty, if we assume the accuracy of the dates given for the successive parts of the transaction. Clearly, however, we are not in a position to impugn their accuracy by conjecturing a shorter interval between the inception of the scheme and the date appointed for its execution, inasmuch as a considerable time is demanded by the exigencies of the narrative for circumstances attending the overthrow of Haman, the change in the king’s sentiments, and the transmission of letters permitting the Jews to defend themselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The exact import of this verse is uncertain. Some suppose it to be a mere heading to a copy of the decree, which was originally inserted in the text between verses 14 and 15. In this case the translation should be Ñ \"A copy of the writing for giving commandment to every province, published to all peoples, that they should be ready against that day.\" Esther 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The copy of the writing, that the law might be given in every province, was opened to all people, that they might be ready by this day. This verse does not announce a copy of the royal decree that had been prepared and sent by the posts, which would in that case be replaced by a mere allusion to its contents (Bertheau). The words contain no trace of an announcement such as we find in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the historical notice, that the copy of the writing which was sent as a law into the provinces was גּלוּי, opened, i.e., sent unclosed or unsealed to all people. גּלוּי is the predicate to the subject וגו פּתשׁגן (comp. on this word the note to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and between the subject and predicate is inserted the infinitive clause וגו דּת להנּתן for the purpose of once more briefly mentioning the contents and destination of the כּתב: that a law might be given in every province. To attain this object the more certainly, the copy of the decree, which was brought into every province by the posts, was open or unsealed, that all people might read its contents, and keep themselves in readiness for the execution of what was therein commanded on the appointed day. הזּה ליּום is the thirteenth day of the twelfth month named in the letter.",
        "children": []
      }
    ]
  }
]