[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He put on righteousness . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The close parallelism with Isaiah 11 points, as far as it goes, to identity of authorship; and that with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 6:14-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " suggests a new significance for St. Paul’s “whole armour of God.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The garments of vengeance . . .—As parts of a warrior’s dress the “garments” are the short tunic, or tabard, which hung over the breast-plate; the “cloke” the scarlet mantle (the chlamys of the Roman soldier), its colour probably making it a fit symbol of the zeal of Jehovah.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The garments of vengeance . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—As parts of a warrior’s dress the “garments” are the short tunic, or tabard, which hung over the breast-plate; the “cloke” the scarlet mantle (the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "chlamys ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of the Roman soldier), its colour probably making it a fit symbol of the zeal of Jehovah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 59:17-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:17-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For he put on righteousness as a breast-plate ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— God, resolving to appear as a man of war, puts on his armour; he calls ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "breast-plate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to show the justness of his cause, as also his faithfulness in making good his promises. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And a helmet of salvation upon his head ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As the breast-plate is to defend the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "whereby God signifies the justness of his cause, and his faithfulness; so the helmet is to defend the head, the fountain of knowledge and wisdom, and therefore by this piece of armour God would have us to know that he can neither be deceived nor disappointed with regard to the execution of his designs, for the salvation of his faithful and obedient people; but will, without fail, carry them into effect. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he put on the garments of vengeance ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Or garments made of vengeance: as God is said to put on the former for their sakes whom he would preserve, so he puts on these for their sakes whom he will destroy, namely, his people’s enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Was clad with zeal ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— For his own honour, and for his people’s welfare. The sum of all these expressions is, to describe both the cause and effect together; the cause was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "zeal ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in God; the effect, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "salvation ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to his people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and vengeance ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "on his enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "According to their deeds ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "גמלות",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "recompenses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "deserts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, he will recompense his adversaries with those effects of his fury that they have deserved. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To the islands he will repay recompense ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He will execute judgment on his enemies to the most remote parts of the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "59:16-21 This passage is connected with the following chapters. It is generally thought to describe the coming of the Messiah, as the Avenger and Deliverer of his church. There was none to intercede with God to turn away his wrath; none to interpose for the support of justice and truth. Yet He engaged his own strength and righteousness for his people. God will make his justice upon the enemies of his church and people plainly appear. When the enemy threatens to bear down all without control, then the Spirit of the Lord shall stop him, put him to flight. He that has delivered, will still deliver. A far more glorious salvation is promised to be wrought out by the Messiah in the fulness of time, which all the prophets had in view. The Son of God shall come to us to be our Redeemer; the Spirit of God shall come to be our Sanctifier: thus the Comforter shall abide with the church for ever, Joh 14:16. The word of Christ will always continue in the mouths of the faithful; and whatever is pretended to be the mind of the Spirit, must be tried by the Scriptures. We must lament the progress of infidelity and impiety. But the cause of the Redeemer shall gain a complete victory even on earth, and the believer will be more than conqueror when the Lord receives him to his glory in heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For he put on righteousness - That is, God the Redeemer. The prophet here introduces him as going forth to vindicate his people clad like an ancient warrior. In the declaration that he 'put on righteousness,' the essential idea is, that he was pure and holy. The same image is used by the prophet in another figure in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the note at that place).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As a breastplate - The breastplate was a well-known piece of ancient armor, designed to defend the breast from the darts and the sword of an enemy. The design here is, to represent the Redeemer as a hero; and accordingly allusion is made to the various parts of the armor of a warrior. Yet he was not to be literally armed for battle. Instead of being an earthly conqueror, clad in steel, and defended with brass, his weapons were moral weapons, and his conquests were spiritual. The various parts of his weapons were 'righteousness.' 'salvation,' and 'zeal.' This statement should have been, in itself, sufficient to keep the Jews front anticipating a Messiah who would be a bloody warrior and distinguished for deeds of conquest and blood. This figure of speech is not uncommon. Paul (in Ephesians 6:14-17; compare 2 Corinthians 6:7) has carried it out to greater length, and introduced more particulars in the description of the spiritual armor of the Christian.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As a breastplate - The breastplate was a well-known piece of ancient armor, designed to defend the breast from the darts and the sword of an enemy. The design here is, to represent the Redeemer as a hero; and accordingly allusion is made to the various parts of the armor of a warrior. Yet he was not to be literally armed for battle. Instead of being an earthly conqueror, clad in steel, and defended with brass, his weapons were moral weapons, and his conquests were spiritual. The various parts of his weapons were 'righteousness.' 'salvation,' and 'zeal.' This statement should have been, in itself, sufficient to keep the Jews front anticipating a Messiah who would be a bloody warrior and distinguished for deeds of conquest and blood. This figure of speech is not uncommon. Paul (in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 6:14-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 6:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") has carried it out to greater length, and introduced more particulars in the description of the spiritual armor of the Christian.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And an helmet of salvation - The helmet was a piece of defensive armor for the head. It was made of iron or brass, and usually surmounted by a crest of hair. It was designed to guard the head from the stroke of a sword. No particular stress should be laid on the fact, that it is said that 'salvation' would be the helmet. The design is to represent the Redeemer by the figure of a hero clad in armor, yet there seems to be no particular reason why salvation should be referred to as the helmet, or righteousness as the cuirass or breastplate. Nothing is gained by a fanciful attempt to spiritualize or explain them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he put on the garments of vengeance for clothing - By 'garments,' here, Vitringa supposes that there is reference to the interior garments which were worn by the Orientals corresponding to the tunic of the Romans. But it is more probable that the allusion is to the other parts of the dress or armor in general of the ancient warrior. The statement that he was clad in the garments of vengeance means, that he would go forth to vindicate his people, and to take vengeance on his foes. It would not be for mere defense that he would be thus armed for battle; but he would go forth for aggressive movements, in subduing his enemies and delivering his people (compare Isaiah 63:1-6).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he put on the garments of vengeance for clothing - By 'garments,' here, Vitringa supposes that there is reference to the interior garments which were worn by the Orientals corresponding to the tunic of the Romans. But it is more probable that the allusion is to the other parts of the dress or armor in general of the ancient warrior. The statement that he was clad in the garments of vengeance means, that he would go forth to vindicate his people, and to take vengeance on his foes. It would not be for mere defense that he would be thus armed for battle; but he would go forth for aggressive movements, in subduing his enemies and delivering his people (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 63:1-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And was clad with zeal as a cloak - The cloak worn by men in military as well as in civil life, was a loose flowing robe or mantle that was thrown over the body, usually fastened on the right shoulder by a hook or clasp, and suffered to flow in graceful folds down to the feet. In battle, it would be laid aside, or secured by a girdle about the loins. Vitringa remarks, that, as it was usually of purple color, it was adapted to represent the zeal which would burn for vengeance on an enemy. But the whole figure here is that drawn from a warrior or a conqueror: a hero prepared alike for defense and offence. The idea is, that he would be able to defend and vindicate his people, and to carry on aggressive warfare against his enemies. But it was not to be a warfare literally of blood and carnage. It was to be such as would be accomplished by righteousness, and zeal, and a desire to secure salvation. The triumph of righteousness was the great object still; the conquests of the Redeemer were to be those of truth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And was clad with zeal as a cloak - The cloak worn by men in military as well as in civil life, was a loose flowing robe or mantle that was thrown over the body, usually fastened on the right shoulder by a hook or clasp, and suffered to flow in graceful folds down to the feet. In battle, it would be laid aside, or secured by a girdle about the loins. Vitringa remarks, that, as it was usually of purple color, it was adapted to represent the zeal which would burn for vengeance on an enemy. But the whole figure here is that drawn from a warrior or a conqueror: a hero prepared alike for defense and offence. The idea is, that he would be able to defend and vindicate his people, and to carry on aggressive warfare against his enemies. But it was not to be a warfare literally of blood and carnage. It was to be such as would be accomplished by righteousness, and zeal, and a desire to secure salvation. The triumph of righteousness was the great object still; the conquests of the Redeemer were to be those of truth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. Messiah is represented as a warrior armed at all points, going forth to vindicate His people. Owing to the unity of Christ and His people, their armor is like His, except that they have no \"garments of vengeance\" (which is God's prerogative, Ro 12:19), or \"cloak of zeal\" (in the sense of judicial fury punishing the wicked; this zeal belongs properly to God, 2Ki 10:16; Ro 10:2; Php 3:6; \"zeal,\" in the sense of anxiety for the Lord's honor, they have, Nu 25:11, 13; Ps 69:9; 2Co 7:11; 9:2); and for \"salvation,\" which is of God alone (Ps 3:8), they have as their helmet, \"the hope of salvation\" (1Th 5:8). The \"helmet of salvation\" is attributed to them (Eph 6:14, 17) in a secondary sense; namely, derived from Him, and as yet only in hope, not fruition (Ro 8:24). The second coming here, as often, is included in this representation of Messiah. His \"zeal\" (Joh 2:15-17) at His first coming was but a type of His zeal and vengeance against the foes of God at His second coming (2Th 1:8-10; Re 19:11-21).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He put on righteousness as a breastplate; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God, resolving to appear as a man of war against Babylon, that did now oppress his people, puts on his arms, Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wrapped himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and particularly his ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "breastplate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which he calls ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to show the justness of his cause, as also his faithfulness in making good his promises to his people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "An helmet:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "breastplate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to defend the heart and vital parts, whereby God doth signify the innocency and justness of his cause, as well as his faithfulness; so the ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "helmet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to defend the brain, the fountain of the animal spirits, and therefore by this piece of armour would have us know that he is invincible: as by the other, that he defends a just cause in his truth and faithfulness; so by this, that he cannot be disappointed in it by reason of his power and invincibleness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The garments of vengeance, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or garments made of vengeance; as God is said to put on the former for their sakes whom he would preserve, so he puts on these for their sakes whom he will destroy, viz. his people’s enemies, the Chaldeans, and other enemies of the Jews. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Was clad with zeal; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Zeal to his own honour, which had been given to idols; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Zeal for his own people, who were now in distress; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. Zeal and indignation against the Babylonians, who were such great oppressors of his people, which are the materials that his garment of vengeance and his cloak of zeal is made of. It may be trifling to follow the metaphor of garments too close: see of the phrase ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Judges 6:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 6:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", margin. The sum of all these expressions is this, to describe both the cause and effect together; the cause was righteousness and zeal in God, the effect salvation to his people, and vengeance on his enemies, as is evident from the next verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For he put on righteousness as a breastplate,.... Here the Lord is represented as a warrior clothed with armour, and as Christ is, and as he will appear in the latter day on the behalf of his people, and against their enemies, who is called faithful and true, and in righteousness will make war, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he will proceed according to justice and equity in righting the wrongs and avenging the injuries of his people; and both in saving them, and destroying their enemies, he will secure the honour of his faithfulness and justice, and the credit of his name and character; which will be preserved by his conduct, as the breast and inward parts are by the breastplate: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and an helmet of salvation upon his head; the salvation he will work out for his people will be very conspicuous; it will be seen by all, as the helmet on the head; and he will have the glory of it, on whose head are many crowns, Revelation 19:12. The apostle has borrowed these phrases from hence, and applied them to the Christian armour, Ephesians 6:14, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and an helmet of salvation upon his head; the salvation he will work out for his people will be very conspicuous; it will be seen by all, as the helmet on the head; and he will have the glory of it, on whose head are many crowns, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The apostle has borrowed these phrases from hence, and applied them to the Christian armour, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 6:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and he put on the garments of vengeance for clothing; or, \"he clothed himself with vengeance as a garment\" (k); he wrapped himself in it, and resolved to execute it on his and his people's enemies; the time being come to avenge the blood of his servants, by shedding the blood of their adversaries, with which his garments will be stained; and therefore is represented as having on a vesture dipped in blood, Revelation 19:13, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he put on the garments of vengeance for clothing; or, \"he clothed himself with vengeance as a garment\" (k); he wrapped himself in it, and resolved to execute it on his and his people's enemies; the time being come to avenge the blood of his servants, by shedding the blood of their adversaries, with which his garments will be stained; and therefore is represented as having on a vesture dipped in blood, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 19:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and was clad with zeal as a cloak; with zeal for his own glory, and the interest of his people, and against antichrist, and all antichristian worship and doctrine; and therefore his eyes are said to be as a flame of fire, Revelation 19:12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and was clad with zeal as a cloak; with zeal for his own glory, and the interest of his people, and against antichrist, and all antichristian worship and doctrine; and therefore his eyes are said to be as a flame of fire, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k)   \"et ultionem induit tanquam vestem\", Tigurine version. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k)   \"et ultionem induit tanquam vestem\", Tigurine version. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For he put on righteousness as a breastplate, and an {q} helmet of salvation upon his head; and he put on the garments of vengeance for clothing, and was clad with zeal as a cloke.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For he put on righteousness as a breastplate, and an ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " helmet of salvation upon his head; and he put on the garments of vengeance ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "for",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " clothing, and was clad with zeal as a cloke.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) Signifying that God has all means at hand to deliver his Church and to punish their enemies.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The idea of Jehovah as a warrior occurs several times in this book (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 52:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but the fully developed image of His arming Himself with His own attributes has no exact parallel in the O.T. (cf. however, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is reproduced and further elaborated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Wis 5:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; and in the N. T. it suggests the figure of the Christian armour (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he put on righteousness as a coat of mail",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (R.V. marg.). “Righteousness,” as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 59:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", is a divine attribute,—zeal for the right, the stedfast purpose to establish righteousness (and its correlate, salvation) on the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "zeal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He put on righteousness as a breastplate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Isaiah anthropomorphism is far less gross than the Homeric. The gods in Homer put on actual armour, and take sword and shield. Jehovah arms himself for the battle in a way that is manifestly metaphoric. He puts on a \"Divine panoply\"  - righteousness as his breastplate, salvation as his helmet, vengeance for garments, and zeal, or jealousy, for a cloak. He takes no offensive weapons - \"the out-breathing of his Spirit (ver. 19) is enough\" (Kay). Isaiah 59:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The confession of personal sins is followed by that of the sinful state of society. \"And right is forced back, and righteousness stands afar off; for truth has fallen in the market-place, and honesty finds no admission. And truth became missing, and he who avoids evil is outlawed.\" In connection with mishpât and tsedâqâh here, we have not to think of the manifestation of divine judgment and justice which is prevented from being realized; but the people are here continuing the confession of their own moral depravity. Right has been forced back from the place which it ought to occupy (hissı̄g is the word applied in the law to the removal of boundaries), and righteousness has to look from afar off at the unjust habits of the people, without being able to interpose. And why are right and righteousness - that united pair so pleasing to God and beneficial to man - thrust out of the nation, and why do they stand without? Because there is no truth or uprightness in the nation. Truth wanders about, and stands no longer in the midst of the nation; but upon the open street, the broad market-place, where justice is administered, and where she ought above all to stand upright and be preserved upright, she has stumbled and fallen down (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and honesty (nekhōchâh), which goes straight forward, would gladly enter the limits of the forum, but she cannot: people and judges alike form a barrier which keeps her back. The consequence of this is indicated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 59:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": truth in its manifold practical forms has become a missing thing; and whoever avoids the existing voice is mishtōlēl (part. hithpoel, not hithpoal), one who is obliged to let himself be plundered and stripped (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 76:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to be made a shōlâl (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Arab. maslûb, with a passive turn given to the reflective meaning, as in התחפּשׂ, to cause one's self to be spied out  equals  to disguise one's self, and as in the so-called niphal tolerativum (Ewald, 133, b, 2).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The third strophe of the prophecy commences at Isaiah 59:15 or Isaiah 59:16. It begins with threatening, and closes with promises; for the true nature of God is love, and every manifestation of wrath is merely one phase in its development. In consideration of the fact that this corrupt state of things furnishes no prospect of self-improvement, Jehovah has already equipped Himself for judicial interposition. \"And Jehovah saw it, and it was displeasing in His eyes, that there was no right. And He saw that there was not a man anywhere, and was astonished that there was nowhere an intercessor: then His arm brought Him help, and His righteousness became His stay. And He put on righteousness as a coat of mail, and the helmet of salvation upon His head; and put on garments of vengeance as armour, and clothed Himself in zeal as in a cloak. According to the deeds, accordingly He will repay: burning wrath to His adversaries, punishment to His foes; the islands He will repay with chastisement.\" The prophet's language has now toilsomely worked its way through the underwood of keen reproach, of dark descriptions of character, and of mournful confession which has brought up the apostasy of the great mass in all the blacker colours before his mind, from the fact that the confession proceeds from those who are ready for salvation. And now, having come to the description of the approaching judgment, out of whose furnace the church of the future is to spring, it rises again like a palm-tree that has been violently hurled to the ground, and shakes its head as if restored to itself in the transforming ether of the future. Jehovah saw, and it excited His displeasure (\"it was evil in His eyes,\" an antiquated phrase from the Pentateuch, e.g., Genesis 38:10) to see that right (which He loves, Isaiah 61:8; Psalm 37:28) had vanished form the life of His nation. He saw that there was no man there, no man possessing either the disposition or the power to stem this corruption (אישׁ as in Jeremiah 5:1, cf., 1 Samuel 4:9; 1 Kings 2:2, and the old Jewish saying, \"Where there is no man, I strive to be a man\"). He was astonished (the sight of such total depravity exciting in Him the highest degree of compassion and displeasure) that there was no מפגּיע, i.e., no one to step in between God and the people, and by his intercession to press this disastrous condition of the people upon the attention of God (see Isaiah 53:12); no one to form a wall against the coming ruin, and cover the rent with his body; no one to appease the wrath, like Aaron (Numbers 17:12-13) or Phinehas (Numbers 25:7). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The third strophe of the prophecy commences at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It begins with threatening, and closes with promises; for the true nature of God is love, and every manifestation of wrath is merely one phase in its development. In consideration of the fact that this corrupt state of things furnishes no prospect of self-improvement, Jehovah has already equipped Himself for judicial interposition. \"And Jehovah saw it, and it was displeasing in His eyes, that there was no right. And He saw that there was not a man anywhere, and was astonished that there was nowhere an intercessor: then His arm brought Him help, and His righteousness became His stay. And He put on righteousness as a coat of mail, and the helmet of salvation upon His head; and put on garments of vengeance as armour, and clothed Himself in zeal as in a cloak. According to the deeds, accordingly He will repay: burning wrath to His adversaries, punishment to His foes; the islands He will repay with chastisement.\" The prophet's language has now toilsomely worked its way through the underwood of keen reproach, of dark descriptions of character, and of mournful confession which has brought up the apostasy of the great mass in all the blacker colours before his mind, from the fact that the confession proceeds from those who are ready for salvation. And now, having come to the description of the approaching judgment, out of whose furnace the church of the future is to spring, it rises again like a palm-tree that has been violently hurled to the ground, and shakes its head as if restored to itself in the transforming ether of the future. Jehovah saw, and it excited His displeasure (\"it was evil in His eyes,\" an antiquated phrase from the Pentateuch, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 38:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") to see that right (which He loves, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 61:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") had vanished form the life of His nation. He saw that there was no man there, no man possessing either the disposition or the power to stem this corruption (אישׁ as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the old Jewish saying, \"Where there is no man, I strive to be a man\"). He was astonished (the sight of such total depravity exciting in Him the highest degree of compassion and displeasure) that there was no מפגּיע, i.e., no one to step in between God and the people, and by his intercession to press this disastrous condition of the people upon the attention of God (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); no one to form a wall against the coming ruin, and cover the rent with his body; no one to appease the wrath, like Aaron (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 17:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") or Phinehas (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 25:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "What the fut. consec. affirms from ותּושׁע onwards, is not something to come, but something past, as distinguished form the coming events announced from Isaiah 59:18 onwards. Because the nation was so utterly and deeply corrupt, Jehovah had quipped Himself for judicial interposition. The equipment was already completed; only the taking of vengeance remained to be effected. Jehovah saw no man at His side who was either able or willing to help Him to His right in opposition to the prevailing abominations, or to support His cause. Then His own arm became His help, and His righteousness His support (cf., Isaiah 63:5); so that He did not desist from the judgment to which He felt Himself impelled, until He had procured the fullest satisfaction for the honour of His holiness (Isaiah 5:16). The armour which Jehovah puts on is now described. According to the scriptural view, Jehovah is never unclothed; but the free radiation of His own nature shapes itself into a garment of light. Light is the robe He wears (Psalm 104:2). When the prophet describes this garment of light as changed into a suit of armour, this must be understood in the same sense as when the apostle in Eph speaks of a Christian's panoply. Just as there the separate pieces of armour represent the manifold self-manifestations of the inward spiritual life so here the pieces of Jehovah's armour stand for the manifold self-manifestations of His holy nature, which consists of a mixture of wrath and love. He does not arm Himself from any outward armoury; but the armoury is His infinite wrath and His infinite love, and the might in which He manifests Himself in such and such a way to His creatures is His infinite will. He puts on righteousness as a coat of mail (שׁרין in half pause, as in 1 Kings 22:34 in full pause, for שׁריון, ō passing into the broader a, as is generally the case in יחפּץ, יחבשׁ; also in Genesis 43:14, שׁכלתי; Genesis 49:3, עז; Genesis 49:27, יטרף), so that His appearance on every side is righteousness; and on His head He sets the helmet of salvation: for the ultimate object for which He goes into the conflict is the redemption of the oppressed, salvation as the fruit of the victory gained by righteousness. And over the coat of mail He draws on clothes of vengeance as a tabard (lxx περιβόλαιον), and wraps Himself in zeal as in a war-cloak. The inexorable justice of God is compared to an impenetrable brazen coat of mail; His joyful salvation, to a helmet which glitters from afar; His vengeance, with its manifold inflictions of punishment, to the clothes worn above the coat of mail; and His wrathful zeal (קנאה from קנא), to be deep red) with the fiery-looking chlamys. No weapon is mentioned, neither the sword nor bow; for His own arm procures Him help, and this alone. But what will Jehovah do, when He has armed Himself thus with justice and salvation, vengeance and zeal? As Isaiah 59:18 affirms, He will carry out a severe and general retributive judgment. גּמוּל and גּמלה signify accomplishment of (on gâmal, see at Isaiah 3:9) a ῥῆμα μέσον; גּמלות, which may signify, according to the context, either manifestations of love or manifestations of wrath, and either retribution as looked at from the side of God, or forfeiture as regarded from the side of man, has the latter meaning here, viz., the works of men and the double-sided gemūl, i.e., repayment, and that in the infliction of punishment. כּעל, as if, as on account of, signifies, according to its Semitic use, in the measure (כּ) of that which is fitting (על); cf., Isaiah 63:7, uti par est propter. It is repeated with emphasis (like לכן in Isaiah 52:6); the second stands without rectum, as the correlate of the first. By the adversaries and enemies, we naturally understand, after what goes before, the rebellious Israelites. The prophet does not mention these, however, but \"the islands,\" that is to say, the heathen world. He hides the special judgment upon Israel in the general judgment upon the nations. The very same fate falls upon Israel, the salt of the world which has lost its savour, as upon the whole of the ungodly world. The purified church will have its place in the midst of a world out of which the crying injustice has been swept away. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "What the fut. consec. affirms from ותּושׁע onwards, is not something to come, but something past, as distinguished form the coming events announced from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " onwards. Because the nation was so utterly and deeply corrupt, Jehovah had quipped Himself for judicial interposition. The equipment was already completed; only the taking of vengeance remained to be effected. Jehovah saw no man at His side who was either able or willing to help Him to His right in opposition to the prevailing abominations, or to support His cause. Then His own arm became His help, and His righteousness His support (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 63:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); so that He did not desist from the judgment to which He felt Himself impelled, until He had procured the fullest satisfaction for the honour of His holiness (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The armour which Jehovah puts on is now described. According to the scriptural view, Jehovah is never unclothed; but the free radiation of His own nature shapes itself into a garment of light. Light is the robe He wears (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). When the prophet describes this garment of light as changed into a suit of armour, this must be understood in the same sense as when the apostle in Eph speaks of a Christian's panoply. Just as there the separate pieces of armour represent the manifold self-manifestations of the inward spiritual life so here the pieces of Jehovah's armour stand for the manifold self-manifestations of His holy nature, which consists of a mixture of wrath and love. He does not arm Himself from any outward armoury; but the armoury is His infinite wrath and His infinite love, and the might in which He manifests Himself in such and such a way to His creatures is His infinite will. He puts on righteousness as a coat of mail (שׁרין in half pause, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 22:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in full pause, for שׁריון, ō passing into the broader a, as is generally the case in יחפּץ, יחבשׁ; also in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 43:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", שׁכלתי; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", עז; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", יטרף), so that His appearance on every side is righteousness; and on His head He sets the helmet of salvation: for the ultimate object for which He goes into the conflict is the redemption of the oppressed, salvation as the fruit of the victory gained by righteousness. And over the coat of mail He draws on clothes of vengeance as a tabard (lxx περιβόλαιον), and wraps Himself in zeal as in a war-cloak. The inexorable justice of God is compared to an impenetrable brazen coat of mail; His joyful salvation, to a helmet which glitters from afar; His vengeance, with its manifold inflictions of punishment, to the clothes worn above the coat of mail; and His wrathful zeal (קנאה from קנא), to be deep red) with the fiery-looking chlamys. No weapon is mentioned, neither the sword nor bow; for His own arm procures Him help, and this alone. But what will Jehovah do, when He has armed Himself thus with justice and salvation, vengeance and zeal? As ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " affirms, He will carry out a severe and general retributive judgment. גּמוּל and גּמלה signify accomplishment of (on gâmal, see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") a ῥῆμα μέσον; גּמלות, which may signify, according to the context, either manifestations of love or manifestations of wrath, and either retribution as looked at from the side of God, or forfeiture as regarded from the side of man, has the latter meaning here, viz., the works of men and the double-sided gemūl, i.e., repayment, and that in the infliction of punishment. כּעל, as if, as on account of, signifies, according to its Semitic use, in the measure (כּ) of that which is fitting (על); cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 63:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", uti par est propter. It is repeated with emphasis (like לכן in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); the second stands without rectum, as the correlate of the first. By the adversaries and enemies, we naturally understand, after what goes before, the rebellious Israelites. The prophet does not mention these, however, but \"the islands,\" that is to say, the heathen world. He hides the special judgment upon Israel in the general judgment upon the nations. The very same fate falls upon Israel, the salt of the world which has lost its savour, as upon the whole of the ungodly world. The purified church will have its place in the midst of a world out of which the crying injustice has been swept away. ",
            "children": []
          }
        ]
      }
    ]
  }
]