[{"header":"Jonathan's Daring Deed"},{"num":14,"verse":"One day Jonathan said to the young man who carried his weapons, “Let's go across to the Philistine camp.” But Jonathan did not tell his father Saul, "},{"num":2,"verse":"who was camping under a pomegranate tree in Migron, not far from Gibeah; he had about six hundred men with him. "},{"num":3,"verse":"(The priest carrying the ephod was Ahijah, the son of Ichabod's brother Ahitub, who was the son of Phinehas and grandson of Eli, the priest of the Lord in Shiloh.) The men did not know that Jonathan had left."},{"num":4,"verse":"In Michmash Pass, which Jonathan had to go through to get over to the Philistine camp, there were two large jagged rocks, one on each side of the pass: one was called Bozez and the other Seneh. "},{"num":5,"verse":"One was on the north side of the pass, facing Michmash, and the other was on the south side, facing Geba."},{"num":6,"verse":"Jonathan said to the young man, “Let's cross over to the camp of those heathen Philistines. Maybe the Lord will help us; if he does, nothing can keep him from giving us the victory, no matter how few of us there are.”"},{"num":7,"verse":"The young man answered, “Whatever you want to do, I'm with you.”"},{"num":8,"verse":"“All right,” Jonathan said. “We will go across and let the Philistines see us. "},{"num":9,"verse":"If they tell us to wait for them to come to us, then we will stay where we are. "},{"num":10,"verse":"But if they tell us to go to them, then we will, because that will be the sign that the Lord has given us victory over them.”"},{"num":11,"verse":"So they let the Philistines see them, and the Philistines said, “Look! Some Hebrews are coming out of the holes they have been hiding in!” "},{"num":12,"verse":"Then they called out to Jonathan and the young man, “Come on up here! We have something to tell you!”"},{"num":13,"verse":"Jonathan climbed up out of the pass on his hands and knees, and the young man followed him. Jonathan attacked the Philistines and knocked them down, and the young man killed them. "},{"num":14,"verse":"In that first slaughter Jonathan and the young man killed about twenty men in an area of about half an acre. "},{"num":15,"verse":"All the Philistines in the countryside were terrified; the raiders and the soldiers in the camp trembled with fear; the earth shook, and there was great panic."},{"header":"The Defeat of the Philistines"},{"num":16,"verse":"Saul's men on watch at Gibeah in the territory of Benjamin saw the Philistines running in confusion. "},{"num":17,"verse":"So Saul said to his men, “Count the soldiers and find out who is missing.” They did so and found that Jonathan and the young man who carried his weapons were missing. "},{"num":18,"verse":"“Bring the ephod here,” Saul said to Ahijah the priest. (On that day Ahijah was carrying it in front of the people of Israel.) "},{"num":19,"verse":"As Saul was speaking to the priest, the confusion in the Philistine camp kept getting worse, so Saul said to him, “There's no time to consult the Lord!” "},{"num":20,"verse":"Then he and his men marched into battle against the Philistines, who were fighting each other in complete confusion. "},{"num":21,"verse":"Some Hebrews, who had been on the Philistine side and had gone with them to the camp, changed sides again and joined Saul and Jonathan. "},{"num":22,"verse":"Others, who had been hiding in the hills of Ephraim, heard that the Philistines were running away, so they also joined in and attacked the Philistines, "},{"num":23,"verse":"fighting all the way beyond Bethaven. The Lord saved Israel that day."},{"header":"Events after the Battle"},{"num":24,"verse":"The Israelites were weak with hunger that day, because Saul, with a solemn oath, had given the order: “A curse be on anyone who eats any food today before I take revenge on my enemies.” So nobody had eaten anything all day. "},{"num":25,"verse":"They all came into a wooded area and found honey everywhere. "},{"num":26,"verse":"The woods were full of honey, but no one ate any of it because they were all afraid of Saul's curse. "},{"num":27,"verse":"But Jonathan had not heard his father threaten the people with a curse; so he reached out with the stick he was carrying, dipped it in a honeycomb, and ate some honey. At once he felt much better. "},{"num":28,"verse":"But one of the men told him, “We are all weak from hunger, but your father threatened us and said, ‘A curse be on anyone who eats any food today.’”"},{"num":29,"verse":"Jonathan answered, “What a terrible thing my father has done to our people! See how much better I feel because I ate some honey! "},{"num":30,"verse":"How much better it would have been today if our people had eaten the food they took when they defeated the enemy. Just think how many more Philistines they would have killed!”"},{"num":31,"verse":"That day the Israelites defeated the Philistines, fighting all the way from Michmash to Aijalon. By this time the Israelites were very weak from hunger, "},{"num":32,"verse":"and so they rushed over to what they had captured from the enemy, took sheep and cattle, slaughtered them on the spot, and ate the meat with the blood still in it. "},{"num":33,"verse":"Saul was told, “Look, the people are sinning against the Lord by eating meat with the blood in it.”"},{"num":34,"verse":"Then he gave another order: “Go among the people and tell them all to bring their cattle and sheep here. They are to slaughter them and eat them here; they must not sin against the Lord by eating meat with blood in it.” So that night they all brought their cattle and slaughtered them there. "},{"num":35,"verse":"Saul built an altar to the Lord, the first one that he built."},{"num":36,"verse":"Saul said to his men, “Let's go down and attack the Philistines in the night, plunder them until dawn, and kill them all.”"},{"num":37,"verse":"So Saul asked God, “Shall I attack the Philistines? Will you give us victory?” But God did not answer that day. "},{"num":38,"verse":"Then Saul said to the leaders of the people, “Come here and find out what sin was committed today. "},{"num":39,"verse":"I promise by the living Lord, who gives Israel victory, that the guilty one will be put to death, even if he is my son Jonathan.” But no one said anything. "},{"num":40,"verse":"Then Saul said to them, “All of you stand over there, and Jonathan and I will stand over here.”"},{"num":41,"verse":"Saul said to the Lord, the God of Israel, “Lord, why have you not answered me today? Lord, God of Israel, answer me by the sacred stones. If the guilt is Jonathan's or mine, answer by the Urim; but if it belongs to your people Israel, answer by the Thummim.” The answer indicated Jonathan and Saul; and the people were cleared. "},{"num":42,"verse":"Then Saul said, “Decide between my son Jonathan and me.” And Jonathan was indicated. "},{"num":43,"verse":"Then Saul asked Jonathan, “What have you done?”"},{"num":44,"verse":"Saul said to him, “May God strike me dead if you are not put to death!”"},{"num":45,"verse":"But the people said to Saul, “Will Jonathan, who won this great victory for Israel, be put to death? No! We promise by the living Lord that he will not lose even a hair from his head. What he did today was done with God's help.” So the people saved Jonathan from being put to death."},{"num":46,"verse":"After that, Saul stopped pursuing the Philistines, and they went back to their own territory."},{"header":"Saul's Reign and Family"},{"num":47,"verse":"After Saul became king of Israel, he fought all his enemies everywhere: the people of Moab, of Ammon, and of Edom, the kings of Zobah, and the Philistines. Wherever he fought he was victorious. "},{"num":48,"verse":"He fought heroically and defeated even the people of Amalek. He saved the Israelites from all attacks."},{"num":49,"verse":"Saul's sons were Jonathan, Ishvi, and Malchishua. His older daughter was named Merab, and the younger one Michal. "},{"num":50,"verse":"His wife was Ahinoam, the daughter of Ahimaaz; his army commander was his cousin Abner, the son of his uncle Ner. "},{"num":51,"verse":"Saul's father Kish and Abner's father Ner were sons of Abiel."},{"num":52,"verse":"As long as he lived, Saul had to fight fiercely against the Philistines. So whenever he found a man who was strong or brave, he would enlist him in his army."}]