[{"num":14,"verse":"One day Jonathan, Saul’s son, said to the officer who carried his armor, “Come, let’s go over to the Philistine camp on the other side.” But Jonathan did not tell his father."},{"num":2,"verse":"Saul was sitting under a pomegranate tree at the threshing floor near Gibeah. He had about six hundred men with him. "},{"num":3,"verse":"One man was Ahijah who was wearing the holy vest. (Ahijah was a son of Ichabod’s brother Ahitub. Ichabod was the son of Phinehas, the son of Eli, the Lord’s priest in Shiloh.) No one knew Jonathan had left."},{"num":4,"verse":"There was a steep slope on each side of the pass that Jonathan planned to go through to reach the Philistine camp. The cliff on one side was named Bozez, and the cliff on the other side was named Seneh. "},{"num":5,"verse":"One cliff faced north toward Micmash. The other faced south toward Geba."},{"num":6,"verse":"Jonathan said to his officer who carried his armor, “Come. Let’s go to the camp of those men who are not circumcised. Maybe the Lord will help us. The Lord can give us victory if we have many people, or just a few.”"},{"num":7,"verse":"The officer who carried Jonathan’s armor said to him, “Do whatever you think is best. Go ahead. I’m with you.”"},{"num":8,"verse":"Jonathan said, “Then come. We will cross over to the Philistines and let them see us. "},{"num":9,"verse":"If they say to us, ‘Stay there until we come to you,’ we will stay where we are. We won’t go up to them. "},{"num":10,"verse":"But if they say, ‘Come up to us,’ we will climb up, and the Lord will let us defeat them. This will be the sign for us.”"},{"num":11,"verse":"When both Jonathan and his officer let the Philistines see them, the Philistines said, “Look! The Hebrews are crawling out of the holes they were hiding in!” "},{"num":12,"verse":"The Philistines in the camp shouted to Jonathan and his officer, “Come up to us. We’ll teach you a lesson!”"},{"num":13,"verse":"So Jonathan climbed up, using his hands and feet, and his officer climbed just behind him. Jonathan struck down the Philistines as he went, and his officer killed them as he followed behind him. "},{"num":14,"verse":"In that first fight Jonathan and his officer killed about twenty Philistines over a half acre of ground."},{"num":15,"verse":"All the Philistine soldiers panicked—those in the camp and those in the raiding party. The ground itself shook! God had caused the panic."},{"num":16,"verse":"Saul’s guards were at Gibeah in the land of Benjamin when they saw the Philistine soldiers running in every direction. "},{"num":17,"verse":"Saul said to his army, “Check to see who has left our camp.” When they checked, they learned that Jonathan and his officer were gone."},{"num":18,"verse":"So Saul said to Ahijah the priest, “Bring the Ark of God.” (At that time it was with the Israelites.) "},{"num":19,"verse":"While Saul was talking to the priest, the confusion in the Philistine camp was growing. Then Saul said to Ahijah, “Put your hand down!”"},{"num":20,"verse":"Then Saul gathered his army and entered the battle. They found the Philistines confused, striking each other with their swords! "},{"num":21,"verse":"Earlier, there were Hebrews who had served the Philistines and had stayed in their camp, but now they joined the Israelites with Saul and Jonathan. "},{"num":22,"verse":"When all the Israelites hidden in the mountains of Ephraim heard that the Philistine soldiers were running away, they also joined the battle and chased the Philistines. "},{"num":23,"verse":"So the Lord saved the Israelites that day, and the battle moved on past Beth Aven."},{"header":"Saul Makes Another Mistake"},{"num":24,"verse":"The men of Israel were miserable that day because Saul had made an oath for all of them. He had said, “No one should eat food before evening and before I finish defeating my enemies. If he does, he will be cursed!” So no Israelite soldier ate food."},{"num":25,"verse":"Now the army went into the woods, where there was some honey on the ground. "},{"num":26,"verse":"They came upon some honey, but no one took any because they were afraid of the oath. "},{"num":27,"verse":"Jonathan had not heard the oath Saul had put on the army, so he dipped the end of his stick into the honey and lifted some out and ate it. Then he felt better. "},{"num":28,"verse":"Then one of the soldiers told Jonathan, “Your father made an oath for all the soldiers. He said any man who eats today will be cursed! That’s why they are so weak.”"},{"num":29,"verse":"Jonathan said, “My father has made trouble for the land! See how much better I feel after just tasting a little of this honey! "},{"num":30,"verse":"It would have been much better for the men to eat the food they took from their enemies today. We could have killed many more Philistines!”"},{"num":31,"verse":"That day the Israelites defeated the Philistines from Micmash to Aijalon. After that, they were very tired. "},{"num":32,"verse":"They had taken sheep, cattle, and calves from the Philistines. Now they were so hungry they killed the animals on the ground and ate them, without draining the blood from them! "},{"num":33,"verse":"Someone said to Saul, “Look! The men are sinning against the Lord. They’re eating meat without draining the blood from it!”"},{"num":34,"verse":"Then he said, “Go to the men and tell them that each person must bring his ox and sheep to me and kill it here and eat it. Don’t sin against the Lord by eating meat without draining the blood from it.”"},{"num":35,"verse":"Then Saul built an altar to the Lord. It was the first altar he had built to the Lord."},{"num":36,"verse":"Saul said, “Let’s go after the Philistines tonight and rob them. We won’t let any of them live!”"},{"num":37,"verse":"So Saul asked God, “Should I chase the Philistines? Will you let us defeat them?” But God did not answer Saul at that time. "},{"num":38,"verse":"Then Saul said to all the leaders of his army, “Come here. Let’s find out what sin has been done today. "},{"num":39,"verse":"As surely as the Lord lives who has saved Israel, even if my son Jonathan did the sin, he must die.” But no one in the army spoke."},{"num":40,"verse":"Then Saul said to all the Israelites, “You stand on this side. I and my son Jonathan will stand on the other side.”"},{"num":41,"verse":"Then Saul prayed to the Lord, the God of Israel, “Give me the right answer.”"},{"num":42,"verse":"Saul said, “Now let us discover if it is I or Jonathan my son who is guilty.” And Jonathan was picked."},{"num":43,"verse":"Saul said to Jonathan, “Tell me what you have done.”"},{"num":44,"verse":"Saul said, “Jonathan, if you don’t die, may God punish me terribly.”"},{"num":45,"verse":"But the soldiers said to Saul, “Must Jonathan die? Never! He is responsible for saving Israel today! As surely as the Lord lives, not even a hair of his head will fall to the ground! Today Jonathan fought against the Philistines with God’s help!” So the army saved Jonathan, and he did not die."},{"num":46,"verse":"Then Saul stopped chasing the Philistines, and they went back to their own land."},{"header":"Saul Fights Israel’s Enemies"},{"num":47,"verse":"When Saul became king over Israel, he fought against Israel’s enemies all around. He fought Moab, the Ammonites, Edom, the king of Zobah, and the Philistines. Everywhere Saul went he defeated Israel’s enemies. "},{"num":48,"verse":"He fought bravely and defeated the Amalekites. He saved the Israelites from their enemies who had robbed them."},{"num":49,"verse":"Saul’s sons were Jonathan, Ishvi, and Malki-Shua. His older daughter was named Merab, and his younger daughter was named Michal. "},{"num":50,"verse":"Saul’s wife was Ahinoam daughter of Ahimaaz. The commander of his army was Abner son of Ner, Saul’s uncle. "},{"num":51,"verse":"Saul’s father Kish and Abner’s father Ner were sons of Abiel."},{"num":52,"verse":"All Saul’s life he fought hard against the Philistines. When he saw strong or brave men, he took them into his army."}]