[{"num":1,"verse":"One day Jonathan, the son of Saul, spoke to the young man carrying his armor. “Come on,” he said. “Let’s go over to the Philistine army camp on the other side of the pass.” But he didn’t tell his father about it."},{"num":2,"verse":"Saul was staying just outside Gibeah. He was under a pomegranate tree in Migron. He had about 600 men with him. "},{"num":3,"verse":"Ahijah was one of them. He was wearing a sacred linen apron. He was a son of Ichabod’s brother Ahitub. Ahitub was the son of Eli’s son Phinehas. Eli had been the Lord’s priest in Shiloh. No one was aware that Jonathan had left."},{"num":4,"verse":"Jonathan planned to go across the pass to reach the Philistine camp. But there was a cliff on each side of the pass. One cliff was called Bozez. The other was called Seneh. "},{"num":5,"verse":"One cliff stood on the north side of the pass toward Mikmash. The other stood on the south side toward Geba."},{"num":6,"verse":"Jonathan spoke to the young man carrying his armor. He said, “Come on. Let’s go over to the camp of those fellows who aren’t circumcised. Perhaps the Lord will help us. If he does, it won’t matter how many or how few of us there are. That won’t keep the Lord from saving us.”"},{"num":7,"verse":"“Go ahead,” the young man said. “Do everything you have in mind. I’m with you all the way.”"},{"num":8,"verse":"Jonathan said, “Come on, then. We’ll go across the pass toward the Philistines and let them see us. "},{"num":9,"verse":"Suppose they say to us, ‘Wait there until we come to you.’ Then we’ll stay where we are. We won’t go up to them. "},{"num":10,"verse":"But suppose they say, ‘Come up to us.’ Then we’ll climb up. That will show us that the Lord has handed them over to us.”"},{"num":11,"verse":"So Jonathan and the young man let the soldiers in the Philistine camp see them. “Look!” said the Philistines. “Some of the Hebrews are crawling out of the holes they were hiding in.” "},{"num":12,"verse":"The men in the Philistine camp shouted to Jonathan and the young man carrying his armor. They said, “Come on up here. We’ll teach you a thing or two.”"},{"num":13,"verse":"Using his hands and feet, Jonathan climbed up. The young man was right behind him. Jonathan struck down the Philistines. The young man followed him and killed those who were still alive. "},{"num":14,"verse":"In that first attack, Jonathan and the young man killed about 20 men. They did it in an area of about half an acre."},{"header":"Israel Chases the Philistines Away"},{"num":15,"verse":"Then panic struck the whole Philistine army. It struck those who were in the camp and those in the field. It struck those who were at the edge of the camp. It also struck those who were in the groups that had been sent out to attack Israel. The ground shook. It was a panic that God had sent."},{"num":16,"verse":"Saul’s lookouts at Gibeah in the land of Benjamin saw what was happening. They saw the Philistine army melting away in all directions. "},{"num":17,"verse":"Then Saul spoke to the men with him. He said, “Bring the troops together. See who has left our camp.” When they did, they discovered that Jonathan and the young man carrying his armor weren’t there."},{"num":18,"verse":"Saul said to Ahijah the priest, “Bring the ark of God.” At that time it was with the Israelites. "},{"num":19,"verse":"While Saul was talking to the priest, the noise in the Philistine camp got louder and louder. So Saul said to the priest, “Stop what you are doing.”"},{"num":20,"verse":"Then Saul and all his men gathered together. They went to the battle. They saw that the Philistines were in total disorder. They were striking one another with their swords. "},{"num":21,"verse":"At an earlier time some of the Hebrews had been on the side of the Philistines. They had gone up with them to their camp. But now they changed sides. They joined the Israelites who were with Saul and Jonathan. "},{"num":22,"verse":"Some of the Israelites had hidden in the hill country of Ephraim. They heard that the Philistines were running away. They quickly joined the battle and chased after them. "},{"num":23,"verse":"So on that day the Lord saved Israel. And the fighting continued on past Beth Aven."},{"header":"Jonathan Eats Honey"},{"num":24,"verse":"The Israelites became very hungry that day. That’s because Saul had forced the army to make a promise. He had said, “None of you must eat any food before evening comes. You must not eat until I’ve paid my enemies back for what they did. If you do, may you be under a curse!” So none of the troops ate any food at all."},{"num":25,"verse":"The whole army entered the woods. There was honey on the ground. "},{"num":26,"verse":"When they went into the woods, they saw the honey dripping out of a honeycomb. No one put any of the honey in his mouth. They were afraid of the curse that would come if they broke their promise. "},{"num":27,"verse":"But Jonathan hadn’t heard that his father had forced the army to make a promise. Jonathan had a long stick in his hand. He reached out and dipped the end of it into the honeycomb. He put some honey in his mouth. It gave him new life. "},{"num":28,"verse":"Then one of the soldiers told him, “Your father forced the army to make a promise that everyone must obey. He said, ‘None of you must eat any food today. If you do, may you be under a curse!’ That’s why the men are weak and ready to faint.”"},{"num":29,"verse":"Jonathan said, “My father has made trouble for the country. See how I gained new life after I tasted a little of this honey. "},{"num":30,"verse":"Our soldiers took food from their enemies today. Suppose they had eaten some of it. How much better off they would have been! Even more Philistines would have been killed.”"},{"num":31,"verse":"That day the Israelites struck down the Philistines. They killed them from Mikmash to Aijalon. By that time they were tired and worn out. "},{"num":32,"verse":"They grabbed what they had taken from their enemies. They killed some of the sheep, cattle and calves right there on the ground. They ate the meat while the blood was still in it. "},{"num":33,"verse":"Then someone said to Saul, “Look! The men are sinning against the Lord. They’re eating meat that still has blood in it.”"},{"num":34,"verse":"He continued, “Go out among the men. Tell them, ‘Each of you bring me your cattle and sheep. Kill them here and eat them. Don’t sin against the Lord by eating meat that still has blood in it.’ ”"},{"num":35,"verse":"Then Saul built an altar to honor the Lord. It was the first time he had done that."},{"num":36,"verse":"Saul said, “Let’s go down and chase after the Philistines tonight. Let’s not leave even one of them alive. Let’s take everything they have before morning.”"},{"num":37,"verse":"So Saul asked God, “Should I go down and chase after the Philistines? Will you hand them over to Israel?” But God didn’t answer him that day."},{"num":38,"verse":"Saul said to the leaders of the army, “Come here. Let’s find out what sin has been committed today. "},{"num":39,"verse":"The Lord is the one who rescues Israel. You can be sure that the Lord lives. And you can be just as sure that the sinner must die. He must die even if he’s my son Jonathan.” But no one said anything."},{"num":40,"verse":"Then Saul said to all the Israelites, “You stand over there. I and my son Jonathan will stand over here.”"},{"num":41,"verse":"Then Saul prayed to the Lord, the God of Israel. He said, “Why haven’t you answered your servant today? If I or my son Jonathan is to blame, answer with Urim. But if the Israelites are to blame, answer with Thummim.” Jonathan and Saul were chosen by casting lots. The other men were cleared of blame. "},{"num":42,"verse":"Saul said, “Cast the lot to find out whether I or my son Jonathan is to blame.” And Jonathan was chosen."},{"num":43,"verse":"Then Saul said to Jonathan, “Tell me what you have done.”"},{"num":44,"verse":"Saul said, “Jonathan, I must certainly put you to death. If I don’t, may God punish me greatly.”"},{"num":45,"verse":"But the men said to Saul, “Should Jonathan be put to death? Never! He has saved Israel in a wonderful way. He did it today with God’s help. You can be sure that the Lord lives. And you can be just as sure that not even one hair on Jonathan’s head will fall to the ground.” So the men rescued Jonathan. He wasn’t put to death."},{"num":46,"verse":"Then Saul stopped chasing the Philistines. They went back to their own land."},{"num":47,"verse":"After Saul became the king of Israel, he fought against Israel’s enemies who were all around them. He went to war against Moab, Ammon and Edom. He fought against the kings of Zobah and the Philistines. No matter where he went, he punished his enemies. "},{"num":48,"verse":"He fought bravely. He won the battle over the Amalekites. He saved Israel from the power of those who had carried off what belonged to Israel."},{"header":"Saul’s Family"},{"num":49,"verse":"Saul’s sons were Jonathan, Ishvi and Malki-Shua. Saul’s older daughter was named Merab. His younger daughter was named Michal. "},{"num":50,"verse":"Saul’s wife was named Ahinoam. She was the daughter of Ahimaaz. The commander of Saul’s army was named Abner. He was the son of Ner. Ner was Saul’s uncle. "},{"num":51,"verse":"Saul’s father Kish and Abner’s father Ner were sons of Abiel."},{"num":52,"verse":"As long as Saul was king, he had to fight hard against the Philistines. So every time Saul saw a strong or brave man, he took him into his army."}]