[{"num":8,"verse":"¶ Jesus went unto the mount of Olives."},{"num":2,"verse":"And early in the morning he came again into the temple, and all the people came unto him; and he sat down and taught them."},{"num":3,"verse":"Then the scribes and Pharisees brought unto him a woman taken in adultery, and when they had set her in the midst,"},{"num":4,"verse":"they said unto him, Master, this woman was taken in adultery in the very act."},{"num":5,"verse":"Now Moses in the law commanded us that such should be stoned, but what sayest thou?"},{"num":6,"verse":"This they said, tempting him, that they might be able to accuse him. But Jesus stooped down and with his finger wrote on the ground."},{"num":7,"verse":"So when they continued asking him, he lifted himself up and said unto them, He that is without sin among you, let him be the first to cast a stone at her."},{"num":8,"verse":"And again he stooped down and wrote on the ground."},{"num":9,"verse":"And those who heard it, being convicted by their own conscience, went out one by one, beginning at the eldest even unto the last; and Jesus was left alone and the woman that had been in the midst."},{"num":10,"verse":"Jesus, lifting himself up and seeing no one but the woman, said unto her, Woman, where are thine accusers? Has no one condemned thee?"},{"num":11,"verse":"And she said, No one, Lord. Then Jesus said unto her, Neither do I condemn thee; go and sin no more."},{"num":12,"verse":"¶ Then Jesus spoke again unto them, saying, I AM the light of the world; he that follows me shall not walk in darkness but shall have the light of life."},{"num":13,"verse":"Then the Pharisees said unto him, Thou dost bear witness of thyself; thy witness is not true."},{"num":14,"verse":"Jesus answered and said unto them, Though I bear witness of myself, my witness is true, for I know from where I came and where I go; but ye do not know where I came from and where I go."},{"num":15,"verse":"Ye judge after the flesh, but I judge no one."},{"num":16,"verse":"And yet if I judge, my judgment is true, for I am not alone, but I and the Father that sent me."},{"num":17,"verse":"It is also written in your law that the testimony of two men is true."},{"num":18,"verse":"I AM one that bears witness of myself, and the Father that sent me bears witness of me."},{"num":19,"verse":"Then they said unto him, Where is thy Father? Jesus answered, Ye neither know me, nor my Father; if ye had known me, ye should have known my Father also."},{"num":20,"verse":"Jesus spoke these words in the treasury as he taught in the temple, and no one laid hands on him, for his hour was not yet come."},{"num":21,"verse":"¶ Then Jesus said again unto them, I am going away, and ye shall seek me, but ye shall die in your sins; where I go, ye shall not be able to come."},{"num":22,"verse":"Then the Jews said, Will he kill himself? because he says, Where I go, ye shall not be able to come."},{"num":23,"verse":"And he said unto them, Ye are from below, I am from above; ye are of this world, I am not of this world."},{"num":24,"verse":"Therefore I said unto you that ye shall die in your sins, for if ye do not believe that I AM, ye shall die in your sins."},{"num":25,"verse":"And said they unto him, Who art thou? Then Jesus said unto them, He that I said unto you also from the beginning."},{"num":26,"verse":"I have many things to say and to judge regarding you, but he that sent me is true; and those things which I have heard of him, I speak in the world."},{"num":27,"verse":"But they did not understand that he spoke to them of the Father."},{"num":28,"verse":"Then Jesus said unto them, When ye have lifted up the Son of man, then ye shall know that I AM and that I do nothing of myself, but as my Father has taught me, I speak these things."},{"num":29,"verse":"And he that sent me is with me: the Father has not left me alone, for I always do those things that please him."},{"num":30,"verse":"As he spoke these words, many believed in him."},{"num":31,"verse":"¶ Then Jesus said to those Jews who had believed him, If ye abide in my word, ye shall be my disciples indeed;"},{"num":32,"verse":"and ye shall know the truth, and the truth shall set you free."},{"num":33,"verse":"They answered him, We are Abraham’s seed, and we have never served anyone; how sayest thou, Ye shall be set free?"},{"num":34,"verse":"Jesus answered them, Verily, verily, I say unto you, Whosoever commits sin is the slave of sin."},{"num":35,"verse":"And the slave does not abide in the house for ever, but the Son abides for ever."},{"num":36,"verse":"If the Son therefore shall set you free, ye shall be free indeed."},{"num":37,"verse":"I know that ye are Abraham’s seed, but ye seek to kill me because my word has no place in you."},{"num":38,"verse":"¶ I speak that which I have seen with my Father, and ye do that which ye have seen with your father."},{"num":39,"verse":"They answered and said unto him, Abraham is our father. Jesus said unto them, If ye were Abraham’s sons, ye would do the works of Abraham."},{"num":40,"verse":"But now ye seek to kill me, a man that has told you the truth, which I have heard of God; Abraham did not do this."},{"num":41,"verse":"Ye do the deeds of your father. Then they said to him, We are not born of fornication; we have one Father, even God."},{"num":42,"verse":"Jesus said unto them, If God were your Father, ye would surely love me, for I proceeded forth and came from God; neither did I come of myself, but he sent me."},{"num":43,"verse":"Why do ye not understand my speech? even because ye cannot hear my word."},{"num":44,"verse":"Ye are of your father the devil, and the desires of your father ye desire to do. He was a murderer from the beginning and abode not in the truth because there is no truth in him. When he speaks a lie, he speaks of his own, for he is a liar and the father of it."},{"num":45,"verse":"And because I tell you the truth, ye do not believe me."},{"num":46,"verse":"¶ Which of you reproves me of sin? And if I say the truth, why do ye not believe me?"},{"num":47,"verse":"He that is of God hears God’s words; ye therefore hear them not because ye are not of God."},{"num":48,"verse":"Then the Jews answered, and said unto him, Do we not say well that thou art a Samaritan and hast a demon?"},{"num":49,"verse":"Jesus answered, I do not have a demon; but I honour my Father, and ye do dishonour me."},{"num":50,"verse":"And I seek not my own glory; there is one that seeks it and judges."},{"num":51,"verse":"¶ Verily, verily, I say unto you, If anyone keeps my word, he shall not see death forever."},{"num":52,"verse":"Then the Jews said unto him, Now we know that thou hast a demon. Abraham died and the prophets; and thou sayest, If a man keeps my word, he shall not taste death forever?"},{"num":53,"verse":"Art thou greater than our father Abraham who died? and the prophets died; whom makest thou thyself?"},{"num":54,"verse":"Jesus answered, If I glorify myself, my glory is nothing; it is my Father that glorifies me, of whom ye say that he is your God;"},{"num":55,"verse":"yet ye have not known him, but I know him; and if I should say, I do not know him, I shall be a liar like unto you; but I know him and keep his word."},{"num":56,"verse":"Your father Abraham rejoiced to see my day, and he saw it and was glad."},{"num":57,"verse":"Then the Jews said unto him, Thou art not yet fifty years old, and hast thou seen Abraham?"},{"num":58,"verse":"Jesus said unto them, Verily, verily, I say unto you, Before Abraham was, I AM."},{"num":59,"verse":"Then they took up stones to cast at him, but Jesus concealed himself and went out of the temple, and going through the midst of them, went away."}]