[{"header":"Healing of a crippled man"},{"num":3,"verse":"Peter and John were going up to the temple at three o’clock in the afternoon, the established prayer time."},{"num":2,"verse":"Meanwhile, a man crippled since birth was being carried in. Every day, people would place him at the temple gate known as the Beautiful Gate so he could ask for money from those entering the temple."},{"num":3,"verse":"When he saw Peter and John about to enter, he began to ask them for a gift."},{"num":4,"verse":"Peter and John stared at him. Peter said, “Look at us!”"},{"num":5,"verse":"So the man gazed at them, expecting to receive something from them."},{"num":6,"verse":"Peter said, “I don’t have any money, but I will give you what I do have. In the name of Jesus Christ the Nazarene, rise up and walk!”"},{"num":7,"verse":"Then he grasped the man’s right hand and raised him up. At once his feet and ankles became strong."},{"num":8,"verse":"Jumping up, he began to walk around. He entered the temple with them, walking, leaping, and praising God."},{"num":9,"verse":"All the people saw him walking and praising God."},{"num":10,"verse":"They recognized him as the same one who used to sit at the temple’s Beautiful Gate asking for money. They were filled with amazement and surprise at what had happened to him."},{"num":11,"verse":"While the healed man clung to Peter and John, all the people rushed toward them at Solomon’s Porch, completely amazed."},{"num":12,"verse":"Seeing this, Peter addressed the people: “You Israelites, why are you amazed at this? Why are you staring at us as if we made him walk by our own power or piety?"},{"num":13,"verse":"The God of Abraham, Isaac, and Jacob—the God of our ancestors—has glorified his servant Jesus. This is the one you handed over and denied in Pilate’s presence, even though he had already decided to release him."},{"num":14,"verse":"You rejected the holy and righteous one, and asked that a murderer be released to you instead."},{"num":15,"verse":"You killed the author of life, the very one whom God raised from the dead. We are witnesses of this."},{"num":16,"verse":"His name itself has made this man strong. That is, because of faith in Jesus’ name, God has strengthened this man whom you see and know. The faith that comes through Jesus gave him complete health right before your eyes."},{"num":17,"verse":"“Brothers and sisters, I know you acted in ignorance. So did your rulers."},{"num":18,"verse":"But this is how God fulfilled what he foretold through all the prophets: that his Christ would suffer."},{"num":19,"verse":"Change your hearts and lives! Turn back to God so that your sins may be wiped away."},{"num":20,"verse":"Then the Lord will provide a season of relief from the distress of this age and he will send Jesus, whom he handpicked to be your Christ."},{"num":21,"verse":"Jesus must remain in heaven until the restoration of all things, about which God spoke long ago through his holy prophets."},{"num":22,"verse":"Moses said, The Lord your God will raise up from your own people a prophet like me. Listen to whatever he tells you."},{"num":23,"verse":"Whoever doesn’t listen to that prophet will be totally cut off from the people."},{"num":24,"verse":"All the prophets who spoke—from Samuel forward—announced these days."},{"num":25,"verse":"You are the heirs of the prophets and the covenant that God made with your ancestors when he told Abraham, Through your descendants, all the families on earth will be blessed."},{"num":26,"verse":"After God raised his servant, he sent him to you first—to bless you by enabling each of you to turn from your evil ways.”"}]