[{"header":"A Lame Man Is Healed"},{"num":3,"verse":"Peter and John were going to the temple courtyard for the three o’clock prayer. "},{"num":2,"verse":"At the same time, a man who had been lame from birth was being carried by some men. Every day these men would put the lame man at a gate in the temple courtyard. The gate was called Beautiful Gate. There he would beg for handouts from people going into the courtyard. "},{"num":3,"verse":"When the man saw that Peter and John were about to go into the courtyard, he asked them for a handout."},{"num":4,"verse":"Peter and John stared at him. “Look at us!” Peter said. "},{"num":5,"verse":"So the man watched them closely. He expected to receive something from them. "},{"num":6,"verse":"However, Peter said to him, “I don’t have any money, but I’ll give you what I do have. Through the power of Jesus Christ from Nazareth, walk!” "},{"num":7,"verse":"Peter took hold of the man’s right hand and began to help him up. Immediately, the man’s feet and ankles became strong. "},{"num":8,"verse":"Springing to his feet, he stood up and started to walk. He went with Peter and John into the temple courtyard. The man was walking, jumping, and praising God."},{"num":9,"verse":"All the people saw him walking and praising God. "},{"num":10,"verse":"They knew that he was the man who used to sit and beg at the temple’s Beautiful Gate. The people were amazed and stunned to see what had happened to him. "},{"num":11,"verse":"They were excited, and everyone ran to see them at the place called Solomon’s Porch. The man wouldn’t let go of Peter and John."},{"num":12,"verse":"When Peter saw this, he said to the people, “Men of Israel, why are you amazed about this man? Why are you staring at us as though we have made him walk by our own power or godly life? "},{"num":13,"verse":"The God of our ancestors Abraham, Isaac, and Jacob has glorified his servant Jesus. You handed Jesus over to Pilate. You rejected him in Pilate’s presence, even though Pilate had decided to let him go free. "},{"num":14,"verse":"You rejected the man who was holy and innocent. You asked to have a murderer given to you, "},{"num":15,"verse":"and you killed the source of life. But God brought him back to life, and we are witnesses to that. "},{"num":16,"verse":"We believe in the one named Jesus. Through his power alone this man, whom you know, was healed, as all of you saw."},{"num":17,"verse":"“And now, brothers, I know that like your rulers you didn’t know what you were doing. "},{"num":18,"verse":"But in this way God made the sufferings of his Messiah come true. God had predicted these sufferings through all the prophets. "},{"num":19,"verse":"So change the way you think and act, and turn ⌞to God⌟ to have your sins removed. "},{"num":20,"verse":"Then times will come when the Lord will refresh you. He will send you Jesus, whom he has appointed to be the Christ. "},{"num":21,"verse":"Heaven must receive Jesus until the time when everything will be restored as God promised through his holy prophets long ago."},{"num":22,"verse":"“Moses said, ‘The Lord your God will send you a prophet, an Israelite like me. Listen to everything he tells you. "},{"num":23,"verse":"Those who won’t listen to that prophet will be excluded from the people.’ "},{"num":24,"verse":"Samuel and all the prophets who followed him spoke about these days. "},{"num":25,"verse":"You are the descendants of the prophets and the heirs of the promise  that God made to our ancestors when he said to Abraham, ‘Through your descendant all people on earth will be blessed.’ "},{"num":26,"verse":"God has brought his servant back to life and has sent him to you first. God did this to bless you by turning every one of you from your evil ways.”"}]