[{"header":"A Lame Beggar Walks"},{"num":3,"verse":"Now Peter and John were going up to the Temple at the ninth hour, the time of prayer. "},{"num":2,"verse":"A man lame from birth was being carried—every day they used to put him at the Temple gate called Beautiful, so he could beg for tzedakah from those entering the Temple. "},{"num":3,"verse":"When he saw Peter and John about to go into the Temple, he began asking to receive tzedakah."},{"num":4,"verse":"But Peter, along with John, looked straight at him and said, “Look at us!” "},{"num":5,"verse":"So he gave them his attention, expecting to receive something from them. "},{"num":6,"verse":"But Peter said, “Silver and gold I do not have, but what I do have I give to you—in the name of Yeshua ha-Mashiach ha-Natzrati, get up and walk!” "},{"num":7,"verse":"Then grabbing him by the right hand, he raised him up; and immediately the man’s feet and ankles were made strong. "},{"num":8,"verse":"Jumping up, he stood and began walking; and he went with them into the Temple, walking and leaping and praising God!"},{"num":9,"verse":"Now all the people saw him walking and praising God. "},{"num":10,"verse":"They began to realize he was the one who used to sit begging for tzedakah at the Beautiful Gate of the Temple, and they were filled with wonder and astonishment over what had happened to him."},{"header":"Peter Speaks at the Temple"},{"num":11,"verse":"While he was clinging to Peter and John, all the people together came running toward them in the place called Solomon’s Portico. "},{"num":12,"verse":"But when Peter saw, he responded to the people, “Men of Israel, why are you amazed at this? Why do you stare at us—as if by our own power or godliness we had made this man walk? "},{"num":13,"verse":"The God of Abraham and Isaac and Jacob, the God of our fathers, has glorified His Servant Yeshua—the One you handed over and disowned before Pilate, though he had decided to release Him. "},{"num":14,"verse":"But you rejected the Holy and Righteous One and asked for a murderer to be granted to you. "},{"num":15,"verse":"You killed the Author of life—the One God raised from the dead! We are witnesses of it. "},{"num":16,"verse":"Now through faith in the name of Yeshua, His name has strengthened this man whom you see and know. Indeed, the faith through Yeshua has given this man perfect health in front of you all."},{"num":17,"verse":"“Now brothers, I know that you acted in ignorance, just as your leaders did. "},{"num":18,"verse":"But what God foretold through the mouth of all His prophets—that His Messiah was to suffer—so He has fulfilled. "},{"num":19,"verse":"Repent, therefore, and return—so your sins might be blotted out, "},{"num":20,"verse":"so times of relief might come from the presence of Adonai and He might send Yeshua, the Messiah appointed for you. "},{"num":21,"verse":"Heaven must receive Him, until the time of the restoration of all the things that God spoke about long ago through the mouth of His holy prophets. "},{"num":22,"verse":"Moses said, ‘Adonai your God will raise up for you a Prophet like me from among your brothers. Hear and obey Him in all that He shall say to you. "},{"num":23,"verse":"And it shall be that every soul that will not listen to that Prophet shall be completely cut off from the people.’"},{"num":24,"verse":" Indeed, all the prophets who have spoken from Samuel on have announced these days. "},{"num":25,"verse":"You are the sons of the prophets and also of the covenant that God cut with your fathers, saying to Abraham, ‘In your seed shall all the families of the earth be blessed.’"},{"num":26,"verse":" God raised up His Servant and sent Him first to you, to bless you all by turning each of you from your wicked ways.”"}]