[{"header":"Healing at the Beautiful Gate"},{"num":3,"verse":"One afternoon Peter and John went to the temple for the three o’clock prayer. "},{"num":2,"verse":"As they came to the entrance called the Beautiful Gate, they were captured by the sight of a man crippled from birth being carried and placed at the entrance to the temple. He was often brought there to beg for money from those going in to worship. "},{"num":3,"verse":"When he noticed Peter and John going into the temple, he begged them for money."},{"num":4,"verse":"Peter and John, looking straight into the eyes of the crippled man, said, “Look at us!” "},{"num":5,"verse":"Expecting a gift, he readily gave them his attention. "},{"num":6,"verse":"Then Peter said, “I don’t have money, but I’ll give you this—by the power of the name of Jesus Christ of Nazareth, stand up and walk!”"},{"num":7,"verse":"Peter held out his right hand to the crippled man. As he pulled the man to his feet, suddenly power surged into his crippled feet and ankles. The man jumped up, stood there for a moment stunned, and then began to walk around! As he went into the temple courts with Peter and John, he leapt for joy and shouted praises to God."},{"num":9,"verse":"When all the people saw him jumping up and down and heard him glorifying God, "},{"num":10,"verse":"they realized it was the crippled beggar they had passed by in front of the Beautiful Gate. Astonishment swept over the crowd, for they were amazed over what had happened to him."},{"header":"Peter Preaches to the Crowd"},{"num":11,"verse":"Dumbfounded over what they were witnessing, the crowd ran over to Peter and John, who were standing under the covered walkway called Solomon’s Porch. Standing there also was the healed beggar, clinging to Peter and John."},{"num":12,"verse":"With the crowd surrounding him, Peter said to them all, “People of Israel, listen to me! Why are you so amazed by this healing? Why do you stare at us? We didn’t make this crippled man walk by our own power or authority. "},{"num":13,"verse":"The God of our ancestors, the God of Abraham, Isaac, and Jacob, has done this. For he has glorified his Servant Jesus, the one you denied to Pilate’s face when he decided to release him—and you insisted that he be crucified. "},{"num":14,"verse":"You rejected the one who is holy and righteous, and instead begged for a murderer to be released. "},{"num":15,"verse":"You killed the Prince of Life! But God raised him from the dead, and we stand here as witnesses to that fact. "},{"num":16,"verse":"Faith in Jesus’ name has healed this man standing before you. It is the faith that comes through believing in Jesus’ name that has made the crippled man walk right in front of your eyes!"},{"num":17,"verse":"“My fellow Jews, I realize that neither you nor your leaders realize the grave mistake you made. "},{"num":18,"verse":"But in spite of what you’ve done, God has fulfilled what he foretold through the prophets long ago about the sufferings of his Anointed One. "},{"num":19,"verse":"And now you must repent and turn back to God so that your sins will be removed, and so that times of refreshing will stream from the Lord’s presence. "},{"num":20,"verse":"And he will send you Jesus, the Messiah, the appointed one. "},{"num":21,"verse":"For he must remain in heaven until the restoration of all things has taken place, fulfilling everything that God said long ago through his holy prophets. "},{"num":22,"verse":"For has not Moses told us:"},{"num":24,"verse":"“In fact, every prophet from the time of Samuel onward has prophesied of these very days! "},{"num":25,"verse":"And you are heirs of their prophecies and of the covenants God made with your fathers when he promised Abraham, ‘Your descendant will bring blessing to all the people on the earth.’"},{"num":26,"verse":"“Now that God raised up his Son, he has chosen to send him first to you that he might bless you by turning each one of you from your wickedness.”"}]