[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(33) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A certain Samaritan.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—For the chief facts connected with the Samaritans and their relation to the Jews, see Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is something noticeable in the change of word. It was not likely that the hated alien should be coming down from Jerusalem. His journey would probably be to, or from, Bethel and Gerizim. He was not, as the others were, near a home to which they might have taken the wounded sufferer. Here there is a true human feeling in one who outwardly was involved in heresy and schism, and our Lord singles that out as infinitely preferable to the form of godliness without its power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 10:33-37",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 10:33-37",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But a certain Samaritan, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Soon after this, a Samaritan happened to come that way, and seeing a fellow-creature lying on the road naked and wounded, went up to him; and though he found it was one of a different nation, who professed a religion opposed to his own, the violent hatred of all such persons, that had been instilled into his mind from his earliest years, and all other objections, were immediately silenced by the feelings of pity awakened at the sight of the man’s distress; his bowels yearned toward the Jew, and he hastened, with great tenderness, to give him assistance. It was admirably well judged, to represent the distress on the side of the Jew, and the mercy on that of the Samaritan. For the case being thus proposed, self-interest would make the very scribe sensible how amiable such a conduct was, and would lay him open to our Lord’s inference. Had it been put the other way, prejudice might more easily have interposed, before the heart could have been affected. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And went to him and bound up his wounds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — It seems this humane traveller, according to the custom of those times, carried his provisions along with him; for he was able, though in the fields, to give the wounded man some wine to recruit his spirits. Moreover, he carefully bound up his wounds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pouring in oil and wine, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which, when well beaten together, are said to be one of the best balsams that can be applied to a fresh wound; then, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "setting him on his own beast, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "he walked by him on foot and supported him. In this manner did the good Samaritan carry the Jew, his enemy, to the first inn he could find, where he carefully attended him all that night; and on the morrow, when he was going away, he delivered him over to the care of the host, with a particular recommendation to be very kind to him. And, that nothing necessary for his recovery might be wanting, he gave the host what money he could spare, a sum about equal to fifteen pence with us, desiring him, at the same time, to lay out more, if more were needful, and promising to pay the whole at his return. It seems he was afraid the mercenary temper of the host might have hindered him from furnishing what was necessary, if he had no prospect of being repaid. Thus we see, “All the circumstances of this beautiful parable are formed with the finest skill imaginable, to work the conviction designed; so that had the lawyer been ever so much disposed to reckon none his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neighbours ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but men of his own religion, it was not in his power to do it on this occasion. And, although favours from a Samaritan had always been represented to him as an abomination, more detestable than the eating of swine’s flesh, he was obliged to acknowledge, that not the priest or the Levite, but this Samaritan, by discharging a great office of humanity toward the Jew in distress, was truly his neighbour, and deserved his love more than some of his own nation, who sustained the most venerable characters; that the like humanity was due from any Israelite to a Samaritan who stood in need of it; and that all men are neighbours to all men, how much soever they may be distinguished from one another in respect of country, or kindred, or language, or religion. Mankind are intimately knit together by their common wants and weaknesses, being so formed that they cannot live without the assistance of each other, and therefore the relation that subsists between them is as extensive as their natures; and the obligations under which they lie, to aid one another by mutual good offices, are as strong and urgent as every man’s own manifold necessities. By this admirable parable, therefore, our Lord has powerfully recommended that universal benevolence, which is so familiar in the mouths, but foreign to the hearts of many ignorant pretenders to religion and morality. It would appear that the presumption of the Jews in matters of religion exceeded all bounds; for though the Supreme Being pays little regard to mere outward worship, and is much more delighted with the inward homage of a holy and benevolent mind, yet because they prayed daily in his temple, and offered sacrifices there, and carried about his precepts written on their phylacteries, and had God and the law always in their mouths, they made no doubt but they worshipped God acceptably, notwithstanding they were so enormously wicked, that they would not put themselves to the smallest expense or trouble, though they could have saved life by it; and therefore had no real love to God or their neighbour. This monstrous presumption being entirely subversive of true religion, our Lord thought fit to condemn it in the severest manner, and to brand it with the blackest and most lasting note of infamy in the above charming parable.” — Macknight. Jesus, having finished the parable, said to the lawyer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Which now of these three was neighbour, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Which acted the part of a neighbour? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he said, He that showed mercy on him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — This reply the lawyer made without hesitation, being greatly struck with the truth and evidence of the case. Indeed he could not for shame say otherwise. In speaking thus, however, he condemned himself, and overthrew his own false notion of the neighbour to whom his love was due. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Go, and do thou likewise ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Show mercy and kindness to every one that stands in need of thy assistance, whether he be an Israelite, a heathen, or a Samaritan; and when works of charity are to be performed, reckon every man thy neighbour, not inquiring what he believes, but what he suffers. Reader, let us attend to, and diligently put in practice, our Lord’s advice to this lawyer: let us ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "go and do likewise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "regarding every man as our neighbour who needs our assistance. Let us renounce that bigotry and party zeal which would contract our hearts into an insensibility for all the human race, but a small number, whose sentiments and practices are so much our own, that our love to them is but self-love reflected. With an honest openness of mind let us always remember the kindred between man and man, and cultivate that happy instinct whereby, in the original constitution of our nature, God has strongly bound us to each other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:25-37 If we speak of eternal life, and the way to it, in a careless manner, we take the name of God in vain. No one will ever love God and his neighbour with any measure of pure, spiritual love, who is not made a partaker of converting grace. But the proud heart of man strives hard against these convictions. Christ gave an instance of a poor Jew in distress, relieved by a good Samaritan. This poor man fell among thieves, who left him about to die of his wounds. He was slighted by those who should have been his friends, and was cared for by a stranger, a Samaritan, of the nation which the Jews most despised and detested, and would have no dealings with. It is lamentable to observe how selfishness governs all ranks; how many excuses men will make to avoid trouble or expense in relieving others. But the true Christian has the law of love written in his heart. The Spirit of Christ dwells in him; Christ's image is renewed in his soul. The parable is a beautiful explanation of the law of loving our neighbour as ourselves, without regard to nation, party, or any other distinction. It also sets forth the kindness and love of God our Saviour toward sinful, miserable men. We were like this poor, distressed traveller. Satan, our enemy, has robbed us, and wounded us: such is the mischief sin has done us. The blessed Jesus had compassion on us. The believer considers that Jesus loved him, and gave his life for him, when an enemy and a rebel; and having shown him mercy, he bids him go and do likewise. It is the duty of us all , in our places, and according to our ability, to succour, help, and relieve all that are in distress and necessity.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A certain Samaritan - The Samaritans were the most inveterate foes of the Jews. They had no dealings with each other. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was this fact which rendered the conduct of this good man so striking, and which was thus set in strong contrast with the conduct of the priest and the Levite. \"They\" would not help their own afflicted, and wounded countryman. \"He,\" who could not be expected to aid a Jew, overcame all the usual hostility between the people; saw in the wounded man a neighbor, a brother, one who needed aid; and kindly denied himself to show kindness to the stranger. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "33. Samaritan—one excommunicated by the Jews, a byword among them, synonymous with heretic and devil (Joh 8:48; see on [1632]Lu 17:18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "had compassion—His best is mentioned first; for \"He who gives outward things gives something external to himself, but he who imparts compassion and tears gives him something from his very self\" [Gregory The Great, in Trench]. No doubt the priest and Levite had their excuses—It is not safe to be lingering here; besides, he's past recovery; and then, may not suspicion rest upon ourselves? So might the Samaritan have reasoned, but did not [Trench]. Nor did he say, He's a Jew, who would have had no dealings with me (Joh 4:9), and why should I with him?",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 10:30\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 10:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But a certain Samaritan,.... By whom Christ may be meant; not that he was really so, for he was a Jew, a son of Abraham, and of David, according to the flesh, but he was so called by the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and was treated as such by them: and since it is the design of the parable in general to show, that he that does acts of kindness and mercy to persons in distress, is a neighbour in the truest sense, though he is not an Israelite, but even a Samaritan, who was, above all men, hated by the Jews; why may it not be thought to be the view of Christ in particular, to prove himself the best neighbour and friend of men, though he was traduced by the Jews as a Samaritan? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as he journeyed; which may design the assumption of human nature, which is sometimes expressed, by his coming from his Father, by his descending from heaven, and coming into this world; which phrases intend his incarnation, and carry in them the idea of journeying: for as his ascent to heaven is expressed by taking a journey, Matthew 25:15 so may his descent from heaven; and while he was here on earth, he was as a stranger and pilgrim, as a sojourner and traveller: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "as he journeyed; which may design the assumption of human nature, which is sometimes expressed, by his coming from his Father, by his descending from heaven, and coming into this world; which phrases intend his incarnation, and carry in them the idea of journeying: for as his ascent to heaven is expressed by taking a journey, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " so may his descent from heaven; and while he was here on earth, he was as a stranger and pilgrim, as a sojourner and traveller: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "came where he was; put himself in the legal place, and stead of his people, who fell with the rest of mankind in Adam; he became their surety from eternity, and clothed himself with their nature in time; he took upon him their sins, as their representative, and fulfilled the righteousness of the law on their account, and bore the penalty of it in their room: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and when he saw him; Christ saw the elect before the fall, as they were chosen in him, and given unto him, in all the glory they were to be brought into; when he loved them, and his delight was with them: and when he came to redeem them, he saw them as follows; as lost, as weak and strengthless, as wicked, and as the worst of sinners, as ungodly, and enemies, as children of wrath by nature, as others; and he shed his blood for them, and washed them from their sins, that he might present them to himself a glorious church, without spot or wrinkle, or any such thing; just such an one he had seen them to be, in the glass of his Father's purposes, in his council and covenant; and he sees them in their blood, and in the impurity of their nature, when he comes to call them by his grace: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he had compassion on him. The compassion of Christ on his elect, is to be seen in his eternal covenant engagements; for his tender mercies have been ever of old; and in his assumption of their nature, which was through his own, as well as the tender mercy of his Father; and in the redemption of them, which was in love and pity; and also in their regeneration and conversion, for the great things there, and then done for them by him, are owing to his compassion. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he had compassion on him. The compassion of Christ on his elect, is to be seen in his eternal covenant engagements; for his tender mercies have been ever of old; and in his assumption of their nature, which was through his own, as well as the tender mercy of his Father; and in the redemption of them, which was in love and pity; and also in their regeneration and conversion, for the great things there, and then done for them by him, are owing to his compassion. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But a certain Samaritan, as he journeyed, came where he was: and when he saw him, he had compassion on him,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 10:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Σαμαρείτης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a Samaritan: will he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a fortiori",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " pass by? No, he does not, that the surprise and the point of the story. The unexpected happens.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁδεύων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here only in N. T., making a journey, presumably longer than from Jerusalem to Jericho, fully equipped for a long journey (Hahn), and so in possession of means for help, if he have the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐσπλαγχνίσθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was touched with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That sacred feeling will keep ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from passing by, though tempted by his own affairs to go on and avoid trouble and loss of time, as ships may pass by other ships in distress, so deserving ever after to have branded on them ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΑΝΤΙΠΑΡΗΛΘΕΝ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a certain Samaritan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A Samaritan is thus selected for high eulogy—though the Samaritans had so ignominiously rejected Jesus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as he journeyed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] He was not ‘coming down* as the Priest and Levite were from the Holy City and the Temple, but from the unauthorised worship of alien Gerizim.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "had compassion on him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Thereby shewing himself, in spite of his heresy and ignorance, a better man than the orthodox Priest and Levite; and all the more so because he was an ‘alien’ (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and “the Jews have no dealings with the Samaritans” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and this very wounded man would, under other circumstances, have shrunk from the touch of the Samaritan as from pollution. Yet this ‘Cuthaean’—this ‘worshipper of the pigeon’—this man of a race which was accused of misleading the Jews by false fire signals, and of defiling the Temple with human bones—whose testimony would not have been admitted in a Jewish court of law—with whom no Jew would so much as eat (Jos. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Antt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". xx. 6, § 1, xviii. 2, § 2;",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "B. J.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ii. 12, § 3)—shews a spontaneous and perfect pity of which neither Priest nor Levite had been remotely capable. The fact that the Jews had applied to our Lord Himself the opprobrious name of “Samaritan” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is one of the indications that a deeper meaning lies under the beautiful obvious significance of the Parable.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 33.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But a certain Samaritan, as he journeyed, came where he was: and when he saw him, he had compassion on him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Now, for the sake of strong contrast, Jesus paints on his canvas the figure of one who, as a Samaritan, was as far removed as possible from being a neighbour to the sufferer (who, most probably, was a Jew) in the sense in which the austere Jewish lawyer would of  himself understand the term \"neighbour\", The Samaritan, hated of the Jews, and most probably, in common with the rest of his nation, hating them - he, in his turn, was journeying along the ill-omened \"Way of Blood;\" he too sees, like the priest, the form of the man, wounded perhaps to death, lying by the way, and, like the Levite, draws near to look on the helpless sufferer; but, unlike priest and Levite, stays by the wounded man, and, regardless of peril, trouble, or expense, does his best to help the helpless. Luke 10:33",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Came where he was",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There is a strong contrast with the other cases, and a downright heartiness in the words, κατ' αὐτὸν, down to him. The Levite had come κατὰ τόπον, \"down to the place.\" ",
        "children": []
      }
    ]
  }
]