[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "REFUGEES.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou shalt not deliver . . . the servant.—Even on Israelitish ground the escaped slave was free. Rashi adds, “Even a Canaanitish slave who has escaped from abroad into the land of Israel.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Thou shalt not deliver . . . the servant.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Even on Israelitish ground the escaped slave was free. Rashi adds, “Even a Canaanitish slave who has escaped from abroad into ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the land ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of Israel.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 23:15-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 23:15-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The servant which is escaped from his master — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It seems, from the connection, that this has a particular relation to times of war, when heathen soldiers or servants might desert and come over to the Israelites with intent to turn proselytes to the true religion. In which case, they were neither to send them back, and expose them to the severity of their heathen masters, nor use them hardly themselves, but permit them to live peaceably, and with full enjoyment of all the liberties and privileges of a proselyte in Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It may be understood, likewise, of such foreign servants as, upon inquiry, appeared to be unjustly oppressed by their masters. For it is not strange if the great God, who hates all tyranny, and styles himself the refuge of the oppressed, should interpose his authority to rescue such persons from their cruel masters. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He shall dwell with thee in the place which he shall choose — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This shows plainly that the passage is not to be understood of the servants of the Israelites their brethren, but of aliens and strangers; he is said to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "escaped, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and to be allowed to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dwell among them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which the servant of an Israelite was supposed to do before.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:15-25 It is honourable to shelter and protect the weak, provided they are not wicked. Proselytes and converts to the truth, should be treated with particular tenderness, that they may have no temptation to return to the world. We cannot honour God with our substance, unless it be honestly and honourably come by. It must not only be considered what we give, but how we got it. Where the borrower gets, or hopes to get, it is just that the lender should share the gain; but to him that borrows for necessary food, pity must be showed. That which is gone out of thy lips, as a solemn and deliberate vow, must not be recalled, but thou shalt keep and perform it punctually and fully. They were allowed to pluck and eat of the corn or grapes that grew by the road side; only they must not carry any away. This law intimated what great plenty of corn and wine they should have in Canaan. It provided for the support of poor travellers, and teaches us to be kind to such, teaches us to be ready to distribute, and not to think every thing lost that is given away. Yet it forbids us to abuse the kindness of friends, or to take advantage of what is allowed. Faithfulness to their engagements should mark the people of God; and they should never encroach upon others.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The case in question is that of a slave who fled from a pagan master to the holy land. It is of course assumed that the refugee was not flying from justice, but only from the tyranny of his lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15, 16. Thou shalt not deliver unto his master the servant which has escaped from his master unto thee—evidently a servant of the Canaanites or some of the neighboring people, who was driven by tyrannical oppression, or induced, with a view of embracing the true religion, to take refuge in Israel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This is not to be understood universally, as if all servants that flee from their masters, though without any sufficient cause or colour of justice, might be detained from them by any person to whom they fled for refuge, for this is apparently contrary to all the laws of religion, and justice, and charity, and would open a door to infinite disorders and mischiefs; but it is to be understood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Of the servants of strangers, because it follows, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 23:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 23:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he shall dwell with thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", even ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which shows that he had dwelt with and belonged to another people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Of such as belonged to the Canaanites, or other neighbouring nations, because if he had lived in remote countries, it is not probable that he would flee so far to avoid his master, or that his master would follow him so far to recover him. And for the Canaanites this sentence was most just, because both they and theirs were all forfeited to God and to Israel, and whatsoever they enjoyed was by special indulgence. And for the other neighbours it may seem just also, partly, because some of them were within the larger limits of the land belonging to Israel by God’s grant or deed of gift, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 15:18 Joshua 1:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 1:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; partly, because by their hostile carriages they had given Israel a right to much more of theirs than a few servants that might possibly run away from their masters; and especially, because both masters and servants of these and other nations are unquestionably at the dispose of the Lord their Maker and sovereign Ruler. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. Of such as upon inquiry appear to have been unjustly oppressed by their masters, as is implied by that phrase of his, making an escape, which supposeth a deliverance from danger or vexation. Now it is not strange nor unjust, if the great God, who hates all tyranny, and styles himself the refuge of the oppressed, doth interpose his authority, and help to rescue such persons from their cruel masters, who otherwise would be too strong for them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. Of such as came to them out of a desire to embrace the true religion, which possibly his master perceiving endeavoured by force to restrain him from, as it may be probably thought from his choosing and liking to live among the Israelites, expressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 23:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 23:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Now if this great and supreme Master, to whom all other masters are but servants, and they and theirs are absolutely in his power, shall receive and protect one that gives up himself to his service against the will of the under-master, who in this case rebels against his sovereign Lord, what shadow is there of injustice in the case? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thou shall not deliver unto his master the servant which is escaped from his master unto thee. That is, one that has been used ill by a cruel and tyrannical master, and was in danger of his life with him, or of being lamed by him, and therefore obliged to make his escape from him on that account; such an one, when he fell into the hands of an Israelite, was not to be taken and bound, and sent back to his master again, but was to be retained till his master's anger subsided; or however until inquiry could be made into the cause of the difference between him and his master, and matters be made up between them to mutual satisfaction; or if it appeared that the flight of the servant was just, and it was not safe for him to return to his master, then he was to be used as hereafter directed; for it cannot be thought that this law was made to encourage and protect every idle, disobedient, and fugitive servant, which would be very sinful and unjust: the Jewish writers generally understand it of the servants of idolaters fleeing for the sake of religion; Onkelos renders it,\"a servant of the people,''of Heathen people; the Targum of Jonathan is,\"thou shalt not deliver a stranger (i.e. a proselyte of righteousness, as Maimonides (w) calls this servant) into the hands of those that worship idols, but he shall be delivered by you, that he may be under the shadow of my Shechinah, because that he fled from the worship of his idol.''Jarchi makes mention of another sense; that it may be understood of\"a Canaanitish servant of an Israelite that flees (from his master) without the land, where he was not obliged to go with him, and serve him against his will; but I suppose a proselyte is meant;''and much more then will this hold good of an Hebrew servant in such circumstances. Aben Ezra interprets this of a servant not an Israelite, who, in time of war, flees from his master, not an Israelite also, unto the camp of Israel, and that for the glory of the divine name which is called upon Israel; such an one, though a servant, might not be delivered to his master. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) Hilchot Abadim, c. 8. sect. 11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) Hilchot Abadim, c. 8. sect. 11. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thou shalt not {h} deliver unto his master the servant which is escaped from his master unto thee:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thou shalt not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " deliver unto his master the servant which is escaped from his master unto thee:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) This is meant of the heathen , who fled because of their masters' cruelty, and embrace the true religion.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 15, 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - A slave that had escaped from his master was not to be given up, but allowed to dwell in the land, in whatever part he might choose. The reference is to a foreign slave who had fled from the harsh treatment of his master to seek refuge in Israel, as is evident from the expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בְאַחַד שְׁעָרֵיך",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"in one of thy gates,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " any part of thy land. Onkelos, ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עֲבִד עַמְמִין",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"a slave of the Gentiles.\" His master; the  word used is the plural ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "adonim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", masters. The use of this for a human master or lord is peculiar to the Pentateuch (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:9, 51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 39:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 40:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:4, 6, 32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). In this use of the term there is no reference to severity of rule, as if this were a plural intensive. Deuteronomy 23:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Toleration and Non-Toleration in the Congregation of the Lord. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 23:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A slave who had escaped from his master to Israel was not to be given up, but to be allowed to dwell in the land, wherever he might choose, and not to be oppressed. The reference is to a slave who had fled to them from a foreign country, on account of the harsh treatment which he had received from his heathen master. The plural `adoniym denotes the rule. ",
        "children": []
      }
    ]
  }
]