[{"num":4,"verse":"Inasmuch as Christ has suffered for us in the flesh, arm yourselves likewise with the same mind. For he who suffers in the flesh, ceases from sin, "},{"num":2,"verse":"that he henceforward should live as much time as remains in the flesh, not after the lusts or desires of men, but after the will of God. "},{"num":3,"verse":"For it is enough for us that we have spent the time that is past of our life after the will of the Gentiles, walking in wantonness, lusts, drunkenness; in eating, drinking, and in abominable idolatry."},{"num":4,"verse":"And it seems to them a strange thing that you run not also with them to the same excess of disorder, and therefore they speak evil of you. "},{"num":5,"verse":"But they will give accounts to him who is ready to judge the quick and the dead. "},{"num":6,"verse":"For to this purpose was the gospel preached to the dead: that they should be judged like other men in the flesh, but should live before God in the spirit."},{"num":7,"verse":"The end of all things is at hand. Be therefore discreet and sober, so that you may be fit for prayer. "},{"num":8,"verse":"But above all things, have fervent love among you. For love covers the multitude of sins."},{"num":9,"verse":"Be ready to take one another into your homes, and that without grudging. "},{"num":10,"verse":"As each one has received the gift, minister the same to one another, as good ministers of the manifold grace of God. "},{"num":11,"verse":"If anyone speaks, let him do so as though he spoke the words of God. If anyone ministers, let him do it as of the ability that God gives to him, so that in all things God may be glorified through Jesus Christ, to whom be praise and dominion forever and while the world stands. Amen."},{"num":12,"verse":"Dearly beloveds, be not troubled in this heat that has now come among you to try you, as if some strange thing had happened to you. "},{"num":13,"verse":"But rejoice, inasmuch as you are partakers of Christ’s passions, so that when his glory appears, you may be merry and glad. "},{"num":14,"verse":"If you are railed upon for the name of Christ, happy are you. For the Spirit of glory and of God rests upon you. On their part he is blasphemed, but on your part he is glorified."},{"num":15,"verse":"See that none of you suffer as a murderer, or as a thief or an evil-doer, or as a busybody in other people’s matters. "},{"num":16,"verse":"If anyone suffers as a Christian, let him not be ashamed, but let him glorify God in the matter. "},{"num":17,"verse":"For the time has come that judgment must begin at the house of God. If it first begins at us, what shall the end be of those who do not believe the gospel of God? "},{"num":18,"verse":"And if the righteous are scarcely saved, where shall the ungodly and the sinner appear? "},{"num":19,"verse":"Therefore let those who suffer according to the will of God commit their souls to him with well-doing, as to a faithful Creator."}]