[{"header":"The Priestly Family of Melchizedek"},{"num":7,"verse":"Melchizedek was both king of Salem and priest of God Most High. He was the one who went out and gave Abraham his blessing, when Abraham returned from killing the kings. "},{"num":2,"verse":"Then Abraham gave him a tenth of everything he had."},{"num":3,"verse":"We are not told that he had a father or mother or ancestors or beginning or end. He is like the Son of God and will be a priest forever."},{"num":4,"verse":"Notice how great Melchizedek is! Our famous ancestor Abraham gave him a tenth of what he had taken from his enemies. "},{"num":5,"verse":"The Law teaches that even Abraham’s descendants must give a tenth of what they possess. And they are to give this to their own relatives, who are the descendants of Levi and are priests. "},{"num":6,"verse":"Although Melchizedek wasn’t a descendant of Levi, Abraham gave him a tenth of what he had. Then Melchizedek blessed Abraham, who had been given God’s promise. "},{"num":7,"verse":"Everyone agrees that a person who gives a blessing is greater than the one who receives the blessing."},{"num":8,"verse":"Priests are given a tenth of what people earn. But all priests die, except Melchizedek, and the Scriptures teach that he is alive. "},{"num":9,"verse":"Levi’s descendants are now the ones who receive a tenth from people. We could even say that when Abraham gave Melchizedek a tenth, Levi also gave him a tenth. "},{"num":10,"verse":"This is because Levi was born later into the family of Abraham, who gave a tenth to Melchizedek."},{"num":11,"verse":"Even though the Law of Moses says that the priests must be descendants of Levi, those priests cannot make anyone perfect. So there needs to be a priest like Melchizedek, rather than one from the priestly family of Aaron. "},{"num":12,"verse":"And when the rules for selecting a priest are changed, the Law must also be changed."},{"num":13,"verse":"The person we are talking about is our Lord, who came from a tribe that had never had anyone to serve as a priest at the altar. "},{"num":14,"verse":"Everyone knows he came from the tribe of Judah, and Moses never said that priests would come from that tribe."},{"num":15,"verse":"All of this becomes clearer, when someone who is like Melchizedek is appointed to be a priest. "},{"num":16,"verse":"That person wasn’t appointed because of his ancestors, but because his life can never end. "},{"num":17,"verse":"The Scriptures say about him,"},{"num":18,"verse":"In this way a weak and useless command was put aside, "},{"num":19,"verse":"because the Law cannot make anything perfect. At the same time, we are given a much better hope, and it can bring us close to God."},{"num":20,"verse":"God himself made a promise when this priest was appointed. But he did not make a promise like this when the other priests were appointed. The promise he made is,"},{"num":22,"verse":"This means that Jesus guarantees us a better agreement with God. "},{"num":23,"verse":"There have been a lot of other priests, and all of them have died. "},{"num":24,"verse":"But Jesus will never die, and so he will be a priest forever! "},{"num":25,"verse":"He is forever able to save the people he leads to God, because he always lives to speak to God for them."},{"num":26,"verse":"Jesus is the high priest we need. He is holy and innocent and faultless, and not at all like us sinners. Jesus is honored above all beings in heaven, "},{"num":27,"verse":"and he is better than any other high priest. Jesus doesn’t need to offer sacrifices each day for his own sins and then for the sins of the people. He offered a sacrifice once for all, when he gave himself. "},{"num":28,"verse":"The Law appoints priests who have weaknesses. But God’s promise, which came later than the Law, appoints his Son. And he is the perfect high priest forever."}]