[{"header":"Chapter 7"},{"num":1,"verse":"Melchizedek, a Type of Christ. This “Melchizedek, king of Salem and priest of God Most High,” “met Abraham as he returned from his defeat of the kings” and “blessed him.” "},{"num":2,"verse":"And Abraham apportioned to him “a tenth of everything.” His name first means righteous king, and he was also “king of Salem,” that is, king of peace. "},{"num":3,"verse":"Without father, mother, or ancestry, without beginning of days or end of life, thus made to resemble the Son of God, he remains a priest forever."},{"num":4,"verse":"See how great he is to whom the patriarch “Abraham [indeed] gave a tenth” of his spoils. "},{"num":5,"verse":"The descendants of Levi who receive the office of priesthood have a commandment according to the law to exact tithes from the people, that is, from their brothers, although they also have come from the loins of Abraham. "},{"num":6,"verse":"But he who was not of their ancestry received tithes from Abraham and blessed him who had received the promises. "},{"num":7,"verse":"Unquestionably, a lesser person is blessed by a greater. "},{"num":8,"verse":"In the one case, mortal men receive tithes; in the other, a man of whom it is testified that he lives on. "},{"num":9,"verse":"One might even say that Levi himself, who receives tithes, was tithed through Abraham, "},{"num":10,"verse":"for he was still in his father’s loins when Melchizedek met him."},{"num":11,"verse":"If, then, perfection came through the levitical priesthood, on the basis of which the people received the law, what need would there still have been for another priest to arise according to the order of Melchizedek, and not reckoned according to the order of Aaron? "},{"num":12,"verse":"When there is a change of priesthood, there is necessarily a change of law as well. "},{"num":13,"verse":"Now he of whom these things are said belonged to a different tribe, of which no member ever officiated at the altar. "},{"num":14,"verse":"It is clear that our Lord arose from Judah, and in regard to that tribe Moses said nothing about priests. "},{"num":15,"verse":"It is even more obvious if another priest is raised up after the likeness of Melchizedek, "},{"num":16,"verse":"who has become so, not by a law expressed in a commandment concerning physical descent but by the power of a life that cannot be destroyed. "},{"num":17,"verse":"For it is testified:"},{"num":18,"verse":"On the one hand, a former commandment is annulled because of its weakness and uselessness, "},{"num":19,"verse":"for the law brought nothing to perfection; on the other hand, a better hope is introduced, through which we draw near to God. "},{"num":20,"verse":"And to the degree that this happened not without the taking of an oath—for others became priests without an oath, "},{"num":21,"verse":"but he with an oath, through the one who said to him:"},{"num":22,"verse":"to that same degree has Jesus [also] become the guarantee of an [even] better covenant. "},{"num":23,"verse":"Those priests were many because they were prevented by death from remaining in office, "},{"num":24,"verse":"but he, because he remains forever, has a priesthood that does not pass away. "},{"num":25,"verse":"Therefore, he is always able to save those who approach God through him, since he lives forever to make intercession for them."},{"num":26,"verse":"It was fitting that we should have such a high priest: holy, innocent, undefiled, separated from sinners, higher than the heavens. "},{"num":27,"verse":"He has no need, as did the high priests, to offer sacrifice day after day, first for his own sins and then for those of the people; he did that once for all when he offered himself. "},{"num":28,"verse":"For the law appoints men subject to weakness to be high priests, but the word of the oath, which was taken after the law, appoints a son, who has been made perfect forever."}]