[{"header":"The mysterious Melchizedek: his superiority to Abraham and the Levites"},{"num":1,"verse":"Now this Melchizedek was, we know, king of Salem and priest of God most high. He met Abraham when the latter was returning from the defeat of the kings, and blessed him. Abraham gave him a tribute of a tenth part of all the spoils of battle. (Melchizedek means “king of righteousness,” and his other title is “king of peace”, for Salem means peace. He had no father or mother and no family tree. He was not born nor did he die, but, being like the Son of God, is a perpetual priest.)"},{"num":4,"verse":"Now notice the greatness of this man. Even Abraham the patriarch pays him a tribute of a tenth part of the spoils. Further, we know that, according to the Law, the descendants of Levi who accept the office of priest have the right to demand a “tenth” from the people, that is from their brothers, despite the fact that the latter are descendants of Abraham. But here we have one who is quite independent of Levitic ancestry taking a “tenth” from Abraham, and giving a blessing to Abraham, the holder of God’s promises! And no one can deny that the receiver of a blessing is inferior to the one who gives it. Again, in the one case it is mortal men who receive the “tenths”, and in the other is one who, we are assured, is alive. One might say that even Levi, the proper receiver of “tenths”, has paid his tenth to this man, for in a sense he already existed in the body of his father Abraham when Melchizedek met him."},{"header":"The revival of the Melchizedek priesthood means that the Levitical priesthood is superseded"},{"num":11,"verse":"We may go further. If it be possible to bring men to spiritual maturity through the Levitical priestly system (for that is the system under which the people were given the Law), why does the necessity arise for another priest to make his appearance after the order of Melchizedek, instead of following the normal priestly calling of Aaron? For if there is a transference of priestly powers, there will necessarily follow an alteration of the Law regarding priesthood. He who is described as our High Priest belongs to another tribe, no member of which had ever attended the altar! For it is a matter of history that our Lord was a descendant of Judah, and Moses made no mention of priesthood in connection with that tribe."},{"num":15,"verse":"How fundamental is this change becomes all the more apparent when we see this other priest appearing according to the Melchizedek pattern, and deriving his priesthood not by virtue of a command imposed from outside, but from the power of indestructible life within. For the witness to him, as we have seen, is: ‘You are a priest forever according to the order of Melchizedek.’"},{"num":18,"verse":"Quite plainly, then, there is a definite cancellation of the previous commandment because of its ineffectiveness and uselessness—the Law was incapable of bringing anyone to real maturity—followed by the introduction of a better hope, through which we approach our God."},{"header":"The high Priesthood of Christ rests upon the oath of God"},{"num":20,"verse":"This means a “better” hope for us because Jesus has become our priest by the oath of God. Other men have been priests without any sworn guarantee, but Jesus has the oath of him that said of him: ‘The Lord has sworn and will not relent, You are a priest forever according to the order of Melchizedek’."},{"num":22,"verse":"And he is, by virtue of this fact, himself the living guarantee of a “better” agreement. Human High Priests have always been changing, for death made a permanent appointment impossible. But Christ, because he lives for ever, possesses a priesthood that needs no successor. This means that he can save fully and completely those who approach God through him, for he is always living to intercede on their behalf."},{"header":"Christ the perfect High Priest, who meets our need"},{"num":26,"verse":"Here is the High Priest we need. A man who is holy, faultless, unstained, beyond the very reach of sin and lifted to the very Heavens. There is no need for him, like the High Priest we know, to offer up sacrifice, first for our own sins and then for the people’s. He made one sacrifice, once for all, when he offered up himself."},{"num":28,"verse":"The Law makes for its High Priests men of human weakness. But the word of the oath, which came after the Law, makes for High Priest the Son, who is perfect for ever!"}]