[{"header":"Chapter 18[a]"},{"num":1,"verse":"Sexual Conduct. The Lord spoke again to Moses saying,"},{"num":2,"verse":"“Speak to the children of Israel and say to them: ‘I am the Lord, your God."},{"num":3,"verse":"You shall not do things like they did in Egypt, where you dwelt, nor shall you do things like they do in Canaan, where I am bringing you. You shall not do these things, nor shall you follow their ordinances."},{"num":4,"verse":"You shall observe my statutes, and you shall keep my ordinances, walking in them. I am the Lord, your God."},{"num":5,"verse":"You shall keep my ordinances and my statutes. He who obeys them shall live by them. I am the Lord, your God."},{"num":6,"verse":"“ ‘None of you is to be intimate with any of your close relatives, to uncover their nakedness. I am the Lord."},{"num":7,"verse":"You shall not uncover the nakedness of your father or your mother. She is your mother; you shall not uncover her nakedness."},{"num":8,"verse":"You shall not uncover the nakedness of your father’s wife, for her nakedness is like your father’s own nakedness."},{"num":9,"verse":"You shall not uncover the nakedness of your sister, whether she be the daughter of your father or the daughter of your mother, whether she be born in your household or elsewhere."},{"num":10,"verse":"You shall not uncover the nakedness of your son’s daughter nor shall you uncover the nakedness of your daughter’s daughter, for their nakedness is like your own nakedness."},{"num":11,"verse":"You shall not uncover the nakedness of the daughter of your father’s wife, the daughter born of your father. She is your sister, you shall not uncover her nakedness."},{"num":12,"verse":"You shall not uncover the nakedness of your father’s sister. She is your father’s close relation."},{"num":13,"verse":"You shall not uncover the nakedness of your mother’s sister. She is your mother’s close relation."},{"num":14,"verse":"You shall not uncover the nakedness of your father’s brother. You shall not be intimate with his wife; she is your aunt."},{"num":15,"verse":"You shall not uncover the nakedness of your daughter-in-law. She is your son’s wife; you shall not uncover her nakedness."},{"num":16,"verse":"You shall not uncover the nakedness of your brother’s wife. Her nakedness is like your brother’s nakedness."},{"num":17,"verse":"You shall not uncover the nakedness of both a woman and her daughter. Nor shall you uncover the nakedness of her son’s daughter nor her daughter’s daughter. They are her close relations. It would be shameful."},{"num":18,"verse":"You shall not take the sister of your wife while she is still alive, uncovering her nakedness. They would be rivals."},{"num":19,"verse":"“ ‘You shall not approach a woman to uncover her nakedness during her menstrual impurity."},{"num":20,"verse":"You shall not have sex with your neighbor’s wife, defiling both her and yourself."},{"num":21,"verse":"You shall not offer any of your children to Molech. You shall not profane the name of your God. I am the Lord."},{"num":22,"verse":"You shall not have sex with a man as you would with a woman. It is an abomination."},{"num":23,"verse":"Nor shall you have sex with any animal, defiling yourself. Nor shall any woman have sex with an animal. It is perverse."},{"num":24,"verse":"“ ‘You shall not defile yourself by doing any of these things, for the pagans have defiled themselves by all of these things. I am casting them out before you."},{"num":25,"verse":"Because of this the land is defiled, and I will punish its iniquity. The land will vomit out its inhabitants."},{"num":26,"verse":"Therefore, you shall observe my statutes and my ordinances. You shall not commit any abominations, neither anyone from your own nation nor any aliens who dwell among you."},{"num":27,"verse":"The men of the land that lies before you have committed all of these abominations, and the land is defiled."},{"num":28,"verse":"Otherwise the land will vomit you out, too, when you defile it, like it vomited out the pagans before you."},{"num":29,"verse":"Whoever commits any of these abominations shall be cut off from among their people."},{"num":30,"verse":"Therefore, you shall keep my ordinances, and you shall not do any of these abominable things, such as the things that were done before you, lest you defile yourself. I am the Lord, your God.’ ”"}]