[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hear now, Hananiah . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The narrative leaves the time and place of the interview uncertain, but suggests an interval of some days between it and the scene in the Temple court just narrated. In the strength of the “word of the Lord” which had come to him, the prophet can now tell his rival that he is a pretender, claiming the gift of prophecy for his own purposes and that of his party. There is a strange significance in the fact that the same official title is applied to both the true and the false prophets.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 28:15-17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 28:15-17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then said Jeremiah, Hear now, Hananiah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Jeremiah, being a second time confirmed in the truth of what he had foretold, and having likewise a special revelation relating to this false prophet, comes and calls him by his name, and tells him his doom, that he should die within a year, because he had ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "taught rebellion against the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Had taught people to believe and trust to what was false, contradicting God’s will revealed by Jeremiah, and encouraging and exciting the people to hold out against Nebuchadnezzar, and not quietly to yield to this dispensation of God. “Thus, as Hananiah had limited the accomplishment of his prophecy to the space of two years, to gain credit with the people by such a punctual prediction, so Jeremiah confines the trial of his veracity to a much shorter time, and the event, exactly answering to the prediction, evidently showed the falsehood of Hananiah’s pretences.” — Lowth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So Hananiah died the same year in the seventh month ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Two months after he had uttered this false prophecy, as appeareth from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So dangerous a thing it is for those who speak in the name of God to teach people contrary to his revealed will! ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:10-17 Hananiah is sentenced to die, and Jeremiah, when he has received direction from God, boldly tells him so; but not before he received that commission. Those have much to answer for, who tell sinners that they shall have peace, though they harden their hearts in contempt of God's word. The servant of God must be gentle to all men. He must give up even his right, and leave the Lord to plead his cause. Every attempt of ungodly men to make vain the purposes of God, will add to their miseries.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The multitude would see in Hananiah's act a symbol of deliverance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. makest … trust in a lie—(Jer 29:31; Eze 13:22).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Jeremiah being a second time confirmed in the truth of his revelation, and having likewise a special revelation relating to this false prophet, comes now and tells him his doom, viz. that he should die within a year, because he had taught people to believe, and to hope for, and trust to what was false, and they were never like to see. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then said Jeremiah the prophet unto Hananiah the prophet,.... The false prophet, as he is again called by the Targum, and in the Syriac version; where he went to him, and met with him, whether in the temple or elsewhere, is not mentioned; very probably in some public place, that there might be witnesses of what was said; for it was for the conviction of others, as well as for his own confusion, the following things are observed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hear now, Hananiah, the Lord hath not sent thee; though he spoke in his name, and pretended a mission from him, when he had none, which was abominable wickedness: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but thou makest this people to trust in a lie: that the Lord would break off the yoke of the king of Babylon, and free the nations from servitude to him, particularly Judea; and that the king, and his princes, and people, and the vessels of the temple, carried away with him, would be returned within two years; this the people depended on as coming from the Lord, when he was not sent by him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but thou makest this people to trust in a lie: that the Lord would break off the yoke of the king of Babylon, and free the nations from servitude to him, particularly Judea; and that the king, and his princes, and people, and the vessels of the temple, carried away with him, would be returned within two years; this the people depended on as coming from the Lord, when he was not sent by him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then said the prophet Jeremiah unto Hananiah the prophet, Hear now, Hananiah; The LORD hath not sent thee; but thou makest this people to trust in a lie.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The prophet Jeremiah unto Hananiah the prophet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In one sense Hananiah was a prophet as much as Jeremiah. He claimed to have received the prophetic call, and God alone, who searcheth the heart, could pronounce upon the justice of his claim. Whatever training was regarded as necessary for the office he had probably gone through, and now for a number of years he had been universally recognized as a member of the prophetic class. Probably he had those natural gifts, including a real, though dim and not unerring, \"second sight,\" which seems to have formed the substratum of Old Testament prophecy; but he certainly had not the moral backbone so conspicuous in Jeremiah, and he lacked that intimate communion with God (this became dear on the present occasion) which alone warranted the assurance that \"Jehovah, the God of Israel, hath sent me.\" Jeremiah 28:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord's testimony against Hananiah. - Apparently not long after Jeremiah had departed, he received from the Lord the commission to go to Hananiah and to say to him: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Thus saith Jahveh: Yokes of wood hast thou broken, but hast made in place of them yokes of iron. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For thus saith Jahveh of hosts, the God of Israel: A yoke of iron I lay upon the neck of all these nations, that they may serve Nebuchadnezzar king of Babylon, and they shall serve him; and the beasts of the field also have I given him.\" - When the prophet says: Yokes of wood hast thou broken, etc., we are not to understand him as speaking of the breaking of the wooden yoke Jeremiah had been wearing; he gives the deeper meaning of that occurrence. By breaking Jeremiah's wooden yoke, Hananiah has only signified that the yoke Nebuchadnezzar lays on the nations will not be so easily broken as a wooden one, but is of iron, i.e., not to be broken. The plural \"yokes\" is to be explained by the emblematical import of the words, and is not here to be identified, as it sometimes may be, with the singular, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shows in what sense Hananiah put an iron yoke in the place of the wooden one: Jahveh will lay iron yokes on all nations, that they may serve the king of Babel. Hananiah's breaking the wooden yoke does not alter the divine decree, but is made to contribute to its fuller revelation. With the last clause of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 27:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". - Hereupon Jeremiah forewarns the false prophets what is to be God's punishment on them for their false and audacious declarations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Hear now, Hananiah: Jahveh hath not sent thee, and thou hast made this people to believe a lie. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore thus saith Jahveh: Behold, I cast thee from off the face of the earth; this year shalt thou die, for thou hast spoken rebellion against Jahveh.\" \"The year\"  equals  this year, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words \"for thou hast spoken,\" etc., recall ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They involve an application to Hananiah's case of the command there given to put such a prophet to death, and show how it can with justice be said that the Lord will cast him from off the face of the earth. The verb משׁלּחך is chosen for the sake of the play on לא שׁלחך. God has not sent him as prophet to His people, but will send him away from off the earth, i.e., cause him to die. - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is recorded that this saying was soon fulfilled. Hananiah died in the seventh month of that year, i.e., two months after his controversy with Jeremiah (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]