[{"header":"Water from a Rock"},{"num":17,"verse":"The whole Israelite community left the Desert of Sin. They traveled from place to place as the Lord commanded. They camped at Rephidim. But there was no water there for the people to drink. "},{"num":2,"verse":"So they quarreled with Moses. They said, “Give us water to drink.”"},{"num":3,"verse":"But the people were very thirsty for water. So they grumbled against Moses. They said, “Why did you bring us out of Egypt? Was it to kill us, our children and our farm animals with thirst?”"},{"num":4,"verse":"So Moses cried to the Lord, “What can I do with these people? They are almost ready to kill me with stones.”"},{"num":5,"verse":"The Lord said to Moses, “Go ahead of the people of Israel. And take some of the elders of Israel with you. Carry with you the walking stick that you used to strike the Nile River. Now go! "},{"num":6,"verse":"I will stand in front of you on a rock at Mount Sinai. Hit that rock with the stick, and water will come out of it. Then the people can drink.” Moses did these things as the elders of Israel watched. "},{"num":7,"verse":"Moses named that place Massah because the Israelites tested the Lord. They asked, “Is the Lord with us or not?” He also named it Meribah because they quarreled."},{"header":"The Amalekites Fight Israel"},{"num":8,"verse":"At Rephidim the Amalekites came and fought the Israelites. "},{"num":9,"verse":"So Moses said to Joshua, “Choose some men and go and fight the Amalekites. Tomorrow I will stand on the top of the hill. I will hold the stick God gave me to carry.”"},{"num":10,"verse":"Joshua obeyed Moses and went to fight the Amalekites. At the same time Moses, Aaron and Hur went to the top of the hill. "},{"num":11,"verse":"As long as Moses held his hands up, the Israelites would win the fight. But when Moses put his hands down, the Amalekites would win. "},{"num":12,"verse":"Later, Moses’ arms became tired. So the men put a large rock under Moses, and he sat on it. Then Aaron and Hur held up Moses’ hands. Aaron was on one side of Moses, and Hur was on the other side. They held his hands up like this until the sun went down. "},{"num":13,"verse":"So Joshua defeated the Amalekites in this battle."},{"num":14,"verse":"Then the Lord said to Moses, “Write about this battle in a book so people will remember. And be sure to tell Joshua. Tell him because I will completely destroy the Amalekites from the earth.”"},{"num":15,"verse":"Then Moses built an altar. He named it The Lord is my Banner. "},{"num":16,"verse":"Moses said, “I lifted my hands toward the Lord’s throne. The Lord will fight against the Amalekites forever.”"}]