[{"header":"The Futility of Reliance on Egypt"},{"num":6,"verse":"An oracle concerning the animals of the Negeb."},{"header":"A Rebellious People"},{"header":"God’s Promise to Zion"},{"num":19,"verse":"Truly, O people in Zion, inhabitants of Jerusalem, you shall weep no more. He will surely be gracious to you at the sound of your cry; when he hears it, he will answer you. "},{"num":20,"verse":"Though the Lord may give you the bread of adversity and the water of affliction, yet your Teacher will not hide himself any more, but your eyes shall see your Teacher. "},{"num":21,"verse":"And when you turn to the right or when you turn to the left, your ears shall hear a word behind you, saying, ‘This is the way; walk in it.’ "},{"num":22,"verse":"Then you will defile your silver-covered idols and your gold-plated images. You will scatter them like filthy rags; you will say to them, ‘Away with you!’"},{"num":23,"verse":"He will give rain for the seed with which you sow the ground, and grain, the produce of the ground, which will be rich and plenteous. On that day your cattle will graze in broad pastures; "},{"num":24,"verse":"and the oxen and donkeys that till the ground will eat silage, which has been winnowed with shovel and fork. "},{"num":25,"verse":"On every lofty mountain and every high hill there will be brooks running with water—on a day of the great slaughter, when the towers fall. "},{"num":26,"verse":"Moreover, the light of the moon will be like the light of the sun, and the light of the sun will be sevenfold, like the light of seven days, on the day when the Lord binds up the injuries of his people, and heals the wounds inflicted by his blow."},{"header":"Judgement on Assyria"},{"num":29,"verse":"You shall have a song as in the night when a holy festival is kept; and gladness of heart, as when one sets out to the sound of the flute to go to the mountain of the Lord, to the Rock of Israel. "},{"num":30,"verse":"And the Lord will cause his majestic voice to be heard and the descending blow of his arm to be seen, in furious anger and a flame of devouring fire, with a cloudburst and tempest and hailstones. "},{"num":31,"verse":"The Assyrian will be terror-stricken at the voice of the Lord, when he strikes with his rod. "},{"num":32,"verse":"And every stroke of the staff of punishment that the Lord lays upon him will be to the sound of timbrels and lyres; battling with brandished arm he will fight with him. "},{"num":33,"verse":"For his burning-place has long been prepared; truly it is made ready for the king, its pyre made deep and wide, with fire and wood in abundance; the breath of the Lord, like a stream of sulphur, kindles it."}]