[{"num":104,"verse":"Alleluia. Give glory to the Lord, and call upon his name: declare his deeds among the Gentiles."},{"num":2,"verse":"Sing to him, yea sing praises to him: relate all his wondrous works."},{"num":3,"verse":"Glory ye in his holy name: let the heart of them rejoice that seek the Lord."},{"num":4,"verse":"Seek ye the Lord, and be strengthened: seek his face evermore."},{"num":5,"verse":"Remember his marvellous works which he hath done; his wonders, and the judgments of his mouth."},{"num":6,"verse":"O ye seed of Abraham his servant; ye sons of Jacob his chosen."},{"num":7,"verse":"He is the Lord our God: his judgments are in all the earth."},{"num":8,"verse":"He hath remembered his covenant for ever: the word which he commanded to a thousand generations."},{"num":9,"verse":"Which he made to Abraham; and his oath to Isaac:"},{"num":10,"verse":"And he appointed the same to Jacob for a law, and to Israel for an everlasting testament:"},{"num":11,"verse":"Saying: To thee will I give the land of Chanaan, the lot of your inheritance."},{"num":12,"verse":"When they were but a small number: yea very few, and sojourners therein:"},{"num":13,"verse":"And they passed from nation to nation, and from one kingdom to another people."},{"num":14,"verse":"He suffered no man to hurt them: and he reproved kings for their sakes."},{"num":15,"verse":"Touch ye not my anointed: and do no evil to my prophets."},{"num":16,"verse":"And he called a famine upon the land: and he broke in pieces all the support of bread."},{"num":17,"verse":"He sent a man before them: Joseph, who was sold for a slave."},{"num":18,"verse":"They humbled his feet in fetters: the iron pierced his soul,"},{"num":19,"verse":"Until his word came. The word of the Lord inflamed him."},{"num":20,"verse":"The king sent, and he released him: the ruler of the people, and he set him at liberty."},{"num":21,"verse":"He made him master of his house, and ruler of all his possession."},{"num":22,"verse":"That he might instruct his princes as himself, and teach his ancients wisdom."},{"num":23,"verse":"And Israel went into Egypt: and Jacob was a sojourner in the land of Cham."},{"num":24,"verse":"And he increased his people exceedingly: and strengthened them over their enemies,"},{"num":25,"verse":"He turned their heart to hate his people: and to deal deceitfully with his servants."},{"num":26,"verse":"He sent Moses his servant: Aaron the man whom he had chosen."},{"num":27,"verse":"He gave them power to shew his signs, and his wonders in the land of Cham."},{"num":28,"verse":"He sent darkness, and made it obscure: and grieved not his words."},{"num":29,"verse":"He turned their waters into blood, and destroyed their fish."},{"num":30,"verse":"Their land brought forth frogs, in the inner chambers of their kings."},{"num":31,"verse":"He spoke, and there came divers sorts of flies and sciniphs in all their coasts."},{"num":32,"verse":"He gave them hail for rain, a burning fire in the land."},{"num":33,"verse":"And he destroyed their vineyards and their fig trees: and he broke in pieces the trees of their coasts."},{"num":34,"verse":"He spoke, and the locust came, and the bruchus, of which there was no number."},{"num":35,"verse":"And they devoured all the grass in their land, and consumed all the fruit of their ground."},{"num":36,"verse":"And he slew all the firstborn in their land: the firstfruits of all their labour."},{"num":37,"verse":"And he brought them out with silver and gold: and there was not among their tribes one that was feeble."},{"num":38,"verse":"Egypt was glad when they departed: for the fear of them lay upon them."},{"num":39,"verse":"He spread a cloud for their protection, and fire to give them light in the night."},{"num":40,"verse":"They asked, and the quail came: and he filled them with the bread of heaven."},{"num":41,"verse":"He opened the rock, and waters flowed: rivers ran down in the dry land."},{"num":42,"verse":"Because he remembered his holy word, which he had spoken to his servant Abraham."},{"num":43,"verse":"And he brought forth his people with joy, and his chosen with gladness."},{"num":44,"verse":"And he gave them the lands of the Gentiles: and they possessed the labours of the people:"},{"num":45,"verse":"That they might observe his justifications, and seek after his law."}]