[{"num":104,"verse":"1 An excellent Psalm to praise God for the creation of the world, and the governance of the same by his marvelous providence. 35 Wherein the Prophet prayeth against the wicked, who are occasions that God diminisheth his blessings."},{"num":1,"verse":"My soul, praise thou the Lord: O Lord my God, thou art exceeding great, thou art clothed with glory and honor."},{"num":2,"verse":"Which covereth himself with light, as with a garment, and spreadeth the heavens like a curtain."},{"num":3,"verse":"Which layeth the beams of his chambers in the waters, and maketh the clouds his chariot, and walketh upon the wings of the wind."},{"num":4,"verse":"Which maketh the spirits his messengers, and a flaming fire his ministers."},{"num":5,"verse":"He set the earth upon her foundations, so that it shall never move."},{"num":6,"verse":"Thou coverest it with the deep as with a garment: the waters would stand above the mountains."},{"num":7,"verse":"But at thy rebuke they flee: at the voice of thy thunder they haste away."},{"num":8,"verse":"And the mountains ascend, and the valleys descend to the place which thou hast established for them."},{"num":9,"verse":"But thou hast set them a bound which they shall not pass: they shall not return to cover the earth."},{"num":10,"verse":"He sendeth the springs into the valleys, which run between the mountains."},{"num":11,"verse":"They shall give drink to all the beasts of the field, and the wild asses shall quench their thirst."},{"num":12,"verse":"By these springs shall the fowls of the heaven dwell, and sing among the branches."},{"num":13,"verse":"He watereth the mountains from his chambers, and the earth is filled with the fruit of thy works."},{"num":14,"verse":"He causeth grass to grow for the cattle, and herb for the use of man, that he may bring forth bread out of the earth,"},{"num":15,"verse":"And wine that maketh glad the heart of man, and oil to make his face to shine, and bread that strengtheneth man’s heart."},{"num":16,"verse":"The high trees are satisfied, even the cedars of Lebanon, which he hath planted,"},{"num":17,"verse":"That the birds may make their nests there: the stork dwelleth in the fir trees."},{"num":18,"verse":"The high mountains are for the goats: the rocks are a refuge for the conies."},{"num":19,"verse":"He appointed the moon for certain seasons: the sun knoweth his going down."},{"num":20,"verse":"Thou makest darkness, and it is night, wherein all the beasts of the forest creep forth."},{"num":21,"verse":"The lions roar after their prey, and seek their meat at God."},{"num":22,"verse":"When the sun riseth, they retire, and couch in their dens."},{"num":23,"verse":"Then goeth man forth to his work, and to his labor until the evening."},{"num":24,"verse":"O Lord, how manifold are thy works! in wisdom hast thou made them all: the earth is full of thy riches."},{"num":25,"verse":"So is the sea great and wide: for therein are things creeping innumerable, both small beasts and great."},{"num":26,"verse":"There go the ships, yea that Leviathan, whom thou hast made to play therein."},{"num":27,"verse":"All these wait upon thee, that thou mayest give them food in due season."},{"num":28,"verse":"Thou givest it to them, and they gather it, thou openest thy hand, and they are filled with good things."},{"num":29,"verse":"But if thou hide thy face, they are troubled: if thou take away their breath, they die and return to their dust:"},{"num":30,"verse":"Again if thou send forth thy spirit, they are created, and thou renewest the face of the earth."},{"num":31,"verse":"Glory be to the Lord forever: let the Lord rejoice in his works."},{"num":32,"verse":"He looketh on the earth and it trembleth: he toucheth the mountains, and they smoke."},{"num":33,"verse":"I will sing unto the Lord all my life: I will praise my God, while I live."},{"num":34,"verse":"Let my words be acceptable unto him: I will rejoice in the Lord."},{"num":35,"verse":"Let the sinners be consumed out of the earth, and the wicked till there be no more: O my soul, praise thou the Lord. Praise ye the Lord."}]