[{"header":"Healing at the Pool"},{"num":5,"verse":"After this, there was a Jewish festival, and Jesus went up to Jerusalem."},{"num":2,"verse":"Near the Sheep Gate in Jerusalem there is a pool, called Bethesda in Aramaic, which has five colonnades. "},{"num":3,"verse":"Within these lay a large number of sick people—blind, lame, or paralyzed—who were waiting for the movement of the water. "},{"num":4,"verse":"For an angel would go down at certain times into the pool and stir up the water. Whoever stepped in first after the stirring of the water was healed of whatever disease he had. "},{"num":5,"verse":"One man was there who had been sick for thirty-eight years. "},{"num":6,"verse":"When Jesus saw him lying there and knew he had already been sick a long time, he asked him, “Do you want to get well?”"},{"num":7,"verse":"“Sir,” the sick man answered, “I have no one to put me into the pool when the water is stirred up. While I’m going, someone else goes down ahead of me.”"},{"num":8,"verse":"Jesus said to him, “Get up! Pick up your mat and walk.” "},{"num":9,"verse":"Instantly the man was healed. He picked up his mat and walked."},{"num":10,"verse":"So the Jews told the man who had been healed, “This is the Sabbath! You are not permitted to carry your mat.”"},{"num":11,"verse":"He answered them, “The one who made me well told me, ‘Pick up your mat and walk.’”"},{"num":12,"verse":"Then they asked him, “Who is the man who told you, ‘Pick it up and walk’?” "},{"num":13,"verse":"But the man who was healed did not know who it was, for Jesus had slipped away into the crowd that was there."},{"num":14,"verse":"Later Jesus found him in the temple and said to him, “Look, you are well now. Do not sin anymore so that nothing worse happens to you.”"},{"num":15,"verse":"The man went back and reported to the Jews that it was Jesus who made him well."},{"header":"God’s Son"},{"num":16,"verse":"So the Jews began to persecute Jesus, because he was doing these things on the Sabbath. "},{"num":17,"verse":"But Jesus answered them, “My Father is working right up to the present time, and I am working too.”"},{"num":18,"verse":"This is why the Jews tried all the more to kill him, because he was not merely breaking the Sabbath, but was even calling God his own Father, making himself equal with God."},{"num":19,"verse":"Jesus answered them directly, “Amen, Amen, I tell you: The Son can do nothing on his own, but only what he sees the Father doing. Indeed, the Son does exactly what the Father does. "},{"num":20,"verse":"For the Father loves the Son and shows him everything he is doing. And he will show him even greater works than these so that you will be amazed. "},{"num":21,"verse":"For just as the Father raises the dead and gives them life, so also the Son gives life to those he wishes."},{"num":22,"verse":"“In fact, the Father judges no one, but has entrusted all judgment to the Son, "},{"num":23,"verse":"so that all should honor the Son just as they honor the Father. Whoever does not honor the Son does not honor the Father who sent him. "},{"num":24,"verse":"Amen, Amen, I tell you: Anyone who hears my word and believes him who sent me has eternal life. He is not going to come into judgment but has crossed over from death to life."},{"num":25,"verse":"“Amen, Amen, I tell you: A time is coming and is here now when the dead will hear the voice of the Son of God, and those who listen will live. "},{"num":26,"verse":"For just as the Father has life in himself, so also he has granted the Son to have life in himself. "},{"num":27,"verse":"And he has given him authority to execute judgment, because he is the Son of Man."},{"num":28,"verse":"“Do not be amazed at this, for a time is coming when all who are in their graves will hear his voice "},{"num":29,"verse":"and will come out. Those who have done good will rise to live, but those who have practiced evil will rise to be condemned. "},{"num":30,"verse":"I can do nothing at all on my own. I judge only as I hear. And my judgment is just, for I do not seek my own will, but the will of him who sent me."},{"num":31,"verse":"“If I were to testify about myself, my testimony would not be valid. "},{"num":32,"verse":"There is another who testifies about me, and I know that his testimony about me is valid. "},{"num":33,"verse":"You sent to John, and he has testified to the truth. "},{"num":34,"verse":"The testimony I receive is not from man, but I am saying these things so that you may be saved. "},{"num":35,"verse":"John was a lamp that was shining brightly, and for a while you wanted to enjoy his light. "},{"num":36,"verse":"But I have testimony greater than John’s. For the works that the Father gave me to carry out, the very works that I am doing, these testify about me that the Father has sent me. "},{"num":37,"verse":"The Father who sent me—he is the one who has testified about me. You have never heard his voice or seen his form. "},{"num":38,"verse":"And you do not have his word remaining in you, because you do not believe the one he sent. "},{"num":39,"verse":"You search the Scriptures because you think you have eternal life in them. They testify about me! "},{"num":40,"verse":"And yet you do not want to come to me in order to have life."},{"num":41,"verse":"“I do not accept honor from people. "},{"num":42,"verse":"But I know you. I know that you do not have the love of God within you. "},{"num":43,"verse":"I have come in my Father’s name, yet you do not accept me. If someone else comes in his own name, you will accept him. "},{"num":44,"verse":"How can you believe while you continue to accept glory from one another and you do not seek the glory that comes from the only God?"},{"num":45,"verse":"“Do not think that I will accuse you to the Father. The one who accuses you is Moses, on whom you have set your hope. "},{"num":46,"verse":"For if you believed Moses, you would believe me, because he wrote about me. "},{"num":47,"verse":"But if you do not believe his writings, how will you believe what I say?”"}]