[{"header":"Jesus Heals a Man at a Pool"},{"num":5,"verse":"Later Jesus went to Jerusalem for a special Jewish feast. "},{"num":2,"verse":"In Jerusalem there is a pool with five covered porches. In the Jewish language it is called Bethzatha. This pool is near the Sheep Gate. "},{"num":3,"verse":"Many sick people were lying on the porches beside the pool. Some were blind, some were crippled, and some were paralyzed [and they waited for the water to move. "},{"num":4,"verse":"Sometimes an angel of the Lord came down to the pool and stirred up the water. After the angel did this, the first person to go into the pool was healed from any sickness he had]. "},{"num":5,"verse":"There was a man lying there who had been sick for 38 years. "},{"num":6,"verse":"Jesus saw the man and knew that he had been sick for a very long time. So Jesus asked him, “Do you want to be well?”"},{"num":7,"verse":"The sick man answered, “Sir, there is no one to help me get into the pool when the water starts moving. I try to be the first one into the water. But when I try, someone else always goes in before I can.”"},{"num":8,"verse":"Then Jesus said, “Stand up. Pick up your mat and walk.” "},{"num":9,"verse":"And immediately the man was well. He picked up his mat and began to walk."},{"num":10,"verse":"So the Jews said to the man who had been healed, “Today is the Sabbath. It is against our law for you to carry your mat on the Sabbath day.”"},{"num":11,"verse":"But he answered, “The man who made me well told me, ‘Pick up your mat and walk.’”"},{"num":12,"verse":"Then they asked him, “Who is the man who told you to pick up your mat and walk?”"},{"num":13,"verse":"But the man who had been healed did not know who it was. There were many people in that place, and Jesus had left."},{"num":14,"verse":"Later, Jesus found the man at the Temple. Jesus said to him, “See, you are well now. But stop sinning or something worse may happen to you!”"},{"num":15,"verse":"Then the man left and went back to the Jews. He told them that Jesus was the one who had made him well."},{"num":16,"verse":"Jesus was doing this on the Sabbath day. So the Jews began to do bad things to him. "},{"num":17,"verse":"But Jesus said to them, “My Father never stops working. And so I work, too.”"},{"num":18,"verse":"This made the Jews try harder to kill him. They said, “First Jesus was breaking the law about the Sabbath day. Then he said that God is his own Father! He is making himself equal with God!”"},{"header":"Jesus Has God’s Authority"},{"num":19,"verse":"But Jesus said, “I tell you the truth. The Son can do nothing alone. The Son does only what he sees his Father doing. The Son does whatever the Father does. "},{"header":"Jesus Is God’s Son"}]