[{"header":"A Paralytic Is Healed"},{"num":5,"verse":"After these things there was a feast of the Jews, and Jesus went up to Jerusalem. "},{"num":2,"verse":"Now there is in Jerusalem near the Sheep Gate a pool called in Aramaic Bethzatha, which has five porticoes. "},{"num":3,"verse":"In these were lying a large number of those who were sick, blind, lame, paralyzed. "},{"num":5,"verse":"And a certain man was there who had been thirty-eight years in his sickness. "},{"num":6,"verse":"Jesus, when he saw this one lying there and knew that he had been sick a long time already, said to him, “Do you want to become well?” "},{"num":7,"verse":"The one who was sick answered him, “Sir, I do not have anyone that, whenever the water is stirred up, could put me into the pool. But while I am coming, another goes down before me.” "},{"num":8,"verse":"Jesus said to him, “Get up! Pick up your mat and walk!” "},{"num":9,"verse":"And immediately the man became well and picked up his mat and began to walk. (Now it was the Sabbath on that day.)"},{"num":10,"verse":"So the Jews were saying to the one who had been healed, “It is the Sabbath, and it is not permitted for you to pick up the mat!” "},{"num":11,"verse":"But he answered them, “The one who made me well—that one said to me, ‘Pick up your mat and walk!’” "},{"num":12,"verse":"So they asked him, “Who is the man who said to you, ‘Pick up your mat and walk?’” "},{"num":13,"verse":"But the one who was healed did not know who it was, for Jesus had withdrawn while a crowd was in the place."},{"header":"Equal with God"},{"num":14,"verse":"After these things Jesus found him at the temple and said to him, “Look, you have become well! Sin no longer, lest something worse happen to you.” "},{"num":15,"verse":"The man went and reported to the Jews that Jesus was the one who made him well. "},{"num":16,"verse":"And on account of this the Jews began to persecute Jesus, because he was doing these things on the Sabbath. "},{"num":17,"verse":"But he answered them, “My Father is working until now, and I am working.” "},{"num":18,"verse":"So on account of this the Jews were seeking even more to kill him, because he not only was breaking the Sabbath, but also was calling God his own Father, thus making himself equal with God."},{"header":"The Authority of the Son"},{"num":19,"verse":"So Jesus answered and said to them, “Truly, truly I say to you, the Son can do nothing from himself except what he sees the Father doing. For whatever that one does, these things also the Son does likewise. "},{"num":20,"verse":"For the Father loves the Son and shows him everything that he himself is doing. And greater works than these he will show him, so that you will be astonished. "},{"num":21,"verse":"For just as the Father raises the dead and makes them alive, thus also the Son makes alive whomever he wishes. "},{"num":22,"verse":"For the Father does not judge anyone, but he has given all judgment to the Son, "},{"num":23,"verse":"in order that all people will honor the Son, just as they honor the Father. The one who does not honor the Son does not honor the Father who sent him. "},{"num":24,"verse":"Truly, truly I say to you that the one who hears my word and who believes the one who sent me has eternal life, and does not come into judgment, but has passed from death into life."},{"num":25,"verse":"“Truly, truly I say to you, that an hour is coming—and now is here—when the dead will hear the voice of the Son of God, and the ones who hear will live. "},{"num":26,"verse":"For just as the Father has life in himself, thus also he has granted to the Son to have life in himself. "},{"num":27,"verse":"And he has granted him authority to carry out judgment, because he is the Son of Man."},{"num":28,"verse":"“Do not be astonished at this, because an hour is coming in which all those in the tombs will hear his voice "},{"num":29,"verse":"and they will come out—those who have done good things to a resurrection of life, but those who have practiced evil things to a resurrection of judgment. "},{"num":30,"verse":"I am able to do nothing from myself. Just as I hear, I judge, and my judgment is just, because I do not seek my own will, but the will of the one who sent me."},{"header":"Further Testimony About the Son"},{"num":31,"verse":"“If I testify about myself, my testimony is not true. "},{"num":32,"verse":"There is another who testifies about me, and I know that the testimony which he testifies about me is true. "},{"num":33,"verse":"You have sent to John and he has testified to the truth. "},{"num":34,"verse":"(And I do not receive testimony from people, but I say these things in order that you may be saved.) "},{"num":35,"verse":"That one was the lamp which was burning and shining, and you wanted to rejoice for an hour in his light."},{"num":36,"verse":"“But I have a testimony greater than John’s, for the works which the Father has given to me that I should complete them—the very works which I am doing—these testify about me, that the Father has sent me. "},{"num":37,"verse":"And the Father who sent me, that one has testified about me. You have neither heard his voice at any time nor seen his form. "},{"num":38,"verse":"And you do not have his word residing in yourselves, because the one whom that one sent, in this one you do not believe. "},{"num":39,"verse":"You search the scriptures because you think that you have eternal life in them, and it is these that testify about me. "},{"num":40,"verse":"And you are not willing to come to me so that you may have life."},{"num":41,"verse":"“I do not accept glory from people, "},{"num":42,"verse":"but I know you, that you do not have the love of God in yourselves. "},{"num":43,"verse":"I have come in my Father’s name, and you do not accept me. If another should come in his own name, you would accept that one! "},{"num":44,"verse":"How are you able to believe, if you accept glory from one another, and do not seek the glory which is from the only God? "},{"num":45,"verse":"Do not think that I will accuse you before the Father! The one who accuses you is Moses, in whom you have put your hope! "},{"num":46,"verse":"For if you had believed Moses, you would believe me, for that one wrote about me. "},{"num":47,"verse":"But if you do not believe that one’s writings, how will you believe my words?”"}]