[{"header":"Jesus Heals a Man at the Pool"},{"num":5,"verse":"Some time later, Jesus went up to Jerusalem for one of the Jewish feasts. "},{"num":2,"verse":"In Jerusalem near the Sheep Gate is a pool. In the Aramaic language it is called Bethesda. It is surrounded by five rows of columns with a roof over them. "},{"num":3,"verse":"Here a great number of disabled people used to lie down. Among them were those who were blind, those who could not walk, and those who could hardly move. "},{"num":5,"verse":"One person was there who had not been able to walk for 38 years. "},{"num":6,"verse":"Jesus saw him lying there. He knew that the man had been in that condition for a long time. So he asked him, “Do you want to get well?”"},{"num":7,"verse":"“Sir,” the disabled man replied, “I have no one to help me into the pool when an angel stirs up the water. I try to get in, but someone else always goes down ahead of me.”"},{"num":8,"verse":"Then Jesus said to him, “Get up! Pick up your mat and walk.” "},{"num":9,"verse":"The man was healed right away. He picked up his mat and walked."},{"num":10,"verse":"So the Jewish leaders said to the man who had been healed, “It is the Sabbath day. The law does not allow you to carry your mat.”"},{"num":11,"verse":"But he replied, “The one who made me well said to me, ‘Pick up your mat and walk.’ ”"},{"num":12,"verse":"They asked him, “Who is this fellow? Who told you to pick it up and walk?”"},{"num":13,"verse":"The one who was healed had no idea who it was. Jesus had slipped away into the crowd that was there."},{"num":14,"verse":"Later Jesus found him at the temple. Jesus said to him, “See, you are well again. Stop sinning, or something worse may happen to you.” "},{"num":15,"verse":"The man went away. He told the Jewish leaders it was Jesus who had made him well."},{"header":"The Authority of the Son"},{"num":16,"verse":"Jesus was doing these things on the Sabbath day. So the Jewish leaders began to oppose him. "},{"num":17,"verse":"Jesus defended himself. He said to them, “My Father is always doing his work. He is working right up to this day. I am working too.” "},{"num":18,"verse":"For this reason the Jewish leaders tried even harder to kill him. According to them, Jesus was not only breaking the law of the Sabbath day. He was even calling God his own Father. He was making himself equal with God."},{"num":19,"verse":"Jesus answered, “What I’m about to tell you is true. The Son can do nothing by himself. He can do only what he sees his Father doing. What the Father does, the Son also does. "},{"num":20,"verse":"This is because the Father loves the Son. The Father shows him everything he does. Yes, and the Father will show the Son even greater works than these. And you will be amazed. "},{"num":21,"verse":"The Father raises the dead and gives them life. In the same way, the Son gives life to anyone he wants to. "},{"num":22,"verse":"Also, the Father does not judge anyone. He has given the Son the task of judging. "},{"num":23,"verse":"Then all people will honor the Son just as they honor the Father. Whoever does not honor the Son does not honor the Father, who sent him."},{"num":24,"verse":"“What I’m about to tell you is true. Anyone who hears my word and believes him who sent me has eternal life. They will not be judged. They have crossed over from death to life. "},{"num":25,"verse":"What I’m about to tell you is true. A time is coming for me to give life. In fact, it has already begun. The dead will hear the voice of the Son of God. Those who hear it will live. "},{"num":26,"verse":"The Father has life in himself. He has allowed the Son also to have life in himself. "},{"num":27,"verse":"And the Father has given him the authority to judge. This is because he is the Son of Man."},{"num":28,"verse":"“Do not be amazed at this. A time is coming when all who are in their graves will hear his voice. "},{"num":29,"verse":"They will all come out of their graves. People who have done what is good will rise and live again. People who have done what is evil will rise and be found guilty. "},{"num":30,"verse":"I can do nothing by myself. I judge only as I hear. And my judging is fair. I do not try to please myself. I try to please the one who sent me."},{"header":"Being a Witness About Jesus"},{"num":31,"verse":"“If I am a witness about myself, what I say is not true. "},{"num":32,"verse":"There is someone else who is a witness in my favor. And I know that what he says about me is true."},{"num":33,"verse":"“You have sent people to John the Baptist. He has been a witness to the truth. "},{"num":34,"verse":"I do not accept what a person says. I only talk about what John says so that you can be saved. "},{"num":35,"verse":"John was like a lamp that burned and gave light. For a while you chose to enjoy his light."},{"num":36,"verse":"“What I say about myself is more important than what John says about me. I am doing the works the Father gave me to finish. These works are a witness that the Father has sent me. "},{"num":37,"verse":"The Father who sent me is himself a witness about me. You have never heard his voice. You have never seen what he really looks like. "},{"num":38,"verse":"And his word does not live in you. That’s because you do not believe the one he sent. "},{"num":39,"verse":"You study the Scriptures carefully. You study them because you think they will give you eternal life. The Scriptures you study are a witness about me. "},{"num":40,"verse":"But you refuse to come to me and receive life."},{"num":41,"verse":"“I do not accept praise from human beings. "},{"num":42,"verse":"But I know you. I know that you do not have love for God in your hearts. "},{"num":43,"verse":"I have come in my Father’s name, and you do not accept me. But if someone else comes in his own name, you will accept him. "},{"num":44,"verse":"You accept praise from one another. But you do not seek the praise that comes from the only God. So how can you believe?"},{"num":45,"verse":"“Do not think I will bring charges against you in front of the Father. Moses is the one who does that. And he is the one you build your hopes on. "},{"num":46,"verse":"Do you believe Moses? Then you should believe me. He wrote about me. "},{"num":47,"verse":"But you do not believe what he wrote. So how are you going to believe what I say?”"}]