[{"header":"The healing at the pool"},{"num":5,"verse":"Some time later, Jesus went up to Jerusalem for one of the Jewish festivals. "},{"num":2,"verse":"Now there is in Jerusalem near the Sheep Gate a pool, which in Aramaic is called Bethesda and which is surrounded by five covered colonnades. "},{"num":3,"verse":"Here a great number of disabled people used to lie – the blind, the lame, the paralysed. "},{"num":5,"verse":"One who was there had been an invalid for thirty-eight years. "},{"num":6,"verse":"When Jesus saw him lying there and learned that he had been in this condition for a long time, he asked him, ‘Do you want to get well?’"},{"num":7,"verse":"‘Sir,’ the invalid replied, ‘I have no one to help me into the pool when the water is stirred. While I am trying to get in, someone else goes down ahead of me.’"},{"num":8,"verse":"Then Jesus said to him, ‘Get up! Pick up your mat and walk.’ "},{"num":9,"verse":"At once the man was cured; he picked up his mat and walked."},{"num":10,"verse":"and so the Jewish leaders said to the man who had been healed, ‘It is the Sabbath; the law forbids you to carry your mat.’"},{"num":11,"verse":"But he replied, ‘The man who made me well said to me, “Pick up your mat and walk.”’"},{"num":12,"verse":"So they asked him, ‘Who is this fellow who told you to pick it up and walk?’"},{"num":13,"verse":"The man who was healed had no idea who it was, for Jesus had slipped away into the crowd that was there."},{"num":14,"verse":"Later Jesus found him at the temple and said to him, ‘See, you are well again. Stop sinning or something worse may happen to you.’ "},{"num":15,"verse":"The man went away and told the Jewish leaders that it was Jesus who had made him well."},{"header":"The authority of the Son"},{"num":16,"verse":"So, because Jesus was doing these things on the Sabbath, the Jewish leaders began to persecute him. "},{"num":17,"verse":"In his defence Jesus said to them, ‘My Father is always at his work to this very day, and I too am working.’ "},{"num":18,"verse":"For this reason they tried all the more to kill him; not only was he breaking the Sabbath, but he was even calling God his own Father, making himself equal with God."},{"num":19,"verse":"Jesus gave them this answer: ‘Very truly I tell you, the Son can do nothing by himself; he can do only what he sees his Father doing, because whatever the Father does the Son also does. "},{"num":20,"verse":"For the Father loves the Son and shows him all he does. Yes, and he will show him even greater works than these, so that you will be amazed. "},{"num":21,"verse":"For just as the Father raises the dead and gives them life, even so the Son gives life to whom he is pleased to give it. "},{"num":22,"verse":"Moreover, the Father judges no one, but has entrusted all judgment to the Son, "},{"num":23,"verse":"that all may honour the Son just as they honour the Father. Whoever does not honour the Son does not honour the Father, who sent him."},{"num":24,"verse":"‘Very truly I tell you, whoever hears my word and believes him who sent me has eternal life and will not be judged but has crossed over from death to life. "},{"num":25,"verse":"Very truly I tell you, a time is coming and has now come when the dead will hear the voice of the Son of God and those who hear will live. "},{"num":26,"verse":"For as the Father has life in himself, so he has granted the Son also to have life in himself. "},{"num":27,"verse":"And he has given him authority to judge because he is the Son of Man."},{"num":28,"verse":"‘Do not be amazed at this, for a time is coming when all who are in their graves will hear his voice "},{"num":29,"verse":"and come out – those who have done what is good will rise to live, and those who have done what is evil will rise to be condemned. "},{"num":30,"verse":"By myself I can do nothing; I judge only as I hear, and my judgment is just, for I seek not to please myself but him who sent me."},{"header":"Testimonies about Jesus"},{"num":31,"verse":"‘If I testify about myself, my testimony is not true. "},{"num":32,"verse":"There is another who testifies in my favour, and I know that his testimony about me is true."},{"num":33,"verse":"‘You have sent to John and he has testified to the truth. "},{"num":34,"verse":"Not that I accept human testimony; but I mention it that you may be saved. "},{"num":35,"verse":"John was a lamp that burned and gave light, and you chose for a time to enjoy his light."},{"num":36,"verse":"‘I have testimony weightier than that of John. For the works that the Father has given me to finish – the very works that I am doing – testify that the Father has sent me. "},{"num":37,"verse":"And the Father who sent me has himself testified concerning me. You have never heard his voice nor seen his form, "},{"num":38,"verse":"nor does his word dwell in you, for you do not believe the one he sent. "},{"num":39,"verse":"You study the Scriptures diligently because you think that in them you have eternal life. These are the very Scriptures that testify about me, "},{"num":40,"verse":"yet you refuse to come to me to have life."},{"num":41,"verse":"‘I do not accept glory from human beings, "},{"num":42,"verse":"but I know you. I know that you do not have the love of God in your hearts. "},{"num":43,"verse":"I have come in my Father’s name, and you do not accept me; but if someone else comes in his own name, you will accept him. "},{"num":44,"verse":"How can you believe since you accept glory from one another but do not seek the glory that comes from the only God?"},{"num":45,"verse":"‘But do not think I will accuse you before the Father. Your accuser is Moses, on whom your hopes are set. "},{"num":46,"verse":"If you believed Moses, you would believe me, for he wrote about me. "},{"num":47,"verse":"But since you do not believe what he wrote, how are you going to believe what I say?’"}]