[{"header":"Saul among Prophets"},{"num":10,"verse":"Then Samuel took the flask of oil and poured it on Saul’s head, kissed him, and said, “Has the Lord not anointed you as ruler over His inheritance (Israel)? "},{"num":2,"verse":"When you leave me today, you will meet two men beside Rachel’s tomb in the territory of Benjamin at Zelzah; they will say to you, ‘The donkeys you went to look for have been found. And your father has stopped caring about them and is worried about you, saying, “What shall I do about my son?”’ "},{"num":3,"verse":"Then you will go on further from there, and you will come to the terebinth tree of Tabor, and three men going up to [sacrifice to] God at Bethel will meet you there, one carrying three young goats, another carrying three loaves of bread, and another carrying a jug of wine. "},{"num":4,"verse":"They will greet you and give you two loaves of bread, which you will accept from their hand. "},{"num":5,"verse":"After that you will come to the hill of God where the garrison of the Philistines is; and when you come there to the city, you will meet a group of prophets coming down from the high place [of worship] with harp, tambourine, flute, and lyre before them, and they will be prophesying. "},{"num":6,"verse":"Then the Spirit of the Lord will come upon you mightily, and you will prophesy with them, and you will be changed into another man. "},{"num":7,"verse":"When these signs come to you, do for yourself whatever the situation requires, for God is with you. "},{"num":8,"verse":"You shall go down ahead of me to Gilgal; and behold, I will be coming down to you to offer burnt offerings and to sacrifice peace offerings. You shall wait seven days until I come to you and show you what you must do.”"},{"num":9,"verse":"Then it happened when Saul turned his back to leave Samuel, God changed his heart; and all those signs came to pass that day. "},{"num":10,"verse":"When they came to the hill [Gibeah], behold, a group of prophets met him; and the Spirit of God came on him mightily, and he prophesied [under divine guidance] among them. "},{"num":11,"verse":"Now when all who knew Saul previously saw that he actually prophesied now [by inspiration] with the prophets, the people said one to another, “What has happened to [Saul, who is nobody but] the son of Kish? Is Saul also among the prophets?” "},{"num":12,"verse":"And a man from there answered, “But who is the father of the others?” So it became a proverb, “Is Saul also among the prophets?” "},{"num":13,"verse":"When Saul had finished prophesying, he went to the high place [of worship]."},{"num":14,"verse":"Saul’s uncle said to him and to his servant, “Where did you go?” And Saul said, “To look for the donkeys. And when we saw that they were nowhere to be found, we went to Samuel [for help].” "},{"num":15,"verse":"Saul’s uncle said, “Please tell me, what did Samuel say to you?” "},{"num":16,"verse":"And Saul said to his uncle, “He told us plainly that the donkeys had been found.” But he did not tell him about the matter of the kingdom which Samuel had mentioned."},{"header":"Saul Publicly Chosen King"},{"num":17,"verse":"Then Samuel called the people together to the Lord at Mizpah, "},{"num":18,"verse":"and he said to Israel, “Thus says the Lord, the God of Israel, ‘It was I who brought Israel up from Egypt, and I rescued you from the hand of the Egyptians and from all the kingdoms that were oppressing you.’ "},{"num":19,"verse":"But today you have rejected your God, who Himself saves you from all your disasters and distresses; yet you have said, ‘No! Set a king over us.’ Now then, present yourselves before the Lord by your tribes and by your families (clans).”"},{"num":20,"verse":"And when Samuel brought all the tribes of Israel near, the tribe of Benjamin was chosen by lot. "},{"num":21,"verse":"Then he brought the tribe of Benjamin near by their families, and the family of Matri was chosen by lot. And Saul the son of Kish was chosen by lot; but when they looked for him, he could not be found. "},{"num":22,"verse":"So they inquired further of the Lord, “Has the man come here yet?” And the Lord answered, “He is there, hiding himself by the provisions and supplies.” "},{"num":23,"verse":"So they ran and took him from there, and when he stood among the people, he was taller than any of the people from his shoulders upward. "},{"num":24,"verse":"Samuel said to all the people, “Do you see him whom the Lord has chosen? For there is no one like him among all the people.” So all the people shouted and said, “Long live the king!”"},{"num":25,"verse":"Then Samuel told the people the requirements of the kingdom, and wrote them in a book and placed it before the Lord. And Samuel sent all the people away, each one to his home. "},{"num":26,"verse":"Saul also went home to Gibeah; and the brave men whose hearts God had touched went with him. "},{"num":27,"verse":"But some worthless men said, “How can this man save and rescue us?” And they regarded Saul with contempt and did not bring him a gift. But he ignored the insult and kept silent."}]