[{"num":3,"verse":"After these events King Xerxes honored Haman, son of Hammedatha, the Agagite. He promoted him and placed him over all the officials who served with him. "},{"num":2,"verse":"All the servants of the king who were at the king’s gate were bowing down and kneeling in Haman’s presence, because the king had commanded that this be done for him, but Mordecai did not bow down and did not kneel."},{"num":3,"verse":"So the servants of the king who were at the king’s gate said to Mordecai, “Why are you going against the king’s command?” "},{"num":4,"verse":"Even though they spoke to him every day, he did not listen to them. They reported this to Haman, to see whether Mordecai’s actions would be tolerated. Mordecai had informed them that he was a Jew."},{"num":5,"verse":"When Haman saw that Mordecai was not bowing down and kneeling in his presence, Haman was enraged. "},{"num":6,"verse":"Because the king’s servants had made Haman aware of Mordecai’s nationality, Haman was not satisfied with laying hands only on Mordecai. Haman sought to destroy all the Jews, the people of Mordecai, throughout the whole kingdom of Xerxes."},{"num":7,"verse":"During the twelfth year of King Xerxes’ reign, during the first month, the month of Nisan, a pur (which means “a lot”) was cast before Haman for every day and every month of the year, until Adar, the twelfth month, was chosen."},{"num":8,"verse":"Haman said to King Xerxes, “There is a group of people scattered and dispersed among the peoples in all the provinces of your kingdom. Their laws are different from those of all the other people. They do not keep the laws of the king. It is not good for the king to allow them to get away with this. "},{"num":9,"verse":"If the king agrees, a directive should be written to destroy them. I will weigh out ten thousand talents of silver to the treasury of the king for those who carry out this work.”"},{"num":10,"verse":"The king took his signet ring from his hand and gave it to Haman son of Hammedatha, the Agagite, the man opposing the Jews. "},{"num":11,"verse":"The king said to Haman, “The silver will be given to you, as well as the people. Do with them whatever seems good to you.”"},{"num":12,"verse":"In the first month, on the thirteenth day, the king’s scribes were summoned. A decree based on everything Haman commanded was written to the king’s satraps, to the governors over each province, and to the officials of every people. The decree was sent to each province in its own writing system and to each people in its own language. It was written in the name of King Xerxes and sealed with the king’s signet ring."},{"num":13,"verse":"The letters were sent by courier to all the provinces of the king to destroy, kill, and annihilate all the Jews, young and old, including children and women, and to plunder their goods in one day, on the thirteenth day of Adar, the twelfth month. "},{"num":14,"verse":"A copy of the decree was to be proclaimed as a law to all the peoples in every province, so that they could be ready for that day."},{"num":15,"verse":"The couriers went out, spurred on by the word of the king. The law was issued in Susa, the citadel. The king and Haman sat down to drink. The city of Susa was perplexed and confused."}]