[{"header":"Haman Plans to Destroy the Jews"},{"num":3,"verse":"After these things happened, King Xerxes honored Haman son of Hammedatha the Agagite. He gave Haman a new rank that was higher than all the important men. "},{"num":2,"verse":"And all the royal officers at the king’s gate would bow down and kneel before Haman. This was what the king had ordered. But Mordecai would not bow down, and he did not kneel."},{"num":3,"verse":"Then the royal officers at the king’s gate asked Mordecai, “Why don’t you obey the king’s command?” "},{"num":4,"verse":"And they said this to him every day. When he did not listen to them, they told Haman about it. They wanted to see if Haman would accept Mordecai’s behavior because Mordecai had told them that he was a Jew."},{"num":5,"verse":"Then Haman saw that Mordecai would not bow down to him or kneel before him. And he became very angry. "},{"num":6,"verse":"He had been told who the people of Mordecai were. And he thought of himself as too important to try to kill only Mordecai. So he looked for a way to destroy all of Mordecai’s people, the Jews, in all of Xerxes’ kingdom."},{"num":7,"verse":"It was in the first month of the twelfth year of King Xerxes’ rule. That is the month of Nisan. Pur (that is, the lot) was thrown before Haman. The lot was used to choose a day and a month. So the twelfth month, the month of Adar, was chosen."},{"num":8,"verse":"Then Haman said to King Xerxes, “There is a certain group of people in all the areas of your kingdom. They are scattered among the other people. They keep themselves separate. Their customs are different from those of all the other people. And they do not obey the king’s laws. It is not right for you to allow them to continue living in your kingdom. "},{"num":9,"verse":"If it pleases the king, let an order be given to destroy those people. Then I will pay 375 tons of silver to those who do the king’s business. They will put it into the royal treasury.”"},{"num":10,"verse":"So the king took his signet ring off and gave it to Haman. Haman son of Hammedatha, the Agagite, was the enemy of the Jews. "},{"num":11,"verse":"Then the king said to Haman, “The money and the people are yours. Do with them as you please.”"},{"num":12,"verse":"On the thirteenth day of the first month, the royal secretaries were called. They wrote out all of Haman’s orders. They wrote to the king’s governors and to the captains of the soldiers in each area. And they wrote to the important men of each group of people. The orders were written to each area in its own form of writing. And they were written to each group of people in their own language. They were written in the name of King Xerxes and sealed with his signet ring. "},{"num":13,"verse":"Letters were sent by messengers to all the king’s empire. They stated the king’s order to destroy, kill and completely wipe out all the Jews. That meant young and old, women and little children, too. The order said to kill all the Jews on a single day. That was to be the thirteenth day of the twelfth month, which was Adar. And it said to take all the things that belonged to the Jews. "},{"num":14,"verse":"A copy of the order was to be given out as a law in every area. It was to be made known to all the people so that they would be ready for that day."},{"num":15,"verse":"The messengers set out, hurried by the king’s command. At the same time the order was given in the palace at Susa. And the king and Haman sat down to drink. But the city of Susa was in confusion."}]