[{"num":32,"verse":"Hear, O ye heavens, the things I speak, let the earth give ear to the words of my mouth."},{"num":2,"verse":"Let my doctrine gather as the rain, let my speech distil as the dew, as a shower upon the herb, and as drops upon the grass."},{"num":3,"verse":"Because I will invoke the name of the Lord: give ye magnificence to our God."},{"num":4,"verse":"The works of God are perfect, and all his ways are judgments: God is faithful and without any iniquity, he is just and right."},{"num":5,"verse":"They have sinned against him, and are nose of his children in their filth: they are a wicked and perverse generation."},{"num":6,"verse":"Is this the return thou makest to the Lord, O foolish and senseless people? Is not he thy father, that hath possessed thee, and made thee, and created thee?"},{"num":7,"verse":"Remember the days of old, think upon every generation: ask thy father, and he will declare to thee: thy elders and they will tell thee."},{"num":8,"verse":"When the Most High divided the nations: when he separated the sons of Adam, he appointed the bounds of people according to the number of the children of Israel."},{"num":9,"verse":"But the Lord's portion is his people: Jacob the lot of his inheritance."},{"num":10,"verse":"He found him in a desert land, in a place of horror, and of vast wilderness: he led him about, and taught him: and he kept him as the apple of his eye."},{"num":11,"verse":"As the eagle enticing her young to fly, and hovering over them, he spread his wings, and hath taken him and carried him on his shoulders."},{"num":12,"verse":"The Lord alone was his leader: and there was no strange god with him."},{"num":13,"verse":"He set him upon high land: that he might eat the fruits of the fields, that he might suck honey out of the rock, and oil out of the hardest stone,"},{"num":14,"verse":"Butter of the herd, and milk of the sheep with the fat of lambs, and of the rams of the breed of Basan: and goats with the marrow of wheat, and might drink the purest blood of the grape."},{"num":15,"verse":"The beloved grew fat, and kicked: he grew fat, and thick and gross, he forsook God who made him, and departed from God his saviour."},{"num":16,"verse":"They provoked him by strange gods, and stirred him up to anger, with their abominations."},{"num":17,"verse":"They sacrificed to devils and not to God: to gods whom they knew not: that were newly come up, whom their fathers worshipped not."},{"num":18,"verse":"Thou hast forsaken the God that beget thee, and hast forgotten the Lord that created thee."},{"num":19,"verse":"The Lord saw, and was moved to wrath: because his own sons and daughters provoked him."},{"num":20,"verse":"And he said: I will hide my face from them, and will consider what their last end shall be: for it is a perverse generation, and unfaithful children."},{"num":21,"verse":"They have provoked me with that which was no god, and have angered me with their vanities: and I will provoke them with that which is no people, and will vex them with a foolish nation."},{"num":22,"verse":"A fire is kindled in my wrath, and shall burn even to the lowest hell: and shall devour the earth with her increase, and shall burn the foundations of the mountains."},{"num":23,"verse":"I will heap evils upon them, and will spend my arrows among them."},{"num":24,"verse":"They shall be consumed with famine, and birds shall devour them with a most bitter bite: I will send the teeth of beasts upon them, with the fury of creatures that trail upon the ground, and of serpents."},{"num":25,"verse":"Without, the sword shall lay them waste, and terror within, both the young man and the virgin, the sucking child with the man in years."},{"num":26,"verse":"I said: Where are they? I will make the memory of them to cease from among men."},{"num":27,"verse":"But for the wrath of the enemies I have deferred it: lest perhaps their enemies might be proud, and should say: Our mighty hand, and not the Lord, hath done all these things."},{"num":28,"verse":"They are a nation without counsel, and without wisdom."},{"num":29,"verse":"O that they would be wise and would understand, and would provide for their last end."},{"num":30,"verse":"How should one pursue after a thousand, and two chase ten thousand? Was it not, because their God had sold them, and the Lord had shut them up?"},{"num":31,"verse":"For our God is not as their gods: our enemies themselves are judges."},{"num":32,"verse":"Their vines are of the vineyard of Sodom, and of the suburbs of Gomorrha: their grapes are grapes of gall, and their clusters most bitter."},{"num":33,"verse":"Their wine is the gall of dragons, and the venom of asps, which is incurable."},{"num":34,"verse":"Are not these things stored up with me, and sealed up in my treasures?"},{"num":35,"verse":"Revenge is mine, and I will repay them in due time, that their foot may slide: the day of destruction is at hand, and the time makes haste to come."},{"num":36,"verse":"The Lord will judge his people, and will have mercy on his servants: he shall see that their hand is weakened, and that they who were shut up have also failed, and they that remained are consumed."},{"num":37,"verse":"And he shall say: Where are their gods, in whom they trusted?"},{"num":38,"verse":"Of whose victims they ate the fat, and drank the wine of their drink offerings: let them arise and help you, and protect you in your distress."},{"num":39,"verse":"See ye that I alone am, and there is no other God besides me: I will kill and I will make to live: I will strike, and I will heal, and there is none that can deliver out of my hand."},{"num":40,"verse":"I will lift up my hand to heaven, and I will say: I live for ever."},{"num":41,"verse":"If I shall whet my sword as the lightning, and my hand take hold on judgment: I will render vengeance to my enemies, and repay them that hate me."},{"num":42,"verse":"I will make my arrows drunk with blood, and my sword shall devour flesh, of the blood of the slain and of the captivity, of the bare head of the enemies."},{"num":43,"verse":"Praise his people, ye nations, for he will revenge the blood of his servants: and will render vengeance to their enemies, and he will be merciful to the land of his people."},{"num":44,"verse":"So Moses came and spoke all the words of this canticle in the ears of the people, and Josue the son of Nun."},{"num":45,"verse":"And he ended all these words, speaking to all Israel."},{"num":46,"verse":"And he said to them: Set your hearts on all the words, which I testify to you this day: which you shall command your children to observe and to do, and to fulfill all that is written in this law:"},{"num":47,"verse":"For they are not commanded you in vain, but that every one should live in them, and that doing them you may continue a long time in the land whither you are going over the Jordan to possess it."},{"num":48,"verse":"And the Lord spoke to Moses the same day, saying:"},{"num":49,"verse":"Go up into this mountain Abarim, (that is to say, of passages,) unto mount Nebo, which is in the land of Moab over against Jericho: and see the land of Chanaan, which I will deliver to the children of Israel to possess, and die thou in the mountain."},{"num":50,"verse":"When thou art gone up into it thou shalt be gathered to thy people, as Aaron thy brother died in mount Her, and was gathered to his people:"},{"num":51,"verse":"Because you trespassed against me in the midst of the children of Israel, at the waters of contradiction in Cades of the desert of Sin: and you did not sanctify me among the children of Israel."},{"num":52,"verse":"Thou shalt see the land before thee, which I will give to the children of Israel, but thou shalt not enter into it."}]