[{"header":"The Song of Moses"},{"num":32,"verse":"“Listen, O heavens, and let me speak. Let the earth hear the words of my mouth. "},{"num":2,"verse":"Let my teaching fall as the rain, and my voice like the water on the grass in the early morning, like rain upon the new grass, and rain upon the plant. "},{"num":3,"verse":"For I will make known the name of the Lord. I will tell of the greatness of God! "},{"num":4,"verse":"The Rock! His work is perfect. All His ways are right and fair. A God Who is faithful and without sin, right and good is He. "},{"num":5,"verse":"They have acted in sin toward Him, but they are not His children, because the mark of sin is on them. They are a bad and sinful people. "},{"num":6,"verse":"Is this how you pay the Lord, you foolish people who are not wise? Is He not your Father Who has bought you? He has made you and given you your place. "},{"num":7,"verse":"Remember the days long ago. Think of the years of all people. Ask your father and he will show you. Ask your leaders. They will tell you. "},{"num":8,"verse":"When the Most High divided up the world among the nations, he divided the children of men. He set the place where each nation was to live by the number of the sons of Israel. "},{"num":9,"verse":"For the Lord’s share is His people. He chose the people of Jacob for Himself. "},{"num":10,"verse":"He found him in a desert land, in the empty waste of a desert. He came around him and cared for him. He kept him as He would His own eye. "},{"num":11,"verse":"Like an eagle that shakes its nest, that flies over its young, He spread His wings and caught them. He carried them on His wings. "},{"num":12,"verse":"The Lord alone led him. There was no strange god with him. "},{"num":13,"verse":"He made him sit on the high places of the earth. And he ate the food of the field. He made him eat honey from the rock, oil out of hard rock, "},{"num":14,"verse":"milk from cows and milk from the flock, the fat of lambs, rams of Bashan, goats, and the best of the grain. And you drank wine of the blood of grapes."},{"num":15,"verse":"“But Jeshurun grew fat and would not obey. You became fat and full of food. Then he turned away from God Who made him. He hated the Rock of His saving power. "},{"num":16,"verse":"They made Him jealous with strange gods. They made Him angry with hated things. "},{"num":17,"verse":"They gave gifts to demons who were not God, to gods they have not known, new gods who came later, whom your fathers did not fear. "},{"num":18,"verse":"You did not think of the Rock Who gave you birth. You forgot the God Who gave you birth."},{"num":19,"verse":"“The Lord saw this, and hated them. His sons and daughters made Him angry. "},{"num":20,"verse":"Then He said, ‘I will hide My face from them. I will see what their end will be. For they are a sinful people, children who are not faithful. "},{"num":21,"verse":"They have made Me jealous with what is not God. They have made Me angry with their false gods. So I will make them jealous with those who are not a people. I will make them angry with a foolish nation. "},{"num":22,"verse":"For a fire is started by My anger. It burns to the very bottom of the place of the dead. It burns up the earth and all that grows on the earth. It burns the base of the mountains."},{"num":23,"verse":"‘I will send much trouble upon them. I will use My arrows against them. "},{"num":24,"verse":"They will be wasted with hunger. They will be destroyed by burning heat and disease. I will send the teeth of wild animals against them, with the poison of things moving in the dust. "},{"num":25,"verse":"The sword will bring death in the street, and bring fear in the homes. It will destroy both young man and young woman, the baby and the man with white hair. "},{"num":26,"verse":"I would have said, “I will cut them to pieces. I will make all people forget about them.” "},{"num":27,"verse":"But I was afraid that those who hate them would fight in anger against them and would not understand. They would say, “We have won with our own strength. The Lord has not done this.”’"},{"num":28,"verse":"“For they are a nation without wise teaching. There is no understanding in them. "},{"num":29,"verse":"If they were wise, they would understand this. They would know their future! "},{"num":30,"verse":"How could one run after a thousand? How could two make ten thousand run away, unless their Rock had sold them, and the Lord had given them up? "},{"num":31,"verse":"For their rock is not like our Rock. Even those who hate us judge this. "},{"num":32,"verse":"Their vine is from the vine of Sodom, and from the fields of Gomorrah. Their grapes are grapes of poison. Their fruit tastes bitter. "},{"num":33,"verse":"Their wine is the poison of snakes that kill."},{"num":34,"verse":"‘Are they not kept in store with Me, shut in with My stores of riches? "},{"num":35,"verse":"It is Mine to punish when their foot makes a false step. The day of their trouble is near. Their fall is coming fast upon them.’ "},{"num":36,"verse":"For the Lord will judge His people. He will have loving-pity on His servants when He sees their strength is gone, and none are left of those who are free or of those who are not free. "},{"num":37,"verse":"Then He will say, ‘Where are their gods? Where is the rock where they went to be safe? "},{"num":38,"verse":"Who ate the fat of their burnt gifts and drank the wine of their drink gifts? Let them come and help you. Let them be your hiding place! "},{"num":39,"verse":"See now that it is I. I am He. There is no god except Me. It is I Who kills and gives life. I hurt, and I heal. And there is no one who can take from My hand. "},{"num":40,"verse":"For I lift up My hand to heaven, and promise that, as I live forever, "},{"num":41,"verse":"I will make My shining sword sharp. My hand takes hold of what is right and fair. I will punish those who are against Me. And I will punish those who hate Me. "},{"num":42,"verse":"I will make My arrows drunk with blood. My sword will eat flesh with the blood of those who are killed and those who are in prison, from the long-haired leaders of those who hate Me.’ "},{"num":43,"verse":"Be glad, O nations, with His people! For He will punish because of the blood of His servants. He will punish those who fight against Him. And He will take away the sin of His land and His people.”"},{"num":44,"verse":"Moses came with Joshua the son of Nun and spoke all the words of this song in the ears of the people. "},{"num":45,"verse":"When Moses had finished speaking all these words to all Israel, "},{"num":46,"verse":"he said to them, “Take into your heart all the words I tell you today. Tell them to your children, so they may be careful to do all the words of this Law. "},{"num":47,"verse":"This word is of great worth to you. It is your very life. By this word you will live long in the land you are crossing the Jordan to take.”"},{"header":"Moses to Die on Mount Nebo"},{"num":48,"verse":"The Lord said to Moses that same day, "},{"num":49,"verse":"“Go up to this mountain of the Abarim, Mount Nebo, in the land of Moab beside Jericho. Look at the land of Canaan, which I am giving to the people of Israel for their own. "},{"num":50,"verse":"Then die on the mountain you go up, and join your people, as Aaron your brother died on Mount Hor and joined his people. "},{"num":51,"verse":"This is because you were not faithful to Me among the people of Israel at the waters of Meribah-Kadesh, in the Desert of Zin and you did not honor Me as holy among the people of Israel. "},{"num":52,"verse":"You will see the land from far away, but you will not go into the land I am giving the people of Israel.”"}]