[{"num":53,"verse":"Who believed to our hearing? (Who hath believed our report?) and to whom is the arm of the Lord showed?"},{"num":2,"verse":"And he shall go up as a rod before him, and as a root from [the] thirsty land. And neither shape neither fairness was to him; and we saw him, and no beholding was; and we desired him, (And he shall grow up like a rod before the Lord, and like a root from the thirsty land. And neither shape nor beauty was to him; and when we saw him, there was no comeliness to him, so that we would desire him;)"},{"num":3,"verse":"despised, and the last of men, a man of sorrows, and knowing sickness. And his cheer was as hid (from us,) and despised; wherefore and we areckoned not him. (he was despised, and the last of men, a man of sorrows, and knowing of suffering. And we hid our faces from him, for we despised him, and regarded him as if he was nothing, or of no account.)"},{"num":4,"verse":"Verily he suffered our sicknesses, and he bare our sorrows; and we areckoned him as a mesel, and smitten of God, and made low. (Truly he suffered our sicknesses, and he carried our sorrows; but we reckoned him like a leper, and struck by God, and abased, or made low.)"},{"num":5,"verse":"Forsooth he was wounded for our wickednesses, he was defouled for our great trespasses; the learning of our peace was on him, and we be made whole by his wanness. (And he was wounded for our wickednesses, he was defiled for our great trespasses; he suffered what should have been our chastising, or our punishment, and we be healed, or made whole, by his scourgings.)"},{"num":6,"verse":"All we erred as sheep, each man bowed into his own way, and the Lord putted in him the wickedness of us all. (We have all wandered astray like sheep, each one turned to his own way, but the Lord put on him all of our wickednesses.)"},{"num":7,"verse":"He was offered, for he would, and he opened not his mouth; as a sheep he shall be led to slaying, and he shall be dumb as a lamb before him that clippeth it, and he shall not open his mouth. (He was offered up, and he bare it, and he did not open his mouth; like a sheep he was led to his killing, and he was as silent as a lamb before him who clippeth it, yea, he did open his mouth.)"},{"num":8,"verse":"He is taken away from anguish and from doom; who shall tell out the generation of him? For he was cut down from the land of livers. I smote him for the great trespass of my people. (He was brought to trial and to judgement; and who shall tell out his future? And then he was cut down from the land of the living. I struck him down for the great trespass of my people.)"},{"num":9,"verse":"And he shall give unfaithful men for burying, and rich men for his death; for he did not wickedness, neither guile was in his mouth; (And in his death he was buried with the unfaithful, and with the rich, though he did not do any wickedness, nor any deceit, or lies, came out of his mouth;)"},{"num":10,"verse":"and the Lord would defoul him in sickness. If he putteth his life for sin, he shall see (his) seed long enduring, and the will of the Lord shall be (ad)dressed in his hand. (yet the Lord defiled him with suffering. He made his life an offering for sin; and so he shall see his children, or his descendants, and he shall long endure, or he shall live a long life, and in his hand the purpose of the Lord shall prosper.)"},{"num":11,"verse":"For that that his soul travailed, he shall see, and shall be filled [For-thy that he travailed, his soul shall see, and be fulfilled]. (So) That my just servant shall justify many men in his knowing, and he shall bear the wickednesses of them. (Because of what he suffered/Because he suffered, he shall see, and shall be fulfilled. Yea, my righteous servant shall justify many people by his suffering, and he shall carry their wickednesses.)"},{"num":12,"verse":"Therefore I shall yield, either deal, to him full many men, and he shall part the spoils of the strong fiends; for that that he gave his life into death, and was areckoned with felonious men; and he did away the sin of many men, and he prayed for trespassers. (And so I shall give to him a portion with the great, and he shall part the spoils with the strong; for he gave his life unto death, and was reckoned with criminals; and he did away the sin of many, and he prayed for trespassers.)"}]