[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "33:10-20 Those who despaired of finding mercy with God, are answered with a solemn declaration of God's readiness to show mercy. The ruin of the city and state was determined, but that did not relate to the final state of persons. God says to the righteous, that he shall surely live. But many who have made profession, have been ruined by proud confidence in themselves. Man trusts to his own righteousness, and presuming on his own sufficiency, he is brought to commit iniquity. If those who have lived a wicked life repent and forsake their wicked ways, they shall be saved. Many such amazing and blessed changes have been wrought by the power of Divine grace. When there is a settled separation between a man and sin, there shall no longer be a separation between him and God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Again - And. For ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:1-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " notes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. not fall … in the day that he turneth—(2Ch 7:14; see Eze 3:20; 18:24).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As for the wickedness of the wicked, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c.: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 3:20 18:20-22,24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 18:20-22,24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same things are explained. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore, thou son of man, say unto the children of thy people,.... See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The purport of what the prophet is bid to say in this and some following verses is, that the righteousness of a man that trusts in it, he sinning and not repenting, shall not save him; and that the wickedness of a repenting sinner shall not damn him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the righteousness of the righteous shall not deliver him in the day of his transgression; this must be understood, not of a truly righteous man, or of the righteousness of Christ, by which such an one is made so; for that righteousness does deliver those to whom it is imputed, from sin and the condemnation of it, even in the day of his transgression, which is every day of his life; for there is not a just man that does good, and sinneth not; and in the day when his sin is shown him, and he is convinced of it, this removes the guilt of it; and in the day it will be sought for, or he may be charged with it, and when the sins of others will be brought to an account, the righteousness by which he is justified will deliver him from avenging justice; from the curse of the law; from the wrath of God; from eternal death, and everlasting damnation; but this is to be interpreted of one that is not truly righteous, and of a man's own righteousness; and which he trusts to, as is afterwards expressed; and may and does turn from: this can never deliver a man in the day of his transgression from the guilt and condemnation of it; for a man's own righteousness is but what he ought to do; and, was it ever so perfect, yet, should he commit one single sin, it would not justify him from it, or deliver him from the curse of the law and wrath of God due unto it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as for the wickedness of the wicked, he shall not fall thereby in the day that he turneth from his wickedness; when he is truly convinced of his sin, and the evil of it; is heartily sorry for it, after a godly sort; ingenuously confesses it, and departs from it; applies to Christ, to his blood and righteousness, for pardon and acceptance; though his wickedness has been ever so great, or attended with ever such aggravating circumstances, yet it shall not damn him; or he shall not fall by it into hell and everlasting perdition; but shall be saved in the Lord with an everlasting salvation: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither shall the righteous be able to live for his righteousness in the day that he sinneth; he cannot live by it, nor for it; as it cannot justify him, it cannot save him, or bring him to heaven, or entitle him to eternal life; he is not able to live comfortably now; when his sin is charged upon him, his righteousness will not relieve him; and much less will he be able to live happily hereafter; he must and will die in his sins, being found in them, for anything his own righteousness can do for him: this is the same with the former clause, and is repeated in different words for the confirmation of it; self-righteous persons not being easily convinced of the truth of these things. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither shall the righteous be able to live for his righteousness in the day that he sinneth; he cannot live by it, nor for it; as it cannot justify him, it cannot save him, or bring him to heaven, or entitle him to eternal life; he is not able to live comfortably now; when his sin is charged upon him, his righteousness will not relieve him; and much less will he be able to live happily hereafter; he must and will die in his sins, being found in them, for anything his own righteousness can do for him: this is the same with the former clause, and is repeated in different words for the confirmation of it; self-righteous persons not being easily convinced of the truth of these things. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore, thou son of man, say to the children of thy people, The {g} righteousness of the righteous shall not deliver him in the day of his transgression: as for the wickedness of the wicked, he shall not fall by it in the day that he turneth from his wickedness; neither shall the righteous be able to live for his righteousness in the day that he sinneth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Therefore, thou son of man, say to the children of thy people, The ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " righteousness of the righteous shall not deliver him in the day of his transgression: as for the wickedness of the wicked, he shall not fall by it in the day that he turneth from his wickedness; neither shall the righteous be able to live for his ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "righteousness",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in the day that he sinneth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Read of this righteousness, Eze 18:21,24.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It would have been enough to illustrate the earnest exhortation, Turn ye, why will ye die? (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 33:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 33:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") by the assurance that if the wicked turns his past sins will not be remembered against him (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 33:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 33:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). But the prophet states the truth in a more general form. His purpose is to teach also the general truth that the past of one’s life does not of necessity determine the future either in itself or in the judgment of God. This, next to the assurance of God’s gracious will regarding men (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 33:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 33:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), was the truth most needed to comfort the people and awaken them out of the stupor which lay on them into a moral life and activity again.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is merely to distort the prophet’s words to say that he teaches that a man’s past life goes for nothing, and that he will be judged merely according to what he is found doing “at the moment” of the judgment. The prophet is not speaking of moments. He speaks to men overwhelmed by a judgment of God which seemed to leave no hope for the future, and he lays down the principle needful for the moral awakening of the people that the past is not irrevocable, that a future of possibility lies before them. It is too true that the evil of a man’s past life prolongs itself into the future and that sin cannot at once be done with. Yet we “believe in the forgiveness of sins;” and this is the truth which the prophet desires to teach his countrymen, over whelmed with the thought of their own evil past. When he says the righteous shall “live” he means by living the complex thing, having the favour of God and having an external felicity corresponding to this.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Old Testament prophets and saints were hardly able to conceive the first of these two things existing apart from the second. And the prophet probably still considers them inseparably connected. And hence, when teaching that the son shall not suffer for the sins of the father, and that the righteous shall “live” and the wicked “die,” he has been charged with inculcating a doctrine more false to reality than the old one which it was designed to supersede. But here again a certain injustice is done to the prophet. No doubt when he uses the word “live” he employs it in the pregnant sense, viz. to enjoy the favour of God and to have this favour reflected in outward felicity. But just as Jeremiah relegates the principle that the children shall not suffer for the sins of the father to the new era about to dawn, so Ezek. agrees with him. Neither prophet is laying down a new principle which is to obtain in the world, the world going on as it had done before. Ezek. feels himself, as all the prophets do, on the threshold of a new Epoch, the era of the perfect kingdom of God, and it is in this new era that the principle which he enunciates shall prevail. See at the end of ch. 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ezekiel 33:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As watchman over Israel, Ezekiel is to announce to those who are despairing of the mercy of God, that the Lord will preserve from destruction those who turn from their sin, and lead them into life. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thou then, son of man, say to the house of Israel, Ye rightly say, Our transgressions and our sins lie upon us, and in them we vanish away; how, then, can we live? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Say to them, As   truly as I live, is the saying of the Lord Jehovah, I have no pleasure in the death of the sinner; but when the sinner turneth from his way, he shall live. Turn ye, turn ye from your evil ways! for why will ye die, O house of Israel? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And thou, son of man, say to the sons of thy people, The righteousness of the righteous man will not deliver him in the day of his transgression, and the sinner will not fall through his sin in the day that he turneth from his sin, and the righteous man will not be able to live thereby in the day that he sinneth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If I say to the righteous man that he shall live, and he relies upon his righteousness and does wrong, all his righteousnesses will not be remembered; and for his wrong that he has done, he will die. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If I say to the sinner, Thou shalt die, and he turns from his sin, and does justice and righteousness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So that the wicked returns the pledge, restores what has been robbed, walks in the statutes of life without doing wrong, he will live, not die. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All his sins which he has committed shall not be remembered against him; he has done justice and righteousness, he will live. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the sons of thy people say, The way of the Lord is not right; but they - their way is not right. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If the righteous man turneth from his righteousness and doeth wrong, he shall die thereby; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But if the wicked man turneth from his wickedness and doeth right and righteousness, he will live thereby. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And yet ye say, The way of the Lord is not right. I will judge you every one according to his ways, O house of Israel. - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the prophet's calling for the future is set before him, inasmuch as God instructs him to announce to those who are in despair on account of their sins the gracious will of the Lord. The threat contained in the law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ימּקּוּ בּעונם, of which Ezekiel had repeatedly reminded the people with warning, and, last of all, when predicting the conquest and destruction of Jerusalem by the Chaldeans (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 24:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), had pressed heavily upon their heart, when the threatened judgment took place, so that they quote the words, not \"in self-defence,\" as Hvernick erroneously supposes, but in despair of any deliverance. Ezekiel is to meet this despair of little faith by the announcement that the Lord has no pleasure in the death of the sinner, but desires his conversion and his life. Ezekiel had already set this word of grave before the people in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", accompanied with the summons to salvation for them to lay to heart: there, it was done to overthrow the delusion that the present generation had to atone for the sins of the fathers; but here, to lift up the hearts of those who were despairing of salvation; and for this reason it is accompanied with the asseveration (wanting in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"as truly as I live, saith the Lord,\" and with the urgent appeal to repent and turn. But in order to preclude the abuse of this word of consolation by making it a ground of false confidence in their own righteousness, Ezekiel repeats in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:12-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the principal thoughts contained in that announcement (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:20-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - namely, first of all, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:12-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the thought that the righteousness of the righteous is of no avail to him if he gives himself up to the unrighteousness, and that the sinner will not perish on account of his sin if he turns from his wickedness and strives after righteousness (יכּשׁל , ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and for ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", more especially ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and then, secondly, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:17-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the reproof of those who find fault with the way of the Lord (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:29-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]