[{"num":4,"verse":"After the whole nation had finished crossing the Yarden, Adonai said to Y’hoshua, "},{"num":2,"verse":"“Take for yourselves from the people twelve men, a man from every tribe; "},{"num":3,"verse":"and give them this order: ‘Take twelve stones from the middle of the Yarden riverbed, where the cohanim are standing, carry them over with you and set them down in the place where you will camp tonight.’” "},{"num":4,"verse":"Y’hoshua called the twelve men whom he had chosen from the people of Isra’el, a man from every tribe, "},{"num":5,"verse":"and said to them, “Go on ahead of the ark of Adonai your God into the riverbed of the Yarden. Then, each of you take a stone on his shoulder, corresponding to the number of tribes of the people of Isra’el. "},{"num":6,"verse":"This will be a sign for you. In the future, when your children ask, ‘What do you mean by these stones?’ "},{"num":7,"verse":"you will answer them, ‘It’s because the water in the Yarden was cut off before the ark for the covenant of Adonai; when it crossed the Yarden, the water in the Yarden was cut off; and these stones are to be a reminder for the people of Isra’el forever.’”"},{"num":8,"verse":"The people of Isra’el did just as Y’hoshua had ordered. They took twelve stones out of the Yarden riverbed, as Adonai had said to Y’hoshua, corresponding to the number of the tribes of the people of Isra’el, carried them over with them to the place where they were camping, and set them down there. "},{"num":9,"verse":"Y’hoshua also set up twelve stones in the Yarden River itself, in the place where the feet of the cohanim carrying the ark for the covenant had stood. They are there to this day. "},{"num":10,"verse":"The cohanim carrying the ark stood in the Yarden riverbed until Y’hoshua had finished saying to the people everything that Adonai had ordered him to say, in keeping with everything that Moshe had ordered Y’hoshua; then the people hurried across. "},{"num":11,"verse":"When all the people had finished crossing, the ark of Adonai passed on, and the cohanim, ahead of the people. "},{"num":12,"verse":"The descendants of Re’uven, the descendants of Gad and the half-tribe of M’nasheh went on, armed, ahead of the people of Isra’el, as Moshe had said to them; "},{"num":13,"verse":"some 40,000 armed soldiers ready for battle crossed in the presence of Adonai to the plains of Yericho."},{"num":14,"verse":"That day Adonai made Y’hoshua great in full view of all Isra’el. They were in awe of him, just as they had been in awe of Moshe all his life."},{"num":15,"verse":"Adonai said to Y’hoshua, "},{"num":16,"verse":"“Order the cohanim carrying the ark for the testimony to come up out of the Yarden.” "},{"num":17,"verse":"So Y’hoshua ordered the cohanim, “Come up out of the Yarden!” "},{"num":18,"verse":"The cohanim carrying the ark for the covenant of Adonai came up from the Yarden riverbed, and as soon as the soles of the feet of the cohanim touched dry ground, the water of the Yarden returned to its place and the river overflowed its banks as it had before."},{"num":19,"verse":"The people came up out of the Yarden on the tenth day of the first month and camped at Gilgal, by the eastern boundary of Yericho. "},{"num":20,"verse":"Those twelve stones which they took out of the Yarden, Y’hoshua piled up at Gilgal. "},{"num":21,"verse":"Then he said to the people of Isra’el, “In the future, when your children ask their fathers what these stones mean, "},{"num":22,"verse":"you are to explain it to them by saying, ‘Isra’el came over this Yarden on dry land. "},{"num":23,"verse":"For Adonai your God dried up the water in the Yarden from in front of you, until you had crossed, just as Adonai your God did to the Sea of Suf, which he dried up from in front of us, until we had crossed. "},{"num":24,"verse":"From this all the peoples of the earth can know that the hand of Adonai is strong, and you can fear Adonai your God forever.’”"}]