[{"header":"The Memorial Stones"},{"num":4,"verse":"After the entire nation had finished crossing the Jordan, the Lord spoke to Joshua: "},{"num":2,"verse":"“Choose 12 men from the people, one man for each tribe, "},{"num":3,"verse":"and command them: Take 12 stones from this place in the middle of the Jordan where the priests are standing, carry them with you, and set them down at the place where you spend the night.”"},{"num":4,"verse":"So Joshua summoned the 12 men he had selected from the Israelites, one man for each tribe, "},{"num":5,"verse":"and said to them, “Go across to the ark of the Lord your God in the middle of the Jordan. Each of you lift a stone onto his shoulder, one for each of the Israelite tribes, "},{"num":6,"verse":"so that this will be a sign among you. In the future, when your children ask you, ‘What do these stones mean to you?’ "},{"num":7,"verse":"you should tell them, ‘The waters of the Jordan were cut off in front of the ark of the Lord’s covenant. When it crossed the Jordan, the Jordan’s waters were cut off.’ Therefore these stones will always be a memorial for the Israelites.”"},{"num":8,"verse":"The Israelites did just as Joshua had commanded them. The 12 men took stones from the middle of the Jordan, one for each of the Israelite tribes, just as the Lord had told Joshua. They carried them to the camp and set them down there. "},{"num":9,"verse":"Joshua also set up 12 stones in the middle of the Jordan where the priests who carried the ark of the covenant were standing. The stones are there to this day."},{"num":10,"verse":"The priests carrying the ark continued standing in the middle of the Jordan until everything was completed that the Lord had commanded Joshua to tell the people, in keeping with all that Moses had commanded Joshua. The people hurried across, "},{"num":11,"verse":"and after everyone had finished crossing, the priests with the ark of the Lord crossed in the sight of the people. "},{"num":12,"verse":"The Reubenites, Gadites, and half the tribe of Manasseh went in battle formation in front of the Israelites, as Moses had instructed them. "},{"num":13,"verse":"About 40,000 equipped for war crossed to the plains of Jericho in the Lord’s presence."},{"num":14,"verse":"On that day the Lord exalted Joshua in the sight of all Israel, and they revered him throughout his life, as they had revered Moses. "},{"num":15,"verse":"The Lord told Joshua, "},{"num":16,"verse":"“Command the priests who carry the ark of the testimony to come up from the Jordan.”"},{"num":17,"verse":"So Joshua commanded the priests, “Come up from the Jordan.” "},{"num":18,"verse":"When the priests carrying the ark of the Lord’s covenant came up from the middle of the Jordan, and their feet stepped out on solid ground, the waters of the Jordan resumed their course, flowing over all the banks as before."},{"num":19,"verse":"The people came up from the Jordan on the tenth day of the first month, and camped at Gilgal on the eastern limits of Jericho. "},{"num":20,"verse":"Then Joshua set up in Gilgal the 12 stones they had taken from the Jordan, "},{"num":21,"verse":"and he said to the Israelites, “In the future, when your children ask their fathers, ‘What is the meaning of these stones?’ "},{"num":22,"verse":"you should tell your children, ‘Israel crossed the Jordan on dry ground.’ "},{"num":23,"verse":"For the Lord your God dried up the waters of the Jordan before you until you had crossed over, just as the Lord your God did to the Red Sea, which He dried up before us until we had crossed over. "},{"num":24,"verse":"This is so that all the people of the earth may know that the Lord’s hand is mighty, and so that you may always fear the Lord your God.”"}]