[{"header":"A Reminder of the Crossing"},{"num":4,"verse":"The whole nation finished crossing the Jordan River. Yahweh had told Joshua, "},{"num":2,"verse":"“Choose one man from each of the 12 tribes. "},{"num":3,"verse":"Order them to pick up 12 stones from the middle of the Jordan, where the priests’ feet stood firmly. Take the stones along with you, and set them down where you will camp tonight.”"},{"num":4,"verse":"Joshua called the 12 men whom he had selected (one from each tribe). "},{"num":5,"verse":"He said to them, “Go to the middle of the Jordan River in front of the ark of Yahweh your Elohim. Each man must take a stone on his shoulder, one for each tribe of Israel. "},{"num":6,"verse":"This will be a sign for you. In the future your children will ask, ‘What do these stones mean to you?’ "},{"num":7,"verse":"You should answer, ‘The water of the Jordan River was cut off in front of the ark of Yahweh’s promise. When the ark crossed the Jordan, the river stopped flowing. These stones are a permanent reminder for the people of Israel.’”"},{"num":8,"verse":"The people of Israel did as Joshua had ordered. They took 12 stones, one for each of the tribes of Israel. They took them from the middle of the Jordan as Yahweh had told Joshua. They carried them to the camp and set them down there."},{"num":9,"verse":"Joshua also set 12 stones in the middle of the Jordan River, where the priests who carried the ark of the promise had stood. The stones are still there today."},{"num":10,"verse":"The priests who carried the ark remained standing in the middle of the Jordan. They stood there until everything Yahweh had ordered Joshua to tell the people had been carried out. This was as Moses had told Joshua. The people hurried to the other side. "},{"num":11,"verse":"As soon as everyone had crossed, the priests with Yahweh’s ark crossed and went ahead of them."},{"num":12,"verse":"The men of Reuben, Gad, and half of the tribe of Manasseh did as Moses had told them. They marched across in battle formation ahead of the people of Israel. "},{"num":13,"verse":"About 40,000 armed men crossed the river in front of Yahweh to the plains of Jericho for battle."},{"num":14,"verse":"On that day Yahweh honored Joshua in the presence of all the Israelites. As long as Joshua lived, the Israelites respected him in the same way they had respected Moses."},{"num":15,"verse":"Yahweh said to Joshua, "},{"num":16,"verse":"“Order the priests who carry the ark of the testimony to come out of the Jordan River.”"},{"num":17,"verse":"So Joshua ordered the priests, “Come out of the Jordan.”"},{"num":18,"verse":"The priests who carried the ark of Yahweh’s promise came out of the middle of the Jordan. When their feet stepped onto dry land, the water of the Jordan returned to its seasonal flood level."},{"num":19,"verse":"On the tenth day of the first month, the people came out of the Jordan River. They made their camp at Gilgal, just east of Jericho. "},{"num":20,"verse":"At Gilgal Joshua set up the 12 stones they had taken from the Jordan. "},{"num":21,"verse":"He said to the people of Israel, “In the future when children ask their parents, ‘What do these stones mean?’ "},{"num":22,"verse":"the children should be told that Israel crossed the Jordan River on dry ground. "},{"num":23,"verse":"Yahweh your Elohim dried up the Jordan ahead of you until you had crossed, as he did to the Red Sea until we had crossed. "},{"num":24,"verse":"Yahweh did this so that everyone in the world would know his mighty power and that you would fear Yahweh your Elohim every day of your life.”"}]