[{"header":"Grain Gifts"},{"num":2,"verse":"‘When anyone gives a grain gift to the Lord, it should be of fine flour. He should pour oil on it and put special perfume on it. "},{"num":2,"verse":"Then he will take it to Aaron’s sons, the religious leaders. The religious leader will fill his hand with the fine flour, oil and special perfume and will burn it on the altar as a part to be remembered. It will be a gift by fire, a pleasing smell to the Lord. "},{"num":3,"verse":"The rest of the grain gift will belong to Aaron and his sons. It is a most holy part of the gifts by fire to the Lord."},{"num":4,"verse":"‘When you bring a gift of grain that has been baked, it should be loaves of fine flour without yeast and mixed with oil, or hard bread without yeast and spread with oil. "},{"num":5,"verse":"If your gift of grain has been cooked on top of the stove, it should be of fine flour without yeast and mixed with oil. "},{"num":6,"verse":"Break it into pieces and pour oil on it. It is a grain gift. "},{"num":7,"verse":"If your gift of grain has been cooked in a pot, it should be made of fine flour with oil. "},{"num":8,"verse":"Bring the grain gift that is made of these things to the Lord. It will be given to the religious leader, and he will bring it to the altar. "},{"num":9,"verse":"The religious leader will take the part to be remembered from the grain gift and burn it on the altar. It will be a gift by fire, a pleasing smell to the Lord. "},{"num":10,"verse":"The rest of the grain gift belongs to Aaron and his sons. It is a most holy part of the gifts by fire to the Lord."},{"num":11,"verse":"‘No grain gift that you bring to the Lord will be made with yeast. For you must never burn yeast or honey in any gift by fire to the Lord. "},{"num":12,"verse":"You may bring them to the Lord as a gift of first-fruits, but not for a pleasing smell upon the altar. "},{"num":13,"verse":"You should add salt to all your grain gifts. The salt of the agreement of your God must be in your grain gift. Give salt with all your gifts."},{"num":14,"verse":"‘If you give a grain gift of first-fruits to the Lord, give crushed new grain from new plants, dried by fire. "},{"num":15,"verse":"Put oil and special perfume on it. It is a grain gift. "},{"num":16,"verse":"The religious leader will burn part of its crushed grain and oil with all its special perfume, as its part to be remembered. It is a gift by fire to the Lord."}]