[{"num":16,"verse":"In the thirty-sixth year of Asa’s reign, Ba‘asha king of Isra’el attacked Y’hudah, and he fortified Ramah to prevent anyone’s leaving or entering the territory of Asa king of Y’hudah. "},{"num":2,"verse":"Then Asa removed silver and gold from the treasures of the house of Adonai and the royal palace; and sent this message to Ben-Hadad king of Aram, who lived in Dammesek: "},{"num":3,"verse":"“There is a covenant between me and you, as there was between my father and your father. Here, I am sending you silver and gold; go, and break your covenant with Ba‘asha king of Isra’el, so that he will leave me alone.” "},{"num":4,"verse":"Ben-Hadad did as King Asa had asked — he sent the commanders of his armies against the cities of Isra’el, attacking ‘Iyon, Dan, Avel-Mayim and all the storage-cities of Naftali. "},{"num":5,"verse":"As soon as Ba‘asha heard of it, he stopped building Ramah and abandoned his work. "},{"num":6,"verse":"Asa the king took all Y’hudah and carried off the stones and timber which Ba‘asha had used to fortify Ramah. With them he fortified Geva and Mitzpah."},{"num":7,"verse":"It was around then that Hanani the seer came to Asa king of Y’hudah and said to him, “Because you relied on the king of Aram and didn’t rely on Adonai your God, the king of Aram’s army has escaped from your power. "},{"num":8,"verse":"The army of the Ethiopians and Luvim was huge, wasn’t it? How many chariots and horsemen did they have? Yet because you relied on Adonai, he handed them over to you. "},{"num":9,"verse":"For the eyes of Adonai move here and there throughout the whole earth, to show himself strong on behalf of those who are wholehearted toward him. You acted foolishly in this regard; for from now on, you will have war.” "},{"num":10,"verse":"But Asa became angry at the seer; in fact, because of his rage at him over this matter he threw him in prison. Moreover, at the same time, he mistreated some of the people."},{"num":11,"verse":"The activities of Asa from beginning to end are recorded in the Annals of the Kings of Y’hudah and Isra’el."},{"num":12,"verse":"In the thirty-ninth year of his reign, Asa suffered from a disease in his legs. It was a very serious disease, yet even with this disease he did not seek out Adonai but turned to the physicians. "},{"num":13,"verse":"Asa slept with his ancestors, dying in the forty-first year of his reign. "},{"num":14,"verse":"They buried him in his own burial cave, which he had ordered cut for himself in the City of David. They laid him in a bed filled with sweet spices of various kinds, expertly compounded; and a very great fire was kindled in his honor."}]