[{"header":"Paul before Felix"},{"num":24,"verse":"Five days later, the high priest Ananias came down [from Jerusalem to Caesarea] with some elders and an attorney named Tertullus [acting as spokesman and counsel]. They presented to the governor their [formal] charges against Paul. "},{"num":2,"verse":"After Paul had been summoned, Tertullus began the complaint [against him], saying to the governor:"},{"num":3,"verse":"in every way and in every place, most excellent Felix, we acknowledge this with all gratitude. "},{"num":4,"verse":"But so that I do not weary you further, I beg you to grant us, by your kindness, a brief hearing. "},{"num":5,"verse":"For we have found this man to be a public menace and one who instigates dissension among all the Jews throughout the world, and a ringleader of the [heretical] sect of the Nazarenes. "},{"num":6,"verse":"He even tried to desecrate the temple, but we took him into custody [and we intended to judge him by our Law, "},{"num":7,"verse":"but Lysias the commander came, and with great force took him out of our hands, "},{"num":8,"verse":"and ordered his accusers to come before you.] By interrogating him yourself concerning all these matters you will be able to determine [the truth about] these things with which we charge him.” "},{"num":9,"verse":"The Jews also joined in the attack, declaring and insisting that these things were so."},{"num":10,"verse":"When the governor nodded for him to speak, Paul answered,"},{"num":11,"verse":"As you can easily verify, it has been no more than twelve days since I went up to Jerusalem to worship. "},{"num":12,"verse":"Neither in the temple, nor in the synagogues, nor elsewhere in the city did they find me carrying on a discussion or disputing with anybody or causing a crowd to gather. "},{"num":13,"verse":"Nor can they present evidence to you to prove what they now bring against me. "},{"num":14,"verse":"But I confess this to you, that according to the Way, which they call a [divisive and heretical] sect, I do worship and serve the God of our fathers, [confidently] believing everything that is in accordance with the Law [of Moses] and that is written in the Prophets; "},{"num":15,"verse":"having [the same] hope in God which these men cherish themselves, that there shall certainly be a resurrection of [the dead], both of the righteous and of the wicked. "},{"num":16,"verse":"In view of this, I also do my best and strive always to have a clear conscience before God and before men. "},{"num":17,"verse":"Now after several years I came [to Jerusalem] to bring to my people charitable contributions and offerings. "},{"num":18,"verse":"They found me in the temple presenting these offerings, after I had undergone [the rites of] purification, without any crowd or uproar. But there were some Jews from [the west coast province of] Asia [Minor], "},{"num":19,"verse":"who ought to have been here before you to present their charges, if they have anything against me. "},{"num":20,"verse":"Or else let these men tell what crime they found [me guilty of] when I stood before the Council (Sanhedrin, Jewish High Court), "},{"num":21,"verse":"other than for this one statement which I had shouted out as I stood among them, ‘For the resurrection of the dead I am on trial before you today.’”"},{"num":22,"verse":"But Felix, having a rather accurate understanding about the Way, put them off, saying, “When Lysias the commander comes down, I will decide your case.” "},{"num":23,"verse":"Then he ordered the centurion to keep Paul in custody, but to let him have some freedom, and [he told the centurion] not to stop any of his friends from providing for his needs."},{"num":24,"verse":"Several days later Felix came with his wife Drusilla, who was a Jewess. He sent for Paul and listened to him talk about faith in Christ Jesus. "},{"num":25,"verse":"But as he was discussing righteousness, self-control [honorable behavior, personal integrity], and the judgment to come, Felix became frightened and said, “Go away for now, and when I find [a convenient] time I will send for you.” "},{"num":26,"verse":"At the same time he was also hoping to get money from Paul [as a bribe]; so he continued to send for him quite often and talked with him. "},{"num":27,"verse":"But after two years had passed, Felix was succeeded [in office] by Porcius Festus; and wishing to do the Jews a favor, Felix left Paul imprisoned."}]