[{"header":"Paul Presents His Case to Felix"},{"num":24,"verse":"Five days later, the high priest Ananias arrived with certain elders and Tertullus, an attorney, and they summarized their case against Paul before the governor. "},{"num":2,"verse":"When Paul had been summoned, Tertullus opened the prosecution by saying:"},{"num":3,"verse":"we always and everywhere acknowledge it with profound gratitude. "},{"num":4,"verse":"But so as not to detain you any further, I beg you to hear us briefly with your customary graciousness. "},{"num":5,"verse":"For we have found this man a perfect pest and an agitator among all Jews throughout the world. He is a ringleader in the sect of the Nazarenes "},{"num":6,"verse":"and even tried to profane the Temple, but we arrested him. "},{"num":8,"verse":"By examining him for yourself, you will be able to find out from him everything of which we accuse him.”"},{"num":9,"verse":"The Jewish leaders supported his accusations by asserting that these things were true. "},{"num":10,"verse":"When the governor motioned for Paul to speak, he replied:"},{"num":11,"verse":"You can verify for yourself that I went up to worship in Jerusalem no more than twelve days ago. "},{"num":12,"verse":"They never found me debating with anyone in the Temple or stirring up a crowd in the synagogues or throughout the city, "},{"num":13,"verse":"and they cannot prove to you the charges they are now bringing against me. "},{"num":14,"verse":"However, I admit to you that in accordance with the Way, which they call a heresy, I worship the God of our ancestors and believe in everything written in the Law and the Prophets. "},{"num":15,"verse":"I have the same hope in God that they themselves cherish—that there is to be a resurrection of the righteous and the wicked. "},{"num":16,"verse":"Therefore, I always do my best to have a clear conscience before God and people. "},{"num":17,"verse":"After many years, I have come back to my people to bring gifts for the poor and to offer sacrifices. "},{"num":18,"verse":"They found me in the Temple doing these things just as I had completed the purification ceremony. No crowd or noisy mob was present. "},{"num":19,"verse":"But some Jews from Asia were there, and they should be here before you to accuse me if they have anything against me. "},{"num":20,"verse":"Otherwise, these men themselves should tell what wrong they found when I stood before the Council— "},{"num":21,"verse":"unless it is for the one thing I shouted as I stood among them: ‘It is for the resurrection of the dead that I am on trial before you today.’”"},{"num":22,"verse":"Felix was rather well informed about the Way, and so he adjourned the trial with the comment, “When Tribune Lysias arrives, I’ll decide your case.” "},{"num":23,"verse":"He ordered the centurion to guard Paul but to let him have some freedom and not to keep any of his friends from caring for his needs."},{"num":24,"verse":"Some days later, Felix arrived with his wife Drusilla, who was Jewish. He sent for Paul and listened to him talk about faith in Jesus the Messiah. "},{"num":25,"verse":"As Paul talked about righteousness, self-control, and the coming judgment, Felix became afraid and said, “For the present you may go. When I get a chance, I will send for you again.” "},{"num":26,"verse":"At the same time he was hoping to receive a bribe from Paul, and so he would send for him frequently to talk with him."},{"num":27,"verse":"After two years had passed, Felix was succeeded by Porcius Festus. Since Felix wanted to do the Jews a favor, he left Paul in prison."}]