[{"num":24,"verse":"Now after five days, Ananias the High Priest came down with the elders and Tertullus (a certain orator), who appeared against Paul before the Governor."},{"num":2,"verse":"And when he was called forth, Tertullus began to accuse him, saying, “Seeing that we have obtained great peace through you, and that many worthy things are being done in this nation through your foresight,"},{"num":3,"verse":"“we acknowledge it wholly, and in all places, with all thanks, most noble Felix."},{"num":4,"verse":"“But so as not to detain you, I beg you to hear a few words from us out of your fairness."},{"num":5,"verse":"“We have found this man to be a pest, an inciter of sedition among all the Jews throughout the world, and a ringleader of the sect of the Nazarenes,"},{"num":6,"verse":"“who has tried to pollute the Temple. Therefore, we took him, and would have judged him according to our Law."},{"num":7,"verse":"“But the chief captain, Lysias, came upon us and (with great violence) took him out of our hands,"},{"num":8,"verse":"“commanding his accusers to come to you. By examining him yourself you may learn all these things of which we accuse him.”"},{"num":9,"verse":"And the Jews also agreed, saying that it was so."},{"num":10,"verse":"Then Paul, after the Governor had beckoned to him that he should speak, answered, “Because I know that you have been a judge over this nation for many years, I do the more gladly answer for myself,"},{"num":11,"verse":"“seeing that you may know that it has only been twelve days since I came up to worship in Jerusalem."},{"num":12,"verse":"“And they neither found me in the Temple (disputing with any man or inciting uproar among the people), nor in the synagogues, nor in the city."},{"num":13,"verse":"“Nor can they prove the things of which they now accuse me."},{"num":14,"verse":"“But this I confess to you: that I worship the God of my Fathers as does the Way (which they call heresy), believing all things which are written in the Law and the Prophets."},{"num":15,"verse":"“And I have hope in God that the resurrection of the dead, (which they themselves also look for) shall be of both just and unjust."},{"num":16,"verse":"“And in this I myself always endeavor to have a clear conscience toward God and toward man."},{"num":17,"verse":"“Now after many years, I came and brought alms and offerings to my nation."},{"num":18,"verse":"“At which time, some Asian Jews found me (with neither multitude nor tumult) purified in the Temple."},{"num":19,"verse":"“They ought to have been present to accuse me before you, if they have anything against me."},{"num":20,"verse":"“Or else let these themselves say if they have found any unjust thing in me while I stood in the Council,"},{"num":21,"verse":"“except for this one statement which I cried out while standing among them, ‘Concerning the resurrection of the dead am I accused by you this day.’”"},{"num":22,"verse":"Now when Felix heard these things, he deferred them, and said, “When I shall better understand the things which concern this Way (by the coming of Lysias the chief Captain), I will decide your matter.”"},{"num":23,"verse":"Then he commanded a Centurion to keep Paul, and that he should have liberty, and that he should forbid none of his friends to minister to him, or to come to him."},{"num":24,"verse":"And after some days, when Felix came with his wife Drusilla (who was Jewish), he sent for Paul and heard from him about faith in Christ."},{"num":25,"verse":"And as he reasoned of righteousness and temperance, and of the judgment to come, Felix trembled, and answered, “Go your way for now. And when it is convenient, I will call for you.”"},{"num":26,"verse":"He also hoped that money would have been given to him by Paul, so that he might release him. Therefore, he sent for him more often and communed with him."},{"num":27,"verse":"After two years had passed, Porcius Festus succeeded Felix. And wanting to curry favor with the Jews, Felix left Paul bound."}]