[{"header":"Israel Asks for a King"},{"num":8,"verse":"When Samuel was old, he appointed his sons to be judges for Israel."},{"num":2,"verse":"Samuel’s first son was named Joel. His second son was named Abijah. Joel and Abijah were judges in Beersheba."},{"num":3,"verse":"But Samuel’s sons did not live the same way he did. Joel and Abijah accepted bribes. They took money secretly and changed their decisions in court. They cheated people in court."},{"num":4,"verse":"So all the elders of Israel met together and went to Ramah to meet with Samuel."},{"num":5,"verse":"The elders said to Samuel, “You’re old, and your sons don’t live right. They are not like you. Now, give us a king to rule us like all the other nations.”"},{"num":6,"verse":"So the elders asked for a king to lead them. Samuel thought this was a bad idea, so he prayed to the Lord."},{"num":7,"verse":"The Lord told Samuel, “Do what the people tell you. They have not rejected you. They have rejected me. They don’t want me to be their king."},{"num":8,"verse":"They are doing the same thing they have always done. I took them out of Egypt, but they left me and served other gods. They are doing the same to you."},{"num":9,"verse":"So listen to the people and do what they say. But give them a warning. Tell the people what a king will do to them. Tell them how a king rules people.”"},{"num":10,"verse":"Those people asked for a king. So Samuel told them everything the Lord said."},{"num":11,"verse":"Samuel said, “If you have a king ruling over you, this is what he will do: He will take away your sons and force them to serve him. He will force them to be soldiers—they must fight from his chariots and become horse soldiers in his army. Your sons will become guards running in front of the king’s chariot."},{"num":12,"verse":"“A king will force your sons to become soldiers. He will choose which of your sons will be officers over 1000 men and which will be officers over 50 men."},{"num":13,"verse":"“A king will take your daughters and force some of them to make perfume for him and some to cook and bake for him."},{"num":14,"verse":"“A king will take your best fields, vineyards, and olive groves. He will take them from you and give them to his officers."},{"num":15,"verse":"He will take one-tenth of your grain and grapes, and he will give them to his officers and servants."},{"num":16,"verse":"“A king will take your men and women servants. He will take your best cattle and your donkeys. He will use them all for his own work."},{"num":17,"verse":"He will take one-tenth of your flocks."},{"num":18,"verse":"When that time comes, you will cry because of the king you chose. But the Lord won’t answer you at that time.”"},{"num":19,"verse":"But the people would not listen to Samuel. They said, “No, we want a king to rule over us."},{"num":20,"verse":"Then we will be the same as all the other nations. Our king will lead us. He will go before us and fight our battles.”"},{"num":21,"verse":"Samuel listened to the people and then repeated their words to the Lord."},{"num":22,"verse":"The Lord answered, “Listen to them and give them a king.”"}]