[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "50:7-15 To obey is better than sacrifice, and to love God and our neighbour better than all burnt-offerings. We are here warned not to rest in these performances. And let us beware of resting in any form. God demands the heart, and how can human inventions please him, when repentance, faith, and holiness are neglected? In the day of distress we must apply to the Lord by fervent prayer. Our troubles, though we see them coming from God's hand, must drive us to him, not drive us from him. We must acknowledge him in all our ways, depend upon his wisdom, power, and goodness, and refer ourselves wholly to him, and so give him glory. Thus must we keep up communion with God; meeting him with prayers under trials, and with praises in deliverances. A believing supplicant shall not only be graciously answered as to his petition, and so have cause for praising God, but shall also have grace to praise him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Will I eat the flesh of bulls, or drink the blood of goats? - This is said to show still further the absurdity of the views which seem to have prevailed among those who offered sacrifices. They offered them \"as if\" they were needed by God; \"as if\" they laid him under obligation; \"as if\" in some way they contributed to his happiness, or were essential to his welfare. The only supposition on which this could be true was, that he needed the flesh of the one for food, and the blood of the other for drink; or that he was sustained as creatures are. Yet this was a supposition, which, when it was stated in a formal manner, must be at once seen to be absurd; and hence the emphatic question in this verse. It may serve to illustrate this, also, to remark, that, among the pagan, the opinion did undoubtedly prevail that the gods ate and drank what was offered to them in sacrifice; whereas the truth was, that these things were consumed by the priests who attended on pagan altars, and conducted the devotions of pagan temples, and who found that it contributed much to their own support, and did much to secure the liberality of the people, to keep up the impression that what was thus offered was consumed by the gods. God appeals here to his own people in this earnest manner because it was to be presumed that \"they\" had higher conceptions of him than the pagan had; and that, enlightened as they were, they could not for a moment suppose these offerings necessary for him. This is one of the passages in the Old Testament which imply that God is a Spirit, and that, as such, he is to be worshipped in spirit and in truth. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8-15. However scrupulous in external worship, it was offered as if they conferred an obligation in giving God His own, and with a degrading view of Him as needing it [Ps 50:9-13]. Reproving them for such foolish and blasphemous notions, He teaches them to offer, or literally, \"sacrifice,\" thanksgiving, and pay, or perform, their vows—that is, to bring, with the external symbolical service, the homage of the heart, and faith, penitence, and love. To this is added an invitation to seek, and a promise to afford, all needed help in trouble.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " If I did want anything, hast thou such carnal and gross conceptions of me, that I need or delight in the blood of brute creature. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Will I eat the flesh of bulls, or drink the blood of goats? That is, express a pleasure, take delight and satisfaction, in such kind of sacrifices, which can never take away sin: no, I will not; wherefore other sacrifices, more agreeable to his nature, mind, and will, and to the Gospel dispensation, are next mentioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{k} Will I eat the flesh of bulls, or drink the blood of goats?",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Will I eat the flesh of bulls, or drink the blood of goats?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Though man's life for the infirmity of it has need of food, yet God whose life quickens all the world, has no need of such means.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Such a gross and material notion of sacrifice was common in heathen countries, and the survival of the phrase ‘bread’ or ‘food of Jehovah’ seems to indicate that it once existed even in Israel. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 21:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 21:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; &c. See Robertson Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Religion of the Semites",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 207.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will I eat the flesh of bulls, or drink the blood of goats?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " But is it to be supposed, can any suppose it possible, that I, the Lord of heaven and earth, the invisible Author of all things, both visible and invisible, can need material sustenance, and can condescend to find any sustenance in bulls' flesh and goats' blood? Scarcely did even the grossest of the heathen take this view. A vapour, an odour (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κνίσση",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), was thought to ascend from the victims sacrificed, and this penetrated to the Olympian abodes, and gratified, or, as some would say, \"fed\" the gods. But such coarse feeding as that suggested in the text was hardly imagined by any, unless it were by utter savages and barbarians. Psalm 50:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Exposition of the sacrificial Tra for the good of those whose holiness consists in outward works. The forms strengthened by ah, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", describe God's earnest desire to have Israel for willing hearers as being quite as strong as His desire to speak and to bear witness. העיד בּ, obtestari aliquem, to come forward as witness, either solemnly assuring, or, as here and in the Psalm of Asaph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", earnestly warning and punishing (cf. Arab. šahida with b, to bear witness against any one). On the Dagesh forte conjunctive in בּך, vid., Ges. ֗20, 2, a. He who is speaking has a right thus to stand face to face with Israel, for he is Elohim, the God of Israel - by which designation reference is made to the words אנכי יהוה אלהיך (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), with which begins the Law as given from Sinai, and which here take the Elohimic form (whereas in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they remain unaltered) and are inverted in accordance with the context. As ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " states, it is not the material sacrifices, which Israel continually, without cessation, offers, that are the object of the censuring testimony. ועולתיך, even if it has Mugrash, as in Baer, is not on this account, according to the interpretation given by the accentuation, equivalent to ועל־עולותיך (cf. on the other hand ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 38:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); it is a simple assertory substantival clause: thy burnt-offerings are, without intermission, continually before Me. God will not dispute about sacrifices in their outward characteristics; for - so ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " go on to say-He does not need sacrifices for the sake of receiving from Israel what He does not otherwise possess. His is every wild beast (חיתו, as in the Asaph ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 79:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the forest, His the cattle בּהררי אלף, upon the mountains of a thousand, i.e., upon the thousand (and myriad) mountains (similar to מתי מספּר or מתי מעט), or: where they live by thousands (a similar combination to נבל עשׂור). Both explanations of the genitive are unsupported by any perfectly analogous instance so far as language is concerned; the former, however, is to be preferred on account of the singular, which is better suited to it. He knows every bird that makes its home on the mountains; ידע, as usually, of a knowledge which masters a subject, compasses it and makes it its own. Whatever moves about the fields if with Him, i.e., is within the range of His knowledge (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 27:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and therefore of His power; זיז (here and in the Asaph ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from זאזא  equals  זעזע, to move to and fro, like טיט from טיטע, to swept out, cf. κινώπετον, κνώδαλον, from κινεῖν. But just as little as God requires sacrifices in order thereby to enrich Himself, is there any need on His part that might be satisfied by sacrifices, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If God should hunger, He would not stand in need of man's help in order to satisfy Himself; but He is never hungry, for He is the Being raised above all carnal wants. Just on this account, what God requires is not by any means the outward worship of sacrifice, but a spiritual offering, the worship of the heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Instead of the שׁלמים, and more particularly זבח תּודה, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:11-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and שׁלמי נדר, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (under the generic idea of which are also included, strictly speaking, vowed thank-offerings), God desires the thanksgiving of the heart and the performance of that which has been vowed in respect of our moral relationship to Himself and to men; and instead of the עולה in its manifold forms of devotion, the prayer of the heart, which shall not remain unanswered, so that in the round of this λογικὴ λατρεία everything proceeds from and ends in εὐχαριστία. It is not the sacrifices offered in a becoming spirit that are contrasted with those offered without the heart (as, e.g., Sir. 32 [35]:1-9), but the outward sacrifice appears on the whole to be rejected in comparison with the spiritual sacrifice. This entire turning away from the outward form of the legal ceremonial is, in the Old Testament, already a predictive turning towards that worship of God in spirit and in truth which the new covenant makes alone of avail, after the forms of the Law have served as swaddling clothes to the New Testament life which was coming into being in the old covenant. This \"becoming\" begins even in the Tra itself, especially in Deuteronomy. Our Psalm, like the Chokma (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and prophecy in the succeeding age (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:6-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:11-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and other passages), stands upon the standpoint of this concluding book of the Tra, which traces back all the requirements of the Law to the fundamental command of love. ",
        "children": []
      }
    ]
  }
]