[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He performeth the thing that is appointed for me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—“He will accomplish my appointed lot; He will complete that which He has decreed for me; and like these things there are many (more) with Him” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Job is disposed to take the full measure of the worst, like a pessimist, that being steeled against it, he may be prepared; and so steeled, he still trusts God. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Authorised Version.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 23:14-15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:14-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He performeth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ישׁלום חקי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jashlim chukki, he will perfect, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "finish, my appointed portion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, those calamities which he hath allotted to me for my portion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And many such things are with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "There are many such examples of God’s proceeding with men; and his counsels and providences, though always just, yet are often secret; and we cannot discern the reasonableness or equity of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore am I troubled at his presence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — When I set this great and holy God before me, and reflect that I am in his presence, I am troubled at the consideration of his glorious majesty, and sovereign, irresistible power, by which he can do whatsoever pleaseth him, without giving any account of his matters. There is, indeed, that in God which, if we consider, we shall see cause to be afraid of him: his infinite justice and purity, compared with our sinfulness and vileness; but if, withal, we consider his grace in a Redeemer, and are conscious of our compliance with that grace, the fears will vanish, and we shall see cause to hope in him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:13-17 As Job does not once question but that his trials are from the hand of God, and that there is no such thing as chance, how does he account for them? The principle on which he views them is, that the hope and reward of the faithful servants of God are only laid up in another life; and he maintains that it is plain to all, that the wicked are not treated according to their deserts in this life, but often directly the reverse. But though the obtaining of mercy, the first-fruits of the Spirit of grace, pledges a God, who will certainly finish the work which he has began; yet the afflicted believer is not to conclude that all prayer and entreaty will be in vain, and that he should sink into despair, and faint when he is reproved of Him. He cannot tell but the intention of God in afflicting him may be to produce penitence and prayer in his heart. May we learn to obey and trust the Lord, even in tribulation; to live or die as he pleases: we know not for what good ends our lives may be shortened or prolonged.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For he performeth the thing that is appointed for me - \"I am now meeting only what has been determined by his eternal plan. I know not what is the \"reason\" why it was appointed; but I see that God had resolved to do it, and that it is vain to resist him.\" So when we suffer, we may say the same thing. It is not by chance or hap-hazard that we are afflicted; it is because \"God\" has \"appointed\" that it should be so. It is not by passion or caprice on his part; not by sudden anger or wrath; but it is because he had determined to do it as a part of his eternal plan. It is much, when we are afflicted, to be able to make this reflection. I had rather be afflicted, feeling that it is \"the appointment of God,\" than feeling that it is \"by chance\" or \"hap-hazard.\" I had rather think that it is a part of a plan calmly and deliberately formed by God, than that it is the result of some unexpected and uncontrollable cause. In the one case, I see that mind and thought and plan have been employed, and I infer that there is a \"reason\" for it, though I cannot see it; in the other, I can see no proof of reason or of wisdom, and my mind finds no rest. The doctrine of divine purposes or decrees, therefore, is eminently adapted to give consolation to a sufferer. I had infinitely rather be under the operation of a plan or decree where there \"may\" be a reason for all that is done, though I cannot see it, than to feel that I am subject to the tossings of blind chance, where there can possibly be no reason.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And many such things are with him - The purpose does not pertain to me alone. It is a part of a great plan which extends to others - to all things. He is executing his plans around me, and I should not complain that in the development of his vast purposes I am included, and that I suffer. The idea seems to be this, that Job found consolation in the belief that he was not alone in these circumstances; that he had not been marked out and selected as a special object of divine displeasure. Others had suffered in like manner. There were \"many\" cases just like his own, and why should he complain? If I felt that there was special displeasure against \"me;\" that no others wcre treated in the same way, it would make afflictions much more difficult to bear. But when I feel that there is an eternal plan which embraces all, and that I only come in for my share, in common with others, of the calamities which are judged necessary for the world, I can bear them with much more ease and patience. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And many such things are with him - The purpose does not pertain to me alone. It is a part of a great plan which extends to others - to all things. He is executing his plans around me, and I should not complain that in the development of his vast purposes I am included, and that I suffer. The idea seems to be this, that Job found consolation in the belief that he was not alone in these circumstances; that he had not been marked out and selected as a special object of divine displeasure. Others had suffered in like manner. There were \"many\" cases just like his own, and why should he complain? If I felt that there was special displeasure against \"me;\" that no others wcre treated in the same way, it would make afflictions much more difficult to bear. But when I feel that there is an eternal plan which embraces all, and that I only come in for my share, in common with others, of the calamities which are judged necessary for the world, I can bear them with much more ease and patience. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. many such—He has yet many more such ills in store for me, though hidden in His breast (Job 10:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he will perfect or finish my appointed portion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. those calamities which he hath allotted to me for my portion, which as he hath begun to lay on me, so he is resolved to make a full end of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And many such things are with him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there are many such examples of God’s proceeding with men in way of absolute sovereignty and severity, and his counsels and providences, though always just, yet are oft secret, and we cannot discern the reasonableness or equity of them, which is my case. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For he performeth the thing that is appointed for me,.... The same word is used as at the end of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; where it is rendered, \"my necessary food\"; or appointed food a certain portion of it; food convenient, daily bread; and this has led some interpreters to take it in the same sense here, and render it, \"he performeth my necessary things\" (e), or things necessary for me; supplies me with the necessaries of life, to which agrees the Targum, and so Mr. Broughton; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"because he hath furnished me with my daily bread, and many such graces are with him;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and which he did according to his unchangeable purposes and decrees, and according as his soul desired, and it pleased him; and this laid Job under greater obligation still to have regard to his commandments, and the words of his mouth; but rather it is to be understood of the decrees and purposes of God relating to Job, to his person, case, and circumstances, throughout the whole course of his life hitherto: and indeed all things relating to every individual person, as to him, are appointed of God; and whatever he appoints he performs: all things relative to their temporal life, the birth of persons into the world, and their continuance in it; all the incidents in life, the places of their abode, their employments, callings, and occupations; their riches and poverty, prosperity and adversity; all their afflictions, and which Job has a special regard to, the kind and nature of them, their measure and duration, and the end and use of them; and death itself, which closes all things here, that is appointed of God, the time and circumstances of it, see Ecclesiastes 3:1; and so all things relative to the spiritual and eternal salvation of men; to save men is the determinate will of God; the persons saved are appointed by him to it, and Christ is ordained to be the Redeemer and Saviour of them; whose coming into the world for that purpose was at the appointed time, called the fulness of time, and his going out of it, or his sufferings and death, by which salvation was accomplished, were in due time, and by the determinate counsel and foreknowledge of God. The conversion of men is according to the appointment of God; they that are called are called according to his purpose; the time of conversion, the place where, and means whereby, are all fixed in the decrees and purposes of God, and have their sure and certain accomplishment; and the several vicissitudes of distress and comfort in spiritual things are as God has determined; all the times of his people are in his hands, and disposed by him; times of temptation, darkness, and desertion, and times of peace, joy, and comfort; the everlasting happiness itself is a kingdom prepared in the purposes of God from the foundation of the world, and is an inheritance obtained according to the purpose of him who has predestinated unto it; and seeing God is all wise, all knowing, all powerful, faithful and true, what he appoints must certainly be performed: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and which he did according to his unchangeable purposes and decrees, and according as his soul desired, and it pleased him; and this laid Job under greater obligation still to have regard to his commandments, and the words of his mouth; but rather it is to be understood of the decrees and purposes of God relating to Job, to his person, case, and circumstances, throughout the whole course of his life hitherto: and indeed all things relating to every individual person, as to him, are appointed of God; and whatever he appoints he performs: all things relative to their temporal life, the birth of persons into the world, and their continuance in it; all the incidents in life, the places of their abode, their employments, callings, and occupations; their riches and poverty, prosperity and adversity; all their afflictions, and which Job has a special regard to, the kind and nature of them, their measure and duration, and the end and use of them; and death itself, which closes all things here, that is appointed of God, the time and circumstances of it, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so all things relative to the spiritual and eternal salvation of men; to save men is the determinate will of God; the persons saved are appointed by him to it, and Christ is ordained to be the Redeemer and Saviour of them; whose coming into the world for that purpose was at the appointed time, called the fulness of time, and his going out of it, or his sufferings and death, by which salvation was accomplished, were in due time, and by the determinate counsel and foreknowledge of God. The conversion of men is according to the appointment of God; they that are called are called according to his purpose; the time of conversion, the place where, and means whereby, are all fixed in the decrees and purposes of God, and have their sure and certain accomplishment; and the several vicissitudes of distress and comfort in spiritual things are as God has determined; all the times of his people are in his hands, and disposed by him; times of temptation, darkness, and desertion, and times of peace, joy, and comfort; the everlasting happiness itself is a kingdom prepared in the purposes of God from the foundation of the world, and is an inheritance obtained according to the purpose of him who has predestinated unto it; and seeing God is all wise, all knowing, all powerful, faithful and true, what he appoints must certainly be performed: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and many such things are with him; besides what were appointed for Job, and performed upon him, there were innumerable instances in the world of God's appointments, and the performance of them, both with respect to good things and evil things, mercies and blessings, afflictions and troubles: or besides what God had performed with respect to Job, especially with regard to his afflictions and sufferings, there were still many more things to come, which were secret in his breast, and which he had decreed and appointed, and would in due time be performed, though Job knew not as yet what they, were, whether good or evil things, though he supposed the latter. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e)   \"quia perfecit necessaria mea\", Vatablus; so Nachmanides, Ben Gersom, Sephorno. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e)   \"quia perfecit necessaria mea\", Vatablus; so Nachmanides, Ben Gersom, Sephorno. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For he performeth the thing that is appointed for me: and {i} many such things are with him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For he performeth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "the thing that is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " appointed for me: and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " many such ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "things are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) In many points man is not able to attain to God's judgments.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For he performeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Yea He will perform",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, accomplish. The “thing appointed” for Job is his death through his malady, which the Almighty has resolved upon. This is the profound enigma to Job; but it is far from being a solitary one: “many such things are with Him”—the instance is but one out of many similar ones that happen under God’s rule of the world of mankind; comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For he performeth the thing that is appointed for me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he will assuredly accomplish whatever he has decreed for me. I cannot expect that he will blench or change. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And many such things are with him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He has many other weapons in his armoury, many other woes with which he might afflict me. Job 23:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14  For He accomplisheth that which is appointed for me,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And much of a like kind is with Him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15  Therefore I am troubled at His presence;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If I consider it, I am afraid of Him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  And God hath caused my heart to be dejected,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the Almighty hath put me to confusion;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17  For I have not been destroyed before darkness,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And before my countenance, which thick darkness covereth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Now it is the will of God, the absolute, which has all at once turned against him, the innocent (Job 23:13); for what He has decreed against him (חקּי) He also brings to a complete fulfilment (השׁלים, as e.g., Isaiah 44:26); and the same troubles as those which he already suffers, God has still more abundantly decreed for him, in order to torture him gradually, but surely, to death. Job intends Job 23:14 in reference to himself, not as a general assertion: it is, in general, God's way of acting. Hahn's objection to the other explanation, that Job's affliction, according to his own previous assertions, has already attained its highest degree, does not refute it; for Job certainly has a term of life before him, though it be but short, in which the wondrously inventive (Job 10:16) hostility of God can heap up ever new troubles for him. On the other hand, the interpretation of the expression in a general sense is opposed by the form of the expression itself, which is not that God delights to do this, but that He purposes (עמּו) to do it. It is a conclusion from the present concerning the future, such as Job is able to make with reference to himself; while he, moreover, abides by the reality in respect to the mysterious distribution of the fortunes of men. Therefore, because he is a mark for the enmity of God, without having merited it, he is confounded before His countenance, which is so angrily turned upon him (comp. פנים, Psalm 21:10; Lamentations 4:16); if he considers it (according to the sense fut. hypothet., as Job 23:9), he trembles before Him, who recompenses faithful attachment by such torturing pain. The following connection with ל and the mention of God twice at the beginning of the affirmations, is intended to mean: (I tremble before Him), and He it is who has made me faint-hearted (הרך Hiph. from the Kal, Deuteronomy 20:3, and freq., to be tender, soft, disconcerted), and has troubled me; which is then supported in Job 23:17.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Now it is the will of God, the absolute, which has all at once turned against him, the innocent (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); for what He has decreed against him (חקּי) He also brings to a complete fulfilment (השׁלים, as e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and the same troubles as those which he already suffers, God has still more abundantly decreed for him, in order to torture him gradually, but surely, to death. Job intends ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in reference to himself, not as a general assertion: it is, in general, God's way of acting. Hahn's objection to the other explanation, that Job's affliction, according to his own previous assertions, has already attained its highest degree, does not refute it; for Job certainly has a term of life before him, though it be but short, in which the wondrously inventive (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") hostility of God can heap up ever new troubles for him. On the other hand, the interpretation of the expression in a general sense is opposed by the form of the expression itself, which is not that God delights to do this, but that He purposes (עמּו) to do it. It is a conclusion from the present concerning the future, such as Job is able to make with reference to himself; while he, moreover, abides by the reality in respect to the mysterious distribution of the fortunes of men. Therefore, because he is a mark for the enmity of God, without having merited it, he is confounded before His countenance, which is so angrily turned upon him (comp. פנים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 21:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 4:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); if he considers it (according to the sense fut. hypothet., as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), he trembles before Him, who recompenses faithful attachment by such torturing pain. The following connection with ל and the mention of God twice at the beginning of the affirmations, is intended to mean: (I tremble before Him), and He it is who has made me faint-hearted (הרך Hiph. from the Kal, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and freq., to be tender, soft, disconcerted), and has troubled me; which is then supported in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "His suffering which draws him on to ruin he perceives, but it is not the proper ground of his inward destruction; it is not the encircling darkness of affliction, not the mysterious form of his suffering which disconcerts him, but God's hostile conduct towards him, His angry countenance as he seems to see it, and which he is nevertheless unable to explain. Thus also Ew., Hirz., Vaih., Hlgst., and Schlottm. explain the passage. The only other explanation worthy of mention is that which finds in Job 23:17 the thought already expressed in Job 3:10 : For I was not then destroyed, in order that I might experience such mysterious suffering; and interpretation with which most of the old expositors were satisfied, and which has been revived by Rosenm., Stick., and Hahn. We translate: for I have not been destroyed before darkness (in order to be taken away from it before it came upon me), and He has not hidden darkness before my face; or as an exclamation: that I have not been destroyed! which is to be equivalent to: Had I but been ... ! Apart from this rendering of the quod non  equals  utinam, which cannot be supported, (1) It is doubly hazardous thus to carry the לא forward to the second line in connection with verbs of different persons. (2) The darkness in Job 23:17 appears (at least according to the usual interpret. caliginem) as that which is being covered, whereas it is naturally that which covers something else; wherefore Blumenfeld explains: and darkness has not hidden, viz., such pain as I must now endure, from my face. (3) The whole thought which is thus gained is without point, and meaningless, in this connection. On the other hand, the antithesis between מפּניו and מפּני, ממּנוּ and מפּני־חשׁך, is at once obvious; and this antithesis, which forces itself upon the attention, also furnishes the thought which might be expected from the context. It is unnecessary to take נצמת in a different signification from Job 6:17; in Arabic ṣmt signifies conticescere; the idea of the root, however, is in general a constraining depriving of free movement. חשׁך is intended as in the question of Eliphaz, Job 22:11 : \"Or seest thou not the darkness?\" to which it perhaps refers. It is impossible, with Schlottm., to translate Job 23:17: and before that darkness covers my face; מן is never other than a praep., not a conjunction with power over a whole clause. It must be translated: et a facie mea quam obtegit caligo. As the absolute פנים, Job 9:27, signifies the appearance of the countenance under pain, so here by it Job means his countenance distorted by pain, his deformed appearance, which, as the attributive clause affirms, is thoroughly darkened by suffering (comp. Job 30:30). But it is not this darkness which stares him in the face, and threatens to swallow him up (comp. מפני־חשׁך, Job 17:12); not this his miserable form, which the extremest darkness covers (on אפל, vid., Job 10:22), that destroys his inmost nature; but the thought that God stands forth in hostility against him, which makes his affliction so terrific, and doubly so in connection with the inalienable consciousness of his innocence. From the incomprehensible punishment which, without reason, is passing over him, he now again comes to speak of the incomprehensible connivance of God, which permits the godlessness of the world to go on unpunished. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "His suffering which draws him on to ruin he perceives, but it is not the proper ground of his inward destruction; it is not the encircling darkness of affliction, not the mysterious form of his suffering which disconcerts him, but God's hostile conduct towards him, His angry countenance as he seems to see it, and which he is nevertheless unable to explain. Thus also Ew., Hirz., Vaih., Hlgst., and Schlottm. explain the passage. The only other explanation worthy of mention is that which finds in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the thought already expressed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : For I was not then destroyed, in order that I might experience such mysterious suffering; and interpretation with which most of the old expositors were satisfied, and which has been revived by Rosenm., Stick., and Hahn. We translate: for I have not been destroyed before darkness (in order to be taken away from it before it came upon me), and He has not hidden darkness before my face; or as an exclamation: that I have not been destroyed! which is to be equivalent to: Had I but been ... ! Apart from this rendering of the quod non  equals  utinam, which cannot be supported, (1) It is doubly hazardous thus to carry the לא forward to the second line in connection with verbs of different persons. (2) The darkness in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " appears (at least according to the usual interpret. caliginem) as that which is being covered, whereas it is naturally that which covers something else; wherefore Blumenfeld explains: and darkness has not hidden, viz., such pain as I must now endure, from my face. (3) The whole thought which is thus gained is without point, and meaningless, in this connection. On the other hand, the antithesis between מפּניו and מפּני, ממּנוּ and מפּני־חשׁך, is at once obvious; and this antithesis, which forces itself upon the attention, also furnishes the thought which might be expected from the context. It is unnecessary to take נצמת in a different signification from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; in Arabic ṣmt signifies conticescere; the idea of the root, however, is in general a constraining depriving of free movement. חשׁך is intended as in the question of Eliphaz, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"Or seest thou not the darkness?\" to which it perhaps refers. It is impossible, with Schlottm., to translate ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": and before that darkness covers my face; מן is never other than a praep., not a conjunction with power over a whole clause. It must be translated: et a facie mea quam obtegit caligo. As the absolute פנים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", signifies the appearance of the countenance under pain, so here by it Job means his countenance distorted by pain, his deformed appearance, which, as the attributive clause affirms, is thoroughly darkened by suffering (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But it is not this darkness which stares him in the face, and threatens to swallow him up (comp. מפני־חשׁך, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 17:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); not this his miserable form, which the extremest darkness covers (on אפל, vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that destroys his inmost nature; but the thought that God stands forth in hostility against him, which makes his affliction so terrific, and doubly so in connection with the inalienable consciousness of his innocence. From the incomprehensible punishment which, without reason, is passing over him, he now again comes to speak of the incomprehensible connivance of God, which permits the godlessness of the world to go on unpunished. ",
            "children": []
          }
        ]
      }
    ]
  }
]