[{"header":"Elijah runs to Mount Horeb"},{"num":19,"verse":"Ahab told Jezebel all that Elijah had done, how he had killed all Baal’s prophets with the sword."},{"num":2,"verse":"Jezebel sent a messenger to Elijah with this message: “May the gods do whatever they want to me if by this time tomorrow I haven’t made your life like the life of one of them.”"},{"num":3,"verse":"Elijah was terrified. He got up and ran for his life. He arrived at Beer-sheba in Judah and left his assistant there."},{"num":4,"verse":"He himself went farther on into the desert a day’s journey. He finally sat down under a solitary broom bush. He longed for his own death: “It’s more than enough, Lord! Take my life because I’m no better than my ancestors.”"},{"num":5,"verse":"He lay down and slept under the solitary broom bush."},{"num":6,"verse":"Elijah opened his eyes and saw flatbread baked on glowing coals and a jar of water right by his head. He ate and drank, and then went back to sleep."},{"num":7,"verse":"The Lord’s messenger returned a second time and tapped him. “Get up!” the messenger said. “Eat something, because you have a difficult road ahead of you.”"},{"num":8,"verse":"Elijah got up, ate and drank, and went refreshed by that food for forty days and nights until he arrived at Horeb, God’s mountain."},{"num":9,"verse":"There he went into a cave and spent the night."},{"num":10,"verse":"Elijah replied, “I’ve been very passionate for the Lord God of heavenly forces because the Israelites have abandoned your covenant. They have torn down your altars, and they have murdered your prophets with the sword. I’m the only one left, and now they want to take my life too!”"},{"num":11,"verse":"The Lord said, “Go out and stand at the mountain before the Lord. The Lord is passing by.” A very strong wind tore through the mountains and broke apart the stones before the Lord. But the Lord wasn’t in the wind. After the wind, there was an earthquake. But the Lord wasn’t in the earthquake."},{"num":12,"verse":"After the earthquake, there was a fire. But the Lord wasn’t in the fire. After the fire, there was a sound. Thin. Quiet."},{"num":13,"verse":"When Elijah heard it, he wrapped his face in his coat. He went out and stood at the cave’s entrance. A voice came to him and said, “Why are you here, Elijah?”"},{"num":14,"verse":"He said, “I’ve been very passionate for the Lord God of heavenly forces because the Israelites have abandoned your covenant. They have torn down your altars, and they have murdered your prophets with the sword. I’m the only one left, and now they want to take my life too.”"},{"num":15,"verse":"The Lord said to him, “Go back through the desert to Damascus and anoint Hazael as king of Aram."},{"num":16,"verse":"Also anoint Jehu, Nimshi’s son, as king of Israel; and anoint Elisha from Abel-meholah, Shaphat’s son, to succeed you as prophet."},{"num":17,"verse":"Whoever escapes from the sword of Hazael, Jehu will kill. Whoever escapes from the sword of Jehu, Elisha will kill."},{"num":18,"verse":"But I have preserved those who remain in Israel, totaling seven thousand—all those whose knees haven’t bowed down to Baal and whose mouths haven’t kissed him.”"},{"num":19,"verse":"So Elijah departed from there and found Elisha, Shaphat’s son. He was plowing with twelve yoke of oxen before him. Elisha was with the twelfth yoke. Elijah met up with him and threw his coat on him."},{"num":20,"verse":"Elisha immediately left the oxen and ran after Elijah. “Let me kiss my father and my mother,” Elisha said, “then I will follow you.”"},{"num":21,"verse":"Elisha turned back from following Elijah, took the pair of oxen, and slaughtered them. Then with equipment from the oxen, Elisha boiled the meat, gave it to the people, and they ate it. Then he got up, followed Elijah, and served him."}]