[{"header":"Elijah at Mount Sinai"},{"num":19,"verse":"King Ahab told Jezebel everything Elijah had done. Ahab told her how Elijah had killed all the prophets with a sword. "},{"num":2,"verse":"So Jezebel sent a messenger to Elijah. Jezebel said, “By this time tomorrow I will kill you. I will kill you as you killed those prophets. If I don’t succeed, may the gods punish me terribly.”"},{"num":3,"verse":"When Elijah heard this, he was afraid. So he ran away to save his life. He took his servant with him. When they came to Beersheba in Judah, Elijah left his servant there. "},{"num":4,"verse":"Then Elijah walked for a whole day into the desert. He sat down under a bush and asked to die. Elijah prayed, “I have had enough, Lord. Let me die. I am no better than my ancestors.” "},{"num":5,"verse":"Then Elijah lay down under the tree and slept."},{"num":6,"verse":"Elijah saw near his head a loaf baked over coals and a jar of water. So he ate and drank. Then he went back to sleep."},{"num":7,"verse":"Later the Lord’s angel came to him a second time. The angel touched him and said, “Get up and eat. If you don’t, the journey will be too hard for you.” "},{"num":8,"verse":"So Elijah got up and ate and drank. The food made him strong enough to walk for 40 days and nights. He walked to Mount Sinai, the mountain of God. "},{"num":9,"verse":"There Elijah went into a cave and stayed all night."},{"num":10,"verse":"Elijah answered, “Lord, God of heaven’s armies, I have always served you the best I could. But the people of Israel have broken their agreement with you. They have destroyed your altars. They have killed your prophets with swords. I am the only prophet left. And now they are trying to kill me, too!”"},{"num":11,"verse":"Then the Lord said to Elijah, “Go. Stand in front of me on the mountain. I will pass by you.” Then a very strong wind blew. It caused the mountains to break apart. It broke apart large rocks in front of the Lord. But the Lord was not in the wind. After the wind, there was an earthquake. But the Lord was not in the earthquake. "},{"num":12,"verse":"After the earthquake, there was a fire. But the Lord was not in the fire. After the fire, there was a quiet, gentle voice. "},{"num":13,"verse":"When Elijah heard it, he covered his face with his coat. He went out and stood at the entrance to the cave."},{"num":14,"verse":"Elijah answered, “Lord, God of heaven’s armies, I have always served you the best I could. But the people of Israel have broken their agreement with you. They have destroyed your altars. They have killed your prophets with swords. I am the only prophet left. And now they are trying to kill me, too.”"},{"num":15,"verse":"The Lord said to him, “Go back on the road that leads to the desert around Damascus. Enter that city. There pour olive oil on Hazael to make him king over Aram. "},{"num":16,"verse":"Then pour oil on Jehu son of Nimshi to make him king over Israel. Next, pour oil on Elisha son of Shaphat from Abel Meholah. He will be a prophet in your place. "},{"num":17,"verse":"Jehu will kill anyone who escapes from Hazael’s sword. And Elisha will kill anyone who escapes from Jehu’s sword. "},{"num":18,"verse":"But I have left 7,000 people living in Israel. Those 7,000 have never bowed down before Baal. Their mouths have never kissed his idol.”"},{"header":"Elisha Becomes a Prophet"},{"num":19,"verse":"So Elijah left there and found Elisha son of Shaphat. He was plowing a field with a team of oxen. There were 11 teams ahead of him. Elisha was plowing with the twelfth team of oxen. Elijah came up to Elisha. Elijah took off his coat and put it on Elisha. "},{"num":20,"verse":"Then Elisha left his oxen and ran to follow Elijah. Elisha said, “Let me kiss my father and my mother good-bye. Then I will go with you.”"},{"num":21,"verse":"So Elisha went back. He took his pair of oxen and killed them. He used the wooden yoke for the fire. Then he cooked the meat and gave it to the people. And they ate it. Then Elisha went and followed Elijah and became his helper."}]