[{"header":"Elijah Flees from Jezebel"},{"num":19,"verse":"Now Ahab told Jezebel everything that Elijah had done, and how he had killed all the prophets with the sword."},{"num":2,"verse":"Then Jezebel sent a messenger to Elijah, saying, “So may the gods do to me and more so, if by about this time tomorrow I do not make your life like the life of one of them.”"},{"num":3,"verse":"And he was afraid, and got up and ran for his life and came to Beersheba, which belongs to Judah; and he left his servant there."},{"num":4,"verse":"But he himself went a day’s journey into the wilderness, and came and sat down under a broom tree; and he asked for himself to die, and said, “Enough! Now, Lord, take my life, for I am no better than my fathers.”"},{"num":5,"verse":"Then he lay down and fell asleep under a broom tree; but behold, there was an angel touching him, and he said to him, “Arise, eat!”"},{"num":6,"verse":"And he looked, and behold, there was at his head a round loaf of bread baked on hot coals, and a pitcher of water. So he ate and drank, and lay down again."},{"num":7,"verse":"But the angel of the Lord came back a second time and touched him, and said, “Arise, eat; because the journey is too long for you.”"},{"num":8,"verse":"So he arose and ate and drank, and he journeyed in the strength of that food for forty days and forty nights to Horeb, the mountain of God."},{"header":"Elijah at Horeb"},{"num":9,"verse":"Then he came there to a cave and spent the night there; and behold, the word of the Lord came to him, and He said to him, “What are you doing here, Elijah?”"},{"num":10,"verse":"And he said, “I have been very zealous for the Lord, the God of armies; for the sons of Israel have abandoned Your covenant, torn down Your altars, and killed Your prophets with the sword. And I alone am left; and they have sought to take my life.”"},{"num":11,"verse":"So He said, “Go out and stand on the mountain before the Lord.” And behold, the Lord was passing by! And a great and powerful wind was tearing out the mountains and breaking the rocks in pieces before the Lord; but the Lord was not in the wind. And after the wind there was an earthquake, but the Lord was not in the earthquake."},{"num":12,"verse":"And after the earthquake, a fire, but the Lord was not in the fire; and after the fire, a sound of a gentle blowing."},{"num":13,"verse":"When Elijah heard it, he wrapped his face in his cloak and went out and stood in the entrance of the cave. And behold, a voice came to him and said, “What are you doing here, Elijah?”"},{"num":14,"verse":"Then he said, “I have been very zealous for the Lord, the God of armies; for the sons of Israel have abandoned Your covenant, torn down Your altars, and killed Your prophets with the sword. And I alone am left; and they have sought to take my life.”"},{"num":15,"verse":"The Lord said to him, “Go, return on your way to the wilderness of Damascus; and when you have arrived, you shall anoint Hazael king over Aram."},{"num":16,"verse":"You shall also anoint Jehu the son of Nimshi king over Israel; and you shall anoint Elisha the son of Shaphat of Abel-meholah as prophet in your place."},{"num":17,"verse":"And it shall come about that the one who escapes from the sword of Hazael, Jehu shall put to death, and the one who escapes from the sword of Jehu, Elisha shall put to death."},{"num":18,"verse":"Yet I will leave seven thousand in Israel, all the knees that have not bowed to Baal and every mouth that has not kissed him.”"},{"num":19,"verse":"So he departed from there and found Elisha the son of Shaphat while he was plowing, with twelve yoke of oxen in front of him, and he with the twelfth. And Elijah came over to him and threw his cloak on him."},{"num":20,"verse":"Then he left the oxen behind and ran after Elijah, and said, “Please let me kiss my father and my mother, then I will follow you.” And he said to him, “Go back, for what have I done to you?”"},{"num":21,"verse":"So he returned from following him, and took the pair of oxen and sacrificed them, and cooked their meat with the implements of the oxen, and gave it to the people and they ate. Then he got up and followed Elijah and served him."}]