[{"header":"Joash Repairs the Temple(A)"},{"num":24,"verse":"Now Joash was seven years old when he started his reign, and he was king in Jerusalem for forty years. The name of his mother was Zibiah of Beersheba. "},{"num":2,"verse":"Joash did what was correct in the eyes of the Lord all the days of Jehoiada the priest. "},{"num":3,"verse":"And Jehoiada gave Joash two wives, and he had sons and daughters."},{"num":4,"verse":"And it happened after this that it was in the heart of Joash to restore the house of the Lord. "},{"num":5,"verse":"So he assembled the priests and Levites to speak with them, “Go out to the cities of Judah and collect money from all Israel to fortify the house of your God, what is necessary each year. Now hurry with this matter.” But the Levites delayed."},{"num":6,"verse":"So the king called Jehoiada, who was head over this, and said to him, “Why have you not required from the Levites that they bring in from Judah and Jerusalem the tax levied by Moses, the servant of the Lord, for the congregation of Israel for the tent of the testimony?”"},{"num":7,"verse":"For the sons of Athaliah, the wicked woman, had broken into the house of God and even used all the holy items of the house of the Lord for Baal worship."},{"num":8,"verse":"Then the king spoke, and they made a chest, and put it outside the gate of the house of the Lord. "},{"num":9,"verse":"And they gave a report in Judah and Jerusalem to bring in to the Lord a tax levied by Moses the servant of God on Israel in the wilderness. "},{"num":10,"verse":"So all the officials and people rejoiced, and they brought in the money and cast it into the chest until it was full. "},{"num":11,"verse":"And it happened that at the time the Levites brought the chest to the guards of the king that there was a large amount of money. So the king’s scribe and head priest’s commissioner would bring it and empty the chest and then take it and return it to its place. They continued to do this every day and collected a great amount of money. "},{"num":12,"verse":"So the king and Jehoiada gave it to those doing a work of labor on the house of the Lord. And they hired masons and craftsmen to repair the house of the Lord, and even metal workers in iron and bronze to fortify the house of the Lord."},{"num":13,"verse":"So the workmen worked, and the work was completed by them. They restored the house of God to its specifications and strengthened it. "},{"num":14,"verse":"When they had finished, they brought the rest of the money before the king and Jehoiada, who made vessels for the house of the Lord, vessels for serving and for making burnt offerings, spoons and vessels of gold and silver. They continually offered burnt offerings in the house of the Lord all the days of Jehoiada."},{"num":15,"verse":"Then Jehoiada became old and full of days and died. He was one hundred and thirty years old when he died. "},{"num":16,"verse":"So they buried him in the City of David with the kings, because he had done good in Israel, both toward God and His house."},{"header":"The Wickedness of Joash"},{"num":17,"verse":"After the death of Jehoiada the officials of Judah came and paid homage to the king. At that time the king listened to them. "},{"num":18,"verse":"Then they abandoned the house of the Lord and God of their fathers, and they served the Asherah poles and idols. And divine wrath was on Judah and Jerusalem because of this guilt. "},{"num":19,"verse":"And God sent prophets to return them to the Lord. These warned the people, but they would not listen."},{"num":20,"verse":"Then the Spirit of God clothed Zechariah the son of Jehoiada the priest, and he stood above the people saying, “Thus says God: Why are you transgressing the commandments of the Lord so that you all will not be successful? Because you all have abandoned the Lord, He has abandoned you.”"},{"num":21,"verse":"But they plotted against him, and at the command of the king they all stoned him in the court of the house of the Lord. "},{"num":22,"verse":"And Joash the king did not remember the kindness that Jehoiada the father of Zechariah had shown him, but killed his son. As he was dying, he said, “May the Lord see and avenge!”"},{"header":"The Death of Joash"},{"num":23,"verse":"And it happened that at the turn of the year the army of Aram came up against Joash. They came to Judah and Jerusalem and destroyed all the officials of the people, and they sent all their plunder to the king of Damascus. "},{"num":24,"verse":"Though the Aramean army came with a few men, the Lord delivered into their hand a very great Judean army because they abandoned the Lord God of their fathers. So they enacted judgment on Joash. "},{"num":25,"verse":"When they left him (for they abandoned him with severe wounds) his own servants plotted against him because of the blood of the son of Jehoiada the priest. So they killed him on his bed. So he died, and they buried him in the City of David, but they did not bury him in the tombs of the kings."},{"num":26,"verse":"And those who conspired against him were Zabad the son of Shimeath the Ammonite and Jehozabad the son of Shimrith the Moabite. "},{"num":27,"verse":"Accounts of his sons and of the many oracles against him and of the rebuilding of the house of God are written in the annals of the kings. And Amaziah his son ruled in his place."}]