[{"header":"Chapter 24"},{"num":1,"verse":"The Temple Restored. Joash was seven years old when he became king, and he reigned forty years in Jerusalem. His mother’s name was Zibiah, from Beer-sheba. "},{"num":2,"verse":"Joash did what was right in the Lord’s sight as long as Jehoiada the priest lived. "},{"num":3,"verse":"Jehoiada provided him with two wives, and he became the father of sons and daughters."},{"num":4,"verse":"After some time, Joash decided to restore the house of the Lord. "},{"num":5,"verse":"He gathered together the priests and Levites and said to them: “Go out to all the cities of Judah and gather money from all Israel that you may repair the house of your God over the years. You must hurry this project.” But the Levites did not. "},{"num":6,"verse":"Then the king summoned Jehoiada, who was in charge, and said to him: “Why have you not required the Levites to bring in from Judah and Jerusalem the tax levied by Moses, the servant of the Lord, and by the assembly of Israel, for the tent of the testimony?” "},{"num":7,"verse":"For the wicked Athaliah and her sons had damaged the house of God and had even turned over to the Baals the holy things of the Lord’s house."},{"num":8,"verse":"At the king’s command, therefore, they made a chest, which they put outside the gate of the Lord’s house. "},{"num":9,"verse":"They had it proclaimed throughout Judah and Jerusalem that the tax which Moses, the servant of God, had imposed on Israel in the wilderness should be brought to the Lord. "},{"num":10,"verse":"All the princes and the people rejoiced; they brought what was asked and cast it into the chest until it was filled. "},{"num":11,"verse":"Whenever the chest was brought to the royal officials by the Levites and they noticed that there was a large amount of money, the royal scribe and an overseer for the chief priest would come up, empty the chest, and then take it back and return it to its place. This they did day after day until they had collected a large sum of money. "},{"num":12,"verse":"Then the king and Jehoiada gave it to the workers in charge of the labor on the Lord’s house, who hired masons and carpenters to restore the Lord’s house, and also iron- and bronze-smiths to repair it. "},{"num":13,"verse":"The workers labored, and the task of restoration progressed under their hands. They restored the house of God according to its original form, and reinforced it. "},{"num":14,"verse":"After they had finished, they brought the rest of the money to the king and to Jehoiada, who had it made into utensils for the house of the Lord, utensils for the service and the burnt offerings, and basins and other gold and silver utensils. They sacrificed burnt offerings in the Lord’s house continually all the days of Jehoiada. "},{"num":15,"verse":"Jehoiada grew old, full of years, and died; he was a hundred and thirty years old. "},{"num":16,"verse":"They buried him in the City of David with the kings, because of the good he had done in Israel, especially for God and his house."},{"num":17,"verse":"Joash’s Apostasy. After the death of Jehoiada, the princes of Judah came and paid homage to the king; then the king listened to them. "},{"num":18,"verse":"They abandoned the house of the Lord, the God of their ancestors, and began to serve the asherahs and the idols; and because of this crime of theirs, wrath came upon Judah and Jerusalem. "},{"num":19,"verse":"Although prophets were sent to them to turn them back to the Lord and to warn them, the people would not listen. "},{"num":20,"verse":"Then the spirit of God clothed Zechariah, son of Jehoiada the priest. He took his stand above the people and said to them: “Thus says God, Why are you transgressing the Lord’s commands, so that you cannot prosper? Because you have abandoned the Lord, he has abandoned you.” "},{"num":21,"verse":"But they conspired against him, and at the king’s command they stoned him in the court of the house of the Lord. "},{"num":22,"verse":"Thus King Joash was unmindful of the devotion shown him by Jehoiada, Zechariah’s father, and killed the son. As he was dying, he said, “May the Lord see and avenge.”"},{"num":23,"verse":"Joash Punished. At the turn of the year a force of Arameans came up against Joash. They invaded Judah and Jerusalem, killed all the princes of the people, and sent all their spoil to the king of Damascus. "},{"num":24,"verse":"Though the Aramean force was small, the Lord handed over a very large force into their power, because Judah had abandoned the Lord, the God of their ancestors. So judgment was meted out to Joash. "},{"num":25,"verse":"After the Arameans had departed from him, abandoning him to his many injuries, his servants conspired against him because of the murder of the son of Jehoiada the priest. They killed him on his sickbed. He was buried in the City of David, but not in the tombs of the kings."},{"num":26,"verse":"Those who conspired against him were Zabad, son of Shimeath from Ammon, and Jehozabad, son of Shimrith from Moab. "},{"num":27,"verse":"An account of his sons, the great tribute imposed on him, and his rebuilding of the house of God is written in the midrash of the book of the kings. His son Amaziah succeeded him as king."}]