[{"num":18,"verse":"And the whole congregation of the children of Israel assembled themselves together at Shiloh, and set up the tent of meeting there: and the land was subdued before them. "},{"num":2,"verse":"And there remained among the children of Israel seven tribes, which had not yet divided their inheritance. "},{"num":3,"verse":"And Joshua said unto the children of Israel, How long are ye slack to go in to possess the land, which Jehovah, the God of your fathers, hath given you? "},{"num":4,"verse":"Appoint for you three men of each tribe: and I will send them, and they shall arise, and walk through the land, and describe it according to their inheritance; and they shall come unto me. "},{"num":5,"verse":"And they shall divide it into seven portions: Judah shall abide in his border on the south, and the house of Joseph shall abide in their border on the north. "},{"num":6,"verse":"And ye shall describe the land into seven portions, and bring the description hither to me; and I will cast lots for you here before Jehovah our God. "},{"num":7,"verse":"For the Levites have no portion among you; for the priesthood of Jehovah is their inheritance: and Gad and Reuben and the half-tribe of Manasseh have received their inheritance beyond the Jordan eastward, which Moses the servant of Jehovah gave them."},{"num":8,"verse":"And the men arose, and went: and Joshua charged them that went to describe the land, saying, Go and walk through the land, and describe it, and come again to me; and I will cast lots for you here before Jehovah in Shiloh. "},{"num":9,"verse":"And the men went and passed through the land, and described it by cities into seven portions in a book; and they came to Joshua unto the camp at Shiloh. "},{"num":10,"verse":"And Joshua cast lots for them in Shiloh before Jehovah: and there Joshua divided the land unto the children of Israel according to their divisions."},{"num":11,"verse":"And the lot of the tribe of the children of Benjamin came up according to their families: and the border of their lot went out between the children of Judah and the children of Joseph. "},{"num":12,"verse":"And their border on the north quarter was from the Jordan; and the border went up to the side of Jericho on the north, and went up through the hill-country westward; and the goings out thereof were at the wilderness of Beth-aven. "},{"num":13,"verse":"And the border passed along from thence to Luz, to the side of Luz (the same is Beth-el), southward; and the border went down to Ataroth-addar, by the mountain that lieth on the south of Beth-horon the nether. "},{"num":14,"verse":"And the border extended thence, and turned about on the west quarter southward, from the mountain that lieth before Beth-horon southward; and the goings out thereof were at Kiriath-baal (the same is Kiriath-jearim), a city of the children of Judah: this was the west quarter. "},{"num":15,"verse":"And the south quarter was from the uttermost part of Kiriath-jearim; and the border went out westward, and went out to the fountain of the waters of Nephtoah; "},{"num":16,"verse":"and the border went down to the uttermost part of the mountain that lieth before the valley of the son of Hinnom, which is in the vale of Rephaim northward; and it went down to the valley of Hinnom, to the side of the Jebusite southward, and went down to En-rogel; "},{"num":17,"verse":"and it extended northward, and went out at En-shemesh, and went out to Geliloth, which is over against the ascent of Adummim; and it went down to the stone of Bohan the son of Reuben; "},{"num":18,"verse":"and it passed along to the side over against the Arabah northward, and went down unto the Arabah; "},{"num":19,"verse":"and the border passed along to the side of Beth-hoglah northward; and the goings out of the border were at the north bay of the Salt Sea, at the south end of the Jordan: this was the south border. "},{"num":20,"verse":"And the Jordan was the border of it on the east quarter. This was the inheritance of the children of Benjamin, by the borders thereof round about, according to their families."},{"num":21,"verse":"Now the cities of the tribe of the children of Benjamin according to their families were Jericho, and Beth-hoglah, and Emek-keziz, "},{"num":22,"verse":"and Beth-arabah, and Zemaraim, and Beth-el, "},{"num":23,"verse":"and Avvim, and Parah, and Ophrah, "},{"num":24,"verse":"and Chephar-ammoni, and Ophni, and Geba; twelve cities with their villages: "},{"num":25,"verse":"Gibeon, and Ramah, and Beeroth, "},{"num":26,"verse":"and Mizpeh, and Chephirah, and Mozah, "},{"num":27,"verse":"and Rekem, and Irpeel, and Taralah, "},{"num":28,"verse":"and Zelah, Eleph, and the Jebusite (the same is Jerusalem), Gibeath, and Kiriath; fourteen cities with their villages. This is the inheritance of the children of Benjamin according to their families."}]