[{"num":18,"verse":"1 The Tabernacle set in Shiloh. 4 Certain are sent to divide the land to the other seven tribes. 11 The lot of the children of Benjamin."},{"num":1,"verse":"And the whole Congregation of the children of Israel came together at Shiloh: for they set up the Tabernacle of the Congregation there, after the land was subject unto them."},{"num":2,"verse":"Now there remained among the children of Israel seven tribes, to whom they had not divided their inheritance."},{"num":3,"verse":"Therefore Joshua said unto the children of Israel, how long are you so slack to enter and possess the land which the Lord God of your fathers hath given you?"},{"num":4,"verse":"Give from among you for every tribe three men, that I may send them, and that they may rise and walk through the land, and distribute it according to their inheritance, and return to me."},{"num":5,"verse":"And that they may divide it unto them into seven parts, (Judah shall abide in his coast at the South, and the house of Joseph shall stand in their coasts at the North.)"},{"num":6,"verse":"Ye shall describe the land therefore into seven parts, and shall bring them hither to me, and I will cast lots for you here before the Lord our God."},{"num":7,"verse":"But the Levites shall have no part among you: for the Priesthood of the Lord is their inheritance: also Gad and Reuben and half the tribe of Manasseh have received their inheritance beyond Jordan Eastward, which Moses the servant of the Lord gave them."},{"num":8,"verse":"¶ Then the men arose, and went their way, and Joshua charged them that went to describe the land, saying, Depart, and go through the land, and describe it, and return to me, that I may here cast lots for you before the Lord in Shiloh."},{"num":9,"verse":"So the men departed, and passed through the land, and described it by cities into seven parts in a book, and returned to Joshua into the camp at Shiloh."},{"num":10,"verse":"¶ Then Joshua cast lots for them in Shiloh before the Lord, and there Joshua divided the land unto the children of Israel, according to their portions."},{"num":11,"verse":"¶ And the lot of the tribe of the children of Benjamin came forth according to their families, and the cost of their lot lay between the children of Judah, and the children of Joseph."},{"num":12,"verse":"And their coast on the North side was from Jordan, and the border went up to the side of Jericho on the North part, and went up through the mountains Westward, and the ends thereof are in the wilderness of Beth Aven:"},{"num":13,"verse":"And this border goeth along from thence to Luz, even to the South side of Luz (the same is Bethel) and this border descendeth to Ataroth Addar, near the mount that lieth on the South side of Beth Horon the nether."},{"num":14,"verse":"So the border turneth, and compasseth the corner of the Sea Southward, from the mount that lieth before Beth Horon Southward: and the ends thereof are at Kirjath Baal (which is Kirjath Jearim) a city of the children of Judah: this is the West quarter."},{"num":15,"verse":"And the South quarter is from the end of Kirjath Jearim, and this border goeth out Westward, and cometh to the fountain of waters of Nephtoah."},{"num":16,"verse":"And this border descendeth at the end of the mountain, that lieth before the valley of Ben Hinnom, which is in the valley of the giants Northward, and descendeth into the valley of Hinnom by the side of Jebus Southward, and goeth down to En Rogel,"},{"num":17,"verse":"And compasseth from the North, and goeth forth to En Shemesh, and stretcheth to Geliloth, which is toward the going up unto Adummim, and goeth down to the stone of Bohan the son of Reuben."},{"num":18,"verse":"So it goeth along to the side over against the plain Northward, and goeth down into the plain."},{"num":19,"verse":"After, this border goeth along to the side of Beth Hoglah Northward: and the ends thereof, that is, of the border, reach to the point of the salt Sea Northward, and to the end of Jordan Southward: this is the South coast."},{"num":20,"verse":"Also Jordan is the border of it on the East side: this is the inheritance of the children of Benjamin by the coasts thereof round about, according to their families."},{"num":21,"verse":"Now the cities of the tribe of the children of Benjamin, according to their families, are Jericho, and Beth Hoglah, and the valley of Keziz,"},{"num":22,"verse":"And Beth Arabah, and Zemaraim, and Bethel,"},{"num":23,"verse":"And Avim, and Parah, and Ophrah,"},{"num":24,"verse":"And Chephar, Haammoni, and Ophni, and Gaba: twelve cities with their villages:"},{"num":25,"verse":"Gibeon, and Ramah, and Beeroth,"},{"num":26,"verse":"And Mizpah, and Chephirah, and Mozah,"},{"num":27,"verse":"And Rekem, and Irpeel, and Taralah,"},{"num":28,"verse":"And Zelah, Eleph, and Jebus, (which is Jerusalem) Gibeath, and Kirjath: fourteen cities with their villages: this is the inheritance of the children of Benjamin, according to their families."}]