[{"num":11,"verse":"And Nahash the Ammonite went up and besieged Jabesh-gilead; and all the men of Jabesh said to Nahash, Make a treaty with us, and we will serve you."},{"num":2,"verse":"But Nahash the Ammonite told them, On this condition I will make a treaty with you, that I thrust out all your right eyes and thus lay disgrace on all Israel."},{"num":3,"verse":"The elders of Jabesh said to Nahash, Give us seven days’ time, that we may send messengers through all the territory of Israel. Then, if there is no man to save us, we will come out to you."},{"num":4,"verse":"Then messengers came to Gibeah of Saul and told the news in the ears of the people; and all the people wept aloud."},{"num":5,"verse":"Now Saul came out of the field after the oxen, and [he] said, What ails the people that they are weeping? And they told him the words of the men of Jabesh."},{"num":6,"verse":"The Spirit of God came mightily upon Saul when he heard those tidings, and his anger was greatly kindled."},{"num":7,"verse":"And he took a yoke of oxen and cut them in pieces and sent them throughout all the territory of Israel by the hands of messengers, saying, Whoever does not come forth after Saul and Samuel, so shall it be done to his oxen! And terror from the Lord fell on the people, and they came out with one consent."},{"num":8,"verse":"And he numbered them at Bezek, and the Israelites were 300,000 and the men of Judah 30,000."},{"num":9,"verse":"The messengers who came were told, Say to the men of Jabesh-gilead, Tomorrow, by the time the sun is hot, you shall have help. The messengers came and reported to the men of Jabesh, and they were glad."},{"num":10,"verse":"So the men of Jabesh said to Nahash, Tomorrow we will come out to you, and you may do to us all that seems good to you."},{"num":11,"verse":"The next day Saul put the men in three companies; and they came into the midst of the enemy’s camp in the [darkness of the] morning watch and slew the Ammonites until midday; and the survivors were scattered, so that no two of them remained together."},{"num":12,"verse":"The people said to Samuel, Who is he who said, Shall Saul reign over us? Bring the men, that we may put them to death."},{"num":13,"verse":"But Saul said, There shall not a man be put to death this day, for today the Lord has brought deliverance to Israel."},{"num":14,"verse":"Samuel said to the people, Come, let us go to Gilgal and there renew the kingdom."},{"num":15,"verse":"All the people went to Gilgal and there they made Saul king before the Lord. And there they sacrificed peace offerings before the Lord, and there Saul and all the men of Israel rejoiced greatly."}]