[{"header":"The End Has Come"},{"num":7,"verse":"A message from the Lord came to me. The Lord said, "},{"num":2,"verse":"“Son of man, I am the Lord and King. I say to the land of Israel, ‘The end has come! It has come on the four corners of the land. "},{"num":3,"verse":"The end has now come for you. I will pour out my anger on you. I will judge you based on how you have lived. I will pay you back for all your evil practices. I hate them."},{"num":4,"verse":"“ ‘I will not feel sorry for you. I will not spare you. You can be sure that I will pay you back for how you have lived. I will judge you for your evil practices. I hate them. You will know that I am the Lord.’"},{"num":5,"verse":"“I am the Lord and King. I say, ‘Horrible trouble is coming! No one has ever heard of anything like it. It is here!"},{"num":6,"verse":"“ ‘The end has come! The end has come! It has stirred itself up against you. It is here! "},{"num":7,"verse":"Death has come on you who live in the land. The time for you to be destroyed has come. The day when it will happen is near. There is no joy on your mountains. There is nothing but panic."},{"num":8,"verse":"“ ‘I am about to pour out all my great anger on you. I will judge you based on how you have lived. I will pay you back for all your evil practices. I hate them."},{"num":9,"verse":"“ ‘I will not feel sorry for you. I will not spare you. I will pay you back for how you have lived. I will judge you for your evil practices. I hate them. You will know that I am the one who strikes you down. I am the Lord."},{"num":10,"verse":"“ ‘The day for me to punish you is here! It is here! Death has arrived. The time is ripe for you to be judged. Your pride has grown so much that you will be destroyed. "},{"num":11,"verse":"Your mean and harmful acts have become like a rod. I will use it to punish those who do evil. None of them will be left. None of their wealth or anything of value will remain."},{"num":12,"verse":"“ ‘The time has come! The day has arrived! I will soon pour out my great anger on the whole crowd of you. Do not let the buyer be happy. Do not let the seller be sad. "},{"num":13,"verse":"The seller will not get back the land that was sold. That will be true as long as both the buyer and seller are alive."},{"num":14,"verse":"They have blown trumpets. They have made everything ready. But no one will go into battle. I will soon pour out my great anger on the whole crowd."},{"num":15,"verse":"“ ‘There is trouble everywhere. War is outside the city. Plague and hunger are inside it. Those out in the country will die in battle. Those in the city will be destroyed by hunger and plague. "},{"num":16,"verse":"All those who escape and are left alive will run to the mountains. They will sound like doves of the valley when they cry over their sins."},{"num":17,"verse":"“ ‘Their hands will be powerless to help them. They will wet themselves. "},{"num":18,"verse":"They will put on the rough clothing people wear when they’re sad. They will put on terror as if it were their clothes. Every face will be covered with shame. Every head will be shaved."},{"num":19,"verse":"“ ‘They will throw their silver into the streets. They will treat their gold like an “unclean” thing. Their silver and gold won’t be able to save them on the day I pour out my anger. It will not be able to satisfy their hunger. Their stomachs can’t be filled with it. Their silver and gold have tripped them up. It has made them fall into sin. "},{"num":20,"verse":"My people were so proud of their beautiful jewelry. They used it to make statues of their evil gods. I hate those gods. So I will turn their jewelry into an “unclean” thing for them."},{"num":21,"verse":"“ ‘I will hand over their wealth to outsiders. I will turn it over to sinful people in other countries. They will make it “unclean.” "},{"num":22,"verse":"I will turn my face away from my people. Robbers will make “unclean” the temple I love. They will enter it and make it “unclean.”"},{"num":23,"verse":"“ ‘Ezekiel, get ready to put my people in chains. The land is full of murderers. They are harming one another all over Jerusalem. "},{"num":24,"verse":"I will bring the most evil nations against them. They will take over the houses in the city. I will put an end to the pride of those who are mighty. Their holy places will be made “unclean.”"},{"num":25,"verse":"“ ‘When terror comes, they will look for peace. But there will not be any. "},{"num":26,"verse":"Trouble after trouble will come. One report will follow another. But they will not be true. The people will go searching for a vision from the prophets. But there will not be any. The teaching of the law by the priests will be gone. Advice from the elders will come to an end."},{"num":27,"verse":"“ ‘The king will be filled with sadness. The princes will lose all hope. The hands of the people of the land will tremble. I will punish them based on how they have lived. I will judge them by their own standards. Then they will know that I am the Lord.’ ”"}]