[{"header":"Vision of the Four Beasts"},{"num":7,"verse":"In the first year of Belshazzar king of Babylon, Daniel had a dream and visions of his head while on his bed. Then he wrote down the dream, telling the main facts."},{"num":2,"verse":"Daniel spoke, saying, “I saw in my vision by night, and behold, the four winds of heaven were stirring up the Great Sea. "},{"num":3,"verse":"And four great beasts came up from the sea, each different from the other. "},{"num":4,"verse":"The first was like a lion, and had eagle’s wings. I watched till its wings were plucked off; and it was lifted up from the earth and made to stand on two feet like a man, and a man’s heart was given to it."},{"num":5,"verse":"“And suddenly another beast, a second, like a bear. It was raised up on one side, and had three ribs in its mouth between its teeth. And they said thus to it: ‘Arise, devour much flesh!’"},{"num":6,"verse":"“After this I looked, and there was another, like a leopard, which had on its back four wings of a bird. The beast also had four heads, and dominion was given to it."},{"num":7,"verse":"“After this I saw in the night visions, and behold, a fourth beast, dreadful and terrible, exceedingly strong. It had huge iron teeth; it was devouring, breaking in pieces, and trampling the residue with its feet. It was different from all the beasts that were before it, and it had ten horns. "},{"num":8,"verse":"I was considering the horns, and there was another horn, a little one, coming up among them, before whom three of the first horns were plucked out by the roots. And there, in this horn, were eyes like the eyes of a man, and a mouth speaking pompous words."},{"header":"Vision of the Ancient of Days"},{"num":11,"verse":"“I watched then because of the sound of the pompous words which the horn was speaking; I watched till the beast was slain, and its body destroyed and given to the burning flame. "},{"num":12,"verse":"As for the rest of the beasts, they had their dominion taken away, yet their lives were prolonged for a season and a time."},{"header":"Daniel’s Visions Interpreted"},{"num":15,"verse":"“I, Daniel, was grieved in my spirit within my body, and the visions of my head troubled me. "},{"num":16,"verse":"I came near to one of those who stood by, and asked him the truth of all this. So he told me and made known to me the interpretation of these things: "},{"num":17,"verse":"‘Those great beasts, which are four, are four kings which arise out of the earth. "},{"num":18,"verse":"But the saints of the Most High shall receive the kingdom, and possess the kingdom forever, even forever and ever.’"},{"num":19,"verse":"“Then I wished to know the truth about the fourth beast, which was different from all the others, exceedingly dreadful, with its teeth of iron and its nails of bronze, which devoured, broke in pieces, and trampled the residue with its feet; "},{"num":20,"verse":"and the ten horns that were on its head, and the other horn which came up, before which three fell, namely, that horn which had eyes and a mouth which spoke pompous words, whose appearance was greater than his fellows."},{"num":21,"verse":"“I was watching; and the same horn was making war against the saints, and prevailing against them, "},{"num":22,"verse":"until the Ancient of Days came, and a judgment was made in favor of the saints of the Most High, and the time came for the saints to possess the kingdom."},{"num":23,"verse":"“Thus he said:"},{"num":28,"verse":"“This is the end of the account. As for me, Daniel, my thoughts greatly troubled me, and my countenance changed; but I kept the matter in my heart.”"}]