[{"num":7,"verse":"In the first year of Belshatzar melech Babylon, Daniel saw a dream and visions of his head upon his bed; then he wrote down the dream, and the sum of the matters he related."},{"num":2,"verse":"Daniel answered and said, I saw in my vision that came by night, and, hinei, the arbah ruchot (four winds) of Shomayim burst forth upon the yam hagadol (great sea)."},{"num":3,"verse":"And four chayyot hagedolot (great beasts) came up from the yam, different one from another."},{"num":4,"verse":"Harishonah (the first) was like an arye (lion), and had eagle’s wings. I was beholding until its wings were plucked off, and it was lifted up from ha’aretz, and was made to stand upon two feet like a man, and a man’s lev was given to it [see Daniel 4:34 (4:31)]."},{"num":5,"verse":"And hinei another beast, a second, like a bear, and it was raised up on one side, and three ribs were in its mouth between its teeth; and it was said thus unto it, Arise, devour much basar (flesh)."},{"num":6,"verse":"After this I beheld, and hinei another, like a leopard, which had upon its sides four wings of a bird; the beast had also arba’ah rashim (four heads) and dominion was given to it."},{"num":7,"verse":"After this I saw in the night visions, and hinei a fourth Chayyah (Beast), dreadful and terrible, and strong exceedingly; and it had great iron teeth; it was devouring and crushing, and trampling the residue with its feet; and it was different from all the beasts that were before it, and it had eser karnayim (ten horns)."},{"num":8,"verse":"I was contemplating the karnayim (horns), and, hinei, there came up among them another keren (horn), a little one, before whom there were three of the first karnayim plucked up by the roots; and, hinei, in this keren were eyes like the eyes of man, and a mouth speaking great things."},{"num":9,"verse":"I was beholding until kisot (thrones) were placed, and the Atik Yomin (Ancient of Days, i.e., Hashem) did sit, whose raiment was like white snow, and the hair of His rosh like pure wool; His kes (throne) was like the fiery flames, and its wheels like burning eish."},{"num":10,"verse":"A river of eish was flowing and came forth from before Him; thousand thousands ministered unto Him, and ten thousand times ten thousand stood before Him; the court sat, and the sfarim (books) were opened."},{"num":11,"verse":"I was beholding from (the time of) the voice of the arrogant words which the keren [Anti-Moshiach] spoke, I was beholding even till the Chayyah (Beast) was slain, and his body destroyed, and given to the burning eish."},{"num":12,"verse":"As concerning the rest of the beasts, their dominion was taken away, yet their lives were prolonged for a time and a season."},{"num":13,"verse":"I was beholding in visions of the night, and, hinei, one like a Bar Enosh (Ben Adam, i.e., Moshiach) came with the clouds of Shomayim, and came to the Atik Yomin (Ancient of Days, i.e., Hashem), and before Him He was brought."},{"num":14,"verse":"And there was given Him (Moshiach) dominion, and honor, and sovereignty, that all people, Goyim, tongues, should pey-lammed-chet (see Dan 3:12, serve, reverence as deity Him (Moshiach). His dominion is an everlasting dominion, which shall not pass away, and His (Messianic) Kingdom that which shall not be destroyed."},{"num":15,"verse":"As for me, Daniel, my ruach was anxious in the midst of my body, and the visions of my head were troubling me."},{"num":16,"verse":"I drew near to one of the attendants to ask him the certainty concerning all this; and he said to me that he would make me to have da’as of the pesher (interpretation) of the things."},{"num":17,"verse":"These chayyot hagedolot (great beasts), which are arbah (four), are four melachim, which shall arise out of ha’aretz."},{"num":18,"verse":"But the kadoshim Elyon (holy ones of the Most High) shall receive the Kingdom, and shall possess the Kingdom forever, even forever and ever."},{"num":19,"verse":"Then I desired to make sure concerning the fourth Chayyah (Beast), which was different from all the others, exceeding dreadful, whose teeth were of iron, and its claws brass; it was devouring, crushing, and stamped the residue with its feet;"},{"num":20,"verse":"And concerning the eser karnayim (ten horns) that were in its head, and of the other which came up, and before whom three fell, even of that horn (Anti-Moshiach) that had eyes, and a mouth that spoke arrogant things, which seemed greater than the others."},{"num":21,"verse":"I was beholding, and the same keren (horn, Anti-Moshiach) made war against the kadoshim, and prevailed against them;"},{"num":22,"verse":"Until the Atik Yomin (Ancient of Days, Hashem) came, and judgment was given for the kadoshim Elyon; and the time came that the kadoshim possessed the Kingdom."},{"num":23,"verse":"This is what he said: The fourth Chayyah (Beast) shall be a fourth kingdom upon earth, which shall be different from all kingdoms, and shall devour kol ha’aretz, and shall tread it down, and break it in pieces."},{"num":24,"verse":"And the eser karnayim (ten horns) out of this kingdom are asarah melachim (ten kings) that shall arise, and another shall arise after them; and he shall be different from the first, and he shall subdue three melachim."},{"num":25,"verse":"And he (Anti-Moshiach) shall speak great words against Elyon, and shall wear out the kadoshim Elyon, and think to change set times and law, and they shall be given into his hand until a time and times and half a time."},{"num":26,"verse":"But judgment was given, and there was taken away its [Anti-Moshiach’s] power to destroy and to annihilate unto the end."},{"num":27,"verse":"And the dominion and sovereignty, and greatness of the kingdom under kol HaShomayim, shall be given to the people of the kadoshim Elyon, whose kingdom is a malchut olam (an everlasting kingdom), and all dominions shall serve and obey them."},{"num":28,"verse":"Unto this point is the end of the matter. As for me, Daniel, my thoughts much troubled me, and the color of my countenance changed upon me, but I kept the matter in my lev. [T.N. Chanukah remembers the restored and re-dedicated worship in Jerusalem 164 B.C.E. after the Anti-Moshiachlike activities of Antiochus Epiphanes predicted in chp 8 below.]"}]