[{"header":"Land for Judah"},{"num":15,"verse":"The land that was given to the tribe of Judah was divided among all the family groups. It went all the way to the Desert of Zin in the far south, at the border of Edom."},{"num":2,"verse":"The southern border of Judah’s land started at the south end of the Dead Sea. "},{"num":3,"verse":"It went south of Scorpion Pass to Zin. From there it passed to the south of Kadesh Barnea. It continued past Hezron to Addar. From Addar it turned and went to Karka. "},{"num":4,"verse":"It continued to Azmon, the brook of Egypt and then to the Mediterranean Sea. This was the southern border."},{"num":5,"verse":"The eastern border was the shore of the Dead Sea. It went as far as the area where the Jordan River flowed into the sea."},{"num":6,"verse":"Then it went to Beth Hoglah and continued north of Beth Arabah. It continued to the stone of Bohan. Bohan was the son of Reuben. "},{"num":7,"verse":"Then the northern border went through the Valley of Achor to Debir. There it turned toward the north and went to Gilgal. Gilgal is across from the road that goes through the mountain of Adummim. It is on the south side of the ravine. The border continued along the waters of En Shemesh. It stopped at En Rogel. "},{"num":8,"verse":"Then it went through the Valley of Ben Hinnom. This is next to the southern side of the Jebusite city. (That city was called Jerusalem.) There the border went to the top of the hill on the west side of Hinnom Valley. This was at the northern end of the Valley of Giants. "},{"num":9,"verse":"From there it went to the spring of the Waters of Nephtoah. Then it went to the cities near Mount Ephron. There it turned and went toward Baalah. (Baalah is also called Kiriath Jearim.) "},{"num":10,"verse":"At Baalah the border turned west and went toward Mount Edom. It continued along the north side of Mount Jearim (also called Kesalon) and came to Beth Shemesh. From there it went past Timnah. "},{"num":11,"verse":"Then it went to the hill north of Ekron. From there it turned toward Shikkeron and went past Mount Baalah. It continued on to Jabneel and ended at the sea."},{"num":12,"verse":"The Mediterranean Sea was the western border. Inside these borders lived the family groups of Judah."},{"num":13,"verse":"The Lord had commanded Joshua to give Caleb son of Jephunneh part of the land in Judah. So he gave Caleb the land God had commanded. He gave him the town of Kiriath Arba, also called Hebron. (Arba was the father of Anak.) "},{"num":14,"verse":"Caleb forced out the three Anakite families living in Hebron. Those families were Sheshai, Ahiman and Talmai. They were descendants of Anak. "},{"num":15,"verse":"Then he fought against the people living in Debir. (In the past Debir had been called Kiriath Sepher.) "},{"num":16,"verse":"Caleb said, “I want a man to attack and capture Kiriath Sepher. I will give him Acsah, my daughter, as a wife.” "},{"num":17,"verse":"Othniel son of Kenaz defeated the city. So Caleb gave his daughter Acsah to Othniel to be his wife. "},{"num":18,"verse":"Acsah wanted Othniel to ask her father Caleb for more land."},{"num":19,"verse":"Acsah answered, “I would like a special favor. The land you gave me is very dry. So also give me land with springs of water on it.”"},{"num":20,"verse":"The tribe of Judah got the land God had promised them. Each family group got part of the land."},{"num":21,"verse":"The tribe of Judah got all the towns in the southern part of Canaan. These towns were near the border of Edom. Here is a list of the towns: Kabzeel, Eder, Jagur, "},{"num":22,"verse":"Kinah, Dimonah, Adadah, "},{"num":23,"verse":"Kedesh, Hazor and Ithnan; "},{"num":24,"verse":"Ziph, Telem, Bealoth, "},{"num":25,"verse":"Hazor Hadattah and Kerioth Hezron (also called Hazor); "},{"num":26,"verse":"Amam, Shema, Moladah, "},{"num":27,"verse":"Hazar Gaddah, Heshmon and Beth Pelet; "},{"num":28,"verse":"Hazar Shual, Beersheba, Biziothiah, "},{"num":29,"verse":"Baalah, Iim, Ezem, "},{"num":30,"verse":"Eltolad, Kesil and Hormah; "},{"num":31,"verse":"Ziklag, Madmannah, Sansannah, "},{"num":32,"verse":"Lebaoth, Shilhim, Ain and Rimmon. There were 29 towns and all their fields."},{"num":33,"verse":"The tribe of Judah got these towns in the western mountain slopes: Eshtaol, Zorah, Ashnah, "},{"num":34,"verse":"Zanoah, En Gannim, Tappuah and Enam; "},{"num":35,"verse":"Jarmuth, Adullam, Socoh, Azekah, "},{"num":36,"verse":"Shaaraim, Adithaim and Gederah (also called Gederothaim). There were 14 towns and all their fields."},{"num":37,"verse":"Judah was also given these towns in the western mountain slopes: Zenan, Hadashah, Migdal Gad, "},{"num":38,"verse":"Dilean, Mizpah, Joktheel, "},{"num":39,"verse":"Lachish, Bozkath and Eglon; "},{"num":40,"verse":"Cabbon, Lahmas, Kitlish, "},{"num":41,"verse":"Gederoth, Beth Dagon, Naamah and Makkedah. There were 16 towns and all their fields."},{"num":42,"verse":"Judah was also given these towns in the western mountain slopes: Libnah, Ether, Ashan, "},{"num":43,"verse":"Iphtah, Ashnah, Nezib, "},{"num":44,"verse":"Keilah, Aczib and Mareshah. There were nine towns and all their fields."},{"num":45,"verse":"The tribe of Judah also got the town of Ekron and all the small towns and fields near it. "},{"num":46,"verse":"They also got the area west of Ekron and all the fields and towns near Ashdod. "},{"num":47,"verse":"Ashdod and all the small towns around it were part of the land of Judah. They also got the fields and towns around Gaza. Their land continued to the brook of Egypt. And it went on along the coast of the Mediterranean Sea."},{"num":48,"verse":"The tribe of Judah was also given these towns in the mountains: Shamir, Jattir, Socoh, "},{"num":49,"verse":"Dannah and Kiriath Sannah (also called Debir); "},{"num":50,"verse":"Anab, Eshtemoh, Anim, "},{"num":51,"verse":"Goshen, Holon and Giloh. There were 11 towns and all their fields."},{"num":52,"verse":"They were also given these towns in the mountains: Arab, Dumah, Eshan, "},{"num":53,"verse":"Janim, Beth Tappuah and Aphekah; "},{"num":54,"verse":"Humtah, Kiriath Arba (also called Hebron) and Zior. There were 9 towns and all their fields."},{"num":55,"verse":"Judah was also given these towns in the mountains: Maon, Carmel, Ziph, Juttah, "},{"num":56,"verse":"Jezreel, Jokdeam, Zanoah, "},{"num":57,"verse":"Kain, Gibeah and Timnah. There were 10 towns and all their fields."},{"num":58,"verse":"They were also given these towns in the mountains: Halhul, Beth Zur, Gedor, "},{"num":59,"verse":"Maarath, Beth Anoth and Eltekon. There were 6 towns and all their fields."},{"num":60,"verse":"The people of Judah were also given the 2 towns of Rabbah and Kiriath Baal (also called Kiriath Jearim)."},{"num":61,"verse":"Judah was given towns in the desert. Here are those towns: Beth Arabah, Middin, Secacah, "},{"num":62,"verse":"Nibshan, the City of Salt and En Gedi. There were 6 towns and all their fields."},{"num":63,"verse":"The army of Judah was not able to force out the Jebusites living in Jerusalem. So the Jebusites still live among the people of Judah in Jerusalem to this day."}]