[[],[{"type":"header","content":"The Daily Offerings"},{"type":"prose","content":"The LORD said to Moses,"}],[{"type":"prose","content":"“Give these instructions to the people of Israel: The offerings you present as special gifts are a pleasing aroma to me; they are my food. See to it that they are brought at the appointed times and offered according to my instructions."}],[{"type":"prose","content":"“Say to the people: This is the special gift you must present to the LORD as your daily burnt offering. You must offer two one-year-old male lambs with no defects."}],[{"type":"prose","content":"Sacrifice one lamb in the morning and the other in the evening."}],[{"type":"prose","content":"With each lamb you must offer a grain offering of two quarts of choice flour mixed with one quart of pure oil of pressed olives."}],[{"type":"prose","content":"This is the regular burnt offering instituted at Mount Sinai as a special gift, a pleasing aroma to the LORD."}],[{"type":"prose","content":"Along with it you must present the proper liquid offering of one quart of alcoholic drink with each lamb, poured out in the Holy Place as an offering to the LORD."}],[{"type":"prose","content":"Offer the second lamb in the evening with the same grain offering and liquid offering. It, too, is a special gift, a pleasing aroma to the LORD."}],[{"type":"header","content":"The Sabbath Offerings"},{"type":"prose","content":"“On the Sabbath day, sacrifice two one-year-old male lambs with no defects. They must be accompanied by a grain offering of four quarts of choice flour moistened with olive oil, and a liquid offering."}],[{"type":"prose","content":"This is the burnt offering to be presented each Sabbath day, in addition to the regular burnt offering and its accompanying liquid offering."}],[{"type":"header","content":"The Monthly Offerings"},{"type":"prose","content":"“On the first day of each month, present an extra burnt offering to the LORD of two young bulls, one ram, and seven one-year-old male lambs, all with no defects."}],[{"type":"prose","content":"These must be accompanied by grain offerings of choice flour moistened with olive oil—six quarts with each bull, four quarts with the ram,"}],[{"type":"prose","content":"and two quarts with each lamb. This burnt offering will be a special gift, a pleasing aroma to the LORD."}],[{"type":"prose","content":"You must also present a liquid offering with each sacrifice: two quarts of wine for each bull, a third of a gallon for the ram, and one quart for each lamb. Present this monthly burnt offering on the first day of each month throughout the year."}],[{"type":"prose","content":"“On the first day of each month, you must also offer one male goat for a sin offering to the LORD. This is in addition to the regular burnt offering and its accompanying liquid offering."}],[{"type":"header","content":"Offerings for the Passover"},{"type":"prose","content":"“On the fourteenth day of the first month, you must celebrate the LORD’s Passover."}],[{"type":"prose","content":"On the following day—the fifteenth day of the month—a joyous, seven-day festival will begin, but no bread made with yeast may be eaten."}],[{"type":"prose","content":"The first day of the festival will be an official day for holy assembly, and no ordinary work may be done on that day."}],[{"type":"prose","content":"As a special gift you must present a burnt offering to the LORD—two young bulls, one ram, and seven one-year-old male lambs, all with no defects."}],[{"type":"prose","content":"These will be accompanied by grain offerings of choice flour moistened with olive oil—six quarts with each bull, four quarts with the ram,"}],[{"type":"prose","content":"and two quarts with each of the seven lambs."}],[{"type":"prose","content":"You must also offer a male goat as a sin offering to purify yourselves and make yourselves right with the LORD."}],[{"type":"prose","content":"Present these offerings in addition to your regular morning burnt offering."}],[{"type":"prose","content":"On each of the seven days of the festival, this is how you must prepare the food offering that is presented as a special gift, a pleasing aroma to the LORD. These will be offered in addition to the regular burnt offerings and liquid offerings."}],[{"type":"prose","content":"The seventh day of the festival will be another official day for holy assembly, and no ordinary work may be done on that day."}],[{"type":"header","content":"Offerings for the Festival of Harvest"},{"type":"prose","content":"“At the Festival of Harvest, when you present the first of your new grain to the LORD, you must call an official day for holy assembly, and you may do no ordinary work on that day."}],[{"type":"prose","content":"Present a special burnt offering on that day as a pleasing aroma to the LORD. It will consist of two young bulls, one ram, and seven one-year-old male lambs."}],[{"type":"prose","content":"These will be accompanied by grain offerings of choice flour moistened with olive oil—six quarts with each bull, four quarts with the ram,"}],[{"type":"prose","content":"and two quarts with each of the seven lambs."}],[{"type":"prose","content":"Also, offer one male goat to purify yourselves and make yourselves right with the LORD."}],[{"type":"prose","content":"Prepare these special burnt offerings, along with their liquid offerings, in addition to the regular burnt offering and its accompanying grain offering. Be sure that all the animals you sacrifice have no defects."}]]