[{"header":"Israel Destroys the Town of Ai"},{"num":1,"verse":"The Lord told Joshua:"},{"num":3,"verse":"Joshua quickly got the army ready to attack Ai. He chose thirty thousand of his best soldiers and gave them these orders:"},{"num":10,"verse":"Early the next morning he got his troops ready to move out, and he and the other leaders of Israel led them to Ai. "},{"num":11,"verse":"They set up camp in full view of the town, across the valley to the north. "},{"num":12,"verse":"Joshua had already sent five thousand soldiers to the west side of the town to hide and wait to attack. "},{"num":13,"verse":"Now all his troops were in place. Part of the army was in the camp to the north of Ai, and the others were hiding to the west, ready to make a surprise attack. That night, Joshua went into the valley."},{"num":14,"verse":"The king of Ai saw Joshua’s army, so the king and his troops hurried out early the next morning to fight them. Joshua and his army pretended to be beaten, and they let the men of Ai chase them toward the desert. The king and his army were facing the Jordan valley as Joshua had planned."},{"num":16,"verse":"So he called out every man in Ai to go after Joshua’s troops. They all rushed out to chase the Israelite army, and they left the town gates wide open. Not one man was left in Ai or in Bethel."},{"num":18,"verse":"Finally, the Lord told Joshua, “Point your sword at the town of Ai, because now I am going to help you defeat it!”"},{"num":19,"verse":"the soldiers who had been hiding got up and ran into the town. They captured it and set it on fire."},{"num":20,"verse":"When Joshua and his troops saw smoke rising from the town, they knew that the other part of their army had captured it. So they turned and attacked."},{"num":22,"verse":"Meanwhile, the other Israelite soldiers had come from the town and attacked the men of Ai from the rear. The Israelites captured the king of Ai and brought him to Joshua. They also chased the rest of the men of Ai into the desert and killed them."},{"num":25,"verse":"Joshua kept his sword pointed at the town of Ai until every last one of Ai’s twelve thousand people was dead. "},{"num":27,"verse":"But the Israelites took the animals and the other possessions of the people of Ai, because this was what the Lord had told Joshua to do."},{"num":28,"verse":"Joshua made sure every building in Ai was burned to the ground. He told his men to kill the king of Ai and hang his body on a tree. Then at sunset he told the Israelites to take down the body, throw it in the gateway of the town, and cover it with a big pile of rocks. Those rocks are still there, and the town itself has never been rebuilt."},{"header":"Joshua Reads the Blessings and Curses"},{"num":30,"verse":"One day, Joshua led the people of Israel to Mount Ebal, where he told some of his men, “Build an altar for offering sacrifices to the Lord. And use stones that have never been cut with iron tools, because that is what Moses taught in The Book of the Law.”"},{"num":33,"verse":"Moses had said that everyone in Israel was to go to the valley between Mount Ebal and Mount Gerizim, where they were to be blessed. So everyone went there, including the foreigners, the leaders, officials, and judges. Half of the people stood on one side of the valley, and half on the other side, with the priests from the Levi tribe standing in the middle with the sacred chest. Then in a loud voice, Joshua read the blessings and curses from The Book of the Law of Moses."}]