[{"header":"Israel Destroys Ai"},{"num":8,"verse":"Then the Lord said to Joshua, “Do not be afraid. Do not lose hope. Go up and attack Ai. Take the whole army with you. I have handed the king of Ai over to you. I have given you his people, his city and his land. "},{"num":2,"verse":"Remember what you did to Jericho and its king. You will do the same thing to Ai and its king. But this time you can keep for yourselves the livestock and everything else you take from them. Have some of your fighting men hide behind the city and take them by surprise.”"},{"num":3,"verse":"So Joshua and the whole army moved out to attack Ai. He chose 30,000 of his best fighting men. He sent them out at night. "},{"num":4,"verse":"He gave them orders. He said, “Listen carefully to what I’m saying. You must hide behind the city. Don’t go very far away from it. All of you must be ready to attack it. "},{"num":5,"verse":"I and all those with me will march up to the city. The men of Ai will come out to fight against us, just as they did before. Then we’ll run away from them. "},{"num":6,"verse":"They’ll chase us until we’ve drawn them away from the city. They’ll say, ‘They are running away from us, just as they did before.’ When we run away from them, "},{"num":7,"verse":"come out of your hiding place. Capture the city. The Lord your God will hand it over to you. "},{"num":8,"verse":"When you have taken it, set it on fire. Do what the Lord has commanded. Make sure you obey my orders.”"},{"num":9,"verse":"Then Joshua sent them away. They went to the place where they had planned to hide. They hid in a place west of Ai. It was between Bethel and Ai. But Joshua spent that night with his troops."},{"num":10,"verse":"Early the next morning Joshua brought together his army. He and the leaders of Israel marched in front of them to Ai. "},{"num":11,"verse":"The whole army that was with him marched up to the city. They stopped in front of it. They set up camp north of Ai. There was a valley between them and the city. "},{"num":12,"verse":"Joshua had chosen about 5,000 soldiers. He had ordered them to hide in a place west of Ai. It was between Bethel and Ai. "},{"num":13,"verse":"The men took up their battle positions. All the men in the camp north of the city took up their positions. So did those who were supposed to hide west of the city. That night Joshua went into the valley."},{"num":14,"verse":"The king of Ai saw what the troops with Joshua were doing. So the king and all his men hurried out of the city early in the morning. They marched out to meet Israel in battle. They went to a place that looked out over the Arabah Valley. The king didn’t know that some of Israel’s fighting men were hiding behind the city. "},{"num":15,"verse":"Joshua and all his men let the men of Ai drive them back. The Israelites ran away toward the desert. "},{"num":16,"verse":"All the men of Ai were called out to chase them. They chased Joshua. So they were drawn away from the city. "},{"num":17,"verse":"Not even one man remained in Ai or Bethel. All of them went out to chase Israel. When they did, they left the city wide open."},{"num":18,"verse":"Then the Lord said to Joshua, “Hold out toward Ai the javelin that is in your hand. I will give the city to you.” So Joshua held out toward the city the javelin in his hand. "},{"num":19,"verse":"As soon as he did, the men hiding behind the city got up quickly. They came out of their hiding places and rushed forward. They entered the city and captured it. They quickly set it on fire."},{"num":20,"verse":"The men of Ai looked back. They saw smoke rising up from the city into the sky. But they couldn’t escape in any direction. The Israelites had been running away toward the desert. But now they turned around to face those chasing them. "},{"num":21,"verse":"Joshua and all his men saw that the men who had been hiding behind the city had captured it. They also saw that smoke was going up from it. So they turned around and attacked the men of Ai. "},{"num":22,"verse":"The men who had set Ai on fire came out of the city. They also fought against the men of Ai. So the men of Ai were caught in the middle. The army of Israel was on both sides of them. Israel struck them down. They didn’t let anyone remain alive or get away. "},{"num":23,"verse":"But they captured the king of Ai alive. They brought him to Joshua."},{"num":24,"verse":"Israel finished killing all the men of Ai. They destroyed them in the fields and in the desert where they had chased them. They struck down every one of them with their swords. Then all the Israelites returned to Ai. And they killed those who were left in it. "},{"num":25,"verse":"The total number of men and women they killed that day was 12,000. The Israelites put to death all the people of Ai. "},{"num":26,"verse":"Joshua continued to hold out his javelin toward Ai. He didn’t lower his hand until he and his men had totally destroyed everyone who lived there. "},{"num":27,"verse":"But this time Israel kept for themselves the livestock and everything else they had taken from the city. The Lord had directed Joshua to let them do it."},{"num":28,"verse":"So Joshua burned down Ai. He tore it down so it could never be built again. It has been deserted to this very day. "},{"num":29,"verse":"Joshua killed the king of Ai. He stuck a pole through the body. Then he set it up where people could see it. He left it there until evening. At sunset, Joshua ordered his men to remove the body from the pole. He told them to throw the body down at the entrance of the city gate. They put a large pile of rocks over the body. That pile is still there to this day."},{"header":"Joshua Reads the Book of the Law to the People"},{"num":30,"verse":"Joshua built an altar to honor the Lord, the God of Israel. He built it on Mount Ebal. "},{"num":31,"verse":"Moses, the servant of the Lord, had commanded the Israelites to do that. Joshua built the altar according to what is written in the Book of the Law of Moses. Joshua built the altar out of stones that iron tools had never touched. Then the people offered on the altar burnt offerings to the Lord. They also sacrificed friendship offerings on it. "},{"num":32,"verse":"Joshua copied the law of Moses on stones. He did it while all the Israelites were watching. "},{"num":33,"verse":"They were standing on both sides of the ark of the covenant of the Lord. All the Israelites, including outsiders and citizens, were there. Israel’s elders, officials and judges were also there. All of them faced the priests, who were Levites. They were carrying the ark. Half of the people stood in front of Mount Gerizim. The other half stood in front of Mount Ebal. Moses, the servant of the Lord, had earlier told them to do it. Moses told them to do it when he had given directions to bless the Israelites."},{"num":34,"verse":"Then Joshua read all the words of the law out loud. He read the blessings and the curses. He read them just as they are written in the Book of the Law. "},{"num":35,"verse":"Joshua read every word Moses had commanded. He read them to the whole community of Israel. That included the women and children. It also included the outsiders living among them."}]