[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the priests consented.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—No doubt they made some such explanation as is suggested in the Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Kings 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by way of clearing themselves from the suspicion of fraud; after which, they agreed to resign all connection with the business.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-16 It is a great mercy to young people, especially to all young men of rank, like Jehoash, to have those about them who will instruct them to do what is right in the sight of the Lord; and they do wisely and well for themselves, when willing to be counselled and ruled. The temple was out of repair; Jehoash orders the repair of the temple. The king was zealous. God requires those who have power, to use it for the support of religion, the redress of grievances, and repairing of decays. The king employed the priests to manage, as most likely to be hearty in the work. But nothing was done effectually till the twenty-third year of his reign. Another method was therefore taken. When public distributions are made faithfully, public contributions will be made cheerfully. While they were getting all they could for the repair of the temple, they did not break in upon the stated maintenance of the priests. Let not the servants of the temple be starved, under colour of repairing the breaches of it. Those that were intrusted did the business carefully and faithfully. They did not lay it out in ornaments for the temple, till the other work was completed; hence we may learn, in all our expenses, to prefer that which is most needful, and, in dealing for the public, to deal as we would for ourselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "No money had for some time been brought in (marginal reference \"g\"). Perhaps it was difficult for the priests and Levites to know exactly what proportion of the money paid to them was fairly applicable to the temple service and to their own support; and what, consequently, was the balance which they ought to apply to the repairs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7-10. Why repair ye not the breaches of the house?—This mode of collection not proving so productive as was expected (the dilatoriness of the priests was the chief cause of the failure), a new arrangement was proposed. A chest was placed by the high priest at the entrance into the temple, into which the money given by the people for the repairs of the temple was to be put by the Levites who kept the door. The object of this chest was to make a separation between the money to be raised for the building from the other moneys destined for the general use of the priests, in the hope that the people would be more liberal in their contributions when it was known that their offerings would be devoted to the special purpose of making the necessary repairs. The duty of attending to this work was no longer to devolve on the priests, but to be undertaken by the king.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Nor to take the charge of that work which the king had committed unto them, but freely to resign it to whom the king should appoint. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the priests consented to receive no more money of the people,.... And delivered up what they had: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither to repair the breaches of the house; being very willing to be stop both services, and especially since they seemed to be suspected. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither to repair the breaches of the house; being very willing to be stop both services, and especially since they seemed to be suspected. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the priests consented to receive no more money of the people, neither to repair the breaches of the house.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the priests consented to receive no",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " more ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "money … neither to repair",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that they should take no more money … neither repair",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They had clearly found the work beyond them, and were glad to be relieved both of the collection and the laying out of the fund. This consent of theirs is not alluded to by the Chronicler.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the priests consented to receive no more money of the people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to put an end to the local collections ordered in ver. 5 - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "neither to repair the breaches of the house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " neither to be responsible severally for laying out the money which they collected in repairs. 2 Kings 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But when the twenty-third year of the reign of Joash arrived, and the dilapidations had not been repaired, the king laid the matter before the high priest Jehoiada and the priests, and directed them not to take the money any more from their acquaintance, but to give it for the dilapidations of the temple; \"and the priests consented to take no money, and not to repair the dilapidations of the house,\" i.e., not to take charge of the repairs. We may see from this consent how the command of the king is to be understood. Hitherto the priests had collected the money to pay for the repairing of the temple; but inasmuch as they had not executed the repairs, the king took away from them both the collection of the money and the obligation to repair the temple. The reason for the failure of the first measure is not mentioned in our text, and can only be inferred from the new arrangement made by the king (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"Jehoiada took a chest-of course by the command of the king, as is expressly mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 24:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - bored a hole in the door (the lid) thereof, and placed it by the side of the altar (of burnt-offering) on the right by the entrance of every one into the house of Jehovah, that the priests keeping the threshold might put thither (i.e., into the chest) all the money that was brought into the house of Jehovah.\" ",
        "children": []
      }
    ]
  }
]