[{"num":14,"verse":"Abijah lay down with his ancestors and was buried in David’s City. His son Asa succeeded him as king."},{"header":"Asa rules Judah"},{"num":2,"verse":" Asa did what was right and good in the Lord his God’s eyes."},{"num":3,"verse":"He removed the foreign altars and shrines, smashed the sacred pillars, cut down the sacred poles,"},{"num":4,"verse":"and urged Judah to seek the Lord, the God of their ancestors, by doing what the Instruction and the commandments required."},{"num":5,"verse":"He also removed the shrines and incense altars from all the cities of Judah so that the kingdom was at peace under him."},{"num":6,"verse":"When the land was at peace, he built fortified cities in Judah; there was no war in those years because the Lord had given him rest."},{"num":7,"verse":"“Let’s build up these cities,” Asa told Judah. “We’ll surround them with walls, towers, gates, and crossbars while the land is still ours, because we sought the Lord our God and he sought us and surrounded us with rest.” As a result, the people successfully completed their building projects."},{"header":"Judah defeats Cush"},{"num":8,"verse":"Asa had an army of three hundred thousand Judeans armed with body-sized shields and spears and another two hundred eighty thousand from Benjamin armed with small shields and bows. All were brave warriors."},{"num":9,"verse":"Zerah the Cushite marched against him with an army of one million men and three hundred chariots. When he got as far as Mareshah,"},{"num":10,"verse":"Asa marched against him, setting up for battle in a valley north of Mareshah."},{"num":11,"verse":"Then Asa cried out to the Lord his God, “Lord, only you can help the weak against the powerful. Help us, Lord our God, because we rely on you and we have marched against this multitude in your name. You are the Lord our God. Don’t let a mere human stand against you!”"},{"num":12,"verse":"So the Lord struck the Cushites before Asa and Judah, and the Cushites fled."},{"num":13,"verse":"Asa and his troops chased them as far as Gerar. The Cushites fell until there were no survivors. They were completely crushed by the Lord and his army, who carried off a huge amount of loot,"},{"num":14,"verse":"and attacked all the cities surrounding Gerar who were terrified of the Lord. They plundered all these cities as well because there was a great amount of loot in them."},{"num":15,"verse":"They also attacked the herdsmen’s camps, taking many sheep and camels before returning to Jerusalem."}]