[{"num":14,"verse":"Abijah rested with his fathers and was buried in the City of David. His son Asa became king in his place. In his days the land was quiet for ten years."},{"header":"Asa King of Judah"},{"num":2,"verse":"Asa did what was good and right in the eyes of the Lord his God. "},{"num":3,"verse":"He removed the foreign altars and the high places. He demolished the sacred memorial stones and chopped down the Asherah poles. "},{"num":4,"verse":"He told Judah to seek the Lord, the God of their fathers, and to obey his law and command. "},{"num":5,"verse":"He removed the high places and the sun pillars from all the cities of Judah. The kingdom enjoyed peace and quiet under him."},{"num":6,"verse":"He built fortified cities in Judah because the land was quiet. He had no wars in those years because the Lord gave him rest."},{"num":7,"verse":"Asa said to Judah, “We will build these cities and surround them with walls, towers, and barred gates. The land before us is still ours, because we have sought the Lord our God. We sought him, and he has given us peace all around.”"},{"num":8,"verse":"Asa had an army of three hundred thousand men from Judah, who carried large shields and spears, and two hundred eighty thousand men from Benjamin, who carried shields and were armed with bows. These were all strong, powerful warriors."},{"num":9,"verse":"Zerah the Cushite came out against them with an army of a million men and three hundred chariots and advanced as far as Mareshah. "},{"num":10,"verse":"Asa went out to confront him, and they formed battle lines in the Valley of Zephathah at Mareshah."},{"num":11,"verse":"Asa cried to the Lord his God, “Lord, there is no one except you to help the powerless against the mighty. Help us, O Lord our God, because we rely on you, and in your name we have come against this horde. Lord, you are our God. Men will not prevail against you.”"},{"num":12,"verse":"The Lord defeated the Cushites before Asa and Judah, and the Cushites fled. "},{"num":13,"verse":"Asa and the people who were with him pursued them as far as Gerar. The Cushites fell until none of them were left alive, because they were broken before the Lord and before his army, who carried away a large amount of plunder. "},{"num":14,"verse":"They struck all the cities around Gerar, because the dread of the Lord was upon them. They looted all the cities because there was a great deal of plunder in them. "},{"num":15,"verse":"Also they struck the tents of the herdsmen and carried off very many sheep and camels. Then they returned to Jerusalem."}]