[{"header":"Chapter 14"},{"num":1,"verse":"Asa the Reformer. Asa did what was good and righteous in the eyes of the Lord, his God."},{"num":2,"verse":"He destroyed the foreign altars and the high places, smashed to pieces the sacred pillars, and cut down the sacred poles."},{"num":3,"verse":"He further commanded Judah to seek the Lord, the God of their ancestors, and to obey his laws and his commandments."},{"num":4,"verse":"Throughout all the cities of Judah he removed the high places and the incense altars, and under him the kingdom was at peace."},{"num":5,"verse":"He also built fortified cities in Judah during those years of peace which the Lord had granted."},{"num":6,"verse":"Asa then said to Judah: “Let us build up these cities and surround them with walls, towers, gates, and bars. The land is still ours because we have sought the guidance of the Lord, our God, and he has given us peace on every side.” Therefore, they built and prospered."},{"num":7,"verse":"Zerah’s Invasion. Asa had an army of three hundred thousand warriors from Judah armed with shields and spears, and two hundred and eighty thousand from Benjamin armed with shields and bows. All of them were mighty warriors."},{"num":8,"verse":"Zerah the Ethiopian marched out against them with an army of one million men and three hundred chariots, and they advanced as far as Mareshah."},{"num":9,"verse":"Asa went forth, to confront him, and the opposing armies drew up their battle lines in the Valley of Zephathah near Mareshah."},{"num":10,"verse":"Asa then cried out to the Lord, his God, saying: “Lord, there is no one else like you to help the powerless against a mighty foe. Come to our aid, O Lord, our God, for we are relying upon you, and in your name we are prepared to confront this horde. O Lord, you are our God. Do not allow these mere mortals to prevail against you.”"},{"num":11,"verse":"Then the Lord enabled Asa and Judah to strike down the Ethiopians, and they fled."},{"num":12,"verse":"Asa and his army followed in pursuit as far as Gerar. The Ethiopians fell mortally wounded until there were no survivors. Then the army of Judah carried off a tremendous amount of booty."},{"num":13,"verse":"Following that victory, the Judahites destroyed all the cities around Gerar, for the fear of the Lord had filled the people with terror. Then they plundered all these villages and carried off all the treasures that were of great value."},{"num":14,"verse":"They also attacked the tents of those who had livestock and carried away great numbers of sheep and goats and camels. After that they returned to Jerusalem."}]