[{"num":14,"verse":"Abijah joined the members of his family who had already died. He was buried in the City of David. Abijah’s son Asa became the next king after him. While Asa was king, the country had peace and rest for ten years."},{"header":"Asa Becomes King of Judah"},{"num":2,"verse":"Asa did what was good and right in the eyes of the Lord his God. "},{"num":3,"verse":"Asa removed the altars where false gods were worshiped. He took away the high places. He smashed the sacred stones. He cut down the poles used to worship the female god named Asherah. "},{"num":4,"verse":"He commanded Judah to worship the Lord, the God of their people. He commanded them to obey the Lord’s laws and commands. "},{"num":5,"verse":"Asa removed the high places and incense altars from every town in Judah. The kingdom had peace and rest under his rule. "},{"num":6,"verse":"He built up the cities of Judah that had high walls around them. The land was at peace. No one was at war with Asa during those years. That’s because the Lord gave him peace and rest."},{"num":7,"verse":"“Let’s build up our towns,” Asa said to the people of Judah. “Let’s put walls around them. Let’s provide them with towers. Let’s make them secure with gates that have heavy metal bars. The land still belongs to us. That’s because we’ve trusted in the Lord our God. We trusted in him, and he has given us peace and rest on every side.” So they built. And things went well for them."},{"num":8,"verse":"Asa had an army of 300,000 men from Judah. They carried spears and large shields. There were 280,000 men from Benjamin. They were armed with bows and small shields. All these men were brave soldiers."},{"num":9,"verse":"Zerah marched out against them. He was from Cush. He had a huge army of thousands. He also had 300 chariots. They came all the way to Mareshah. "},{"num":10,"verse":"Asa went out to meet Zerah in battle. They took up their positions in the Valley of Zephathah. It’s near Mareshah."},{"num":11,"verse":"Then Asa called out to the Lord his God. He said, “Lord, there isn’t anyone like you. You help the weak against the strong. Lord our God, help us. We trust in you. In your name we have come out to fight against this huge army. Lord, you are our God. Don’t let mere human beings win the battle over you.”"},{"num":12,"verse":"The Lord struck down the men of Cush for Asa and Judah. The Cushites ran away. "},{"num":13,"verse":"Asa and his army chased them all the way to Gerar. A large number of Cushites fell down wounded or dead. So they couldn’t fight back. The Lord and his army crushed them. The men of Judah carried off a large amount of goods. "},{"num":14,"verse":"They destroyed all the villages around Gerar. The Lord had made the people in those villages afraid of him. The men of Judah took everything from all the villages. "},{"num":15,"verse":"They also attacked the camps of those who took care of the herds. They carried off large numbers of sheep, goats and camels. Then they returned to Jerusalem."}]