[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The commandment.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The marginal version is to be preferred, which points to the revelation which follows ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:24-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The title “greatly beloved” occurs again (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It implies that Daniel was worthy of this proof of God’s love. St. Jerome compares (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 12:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Jedidiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:20-27 An answer was immediately sent to Daniel's prayer, and it is a very memorable one. We cannot now expect that God should send answers to our prayers by angels, but if we pray with fervency for that which God has promised, we may by faith take the promise as an immediate answer to the prayer; for He is faithful that has promised. Daniel had a far greater and more glorious redemption discovered to him, which God would work out for his church in the latter days. Those who would be acquainted with Christ and his grace, must be much in prayer. The evening offering was a type of the great sacrifice Christ was to offer in the evening of the world: in virtue of that sacrifice Daniel's prayer was accepted; and for the sake of that, this glorious discovery of redeeming love was made to him. We have, in verses 24-27, one of the most remarkable prophecies of Christ, of his coming and his salvation. It shows that the Jews are guilty of most obstinate unbelief, in expecting another Messiah, so long after the time expressly fixed for his coming. The seventy weeks mean a day for a year, or 490 years. About the end of this period a sacrifice would be offered, making full atonement for sin, and bringing in everlasting righteousness for the complete justification of every believer. Then the Jews, in the crucifixion of Jesus, would commit that crime by which the measure of their guilt would be filled up, and troubles would come upon their nation. All blessings bestowed on sinful man come through Christ's atoning sacrifice, who suffered once for sins, the just for the unjust, that he might bring us to God. Here is our way of access to the throne of grace, and of our entrance to heaven. This seals the sum of prophecy, and confirms the covenant with many; and while we rejoice in the blessings of salvation, we should remember what they cost the Redeemer. How can those escape who neglect so great salvation!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At the beginning of thy supplications - We are not informed at what time Daniel began to pray, but as remarked above, it is most natural to suppose that he devoted the day to prayer, and had commenced these solemn acts of devotion in the morning.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The commandment came forth - Margin, \"word.\" That is, the word of God. This evidently means, in heaven; and the idea is, that as soon as he began to pray a command was issued from God to Gabriel that he should visit Daniel, and convey to him the important message respecting future events. It is fair to conclude that he had at once left heaven in obedience to the order, and on this high embassage, and that he had passed over the amazing distance between heaven and earth in the short time during which Daniel was engaged in prayer. If so, and if heaven - the peculiar seat of God, the dwelling-place of angels and of the just - is beyond the region of the fixed stars, some central place in this vast universe, then this may give us some idea of the amazing rapidity with which celestial beings may move. It is calculated that there are stars so remote from our earth, that their light would not travel down to us for many thousand years. If so, how much more rapid may be the movements of celestial beings than even light; perhaps more than that of the lightning's flash - than the electric fluid on telegraphic wires - though \"that\" moves at the rate of more than 200,000 miles in a second. Compare Dick's \"Philosophy of a Future State,\" p. 220. \"During the few minutes employed in uttering this prayer,\" says Dr. Dick, \"this angelic messenger descended from the celestial regions to the country of Babylonia. This was a rapidity of motion surpassing the comprehension of the most vigorous imagination, and far exceeding even the amazing velocity of light.\" With such a rapidity it may be our privilege yet to pass from world to world on errands of mercy and love, or to survey in distant parts of the universe the wonderful works of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And I am come to show thee - To make thee acquainted with what will yet be.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For thou\" art \"greatly beloved - Margin, as in Hebrew, \"a man of desires.\" That is, he was one whose happiness was greatly desired by God; or, a man of God's delight; that is, as in our version, greatly beloved. It was on this account that his prayer was heard, and that God sent to him this important message respecting what was to come.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Therefore understand the matter - The matter respecting what was yet to occur in regard to his people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And consider the vision - This vision - the vision of future things which he was now about to present to his view. From this passage, describing the appearance of Gabriel to Daniel, we may learn,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) That our prayers, if sincere, are heard in heaven \"as soon\" as they are offered. They enter at once into the ears of God, and he regards them at the instant.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) A command, as it were, may be at once issued to answer them - \"as if\" he directed an angel to bear the answer at once.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The angels are ready to hasten down to men, to communicate the will of God. Gabriel came evidently with pleasure on his embassage, and to a benevolent being anywhere there is nothing more grateful than to be commissioned to bear glad tidings to others. Possibly that may be a part of the employment of the righteous forever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) The thought is an interesting one, if we are permitted to entertain it, that good angels may be constantly employed as Gabriel was; that whenever prayer is offered on earth they may be commissioned to bring answers of peace and mercy, or despatched to render aid, and that thus the universe may be constantly traversed by these holy beings ministering to those who are \"heirs of salvation,\" Hebrews 1:1, Hebrews 1:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) The thought is an interesting one, if we are permitted to entertain it, that good angels may be constantly employed as Gabriel was; that whenever prayer is offered on earth they may be commissioned to bring answers of peace and mercy, or despatched to render aid, and that thus the universe may be constantly traversed by these holy beings ministering to those who are \"heirs of salvation,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. At the beginning of thy supplications, &c.—The promulgation of the divine decree was made in heaven to the angels as soon as Daniel began to pray.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "came forth—from the divine throne; so Da 9:22.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou art greatly beloved—literally, \"a man of desires\" (compare Eze 23:6, 12); the object of God's delight. As the apocalyptic prophet of the New Testament was \"the disciple whom Jesus loved,\" so the apocalyptic prophet of the Old Testament was \"greatly beloved\" of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the vision—the further revelation as to Messiah in connection with Jeremiah's prophecy of seventy years of the captivity. The charge to \"understand\" is the same as in Mt 24:15, where Rome primarily, and Antichrist ultimately, is referred to (compare Note, see on [1098]Da 9:27).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The commandment came forth:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this thing was decreed before in God’s counsel; but not divulged, or ordered to be proclaimed, till Daniel petitioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Greatly beloved, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a man of desires",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. dear to God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 1:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At the beginning of thy supplications,.... As soon as ever he began to pray. This circumstance shows how ready the Lord is to hear the prayers of his people; and yet it was not owing to the prayers of the prophet, and to any intrinsic virtue or merit in them that the Lord did what he afterwards declares should be done; and, besides, more is revealed and promised than Daniel asked for: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the commandment came forth; either the order from the Lord to the angel, dispatching him on this errand to the prophet, to acquaint him with his mind and will; or the proclamation of Cyrus, to let the people of the Jews go free, and go up to Jerusalem to build their city and temple, published that morning, just about the time Daniel began to pray, the seventy years' captivity being completely finished; see Daniel 9:25, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the commandment came forth; either the order from the Lord to the angel, dispatching him on this errand to the prophet, to acquaint him with his mind and will; or the proclamation of Cyrus, to let the people of the Jews go free, and go up to Jerusalem to build their city and temple, published that morning, just about the time Daniel began to pray, the seventy years' captivity being completely finished; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and I am come to show thee; for thou art greatly beloved; or, \"art desires\" (p); all desire, exceedingly desired; very lovely, amiable, and delightful, in the sight of God, and all good men: or, \"that thou art greatly beloved\" (q); thus the angel came from God, out of heaven, to show it to him, to make it appear that he was highly in the favour of God, in that he made known his secrets to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "therefore understand the matter; or \"word\" (r); attend to the word; advert to the form of speaking used, and labour to get the knowledge of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and consider the vision; this vision, as Japhet; the following vision or prophecy of the seventy weeks; think of it well, as being a matter of great importance and consequence. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) \"desideria\", Michaelis; \"vir desideriorum\", Pagninus, Munster, Piscator; so Ben Melech. (q) \"quod dilectus tu sis\", Cocceius; \"quod desideria tu sis\", Michaelis. (r) \"in verbo\", Montanus; \"verbum\", Pagninus; \"ipsum verbum\", Junius & Tremellius; \"sermonem\", Cocceius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) \"desideria\", Michaelis; \"vir desideriorum\", Pagninus, Munster, Piscator; so Ben Melech. (q) \"quod dilectus tu sis\", Cocceius; \"quod desideria tu sis\", Michaelis. (r) \"in verbo\", Montanus; \"verbum\", Pagninus; \"ipsum verbum\", Junius & Tremellius; \"sermonem\", Cocceius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "At the beginning of thy supplications the commandment came forth, and I am come to shew thee; for thou art greatly beloved: therefore understand the matter, and consider the vision.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the commandment came forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a word went forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The reference is not to the commandment given to Gabriel to go to Daniel, but to the Divine declaration contained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 9:24-27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:24-27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to shew thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "declare",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (it): cf. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "greatly beloved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "greatly desired",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or (R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "marg.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "very precious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "desirable things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "desirablenesses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘a man of desirablenesses,’ the plural being intensive[333].",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[333] For the Heb. idiom here employed cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 109:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 110:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : and see Ges.-Kautzsch, § 141 c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The cognate verb means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to desire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘covet’); and when applied to men has usually reference to their personal attractiveness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘his desirableness,’ A.V., R.V., ‘his beauty’). The word here used, properly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "desired",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is elsewhere rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "precious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 20:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 8:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pleasant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): hence R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "marg.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘very precious.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "understand … consider",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "consider … understand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The two words in the Heb. are different forms of one and the same verb: R.V. transposes the renderings, probably on the ground that ‘understanding’ implies more than ‘consideration,’ and would naturally follow it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the matter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "word",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e. the prophetic word following (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:24-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the vision",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Also a term descriptive of the revelation following, and implying that the appearance of Gabriel to Daniel took place in a vision. The word (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "מראה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is not the one found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "חזון",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which does sometimes mean no more than ‘prophecy’.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Daniel 9:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "ויּבן, he gave understanding, insight, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words point back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". First of all Gabriel speaks of the design and the circumstances of his coming. עתּה יצאתי, now, viz., in consequence of thy morning prayer, I am come, sc. from the throne of God. להשׂכּילך בינה, to instruct thee in knowledge. This is more particularly declared in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". At the beginning of Daniel's prayer a word, i.e., a communication from God, came forth, which he brought. דּבר, not a commandment, or the divine commandment to Gabriel to go to Daniel, but a word of God, and particularly the word which he announced to Daniel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:24-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sentence, \"for thou art a man greatly beloved\" (חמוּדות  equals  חמוּדות אישׁ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", vir desideriorum, desideratissimus), does not contain the reason for Gabriel's coming in haste, but for the principal thought of the verse, the going forth of the word of God immediately at the beginning of Daniel's prayer. המּראה stands not for revelation, but is the vision, the appearance of the angel by whom the word of God was communicated to the prophet. מראה is accordingly not the contents of the word spoken, but the form for its communication to Daniel. To both - the word and the form of its revelation - Daniel must give heed. This revelation was, moreover, not communicated to him in a vision, but while in the state of natural consciousness. ",
        "children": []
      }
    ]
  }
]