[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Esther 7:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 7:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So they hanged Haman on the gallows that he had prepared for Mordecai — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As the sentence was short, so the execution was speedy, and he that expected every one to do him reverence is now made an ignominious spectacle to the world on a gallows fifty cubits high: and himself is sacrificed to justice, who disdained that less than a whole nation should be sacrificed to his revenge. Thus does God resist the proud, and those whom he resists will find him irresistible! Thus did mischief return on the person that contrived it, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the wicked was snared in the work of his own hands. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If he had not set up that gallows, the king probably would not have thought of ordering him to be hanged; but as he had unjustly prepared it for a good man, he was justly condemned to suffer on it himself. The enemies of God’s church have often been thus ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "taken in their own craftiness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In the morning, Haman designed himself for the robes, and Mordecai for the gallows: but the tables are now turned, and Mordecai has the crown and Haman the cross. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord is known by the judgments which he executeth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“I cannot pass over this wonderful harmony of providence,” says Josephus, (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Antiq., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "50:2, c. 6,) “without a remark upon the almighty power, and admirable justice of the wisdom of God; not only in bringing Haman to his deserved punishment, but in trapping him in the very snare which he had laid for another, and turning a malicious invention upon the head of the inventor.” Bishop Patrick observes, on this wonderful deliverance of the Jewish nation, that “though, in the whole, there was no extraordinary manifestation of God’s power; no particular cause, or agent, which was in its working advanced above the ordinary pitch of nature; yet the contrivance, and suiting these ordinary agents appointed by God, is in itself more admirable than if the same end had been effected by means which were truly miraculous. That a king should not sleep, is no unusual thing, nor that he should solace his waking thoughts by hearing the annals of his own kingdom, or the journals of his own reign, read to him: but that he should be awake at that time, especially when Haman was watching to destroy the Jews, and that, in the chronicles of the kingdom, they should light on that place where Mordecai’s unrewarded services were recorded; that the king should resolve, thereupon, forthwith to do him honour; that Haman should come in at the very moment when he was so disposed; should ignorantly determine what honour should be done him, and be himself appointed to that ungrateful office: all this, no doubt, was from the Keeper of Israel, who neither slumbereth nor sleepeth, and was truly marvellous in his people’s eyes.” — See Dodd. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:7-10 The king was angry: those that do things with self-will, reflect upon them afterward with self-reproach. When angry, we should pause before we come to any resolution, and thus rule our own spirits, and show that we are governed by reason. Those that are most haughty and insolent when in power and prosperity, commonly, like Haman, are the most abject and poor-spirited when brought down. The day is coming when those that hate and persecute God's chosen ones, would gladly be beholden to them. The king returns yet more angry against Haman. Those about him were ready to put his wrath into execution. How little can proud men be sure of the interest they think they have! The enemies of God's church have often been thus taken in their own craftiness. The Lord is known by such judgments. Then was the king's wrath pacified, and not till then. And who pities Haman hanged on his own gallows? who does not rather rejoice in the Divine righteousness displayed in the destruction his own art brought upon him? Let the workers of iniquity tremble, turn to the Lord, and seek pardon through the blood of Jesus.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Like the Greeks and Romans, the Persians reclined at their meals on sofas or couches. Haman, in the intensity of his supplication, had thrown himself upon the couch at Esther's feet.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They covered Haman's face - The Macedonians and the Romans are known to have commonly muffled the heads of prisoners before executing them. It may have also been a Persian custom. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They covered Haman's face - The Macedonians and the Romans are known to have commonly muffled the heads of prisoners before executing them. It may have also been a Persian custom. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. So they hanged Haman on the gallows that he had prepared for Mordecai—He has not been the only plotter of mischief whose feet have been taken in the net which they hid (Ps 9:15). But never was condemnation more just, and retribution more merited, than the execution of that gigantic criminal.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The gallows that he had prepared; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which stood in his own house, as was now said, and made the punishment more grievous and ignominious. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then was the king’s wrath pacified; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " judgment being now most justly executed upon this abominable criminal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So they hanged Haman on the gallows that he had prepared for Mordecai,.... Not within his house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but more probably in his courtyard, in the sight of his family and friends; or, it may be, the gallows was taken from thence, and set up without the city, where he was hanged: for so it is said in the additions of the book of Esther,\"For he that was the worker of these things, is hanged at the gates of Susa with all his family: God, who ruleth all things, speedily rendering vengeance to him according to his deserts.'' (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 16:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")that he was hanged without the gates of Shushan; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then was the king's wrath pacified; having inflicted punishment on such a wicked counsellor of his, and the contriver of such mischief. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "then was the king's wrath pacified; having inflicted punishment on such a wicked counsellor of his, and the contriver of such mischief. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So they hanged Haman on the gallows that he had prepared for Mordecai. Then was the king's wrath pacified.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then said Harbonah (already mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), one of the eunuchs before the king, i.e., who held office before the king: \"Behold also the tree which Haman made (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") stands in the house of Haman.\" גּם points to the fact that the other eunuchs had already brought forward various particulars concerning Haman's crime. Mordochai, who had spoken good for the king, viz., when he gave information of the conspiracy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 2:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On this tree the king ordered that Haman should be hanged, and this sentence was executed without delay. - \"And the king's wrath was pacified.\" With this remark the narrative of this occurrence is closed, and the history pursues its further course as follows. ",
        "children": []
      }
    ]
  }
]