[{"num":18,"verse":"4 Hezekiah king of Judah putteth down the brazen serpent, and destroyeth the idols, 7 and prospereth. 11 Israel is carried away captive. 30 The blasphemy of Sennacherib."},{"num":1,"verse":"Now in the third year of Hoshea, son of Elah king of Israel, Hezekiah the son of Ahaz king of Judah began to reign."},{"num":2,"verse":"He was five and twenty years old when he began to reign, and reigned nine and twenty years in Jerusalem. His mother’s name also was Abi the daughter of Zechariah,"},{"num":3,"verse":"And he did uprightly in the sight of the Lord, according to all that David his father had done."},{"num":4,"verse":"He took away the high places, and brake the images, and cut down the groves, and brake in pieces the brazen serpent that Moses had made: for unto those days the children of Israel did burn incense to it, and he called it Nehushtan."},{"num":5,"verse":"He trusted in the Lord God of Israel: so that after him was none like him among all the kings of Judah, neither were there any such before him."},{"num":6,"verse":"For he clave to the Lord and departed not from him, but kept his commandments, which the Lord had commanded Moses."},{"num":7,"verse":"So the Lord was with him, and he prospered in all things which he took in hand, also he rebelled against the king of Assyria, and served him not."},{"num":8,"verse":"He smote the Philistines unto Gaza, and the coasts thereof, from the watchtower unto the defensed city."},{"num":9,"verse":"¶ And in the fourth year of King Hezekiah, (which was the seventh year of Hoshea son of Elah king of Israel) Shalmaneser king of Assyria came up against Samaria, and besieged it."},{"num":10,"verse":"And after three years they took it, even in the sixth year of Hezekiah: that is, the ninth year of Hoshea king of Israel was Samaria taken."},{"num":11,"verse":"Then the king of Assyria did carry away Israel unto Assyria, and put them in Halah and in Habor, by the river of Gozan, and in the cities of the Medes,"},{"num":12,"verse":"Because they would not obey the voice of the Lord their God, but transgressed his covenant: that is, all that Moses the servant of the Lord had commanded, and would neither obey nor do them."},{"num":13,"verse":"¶ Moreover, in the fourteenth year of king Hezekiah, Sennacherib king of Assyria came up against all the strong cities of Judah, and took them."},{"num":14,"verse":"Then Hezekiah king of Judah sent unto the king of Assyria to Lachish, saying, I have offended: depart from me, and what thou layest upon me, I will bear it. And the king of Assyria appointed unto Hezekiah king of Judah three hundred talents of silver, and thirty talents of gold."},{"num":15,"verse":"Therefore Hezekiah gave all the silver that was found in the house of the Lord, and in the treasures of the king’s house."},{"num":16,"verse":"At the same season did Hezekiah pull off the plates of the doors of the Temple of the Lord, and the pillars (which the said Hezekiah king of Judah had covered over) and gave them to the king of Assyria."},{"num":17,"verse":"¶ And the king of Assyria sent Tartan, and Rabsaris, and Rabshakeh from Lachish to king Hezekiah with a great host against Jerusalem. And they went up, and came to Jerusalem, and when they were come up, they stood by the conduit of the upper pool, which is by the path of the fuller’s field,"},{"num":18,"verse":"And called to the king. Then came out to them Eliakim the son of Hilkiah, which was steward of the house, and Shebna the chancellor, and Joah the son of Asaph the recorder."},{"num":19,"verse":"And Rabshakeh said unto them, Tell ye Hezekiah, I pray you, Thus saith the great king, even the great king of Assyria, What confidence is this wherein thou trustest?"},{"num":20,"verse":"Thou thinkest, Surely I have eloquence, but counsel and strength are for the war. On whom then doest thou trust, that thou rebellest against me?"},{"num":21,"verse":"Lo, thou trustest now in this broken staff of reed, to wit, on Egypt, on which if a man lean, it will go into his hand, and pierce it: so is Pharaoh king of Egypt unto all that trust on him."},{"num":22,"verse":"But if ye say unto me, We trust in the Lord our God, is not that he whose high places, and whose altars Hezekiah hath taken away, and hath said to Judah and Jerusalem, Ye shall worship before this altar in Jerusalem?"},{"num":23,"verse":"Now therefore give hostages to my lord the king of Assyria, and I will give thee two thousand horses, if thou be able to set riders upon them."},{"num":24,"verse":"For how canst thou despise any captain of the least of my master’s servants, and put thy trust on Egypt for chariots and horsemen?"},{"num":25,"verse":"Am I now come up without the Lord to this place, to destroy it? the Lord said to me, Go up against this land, and destroy it."},{"num":26,"verse":"Then Eliakim the son of Hilkiah, and Shebna, and Joah said unto Rabshakeh, Speak I pray thee, to thy servants in the Aramites’ language, for we understand it, and talk not with us in the Jews’ tongue, in the audience of the people that are on the wall."},{"num":27,"verse":"But Rabshakeh said unto them, Hath my master sent me to thy master and to thee to speak these words, and not to the men which sit on the wall, that they may eat their own dung, and drink their own piss with you?"},{"num":28,"verse":"So Rabshakeh stood, and spake, saying, Hear the words of the great king, of the king of Assyria."},{"num":29,"verse":"Thus saith the king, Let not Hezekiah deceive you: for he shall not be able to deliver you out of mine hand."},{"num":30,"verse":"Neither let Hezekiah make you to trust in the Lord, saying, The Lord will surely deliver us, and this city shall not be given over into the hand of the king of Assyria."},{"num":31,"verse":"Hearken not unto Hezekiah: for thus saith the king of Assyria, Make appointment with me, and come out to me, that every man may eat of his own vine, and every man of his own fig tree, and drink every man of the water of his own well,"},{"num":32,"verse":"Till I come, and bring you to a land like your own land, even a land of wheat and wine, a land of bread and vineyards, a land of olive’s oil, and honey, that ye may live and not die: and obey not Hezekiah, for he deceiveth you, saying, The Lord will deliver us."},{"num":33,"verse":"Hath any of the gods of the nations delivered his land out of the hand of the king of Assyria?"},{"num":34,"verse":"Where is the god of Hamath, and of Arpad? where is the god of Sepharvaim, Hena and Ivah? how have they delivered Samaria out of mine hand?"},{"num":35,"verse":"Who are they among all the gods of the nations, that have delivered their land out of mine hand, that the Lord should deliver Jerusalem out of mine hand?"},{"num":36,"verse":"But the people held their peace, and answered not him a word: for the king’s commandment was, saying, Answer ye him not."},{"num":37,"verse":"Then Eliakim the son of Hilkiah which was steward of the house, and Shebna the chancellor, and Joah the son of Asaph the recorder came to Hezekiah with their clothes rent, and told him the words of Rabshakeh."}]