[{"num":2,"verse":"And it came to pass, when Hashem would take up Eliyahu into Shomayim in a se’arah (storm wind, whirlwind), that Eliyahu went with Elishah from Gilgal."},{"num":2,"verse":"And Eliyahu said unto Elishah, Tarry here, now; for Hashem hath sent me to Beit-El. And Elishah said unto him, As Hashem liveth, and as thy nefesh liveth, I will not leave thee. So they went down to Beit-El."},{"num":3,"verse":"And the Bnei HaNevi’im that were at Beit-El came forth to Elishah, and said unto him, Doest thou have da’as that Hashem will take away thy adon from over thy rosh hayom? And he said, Yes, I have da’as; be silent."},{"num":4,"verse":"And Eliyahu said unto him, Elishah, tarry here, now; for Hashem hath sent me to Yericho. And he said, As Hashem liveth, and as thy nefesh liveth, I will not leave thee. So they came to Yericho."},{"num":5,"verse":"And the Bnei HaNevi’im that were at Yericho came to Elishah, and said unto him, Doest thou have da’as that hayom (today) Hashem will take away thy adon from over thy rosh? And he answered, Yes, I have da’as; be silent."},{"num":6,"verse":"And Eliyahu said unto him, Tarry, now, here; for Hashem hath sent me to the Yarden. And he said, As Hashem liveth, and as thy nefesh liveth, I will not leave thee. And they two walked on."},{"num":7,"verse":"And chamishim ish (fifty men) of the Bnei HaNevi’im went, standing opposite them at a distance; and they two stood by the Yarden."},{"num":8,"verse":"And Eliyahu took his aderet (mantle, cloak), and rolled it up, and struck the mayim, and they were split from here and from there, so that they two crossed over on charavah (dry ground [See Yehoshua 3:17])."},{"num":9,"verse":"And it came to pass, when they were crossed over, that Eliyahu said unto Elishah, Request what I shall do for thee, before I am taken away from thee. And Elishah said, Let, now, a double portion of thy ruach be upon me."},{"num":10,"verse":"And he said, Thou hast asked a hard thing; nevertheless, if thou see me when lukach (I am taken away) from thee, it shall be so unto thee; but if not, it shall not be so."},{"num":11,"verse":"And it came to pass, as they still walked on, and talked, that, hinei, there appeared a merkavah of eish, and susim of eish, and separated the two of them between them; and Eliyahu went up in a se’arah (storm wind, whirlwind) into Shomayim."},{"num":12,"verse":"And Elishah saw, and he cried, Avi, Avi, the merkavah (war chariot) of Yisroel, and the parash (horsemen, charioteers) thereof. And he saw him no more; and he took hold of his own robe, and tore his apparel in two pieces."},{"num":13,"verse":"He took up also the aderet Eliyahu that fell from him, and went back, and stood by the bank of the Yarden;"},{"num":14,"verse":"And he took the aderet Eliyahu that fell from him, and struck the mayim, and said, Where is Hashem Elohei Eliyahu? And when he also had struck the mayim, they split from here and from there; and Elishah crossed over."},{"num":15,"verse":"And when the Bnei HaNevi’im which were watching at Yericho saw him from a distance, they said, The ruach Eliyahu doth rest on Elishah. And they came to meet him, and bowed themselves to the ground before him."},{"num":16,"verse":"And they said unto him, Hinei now, there be among thy avadim chamishim anashim bnei chayil (fifty able-bodied men); let them go, now, and look for thy adon; perhaps the Ruach Hashem hath taken him up, and set him down [See Ac 8:39-40 OJBC] upon one of the harim, or in one of the geya’ot (valleys). And he said, Ye shall not send."},{"num":17,"verse":"And when they urged him until he was ashamed, he said, Send. They sent therefore chamishim ish; and they searched shloshah yamim, but found him not."},{"num":18,"verse":"And when they returned to him (for he tarried at Yericho), he said unto them, Did I not say unto you, Go not?"},{"num":19,"verse":"And the anshei HaIr said unto Elishah, Hinei, now, the situation of this city is tov, as adoni seeth; but the mayim is ra’im, and ha’aretz (the land) meshakkalet (barren, unfruitful)."},{"num":20,"verse":"And he said, Bring me a tzelokhit chadasha (new bowl), and put melach therein. And they brought it to him."},{"num":21,"verse":"And he went forth unto the motza hamayim (spring of water), and cast the melach in there, and said, Thus saith Hashem, I have healed these mayim; there shall not be from there any more mavet or meshakkalet (unfruitfulness, barrenness)."},{"num":22,"verse":"So the mayim were healed unto hayom hazeh (this day), according to the devar Elishah which he spoke."},{"num":23,"verse":"And he went up from there unto Beit-El; and as he was going up along the derech, there came forth ne’arim ketannim out of the Ir, and jeered in mockery at him, and said unto him, Go on up, thou kere’ach (bald head); go on up, thou kere’ach."},{"num":24,"verse":"And he turned around, and looked on them, and cursed them in the Shem Hashem. And there came forth two dubim (female bears) out of the woods, and mauled 42 yeladim of them."},{"num":25,"verse":"And he went from there to Mt Carmel, and from there he returned to Shomron."}]