[{"header":"Peter Reports to the Church in Jerusalem"},{"num":11,"verse":"The apostles and the followers in Judea heard that Gentiles had accepted God’s message. "},{"num":2,"verse":"So when Peter came to Jerusalem, some of the Jewish followers started arguing with him. They wanted Gentile followers to be circumcised, and "},{"num":3,"verse":"they said, “You stayed in the homes of Gentiles, and you even ate with them!”"},{"num":4,"verse":"Then Peter told them exactly what had happened:"},{"num":18,"verse":"When they heard Peter say this, they stopped arguing and started praising God. They said, “God has now let Gentiles turn to him, and he has given life to them!”"},{"header":"The Church in Antioch"},{"num":19,"verse":"Some of the Lord’s followers had been scattered because of the terrible trouble that started when Stephen was killed. They went as far as Phoenicia, Cyprus, and Antioch, but they told the message only to the Jews."},{"num":20,"verse":"Some of the followers from Cyprus and Cyrene went to Antioch and started telling Gentiles the good news about the Lord Jesus. "},{"num":21,"verse":"The Lord’s power was with them, and many people turned to the Lord and put their faith in him. "},{"num":22,"verse":"News of what was happening reached the church in Jerusalem. Then they sent Barnabas to Antioch."},{"num":23,"verse":"When Barnabas got there and saw what God had been kind enough to do for them, he was very glad. So he begged them to remain faithful to the Lord with all their hearts. "},{"num":24,"verse":"Barnabas was a good man of great faith, and he was filled with the Holy Spirit. Many more people turned to the Lord."},{"num":25,"verse":"Barnabas went to Tarsus to look for Saul. "},{"num":26,"verse":"He found Saul and brought him to Antioch, where they met with the church for a whole year and taught many of its people. There in Antioch the Lord’s followers were first called Christians."},{"num":27,"verse":"During this time some prophets from Jerusalem came to Antioch. "},{"num":28,"verse":"One of them was Agabus. Then with the help of the Spirit, he told that there would be a terrible famine everywhere in the world. And it happened when Claudius was Emperor. "},{"num":29,"verse":"The followers in Antioch decided to send whatever help they could to the followers in Judea. "},{"num":30,"verse":"So they had Barnabas and Saul take their gifts to the church leaders in Jerusalem."}]