[{"num":11,"verse":"Now de the ho apostles apostolos and kai the ho brothers adelphos who ho were eimi throughout kata · ho Judea Ioudaia heard akouō that hoti the ho Gentiles ethnos too kai had  accepted dechomai the ho word logos of ho God theos. "},{"num":2,"verse":"So de when hote Peter Petros went  up anabainō to eis Jerusalem Ierousalēm,  they ho who were  of ek the  circumcision peritomē took diakrinō issue  with pros him autos, "},{"num":3,"verse":"saying legō, “ You  went eiserchomai to pros a house  of echō uncircumcised akrobystia men anēr and kai ate synesthiō with  them autos.” "},{"num":4,"verse":"But de Peter Petros began archō and  explained ektithēmi to  them autos in  an  orderly kathexēs fashion ,  saying legō, "},{"num":5,"verse":"“ I egō was eimi in en the  city polis of  Joppa Ioppē,  praying proseuchomai,  and kai in en a  trance ekstasis I saw a  vision horama,  an tis object skeuos descending katabainō,  like hōs a  great megas sheet othonē being  let  down kathiēmi by  its  four tessares corners archē from ek · ho heaven ouranos,  and kai it  came erchomai close achri to  me egō. "},{"num":6,"verse":"I  looked katanoeō into eis it hos closely atenizō and kai I saw  · ho four-footed tetrapous animals  of  the ho earth gē,  · kai · ho wild thērion animals ,  · kai · ho reptiles herpeton,  and kai · ho birds peteinon of  the ho air ouranos. "},{"num":7,"verse":"I  also kai heard akouō · de a  voice phōnē saying legō to  me egō, ‘ Get anistēmi up ,  Peter Petros;  slaughter thuō and kai eat esthiō!’ "},{"num":8,"verse":"But de I  said legō, ‘ By mēdamōs no  means ,  Lord kyrios;  for hoti nothing oudepote common koinos or ē unclean akathartos has  ever  entered eiserchomai into eis · ho my egō mouth stoma.’ "},{"num":9,"verse":"But de the  voice phōnē replied apokrinomai a  second  time ek from ek · ho heaven ouranos, ‘ What hos · ho God theos has  made  clean katharizō,  you sy must  not mē consider  common koinoō.’ "},{"num":10,"verse":"This houtos · de happened ginomai three  times epi,  and kai again palin everything hapas was  drawn anaspaō up  into eis · ho heaven ouranos. "},{"num":11,"verse":"And kai behold idou,  at  that  very  moment exautēs three treis men anēr arrived ephistēmi at epi the ho house oikia,  in en which hos we  were eimi,  sent apostellō from apo Caesarea Kaisareia to pros me egō. "},{"num":12,"verse":"And de the ho Spirit pneuma told legō me egō to  go synerchomai with  them autos without mēdeis hesitating diakrinō.  And de with syn me egō went erchomai also kai · ho these houtos six hex brothers adelphos,  and kai we  went eiserchomai into eis the ho house oikos of  the ho man anēr. "},{"num":13,"verse":"And de he  told apangellō us hēmeis how pōs he had seen  the ho angel angelos standing histēmi in en · ho his autos house oikos and kai saying legō, ‘ Send apostellō to eis Joppa Ioppē and kai summon metapempō Simon Simōn,  who ho is  called epikaleō Peter Petros, "},{"num":14,"verse":"who hos will  speak laleō words rhēma to pros you sy by en which hos you sy and kai your sy entire pas household oikos will  be  saved sōzō.’  · ho"},{"num":15,"verse":"And de as en I egō began archō to  speak laleō,  the ho Holy hagios Spirit pneuma fell epipiptō · ho upon epi them autos just kai as hōsper he did  upon epi us hēmeis at en the  beginning archē. "},{"num":16,"verse":"And de I  remembered mimnēskomai the ho word rhēma of  the ho Lord kyrios,  how hōs he  said legō, ‘ John Iōannēs indeed men baptized baptizō with  water hydōr,  but de you hymeis will  be  baptized baptizō with en the  Holy hagios Spirit pneuma.’ "},{"num":17,"verse":"If ei then oun God theos gave didōmi the ho same isos gift dōrea to  them autos · ho as hōs · kai he gave  to  us hēmeis when  we  believed pisteuō in epi the ho Lord kyrios Jesus Iēsous Christ Christos,  who tis was eimi I egō to be  able dynatos to  stand kōlyō in God’ s theos way ?”  · ho"},{"num":18,"verse":"When  they  heard akouō · de these houtos things ,  they  fell  silent hēsychazō,  and kai they  glorified doxazō · ho God theos,  saying legō, “ So ara then  even kai to  the ho Gentiles ethnos · ho God theos has  granted didōmi · ho repentance metanoia that leads  to eis life zōē.” "},{"num":19,"verse":"Now oun those ho who  were  scattered diaspeirō because apo of  the ho persecution thlipsis,  which ho came ginomai to  pass  over epi Stephen Stephanos,  made dierchomai their  way  as heōs far  as  Phoenicia Phoinikē and kai Cyprus Kypros and kai Antioch Antiocheia,  speaking laleō the ho word logos to  no mēdeis one  except ei mē Jews Ioudaios only monon. "},{"num":20,"verse":"But de there  were eimi some tis of ek them autos,  men anēr of  Cyprus Kyprios and kai Cyrene Kyrēnaios,  who hostis on  coming erchomai to eis Antioch Antiocheia began  to  speak laleō also kai to pros the ho Hellenists Hellēnistēs,  preaching euangelizō the ho Lord kyrios Jesus Iēsous. "},{"num":21,"verse":"And kai the  hand cheir of kyrios the  Lord kyrios was eimi with meta them autos,  and te a  great polys number arithmos became  · ho believers pisteuō and  turned epistrephō to epi the ho Lord kyrios. "},{"num":22,"verse":"The ho report logos of peri all  this autos was  heard akouō · de in eis the ho ears ous of  the ho church ekklēsia · ho in en Jerusalem Ierousalēm,  and kai they  sent exapostellō Barnabas Barnabas as heōs far  as  Antioch Antiocheia. "},{"num":23,"verse":"When  he hos came paraginomai and kai saw  the ho grace charis · ho of ho God theos,  he  was  glad chairō,  and kai he  began  to  exhort parakaleō them  all pas to  remain  faithful prosmenō to  the ho Lord kyrios in  the ho purpose prothesis of  their ho hearts kardia, "},{"num":24,"verse":"for hoti he  was eimi a  good agathos man anēr,  · kai full plērēs of  the  Holy hagios Spirit pneuma and kai of  faith pistis.  And kai a  considerable  number hikanos of  people ochlos were  brought prostithēmi to  the ho Lord kyrios. "},{"num":25,"verse":"So de Barnabas  went exerchomai to eis Tarsus Tarsos to  look anazēteō for  Saul Saulos, "},{"num":26,"verse":"and kai when  he  had  found heuriskō him,  he  brought agō him  to eis Antioch Antiocheia.  · de · kai For  a  whole holos year eniautos they autos met synagō with en the ho church ekklēsia and kai taught didaskō a  considerable  number hikanos of  people ochlos.  And te in en Antioch Antiocheia the ho disciples mathētēs were chrēmatizō first prōtōs called chrēmatizō Christians Christianos. "},{"num":27,"verse":"During en these houtos · de · ho days hēmera prophets prophētēs came katerchomai down  from apo Jerusalem Hierosolyma to eis Antioch Antiocheia. "},{"num":28,"verse":"And de one heis of ek them autos stood  up anistēmi,  named onoma Agabus Hagabos, and  indicated sēmainō by dia the ho Spirit pneuma that  there  would mellō be eimi a  great megas famine limos over epi all holos the ho world oikoumenē ( which hostis took ginomai place  in epi the days  of  Claudius Klaudios). "},{"num":29,"verse":"So de each hekastos of  the ho disciples mathētēs,  according kathōs to  his tis financial euporeō ability ,  resolved horizō to  send pempō relief autos eis to  the ho brothers adelphos living katoikeō in en · ho Judea Ioudaia, "},{"num":30,"verse":"and kai they  did poieō so hos,  sending apostellō it  to pros the ho elders presbyteros by dia the  hand cheir of  Barnabas Barnabas and kai Saul Saulos. "}]