[{"header":"Peter Tells Why He Preached to the People Who Are Not Jews"},{"num":11,"verse":"The missionaries and followers who were in the country of Judea heard that the people who were not Jews also had received the Word of God. "},{"num":2,"verse":"When Peter went up to Jerusalem, the Jewish followers argued with him. "},{"num":3,"verse":"They said, “Why did you visit those people who are not Jews and eat with them?”"},{"num":4,"verse":"Then Peter began to tell all that had happened from the beginning to the end. He said, "},{"num":5,"verse":"“While I was praying in the city of Joppa, I saw in a dream something coming down from heaven. It was like a large linen cloth let down by the four corners until it came to me. "},{"num":6,"verse":"As I looked at it, I saw four-footed animals and snakes of the earth and birds of the sky. "},{"num":7,"verse":"I heard a voice saying to me, ‘Get up, Peter, kill something and eat it.’ "},{"num":8,"verse":"But I said, ‘No, Lord! Nothing that is unclean has ever gone into my mouth.’ "},{"num":9,"verse":"The voice from heaven said the second time, ‘What God has made clean you must not say is unclean.’ "},{"num":10,"verse":"This happened three times and then it was taken up again to heaven."},{"num":11,"verse":"“Three men had already come to the house where I was staying. They had been sent to me from the city of Caesarea. "},{"num":12,"verse":"The Holy Spirit told me to go with them and not doubt about going. These six men also went with me to this man’s house. "},{"num":13,"verse":"He told us how he had seen an angel in his own home. The angel had stood in front of him and said, ‘Send men to Joppa to ask for Simon Peter. "},{"num":14,"verse":"He will tell you and all your family how you can be saved from the punishment of sin.’"},{"num":15,"verse":"“As I began to talk to them, the Holy Spirit came down on them just as He did on us at the beginning. "},{"num":16,"verse":"Then I remembered the Lord had said, ‘John baptized with water but you will be baptized with the Holy Spirit.’ "},{"num":17,"verse":"If God gave to them the same gift He gave to us after we put our trust in the Lord Jesus Christ, how could I stand against God?”"},{"num":18,"verse":"When they heard these words, they said nothing more. They thanked God, saying, “Then God has given life also to the people who are not Jews. They have this new life by being sorry for their sins and turning from them.”"},{"header":"The Followers Are Called Christians First In Antioch"},{"num":19,"verse":"Those who went different places because of the trouble that started over Stephen had gone as far as the cities of Phoenicia and Cyprus and Antioch. They had preached the Word, but only to the Jews. "},{"num":20,"verse":"Some of the men from Cyprus and Cyrene returned to Antioch. They preached the Good News of Jesus Christ to the Greek people there. "},{"num":21,"verse":"The Lord gave them power. Many people put their trust in the Lord and turned to Him."},{"num":22,"verse":"The news of this came to the church in Jerusalem. They sent Barnabas to Antioch. "},{"num":23,"verse":"When he got there and saw how good God had been to them, he was full of joy. He told them to be true and faithful to the Lord. "},{"num":24,"verse":"Barnabas was a good man and full of the Holy Spirit and faith. And many people became followers of the Lord."},{"num":25,"verse":"From there Barnabas went on to the city of Tarsus to look for Saul. "},{"num":26,"verse":"When he found Saul, he brought him back with him to Antioch. For a year they taught many people in the church. The followers were first called Christians in Antioch."},{"header":"The Antioch Church Helps the Jerusalem Church"},{"num":27,"verse":"At that time some men who preached God’s Word came to Antioch and told what was going to happen. They were from Jerusalem. "},{"num":28,"verse":"One of them was Agabus. The Holy Spirit told him to stand up and speak. He told them there would be very little food to eat over all the world. This happened when Claudius was leader of the country. "},{"num":29,"verse":"The Christians agreed that each one should give what money he could to help the Christians living in Judea. "},{"num":30,"verse":"They did this and sent it to the church leaders with Barnabas and Saul."}]