[{"num":20,"verse":"Hezekiah now became deathly sick, and Isaiah the prophet went to visit him."},{"num":2,"verse":"Hezekiah turned his face to the wall."},{"num":3,"verse":"“O Lord,” he pleaded, “remember how I’ve always tried to obey you and to please you in everything I do. . . . ” Then he broke down and cried."},{"num":4,"verse":"So before Isaiah had left the courtyard, the Lord spoke to him again."},{"num":5,"verse":"“Go back to Hezekiah, the leader of my people, and tell him that the Lord God of his ancestor David has heard his prayer and seen his tears. I will heal him, and three days from now he will be out of bed and at the Temple! "},{"num":6,"verse":"I will add fifteen years to his life and save him and this city from the king of Assyria. And it will all be done for the glory of my own name and for the sake of my servant David.”"},{"num":7,"verse":"Isaiah then instructed Hezekiah to boil some dried figs and to make a paste of them and spread it on the boil. And he recovered!"},{"num":8,"verse":"Meanwhile, King Hezekiah had said to Isaiah, “Do a miracle to prove to me that the Lord will heal me and that I will be able to go to the Temple again three days from now.”"},{"num":9,"verse":"“All right, the Lord will give you a proof,” Isaiah told him. “Do you want the shadow on the sundial to go forward ten points or backward ten points?”"},{"num":10,"verse":"“The shadow always moves forward,” Hezekiah replied; “make it go backward.”"},{"num":11,"verse":"So Isaiah asked the Lord to do this, and he caused the shadow to move ten points backward on the sundial of Ahaz!"},{"num":12,"verse":"At that time Merodach-baladan (the son of King Baladan of Babylon) sent ambassadors with greetings and a present to Hezekiah, for he had learned of his sickness. "},{"num":13,"verse":"Hezekiah welcomed them and showed them all his treasures—the silver, gold, spices, aromatic oils, the armory—everything."},{"num":14,"verse":"Then Isaiah went to King Hezekiah and asked him, “What did these men want? Where are they from?”"},{"num":15,"verse":"“What have they seen in your palace?” Isaiah asked."},{"num":16,"verse":"Then Isaiah said to Hezekiah, “Listen to the word of the Lord: "},{"num":17,"verse":"The time will come when everything in this palace shall be carried to Babylon. All the treasures of your ancestors will be taken—nothing shall be left. "},{"num":18,"verse":"Some of your own sons will be taken away and made into eunuchs who will serve in the palace of the king of Babylon.”"},{"num":19,"verse":"“All right,” Hezekiah replied, “if this is what the Lord wants, it is good.” But he was really thinking, “At least there will be peace and security during the remainder of my own life!”"},{"num":20,"verse":"The rest of the history of Hezekiah and his great deeds—including the pool and conduit he made and how he brought water into the city—are recorded in The Annals of the Kings of Judah. "},{"num":21,"verse":"When he died, his son Manasseh became the new king."}]