[{"header":"Chapter 17"},{"num":1,"verse":"You shall not sacrifice an ox or a sheep that has any blemish or any defect whatsoever to the Lord, your God, for that would be an abomination to the Lord, your God."},{"num":2,"verse":"If any man or woman is discovered in any of the towns that the Lord, your God, has given you who does what is evil in the sight of the Lord, your God, transgressing his covenant,"},{"num":3,"verse":"going over and serving and worshiping other gods, whether it be the sun or the moon or any of the host of heaven, something that I have forbidden,"},{"num":4,"verse":"and you are told about it, and you hear of it, then you shall carefully check into it. If it is true, then an abomination has been committed in Israel;"},{"num":5,"verse":"you are to bring that man or woman who has done this evil thing to the town gates, and you shall stone that man or woman to death."},{"num":6,"verse":"A person can be put to death upon the testimony of two or three witnesses; a person is not to be put to death upon the testimony of a single witness."},{"num":7,"verse":"The witnesses will be the first to raise their hand against him to put him to death, then all of the people will raise their hands against him, in order to purge this evil from your midst."},{"num":8,"verse":"Judges. If cases come before you that are too difficult to judge, whether concerning bloodshed, or lawsuits, or assault, then take them to the place that the Lord, your God, will choose."},{"num":9,"verse":"Go to the priests, the Levites, and the judge whose term it is, and consult with them. They will give you a verdict."},{"num":10,"verse":"You must proceed according to the verdict that they will have given you at the place that the Lord will choose. Do everything that they tell you to do."},{"num":11,"verse":"Act according to the law that they teach you and the judgment that they render. Do not turn away from the sentence that they pronounce, either to the right or the left."},{"num":12,"verse":"The man who acts presumptuously by not obeying either the priest who stands before the Lord, your God, to minister there, or the judge, is to die. In this way you will purge the evil from Israel."},{"num":13,"verse":"All the people will hear of it and be filled with fear; they will not act presumptuously anymore."},{"num":14,"verse":"A Suitable King. When you enter the land that the Lord, your God, has given you and you take possession of it and dwell there and you say, “I will set a king over me like all the other nations that surround me,”"},{"num":15,"verse":"you can indeed have a king whom the Lord, your God, will choose. You will make one of your brethren your king, you are not to choose a foreigner as king who is not one of your brethren."},{"num":16,"verse":"He must not build up a large stable for himself, and he must not send people back to Egypt to procure a large stable, for the Lord has said that you are not to return that way again."},{"num":17,"verse":"He should also not have many wives, lest his heart be turned astray. He must not accumulate large sums of silver or gold."},{"num":18,"verse":"When he takes the throne of his kingdom, he is to write a copy of the law that is entrusted to the priests, the Levites for himself on a scroll."},{"num":19,"verse":"He should read it every day of his life so that he can learn to fear the Lord, his God, and to observe all the words of these laws and statutes, fulfilling them."},{"num":20,"verse":"In this way he will not consider himself to be better than his brethren in his heart, and he will not turn away from the commandments to the right or the left. He and his descendants will thus reign a long time in the kingdom of Israel."}]