[{"num":17,"verse":"“Do not give to the Lord your God a bull or a sheep which is not perfect. For that is a hated thing to the Lord your God."},{"num":2,"verse":"“You may find among you, within any of your towns the Lord your God gives you, a man or a woman who does what is sinful in the eyes of the Lord your God by sinning against the Lord’s agreement. "},{"num":3,"verse":"If he has served other gods and worshiped them, or the sun, or the moon or the stars, which I have told him not to worship, "},{"num":4,"verse":"and if someone told you about this, then you should do your best to find out if it is true. If it is true that this hated thing has been done in Israel, "},{"num":5,"verse":"then bring that man or woman who has done this sinful act to your gates, and kill the man or woman with stones. "},{"num":6,"verse":"If two or three people tell what they know against this person, he who is to die must be put to death. But he should not be put to death if only one person speaks against him. "},{"num":7,"verse":"Those who speak against him should be first to put him to death. And then all the people should join them. You must get rid of all sin from among you."},{"num":8,"verse":"“There may be a problem too hard for you to decide, between two kinds of killing, between two kinds of questions about the law, between two kinds of hurting, problems argued about in your courts. Then get up and go to the place which the Lord your God chooses. "},{"num":9,"verse":"Go to the Levite religious leader or the judge who is at work at that time. Ask them, and they will tell you what they decide. "},{"num":10,"verse":"Then do what should be done by what they tell you they have decided at that place which the Lord chooses. Be careful to do all they tell you. "},{"num":11,"verse":"Do what they teach you about the Law and about what they decide. Do not turn aside from what they tell you to do, to the right or to the left. "},{"num":12,"verse":"The man must die who does foolish things and will not listen to the judge or the religious leader who serves the Lord your God. You must get rid of sin from Israel. "},{"num":13,"verse":"Then all the people will hear and be afraid. They will not act in a foolish way again."},{"header":"A King"},{"num":14,"verse":"“When you go into the land the Lord your God gives you, and own it and live in it, and you say, ‘I will have a king rule over me like all the nations around me,’ "},{"num":15,"verse":"then you will set a king over you whom the Lord your God chooses. Set a king over you from among your brothers. Do not give a stranger power over you if he is not your brother. "},{"num":16,"verse":"He must not take many horses for himself or make the people return to Egypt to get many horses. Because the Lord has told you, ‘You must never again return that way.’ "},{"num":17,"verse":"He must not take many wives for himself or his heart may turn away. And he must not gather much silver and gold for himself."},{"num":18,"verse":"“When he sits on the throne of his nation, he should write this Law for himself in a book in front of the Levite religious leaders. "},{"num":19,"verse":"It should be kept with him and he should read it all the days of his life. Then he will learn to fear the Lord his God, by being careful to obey all the words of these Laws. "},{"num":20,"verse":"And he will not think he is better than his brothers. He will not turn aside from the Law, to the right or to the left, so that he and his children may live long in his nation in Israel."}]