[{"num":14,"verse":"It occurred one Sabbath, when [Jesus] went for a meal at the house of one of the ruling Pharisees, that they were [engaged in] watching Him [closely]."},{"num":2,"verse":"And behold, [just] in front of Him there was a man who had dropsy."},{"num":3,"verse":"And Jesus asked the lawyers and the Pharisees, Is it lawful and right to cure on the Sabbath or not?"},{"num":4,"verse":"But they kept silent. Then He took hold [of the man] and cured him and sent him away."},{"num":5,"verse":"And He said to them, Which of you, having a son or a donkey or an ox that has fallen into a well, will not at once pull him out on the Sabbath day?"},{"num":6,"verse":"And they were unable to reply to this."},{"num":7,"verse":"Now He told a parable to those who were invited, [when] He noticed how they were selecting the places of honor, saying to them,"},{"num":8,"verse":"When you are invited by anyone to a marriage feast, do not recline on the chief seat [in the place of honor], lest a more distinguished person than you has been invited by him,"},{"num":9,"verse":"And he who invited both of you will come to you and say, Let this man have the place [you have taken]. Then, with humiliation and a guilty sense of impropriety, you will begin to take the lowest place."},{"num":10,"verse":"But when you are invited, go and recline in the lowest place, so that when your host comes in, he may say to you, Friend, go up higher! Then you will be honored in the presence of all who sit [at table] with you."},{"num":11,"verse":"For everyone who exalts himself will be humbled (ranked below others who are honored or rewarded), and he who humbles himself (keeps a modest opinion of himself and behaves accordingly) will be exalted (elevated in rank)."},{"num":12,"verse":"Jesus also said to the man who had invited Him, When you give a dinner or a supper, do not invite your friends or your brothers or your relatives or your wealthy neighbors, lest perhaps they also invite you in return, and so you are paid back."},{"num":13,"verse":"But when you give a banquet or a reception, invite the poor, the disabled, the lame, and the blind."},{"num":14,"verse":"Then you will be blessed (happy, fortunate, and to be envied), because they have no way of repaying you, and you will be recompensed at the resurrection of the just (upright)."},{"num":15,"verse":"When one of those who reclined [at the table] with Him heard this, he said to Him, Blessed (happy, fortunate, and to be envied) is he who shall eat bread in the kingdom of God!"},{"num":16,"verse":"But Jesus said to him, A man was once giving a great supper and invited many;"},{"num":17,"verse":"And at the hour for the supper he sent his servant to say to those who had been invited, Come, for all is now ready."},{"num":18,"verse":"But they all alike began to make excuses and to beg off. The first said to him, I have bought a piece of land, and I have to go out and see it; I beg you, have me excused."},{"num":19,"verse":"And another said, I have bought five yoke of oxen, and I am going to examine and put my approval on them; I beg you, have me excused."},{"num":20,"verse":"And another said, I have married a wife, and because of this I am unable to come."},{"num":21,"verse":"So the servant came and reported these [answers] to his master. Then the master of the house said in wrath to his servant, Go quickly into the great streets and the small streets of the city and bring in here the poor and the disabled and the blind and the lame."},{"num":22,"verse":"And the servant [returning] said, Sir, what you have commanded me to do has been done, and yet there is room."},{"num":23,"verse":"Then the master said to the servant, Go out into the highways and hedges and urge and constrain [them] to yield and come in, so that my house may be filled."},{"num":24,"verse":"For I tell you, not one of those who were invited shall taste my supper."},{"num":25,"verse":"Now huge crowds were going along with [Jesus], and He turned and said to them,"},{"num":26,"verse":"If anyone comes to Me and does not hate his [own] father and mother [in the sense of indifference to or relative disregard for them in comparison with his attitude toward God] and [likewise] his wife and children and brothers and sisters—[yes] and even his own life also—he cannot be My disciple."},{"num":27,"verse":"Whoever does not persevere and carry his own cross and come after (follow) Me cannot be My disciple."},{"num":28,"verse":"For which of you, wishing to build a farm building, does not first sit down and calculate the cost [to see] whether he has sufficient means to finish it?"},{"num":29,"verse":"Otherwise, when he has laid the foundation and is unable to complete [the building], all who see it will begin to mock and jeer at him,"},{"num":30,"verse":"Saying, This man began to build and was not able (worth enough) to finish."},{"num":31,"verse":"Or what king, going out to engage in conflict with another king, will not first sit down and consider and take counsel whether he is able with ten thousand [men] to meet him who comes against him with twenty thousand?"},{"num":32,"verse":"And if he cannot [do so], when the other king is still a great way off, he sends an envoy and asks the terms of peace."},{"num":33,"verse":"So then, any of you who does not forsake (renounce, surrender claim to, give up, say good-bye to) all that he has cannot be My disciple."},{"num":34,"verse":"Salt is good [an excellent thing], but if salt has lost its strength and has become saltless (insipid, flat), how shall its saltness be restored?"},{"num":35,"verse":"It is fit neither for the land nor for the manure heap; men throw it away. He who has ears to hear, let him listen and consider and comprehend by hearing!"}]