[{"num":14,"verse":"One Shabbat Yeshua went to eat in the home of one of the leading P’rushim, and they were watching him closely. "},{"num":2,"verse":"In front of him was a man whose body was swollen with fluid. "},{"num":3,"verse":"Yeshua spoke up and asked the Torah experts and P’rushim, “Does the Torah allow healing on Shabbat or not?” "},{"num":4,"verse":"But they said nothing. So, taking hold of him, he healed him and sent him away. "},{"num":5,"verse":"To them he said, “Which of you, if a son or an ox falls into a well, will hesitate to haul him out on Shabbat?” "},{"num":6,"verse":"And to these things they could give no answer."},{"num":7,"verse":"When Yeshua noticed how the guests were choosing for themselves the best seats at the table, he told them this parable: "},{"num":8,"verse":"“When you are invited by someone to a wedding feast, don’t sit down in the best seat; because if there is someone more important than you who has been invited, "},{"num":9,"verse":"the person who invited both of you might come and say to you, ‘Give this man your place.’ Then you will be humiliated as you go to take the least important place. "},{"num":10,"verse":"Instead, when you are invited, go and sit in the least important place; so that when the one who invited you comes, he will say to you, ‘Go on up to a better seat.’ Then you will be honored in front of everyone sitting with you. "},{"num":11,"verse":"Because everyone who exalts himself will be humbled, but everyone who humbles himself will be exalted.”"},{"num":12,"verse":"Yeshua also said to the one who had invited him, “When you give a lunch or a dinner, don’t invite your friends, brothers, relatives or rich neighbors; for they may well invite you in return, and that will be your repayment. "},{"num":13,"verse":"Instead, when you have a party, invite poor people, disfigured people, the crippled, the blind! "},{"num":14,"verse":"How blessed you will be that they have nothing with which to repay you! For you will be repaid at the resurrection of the righteous.”"},{"num":15,"verse":"On hearing this, one of the people at the table with Yeshua said to him, “How blessed are those who eat bread in the Kingdom of God!” "},{"num":16,"verse":"But he replied, “Once a man gave a banquet and invited many people. "},{"num":17,"verse":"When the time came for the banquet, he sent his slave to tell those who had been invited, ‘Come! Everything is ready!’ "},{"num":18,"verse":"But they responded with a chorus of excuses. The first said to him, ‘I’ve just bought a field, and I have to go out and see it. Please accept my apologies.’ "},{"num":19,"verse":"Another said, ‘I’ve just bought five yoke of oxen, and I’m on my way to test them out. Please accept my apologies.’ "},{"num":20,"verse":"Still another said, ‘I have just gotten married, so I can’t come.’ "},{"num":21,"verse":"The slave came and reported these things to his master."},{"num":22,"verse":"The slave said, ‘Sir, what you ordered has been done, and there is still room.’ "},{"num":23,"verse":"The master said to the slave, ‘Go out to the country roads and boundary walls, and insistently persuade people to come in, so that my house will be full. "},{"num":24,"verse":"I tell you, not one of those who were invited will get a taste of my banquet!’”"},{"num":25,"verse":"Large crowds were traveling along with Yeshua. Turning, he said to them, "},{"num":26,"verse":"“If anyone comes to me and does not hate his father, his mother, his wife, his children, his brothers and his sisters, yes, and his own life besides, he cannot be my talmid. "},{"num":27,"verse":"Whoever does not carry his own execution-stake and come after me cannot be my talmid."},{"num":28,"verse":"“Suppose one of you wants to build a tower. Don’t you sit down and estimate the cost, to see if you have enough capital to complete it? "},{"num":29,"verse":"If you don’t, then when you have laid the foundation but can’t finish, all the onlookers start making fun of you "},{"num":30,"verse":"and say, ‘This is the man who began to build, but couldn’t finish!’"},{"num":31,"verse":"“Or again, suppose one king is going out to wage war with another king. Doesn’t he first sit down and consider whether he, with his ten thousand troops, has enough strength to meet the other one, who is coming against him with twenty thousand? "},{"num":32,"verse":"If he hasn’t, then while the other is still far away, he sends a delegation to inquire about terms for peace."},{"num":33,"verse":"“So every one of you who doesn’t renounce all that he has cannot be my talmid. "},{"num":34,"verse":"Salt is excellent. But if even the salt becomes tasteless, what can be used to season it? "},{"num":35,"verse":"It is fit for neither soil nor manure — people throw it out. Those who have ears that can hear, let them hear!”"}]