[{"header":"Jesus Attends a Banquet"},{"num":14,"verse":"On a day of rest—a holy day, Jesus went to eat at the home of a prominent Pharisee. The guests were watching Jesus very closely."},{"num":2,"verse":"A man whose body was swollen with fluid was there. "},{"num":3,"verse":"Jesus reacted by asking the Pharisees and the experts in Moses’ Teachings, “Is it right to heal on the day of rest—a holy day, or not?” "},{"num":4,"verse":"But they didn’t say a thing."},{"num":5,"verse":"Jesus asked them, “If your son or your ox falls into a well on a day of rest—a holy day, wouldn’t you pull him out immediately?” "},{"num":6,"verse":"They couldn’t argue with him about this."},{"num":7,"verse":"Then Jesus noticed how the guests always chose the places of honor. So he used this illustration when he spoke to them: "},{"num":8,"verse":"“When someone invites you to a wedding, don’t take the place of honor. Maybe someone more important than you was invited. "},{"num":9,"verse":"Then your host would say to you, ‘Give this person your place.’ Embarrassed, you would have to take the place of least honor. "},{"num":10,"verse":"So when you’re invited, take the place of least honor. Then, when your host comes, he will tell you, ‘Friend, move to a more honorable place.’ Then all the other guests will see how you are honored. "},{"num":11,"verse":"Those who honor themselves will be humbled, but people who humble themselves will be honored.”"},{"num":12,"verse":"Then he told the man who had invited him, “When you invite people for lunch or dinner, don’t invite only your friends, family, other relatives, or rich neighbors. Otherwise, they will return the favor. "},{"num":13,"verse":"Instead, when you give a banquet, invite the poor, the handicapped, the lame, and the blind. "},{"num":14,"verse":"Then you will be blessed because they don’t have any way to pay you back. You will be paid back when those who have God’s approval come back to life.”"},{"num":15,"verse":"One of those eating with him heard this. So he said to Jesus, “The person who will be at the banquet in God’s kingdom is blessed.”"},{"num":16,"verse":"Jesus said to him, “A man gave a large banquet and invited many people. "},{"num":17,"verse":"When it was time for the banquet, he sent his servant to tell those who were invited, ‘Come! Everything is ready now.’"},{"num":18,"verse":"“Everyone asked to be excused. The first said to him, ‘I bought a field, and I need to see it. Please excuse me.’ "},{"num":19,"verse":"Another said, ‘I bought five pairs of oxen, and I’m on my way to see how well they plow. Please excuse me.’ "},{"num":20,"verse":"Still another said, ‘I recently got married, and that’s why I can’t come.’"},{"num":21,"verse":"“The servant went back to report this to his master. Then the master of the house became angry. He told his servant, ‘Run to every street and alley in the city! Bring back the poor, the handicapped, the blind, and the lame.’"},{"num":22,"verse":"“The servant said, ‘Sir, what you’ve ordered has been done. But there is still room for more people.’"},{"num":23,"verse":"“Then the master told his servant, ‘Go to the roads and paths! Urge the people to come to my house. I want it to be full. "},{"num":24,"verse":"I can guarantee that none of those invited earlier will taste any food at my banquet.’ ”"},{"header":"The Cost of Being a Disciple"},{"num":25,"verse":"Large crowds were traveling with Jesus. He turned to them and said, "},{"num":26,"verse":"“If people come to me and are not ready to abandon their fathers, mothers, wives, children, brothers, and sisters, as well as their own lives, they cannot be my disciples. "},{"num":27,"verse":"So those who do not carry their crosses and follow me cannot be my disciples."},{"num":28,"verse":"“Suppose you want to build a tower. You would first sit down and figure out what it costs. Then you would see if you have enough money to finish it. "},{"num":29,"verse":"Otherwise, if you lay a foundation and can’t finish the building, everyone who watches will make fun of you. "},{"num":30,"verse":"They’ll say, ‘This person started to build but couldn’t finish the job.’"},{"num":31,"verse":"“Or suppose a king is going to war against another king. He would first sit down and think things through. Can he and his 10,000 soldiers fight against a king with 20,000 soldiers? "},{"num":32,"verse":"If he can’t, he’ll send ambassadors to ask for terms of peace while the other king is still far away. "},{"num":33,"verse":"In the same way, none of you can be my disciples unless you give up everything."},{"num":34,"verse":"“Salt is good. But if salt loses its taste, how will you restore its flavor? "},{"num":35,"verse":"It’s not any good for the ground or for the manure pile. People throw it away."}]