[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ænon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "near to Salim.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The latter place was clearly well known at the time, and regarded as fixing the locality of the former. It has been usual to follow Jerome and Eusebius, who fix the place in the valley of the Jordan, eight miles south from Bethshan, or Scythopolis. (See quotation from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Onomasticon,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Caspari, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Chron. and Geogr. Introd.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Eng. Trans., p. 122.) The objection to this is, that the text seems to limit us to Judæa (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:3-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whereas this Salim is more than thirty miles from it. The word Ænon means “springs,” and probably belonged to more than one place where “there was much water.” The mention of this is opposed to the locality of the Jordan valley, where it would not be necessary to choose a place for this reason. Dr. Barclay (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "City of the Great Xing,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1858, pp. 558-570) found both names in a place answering the description, and certainly answering the narrative better than other identifications, at ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wady Farah,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " about five miles from Jerusalem.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They came—i.e., the people.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "They came",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—i.e., the people.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:22-36 John was fully satisfied with the place and work assigned him; but Jesus came on a more important work. He also knew that Jesus would increase in honour and influence, for of his government and peace there would be no end, while he himself would be less followed. John knew that Jesus came from heaven as the Son of God, while he was a sinful, mortal man, who could only speak about the more plain subjects of religion. The words of Jesus were the words of God; he had the Spirit, not by measure, as the prophets, but in all fulness. Everlasting life could only be had by faith in Him, and might be thus obtained; whereas all those, who believe not in the Son of God, cannot partake of salvation, but the wrath of God for ever rests upon them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In Enon - The word \"Enon,\" or \"Aenon,\" means \"a fountain,\" and was doubtless given to this place because of the fountains there. On the situation of the place nothing certain has been determined. Eusebius places it eight Roman miles south of Scythopolis or Bethshan, and 53 miles northeast of Jerusalem.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Near to Salim - It would seem from this that Salim was better known then than Enon, but nothing can be determined now respecting its site. These places are believed to have been on the west side of the Jordan.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because there was much water there - John's preaching attracted great multitudes. It appears that they remained with him probably many days. In many parts of that country, particularly in the hilly region near where John preached, it was difficult to find water to accommodate the necessities of the people, and perhaps, also, of the camels with which those from a distance would come. To meet their necessities, as well as for the purpose of baptizing, he selected a spot that was well watered, probably, with springs and rivulets. Whether the ordinance of baptism was performed by immersion or in any other mode, the selection of a place well watered was proper and necessary. The mention of the fact that there was much water there, and that John selected that as a convenient place to perform his office as a baptizer, proves nothing in regard to the mode in which the ordinance was administered, since he would naturally select such a place, whatever was the mode.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Where numbers of people came together to remain any time, it is necessary to select such a place, whatever their employment. An encampment of soldiers is made on the same principles, and in every camp-meeting that I have ever seen, a place is selected where there is a good supply of water, though not one person should be immersed during the whole services. As all the facts in the case are fully met by the supposition that John might have baptized in some other way besides immersion, and as it is easy to conceive another reason that is sufficient to account for the fact that such a place was selected, this passage certainly should not be adduced to prove that he performed baptism only in that manner. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Where numbers of people came together to remain any time, it is necessary to select such a place, whatever their employment. An encampment of soldiers is made on the same principles, and in every camp-meeting that I have ever seen, a place is selected where there is a good supply of water, though not one person should be immersed during the whole services. As all the facts in the case are fully met by the supposition that John might have baptized in some other way besides immersion, and as it is easy to conceive another reason that is sufficient to account for the fact that such a place was selected, this passage certainly should not be adduced to prove that he performed baptism only in that manner. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. Ænon … Salim—on the west of Jordan. (Compare Joh 3:26 with Joh 1:28).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Aenon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here said to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "near Salim:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it was the name of a city, as some think; others say, a river or brook near that city: neither the river nor the city are elsewhere mentioned in Scripture; but topographers place it on the eastern part of the lot of Manasseh, not far from Bethshan or Scythopolis. There John was baptizing; because this Aenon was a brook or river that had much water, which in Judea was rare. There is no water more holy than the other. John baptized in Jordan, and in Bethabara, and in Aenon. The ordinance sanctified the water, but did not require consecrated water for the due administration of it. It is from this apparent that both Christ and John baptized by dipping the body in the water, else they need not have sought places where had been a great plenty of water; yet it is probable that they did not constantly dip, from what we read of the apostles baptizing in houses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 9:17,18 10:47,48",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 9:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",18 10:47,48",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The people came to John and were baptized, that is, great numbers of them did so. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And John also was baptizing in Aenon,.... The Syriac and Persic versions call it \"Ain\", or \"In you\", the fountain of the dove; and the Arabic version reads it, the fountain of \"Nun\": and whether it was a town, or river, it seems to have its name from a fountain near it, or that itself was one, where was an abundance of water, as the text shows. There is a city of this name in the Septuagint version of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:61",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and mention is made of Hazerenon in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 34:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but neither of them seem to be the same with this; but be it where, and what it will, it was ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "near to Salim; and where that was, is as difficult to know as the other, some take it to be Shalem, a city of Shechem, mentioned in  Genesis 33:18, but that is not the same name with this; and besides was in Samaria; and indeed is by some there thought not to be the proper name of any place. Others are of opinion, that it is the same with Shalim in 1 Samuel 9:4, though it seems rather to be the place which Arias Montanus calls (o) \"Salim juxta torrentem\", Salim by the brook; and which he places in the tribe of Issachar: and might be so called, either because it was near this Aenon, and may be the brook, or river intended, by which it was; or because it was not far from the place where the two rivers, Jabbok and Jordan, met; and so the Jewish maps place near Jordan, in the tribe of Manasseh, bordering on the tribe of Issachar, a Shalem, and by it Ain-yon. And the Septuagint in Joshua 19:22 mention \"Salim by the sea\", as in the tribe of Issachar. There is a passage in the Talmud (p), which, whether it has any regard to this Aenon, and Salim, I leave to be considered: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "near to Salim; and where that was, is as difficult to know as the other, some take it to be Shalem, a city of Shechem, mentioned in  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 33:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but that is not the same name with this; and besides was in Samaria; and indeed is by some there thought not to be the proper name of any place. Others are of opinion, that it is the same with Shalim in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", though it seems rather to be the place which Arias Montanus calls (o) \"Salim juxta torrentem\", Salim by the brook; and which he places in the tribe of Issachar: and might be so called, either because it was near this Aenon, and may be the brook, or river intended, by which it was; or because it was not far from the place where the two rivers, Jabbok and Jordan, met; and so the Jewish maps place near Jordan, in the tribe of Manasseh, bordering on the tribe of Issachar, a Shalem, and by it Ain-yon. And the Septuagint in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 19:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mention \"Salim by the sea\", as in the tribe of Issachar. There is a passage in the Talmud (p), which, whether it has any regard to this Aenon, and Salim, I leave to be considered: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the wine of Ogedoth, why is it forbidden? because of the village Pegesh; and that of Borgetha, because of the Saracene palace; and of Ain-Cushith, because of the village Salem.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nonnus here calls Aenon, a place of deep waters; and Salim he reads Salem; and so some copies. Aenon, where John baptized, according to Jerom (q), was eight miles from Scythopolis, to the south, and was near Salim and Jordan; and he makes Salim to be at the same distance from Scythopolis. However, John was baptizing in these parts, at the same time that Christ was teaching and baptizing: he did not leave off on that account. This was the work he was sent to do, and which he continued in as long as he had his liberty; and be chose this place, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because there was much water there; or \"many waters\"; not little purling streams, and rivulets; but, as Nonnus renders it, abundance of water; or a multitude of it, as in the Arabic version; see Revelation 1:15 and the Septuagint in Psalm 78:16, and what was sufficient to immerse the whole body in, as Calvin, Aretius, Piscator, and Grotius, on the place, observe; and which was agreeable not only to: the practice of the Jews, who used dipping in their baptisms, and purifications, as Musculus and Lightfoot assert; but to John's method and practice elsewhere: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because there was much water there; or \"many waters\"; not little purling streams, and rivulets; but, as Nonnus renders it, abundance of water; or a multitude of it, as in the Arabic version; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and the Septuagint in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and what was sufficient to immerse the whole body in, as Calvin, Aretius, Piscator, and Grotius, on the place, observe; and which was agreeable not only to: the practice of the Jews, who used dipping in their baptisms, and purifications, as Musculus and Lightfoot assert; but to John's method and practice elsewhere: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and they came, and were baptized. The Ethiopic version renders it, \"they came to him\", that is, to John, \"and he baptized them\"; as the Persic version adds, \"there\", in Aenon, near Salim, in the much water there: it may be understood of the people coming both to John and Christ, and of their being baptized by them; though it seems rather to be said of John; and so Nonnus paraphrases it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Antiqu. Jud. l. 2. c. 3.((p) T. Hieros. Avoda Zara, fol. 44. 4. (q) De locis Hebraicis fol. 89. C. & fol, 94. F. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) Antiqu. Jud. l. 2. c. 3.((p) T. Hieros. Avoda Zara, fol. 44. 4. (q) De locis Hebraicis fol. 89. C. & fol, 94. F. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And John also was baptizing in Aenon near to Salim, because there was much water there: and they came, and were baptized.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἦν δὲ καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And John also was baptising, although he had said that he was sent to baptise in order that the Messiah might be identified; which had already been done. But John saw that men might still be prepared for the reception of the Messiah by his preaching and baptism. Hence, however, the questioning which arose, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The locality is described as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Αἰνὼν ἐγγὺς τοῦ Σαλείμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “The Salim of this place is no doubt the Shalem of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 33:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and some seven miles north is ’Ainûn [= Springs], at the head of the Wâdy Fâr’ah, which is the great highway up from the Damieh ford for those coming from the east by the way of Peniel and Succoth” (Henderson’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Palestine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 154). The reason for choosing this locality was ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι ὕδατα πολλὰ ἦν ἐκεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “because many waters were there,’ or much water; and therefore even in summer baptism by immersion could be continued. It is not “the people’s refreshment” that is in view. Why mention this any more than where they got their food?—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ παρεγίνοντο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the indefinite third plural, as frequently in N.T. and regularly in English, “they continued coming”.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "John also was baptizing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Not as a rival to the Messiah, but still in preparation for Him. Although John knew that the Messiah had come, yet He had not yet taken the public position which John had expected Him to take, and hence John was by no means led to suppose that his own office in preaching repentance was at an end. There is no improbability in Jesus and John baptizing side by side. But with this difference; Jesus seldom, if ever, administered His own baptism; John apparently always did administer his.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Aenon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The name means ‘springs.’ The identifications of both Aenon and Salim remain uncertain. The most probable conjecture is the Wâdy Fâr’ah, running from Mount Ebal to Jordan, an open vale, full of springs. There is a Salim three miles south of the valley, and the name of Aenon survives in ’Ainûn, a village four miles north of the waters.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "much water",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For immersion; the Greek means literally ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "many waters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The remark shews that these places were not on the Jordan. It would be gratuitous to say of the Jordan that ‘there was much water there.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Αἰνών",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ænon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עין",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a fountain.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The article in the masculine gender points to some[57] region.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πολλά",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "many",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [waters]) So the rite of immersion required.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[57] Particular, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "well-known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And John also was baptizing in AEnon, near to Salim, because there were many waters there; and they came, and were baptized.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There is much difficulty in determining the site of AEnon, near Saleim. Eusebius and Jerome (in 'Onomasticon') place it in the northern part of Samaria, about eight miles south of Scythopolis (Jerome, 'Ad Evagrium,' Ep. 126; Epiph., 'Haer.,' 55:2; Winer, 'Real Wort.,' 1:33; Lucke, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in loc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Thomson, 'The Land and the Book,' 2:176). This does not well accord with the statement that Jesus was \"in Judaea,\" and proposed to \"pass through Samaria\" (cf. ver. 22; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It may be observed, however, that our narrative does not limit the scene of our Lord's Judaean ministry to any one place, nor does it assert that the Baptist and Jesus were in near proximity, but rather the reverse. There is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Shilhim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with which is associated an ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or fountain) - a word closely resembling \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "AEnon.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This would seem to have been in the south of Judaea. Godet thinks that, since ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Ain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Rimmon are",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " associated with each other in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 19:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 4:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and an ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "En-Remmon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is spoken of in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 11:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that we have in this blending the origin of the word \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "AEnon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".\" He thinks that the presence of waters is more likely to be specified in a dry region like that of the border of Edom than in a fertile district like Samaria; and he goes on to argue that Jesus may therefore have travelled south between Hebron and Beersheba, even as, in the synoptics, we find him in Caesarea Philippi, the northernmost portion of the Holy Land. Certainly he may have tarried there during the eight months, but we have no right to establish it from this passage. It is not said that Jesus was at AEnon. Dr. Barclay (1858) reports the discovery of AEnon at ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Wady Far'ah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a secluded valley five miles northeast of Jerusalem (Grove, Smith's ' Dict. Bible'). The recent discoveries of the Palestine Exploration Society find this Enun (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Aynun",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Saleim not far from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Askar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or Sychar, where Jesus rested when John's ministry had been suddenly arrested. (Edersheim thinks that this Enon and Salim in ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Wady Far'ah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " leading from Samaria to the Jordan, are too far apart; but see 'Pal. Exp. Fund Report,' 1874, p. 141; 'Pict. Palestine,' 2:237; 'Tent-Work in Palestine,' 1:91-93.) Allegory reaches the point of absurdity when we are told by Theme that neither place nor time are historic. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Salem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is (says he), according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 76:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the tabernacle or place of God, and therefore, according to Philo, indicates the Logos, who thenceforth becomes the Illuminator and Ruler. \"The multitude of waters\" would be suitable, necessary, to any great gatherings such as those which had followed the Baptist to the banks of the Jordan, as well as for baptismal processes. Such a site for AEnon is far more probable, on historical grounds, than is the southern extremity of Judaea; for Herod would have had no jurisdiction there, and would not have been tempted to arrest John's ministrations, nor would he or Herodias have suffered from the Baptist's rebuke of their adultery, if such reproaches had been spoken so far away from the centre of his tetrarchy. If, however, John had made no secret of his disapproval in regions so near to Galilee and Peraea, over which he presided, the consequent irritation of the voluptuous prince may have been more easily aroused, and his vengeance more legitimately taken. But how came John to be still administering baptism with a group of disciples of his own, and doing this long after the amazing announcements he had made in the spring of the year with reference to the rank and functions of the Lord Jesus? This narrative is the true key to the otherwise inexplicable contrariety between the Johannine testimonies to Christ and the message from the prison as described by the synoptists. It is the solution of the mystery that one who hailed Jesus as the Son of God and the Lamb of God and Baptizer with the Holy Spirit, and who was declared by Christ himself to be the greatest of woman born, was, notwithstanding, \"less than the least in the kingdom of heaven.\" John is here shown by ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the fourth evangelist",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  to have been still taking an independent position. He pointed others to Jesus, but he did not enroll himself among his followers. John was at last \"offended\" more than he knew at the humility of Jesus. He still waited for the coming of the Conqueror and the Wielder of the axe; he was looking for the manifested King, for the hour which had not yet come. He is a remarkable specimen of the energy with which a great purpose is embraced by those who are pledged to make it accomplish its end. The preparatory work of John could not, any more than the Hebraism of which it was the highest type, come to an abrupt end voluntarily; hence he continued it even to the peril of sacrificing all its value. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "They came, and were baptized",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; as \"they\" had done at Bethabara. There was some splitting up of the Messianic movement (Keim), and we see the effect of it upon his disciples and him self. Even in the midst of the labours of Paul (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 19:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), we find that Johannine baptism was still practised, and traces of the custom may still be observed in Oriental sects even to the present day. John 3:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Was baptizing (ἦν βαπτίζων)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The substantive verb with the participle also indicating continuous or habitual action; was engaged in baptizing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Aenon, near to Salim",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The situation is a matter of conjecture. The word, Aenon is probably akin to the Hebrew ayin, an eye, a spring. See on James 3:11.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The situation is a matter of conjecture. The word, Aenon is probably akin to the Hebrew ayin, an eye, a spring. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 3:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Much water (ὕδατα πολλὰ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Literally, many waters. Probably referring to a number of pools or springs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Came - were baptized",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Imperfects. They kept coming. ",
        "children": []
      }
    ]
  }
]