[{"num":54,"verse":"Sing, O barren one, you who did not bear; break forth into singing and cry aloud, you who did not travail with child! For the [spiritual] children of the desolate one will be more than the children of the married wife, says the Lord."},{"num":2,"verse":"Enlarge the place of your tent, and let the curtains of your habitations be stretched out; spare not; lengthen your cords and strengthen your stakes,"},{"num":3,"verse":"For you will spread abroad to the right hand and to the left; and your offspring will possess the nations and make the desolate cities to be inhabited."},{"num":4,"verse":"Fear not, for you shall not be ashamed; neither be confounded and depressed, for you shall not be put to shame. For you shall forget the shame of your youth, and you shall not [seriously] remember the reproach of your widowhood any more."},{"num":5,"verse":"For your Maker is your Husband—the Lord of hosts is His name—and the Holy One of Israel is your Redeemer; the God of the whole earth He is called."},{"num":6,"verse":"For the Lord has called you like a woman forsaken, grieved in spirit, and heartsore—even a wife [wooed and won] in youth, when she is [later] refused and scorned, says your God."},{"num":7,"verse":"For a brief moment I forsook you, but with great compassion and mercy I will gather you [to Me] again."},{"num":8,"verse":"In a little burst of wrath I hid My face from you for a moment, but with age-enduring love and kindness I will have compassion and mercy on you, says the Lord, your Redeemer."},{"num":9,"verse":"For this is like the days of Noah to Me; as I swore that the waters of Noah should no more go over the earth, so have I sworn that I will not be angry with you or rebuke you."},{"num":10,"verse":"For though the mountains should depart and the hills be shaken or removed, yet My love and kindness shall not depart from you, nor shall My covenant of peace and completeness be removed, says the Lord, Who has compassion on you."},{"num":11,"verse":"O you afflicted [city], storm-tossed and not comforted, behold, I will set your stones in fair colors [in antimony to enhance their brilliance] and lay your foundations with sapphires."},{"num":12,"verse":"And I will make your windows and pinnacles of [sparkling] agates or rubies, and your gates of [shining] carbuncles, and all your walls [of your enclosures] of precious stones."},{"num":13,"verse":"And all your [spiritual] children shall be disciples [taught by the Lord and obedient to His will], and great shall be the peace and undisturbed composure of your children."},{"num":14,"verse":"You shall establish yourself in righteousness (rightness, in conformity with God’s will and order): you shall be far from even the thought of oppression or destruction, for you shall not fear, and from terror, for it shall not come near you."},{"num":15,"verse":"Behold, they may gather together and stir up strife, but it is not from Me. Whoever stirs up strife against you shall fall and surrender to you."},{"num":16,"verse":"Behold, I have created the smith who blows on the fire of coals and who produces a weapon for its purpose; and I have created the devastator to destroy."},{"num":17,"verse":"But no weapon that is formed against you shall prosper, and every tongue that shall rise against you in judgment you shall show to be in the wrong. This [peace, righteousness, security, triumph over opposition] is the heritage of the servants of the Lord [those in whom the ideal Servant of the Lord is reproduced]; this is the righteousness or the vindication which they obtain from Me [this is that which I impart to them as their justification], says the Lord."}]