[{"header":"The Lord Loves Israel"},{"num":54,"verse":"“Woman, be happy, you who have had no children. Cry for joy, you who have never had the pains of having a child, for you will have many children. Yes, you will have more children than the one who has a husband,” says the Lord. "},{"num":2,"verse":"“Make your tent bigger. Spread out the curtains of your home, and do not hold back. Make your ropes longer and your tie-downs stronger. "},{"num":3,"verse":"For you will spread out to the right and to the left. Your children will own nations, and they will fill the destroyed cities with people."},{"num":4,"verse":"“Fear not, for you will not be ashamed. Do not be troubled, for you will not be put to shame. You will forget how you were ashamed when you were young. You will not remember the sorrow of being without a husband any more. "},{"num":5,"verse":"Your Maker is your husband. His name is the Lord of All. And the One Who saves you is the Holy One of Israel. He is called the God of All the earth. "},{"num":6,"verse":"For the Lord has called you like a wife left alone and filled with sorrow, like a wife who married when young and is left,” says your God. "},{"num":7,"verse":"“For a short time I left you, but with much loving-pity I will take you back. "},{"num":8,"verse":"When I was very angry I hid My face from you for a short time. But with loving-kindness that lasts forever I will have pity on you,” says the Lord Who bought you and saves you."},{"num":9,"verse":"“For this is like the days of Noah to Me. As I promised that the waters of Noah should not flood the earth again, so I have promised that I will not be angry with you or speak sharp words to you. "},{"num":10,"verse":"The mountains may be taken away and the hills may shake, but My loving-kindness will not be taken from you. And My agreement of peace will not be shaken,” says the Lord who has loving-pity on you."},{"num":11,"verse":"“O suffering one, shaken by the storm and not comforted, see, I will set your stones in beautiful colors. You will stand upon blue stones of much worth. "},{"num":12,"verse":"I will make your towers of bright red stones. Your gates will be made of shining stones, and all your walls will be made of stones of great worth. "},{"num":13,"verse":"All your sons will be taught by the Lord, and the well-being of your children will be great. "},{"num":14,"verse":"All will be right and good for you. No one over you will make it hard for you, and you will not be afraid. You will be far from trouble, for it will not come near you. "},{"num":15,"verse":"If anyone brings trouble against you, it will not be from Me. Whoever comes against you will fall because of you. "},{"num":16,"verse":"See, I Myself have made the workman who blows on the fire to give it more heat and makes a sword for its work. I have made the destroyer to destroy. "},{"num":17,"verse":"No tool that is made to fight against you will do well. And you will prove wrong every tongue that says you are guilty. This is the gift given to the servants of the Lord. I take away their guilt and make them right,” says the Lord."}]