[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9)",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His lot was to burn incense.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The order of the courses was, as has been said, one of rotation. The distribution of functions during the week was determined by lot. That of offering incense, symbolising, as it did, the priestly work of presenting the prayers of the people, and joining his own with them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 141:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), was of all priestly acts the most distinctive (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 26:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). At such a moment all the hopes of one who looked for the Christ as the consolation of Israel would gather themselves into one great intercession.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Into the temple of the Lord—i.e., the Holy Place, into which none but the priests might enter.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Into the temple of the Lord",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—i.e., the Holy Place, into which none but the priests might enter.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 1:9. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His lot was to burn incense ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— “Because some parts of the sacred service were more honourable than others, both the priests and Levites divided the whole among them by lot. The Jews tell us, that there were three priests employed about the service of the incense; one who carried away the ashes left on the altar at the preceding service; another who brought a pan of burning coals from the altar of sacrifice, and, having placed it on the golden altar, departed; a third, who went in with the incense, sprinkled it on the burning coals, and, while the smoke ascended, made intercession for the people. This was the part that fell to Zacharias, and the most honourable in the whole service.” — Macknight. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When he went into the temple of the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As the original word here is not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "το ιερον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τον ναον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it ought to have been rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sanctuary. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The former word, properly signifying ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the temple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "comprehended the whole edifice, with all its enclosures, piazzas, and other buildings; the latter included only what is termed, by way of eminence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "consisting of the vestibule, the holy place or sanctuary, and the most holy. The altar of incense, on which the perfumes were burned, was in the sanctuary; the people who were praying without, were in the temple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εν το ιερω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the court of Israel, though not in what was strictly called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the house of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:5-25 The father and mother of John the Baptist were sinners as all are, and were justified and saved in the same way as others; but they were eminent for piety and integrity. They had no children, and it could not be expected that Elisabeth should have any in her old age. While Zacharias was burning incense in the temple, the whole multitude of the people were praying without. All the prayers we offer up to God, are acceptable and successful only by Christ's intercession in the temple of God above. We cannot expect an interest therein if we do not pray, and pray with our spirits, and are not earnest in prayer. Nor can we expect that the best of our prayers should gain acceptance, and bring an answer of peace, but through the mediation of Christ, who ever lives, making intercession. The prayers Zacharias often made, received an answer of peace. Prayers of faith are filed in heaven, and are not forgotten. Prayers made when we were young and entering into the world, may be answered when we are old and going out of the world. Mercies are doubly sweet that are given in answer to prayer. Zacharias shall have a son in his old age, who shall be instrumental in the conversion of many souls to God, and preparing them to receive the gospel of Christ. He shall go before Him with courage, zeal, holiness, and a mind dead to earthly interests and pleasures. The disobedient and rebellious would be brought back to the wisdom of their righteous forefathers, or rather, brought to attend to the wisdom of that Just One who was coming among them. Zacharias heard all that the angel said; but his unbelief spake. In striking him dumb, God dealt justly with him, because he had objected against God's word. We may admire the patience of God towards us. God dealt kindly with him, for thus he prevented his speaking any more distrustful, unbelieving words. Thus also God confirmed his faith. If by the rebukes we are under for our sin, we are brought to give the more credit to the word of God, we have no reason to complain. Even real believers are apt to dishonour God by unbelief; and their mouths are stopped in silence and confusion, when otherwise they would have been praising God with joy and gratitude. In God's gracious dealings with us we ought to observe his gracious regards to us. He has looked on us with compassion and favour, and therefore has thus dealt with us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "According to the custom of the priest's office, his lot was. - The Jewish writers inform us that it was customary for the priests to divide their daily task by \"lot.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To burn incense - Incense is an aromatic or white rosin procured from trees, chiefly in Arabia. It is obtained by making incisions in the tree, and the gum flows out. It is distinguished for an especially pleasant \"smell\" when burned, and was therefore used in ancient worship. It was burned by the priest twice a day Exodus 30:7, and it seems to have been emblematic of prayer and praise, or of the grateful offerings of the heart wafted toward heaven. The incense used in the temple was made of stacte, onycha, and galbanum Exodus 30:34, with pure frankincense, and it was not lawful for this compound to be used elsewhere than in the house of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To burn incense - Incense is an aromatic or white rosin procured from trees, chiefly in Arabia. It is obtained by making incisions in the tree, and the gum flows out. It is distinguished for an especially pleasant \"smell\" when burned, and was therefore used in ancient worship. It was burned by the priest twice a day ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and it seems to have been emblematic of prayer and praise, or of the grateful offerings of the heart wafted toward heaven. The incense used in the temple was made of stacte, onycha, and galbanum ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with pure frankincense, and it was not lawful for this compound to be used elsewhere than in the house of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Into the temple - See the notes at Matthew 21:12. The part of the temple where incense was burned was the \"holy place.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Into the temple - See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The part of the temple where incense was burned was the \"holy place.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. his lot was to burn incense—The part assigned to each priest in his week of service was decided by lot. Three were employed at the offering of incense—to remove the ashes of the former service; to bring in and place on the golden altar the pan filled with hot burning coals taken from the altar of burnt offering; and to sprinkle the incense on the hot coals; and, while the smoke of it ascended, to make intercession for the people. This was the most distinguished part of the service (Re 8:3), and this was what fell to the lot of Zacharias at this time [Lightfoot].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 1:8\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "According to the custom of the priest's office,.... In which, every man took his part in the execution of it by lot; and which was not an original settled law of God; but a custom, which, in process of time, through the number of the priests, took place, and prevailed: the occasion of it was this, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"at first, whoever would, might sweep the altar, or cleanse it----it happened that two alike ran, and came up to the ascent of the altar, and one thrust down the other, and he fell, and his leg was broke; and when the sanhedrim saw that they came into danger, they ordered that they should not cleanse the altar, but by lot (d). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And so likewise all other sorts of service were settled by lot: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "his lot was to burn incense, when he went into the temple of the Lord; where was the altar of incense, and which was burnt upon it morning and evening; see Exodus 30:1, and was typical of the continual intercession of Jesus Christ; and this part of service was assigned him by lot. The priests used to cast lots, what part they should take in the service of the temple, in the order of the course, to which they belonged (e), ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "his lot was to burn incense, when he went into the temple of the Lord; where was the altar of incense, and which was burnt upon it morning and evening; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and was typical of the continual intercession of Jesus Christ; and this part of service was assigned him by lot. The priests used to cast lots, what part they should take in the service of the temple, in the order of the course, to which they belonged (e), ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"There were four lots there, and this was the first lot (i.e. to cleanse the altar); the second lot was, who should slay (the sacrifice,) who should sprinkle (the blood), who should remove the ashes from the innermost altar, who should cleanse the candlestick, who should bring the members (or parts of the sacrifice) to the ascent of the altar----the third lot was, ye new ones, to the incense come,  and \"cast lots\"; and the fourth, ye new ones, with the old ones, who shall bring up the parts from the ascent of the altar to the altar. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And this was not only the case on the day of atonement, to which these rules belong; but every day in the daily service and sacrifice, when the same rules were observed, as appears from the rubric of the daily sacrifice: (f). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the president said unto them (the priests), come and cast lots who shall slay, who shall sprinkle, who shall remove the ashes from the innermost altar, who shall remove the ashes from the candlestick, who shall bring up the parts to the ascent of the altar, &c. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Again, (g), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"he says to them, O ye new ones, to the incense come, and cast lots; and they cast lots, and he is worthy, whom he accounts worthy--and he that is accounted worthy of the incense, takes a vessel, and the vessel is like to a large golden bushel, that holds three kabs, and a bowl in the middle of it, full and heaped up with incense, with a cover, and a sort of a linen cloth put over it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And it is afterwards said (h), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"he that is worthy of the incense, takes the bowl out of the vessel, and gives it to his friend, or he that is near to him; and if it is scattered from it, in the midst of it, he puts it into his fist; and they teach him, \"saying\", take care that thou dost not begin before thy face, that thou art not burnt: when he begins, he spreads it and goes out; and he that burns incense, may not do it, until the president says, burn incense. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The account Maimonides gives (i) of this matter, is as follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"all the services that they do every day, they do,  by lot; and how do they do it? All the priests of the houses of the fathers, of the day, go into the paved chamber, after the pillar of the morning has ascended, and clothe themselves with the priestly garments; and the president who is over the lots is with them, and they stand in a circle; and the president takes a mitre from off the head of one of them, and goes round with it, and the man from whom he begins to number, and they cast lots, as has been explained----how do they cast lots? they stand in a circle, and agree upon a number, eighty, a hundred, or a thousand, or whatsoever number they may agree upon; and the president says to them, put out your fingers, and they put out their fingers, one, or two; and if one puts out three, they number him three; and they do not put out the thumb in the sanctuary, because of deceivers; for the thumb is short, and easy to be put out, and to bend; and he that puts out the thumb, they do not number for him: and the president begins to number from the man that is known, whose mitre he took off first, and he numbers by their fingers, and returns in the round, until he has perfected the number they agreed upon; and the man that completes the number with his finger, he is he that goes out by the first lot to service: and why does he number the number they agree upon, by their fingers that they put out, and does not number them by the men themselves? Because it is forbidden to number Israel, but by means of another thing; as it is said, 1 Samuel 15:4 \"And numbered them in Telaim\". There were four lots they cast every day in the morning; the first lot; was, who should cleanse the altar: they cast lots, and he was worthy that was accounted worthy to cleanse it; and he sets the row in order, and brings up the two pieces of wood to the altar, and he brings in the censer full of fire, from the outer altar, to the golden altar, to burn incense upon it: and the second lot, thirteen were worthy of it, according to the order of their standing; how? the president says to them, put out your fingers, and he numbers in the way that has been explained; and he that goes out by the first lot, is he that slays the daily sacrifice of the morning; and the second that stands by his side, is he that receives the blood of the daily sacrifice, and sprinkles it; and the third that is next to the second, receives the ashes from the innermost altar, which is the altar of incense; and the fourth, that is by his side, cleanses the candlestick, and trims the lamps; and the fifth brings up the head of the daily sacrifice, and its leg to the ascent of the altar: and the sixth brings up the two shoulders; and the seventh brings up the extreme part of the backbone, and the other leg; and the eighth brings up the breast and the gullet; and the ninth brings up the two sides; and the tenth brings up the inwards; and the eleventh brings up the fine flour, and the drink offerings; and the twelfth brings up the things that were fried; and the thirteenth brings up the wine of the drink offerings: the third lot, the president says to them, \"even\" to all the men of the house of the father of that day, whoever has never burnt incense, let him come and \"cast lots\"; and they gather together to the president, and cast lots; and he that goes out by the lot first, he is he that is worthy to burn incense; the fourth lot, they all gather together, and cast lots to know who shall bring up the parts from the ascent of the altar, to the altar; they cast lots, and he is worthy who is accounted worthy: the daily evening sacrifice, they do not cast another lot for it; but every priest that is worthy of any service of the services of the morning, is worthy of the evening, except that of the incense; for they cast another lot for that in the evening; and every one may come, who has never burnt incense of the men of that house of the fathers, and cast lots for it; but if they have all of them burnt incense already, they all of them cast lots, in the morning, at the third lot; and he that is worthy of it in the morning, burns incense in the evening. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"all the services that they do every day, they do,  by lot; and how do they do it? All the priests of the houses of the fathers, of the day, go into the paved chamber, after the pillar of the morning has ascended, and clothe themselves with the priestly garments; and the president who is over the lots is with them, and they stand in a circle; and the president takes a mitre from off the head of one of them, and goes round with it, and the man from whom he begins to number, and they cast lots, as has been explained----how do they cast lots? they stand in a circle, and agree upon a number, eighty, a hundred, or a thousand, or whatsoever number they may agree upon; and the president says to them, put out your fingers, and they put out their fingers, one, or two; and if one puts out three, they number him three; and they do not put out the thumb in the sanctuary, because of deceivers; for the thumb is short, and easy to be put out, and to bend; and he that puts out the thumb, they do not number for him: and the president begins to number from the man that is known, whose mitre he took off first, and he numbers by their fingers, and returns in the round, until he has perfected the number they agreed upon; and the man that completes the number with his finger, he is he that goes out by the first lot to service: and why does he number the number they agree upon, by their fingers that they put out, and does not number them by the men themselves? Because it is forbidden to number Israel, but by means of another thing; as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 15:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"And numbered them in Telaim\". There were four lots they cast every day in the morning; the first lot; was, who should cleanse the altar: they cast lots, and he was worthy that was accounted worthy to cleanse it; and he sets the row in order, and brings up the two pieces of wood to the altar, and he brings in the censer full of fire, from the outer altar, to the golden altar, to burn incense upon it: and the second lot, thirteen were worthy of it, according to the order of their standing; how? the president says to them, put out your fingers, and he numbers in the way that has been explained; and he that goes out by the first lot, is he that slays the daily sacrifice of the morning; and the second that stands by his side, is he that receives the blood of the daily sacrifice, and sprinkles it; and the third that is next to the second, receives the ashes from the innermost altar, which is the altar of incense; and the fourth, that is by his side, cleanses the candlestick, and trims the lamps; and the fifth brings up the head of the daily sacrifice, and its leg to the ascent of the altar: and the sixth brings up the two shoulders; and the seventh brings up the extreme part of the backbone, and the other leg; and the eighth brings up the breast and the gullet; and the ninth brings up the two sides; and the tenth brings up the inwards; and the eleventh brings up the fine flour, and the drink offerings; and the twelfth brings up the things that were fried; and the thirteenth brings up the wine of the drink offerings: the third lot, the president says to them, \"even\" to all the men of the house of the father of that day, whoever has never burnt incense, let him come and \"cast lots\"; and they gather together to the president, and cast lots; and he that goes out by the lot first, he is he that is worthy to burn incense; the fourth lot, they all gather together, and cast lots to know who shall bring up the parts from the ascent of the altar, to the altar; they cast lots, and he is worthy who is accounted worthy: the daily evening sacrifice, they do not cast another lot for it; but every priest that is worthy of any service of the services of the morning, is worthy of the evening, except that of the incense; for they cast another lot for that in the evening; and every one may come, who has never burnt incense of the men of that house of the fathers, and cast lots for it; but if they have all of them burnt incense already, they all of them cast lots, in the morning, at the third lot; and he that is worthy of it in the morning, burns incense in the evening. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Hence it appears, that the burning of incense, as other parts of the priest's service, was by lot; and that they were new priests, or such who had never burnt incense, that cast lots for it: for it is a tradition (k), that no man ever burnt incense twice; the reason assigned for it is, because it makes a man rich; and therefore that every one might partake of the blessing in their turns, new ones were called unto it: whether Zacharias had ever burnt incense before, and whether he now did it in the morning or evening, is not certain, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "According to the custom of the priest's office, his lot was to burn incense when he went into the {n} temple of the Lord.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "According to the custom of the priest's office, his lot was to burn incense when he went into the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " temple of the Lord.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) The temple was one, and the court another, for Zacharias went out of the court (or outward room) where all the people were (and therefore they are said to be without) and into the temple.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατὰ τὸ ἔθος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to be connected with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔλαχε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": casting lots, the customary manner of settling who was to have the honour.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰσελθὼν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to be connected with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θυμιάσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔλαχε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is that entering the sanctuary was the necessary preliminary to offering incense: in one sense a superfluous remark (Hahn), yet worth making in view of the sacredness of the place. A great affair to get entrance into the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ναός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his lot was to burn incense",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "he obtained by lot the duty of entering and burning incense",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was the loftiest and most coveted of priestly functions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 16:1-40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". King Uzziah was smitten with leprosy for trying to usurp it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 26:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Incense was a symbol of prayer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 141:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:3-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Philo tells us that it was offered twice a day,—before the morning and after the evening sacrifice of a lamb.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "into the temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shrine or Holy Place",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The golden altar of incense stood before the veil which separated the Holy Place from the Holy of Holies (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The priest entered in white robes and with unsandalled feet with two attendants who retired when they had made everything ready. The people waited outside in the Court of Israel praying in deep silence till the priest who was sacrificing the evening lamb at the great altar of Burnt Offering in the Court gave a signal to his colleague in the shrine, perhaps by the tinkling of a bell (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 141:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He then threw the incense on the fire of the golden altar, and its fragrant smoke rose with the prayers of the people. It was while performing this solemn function that John Hyrcanus also had received a divine intimation (Jos. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Antt.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " xiii. 103).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἔλαχε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he was allotted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the office) The functions of the priests were distributed by lot.[5]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ θυμιάσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of burning incense",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[5] This was so, according to S. R. D. Crusius, Hypomn. P. I., p. 41, partly for the sake of order, partly to avoid contentions. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 24:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—E. B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "His lot was to burn incense",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; more accurately, he obtained by lot the duty of entering and offering incense. The office of burning incense gave the priest to whom this important lot fell the right of entering the holy place. It was the most coveted of all the priestly duties. The Talmud says the priest who obtained the right to perform this high duty was not permitted to draw the lot a second time in the same week, and as the whole number of priests at this time was very large - some say even as many as twenty thousand - Farrar conjectures that it would never happen to the same priest twice in his lifetime to enter that sacred spot. Luke 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "His lot was (ἔλαχε)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Four lots were drawn to determine the order of the ministry of the day: the first, before daybreak, to designate the priests who were to cleanse the altar and prepare its fires; the second for the priest who was to offer the sacrifice and cleanse the candlestick and the altar of incense; the third for the priest who should burn incense; and the fourth appointing those who were to lay the sacrifice and meat-offering on the altar, and pour out the drink-offering. There are said to have been twenty thousand priests in Christ's time, so that no priest would ever offer incense more than once.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Temple (ναὸν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sanctuary. See on Matthew 4:5.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The sanctuary. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Burn incense (θυμιᾶσαι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Only here in New Testament. The incensing priest and his assistants went first to the altar of burnt-offering, and filled a golden censer with incense, and placed burning coals from the altar in a golden bowl. As they passed into the court from the Holy Place they struck a large instrument called the Magrephah, which summoned all the ministers to their places. Ascending the steps to the holy place, the priests spread the coals on the golden altar, and arranged the incense, and the chief officiating priest was then left alone within the Holy Place to await the signal of the president to burn the incense. It was probably at this time that the angel appeared to Zacharias. When the signal was given, the whole multitude withdrew from the inner court, and fell down before the Lord. Silence pervaded the temple, while within, the clouds of incense rose up before Jehovah. (For a more detailed account see Edersheim, \"The Temple, its Ministry,\" etc.). ",
        "children": []
      }
    ]
  }
]