[{"num":8,"verse":"Then the Lord said to Moses, Go to Pharaoh and say to him, Thus says the Lord, Let My people go, that they may serve Me."},{"num":2,"verse":"And if you refuse to let them go, behold, I will smite your entire land with frogs;"},{"num":3,"verse":"And the river shall swarm with frogs which shall go up and come into your house, into your bedchamber and on your bed, and into the houses of your servants and upon your people, and into your ovens, your kneading bowls, and your dough."},{"num":4,"verse":"And the frogs shall come up on you and on your people and all your servants."},{"num":5,"verse":"And the Lord said to Moses, Say to Aaron, Stretch out your hand with your rod over the rivers, the streams and canals, and over the pools, and cause frogs to come up on the land of Egypt."},{"num":6,"verse":"So Aaron stretched out his hand over the waters of Egypt, and the frogs came up and covered the land."},{"num":7,"verse":"But the magicians did the same thing with their enchantments and secret arts, and brought up [more] frogs upon the land of Egypt."},{"num":8,"verse":"Then Pharaoh called for Moses and Aaron, and said, Entreat the Lord, that He may take away the frogs from me and my people; and I will let the people go that they may sacrifice to the Lord."},{"num":9,"verse":"Moses said to Pharaoh, Glory over me in this: dictate when I shall pray [to the Lord] for you, your servants, and your people, that the frogs may be destroyed from you and your houses and remain only in the river."},{"num":10,"verse":"And [Pharaoh] said, Tomorrow. [Moses] said, Let it be as you say, that you may know that there is no one like the Lord our God."},{"num":11,"verse":"And the frogs shall depart from you and your houses and from your servants and your people; they shall remain in the river only."},{"num":12,"verse":"So Moses and Aaron went out from Pharaoh, and Moses cried to the Lord [as he had agreed with Pharaoh] concerning the frogs which He had brought against him."},{"num":13,"verse":"And the Lord did according to the word of Moses, and the frogs died out of the houses, out of the courtyards and villages, and out of the fields."},{"num":14,"verse":"[The people] gathered them together in heaps, and the land was loathsome and stank."},{"num":15,"verse":"But when Pharaoh saw that there was temporary relief, he made his heart stubborn and hard and would not listen or heed them, just as the Lord had said."},{"num":16,"verse":"Then the Lord said to Moses, Say to Aaron, Stretch out your rod and strike the dust of the ground, that it may become biting gnats or mosquitoes throughout all the land of Egypt."},{"num":17,"verse":"And they did so; Aaron stretched out his hand with his rod and struck the dust of the earth, and there came biting gnats or mosquitoes on man and beast; all the dust of the land became biting gnats or mosquitoes throughout all the land of Egypt."},{"num":18,"verse":"The magicians tried by their enchantments and secret arts to bring forth gnats or mosquitoes, but they could not; and there were gnats or mosquitoes on man and beast."},{"num":19,"verse":"Then the magicians said to Pharaoh, This is the finger of God! But Pharaoh’s heart was hardened and strong and he would not listen to them, just as the Lord had said."},{"num":20,"verse":"Then the Lord said to Moses, Rise up early in the morning and stand before Pharaoh as he comes forth to the water; and say to him, Thus says the Lord, Let My people go, that they may serve Me."},{"num":21,"verse":"Else, if you will not let My people go, behold, I will send swarms [of bloodsucking gadflies] upon you, your servants, and your people, and into your houses; and the houses of the Egyptians shall be full of swarms [of bloodsucking gadflies], and also the ground on which they stand."},{"num":22,"verse":"But on that day I will sever and set apart the land of Goshen in which My people dwell, that no swarms [of gadflies] shall be there, so that you may know that I am the Lord in the midst of the earth."},{"num":23,"verse":"And I will put a division and a sign of deliverance between My people and your people. By tomorrow shall this sign be in evidence."},{"num":24,"verse":"And the Lord did so; and there came heavy and oppressive swarms [of bloodsucking gadflies] into the house of Pharaoh and his servants’ houses; and in all of Egypt the land was corrupted and ruined by reason of the great invasion [of gadflies]."},{"num":25,"verse":"And Pharaoh called for Moses and Aaron, and said, Go, sacrifice to your God [here] in the land [of Egypt]."},{"num":26,"verse":"And Moses said, It is not suitable or right to do that; for the animals the Egyptians hold sacred and will not permit to be slain are those which we are accustomed to sacrifice to the Lord our God; if we did this before the eyes of the Egyptians, would they not stone us?"},{"num":27,"verse":"We will go a three days’ journey into the wilderness and sacrifice to the Lord our God, as He will command us."},{"num":28,"verse":"So Pharaoh said, I will let you go, that you may sacrifice to the Lord your God in the wilderness; only you shall not go very far away. Entreat [your God] for me."},{"num":29,"verse":"Moses said, I go out from you, and I will entreat the Lord that the swarms [of bloodsucking gadflies] may depart from Pharaoh, his servants, and his people tomorrow; only let not Pharaoh deal deceitfully any more in not letting the people go to sacrifice to the Lord."},{"num":30,"verse":"So Moses went out from Pharaoh and entreated the Lord."},{"num":31,"verse":"And the Lord did as Moses had spoken: He removed the swarms [of attacking gadflies] from Pharaoh, from his servants, and his people; there remained not one."},{"num":32,"verse":"But Pharaoh hardened his heart and made it stubborn this time also, nor would he let the people go."}]