[{"header":"Frogs"},{"num":8,"verse":"Then the Lord said to Moses, “Go to the king and tell him that the Lord says, ‘Let my people go, so that they can worship me. "},{"num":2,"verse":"If you refuse, I will punish your country by covering it with frogs. "},{"num":3,"verse":"The Nile will be so full of frogs that they will leave it and go into your palace, your bedroom, your bed, the houses of your officials and your people, and even into your ovens and baking pans. "},{"num":4,"verse":"They will jump up on you, your people, and all your officials.’”"},{"num":5,"verse":"The Lord said to Moses, “Tell Aaron to hold out his walking stick over the rivers, the canals, and the pools, and make frogs come up and cover the land of Egypt.” "},{"num":6,"verse":"So Aaron held it out over all the water, and the frogs came out and covered the land. "},{"num":7,"verse":"But the magicians used magic, and they also made frogs come up on the land."},{"num":8,"verse":"The king called for Moses and Aaron and said, “Pray to the Lord to take away these frogs, and I will let your people go, so that they can offer sacrifices to the Lord.”"},{"num":9,"verse":"Moses replied, “I will be glad to pray for you. Just set the time when I am to pray for you, your officers, and your people. Then you will be rid of the frogs, and there will be none left except in the Nile.”"},{"num":10,"verse":"The king answered, “Pray for me tomorrow.”"},{"num":11,"verse":"You, your officials, and your people will be rid of the frogs, and there will be none left except in the Nile.” "},{"num":12,"verse":"Then Moses and Aaron left the king, and Moses prayed to the Lord to take away the frogs which he had brought on the king. "},{"num":13,"verse":"The Lord did as Moses asked, and the frogs in the houses, the courtyards, and the fields died. "},{"num":14,"verse":"The Egyptians piled them up in great heaps, until the land stank with them. "},{"num":15,"verse":"When the king saw that the frogs were dead, he became stubborn again and, just as the Lord had said, the king would not listen to Moses and Aaron."},{"num":16,"verse":"The Lord said to Moses, “Tell Aaron to strike the ground with his stick, and all over the land of Egypt the dust will change into gnats.” "},{"num":17,"verse":"So Aaron struck the ground with his stick, and all the dust in Egypt was turned into gnats, which covered the people and the animals. "},{"num":18,"verse":"The magicians tried to use their magic to make gnats appear, but they failed. There were gnats everywhere, "},{"num":19,"verse":"and the magicians said to the king, “God has done this!” But the king was stubborn and, just as the Lord had said, the king would not listen to Moses and Aaron."},{"num":20,"verse":"The Lord said to Moses, “Early tomorrow morning go and meet the king as he goes to the river, and tell him that the Lord says, ‘Let my people go, so that they can worship me. "},{"num":21,"verse":"I warn you that if you refuse, I will punish you by sending flies on you, your officials, and your people. The houses of the Egyptians will be full of flies, and the ground will be covered with them. "},{"num":22,"verse":"But I will spare the region of Goshen, where my people live, so that there will be no flies there. I will do this so that you will know that I, the Lord, am at work in this land. "},{"num":23,"verse":"I will make a distinction between my people and your people. This miracle will take place tomorrow.’” "},{"num":24,"verse":"The Lord sent great swarms of flies into the king's palace and the houses of his officials. The whole land of Egypt was brought to ruin by the flies."},{"num":25,"verse":"Then the king called for Moses and Aaron and said, “Go and offer sacrifices to your God here in this country.”"},{"num":26,"verse":"“It would not be right to do that,” Moses answered, “because the Egyptians would be offended by our sacrificing the animals that we offer to the Lord our God. If we use these animals and offend the Egyptians by sacrificing them where they can see us, they will stone us to death. "},{"num":27,"verse":"We must travel three days into the desert to offer sacrifices to the Lord our God, just as he commanded us.”"},{"num":28,"verse":"The king said, “I will let you go to sacrifice to the Lord, your God, in the desert, if you do not go very far. Pray for me.”"},{"num":29,"verse":"Moses answered, “As soon as I leave, I will pray to the Lord that tomorrow the flies will leave you, your officials, and your people. But you must not deceive us again and prevent the people from going to sacrifice to the Lord.”"},{"num":30,"verse":"Moses left the king and prayed to the Lord, "},{"num":31,"verse":"and the Lord did as Moses asked. The flies left the king, his officials, and his people; not one fly remained. "},{"num":32,"verse":"But even this time the king became stubborn, and again he would not let the people go."}]