[{"num":8,"verse":"Then the Lord told Moses, “Go to the king of Egypt and tell him, ‘This is what the Lord says: Let my people go to worship me. "},{"num":2,"verse":"If you refuse, then I will punish Egypt with frogs. "},{"num":3,"verse":"The Nile River will be filled with frogs. They will come from the river and enter your palace. They will be in your bedroom and your bed. The frogs will enter the houses of your officers and your people. They will enter your ovens and your baking pans. "},{"num":4,"verse":"The frogs will jump up all over you, your people and your officers.’”"},{"num":5,"verse":"Then the Lord said to Moses, “Tell Aaron to hold his walking stick in his hand over the rivers, canals and ponds. Make frogs come up out of the water onto the land of Egypt.”"},{"num":6,"verse":"So Aaron held his hand over all the waters of Egypt. The frogs came up out of the water and covered the land of Egypt. "},{"num":7,"verse":"The magicians used their tricks to do the same thing. So even more frogs came up onto the land of Egypt."},{"num":8,"verse":"So the king called for Moses and Aaron. He said, “Pray to the Lord to take the frogs away from me and my people. I will let your people go to offer sacrifices to the Lord.”"},{"num":9,"verse":"Moses said to the king, “Please set the time that I should pray for you, your people and your officers. Then the frogs will leave you and your houses. They will remain only in the Nile.”"},{"num":10,"verse":"The king answered, “Tomorrow.”"},{"num":11,"verse":"The frogs will leave you, your houses, your officers and your people. They will remain only in the Nile.”"},{"num":12,"verse":"Moses and Aaron left the king. Moses asked the Lord about the frogs he had sent to the king. "},{"num":13,"verse":"And the Lord did as Moses asked. The frogs died in the houses, in the yards and in the fields. "},{"num":14,"verse":"The Egyptians put them in piles. The whole country began to stink. "},{"num":15,"verse":"When the king saw that they were free of the frogs, he became stubborn again. He did not listen to Moses and Aaron, just as the Lord had said."},{"header":"The Gnats"},{"num":16,"verse":"Then the Lord said to Moses, “Tell Aaron to raise his walking stick and strike the dust on the ground. Then everywhere in Egypt the dust will change into gnats.” "},{"num":17,"verse":"They did this. Aaron raised the walking stick that was in his hand and struck the dust on the ground. Then everywhere in Egypt the dust changed into gnats. The gnats got on the people and animals. "},{"num":18,"verse":"Using their tricks, the magicians tried to do the same thing. But they could not make the dust change into gnats. The gnats remained on the people and animals. "},{"num":19,"verse":"So the magicians told the king that the power of God had done this. But the king was stubborn and refused to listen to them. This happened just as the Lord had said."},{"header":"The Flies"},{"num":20,"verse":"The Lord told Moses, “Get up early in the morning. Meet the king of Egypt as he goes out to the river. Tell him, ‘This is what the Lord says: Let my people go so they can worship me. "},{"num":21,"verse":"If you don’t let them go, I will send swarms of flies. I will send them into your houses. The flies will be on you, your officers and your people. The houses of Egypt will be full of flies. And they will be all over the ground, too. "},{"num":22,"verse":"But I will not treat the people of Israel the same as the Egyptian people. There will not be any flies in the land of Goshen, where my people live. By this you will know that I, the Lord, am in this land. "},{"num":23,"verse":"I will treat my people differently from your people. This miracle will happen tomorrow.’”"},{"num":24,"verse":"So the Lord did as he had said. Great swarms of flies came into the king’s palace and his officers’ houses. All over Egypt flies were ruining the land. "},{"num":25,"verse":"The king called for Moses and Aaron. He told them, “Offer sacrifices to your God here in this country.”"},{"num":26,"verse":"But Moses said, “It wouldn’t be right to do that. The Egyptians hate the sacrifices we offer to the Lord our God. They will see us offer sacrifices they hate. Then they will throw stones at us and kill us. "},{"num":27,"verse":"Let us make a three-day journey into the desert. We must offer sacrifices to the Lord our God there. This is what the Lord told us to do.”"},{"num":28,"verse":"The king said, “I will let you go. Then you may offer sacrifices to the Lord your God in the desert. But you must not go very far away. Now go and pray for me.”"},{"num":29,"verse":"Moses said, “I will leave and pray to the Lord. He will take the flies away from you, your officers and your people tomorrow. But do not try to trick us again. Do not stop the people from going to offer sacrifices to the Lord.”"},{"num":30,"verse":"So Moses left the king and prayed to the Lord. "},{"num":31,"verse":"And the Lord did as Moses asked. He removed the flies from the king, his officers and his people. Not one fly was left. "},{"num":32,"verse":"But the king became stubborn again and did not let the people go."}]