[{"header":"Frogs, Gnats, Flies"},{"num":8,"verse":"Then Adonai told Moses, “Say to Aaron: Stretch out your hand with your staff over the rivers, canals and pools, and cause frogs to come up over the land of Egypt.” "},{"num":2,"verse":"So Aaron stretched out his hand over the waters of Egypt, and the frogs came up and covered the land. "},{"num":3,"verse":"But the magicians did the same with their secret arts and brought up frogs over the land of Egypt."},{"num":4,"verse":"Then Pharaoh called for Moses and Aaron and said, “Pray to Adonai, that He would take the frogs away from me and from my people. Then I will let the people go, so they may sacrifice to Adonai.”"},{"num":5,"verse":"Moses answered Pharaoh, “Boast about me after I pray for you. When am I to pray for you, your servants and your people, that the frogs would be cut off from you and your houses, and remain only in the Nile?”"},{"num":6,"verse":"“Tomorrow,” he said."},{"num":7,"verse":"The frogs will depart from you, from your houses, from your servants and from your people. They will remain only in the Nile.”"},{"num":8,"verse":"After Moses and Aaron went out from Pharaoh, Moses cried out to Adonai concerning the frogs, which He had brought upon Pharaoh. "},{"num":9,"verse":"So Adonai acted according to the word of Moses, and the frogs died out in the houses, the courts and the fields. "},{"num":10,"verse":"They piled them together in large heaps, and the land stank. "},{"num":11,"verse":"But when Pharaoh saw that there was relief, he hardened his heart and did not listen to them—just as Adonai had said."},{"num":12,"verse":"So Adonai said to Moses, “Tell Aaron, ‘Stretch out your staff and strike the dust of the earth, and it will become gnats throughout all the land of Egypt.’” "},{"num":13,"verse":"So they did. When Aaron stretched out his hand with his staff and struck the dust of the earth, there were gnats on men and animals. All the dust of the earth became gnats throughout all the land of Egypt."},{"num":14,"verse":"When the magicians attempted the same with their secret arts to bring forth gnats, they could not. There were gnats on men and animals. "},{"num":15,"verse":"So the magicians said to Pharaoh, “This is the finger of God.” But Pharaoh’s heart was hardened, and he did not listen to them—just as Adonai had said."},{"num":16,"verse":"Then Adonai said to Moses, “Rise up early in the morning and stand before Pharaoh. As he comes to the water say to him, This is what Adonai says: Let My people go, that they may serve Me. "},{"num":17,"verse":"Or else, if you do not let My people go, I will send the swarm of flies on you and on your servants, on your people and into your houses. The houses of the Egyptians will be full of the swarm of flies including the ground that they stand on."},{"num":18,"verse":"“But on that day I will set apart the land of Goshen, where My people are dwelling—except no swarm of flies will be there—so that you may know that I, Adonai, am in the midst of the earth. "},{"num":19,"verse":"I will make a distinction between My people and your people. By tomorrow this sign will happen.”"},{"num":20,"verse":"Adonai did just so. A massive swarm of flies went into the house of Pharaoh and into his servant’s houses. All the land of Egypt was ruined because of the swarm of flies."},{"num":21,"verse":"So Pharaoh called for Moses and for Aaron and said, “Go! Sacrifice to your God—in the land.”"},{"num":22,"verse":"But Moses said, “That would not be right. For the offerings we intend to sacrifice to Adonai our God are an abomination to the Egyptians. If we sacrifice what is an abomination to the Egyptians, wouldn’t they stone us? "},{"num":23,"verse":"We must walk a three-day journey into the wilderness and sacrifice to Adonai our God—just as He tells us.”"},{"num":24,"verse":"Pharaoh said, “I will let you go, so that you may sacrifice to Adonai your God in the wilderness. Only you must not go very far away. Pray for me.”"},{"num":25,"verse":"So Moses said, “See, I am leaving you, and I will pray to Adonai that the swarm of flies will depart from Pharaoh, his servants and from his people tomorrow. However, let Pharaoh no longer deal deceitfully by not letting the people go sacrifice to Adonai.” "},{"num":26,"verse":"Then Moses went out from Pharaoh and prayed to Adonai. "},{"num":27,"verse":"Adonai acted according to the word of Moses, and removed the swarm of flies from Pharaoh, from his servants and from his people. Nothing remained. "},{"num":28,"verse":"But Pharaoh hardened his heart this time also, and did not let the people go."}]