[{"header":"The Holy District"},{"num":45,"verse":"When you allot the land as an inheritance, you shall set aside for the Lord a portion of the land as a holy district, twenty-five thousand cubits long and twenty thousand cubits wide; it shall be holy throughout its entire extent. "},{"num":2,"verse":"Of this, a square plot of five hundred by five hundred cubits shall be for the sanctuary, with fifty cubits for an open space around it. "},{"num":3,"verse":"In the holy district you shall measure off a section twenty-five thousand cubits long and ten thousand wide, in which shall be the sanctuary, the most holy place. "},{"num":4,"verse":"It shall be a holy portion of the land; it shall be for the priests, who minister in the sanctuary and approach the Lord to minister to him; and it shall be both a place for their houses and a holy place for the sanctuary. "},{"num":5,"verse":"Another section, twenty-five thousand cubits long and ten thousand cubits wide, shall be for the Levites who minister at the temple, as their holding for cities to live in."},{"num":6,"verse":"Alongside the portion set apart as the holy district you shall assign as a holding for the city an area five thousand cubits wide, and twenty-five thousand cubits long; it shall belong to the whole house of Israel."},{"num":7,"verse":"And to the prince shall belong the land on both sides of the holy district and the holding of the city, alongside the holy district and the holding of the city, on the west and on the east, corresponding in length to one of the tribal portions, and extending from the western to the eastern boundary "},{"num":8,"verse":"of the land. It is to be his property in Israel. And my princes shall no longer oppress my people; but they shall let the house of Israel have the land according to their tribes."},{"num":9,"verse":"Thus says the Lord God: Enough, O princes of Israel! Put away violence and oppression, and do what is just and right. Cease your evictions of my people, says the Lord God."},{"header":"Weights and Measures"},{"num":10,"verse":"You shall have honest balances, an honest ephah, and an honest bath. "},{"num":11,"verse":"The ephah and the bath shall be of the same measure, the bath containing one-tenth of a homer, and the ephah one-tenth of a homer; the homer shall be the standard measure. "},{"num":12,"verse":"The shekel shall be twenty gerahs. Twenty shekels, twenty-five shekels, and fifteen shekels shall make a mina for you."},{"header":"Offerings"},{"num":13,"verse":"This is the offering that you shall make: one-sixth of an ephah from each homer of wheat, and one-sixth of an ephah from each homer of barley, "},{"num":14,"verse":"and as the fixed portion of oil, one-tenth of a bath from each cor (the cor, like the homer, contains ten baths); "},{"num":15,"verse":"and one sheep from every flock of two hundred, from the pastures of Israel. This is the offering for grain-offerings, burnt-offerings, and offerings of well-being, to make atonement for them, says the Lord God. "},{"num":16,"verse":"All the people of the land shall join with the prince in Israel in making this offering. "},{"num":17,"verse":"But this shall be the obligation of the prince regarding the burnt-offerings, grain-offerings, and drink-offerings at the festivals, the new moons, and the sabbaths, all the appointed festivals of the house of Israel: he shall provide the sin-offerings, grain-offerings, the burnt-offerings, and the offerings of well-being, to make atonement for the house of Israel."},{"header":"Festivals"},{"num":18,"verse":"Thus says the Lord God: In the first month, on the first day of the month, you shall take a young bull without blemish, and purify the sanctuary. "},{"num":19,"verse":"The priest shall take some of the blood of the sin-offering and put it on the doorposts of the temple, the four corners of the ledge of the altar, and the posts of the gate of the inner court. "},{"num":20,"verse":"You shall do the same on the seventh day of the month for anyone who has sinned through error or ignorance; so you shall make atonement for the temple."},{"num":21,"verse":"In the first month, on the fourteenth day of the month, you shall celebrate the festival of the passover, and for seven days unleavened bread shall be eaten. "},{"num":22,"verse":"On that day the prince shall provide for himself and all the people of the land a young bull for a sin-offering. "},{"num":23,"verse":"And during the seven days of the festival he shall provide as a burnt-offering to the Lord seven young bulls and seven rams without blemish, on each of the seven days; and a male goat daily for a sin-offering. "},{"num":24,"verse":"He shall provide as a grain-offering an ephah for each bull, an ephah for each ram, and a hin of oil to each ephah. "},{"num":25,"verse":"In the seventh month, on the fifteenth day of the month and for the seven days of the festival, he shall make the same provision for sin-offerings, burnt-offerings, and grain-offerings, and for the oil."}]