[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 14:18-19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 14:18-19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The king said, Hide not from me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Observing the uncommon art and dexterity of her address in the management of this affair, the king immediately began to suspect it was a thing concerted between her and Joab, and asked, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Is not the hand of Joab with thee in all this? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hast thou not said and done all this by his direction? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The woman said, None can turn, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That is, it is even so: thou hast discovered the truth: and I will not seek by any turnings or windings, this way, or the other, to dissemble the matter, but will plainly confess it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He put these words into the mouth of thy handmaid — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As to the sense and substance of them, but not as to all the expressions, for these were evidently varied as the king’s answer gave occasion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-20 We may notice here, how this widow pleads God's mercy, and his clemency toward poor guilty sinners. The state of sinners is a state of banishment from God. God pardons none to the dishonour of his law and justice, nor any who are impenitent; nor to the encouragement of crimes, or the hurt of others.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As an angel of God - Rather, as \"the\" Angel of God; and therefore whatever David decided would be right. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-17. Wherefore then hast thou thought such a thing against the people of God, &c.—Her argument may be made clear in the following paraphrase:—You have granted me the pardon of a son who had slain his brother, and yet you will not grant to your subjects the restoration of Absalom, whose criminality is not greater than my son's, since he killed his brother in similar circumstances of provocation. Absalom has reason to complain that he is treated by his own father more sternly and severely than the meanest subject in the realm; and the whole nation will have cause for saying that the king shows more attention to the petition of a humble woman than to the wishes and desires of a whole kingdom. The death of my son is a private loss to my family, while the preservation of Absalom is the common interest of all Israel, who now look to him as your successor on the throne.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then the king answered and said unto the woman,.... Understanding plainly what she meant by all this, that the case she brought was a feigned one, and that the intention of it was to let him know the sense of the people with respect to Absalom, and the recall of him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hide not from me, I pray thee, the thing that I shall ask thee; he suspected that this was not a scheme of her own, but some considerable person had formed it, and made use of her to execute it, which was what he desired to know: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the woman said, let my lord the king now speak; ask what question he pleases, I am ready to answer. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the woman said, let my lord the king now speak; ask what question he pleases, I am ready to answer. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then the king answered and said unto the woman, Hide not from me, I pray thee, the thing that I shall ask thee. And the woman said, Let my lord the king now speak.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "These words of the woman were so well considered and so crafty, that the king could not fail to see both what she really meant, and also that she had not come with her petition of her own accord. He therefore told her to answer the question without disguise: whether the hand of Joab was with her in all this. She replied, \"Truly there is not (אם) anything to the right hand or to the left of all that my lord the king saith,\" i.e., the king always hits the right point in everything that he said. \"Yea, thy servant Joab, he hath commanded me, and he hath put all these words into thy servant's mouth.\" אשׁ is not a copyist's error, but a softer form of ישׁ, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (vid., Ewald, 53c, and Olshausen, Gramm. p. 425).",
        "children": []
      }
    ]
  }
]