[{"num":47,"verse":"Joseph went to inform Pharaoh and said, “My father and brothers with their flocks, herds, and everything they own have come from the land of Canaan and are now in the land of Goshen.”"},{"num":2,"verse":"From all of his brothers, he selected five men and presented them before Pharaoh."},{"num":3,"verse":"Pharaoh said to Joseph’s brothers, “What do you do?”"},{"num":4,"verse":"They continued, “We’ve come to the land as immigrants because the famine is so severe in the land of Canaan that there are no more pastures for your servants’ flocks. Please allow your servants to settle in the land of Goshen.”"},{"num":5,"verse":"Pharaoh said to Joseph, “Since your father and brothers have arrived,"},{"num":6,"verse":"the land of Egypt is available to you. Settle your father and brothers in the land’s best location. Let them live in the land of Goshen. And if you know capable men among them, put them in charge of my own livestock.”"},{"num":7,"verse":"Joseph brought his father Jacob and gave him an audience with Pharaoh. Jacob blessed Pharaoh,"},{"num":8,"verse":"and Pharaoh said to Jacob, “How old are you?”"},{"num":9,"verse":"Jacob said to Pharaoh, “I’ve been a traveler for 130 years. My years have been few and difficult. They don’t come close to the years my ancestors lived during their travels.”"},{"num":10,"verse":"Jacob blessed Pharaoh and left Pharaoh’s presence."},{"num":11,"verse":"Joseph settled his father and brothers and gave them property in the land of Egypt, in the best location in the land of Rameses, just as Pharaoh had ordered."},{"num":12,"verse":"Joseph provided food for his father, his brothers, and his father’s entire household, in proportion to the number of children."},{"header":"Joseph centralizes power in Egypt"},{"num":13,"verse":"There was no food in the land because the famine was so severe. The land of Egypt and the land of Canaan dried up from the famine."},{"num":14,"verse":"Joseph collected all of the silver to be found in the land of Egypt and in the land of Canaan for the grain, which people came to buy, and he deposited it in Pharaoh’s treasury."},{"num":15,"verse":"The silver from the land of Egypt and from the land of Canaan had been spent, and all of the Egyptians came to Joseph and said, “Give us food. Why should we die before your eyes, just because the silver is gone?”"},{"num":16,"verse":"Joseph said, “Give me your livestock, and I will give you food for your livestock if the silver is gone.”"},{"num":17,"verse":"So they brought their livestock to Joseph, and Joseph gave them food for the horses, flocks, cattle, and donkeys. He got them through that year with food in exchange for all of their livestock."},{"num":18,"verse":"When that year was over, they came to him the next year and said to him, “We can’t hide from my master that the silver is spent and that we’ve given the livestock to my master. All that’s left for my master is our corpses and our farmland."},{"num":19,"verse":"Why should we die before your eyes, we and our farmland too? Buy us and our farms for food, and we and our farms will be under Pharaoh’s control. Give us seed so that we can stay alive and not die, and so that our farmland won’t become unproductive.”"},{"num":20,"verse":"So Joseph bought all of Egypt’s farmland for Pharaoh because every Egyptian sold his field when the famine worsened. So the land became Pharaoh’s."},{"num":21,"verse":"He moved the people to the cities from one end of Egypt to the other."},{"num":22,"verse":"However, he didn’t buy the farmland of the priests because Pharaoh allowed the priests a subsidy, and they were able to eat from the subsidy Pharaoh gave them. Therefore, they didn’t have to sell their farmland."},{"num":23,"verse":"Joseph said to the people, “Since I’ve now purchased you and your farmland for Pharaoh, here’s seed for you. Plant the seed on the land."},{"num":24,"verse":"When the crop comes in, you must give one-fifth to Pharaoh. You may keep four-fifths for yourselves, for planting fields, and for feeding yourselves, those in your households, and your children.”"},{"num":25,"verse":"The people said, “You’ve saved our lives. If you wish, we will be Pharaoh’s slaves.”"},{"num":26,"verse":"So Joseph made a law that still exists today: Pharaoh receives one-fifth from Egypt’s farmland. Only the priests’ farmland didn’t become Pharaoh’s."},{"header":"Jacob blesses Ephraim and Manasseh"},{"num":27,"verse":"Israel lived in the land of Egypt, in the land of Goshen. They settled in it, had many children, and became numerous."},{"num":28,"verse":"After Jacob had lived in the land of Egypt for seventeen years, and after he had lived a total of 147 years,"},{"num":29,"verse":"Israel’s death approached. He summoned his son Joseph and said to him, “If you would be so kind, lay your hand under my thigh, and be loyal and true to me. Don’t bury me in Egypt."},{"num":30,"verse":"When I lie down with my fathers, carry me from Egypt and bury me in their grave.”"},{"num":31,"verse":"Israel said, “Give me your word!” and Joseph gave his word. Then Israel slumped down at the head of the bed."}]