[{"header":"Israel Settles in Goshen"},{"num":47,"verse":"Joseph went in to Pharaoh and said, “My father and my brothers and all their families are here. They have all their animals and everything they own from the land of Canaan with them. They are now in the land of Goshen.”"},{"num":2,"verse":"Joseph chose five of his brothers to be with him before the Pharaoh."},{"num":3,"verse":"Pharaoh said to the brothers, “What work do you do?”"},{"num":4,"verse":"They said to Pharaoh, “The famine is very bad in Canaan. There are no fields left with grass for our animals, so we have come to live in this land. We ask you to please let us live in Goshen.”"},{"num":5,"verse":"Then Pharaoh said to Joseph, “Your father and your brothers have come to you."},{"num":6,"verse":"You can choose any place in Egypt for them to live. Give your father and your brothers the best land. Let them live in the land of Goshen. And if they are skilled shepherds, they can also care for my cattle.”"},{"num":7,"verse":"Then Joseph called his father Jacob to come in to meet Pharaoh. Jacob blessed Pharaoh."},{"num":8,"verse":"Then Pharaoh said to him, “How old are you?”"},{"num":9,"verse":"Jacob said to Pharaoh, “I have had a short life with many troubles. I am only 130 years old. My father and his ancestors lived to be much older than I am.”"},{"num":10,"verse":"Then Jacob blessed Pharaoh and left from his meeting with him."},{"num":11,"verse":"Joseph did what Pharaoh said and gave his father and brothers land in Egypt. It was the best land in Egypt, in the eastern part of the country, around Rameses."},{"num":12,"verse":"Joseph also gave his father, his brothers, and all their people the food they needed."},{"header":"Joseph Buys Land for Pharaoh"},{"num":13,"verse":"The famine got worse; there was no food anywhere in the land. Egypt and Canaan became very poor because of this bad time."},{"num":14,"verse":"People in the land bought more and more grain. Joseph saved the money and brought it to Pharaoh’s house."},{"num":15,"verse":"After some time, the people in Egypt and Canaan had no money left. They had spent all their money to buy grain. So the people of Egypt went to Joseph and said, “Please give us food. Our money is gone. If we don’t eat, we will die while you are watching.”"},{"num":16,"verse":"But Joseph answered, “Give me your cattle, and I will give you food.”"},{"num":17,"verse":"So the people used their cattle and horses and all their other animals to buy food. And that year, Joseph gave them food and took their animals."},{"num":18,"verse":"But the next year the people had no animals and nothing to buy food with. So they went to Joseph and said, “You know that we have no money left, and all our animals belong to you. So we have nothing left—only what you see—our bodies and our land."},{"num":19,"verse":"Surely we will die while you are watching. But if you give us food, we will give Pharaoh our land, and we will be his slaves. Give us seed so that we can plant. Then we will live and not die, and the land will grow food for us again.”"},{"num":20,"verse":"So Joseph bought all the land in Egypt for Pharaoh. All the people in Egypt sold Joseph their fields. They did this because they were very hungry."},{"num":21,"verse":"And everywhere in Egypt all the people became Pharaoh’s slaves."},{"num":22,"verse":"The only land Joseph didn’t buy was the land that the priests owned. The priests didn’t need to sell their land because Pharaoh paid them for their work. So they used this money to buy food to eat."},{"num":23,"verse":"Joseph said to the people, “Now I have bought you and your land for Pharaoh. So I will give you seed, and you can plant your fields."},{"num":24,"verse":"At harvest time, you must give one-fifth of your crops to Pharaoh. You can keep four-fifths for yourselves. You can use the seed you keep for food and planting the next year. Now you can feed your families and your children.”"},{"num":25,"verse":"The people said, “You have saved our lives. We are happy to be slaves to Pharaoh.”"},{"num":26,"verse":"So Joseph made a law at that time in the land, and that law continues today. The law says that one-fifth of everything from the land belongs to the Pharaoh who owns all the land. The only land he does not own is the land of the priests."},{"header":"Don’t Bury Me in Egypt"},{"num":27,"verse":"Israel stayed in Egypt. He lived in the land of Goshen. His family grew and became very large. They became landowners there and did very well."},{"num":28,"verse":"Jacob lived in Egypt 17 years, so he was 147 years old."},{"num":29,"verse":"The time came when Israel knew he would soon die, so he called his son Joseph to him. He said, “If you love me, put your hand under my leg and make a promise. Promise that you will do what I say and that you will be truthful with me. When I die, don’t bury me in Egypt."},{"num":30,"verse":"Bury me in the place where my ancestors are buried. Carry me out of Egypt and bury me in our family grave.”"},{"num":31,"verse":"Then Jacob said, “Make a vow to me.” And Joseph vowed to him that he would do this. Then Israel laid his head back down on the bed."}]