[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "XLVI.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Bel boweth down, Nebo Stoopeth.—Bel or Belus (“Lord “), is perhaps identical with Marduk or Merôdach, but see Note on Jeremiah 1:2. Nabu (“ the Revealer”) was a kind of Assyrian Hermes. Isaiah sees the idols carried off as spoil, at the command of Cyrus, a heavy burden for the beasts that drag them. An inscription recently deciphered by Sir H. Rawlinson (Journal of Asiatic Society, Jan. 1880, quoted by Cheyne) presents the conduct of the conqueror under a somewhat different aspect. In that inscription he describes himself as a worshipper of Bel and Nebo, and prays to them for length of days. The king would seem from this to have been as wide in his syncretic liberalism as Alexander the Great was afterwards. How are we to reconcile the two? May we say that the prophet idealises the policy and character of the king, or that the monotheistic element which appears in his treatment of the Jews (2Chronicles 36:22-23; Ezra 1:1-2) was, after all, dominant in his action, in spite of episodes like that indicated in the inscription. It is possible that the recognition of the Babylonian deities may have followed on the submission of the people, and been preceded by some rougher treatment. Anyhow the contrast makes it probable that the prophecy was not written after the inscription.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Bel boweth down, Nebo Stoopeth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Bel or Belus (“Lord “), is perhaps identical with Marduk or Merôdach, but see Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Nabu (“ the Revealer”) was a kind of Assyrian Hermes. Isaiah sees the idols carried off as spoil, at the command of Cyrus, a heavy burden for the beasts that drag them. An inscription recently deciphered by Sir H. Rawlinson (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Journal of Asiatic Society, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Jan. 1880, quoted by Cheyne) presents the conduct of the conqueror under a somewhat different aspect. In that inscription he describes himself as a worshipper of Bel and Nebo, and prays to them for length of days. The king would seem from this to have been as wide in his syncretic liberalism as Alexander the Great was afterwards. How are we to reconcile the two? May we say that the prophet idealises the policy and character of the king, or that the monotheistic element which appears in his treatment of the Jews (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 36:22-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 1:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") was, after all, dominant in his action, in spite of episodes like that indicated in the inscription. It is possible that the recognition of the Babylonian deities may have followed on the submission of the people, and been preceded by some rougher treatment. Anyhow the contrast makes it probable that the prophecy was not written after the inscription.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Your carriages.—Here, as elsewhere (1Samuel 17:22; Acts 21:15) in the sense of things carried; i.e., in this case, the images of the gods, which used to be carried in solemn procession, but are now represented as packed into a load for transport. So Herod. (1:183) states that Xerxes carried off from Babylon the golden image of Zeus (sc. Bel), the grandson thus fulfilling the prediction which his grandfather apparently had left unfulfilled.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Your carriages.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Here, as elsewhere (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 17:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 21:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in the sense of things carried; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "in this case, the images of the gods, which used to be carried in solemn procession, but are now represented as packed into a load for transport. So Herod. (1:183) states that Xerxes carried off from Babylon the golden image of Zeus (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "sc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Bel), the grandson thus fulfilling the prediction which his grandfather apparently had left unfulfilled.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 46:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 46:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The chief idol of the Babylonians, called by profane historians Jupiter Belus; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "boweth down ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As the Babylonians used to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bow down ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to him to worship him, so now he bows down, and submits himself to the victorious Persians. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nebo stoopeth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Another of their famous idols, probably a deified prophet, the word signifying to deliver oracles, or to prophesy. The names of these idols were included in the names of several of their princes, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Belshazzar; Nebo, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nabonassar; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Nebuchadnezzar, Nebuzaradan. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Their idols were upon their beasts ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Were taken and broken, and the materials of them, which were gold, and silver, and brass, were carried upon beasts into Persia. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Your carriages ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— O ye Persians, to whom he suddenly turns his speech, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were heavy loaden ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— With these useless gods, which were so far from being able to come forward to the help of their worshippers, that they could not move themselves, but must be dragged on carriages by cattle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They bow down together ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The Babylonians and their idols, neither of them being able to help the other. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They could not deliver the burden ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The Babylonians could not deliver their idols, which he now had called a burden; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but themselves are gone into captivity ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— They as well as their idols. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "46:1-4 The heathen insulted the Jews, as if their idols Bel and Nebo were too hard for Jehovah. But their worshippers cannot help them; both the idols and the idolaters are gone into captivity. Let not God's people be afraid of either. Those things from which ungodly men expect safety and happiness, will be found unable to save them from death and hell. The true God will never fail his worshippers. The history of the life of every believer is a kind of abstract of the history of Israel. Our spiritual life is upheld by his grace, as constantly as our natural life by his providence. And God will never leave them. The Author will be the Finisher of their well-being, when, by decays, they need help as much as in infancy. This promise to Israel, enfeebled and grown old as a nation, is applicable to every aged follower of Christ. When compassed about with infirmities, and perhaps those around begin to grow weary of you, yet I am He that I have promised to be, He that you would have me to be. I will bear you up; carry you on in your way, and carry you home at last. If we learn to trust in and love him, we need not be anxious about our remaining days or years; he will still provide for us and watch over us, both as the creatures of his power, and as new-created by his Spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Bel boweth down - Bel or Belus (בל  bēl, from בעל  be‛ēl, the same as בעל  ba‛al was the chief domestic god of the Babylonians, and was worshipped in the celebrated tower of Babylon (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was usual to compound names of the titles of the divinities that were worshipped, and hence, we often meet with this name, as in Bel-shazzar, Bel-teshazzar, Baal-Peor, Baal-zebub, Baal-Gad, Baal-Berith. The Greek and Roman writers compare Bel with Jupiter, and the common name which they give to this idol is Jupiter Belus (Pliny, Nat. Hist. xxxvii. 10; Cic. De Nat. Deor. iii. 16; Diod. ii. 8, 9). Herodotus (i.-181-183) says, that in the center of each division of the city of Babylon (for the Euphrates divided the city into two parts) there is a circular space surrounded by a wall. In one of these stands the royal palace, which fills a large and strongly defended space.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The temple of Jupiter Belus, says he, occupies the other, whose huge gates of brass may still be seen. It is a square building, each side of which is of the length of two furlongs. In the midst, a tower rises of the solid depth and height of one furlong; on which, resting as a base, seven other turrets are built in regular succession. The ascent on the outside, winding from the ground, is continued to the highest tower; and in the middle of the whole structure there is a convenient resting place. In this temple there is a small chapel, which contains a figure of Jupiter in a sitting posture, with a large table before him; these, with the base of the table, and the sear of the throne, are all of the purest gold. There was formerly in this temple a statue of solid gold, twelve cubits high. This was seized, says Herodotus, by Xerxes, who put the priest to death who endeavored to prevent its removal.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The upper room of this tower was occupied as an observatory. The idol Baal, or Bel, was especially the god of the Phenicians, of the Canaanites, of the Chaldeans, of the Moabites, and of some of the surrounding nations. The most common opinion has been, that the idol was the sun (see the notes at Isaiah 17:8-9), and that, under this name, this luminary received divine honors. But Gesenius supposes that by the name Jupiter Belus was not denoted Jupiter, 'the father of the gods,' but the planet Jupiter, Stella Jovis, which was regarded, together with Venus, as the giver of all good fortune; and which forms with Venus the most fortunate of all constellations under which sovereigns can be born. The planet Jupiter, therefore, he supposes to have been worshipped under the name Bel, and the planet Venus under the name of Astarte, or Astareth (see Gesenius, Commentary zu Isaiah, ii. 333ff, and Robinson's Calmet, Art. Baal). The phrase 'boweth down,' means here, probably, that the idol sunk down, fell, or was removed. It was unable to defend the city, and was taken captive, and carried away. Jerome renders Confractus est Bel - 'Bel is broken.' The Septuagint, Ἔπεσε Βὴλ  Epese Bēl - 'Bel has fallen.' Perhaps in the language there is allusion to the fact that Dagon fell before the ark of God 1 Samuel 5:2-3, 1 Samuel 5:7. The sense is, that even the object of worship - that which was regarded as the most sacred among the Chaldeans - would be removed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The upper room of this tower was occupied as an observatory. The idol Baal, or Bel, was especially the god of the Phenicians, of the Canaanites, of the Chaldeans, of the Moabites, and of some of the surrounding nations. The most common opinion has been, that the idol was the sun (see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 17:8-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and that, under this name, this luminary received divine honors. But Gesenius supposes that by the name Jupiter Belus was not denoted Jupiter, 'the father of the gods,' but the planet Jupiter, Stella Jovis, which was regarded, together with Venus, as the giver of all good fortune; and which forms with Venus the most fortunate of all constellations under which sovereigns can be born. The planet Jupiter, therefore, he supposes to have been worshipped under the name Bel, and the planet Venus under the name of Astarte, or Astareth (see Gesenius, Commentary zu Isaiah, ii. 333ff, and Robinson's Calmet, Art. Baal). The phrase 'boweth down,' means here, probably, that the idol sunk down, fell, or was removed. It was unable to defend the city, and was taken captive, and carried away. Jerome renders Confractus est Bel - 'Bel is broken.' The Septuagint, Ἔπεσε Βὴλ  Epese Bēl - 'Bel has fallen.' Perhaps in the language there is allusion to the fact that Dagon fell before the ark of God ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 5:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The sense is, that even the object of worship - that which was regarded as the most sacred among the Chaldeans - would be removed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Nebo stoopeth - This was an idol-god of the Chaldeans. In the astrological mythology of the Babylonians, according to Gesenius (Commentary zu Isaiah ii. 333ff), this idol was the planet Mercury. He is regarded as the scribe of the heavens, who records the succession of the celestial and terrestrial events; and is related to the Egyptian Hermes and Anubis. The extensive worship of this idol among the Chaldeans and Assyrians is evident from the many compound proper names occurring in the Scriptures, of which this word forms a part, as Neb-uchadnezzar, Neb-uzaradan: and also in the classics, as Nab-onad, Nab-onassar. Nebo was, therefore, regarded as an attendant on Bel, or as his scribe. The exact form of the idol is, however, unknown. The word 'stoopeth,' means that it had fallen down, as when one is struck dead he falls suddenly to the earth; and the language denotes conquest, where even the idols so long worshipped would be thrown down. The scene is in Babylon, and the image in the mind of the prophet is that of the city taken, and the idols that were worshipped thrown down by the conqueror, and carried away in triumph.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Their idols were upon the beasts - That is, they are laid upon the beasts to be borne away in triumph. It was customary for conquerors to carry away all that was splendid and valuable, to grace their triumph on their return; and nothing would be a more certain indication of victory, or a more splendid accompaniment to a triumph, than the gods whom the vanquished nations had adored. Thus in Jeremiah 48:7, it is said, 'And Chemosh shall go forth into captivity, with his priests and his princes together' (compare Jeremiah 44:3, margin.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Their idols were upon the beasts - That is, they are laid upon the beasts to be borne away in triumph. It was customary for conquerors to carry away all that was splendid and valuable, to grace their triumph on their return; and nothing would be a more certain indication of victory, or a more splendid accompaniment to a triumph, than the gods whom the vanquished nations had adored. Thus in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 48:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is said, 'And Chemosh shall go forth into captivity, with his priests and his princes together' (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", margin.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Your carriages - That is, they were laden with the idols that were thus borne off in triumph.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They are a burden - They are so numerous; so heavy; and to be borne so far. This is a very striking and impressive manner of foretelling that the city of Babylon would be destroyed. Instead of employing the direct language of prophecy, the prophet represents himself as seeing the heavy laden animals and wagons moving along slowly, pressed down under the weight of the captured gods to be borne into the distant country of the conqueror. They move forth from Babylon, and the caravan laden with the idols, the spoils of victory, is seen slowly moving forward to a distant land. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They are a burden - They are so numerous; so heavy; and to be borne so far. This is a very striking and impressive manner of foretelling that the city of Babylon would be destroyed. Instead of employing the direct language of prophecy, the prophet represents himself as seeing the heavy laden animals and wagons moving along slowly, pressed down under the weight of the captured gods to be borne into the distant country of the conqueror. They move forth from Babylon, and the caravan laden with the idols, the spoils of victory, is seen slowly moving forward to a distant land. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 46",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Isa 46:1-13. Babylon's Idols Could Not Save Themselves, Much Less Her. But God Can and Will Save Israel: Cyrus Is His Instrument.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Bel—the same as the Phœnician Baal, that is, lord, the chief god of Babylon; to it was dedicated the celebrated tower of Babylon, in the center of one of the two parts into which the city was divided, the palace being in the center of the other. Identical with the sun, worshipped on turrets, housetops, and other high places, so as to be nearer the heavenly hosts (Saba) (Jer 19:13; 32:29; Zep 1:5). Gesenius identifies Bel with the planet Jupiter, which, with the planet Venus (under the name Astarte or Astaroth), was worshipped in the East as the god of fortune, the most propitious star to be born under (see on [818]Isa 65:11). According to the Apocryphal book, Bel and the Dragon, Bel was cast down by Cyrus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "boweth … stoopeth—falleth prostrate (Isa 10:4; 1Sa 5:3, 4; Ps 20:8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nebo—the planet Mercury or Hermes, in astrology. The scribe of heaven, answering to the Egyptian Anubis. The extensive worship of it is shown by the many proper names compounded of it: Nebuchadnezzar. Nebuzar-adan, Nabonassar, &c.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "were upon—that is, were a burden (supplied from the following clause) upon. It was customary to transport the gods of the vanquished to the land of the conquerors, who thought thereby the more effectually to keep down the subject people (1Sa 5:1, &c.; Jer 48:7; 49:3; Da 11:8).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "carriages—in the Old English sense of the things carried, the images borne by you: the lading (Ac 21:15), \"carriages,\" not the vehicles, but the baggage. Or, the images which used to be carried by you formerly in your solemn processions [Maurer].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "were heavy loaden—rather, are put as a load on the beasts of burden [Maurer]. Horsley translates, \"They who should have been your carriers (as Jehovah is to His people, Isa 46:3, 4) are become burdens\" (see on [819]Isa 46:4).The ruin of Babylon and her idols, Isaiah 46:1,2. God’s love and faithfulness to the Jews, Isaiah 46:3,4. Idols not to be compared with God, Isaiah 46:5-8, for power, knowledge, and sure salvation, Isaiah 46:9-13.  Bel;  the chief idol of the Babylonians, Jeremiah 50:2 51:44, called by profane historians Jupiter Belus. Boweth down;  as the Babylonians used to bow down to him to worship him, so now he boweth down and submits himself to the victorious Persians. Nebo;  another of the famous idols, which used to deliver oracles, as his name signifies. Their idols were upon the beasts;  were taken and broken, and the materials of them, which were gold, and silver, and brass, as both Scripture and other authors witness, were carried upon beasts into Persia. Your carriages,  O ye Persians; to whom he suddenly turneth his speech, as is usual; were heavy laden;  they lie upon the backs of your cattle like dull, and unprofitable, and heavy burdens to the beasts, as they had been to men before. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "were heavy loaden—rather, are put as a load on the beasts of burden [Maurer]. Horsley translates, \"They who should have been your carriers (as Jehovah is to His people, Isa 46:3, 4) are become burdens\" (see on [819]Isa 46:4).The ruin of Babylon and her idols, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 46:1,2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God’s love and faithfulness to the Jews, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 46:3,4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Idols not to be compared with God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 46:5-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for power, knowledge, and sure salvation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 46:9-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Bel; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the chief idol of the Babylonians, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 50:2 51:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", called by profane historians Jupiter Belus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Boweth down; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the Babylonians used to bow down to him to worship him, so now he boweth down and submits himself to the victorious Persians. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Nebo; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " another of the famous ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "idols",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which used to deliver oracles, as his name signifies. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Their idols were upon the beasts; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " were taken and broken, and the materials of them, which were gold, and silver, and brass, as both Scripture and other authors witness, were carried upon beasts into Persia. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Your carriages, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " O ye Persians; to whom he suddenly turneth his speech, as is usual; ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "were heavy laden; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " they lie upon the backs of your cattle like dull, and unprofitable, and heavy burdens to the beasts, as they had been to men before. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Bel boweth down, Nebo stoopeth,.... These are names of the idols of Babylon. Bel is by some thought to be the contraction of Baal, the god of the Phoenicians, called by them Beel; so \"Beelsamin\" (h), in the Phoenician language, is Lord of heaven: but rather this is the Belus of the Babylonians, who was a renowned king of them, and after his death deified; whom Nebuchadnezzar, according to Megasthenes (i), calls Belus his progenitor, and by whom Babylon was walled about. This idol is, no doubt, the same with Jupiter Belus, who had a temple in Babylon with gates of brass, and which was in being in the times of Herodotus (k), as he reports. This name is sometimes taken into the names of their kings, as Belshazzar or Beltesbazaar. Nebo was another of their idols, an oracular one, from whom, by its priests, prophesies of things future were pretended to be given out; for it may have its name from  \"to prophesy\", and answers to the Apollo or Mercury of other nations. The Alexandrian copy of the Septuagint has very wrongly, instead of it, Dagon the god of the Philistines; and so the Arabic version \"Dsagon\". This name Nebo was also taken into the names of the kings of Babylon, as Nabonassar, Nabopalassar, Nebuchadnezzar, and others. As Bel is the same with Belus, so Nebo is the same with Beltis, the queen Megasthenes or Abydenus speaks of in the same place; and Bel may design the sun, and Nebo the moon, which may have its name from  \"to bud forth\", or \"make fruitful\", as the moon does; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is said of both these deities, that they \"stooped\" or \"bowed down\"; being taken down from the high places where they were set upright, and looked grand and majestic, and where they might be seen and worshipped by the people. Jarchi gives the words another sense, that it represents in a sarcastic way these idols, as through fear, in a like condition that men are in, in a fit of the colic, who not being able to get to the solid stool, are obliged to bend their knees, and ease themselves as they can (l). Aben Ezra seems to refer to the same signification of the word, when he says the sense was well known, but it was not fit to write it. The prophet goes on in the derision of these idols: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "their idols were upon the beasts, and upon the cattle; that is, being taken down, and broke to pieces for the sake of the silver, and gold, and brass that were about them, or they were made of, they were put into sacks by the Persians, and laid upon camels, and mules, and horses, and transported into Media and Persia. Jarchi interprets it, their idols are like to beasts, which defile themselves with their dung as they do; and so the Targum renders it, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"their images are \"in\" the likeness of serpents and beasts.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "These were the forms of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "your carriages were heavy loaden, they are a burden to the weary beast; this seems to be spoken to the Persians, who loaded their carriages, and their beasts, with this lumber, that their wagons were ready to break down, and their cattle groaned under the weight of it; a sarcastic jeer at the idols which were become the plunder and prey of the soldiers. It was usual at the taking of cities to demolish the idols of them; and this was typical of the demolition of Heathen idols, and the cessation of Heathen oracles in the Gentile world, through the spread of the Gospel in it, in the first times of Christianity. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Sanchoniatho apud Euseb. Praepar. Evangel. l. 1. c. 10. p. 34. (i) Apud Euseb. Praepar. Evangel. l. 9. c. 4. l. p. 456. (k) Clio, sive l. 1. c. 181. Vid. Pausan. Messen. p. 261. (l) Vid. gloss. in T. Bab. Sanhedrin, fol. 63. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) Sanchoniatho apud Euseb. Praepar. Evangel. l. 1. c. 10. p. 34. (i) Apud Euseb. Praepar. Evangel. l. 9. c. 4. l. p. 456. (k) Clio, sive l. 1. c. 181. Vid. Pausan. Messen. p. 261. (l) Vid. gloss. in T. Bab. Sanhedrin, fol. 63. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Bel boweth down, {a} Nebo stoopeth, their idols were upon the {b} beasts, and upon the cattle: your carriages were heavily loaded; they were a burden to the weary beast.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Bel boweth down, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Nebo stoopeth, their idols were upon the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " beasts, and upon the cattle: your carriages ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " heavily loaded; ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "they were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a burden to the weary ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "beast",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) These were the chief idols of Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Because they were of gold and silver, the Medes and Persians carried them away.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1, 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ignominious flight of the gods of Babylon.—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nebo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are the Jupiter and Mercury of the Babylonian pantheon (they are represented by these planets), and were the supreme deities in Babylon at this time. Bel (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bîlu",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is the Babylonian form of the Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ba‘al",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= lord), and like that word is a generic name applicable to any deity. When used as a proper name it usually denotes Merodach (Marduk), the tutelary divinity of the city of Babylon (so ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); although there was an older Bel, who is spoken of as his father. The elevation of Bel-Merodach to the chief place among the older gods, as recorded in the mythical Chaldæan account of the Creation (Tablet IV., 1 ff.), is the legendary counterpart of the ascendency acquired by Babylon over the more ancient cities of the Euphrates Valley. Nebo (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nabu",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") was the son of Merodach; the chief seat of his worship being Borsippa, in the vicinity of Babylon. His name, which is supposed to be from the same root as the Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nâbî’",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “prophet,” seems to mark him out as the “speaker” of the gods (another point of contact with Mercury, “the chief speaker,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He was also regarded as the inventor of writing. The frequency with which the Chaldæan kings are named after him (Nabo-polassar, Nebu-chadnezzar, Nabo-nidus) has been thought to shew that he was the patron deity of the dynasty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "boweth down … stoopeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (better ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "croucheth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")] The second verb to be pointed, like the first, as perfect (prophetic pf.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their idols",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "are",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (R.V.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon the beasts, and upon the cattle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The allusion is hardly to the custom of carrying away the idols of a conquered nation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 48:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.), but rather to an attempt of the Babylonians to carry off their images on the approach of the Persians (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 46:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 46:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). Similarly, Merodach-Baladan packed his idols on ships and carried them off, at the approach of Sennacherib (Schrader, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cuneiform Inscr.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vol. ii. p. 36.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Beasts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cattle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " usually mean respectively “wild beasts” and “domestic animals”; here, however, they both denote beasts of burden simply.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "your carriages",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "heavy loaden",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather as R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the things that ye carried about",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. in religious processions (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "are made a load",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “At the New Year’s festival the images of Merodach and his son Nebo were carried through Babylon in solemn procession on sacred barques of great magnificence, and along a promenade prepared for this purpose since Nabopolassar” (Fried. Delitzsch, quoted by Delitzsch, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Comm.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " p. 403). Such scenes must have been familiar to the prophet and his readers, and gave additional point to the contrasted picture here imagined.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1, 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - THE FALL OF THE GODS OF BABYLON. Among the direct consequences of the victories of Cyrus will be the downfall, in a certain sense, of the Babylonian idolatry. The prophet expresses the downfall by material imagery, graphically describing the fate of the idols themselves. But we must regard him as exulting mainly in the thought of the blow that would be dealt to idolatry in general, and to the Babylonian fond of it in particular, by the substitution of the non-idolatrous and almost monotheistic Persians for the polytheistic and grossly idolatrous Babylonians, in the sovereignty of the Asiatic world. The Babylonian religion no doubt maintained itself at Babylon until and beyond the time of Alexander; but it had lost all its prestige. From the state religion of the chief empire of Western Asia, it had sunk to the position of a provincial cult. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Bel boweth down, Nebo stoopeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the later Babylonian period, to which Isaiah's prophetic vision transports him, Bel and Nebo (if we understand by Bel, Bel-Merodach) were decidedly the two principal gods. Of the seven kings of the last dynasty, three had names in which Nebo, and two names in which Bel or Merodach, wad an element. Bel-Merodach and Nebo are the chief gods worshipped by Nebuchadnezzar and Neriglissar. Bel, Nebo, and Merodach are the only three Babylonian gods that receive acknowledgment from Cyrus in the so-called 'Cyrus Cylinder.' Bel is, in the Babylonian, \"Bil,\" or \"Belu,\" and means simply \"lord.\" There was an ancient god of the name, one of the First Triad (Anu, Bel, and Hen or Hod), who came by degrees to be identified with Merodach, the tutelary deity of Babylon. Bel-Merodach was the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Βῆλος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Belus) of the Greeks and Romans, who was worshipped in the great temple of Babylon, now represented by the ruin called \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Babil.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " His name forms an element in those of Bel-lush, Bel-kudur-azur, Bel-ipni. Bel-zakir-isknn, and Belshazzar, all of them kings or viceroys of either Babylonia or Assyria. Nebu was the Babylonian god of learning, and has therefore been compared to Mercury. He was the special deity of Borsippa. The name is thought to be etymologically connected with the Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nabi",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", prophet. The \"bowing\" and \"stooping\" of Bel and Nebo has primary reference to the overthrow of their images by the conqueror; but includes also the idea of the fall of the gods themselves in the opinions of men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Their idols were upon the beasts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Chaldean images generally - not only those of Bel-Merodach and Nebo, but also of Ann, and Hen, and Beltis, and Ishtar, and Nergal, and Sin, and Shamas, and Gula, and others - would be torn from their shrines, and placed upon the backs of beasts of burden, to be carried off by the conquerors. No doubt this was the case with a large number of the images, which were among the most precious of the spoils seized by the soldiers. But it appears that numerous exceptions were made. Neither Cyrus nor Cambyses touched the famous golden image of Bel-Merodach at Babylon, which was first carried off from the great temple by Xerxes (Herod., 1:183). Cyrus, moreover, restored various idols, which Nabonidus had taken to Babylon from provincial towns, to the temples to which they of right belonged (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Journal of Royal Asiatic Society",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", January, 1880, art. it.). But though their fate was in tiffs way often delayed, ultimately it is probable every valuable idol was carried off and committed to the melting-pot. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Your carriages were heavy loaden",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the things that ye carried",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in procession",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "are now borne along heavily.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The allusion is to the contrast between the light-hearted carrying of the images on festal occasions by their votaries (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and their slow transport to foreign lands on the backs of wearied beasts. Isaiah 46:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There follows now a trilogy of prophecies referring to Babylon. After the prophet has shown what Israel has to expect of Cyrus, he turns to what awaits Babylon at the hands of Cyrus. \"Bel sinketh down, Nebo stoopeth; its images come to the beast of burden and draught cattle: your litters are laden, a burden for the panting. They stopped, sank down all at once, and could not get rid of the burden; and their own self went into captivity.\" The reference to Babylon comes out at once in the names of the gods. Bēl was the Jupiter of the Babylonians and, as Bel-Merodach, the tutelar deity of Babylon; Nebo was Mercury, the tutelar deity of the later Chaldean royal family, as the many kings' names in which it appears clearly show (e.g., Mabonassar, Nabo-polassar, etc.). The pryamidal heap of ruins on the right bank of the Euphrates, which is now called Birs Nimrud, is the ruin of the temple of Bel, of which Herodotus gives a description in i.-181-183, and probably also of the tower mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which was dedicated to Bel, if not to El  equals  Saturn. Herodotus describes two golden statues of Bel which were found there (cf., Diodorus, ii. 9, 5), but the way in which Nebo was represented is still unknown. The judgment of Jehovah falls upon these gods through Cyrus. Bel suddenly falls headlong, and Nebo stoops till he also falls. Their images come to (fall to the lot of) the chayyâh, i.e., the camels, dromedaries, and elephants; and behēmâh, i.e., horses, oxen, and asses. Your נשׂאת, gestamina, the prophet exclaims to the Babylonians, i.e., the images hitherto carried by you in solemn procession (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 5:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), are now packed up, a burden for that which is wearied out, i.e., for cattle that has become weary with carrying them. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the two participial clauses show, the prophet still takes his stand in the midst of the catastrophe; but in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it undoubtedly lies behind him as a completed act. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he continues, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to enter into the delusion of the heathen, and distinguish between the numina and simulacra. The gods of Babylon have all stooped at once, have sunken down, and have been unable to save their images which were packed upon the cattle, out of the hands of the conquerors. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he destroys this delusion: they are going into captivity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 48:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), even \"their ownself\" (naphshâm), since the self or personality of the beingless beings consists of nothing more than the wood and metal of which their images are composed. ",
        "children": []
      }
    ]
  }
]