[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Calling a ravenous bird.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Cyrus is thus described as Nebuchadnezzar is in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The image derives a special significance from the fact that the standard borne by Cyrus and his successors was a golden eagle (Xen., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cyrop. vii.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. 4; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Anab. i.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 10, 12). (Comp. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 17:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The “sun-rising” is, of course, Persia; the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "far country” probably represents Media.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I have spoken.—The word of Jehovah passes, unlike that of the false gods, into a certain and immediate act.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "I have spoken.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The word of Jehovah passes, unlike that of the false gods, into a certain and immediate act.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "46:5-13 Here the folly of those who made idols, and then prayed to them, is exposed. How does the profuseness of idolaters shame the stubbornness of many who call themselves God's servants, but are for a religion which costs them nothing! The service of sin always costs a great deal. God puts it to them what senseless, helpless things idols are. Let, then, the Jews show themselves men, avoiding such abominations. Many Scripture prophecies, delivered long ago, are not yet fulfilled; but the fulfilling of some is an earnest that the rest will come to pass. Nothing can help more to make us easy, than to be assured that God will do all his pleasure. Even those who know not and mind not God's revealed will, are called and used to fulfil the counsels of his secret will. Heaven and earth shall pass away, sooner than one tittle of the word of God. Obstinate sinners are addressed. Such were far from acceptance, but they were summoned to hearken to the word of the Lord. The salvation of a sinner begins with a humble and contrite heart, that trembles at God's word, with godly sorrow working true repentance, and faith in his mercy, through the obedience unto death of our Divine Surety. Christ, as the Divine righteousness and salvation to his people, would come in the appointed time. His salvation abides in his church for all believers.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Calling a ravenous bird from the east - There can be no doubt that Cyrus is intended here (see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The east here means Persia. The word rendered 'ravenous bird' (עיט  ‛ayiṭ) is rendered 'fowl' in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 28:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 'bird' or 'birds' in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 'fowls' in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and 'ravenous birds' in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 39:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It does not occur elsewhere in the Bible. It is used here as an emblem of a warlike king, and the emblem may either denote the rapidity of his movements - moving with the flight of an eagle; or it may denote the devastation which he would spread - an emblem in either sense especially applicable to Cyrus. It is not uncommon in the Bible to compare a warlike prince to an eagle ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the idea here is, probably, that Cyrus would come with great power and velocity upon nations, like the king of birds, and would pounce suddenly and unexpectedly upon his prey. Perhaps also there may be here allusion to the standard or banner of Cyrus. Xenophon (Cyrop. vii.) says that it was a golden eagle affixed to a long spear; and it is well remarked by Lowth, that Xenophon has used the very word which the prophet uses here, as near as could be, expressing it in Greek letters. The word of the prophet is עיט  ‛ayiṭ; the Greek word used by Xenophon is ἀετὸς  aetos. The Chaldee has, however, given a different rendering to this passage: 'I, who say that I will gather my captivity from the east, and will lead publicly like a swift bird from a distant land the sons of Abraham, my friend.'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The man that executeth my counsel - Margin, as Hebrew, 'Of my counsel.' It may either mean the man whom he had designated by his counsel; or it may mean the man who should execute his purpose.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yea, I have spoken - He spake it by the prophets; and the idea is, that all that he had spoken should be certainly accomplished. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yea, I have spoken - He spake it by the prophets; and the idea is, that all that he had spoken should be certainly accomplished. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. ravenous bird—Cyrus so called on account of the rapidity of his marches from the distant regions of Persia to pounce on his prey (see on [820]Isa 41:2; [821]Isa 41:25; [822]Jer 49:22; [823]Eze 17:3). The standard of Cyrus, too, was a golden eagle on a spear (see the heathen historian, Xenophon, 7, where almost the same word is used, aetos, as here, ayit).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "executeth my counsel—(Isa 44:28; 45:13). Babylon represents, mystically, the apostate faction: the destruction of its idols symbolizes the future general extirpation of all idolatry and unbelief.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "purposed … also do it—(Isa 43:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Calling a ravenous bird; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Cyrus, called a bird for his swiftness and great expedition, and ravenous for his fierceness and victoriousness over his enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From the east; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from Persia, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 41:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That executeth my counsel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " concerning the deliverance of my people, and the destruction of their cruel oppressors, the Babylonians. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From a far country; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from Persia, which was far from Babylon, but much farther from Judea. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Calling a ravenous bird from the east,.... Or \"a flying fowl\", or \"swift winged bird\" (u); for the word used does not so much denote rapaciousness as swiftness; which well agrees with Cyrus, who is here meant, and not Abraham, as Jarchi, nor Nebuchadnezzar, as others; and who was always swift in all his expeditions, and always recommended celerity and dispatch of business to his soldiers and others, as Xenophon (w) often observes; and very remarkable is that speech of Tigranes to him, in which he tells him (x), that he so far exceeded the king of Armenia in swiftness, that he came upon him with a great army, from a far country, before he could get his army together, which was just by him. And very observable are the words of Cyrus himself, who was desirous of being a thorough horseman, that he might seem to be , \"a winged\" or \"flying man\" (y) So the Targum here renders it, a swift bird. Aben Ezra, who interprets it of Cyrus, says he is so called, as if he flew to do the will of God; and Kimchi observes of Cyrus, that he has this name because he came swiftly, and in haste, as a bird that flies: and it is no unusual thing for a mighty monarch, or a general, marching with his army, to be compared to a flying bird, particularly an eagle, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 48:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and may be the bird intended here, which well suits with Cyrus, who had, as Plutarch (z) reports, an aquiline nose; hence men that have such noses, among the Persians, are highly esteemed: and Xenophon (a) says, that the standard of Cyrus was a golden eagle upon the top of a high spear, and which is retained by the kings of Persia. Cyrus is said to be called from the east, because, as Kimchi observes, his country lay to the east of Babylon: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the man that executeth my counsel from afar country; as Persia was from Babylon, Assyria and other provinces lying between; but though he lived in a far country, and knew nothing of the affairs of the people of God in Babylon, or what work he was to do, yet God called him, and brought him to do his will, which he was ignorant of: so God sometimes puts into the hearts of men to fulfil his will, which they are strangers to, Revelation 17:17. It is in the Hebrew text, \"the man of my counsel\" (b); not with whom the Lord consulted, for none are of his counsel in this sense; but whom in his counsels, decrees, and purposes, he appointed to such service, and whom he made use of as an instrument to do his pleasure; see Isaiah 44:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the man that executeth my counsel from afar country; as Persia was from Babylon, Assyria and other provinces lying between; but though he lived in a far country, and knew nothing of the affairs of the people of God in Babylon, or what work he was to do, yet God called him, and brought him to do his will, which he was ignorant of: so God sometimes puts into the hearts of men to fulfil his will, which they are strangers to, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 17:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is in the Hebrew text, \"the man of my counsel\" (b); not with whom the Lord consulted, for none are of his counsel in this sense; but whom in his counsels, decrees, and purposes, he appointed to such service, and whom he made use of as an instrument to do his pleasure; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "yea, I have spoken it, I will also bring it to pass: I have purposed, I will also do it; the counsel of the Lord, concerning the deliverance of his people from Babylon, by the hand of Cyrus; this he had purposed in his own breast, had spoken of in prophecy, and would certainly perform. R. Joseph Kimchi interprets this verse of the Messiah, and so does Jerom, of whom, no doubt, Cyrus was a type; and what is here said agrees with him: he may be compared to a flying bird for his swiftness in coming at the appointed time; he came from the east, as the rising sun of righteousness; he was the man of God's counsel in the highest sense, and came, being called, to execute it; the work of redemption was according to the eternal purpose of God, and spoke of by all the holy prophets, and now accomplished; and his righteousness and salvation are made mention of in the following verses. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) \"avem, a velocitate\", Munster; so Vatablus; ab \"in volando celeriter et cum impetu\", Forerius; so Ben Melech says, Cyrus is surnamed a fowl, because of his great swiftness and haste to come to Babylon; though he observes that some say, that a ravenous fowl is called  the singular may be put for the plural; so Cocceius renders it, \"volucres\", birds, and may design the whole army of Cyrus. (w) Cyropaedia, l. 1. c. 17. and l. 3. c. 6. and l. 6. c. 17. (x) Cyropaedia, l. 3. c. 2.((y) Ib. l. 4. c. 17. (z) In Apothegm. (a) Cyropaedia, l. 7. c. 1.((b)  \"virum mei consilii\", Munster, Pagninus, Montanus; so according to the Keri: but the Cetib is , \"the man of his counsel\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) \"avem, a velocitate\", Munster; so Vatablus; ab \"in volando celeriter et cum impetu\", Forerius; so Ben Melech says, Cyrus is surnamed a fowl, because of his great swiftness and haste to come to Babylon; though he observes that some say, that a ravenous fowl is called  the singular may be put for the plural; so Cocceius renders it, \"volucres\", birds, and may design the whole army of Cyrus. (w) Cyropaedia, l. 1. c. 17. and l. 3. c. 6. and l. 6. c. 17. (x) Cyropaedia, l. 3. c. 2.((y) Ib. l. 4. c. 17. (z) In Apothegm. (a) Cyropaedia, l. 7. c. 1.((b)  \"virum mei consilii\", Munster, Pagninus, Montanus; so according to the Keri: but the Cetib is , \"the man of his counsel\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Calling a ravenous {i} bird from the east, the man that executeth my {k} counsel from a far country: yea, I have spoken it, I will also bring it to pass; I have purposed it, I will also perform it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Calling a ravenous ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " bird from the east, the man that executeth my ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " counsel from a far country: yea, I have spoken ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", I will also bring it to pass; I have purposed ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", I will also perform it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) That is, Cyrus, who will come as swift as a bird and fight against Babylon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Him by whom I have appointed to execute that which I have determined.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The supreme illustration of the foreknowledge and power of Jehovah is the raising up of Cyrus. Cyrus is compared to a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ravenous bird",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on account of the celerity of his movements (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), just as Nebuchadnezzar had been likened to an eagle (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There can hardly be an allusion to the fact (if it be a fact) that the royal ensign of Persia was a golden eagle (Xenophon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cyrop.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " vii. 1, 4).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the east",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the man that executeth my counsel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. as R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the man of my counsel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the consonantal text has “his counsel”). Not of course “my counsellor” (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but in the sense expressed by the A.V.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have purposed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have formed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. “foreordained,” as in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Calling a ravenous bird",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a bird of prey.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The imagery is quite natural, and exactly parallel to that by which Nebuchadnezzar is termed \"an eagle,\" both by Jeremiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Ezekiel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There is no need to suppose any allusion to the fact, if fact it be, that the Persians from the time of Cyrus had for a standard a golden eagle, with wings outspread, on the top of a spear-shaft (Xen., 'Cyrop.,' 7:1, § 4; 'Anab.,' 1:10, § 12). From the east (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:2, 25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Both Persia and Susiana, which were the primary seats of the power of Cyrus, lay to the east of Babylon, the latter due east, the former somewhat to the south-east. Even Media might, according to Hebrew usage, be described as east, though lying almost due north-east. Isaiah 46:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The second admonition is addressed to those who would imitate the heathen. \"Remember this, and become firm, take it to heart, ye rebellious ones! Remember the beginning from the olden time, that I am God, and none else: Deity, and absolutely none like me: proclaiming the issue from the beginning, and from ancient times what has not yet taken place, saying, My counsel shall stand, and all my good pleasure I carry out: calling a bird of prey from the east, the man of my counsel from a distant land: not only have I spoken, I also bring it; I have purposed it, I also execute it.\" The object to which \"this\" points back is the nothingness of idols and idolatry. The persons addressed are the פושׁעים (those apostatizing), but, as התאשׁשׁוּ shows, whether it mean ἀνδιρίζεσθε or κραταιοῦσθε (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 16:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), such as have not yet actually carried out their rebellion or apostasy, but waver between Jehovahism and heathenism, and are inclined to the latter. התאשׁשׁו is hardly a denom. hithpalel of אישׁ in the sense of \"man yourselves,\" since אישׁ, whether it signifies a husband or a social being, or like אנושׁ, a frail or mortal being, is at any rate equivalent to אנשׁ, and therefore never shows the modification u. אשׁשׁ (אשׁה) signifies to be firm, strong, compact; in the piel (rabb.), to be well-grounded; nithpael, to be fortified, established; here hithpoel, \"show yourselves firm\" (Targ., Jer.: fundamini ne rursum subitus idololatriae vos turbo subvertat). That they may strengthen themselves in faith and fidelity, they are referred to the history of their nation; ראשׁנות are not prophecies given at an earlier time - a meaning which the priora only acquire in such a connection as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - but former occurrences. They are to pass before their minds the earlier history, and indeed \"from the olden time.\" \"Remember:\" zikhrū is connected with the accusative of the object of remembrance, and כּי points to its result. An earnest and thoughtful study of history would show them that Jehovah alone was El, the absolutely Mighty One, and 'Elōhı̄m, the Being who united in Himself all divine majesty by which reverence was evoked. The participles in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are attached to the \"I\" of כּמוני. It is Jehovah, the Incomparable, who has now, as at other times from the very commencement of the new turn in history, predicted the issue of which it would lead, and miqqedem, i.e., long before, predicted things that have not yet occurred, and which therefore lit outside the sphere of human combination - another passage like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., in which what is predicted in these prophecies lays claim to the character of a prediction of long standing, and not of one merely uttered a few years before. The ראשׁית, in which the ראשׁנות are already in progress (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is to be regarded as the prophet's ideal present; for Jehovah not only foretells before the appearance of Cyrus what is to be expected of him, but declares that His determination must be realized, that He will bring to pass everything upon which His will is set, and summons the man upon the stage of history as the instrument of its accomplishment, so that He knew Cyrus before he himself had either consciousness or being (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The east is Persis (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and the distant land, the northern part of Media (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Cyrus is called an eagle, or, strictly speaking, a bird of prey (‛ayit),",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The resemblance to ἀετός (αἰετός) is merely accidental. This name for the eagle is traceable, like avid, to a root vâ, to move with the swiftness of the wind. This was shown by Passow, compare Kuhn's Zeitschrift, i. 29, where we also find at 10, 126 another but less probable derivation from a root i, to go (compare eva, a course).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "just as in Jeremiah 49:22 and Ezekiel 17:3 Nebuchadnezzar is called a nesher. According to Cyrop. vii. 1, 4, the campaign of Cyrus was ἀετὸς χρυσοῦς ἐπὶ δόρατος μακροῦ ἀνατεταμένος. Instead of עצתו אישׁ, the keri reads more clearly, though quite unnecessarily, (עצתי אישׁ (see e.g., Isaiah 44:26). The correlate אף (Isaiah 46:11), which is only attached to the second verb the second time, affirms that Jehovah does not only the one, but the other also. His word is made by Him into a deed, His idea into a reality. יצר is a word used particularly by Isaiah, to denote the ideal preformation of the future in the mind of God (cf., Isaiah 22:11; Isaiah 37:26). The feminine suffixes refer in a neuter sense to the theme of the prophecy - the overthrow of idolatrous Babel, upon which Cyrus comes down like an eagle, in the strength of Jehovah. So far we have the nota bene for those who are inclined to apostasy. They are to lay to heart the nothingness of the heathen gods, and, on the other hand, the self-manifestation of Jehovah from the olden time, that is to say, of the One God who is now foretelling and carrying out the destruction of the imperial city through the eagle from the east. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "just as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 17:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Nebuchadnezzar is called a nesher. According to Cyrop. vii. 1, 4, the campaign of Cyrus was ἀετὸς χρυσοῦς ἐπὶ δόρατος μακροῦ ἀνατεταμένος. Instead of עצתו אישׁ, the keri reads more clearly, though quite unnecessarily, (עצתי אישׁ (see e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The correlate אף (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 46:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which is only attached to the second verb the second time, affirms that Jehovah does not only the one, but the other also. His word is made by Him into a deed, His idea into a reality. יצר is a word used particularly by Isaiah, to denote the ideal preformation of the future in the mind of God (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The feminine suffixes refer in a neuter sense to the theme of the prophecy - the overthrow of idolatrous Babel, upon which Cyrus comes down like an eagle, in the strength of Jehovah. So far we have the nota bene for those who are inclined to apostasy. They are to lay to heart the nothingness of the heathen gods, and, on the other hand, the self-manifestation of Jehovah from the olden time, that is to say, of the One God who is now foretelling and carrying out the destruction of the imperial city through the eagle from the east. ",
            "children": []
          }
        ]
      }
    ]
  }
]