[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hearken unto me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The prophet’s choice of words is singularly emphatic. The false gods are borne away as a burden. The true God bears, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "supports, His people. He is able to bear that burden. Every “I” is emphasised in the Hebrew.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 46:3-4. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 46:3-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hearken, &c., all the remnant of the house of Israel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— All that remain of the twelve tribes. He terms them a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "remnant, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "either because the ten tribes were already carried into captivity by Shalmaneser, or because he addresses that remnant of the two tribes, which he foresaw would return from Babylon; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which are borne by me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Whom I have nourished and cared for from time to time, ever since you were a people, and came out of Egypt, and that as affectionately and tenderly as parents bring up their own children. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Even to hoar hairs will I carry you ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That kindness which I have shown you, and that care which I have taken of you, I will continue to you to the end, never forsaking you, unless you wilfully and obstinately cast me off; which the Jews did when their Messiah came. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have made you, and will carry, and deliver you — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "You are my workmanship, both as you are men, and as you are my peculiar people; and therefore I will preserve and deliver you. The reader will observe, that the prophet here “very ingeniously, and with great force, contrasts the power of God, and his tender goodness effectually exerted toward his people with the inability of the false gods of the heathen: he, like an indulgent father, had carried his people, in his arms, ‘as a man carrieth his son,’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; he had protected them and delivered them in their distresses; whereas the idols of the heathen were forced to be carried about themselves, and removed from place to place, with a great labour and fatigue to their worshippers; nor could they answer, or deliver their votaries, when they cried unto them.” See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "46:1-4 The heathen insulted the Jews, as if their idols Bel and Nebo were too hard for Jehovah. But their worshippers cannot help them; both the idols and the idolaters are gone into captivity. Let not God's people be afraid of either. Those things from which ungodly men expect safety and happiness, will be found unable to save them from death and hell. The true God will never fail his worshippers. The history of the life of every believer is a kind of abstract of the history of Israel. Our spiritual life is upheld by his grace, as constantly as our natural life by his providence. And God will never leave them. The Author will be the Finisher of their well-being, when, by decays, they need help as much as in infancy. This promise to Israel, enfeebled and grown old as a nation, is applicable to every aged follower of Christ. When compassed about with infirmities, and perhaps those around begin to grow weary of you, yet I am He that I have promised to be, He that you would have me to be. I will bear you up; carry you on in your way, and carry you home at last. If we learn to trust in and love him, we need not be anxious about our remaining days or years; he will still provide for us and watch over us, both as the creatures of his power, and as new-created by his Spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hearken unto me - From this view of the captive gods, the address is now turned to the Jews. The utter vanity of the idols had been set before them; and in view of that, God now addresses his own people, and entreats them to put their trust in him. The address he commences with words of great tenderness and endearment, designed to lead them to confide in him as their Father and friend.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And all the remnant - All who were left from slaughter, and all who were borne into captivity to Babylon. The language here is all full of tenderness, and is suited to inspire them with confidence in God. The idols of the pagan, so far from being able to protect their worshippers, were themselves carried away into ignoble bondage, but Yahweh was himself able to carry his people, and to sustain them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which are borne by me - Like an indulgent father, or a tender nurse, he had carried them from the very infancy of their nation. The same image occurs in Deuteronomy 1:31 : 'And in the wilderness, where thou hast seen how that the Lord thy God bare thee, as a man doth bear his son, in all the way that ye went, until ye came into thins place.' A similar figure occurs in Exodus 19:4 : 'Ye have seen, how I bare you on eagles' wings, and brought you unto myself' (so Deuteronomy 32:11-12; compare Numbers 11:12; Isaiah 63:9). All this here stands opposed to the idols of the Babylonians. They were unable to protect their people. They were themselves made captive. But God had shown the part of a father and a protector to his people in all times. He had sustained and guided them; he had never forsaken them; he had never, like the idol-gods, been compelled to leave them in the power of their enemies. From the fact that he had always, even from the infancy of their nation, thus protected them, they are called on to put their trust in him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which are borne by me - Like an indulgent father, or a tender nurse, he had carried them from the very infancy of their nation. The same image occurs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 1:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : 'And in the wilderness, where thou hast seen how that the Lord thy God bare thee, as a man doth bear his son, in all the way that ye went, until ye came into thins place.' A similar figure occurs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 19:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : 'Ye have seen, how I bare you on eagles' wings, and brought you unto myself' (so ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 63:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). All this here stands opposed to the idols of the Babylonians. They were unable to protect their people. They were themselves made captive. But God had shown the part of a father and a protector to his people in all times. He had sustained and guided them; he had never forsaken them; he had never, like the idol-gods, been compelled to leave them in the power of their enemies. From the fact that he had always, even from the infancy of their nation, thus protected them, they are called on to put their trust in him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. in contrast to what precedes: Babylon's idols, so far from bearing its people safely are themselves borne off, a burden to the laden beast; but Jehovah bears His people in safety even from the womb to old age (Isa 63:9; De 32:11; Ps 71:6, 18). God compares Himself to a nurse tenderly carrying a child; contrast Moses' language (Nu 11:12).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All the remnant of the house of Israel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " fitly so called, with respect either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. To all the tribes of Israel, ten of which were now lost and gone; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. To the state of the Jews at their return from Babylon, there being only a remnant of the two tribes which did return. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which are carried from the womb; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whom I have nourished and cared for from time to time, ever since you were a people, and carne out of Egypt, and that as affectionately and tenderly as parents bring up their own children. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hearken unto me, O house of Jacob,.... The Jews, the descendants of Jacob: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all the remnant of the house of Israel; those that remained of the ten tribes that had been carried captive long ago. These may, in a spiritual sense, design those who are Israelites indeed; the household of the God of Jacob; the chosen of God, and called; the remnant according to the election of grace: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which are borne by me from the belly, which are carried from the womb: here the Lord distinguishes himself from the idols of the Babylonians; they were laid as burdens upon beasts, and bore and carried by them; but the Lord is born and carried by none, but bears and carries his people. The allusion is to tender parents that have compassion on their children as soon as born, and take care of them, and bear them in their bosoms, and carry them in their arms; and may have respect, in the literal sense, to the infant state of the Jews, both as a church and commonwealth, when the Lord took pity on them, and care of them, and bore them as a father bears his son; and bore with their manners too, and carried them all the days of old through the wilderness to Canaan's land; see Numbers 11:12. It may be applied to the care of God in the preservation of men by his providence, especially his own people, whose God he is from their mother's belly; who takes them under his protection as soon as born, and carries them through every state of infancy, youth, manhood, and old age, and never leaves nor forsakes them; see Psalm 22:10, and with great propriety may be applied to regenerate persons, who, as soon as born again, are regarded by the Lord in a very visible, tender, and compassionate manner; he \"bears\" them in his bosom, and on his heart; he bears them in his arms; he puts his everlasting arms underneath them; he bears with them, with all their weakness and infirmities, their peevishness and frowardness; he bears them up under all their afflictions, and sustains all their burdens; he bears them through and out of all their troubles and difficulties: he \"carries\" them, in like manner, in his bosom, and in his arms; he \"carries\" them into his house, the church, which is the nursery for them, where they are nursed and fed, and have the breasts of consolation drawn out to them; he carries on the good work of grace in them; he carries them through all their trials and exercises safe to heaven and eternal happiness; for they are poor, weak, helpless creatures, like newly born babes, cannot go alone, but must be bore up and carried. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "which are borne by me from the belly, which are carried from the womb: here the Lord distinguishes himself from the idols of the Babylonians; they were laid as burdens upon beasts, and bore and carried by them; but the Lord is born and carried by none, but bears and carries his people. The allusion is to tender parents that have compassion on their children as soon as born, and take care of them, and bear them in their bosoms, and carry them in their arms; and may have respect, in the literal sense, to the infant state of the Jews, both as a church and commonwealth, when the Lord took pity on them, and care of them, and bore them as a father bears his son; and bore with their manners too, and carried them all the days of old through the wilderness to Canaan's land; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It may be applied to the care of God in the preservation of men by his providence, especially his own people, whose God he is from their mother's belly; who takes them under his protection as soon as born, and carries them through every state of infancy, youth, manhood, and old age, and never leaves nor forsakes them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and with great propriety may be applied to regenerate persons, who, as soon as born again, are regarded by the Lord in a very visible, tender, and compassionate manner; he \"bears\" them in his bosom, and on his heart; he bears them in his arms; he puts his everlasting arms underneath them; he bears with them, with all their weakness and infirmities, their peevishness and frowardness; he bears them up under all their afflictions, and sustains all their burdens; he bears them through and out of all their troubles and difficulties: he \"carries\" them, in like manner, in his bosom, and in his arms; he \"carries\" them into his house, the church, which is the nursery for them, where they are nursed and fed, and have the breasts of consolation drawn out to them; he carries on the good work of grace in them; he carries them through all their trials and exercises safe to heaven and eternal happiness; for they are poor, weak, helpless creatures, like newly born babes, cannot go alone, but must be bore up and carried. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Hearken to me, O house of Jacob, and all the remnant of the house of Israel, which are {e} borne by me from the birth, which are carried from the womb:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hearken to me, O house of Jacob, and all the remnant of the house of Israel, which are ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " borne ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "by me",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from the birth, which are carried from the womb:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) He shows the difference between the idols and the true God; for they must be carried by others, but God himself carries his, as in De 32:11.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all the remnant of the house of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It is doubtful whether there is a reference here to the scattered survivors of the Ten Tribes. More probably, the clause is a rhetorical variation of the previous “house of Jacob.” The participles ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "borne",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "carried",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are repeated from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 46:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 46:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", although in inverse order (“carried things” and “made a load”). The words “by me” are better omitted.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3, 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the scene which he has just described the prophet sees an emblem of the inherent weakness of heathenism. There man carries his gods, and the result is that gods and worshippers are involved in common ruin. Israel has had a far different experience of its relation to its God, having known Jehovah as One who has carried it from the beginning of its history (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is able to bear it on to final salvation. The profound insight into the nature of religion which is characteristic of the writer is nowhere more clearly exhibited than in this striking and original contrast.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 3-8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - AN ADMONITION TO ISRAEL. Israel should learn from the fate of the Babylonian idols to trust in Jehovah, who can and will deliver them, rather than in gods of gold and silver, which can give no aid, either to themselves or others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "All the remnant of the house of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The address is not to those who had remained faithful of the ten tribes (as  Delitzsch supposes), but to the captives of Babylon, designated in these later chapters indifferently as \"Jacob\" or \"Israel\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:8, 14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:1, 28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:1, 21, 23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), never as \"Judah,\" and constantly mentioned as a \"remnant\"  - all that was left of the oppressed and down-trodden nation (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:20-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". etc.). Borne by me. Carried in the everlasting arms, as a child in the arms of its nurse or mother (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 63:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "From the belly...  from the womb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From the very beginning of the national existence. Isaiah 46:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "From this approaching reduction of the gods of Babylon to their original nothingness, several admonitions are now derived. The first admonition is addressed to all Israel. \"Hearken unto me, O house of Jacob, and all the remnant of the house of Israel: ye, lifted up from the womb; ye, carried from the mother's lap! And till old age it is I, and to grey hair I shall bear you on my shoulder: I have done it, and I shall carry; and I put upon my shoulder, and deliver. To whom can ye compare me, and liken, and place side by side, that we should be equal?\" The house of Jacob is Judah here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see Caspari on the passage), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the house of Israel the same as the house of Joseph in Obadiah; whereas in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Jacob stands for Israel, in distinction from Judah. The Assyrian exile was earlier than the Babylonian, and had already naturalized the greater part of the exiles in a heathen land, and robbed them of their natural character, so that there was only a remnant left by whom there was any hope that the prophet's message would be received. What the exiles of both houses were to hear was the question in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which called upon them to consider the incomparable nature of their God, as deduced from what Jehovah could say of Himself in relation to all Israel, and what He does say from העמסים onwards. Babylon carried its idols, but all in vain: they were carried forth, without being able to save themselves; but Jehovah carried His people, and saved them. The expressions, \"from the womb, and from the mother's lap,\" point back to the time when the nation which had been in process of formation from the time of Abraham onwards came out of Egypt, and was born, as it were, into the light of the world. From this time forward it had lain upon Jehovah like a willingly adopted burden, and He had carried it as a nurse carries a suckling (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and an eagle its young (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the attributes of the people are carried on in direct (not relative) self-assertions on the part of Jehovah. The senectus and canities are obviously those of the people - not, however, as though it was already in a state of dotage (as Hitzig maintains, appealing erroneously to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 47:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but as denoting the future and latest periods of its history. Even till then Jehovah is He, i.e., the Absolute, and always the same (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As He has acted in the past, so will He act at all times - supporting and saving His people. Hence He could properly ask, Whom could you place by the side of me, so that we should be equal? (Vav consec. as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]