[{"num":4,"verse":"He removed the shrines on the hills, broke down the obelisks, knocked down the shameful idols of Asherah, and broke up the bronze serpent that Moses had made, because the people of Israel had begun to worship it by burning incense to it; even though, as King Hezekiah pointed out to them, it was merely a piece of bronze. "},{"num":5,"verse":"He trusted very strongly in the Lord God of Israel. In fact, none of the kings before or after him were as close to God as he was. "},{"num":6,"verse":"For he followed the Lord in everything, and carefully obeyed all of God’s commands to Moses. "},{"num":7,"verse":"So the Lord was with him and prospered everything he did. Then he rebelled against the king of Assyria and refused to pay tribute any longer. "},{"num":8,"verse":"He also conquered the Philistines as far distant as Gaza and its suburbs, destroying cities both large and small."},{"num":9,"verse":"It was during the fourth year of his reign (which was the seventh year of the reign of King Hoshea in Israel) that King Shalmaneser of Assyria attacked Israel and began a siege on the city of Samaria. "},{"num":10,"verse":"Three years later (during the sixth year of the reign of King Hezekiah and the ninth year of the reign of King Hoshea of Israel) Samaria fell. "},{"num":11,"verse":"It was at that time that the king of Assyria transported the Israelis to Assyria and put them in colonies in the city of Halath and along the banks of the Habor River in Gozan, and in the cities of the Medes. "},{"num":12,"verse":"For they had refused to listen to the Lord their God or to do what he wanted them to do. Instead, they had transgressed his covenant and disobeyed all the laws given to them by Moses the servant of the Lord."},{"num":13,"verse":"Later, during the fourteenth year of the reign of King Hezekiah, King Sennacherib of Assyria besieged and captured all the fortified cities of Judah. "},{"num":14,"verse":"King Hezekiah sued for peace and sent this message to the king of Assyria at Lachish: “I have done wrong. I will pay whatever tribute you demand if you will only go away.” The king of Assyria then demanded a settlement of $1,500,000. "},{"num":15,"verse":"To gather this amount, King Hezekiah used all the silver stored in the Temple and in the palace treasury. "},{"num":16,"verse":"He even stripped off the gold from the Temple doors, and from the doorposts he had overlaid with gold, and gave it all to the Assyrian king."},{"num":17,"verse":"Nevertheless the king of Assyria sent his field marshal, his chief treasurer, and his chief of staff from Lachish with a great army; and they camped along the highway beside the field where cloth was bleached, near the conduit of the upper pool. "},{"num":18,"verse":"They demanded that King Hezekiah come out to speak to them, but instead he sent a truce delegation of the following men: Eliakim, his business manager; Shebnah, his secretary; and Joah, his royal historian."},{"num":19,"verse":"Then the Assyrian general sent this message to King Hezekiah: “The great king of Assyria says, ‘No one can save you from my power! "},{"num":20,"verse":"You need more than mere promises of help before rebelling against me. But which of your allies will give you more than words? Egypt? If you lean on Egypt, you will find her to be a stick that breaks beneath your weight and pierces your hand. The Egyptian Pharaoh is totally unreliable! "},{"num":22,"verse":"And if you say, “We’re trusting the Lord to rescue us”—just remember that he is the very one whose hilltop altars you’ve destroyed. For you require everyone to worship at the altar in Jerusalem!’ "},{"num":23,"verse":"I’ll tell you what: Make a bet with my master, the king of Assyria! If you have two thousand men left who can ride horses, we’ll furnish the horses! "},{"num":24,"verse":"And with an army as small as yours, you are no threat to even the least lieutenant in charge of the smallest contingent in my master’s army. Even if Egypt supplies you with horses and chariots, it will do no good. "},{"num":25,"verse":"And do you think we have come here on our own? No! The Lord sent us and told us, ‘Go and destroy this nation!’”"},{"num":26,"verse":"Then Eliakim, Shebnah, and Joah said to them, “Please speak in Aramaic, for we understand it. Don’t use Hebrew, for the people standing on the walls will hear you.”"},{"num":27,"verse":"But the Assyrian general replied, “Has my master sent me to speak only to you and to your master? Hasn’t he sent me to the people on the walls too? For they are doomed with you to eat their own excrement and drink their own urine!”"},{"num":28,"verse":"Then the Assyrian ambassador shouted in Hebrew to the people on the wall, “Listen to the great king of Assyria! "},{"num":29,"verse":"‘Don’t let King Hezekiah fool you. He will never be able to save you from my power. "},{"num":30,"verse":"Don’t let him fool you into trusting in the Lord to rescue you. "},{"num":31,"verse":"Don’t listen to King Hezekiah. Surrender! You can live in peace here in your own land until I take you to another land just like this one—with plentiful crops, grain, grapes, olive trees, and honey. All of this instead of death! Don’t listen to King Hezekiah when he tries to persuade you that the Lord will deliver you. "},{"num":33,"verse":"Have any of the gods of the other nations ever delivered their people from the king of Assyria? "},{"num":34,"verse":"What happened to the gods of Hamath, Arpad, Sepharvaim, Hena, and Ivvah? Did they rescue Samaria? "},{"num":35,"verse":"What god has ever been able to save any nation from my power? So what makes you think the Lord can save Jerusalem?’”"},{"num":36,"verse":"But the people on the wall remained silent, for the king had instructed them to say nothing. "},{"num":37,"verse":"Then Eliakim (son of Hilkiah) the business manager, and Shebnah the king’s secretary, and Joah (son of Asaph) the historian went to King Hezekiah with their clothes torn and told him what the Assyrian general had said."}]