[{"num":45,"verse":"At last Yosef could no longer control his feelings in front of his attendants and cried, “Get everybody away from me!” So no one else was with him when Yosef revealed to his brothers who he was. "},{"num":2,"verse":"He wept aloud, and the Egyptians heard, and Pharaoh’s household heard. "},{"num":3,"verse":"Yosef said to his brothers, “I am Yosef! Is it true that my father is still alive?” His brothers couldn’t answer him, they were so dumbfounded at seeing him. "},{"num":4,"verse":"Yosef said to his brothers, “Please! Come closer.” And they came closer. He said, “I am Yosef, your brother, whom you sold into Egypt. "},{"num":5,"verse":"But don’t be sad that you sold me into slavery here or angry at yourselves, because it was God who sent me ahead of you to preserve life. "},{"num":6,"verse":"The famine has been over the land for the last two years, and for yet another five years there will be neither plowing nor harvest. "},{"num":7,"verse":"God sent me ahead of you to ensure that you will have descendants on earth and to save your lives in a great deliverance. "},{"num":8,"verse":"(iii) So it was not you who sent me here, but God; and he has made me a father to Pharaoh, lord of all his household and ruler over the whole land of Egypt. "},{"num":9,"verse":"Hurry, go up to my father, and tell him, ‘Here is what your son Yosef says: “God has made me lord of all Egypt! Come down to me, don’t delay! "},{"num":10,"verse":"You will live in the land of Goshen and be near me — you, your children, your grandchildren, flocks, herds, everything you own. "},{"num":11,"verse":"I will provide for you there, so that you won’t become poverty-stricken, you, your household and all that you have; because five years of famine are yet to come.”’ "},{"num":12,"verse":"Here! Your own eyes see, and the eyes of my brother Binyamin, that it is my own mouth speaking to you. "},{"num":13,"verse":"Tell my father how honored I am in Egypt and everything you have seen, and quickly bring my father down here!” "},{"num":14,"verse":"Then he embraced his brother Binyamin and wept, and Binyamin wept on his neck, "},{"num":15,"verse":"and he kissed all his brothers and wept on them. After that, his brothers talked with him."},{"num":16,"verse":"The report of this reached Pharaoh’s house: “Yosef’s brothers have come”; and Pharaoh and his servants were pleased. "},{"num":17,"verse":"Pharaoh said to Yosef, “Tell your brothers, ‘Here is what you are to do. Load up your animals, go to the land of Kena‘an, "},{"num":18,"verse":"take your father and your families, and come back to me. I will give you good property in Egypt, and you will eat the fat of the land."},{"num":19,"verse":"(iv) “‘Moreover — and this is an order — do this: take wagons from the land of Egypt to carry your little ones and your wives, and bring your father, and come. "},{"num":20,"verse":"Don’t worry about your stuff, because everything good in the land of Egypt is yours.’”"},{"num":21,"verse":"The sons of Isra’el acted accordingly; and Yosef gave them wagons, as Pharaoh had ordered, and gave them provisions for their journey. "},{"num":22,"verse":"To each of them he gave a set of new clothes; but to Binyamin he gave seven-and-a-half pounds of silver and five sets of new clothes. "},{"num":23,"verse":"Likewise, to his father he sent ten donkeys loaded with the finest goods Egypt produced, as well as ten female donkeys loaded with grain, bread and food for his father to eat on the return journey. "},{"num":24,"verse":"Thus he sent his brothers on their way, and they left; he said to them, “Don’t quarrel among yourselves while you’re traveling!”"},{"num":25,"verse":"So they went up out of Egypt, entered the land of Kena‘an and came to Ya‘akov their father. "},{"num":26,"verse":"They told him, “Yosef is still alive! He is ruler over the whole land of Egypt!” He was stunned at the news; he couldn’t believe them. "},{"num":27,"verse":"So they reported to him everything Yosef had said to them; but it was only when he saw the wagons which Yosef had sent to carry him that the spirit of Ya‘akov their father began to revive. "},{"num":28,"verse":"(v) Isra’el said, “Enough! My son Yosef is still alive! I must go and see him before I die.”"}]