[{"header":"Joseph Reveals Himself"},{"num":45,"verse":"At this point, Joseph could not control his emotions any longer, so he cried out to everyone who was standing nearby, “Everybody! Leave me!” As a result, none of his staff was anywhere near him when he revealed himself to his brothers. "},{"num":2,"verse":"He cried so loudly that the Egyptians heard him, including Pharaoh’s household."},{"num":3,"verse":"Joseph blurted out, “I’m Joseph! Is my father really alive?” But his brothers could not answer him, because they had become terrified to be in his presence."},{"num":4,"verse":"Joseph implored his brothers, “Please come close to me.” So they did."},{"num":5,"verse":"“But don’t be distressed or angry at yourselves because you sold me here, because God sent me ahead of you all in order to deliver us. "},{"num":6,"verse":"That’s because this famine has been going on for two years now in this region, and there are still five years left, during which there won’t be any plowing or harvesting. "},{"num":7,"verse":"God sent me ahead of you to keep you alive on the earth, and to save you all in a magnificent way. "},{"num":8,"verse":"As a result, it wasn’t you who sent me here, but God himself! He established me as a father-figure to Pharaoh himself! I’m in charge of his entire palace and ruler over the entire land of Egypt. "},{"num":9,"verse":"So hurry up, go back to my father, and tell him that his son Joseph tells him, ‘God has made me master of all of Egypt. Hurry up! Come live with me!’ "},{"num":10,"verse":"You are to live in the land of Goshen, near where I am—you, your children, your grandchildren, your flocks, your herds, and everything that you own. "},{"num":11,"verse":"I’ll provide for you there, since there are still five years of famine left to go, and you, your households, and everything you own would have otherwise become impoverished."},{"num":12,"verse":"“Look, now! All of you can see me! And my own brother Benjamin can tell that it’s really me speaking to you! "},{"num":13,"verse":"So go tell my father about all of my splendor in Egypt. Tell him about everything that you’ve seen. Be quick about it, and bring my father down here!”"},{"num":14,"verse":"Then he threw his arms around Benjamin and wept as they embraced. "},{"num":15,"verse":"He kissed all of his brothers and wept with them, too, and then his brothers were able to talk with him."},{"header":"Pharaoh is Pleased"},{"num":16,"verse":"As soon as the news reached Pharaoh’s palace that Joseph’s brothers had arrived, Pharaoh and his servants were ecstatic. "},{"num":17,"verse":"Pharaoh told Joseph, “Be sure to tell your brothers, ‘Do this: load up your livestock, go back to the land of Canaan, "},{"num":18,"verse":"get your father and your households, and come back to me. I’ll give you the best of the land of Egypt and you can live off the abundance of the land.’ "},{"num":19,"verse":"In addition,” Pharaoh ordered, “Do this: take some transport wagons from the land of Egypt for your little ones to ride in, along with your wives, and bring your father and come! "},{"num":20,"verse":"Don’t worry about your household goods, because the best of all the land of Egypt is yours.”"},{"header":"Joseph’s Brothers Go Back Home"},{"num":21,"verse":"So Israel’s sons did what they were asked to do, and Joseph provided wagons for them, as Pharaoh had commanded. He also gave them provisions for the journey. "},{"num":22,"verse":"He gave each of them some changes of clothes, but he also gave Benjamin 300 pieces of silver and five changes of clothes. "},{"num":23,"verse":"He sent his father ten male donkeys loaded with the best of Egyptian goods and ten female donkeys loaded with grain, bread, and provisions for his father during the journey. "},{"num":24,"verse":"Then Joseph sent his brothers away, and they left for home. As they were leaving, Joseph admonished them, “Don’t quarrel on the way back!”"},{"num":25,"verse":"So Joseph’s brothers left Egypt and returned to the land of Canaan and to their father Jacob, "},{"num":26,"verse":"where they informed their father, “Joseph is still alive! As a matter of fact, he’s ruling the entire land of Egypt.” But Jacob didn’t believe them, because he had become cynical. "},{"num":27,"verse":"However, as soon as his sons had told him everything Joseph had said, and after he saw the wagons that Joseph had sent along to carry him, their father Jacob’s spirit was encouraged."},{"num":28,"verse":"“It’s enough,” Israel replied. “My son Joseph is still alive. I’m going to go see him before I die!”"}]