[{"num":45,"verse":"Joseph might no longer abstain himself, while many men stood there before him; wherefore he commanded that all men should go out, and that none alien were present in the knowing of Joseph and his brethren. (Joseph could no longer restrain himself, with so many men standing there before him; and so he commanded that all the men go out, so that no stranger was present when Joseph made himself known to his brothers.)"},{"num":2,"verse":"And Joseph raised up his voice with weeping, which the Egyptians heard, and all the house(hold) of Pharaoh."},{"num":3,"verse":"And he said to his brethren, I am Joseph; liveth my father yet? (yet liveth my father?) His brethren might not answer, and were aghast with full much dread."},{"num":4,"verse":"To whom Joseph said meekly, Cometh nigh to me (To whom Joseph meekly said, Come near to me). And when they had nighed nigh, he said, I am Joseph your brother, whom ye sold into Egypt;"},{"num":5,"verse":"do not ye dread, neither seem it to be hard to you, that ye sold me into these countries; for God hath sent me before you into Egypt for your health. (do not ye fear, nor be ye harsh with yourselves, that ye sold me into this country; for God hath sent me before you into Egypt for your salvation.)"},{"num":6,"verse":"For it is (but) two years that hunger began to be in the land, (and) yet five (more) years (shall) follow, in which men shall not be able to ear, neither reap;"},{"num":7,"verse":"and God before-sent me, that ye be kept (alive) on (the) earth, and may have meats to live. (and God sent me ahead, so that ye would be kept alive on this earth, and have food to eat/and have descendants into without end.)"},{"num":8,"verse":"I was sent hither not by your counsel, but by God’s will, which hath made me as the father of Pharaoh, and lord of all his house, and prince in all the land of Egypt. (I was sent here not by your deeds, but by God’s will, who hath made me like a father to Pharaoh, and the lord of all his household, and the ruler in all the land of Egypt.)"},{"num":9,"verse":"Haste ye, and goeth up to my father, and ye shall say to him, Thy son Joseph sendeth these things to thee; God hath made me lord of all the land of Egypt; come down (here) to me, and tarry not,"},{"num":10,"verse":"and (then) dwell in the land of Goshen; and thou shalt be beside me, thou, and thy sons, and the sons of thy sons, (and) thy sheep, and thy great beasts, and all things which thou wieldest (and all the things which thou possessest),"},{"num":11,"verse":"and there I shall feed thee; for yet five years of hunger be left, lest both thou perish, and thine house, and all things which thou wieldest. (and I shall feed thee there; for there be five more years of famine to come, and lest thou, and thy household, or thy family, and all the things that thou possessest, perish.)"},{"num":12,"verse":"Lo! your eyes (see), and the eyes of my brother Benjamin see, that (it is) my mouth (which) speaketh to you;"},{"num":13,"verse":"tell ye to my father all my glory, and all things which ye saw in Egypt; haste ye, and bring ye him to me. (tell ye to my father about all of my glory here in Egypt, and all of the things which ye have seen; then haste ye, and bring ye him down here to me.)"},{"num":14,"verse":"And when he had embraced, and felled into the neck of Benjamin, his brother, he wept, the while also Benjamin wept in like manner on the neck of Joseph. (And he embraced his brother, and fell on Benjamin’s neck, and he wept, and Benjamin also wept in like manner upon Joseph’s neck.)"},{"num":15,"verse":"And Joseph kissed all his brethren, and wept on them all (and wept over them all); after which things they were hardy to speak to him."},{"num":16,"verse":"And it was heard, and published by famous word in the king’s hall, (saying,) The brethren of Joseph be come. And Pharaoh joyed, and all his house (And Pharaoh and all of his household were glad);"},{"num":17,"verse":"and Pharaoh said to Joseph, that he should command his brethren, and say to them, Charge ye your beasts, and go ye into the land of Canaan, (and Pharaoh said to Joseph, Say to your brothers, Load ye up your beasts, and go to the land of Canaan,)"},{"num":18,"verse":"and take ye from thence your father, and your kindred, and come ye (back) to me; and I shall give you all the goods of Egypt, that ye eat the marrow of the land (and I shall give to you all the good things of Egypt, and ye shall eat the marrow of the land)."},{"num":19,"verse":"Command thou also, that they take wains (out) of the land of Egypt to the carriage of their little children, and wives, and say thou, Take ye your father, and haste ye (in) coming soon, (Command thou also, that they take wagons from the land of Egypt for the transport of their little children, and their wives, and say thou to them, Bring ye your father here, and make ye haste in coming back soon,)"},{"num":20,"verse":"neither leave ye anything of the purtenance of your house, for all the riches of Egypt shall be yours. (nor take ye anything of your household possessions, for all the riches of Egypt shall be yours.)"},{"num":21,"verse":"The sons of Israel did as it was commanded to them; to which Joseph gave wains, by the behest of Pharaoh, and meats in the way; (And the sons of Israel did as they were commanded; and Joseph gave them wagons, by the command of Pharaoh, and food for the way;)"},{"num":22,"verse":"and he commanded two stoles to be brought forth to each (and he commanded that two stoles, or changes of clothing, be brought forth for each brother); forsooth he gave to Benjamin three hundred pieces of silver, with five (of) the best stoles;"},{"num":23,"verse":"and he sent to his father so much of silver, and of clothes, and he added to them ten male asses, that should bear of the riches of Egypt, and so many female asses, bearing wheat and loaves in the way. (and he sent his father ten male donkeys, carrying gifts of the best things of Egypt, and ten female donkeys, carrying corn, or grain, and loaves for the journey to Egypt.)"},{"num":24,"verse":"Therefore he let go his brethren, and said to them going forth, Be ye not wroth in the way. (And so he let his brothers go, and said to them as they went forth, Do not ye argue on the way.)"},{"num":25,"verse":"Which went up from Egypt, and came into the land of Canaan, to their father Jacob;"},{"num":26,"verse":"and they told to him, and said, Joseph, thy son, liveth, and he is lord in all the land of Egypt. And when this was heard, Jacob waked as of a grievous sleep; nevertheless he believed not to them. (and they told him, and said, Thy son Joseph liveth, and he is the ruler of all the land of Egypt. And when he heard this, Jacob appeared as if awakening from a grievous sleep, and he could not believe them.)"},{"num":27,"verse":"They told on the contrary to him all the order of the thing; and when Jacob had seen the wains, and all things which Joseph had sent, his spirit lived again, (But then they told him everything that Joseph had said; and when Jacob had seen the wagons, and all the things which Joseph had sent, his spirit lived again, or revived,)"},{"num":28,"verse":"and he said, It sufficeth to me, if Joseph my son liveth yet (It sufficeth for me, if my son Joseph yet liveth); I shall go and see him before that I die."}]