[{"num":10,"verse":"After Avimelekh there arose to save Isra’el Tola the son of Pu’ah, the son of Dodo, from the tribe of Yissakhar. He lived in Shamir, in the hills of Efrayim. "},{"num":2,"verse":"He judged Isra’el twenty-three years, and when he died he was buried in Shamir."},{"num":3,"verse":"After him arose Ya’ir, from Gil‘ad. He judged Isra’el twenty-two years. "},{"num":4,"verse":"He had thirty sons who rode on thirty young donkeys. They owned thirty cities which are called Havot-Ya’ir to this day; they are in the territory of Gil‘ad. "},{"num":5,"verse":"When Ya’ir died, he was buried in Kamon."},{"num":6,"verse":"Again the people of Isra’el did what was evil from Adonai’s perspective — they served the ba‘alim, the ‘ashtarot, the gods of Aram, the gods of Tzidon, the gods of Mo’av, the gods of the people of ‘Amon and the gods of the P’lishtim. They abandoned Adonai and did not serve him; "},{"num":7,"verse":"so the anger of Adonai blazed against Isra’el, and he handed them over to the P’lishtim and the people of ‘Amon. "},{"num":8,"verse":"For eighteen years, starting that year, they oppressed and persecuted all the people of Isra’el who lived beyond the Yarden, in the territory of the Emorim, in Gil‘ad. "},{"num":9,"verse":"The people of ‘Amon also crossed the Yarden to fight Y’hudah, Binyamin and the house of Efrayim; so that Isra’el was greatly distressed."},{"num":10,"verse":"Then the people of Isra’el cried to Adonai, “We have sinned against you by forsaking our God and serving the ba‘alim.” "},{"num":11,"verse":"Adonai said to the people of Isra’el, “I saved you from the Egyptians, the Emorim, the people of ‘Amon, and the P’lishtim, didn’t I? "},{"num":12,"verse":"Likewise, when the people of Tzidon, ‘Amalek and Ma‘on oppressed you, you cried out to me; and I rescued you from their power. "},{"num":13,"verse":"Yet you abandoned me and served other gods; therefore I will not rescue you any more. "},{"num":14,"verse":"Go and cry to the gods you chose; let them rescue you when you’re in trouble!” "},{"num":15,"verse":"The people of Isra’el said to Adonai, “We have sinned! Treat us in whatever way seems good to you, but save us today, please!” "},{"num":16,"verse":"They got rid of their foreign gods and served Adonai, and he became troubled by Isra’el’s misery."},{"num":17,"verse":"Then the people of ‘Amon gathered together and set up camp in Gil‘ad, while the people of Isra’el assembled and camped at Mitzpah. "},{"num":18,"verse":"The people, the chiefs of Gil‘ad, said to each other, “Whoever leads the battle against the army of ‘Amon will be head over everyone living in Gil‘ad.”"}]