[{"num":1,"verse":"Bezalel and Oholiab must do the work just as the Lord has commanded. So must every skilled worker to whom the Lord has given skill and ability. They know how to do all the work for every purpose connected with the sacred tent. And that includes setting it up.”"},{"num":2,"verse":"Then Moses sent for Bezalel and Oholiab. He sent for every skilled worker to whom the Lord had given ability and who wanted to come and do the work. "},{"num":3,"verse":"They received from Moses all the offerings the people of Israel had brought. They had brought the offerings for all the work for every purpose connected with the holy tent. That included setting it up. The people kept bringing the offerings they chose to give. They brought them morning after morning. "},{"num":4,"verse":"So all the skilled workers working on the holy tent stopped what they were doing. "},{"num":5,"verse":"They said to Moses, “The Lord commanded us to do the work. And the people are bringing more than enough for us to do it.”"},{"num":6,"verse":"Then Moses gave an order. A message was sent through the whole camp. It said, “No man or woman should make anything else and offer it for the holy tent.” And so the people were kept from bringing more offerings. "},{"num":7,"verse":"There was already more than enough to do all the work."},{"header":"The Holy Tent"},{"num":8,"verse":"All the skilled workers made the holy tent. They made ten curtains out of finely twisted linen. They made them with blue, purple and bright red yarn. A skilled worker sewed cherubim into the pattern. "},{"num":9,"verse":"All the curtains were the same size. They were 42 feet long and six feet wide. "},{"num":10,"verse":"The workers joined five of the curtains together. They did the same thing with the other five. "},{"num":11,"verse":"Then they made loops out of blue strips of cloth along the edge of the end curtain in one set. They did the same thing with the end curtain in the other set. "},{"num":12,"verse":"They also made 50 loops on the end curtain of the one set. They did the same thing on the end curtain of the other set. They put the loops across from each other. "},{"num":13,"verse":"Then they made 50 gold hooks. They used them to join the two sets of curtains together so that the holy tent was all one piece."},{"num":14,"verse":"The workers made a total of 11 curtains out of goat hair to put over the holy tent. "},{"num":15,"verse":"All 11 curtains were the same size. They were 45 feet long and six feet wide. "},{"num":16,"verse":"The workers joined five of the curtains together into one set. They did the same thing with the other six. "},{"num":17,"verse":"Then they made 50 loops along the edge of the end curtain in the one set. They did the same thing with the other set. "},{"num":18,"verse":"They made 50 bronze hooks. They used them to join the tent together all in one piece. "},{"num":19,"verse":"They made a covering for the tent. They made it out of ram skins dyed red. Over that, they put a covering of another kind of strong leather."},{"num":20,"verse":"The workers made frames out of acacia wood for the holy tent. "},{"num":21,"verse":"Each frame was about 15 feet long and two feet three inches wide. "},{"num":22,"verse":"The workers added two small wooden pins to each frame. The pins stuck out so that they were even with each other. The workers made all the frames of the holy tent in the same way. "},{"num":23,"verse":"The workers made 20 frames for the south side of the holy tent. "},{"num":24,"verse":"And they made 40 silver bases to go under them. They made two bases for each frame. They put one under each pin that stuck out. "},{"num":25,"verse":"For the north side of the holy tent they made 20 frames "},{"num":26,"verse":"and 40 silver bases. They put two bases under each frame. "},{"num":27,"verse":"The workers made six frames for the west end of the holy tent. "},{"num":28,"verse":"They made two frames for the corners of the holy tent at the far end. "},{"num":29,"verse":"At those two corners the frames were double from top to bottom. They were fitted into a single ring. The workers made both of them the same. "},{"num":30,"verse":"So there were eight frames and 16 silver bases. There were two bases under each frame."},{"num":31,"verse":"The workers also made crossbars out of acacia wood. They made five for the frames on one side of the holy tent. "},{"num":32,"verse":"They made five for the frames on the other side. And they made five for the frames on the west, at the far end of the holy tent. "},{"num":33,"verse":"The center crossbar reached from end to end at the middle of the frames. "},{"num":34,"verse":"The workers covered the frames with gold. They made gold rings to hold the crossbars. They also covered the crossbars with gold."},{"num":35,"verse":"They made the curtain out of blue, purple and bright red yarn and finely twisted linen. A skilled worker sewed cherubim into the pattern. "},{"num":36,"verse":"The workers made four posts out of acacia wood for the curtain. They covered the posts with gold. They made gold hooks and four silver bases for the posts. "},{"num":37,"verse":"For the entrance to the tent the workers made a curtain. They made it out of blue, purple and bright red yarn and finely twisted linen. A person who sewed skillfully made it. "},{"num":38,"verse":"The workers made five posts with hooks for the curtains. They covered the tops of the posts and their bands with gold. And they made five bronze bases for them."}]