[{"num":36,"verse":"Bezalel and Oholiab and every skillful one to whom the Lord has given skill and understanding to know how to do any work in the construction of the sanctuary shall work in accordance with all that the Lord has commanded."},{"num":2,"verse":"Moses then called Bezalel and Oholiab and every skillful one to whom the Lord had given skill, everyone whose heart was stirred to come to do the work; "},{"num":3,"verse":"and they received from Moses all the freewill offerings that the Israelites had brought for doing the work on the sanctuary. They still kept bringing him freewill offerings every morning, "},{"num":4,"verse":"so that all the artisans who were doing every sort of task on the sanctuary came, each from the task being performed, "},{"num":5,"verse":"and said to Moses, “The people are bringing much more than enough for doing the work that the Lord has commanded us to do.” "},{"num":6,"verse":"So Moses gave command, and word was proclaimed throughout the camp: “No man or woman is to make anything else as an offering for the sanctuary.” So the people were restrained from bringing; "},{"num":7,"verse":"for what they had already brought was more than enough to do all the work."},{"header":"Construction of the Tabernacle"},{"num":8,"verse":"All those with skill among the workers made the tabernacle with ten curtains; they were made of fine twisted linen, and blue, purple, and crimson yarns, with cherubim skillfully worked into them. "},{"num":9,"verse":"The length of each curtain was twenty-eight cubits, and the width of each curtain four cubits; all the curtains were of the same size."},{"num":10,"verse":"He joined five curtains to one another, and the other five curtains he joined to one another. "},{"num":11,"verse":"He made loops of blue on the edge of the outermost curtain of the first set; likewise he made them on the edge of the outermost curtain of the second set; "},{"num":12,"verse":"he made fifty loops on the one curtain, and he made fifty loops on the edge of the curtain that was in the second set; the loops were opposite one another. "},{"num":13,"verse":"And he made fifty clasps of gold, and joined the curtains one to the other with clasps; so the tabernacle was one whole."},{"num":14,"verse":"He also made curtains of goats’ hair for a tent over the tabernacle; he made eleven curtains. "},{"num":15,"verse":"The length of each curtain was thirty cubits, and the width of each curtain four cubits; the eleven curtains were of the same size. "},{"num":16,"verse":"He joined five curtains by themselves, and six curtains by themselves. "},{"num":17,"verse":"He made fifty loops on the edge of the outermost curtain of the one set, and fifty loops on the edge of the other connecting curtain. "},{"num":18,"verse":"He made fifty clasps of bronze to join the tent together so that it might be one whole. "},{"num":19,"verse":"And he made for the tent a covering of tanned rams’ skins and an outer covering of fine leather."},{"num":20,"verse":"Then he made the upright frames for the tabernacle of acacia wood. "},{"num":21,"verse":"Ten cubits was the length of a frame, and a cubit and a half the width of each frame. "},{"num":22,"verse":"Each frame had two pegs for fitting together; he did this for all the frames of the tabernacle. "},{"num":23,"verse":"The frames for the tabernacle he made in this way: twenty frames for the south side; "},{"num":24,"verse":"and he made forty bases of silver under the twenty frames, two bases under the first frame for its two pegs, and two bases under the next frame for its two pegs. "},{"num":25,"verse":"For the second side of the tabernacle, on the north side, he made twenty frames "},{"num":26,"verse":"and their forty bases of silver, two bases under the first frame and two bases under the next frame. "},{"num":27,"verse":"For the rear of the tabernacle westward he made six frames. "},{"num":28,"verse":"He made two frames for corners of the tabernacle in the rear. "},{"num":29,"verse":"They were separate beneath, but joined at the top, at the first ring; he made two of them in this way, for the two corners. "},{"num":30,"verse":"There were eight frames with their bases of silver: sixteen bases, under every frame two bases."},{"num":31,"verse":"He made bars of acacia wood, five for the frames of the one side of the tabernacle, "},{"num":32,"verse":"and five bars for the frames of the other side of the tabernacle, and five bars for the frames of the tabernacle at the rear westward. "},{"num":33,"verse":"He made the middle bar to pass through from end to end halfway up the frames. "},{"num":34,"verse":"And he overlaid the frames with gold, and made rings of gold for them to hold the bars, and overlaid the bars with gold."},{"num":35,"verse":"He made the curtain of blue, purple, and crimson yarns, and fine twisted linen, with cherubim skillfully worked into it. "},{"num":36,"verse":"For it he made four pillars of acacia, and overlaid them with gold; their hooks were of gold, and he cast for them four bases of silver. "},{"num":37,"verse":"He also made a screen for the entrance to the tent, of blue, purple, and crimson yarns, and fine twisted linen, embroidered with needlework; "},{"num":38,"verse":"and its five pillars with their hooks. He overlaid their capitals and their bases with gold, but their five bases were of bronze."}]