[{"header":"Wisdom and Folly Contrasted"},{"num":15,"verse":"I have seen everything during my [fleeting] days of futility; there is a righteous man who perishes in [spite of] his righteousness, and there is a wicked man who lives a long life in [spite of] his wickedness. "},{"num":16,"verse":"Do not be excessively righteous [like those given to self-conceit], and do not be overly wise (pretentious)—why should you bring yourself to ruin? "},{"num":17,"verse":"Do not be excessively or willfully wicked and do not be a fool. Why should you die before your time? "},{"num":18,"verse":"It is good that you take hold of one thing (righteousness) and also not let go of the other (wisdom); for the one who fears and worships God [with awe-filled reverence] will come forth with both of them."},{"num":19,"verse":"Wisdom strengthens the wise man more than ten rulers who are in a city. "},{"num":20,"verse":"Indeed, there is not a righteous man on earth who always does good and who never sins. "},{"num":21,"verse":"Also, do not take seriously everything that is said, so that you will not hear your servant cursing you, "},{"num":22,"verse":"for you also know that you too have cursed others many times."},{"num":23,"verse":"I have tested all this with wisdom. I said, “I will be wise [independently of God],” but true wisdom was far from me. "},{"num":24,"verse":"Whatever has been is far off, deeply remote and exceedingly mysterious. Who can discover it [for it is beyond the grasp of man]? "},{"num":25,"verse":"I turned around and directed my heart to know, to investigate and to seek [skillful and godly] wisdom and the reason for things, and to know that wickedness is folly and that foolishness is madness [leading to stupidity and recklessness]. "},{"num":26,"verse":"And I discovered that [of all irrational sins none has been so destructive in beguiling one away from God as immoral women for] more bitter than death is the woman whose heart is [composed of] snares and nets, and whose hands are chains. Whoever pleases God will escape from her, but the sinner will be taken captive by her [evil]."},{"num":27,"verse":"“Behold, I have discovered this,” says the Preacher, “while adding one thing to another to find an explanation, "},{"num":28,"verse":"which I am still seeking but have not found. I have found one man among a thousand [who pleases God], but I have not found [such] a woman among all these [a thousand in my harem]. "},{"num":29,"verse":"Behold, I have found only this [as a reason]: God made man upright and uncorrupted, but they [both men and women] have sought out many devices [for evil].”"}]