[{"header":"A Disillusioned View of Life"},{"num":14,"verse":"In the day of prosperity be joyful, and in the day of adversity consider; God has made the one as well as the other, so that man may not find out anything that will be after him."},{"header":"The Riddles of Life"},{"num":15,"verse":"In my vain life I have seen everything; there is a righteous man who perishes in his righteousness, and there is a wicked man who prolongs his life in his evil-doing. "},{"num":16,"verse":"Be not righteous overmuch, and do not make yourself overwise; why should you destroy yourself? "},{"num":17,"verse":"Be not wicked overmuch, neither be a fool; why should you die before your time? "},{"num":18,"verse":"It is good that you should take hold of this, and from that withhold not your hand; for he who fears God shall come forth from them all."},{"num":19,"verse":"Wisdom gives strength to the wise man more than ten rulers that are in a city."},{"num":20,"verse":"Surely there is not a righteous man on earth who does good and never sins."},{"num":21,"verse":"Do not give heed to all the things that men say, lest you hear your servant cursing you; "},{"num":22,"verse":"your heart knows that many times you have yourself cursed others."},{"num":23,"verse":"All this I have tested by wisdom; I said, “I will be wise”; but it was far from me. "},{"num":24,"verse":"That which is, is far off, and deep, very deep; who can find it out? "},{"num":25,"verse":"I turned my mind to know and to search out and to seek wisdom and the sum of things, and to know the wickedness of folly and the foolishness which is madness. "},{"num":26,"verse":"And I found more bitter than death the woman whose heart is snares and nets, and whose hands are fetters; he who pleases God escapes her, but the sinner is taken by her. "},{"num":27,"verse":"Behold, this is what I found, says the Preacher, adding one thing to another to find the sum, "},{"num":28,"verse":"which my mind has sought repeatedly, but I have not found. One man among a thousand I found, but a woman among all these I have not found. "},{"num":29,"verse":"Behold, this alone I found, that God made man upright, but they have sought out many devices."}]