[{"header":"News That Jesus Has Risen From Death(A)"},{"num":16,"verse":"The next day after the Sabbath day, Mary Magdalene, Salome, and Mary the mother of James bought some sweet-smelling spices to put on Jesus’ body."},{"num":2,"verse":"Very early on that day, the first day of the week, the women were going to the tomb. It was very early after sunrise."},{"num":3,"verse":"The women said to each other, “There is a large stone covering the entrance of the tomb. Who will move the stone for us?”"},{"num":4,"verse":"Then the women looked and saw that the stone was moved. The stone was very large, but it was moved away from the entrance."},{"num":5,"verse":"The women walked into the tomb and saw a young man there wearing a white robe. He was sitting on the right side of the tomb. The women were afraid."},{"num":6,"verse":"But the man said, “Don’t be afraid. You are looking for Jesus from Nazareth, the one who was killed on a cross. He has risen from death! He is not here. Look, here is the place they put him when he was dead."},{"num":7,"verse":"Now go and tell his followers. And be sure to tell Peter. Tell them, ‘Jesus is going into Galilee and will be there before you come. You will see him there, as he told you before.’”"},{"num":8,"verse":"The women were very afraid and confused. They left the tomb and ran away. They did not tell about what happened, because they were afraid."},{"header":"Some Followers See Jesus(B)"},{"num":9,"verse":"Jesus rose from death early on the first day of the week. He appeared first to Mary Magdalene. One time in the past Jesus had forced seven demons out of Mary."},{"num":10,"verse":"After Mary saw Jesus, she went and told his followers. They were very sad and were crying."},{"num":11,"verse":"But Mary told them that Jesus was alive. She said that she had seen Jesus, but they did not believe her."},{"num":12,"verse":"Later, Jesus appeared to two followers while they were walking in the country. But Jesus did not look the same as before he was killed."},{"num":13,"verse":"These followers went back to the other followers and told them what happened. Again, the followers did not believe them."},{"header":"Jesus Talks to His Followers(C)"},{"num":14,"verse":"Later, Jesus appeared to the eleven followers while they were eating. He criticized them because they had so little faith. They were stubborn and refused to believe the people who said Jesus had risen from death."},{"num":15,"verse":"He said to them, “Go everywhere in the world. Tell the Good News to everyone."},{"num":16,"verse":"Whoever believes and is baptized will be saved. But those who do not believe will be judged guilty."},{"num":17,"verse":"And the people who believe will be able to do these things as proof: They will use my name to force demons out of people. They will speak in languages they never learned."},{"num":18,"verse":"If they pick up snakes or drink any poison, they will not be hurt. They will lay their hands on sick people, and they will get well.”"},{"header":"Jesus Goes Back to Heaven(D)"},{"num":19,"verse":"After the Lord Jesus said these things to his followers, he was carried up into heaven. There, Jesus sat at the right side of God."},{"num":20,"verse":"The followers went everywhere in the world telling people the Good News, and the Lord helped them. By giving them power to do miracles the Lord proved that their message was true."}]