[{"header":"Jesus Rises from the Dead(A)"},{"num":16,"verse":"The day after the Sabbath day, Mary Magdalene, Mary the mother of James, and Salome bought some sweet-smelling spices to ·put on [anoint] Jesus’ body. "},{"num":2,"verse":"Very early on that day, the first day of the week, soon after sunrise, the women were on their way to the tomb. "},{"num":3,"verse":"They said to each other, “Who will roll away for us the stone that covers the entrance of the tomb?”"},{"num":4,"verse":"Then the women looked and saw that the stone had already been rolled away, even though it was very large. "},{"num":5,"verse":"The women entered the tomb and saw a young man wearing a white robe and sitting on the right side, and they were ·afraid [alarmed; amazed]."},{"num":6,"verse":"But the man said, “Don’t be ·afraid [alarmed; amazed]. You are looking for Jesus from Nazareth, who has been crucified. He has risen from the dead; he is not here. Look, here is the place they laid him. "},{"num":7,"verse":"Now go and tell his ·followers [disciples] and Peter, ‘Jesus is going into Galilee ahead of you, and you will see him there as he told you before.’”"},{"num":8,"verse":"The women were shaking with fear and ·confused [overwhelmed; bewildered], so they left the tomb and ran away. They did not tell anyone about what happened, because they were afraid."},{"header":"Some Followers See Jesus(B)"},{"num":9,"verse":"|After Jesus rose from the dead early on the first day of the week, he showed himself first to Mary Magdalene. One time in the past, he had ·forced [driven; cast] seven demons out of her. "},{"num":10,"verse":"After Mary saw Jesus, she went and told his followers, who were ·very sad [mourning; grieving] and were crying. "},{"num":11,"verse":"But Mary told them that Jesus was alive. She said that she had seen him, but they did not believe her."},{"num":12,"verse":"Later, Jesus showed himself to two of ·his followers [his disciples; them] while they were walking in the country, but he did not look the same as before. "},{"num":13,"verse":"They went back to the others and told them what had happened, but again, they did not believe them."},{"header":"Jesus Talks to the Disciples(C)"},{"num":14,"verse":"Later Jesus showed himself to the eleven while they were ·eating [reclining at table; see 2:15], and he ·criticized [reprimanded; rebuked] them because they had no faith. They were ·stubborn [hard hearted] and refused to believe those who had seen him after he had risen from the dead."},{"num":15,"verse":"Jesus said to them, “Go everywhere in the world, and ·tell [preach; proclaim] the ·Good News [Gospel] to ·everyone [all creation]. "},{"num":16,"verse":"Anyone who believes and is baptized will be saved, but anyone who does not believe will be ·punished [condemned]. "},{"num":17,"verse":"And those who believe will be able to do these things as ·proof [signs]: They will use my name to ·force [drive; cast] out demons. They will speak in new ·languages [tongues]. "},{"num":18,"verse":"They will pick up snakes and drink poison without being hurt. They will ·touch [lay hands on] the sick, and the sick will ·be healed [recover].”"},{"num":19,"verse":"After the Lord Jesus said these things to them, he was carried up into heaven, and he sat at the right ·side [hand] of God. "},{"num":20,"verse":"The ·followers [disciples] went everywhere in the world and ·told [preached; proclaimed] the ·Good News [Gospel] to people, and the Lord helped them. The Lord ·proved [confirmed] that the ·Good News [Gospel] they ·told [preached; proclaimed] was true by giving them power to work ·miracles [signs].|"}]