[{"header":"Jesus Rises From the Dead"},{"num":16,"verse":"The Sabbath day ended. Mary Magdalene, Mary the mother of James, and Salome bought spices. They were going to use them for Jesus’ body. "},{"num":2,"verse":"Very early on the first day of the week, they were on their way to the tomb. It was just after sunrise. "},{"num":3,"verse":"They asked each other, “Who will roll the stone away from the entrance to the tomb?”"},{"num":4,"verse":"Then they looked up and saw that the stone had been rolled away. The stone was very large. "},{"num":5,"verse":"They entered the tomb. As they did, they saw a young man dressed in a white robe. He was sitting on the right side. They were alarmed."},{"num":6,"verse":"“Don’t be alarmed,” he said. “You are looking for Jesus the Nazarene, who was crucified. But he has risen! He is not here! See the place where they had put him. "},{"num":7,"verse":"Go! Tell his disciples and Peter, ‘He is going ahead of you into Galilee. There you will see him. It will be just as he told you.’ ”"},{"num":8,"verse":"The women were shaking and confused. They went out and ran away from the tomb. They said nothing to anyone, because they were afraid."},{"num":9,"verse":"Jesus rose from the dead early on the first day of the week. He appeared first to Mary Magdalene. He had driven seven demons out of her. "},{"num":10,"verse":"She went and told those who had been with him. She found them crying. They were very sad. "},{"num":11,"verse":"They heard that Jesus was alive and that she had seen him. But they did not believe it."},{"num":12,"verse":"After that, Jesus appeared in a different form to two of them. This happened while they were walking out in the country. "},{"num":13,"verse":"The two returned and told the others about it. But the others did not believe them either."},{"num":14,"verse":"Later Jesus appeared to the 11 disciples as they were eating. He spoke firmly to them because they had no faith. They would not believe those who had seen him after he rose from the dead."},{"num":15,"verse":"He said to them, “Go into all the world. Preach the good news to everyone. "},{"num":16,"verse":"Anyone who believes and is baptized will be saved. But anyone who does not believe will be punished. "},{"num":17,"verse":"Here are the miraculous signs that those who believe will do. In my name they will drive out demons. They will speak in languages they had not known before. "},{"num":18,"verse":"They will pick up snakes with their hands. And when they drink deadly poison, it will not hurt them at all. They will place their hands on sick people. And the people will get well.”"},{"num":19,"verse":"When the Lord Jesus finished speaking to them, he was taken up into heaven. He sat down at the right hand of God. "},{"num":20,"verse":"Then the disciples went out and preached everywhere. The Lord worked with them. And he backed up his word by the signs that went with it."}]