[{"header":"Jesus Is Raised from the Dead (A)"},{"num":16,"verse":"The Day of Rest was over. Mary Magdalene and Mary the mother of James, and Salome bought spices. They wanted to put the spices on Jesus’ body. "},{"num":2,"verse":"Very early in the morning on the first day of the week, they came to the grave. The sun had come up. "},{"num":3,"verse":"They said to themselves, “Who will roll the stone away from the door of the grave for us?” "},{"num":4,"verse":"But when they looked, they saw the very large stone had been rolled away."},{"num":5,"verse":"They went into the grave. There they saw a young man with a long white coat sitting on the right side. They were afraid. "},{"num":6,"verse":"He said, “Do not be afraid. You are looking for Jesus of Nazareth Who was nailed to a cross. He is risen! He is not here! See, here is the place where they laid Him. "},{"num":7,"verse":"Go and tell His followers and Peter that He is going ahead of you into Galilee. You will see Him there as He told you.” "},{"num":8,"verse":"They ran from the grave shaking and were surprised. They did not say anything to anyone because they were afraid."},{"header":"The Followers of Jesus Do Not Believe He Was Raised from the Dead (B)"},{"num":9,"verse":"(*It was early on the first day of the week when Jesus was raised from the dead. Mary Magdalene saw Him first. He had put seven demons out of her. "},{"num":10,"verse":"She went and told His followers. They were crying because of much sorrow. "},{"num":11,"verse":"But they did not believe her when she said she had seen Him alive."},{"num":12,"verse":"After that He was seen again by two of His followers as they walked into the country. He did not look like He had looked before to these two people. "},{"num":13,"verse":"They went and told it to the others. The others did not believe them."},{"num":14,"verse":"Later He was seen by the eleven followers as they were eating. He spoke to them with sharp words because they did not believe and their hearts were hard. And they did not believe the others who had seen Him since He had been raised from the dead."},{"header":"Jesus Sends His Followers to Preach (C)"},{"num":15,"verse":"He said to them, “You are to go to all the world and preach the Good News to every person. "},{"num":19,"verse":"After Jesus had talked to them, He was taken up into heaven. He sat down on the right side of God."},{"num":20,"verse":"The followers went from there and preached everywhere. The Lord worked with them. The Lord showed that the Word of God was true by the special works they had power to do.)"}]