[{"num":16,"verse":"And when the Sabbath day was past, Mary Magdalene, Mary Jacobi, and Salome bought sweet spices so that they could come and anoint him. "},{"num":2,"verse":"And early in the morning of the day after the Sabbath day, they came to the sepulchre when the sun was risen. "},{"num":3,"verse":"And they said to one another, Who will roll the stone away from the opening of the sepulchre for us? "},{"num":4,"verse":"But when they looked, they saw that the stone had been rolled away; for it was a very great one."},{"num":5,"verse":"And they went into the sepulchre, and saw a young man clothed in a long white garment sitting on the right side, and they were afraid. "},{"num":6,"verse":"But he said to them, Do not be afraid. You seek Jesus of Nazareth, who was crucified. He is risen; he is not here. Behold the place where they put him. "},{"num":7,"verse":"But go your way, and tell his disciples, and especially Peter. He will go before you into Galilee; there you will see him, as he said to you."},{"num":8,"verse":"And they went out quickly and fled from the sepulchre. For they trembled and were amazed. And they did not say anything to anyone, because they were afraid."},{"num":9,"verse":"After Jesus had risen on the day after the Sabbath day, he appeared first to Mary Magdalene, out of whom he had cast seven devils. "},{"num":10,"verse":"And she went and told those who had been with him, as they mourned and wept. "},{"num":11,"verse":"And though they heard that he was alive and he had appeared to her, yet they did not believe it."},{"num":12,"verse":"After that, he appeared to two of them as a stranger when they were walking and going into the country. "},{"num":13,"verse":"And they went and told it to the rest, but they did not believe them either."},{"num":14,"verse":"After that, he appeared to the eleven as they sat at food, and cast in their teeth their unbelief and hardness of heart, because they would not believe those who had seen him after his resurrection. "},{"num":15,"verse":"And he said to them, Go into all the world, and preach the glad tidings to all creatures. "},{"num":16,"verse":"He who believes and is baptized will be saved, but he who does not believe will be damned. "},{"num":17,"verse":"And these signs will follow those who believe: in my name they will cast out devils, and will speak with new tongues, "},{"num":18,"verse":"and will kill serpents. And if they drink any deadly thing, it will not hurt them. They will lay their hands on the sick, and they will recover."},{"num":19,"verse":"So then, when the Lord had spoken to them, he was received into heaven and sat down on the right hand of God. "},{"num":20,"verse":"And they went forth and preached everywhere. And the Lord worked with them, and confirmed the word with miracles that followed."}]