[{"header":"Early on the first Lord’s day: the women are amazed"},{"num":1,"verse":"When the Sabbath was over, Mary of Magdala, Mary the mother of James, and Salome bought spices so that they could go and anoint him. And very early in the morning on the first day of the week, they came to the tomb, just as the sun was rising."},{"num":3,"verse":"“Who is going to roll the stone back from the doorway of the tomb?” they asked each other."},{"num":4,"verse":"And then as they looked closer, they saw that the stone, which was a very large one, had been rolled back. So they went into the tomb and saw a young man in a white robe sitting on the right-hand side, and they were simply astonished. But he said to them, “There is no need to be astonished. He has risen; he is not here. Look, here is the place where they laid him. But now go and tell his disciples, and Peter, that he will be in Galilee before you. You will see him there just as he told you.”"},{"num":8,"verse":"And they got out of the tomb and ran away from it. They were trembling with excitement. They did not dare to breathe a word to anyone."},{"header":"An ancient appendix"},{"num":9,"verse":"When Jesus rose early on that first day of the week, he appeared first of all to Mary of Magdala, from whom he had driven out seven evil spirits. And she went and reported this to his sorrowing and weeping followers. They heard her say that he was alive and that she had seen him, but they did not believe it."},{"num":12,"verse":"Later, he appeared in a different form to two of them who were out walking, as they were on their way to the country. These two came back and told the others, but they did not believe them either. Still later he appeared to the eleven themselves as they were sitting at table and reproached them for their lack of faith, and reluctance to believe those who had seen him after he had risen."},{"num":15,"verse":"Then he said to them, “You must go out to the whole world and proclaim the Gospel to every creature. He who believes it and is baptised will be saved, but he who disbelieves it will be condemned. These signs will follow those who do believe: they will drive out evil spirits in my name; they will speak with new tongues; they will pick up snakes, and if they drink anything poisonous it will do them no harm; they will lay their hands upon the sick and they will recover.”"},{"header":"Jesus, his mission accomplished, returns to Heaven"},{"num":19,"verse":"After these words to them, the Lord Jesus was taken up into Heaven and was enthroned at the right hand of God. They went out and preached everywhere. The Lord worked with them, confirming their message by the signs that followed."}]