[{"num":1,"verse":"The next evening, when the Sabbath ended, Mary Magdalene and Salome and Mary the mother of James went out and purchased embalming spices."},{"num":3,"verse":"On the way they were discussing how they could ever roll aside the huge stone from the entrance."},{"num":4,"verse":"But when they arrived they looked up and saw that the stone—a very heavy one—was already moved away and the entrance was open! "},{"num":5,"verse":"So they entered the tomb—and there on the right sat a young man clothed in white. The women were startled, "},{"num":6,"verse":"but the angel said, “Don’t be so surprised. Aren’t you looking for Jesus, the Nazarene who was crucified? He isn’t here! He has come back to life! Look, that’s where his body was lying. "},{"num":7,"verse":"Now go and give this message to his disciples including Peter:"},{"num":8,"verse":"The women fled from the tomb, trembling and bewildered, too frightened to talk."},{"num":9,"verse":" It was early on Sunday morning when Jesus came back to life, and the first person who saw him was Mary Magdalene—the woman from whom he had cast out seven demons. "},{"num":10,"verse":"She found the disciples wet-eyed with grief and exclaimed that she had seen Jesus, and he was alive! But they didn’t believe her!"},{"num":12,"verse":"Later that day he appeared to two who were walking from Jerusalem into the country, but they didn’t recognize him at first because he had changed his appearance. "},{"num":13,"verse":"When they finally realized who he was, they rushed back to Jerusalem to tell the others, but no one believed them."},{"num":14,"verse":"Still later he appeared to the eleven disciples as they were eating together. He rebuked them for their unbelief—their stubborn refusal to believe those who had seen him alive from the dead."},{"num":15,"verse":"And then he told them, “You are to go into all the world and preach the Good News to everyone, everywhere. "},{"num":16,"verse":"Those who believe and are baptized will be saved. But those who refuse to believe will be condemned."},{"num":17,"verse":"“And those who believe shall use my authority to cast out demons, and they shall speak new languages. "},{"num":18,"verse":"They will be able even to handle snakes with safety, and if they drink anything poisonous, it won’t hurt them; and they will be able to place their hands on the sick and heal them.”"},{"num":19,"verse":"When the Lord Jesus had finished talking with them, he was taken up into heaven and sat down at God’s right hand."},{"num":20,"verse":"And the disciples went everywhere preaching, and the Lord was with them and confirmed what they said by the miracles that followed their messages."}]