[[],[{"type":"header","content":"Signers of the Document"},{"type":"prose","content":"Now  on the sealed document: Nehemiah the governor, the son of Hacaliah. And Zedekiah, "}],[{"type":"prose","content":"Seraiah, Azariah, Jeremiah, "}],[{"type":"prose","content":"Pashhur, Amariah, Malchijah, "}],[{"type":"prose","content":"Hattush, Shebaniah, Malluch, "}],[{"type":"prose","content":"Harim, Meremoth, Obadiah, "}],[{"type":"prose","content":"Daniel, Ginnethon, Baruch, "}],[{"type":"prose","content":"Meshullam, Abijah, Mijamin, "}],[{"type":"prose","content":"Maaziah, Bilgai, Shemaiah—these were the priests. "}],[{"type":"prose","content":"And the Levites: Jeshua the son of Azaniah, Binnui of the sons of Henadad, Kadmiel, "}],[{"type":"prose","content":"and their brothers: Shebaniah, Hodiah, Kelita, Pelaiah, Hanan, "}],[{"type":"prose","content":"Mica, Rehob, Hashabiah, "}],[{"type":"prose","content":"Zaccur, Sherebiah, Shebaniah, "}],[{"type":"prose","content":"Hodiah, Bani, Beninu. "}],[{"type":"prose","content":"The leaders of the people: Parosh, Pahath-moab, Elam, Zattu, Bani, "}],[{"type":"prose","content":"Bunni, Azgad, Bebai, "}],[{"type":"prose","content":"Adonijah, Bigvai, Adin, "}],[{"type":"prose","content":"Ater, Hezekiah, Azzur, "}],[{"type":"prose","content":"Hodiah, Hashum, Bezai, "}],[{"type":"prose","content":"Hariph, Anathoth, Nebai, "}],[{"type":"prose","content":"Magpiash, Meshullam, Hezir, "}],[{"type":"prose","content":"Meshezabel, Zadok, Jaddua, "}],[{"type":"prose","content":"Pelatiah, Hanan, Anaiah, "}],[{"type":"prose","content":"Hoshea, Hananiah, Hasshub, "}],[{"type":"prose","content":"Hallohesh, Pilha, Shobek, "}],[{"type":"prose","content":"Rehum, Hashabnah, Maaseiah, "}],[{"type":"prose","content":"Ahiah, Hanan, Anan, "}],[{"type":"prose","content":"Malluch, Harim, Baanah."},{"type":"header","content":"Obligations of the Document"}],[{"type":"prose","content":"Now the rest of the people—the priests, the Levites, the gatekeepers, the singers, the temple servants, and all those who had separated themselves from the peoples of the lands to the Law of God, their wives, their sons, their daughters, all those who had knowledge and understanding— "}],[{"type":"prose","content":"are joining with their fellow Israelites, their nobles, and are taking on themselves a curse and an oath to walk in God’s Law, which was given through Moses the servant of God, and to keep and to observe all the commandments of  our Lord, and His ordinances and statutes: "}],[{"type":"prose","content":"and that we will not give our daughters [as wives] to the peoples of the land or take their daughters for our sons. "}],[{"type":"prose","content":"As for the peoples of the land who bring merchandise or any grain on the Sabbath day to sell, we will not buy from them on the Sabbath or on a holy day; and we will give up  the seventh year [leaving the land uncultivated], and  every debt."}],[{"type":"prose","content":"Also we pledge ourselves to contribute yearly one third of a shekel for the service [expenses] of the house of our God: "}],[{"type":"prose","content":"for the showbread; for the continual grain offerings and the continual burnt offerings; [for the offerings on] the Sabbaths, the New Moons, the [feasts at] appointed times; for the holy things, for the sin offerings to make atonement for Israel; and for all the work of the house of our God."}],[{"type":"prose","content":"We have also cast lots—the priests, the Levites, and the people—for [contributing] the supply of wood, to bring it to the house of our God, according to our fathers’ households, at set times annually, to burn on the altar of the  our God, as it is written in the Law; "}],[{"type":"prose","content":"and [we obligate ourselves] to bring the first fruits of our ground and the first fruits of all the fruit of every tree to the house of the  annually, "}],[{"type":"prose","content":"as well as the firstborn of our sons and of our cattle, as is written in the Law, and the firstborn of our herds and flocks, to bring to the house of our God, for the priests who minister in the house of our God. "}],[{"type":"prose","content":"We will bring the first [and best] of our dough, our contributions, the fruit of every tree, the new wine and the [olive] oil to the priests, to the chambers of the house of our God, and the tithe of our ground to the Levites, for the Levites are the ones who receive the tithes in all the rural towns. "}],[{"type":"prose","content":"The priest, the son of Aaron, shall be with the Levites when they receive tithes, and they shall bring one-tenth of the tithes up to the house of our God, to the chambers of the storehouse. "}],[{"type":"prose","content":"For the Israelites and the sons of Levi shall bring the offering of the grain, the new wine, and the oil to the chambers; the utensils of the sanctuary, the priests who are ministering, the gatekeepers, and the singers are there. In this manner, we will not neglect the house of our God."}]]