[{"header":"Chapter 5"},{"num":1,"verse":"Cure of Naaman. There was a certain Naaman, who was the commander of the army of the king of Aram. He was an honorable man, highly esteemed by his master, because it was through him that the Lord had delivered Aram. He was a brave soldier, but he had leprosy."},{"num":2,"verse":"Aramean raiders had gone out into the land of Israel and had taken a young girl captive who served Naaman’s wife."},{"num":3,"verse":"She said to her mistress, “If only my lord would present himself to the prophet who is in Samaria. He would cure him of his leprosy.”"},{"num":4,"verse":"He went to his lord and said, “This is what the young girl from the land of Israel said.”"},{"num":5,"verse":"The king of Aram said, “Go! I will send a letter to the king of Israel.”"},{"num":7,"verse":"When the king of Israel read the letter, he tore his clothes and said, “Am I God, with the power to kill and give life, that he sends me a man to heal him of his leprosy? Think of it, see how he is seeking a quarrel with me.”"},{"num":8,"verse":"When Elisha, the man of God, heard that the king of Israel had torn his clothes, he sent to the king, saying, “Why have you torn your clothes? Let him come to me so that he might know that there is a prophet in Israel.”"},{"num":9,"verse":"So Naaman went with his horses and his chariot, and he stood at the door to Elisha’s house."},{"num":10,"verse":"Elisha sent a messenger to him, saying, “Go, wash seven times in the Jordan, and your skin will be restored, and you will be clean.”"},{"num":11,"verse":"But Naaman went away angry and said, “Behold, I thought he would surely come out to me and stand and call upon the name of the Lord, his God, and wave his hand over the place and heal the leprosy."},{"num":12,"verse":"Are not the Abana and the Pharpar, the rivers of Damascus, better than all of the rivers of Israel? Could I not wash in them and be made clean?”"},{"num":14,"verse":"He went down and he bathed himself in the Jordan seven times as the man of God had instructed him to do. His skin became like the skin of a little child, and he was clean."},{"num":15,"verse":"He and all of his attendants returned to the man of God. He came and he stood before him and said, “Behold, I now know that there is no God upon the earth except in Israel. Please accept a gift from your servant.”"},{"num":16,"verse":"He answered, “As the Lord lives before whom I stand, I will not accept it.” Even though he urged him to take it, he refused."},{"num":17,"verse":"Naaman said, “If not, then let your servant be given two donkey loads of dirt, for your servant will never again offer burnt offerings or sacrifices to any other god but the Lord."},{"num":18,"verse":"Only may the Lord forgive me this one thing: When my master enters the temple of Rimmon to worship there, and he leans on my hand and I also bow down in the temple of Rimmon, may the Lord forgive your servant this thing.”"},{"num":19,"verse":"He said to him, “Go in peace.” He left and traveled a little way."},{"num":20,"verse":"But Gehazi, the servant of Elisha, the man of God, said, “Behold, my master has spared Naaman the Aramean by not accepting from his hands what he brought. As the Lord lives, I will run after him and take something from him.”"},{"num":21,"verse":"So Gehazi followed Naaman. When Naaman saw him running after him, he got off the chariot to greet him and he said, “Is all well?”"},{"num":22,"verse":"He answered, “All is well. My master sent me, saying, ‘Two young men from among the sons of the prophets have now come to me from the hill country of Ephraim. Please give them a talent of silver and two changes of clothing.’ ”"},{"num":23,"verse":"Naaman said, “Please take two talents.” He urged it on him, and he bound up two talents of silver in two bags along with two changes of clothing. He entrusted it to two of his servants who carried it before him."},{"num":24,"verse":"When he came to the tower, he took it from their hands and he placed it in the house. He then dismissed the men and they left."},{"num":25,"verse":"He went in and stood before his master. Elisha said to him, “Where are you coming from, Gehazi?” He answered, “Your servant has not gone anywhere.”"},{"num":26,"verse":"He said to him, “Was not my spirit with you when the man got off of his chariot to meet you? Is this now the time to receive money, or clothing, or olive orchards, or vineyards, or sheep, or oxen, or menservants, or maidservants?"},{"num":27,"verse":"On account of this, Naaman’s leprosy will cling to you and your descendants forever.” He went out from his presence, and he was a leper, as white as snow."}]