[{"header":"Elisha Heals Naaman"},{"num":5,"verse":"Naaman, the commander of the Aramean king’s army, was respected and highly honored by his master. Yahweh had given Aram a victory through Naaman. This man was a good soldier, but he had a skin disease."},{"num":2,"verse":"Once, when the Arameans went on raids, they had brought back a little girl from Israel. She became the servant of Naaman’s wife. "},{"num":3,"verse":"The girl told her mistress, “If only my master were with the prophet in Samaria. Then the prophet could cure him of his skin disease.”"},{"num":4,"verse":"Naaman went to his master and told him what the girl from Israel had said."},{"num":5,"verse":"The king of Aram said, “You may go. I will also send a letter to the king of Israel.” When Naaman left, he took 750 pounds of silver, 150 pounds of gold, and 10 sets of clothing with him. "},{"num":6,"verse":"He brought the letter to the king of Israel. It read, “I’m sending my officer Naaman with this letter. Cure him of his skin disease.”"},{"num":7,"verse":"When the king of Israel read the letter, he tore his clothes in distress. He asked, “Am I Elohim? Can I kill someone and then bring him back to life? This man sends someone to me so that I can cure his skin disease! All of you should realize and understand that he’s trying to pick a fight with me.”"},{"num":8,"verse":"But when Elisha, the man of Elohim, heard that the king of Israel had torn his clothes, he sent a messenger to the king. He asked, “Why did you tear your clothes? Please let Naaman come to me and find out that there is a prophet in Israel.”"},{"num":9,"verse":"Naaman came with his horses and chariot and stopped at the entrance to Elisha’s home. "},{"num":10,"verse":"Elisha sent a messenger to him. He said, “Wash yourself seven times in the Jordan River, and your skin will be healthy and clean.”"},{"num":11,"verse":"But Naaman became angry and left. He said, “I thought he would at least come out of his house, stand somewhere, call on the name of Yahweh his Elohim, wave his hand over the infected place, and heal the skin disease. "},{"num":12,"verse":"The Abana and Pharpar Rivers in Damascus have better water than any of the rivers in Israel. Couldn’t I wash in them and be clean?” So he turned around and left in anger."},{"num":13,"verse":"But Naaman’s servants went to him and said, “Master, if the prophet had asked you to do some extraordinary act, wouldn’t you have done it? Why shouldn’t you do as he said: ‘Wash and be clean’?”"},{"num":14,"verse":"So he went to dip himself in the Jordan River seven times, as the man of Elohim had instructed him. His skin became healthy again like a little child’s skin. "},{"num":15,"verse":"Then he and all his men returned to the man of Elohim. Naaman stood in front of Elisha and said, “Now I know that there’s no god in the whole world, except the Elohim of Israel. So please accept a present from me.”"},{"num":16,"verse":"Elisha said, “I solemnly swear, as Yahweh whom I serve lives, I will not accept it.” Naaman urged him to take it, but he refused."},{"num":17,"verse":"So Naaman said, “If you won’t take it, please have someone give me as much dirt as a pair of mules can carry. From now on I will sacrifice to Yahweh alone. I will not offer any burnt offering or sacrifice to any other gods. "},{"num":18,"verse":"May Yahweh forgive me when my master goes to the temple of Rimmon to worship, leans on my arm, and I have to bow down in the temple of Rimmon. When I do this, may Yahweh forgive me for this one thing.”"},{"num":19,"verse":"Elisha told Naaman, “Go in peace.”"},{"num":20,"verse":"Gehazi, the servant of Elisha (the man of Elohim), thought, “My master let this Aramean Naaman go without accepting what he had brought. As sure as Yahweh lives, I’ll run after Naaman and get something from him.” "},{"num":21,"verse":"So Gehazi went after Naaman. When Naaman saw Gehazi running after him, he got down from his chariot to speak to him. “Is something wrong?” he asked."},{"num":22,"verse":"Gehazi answered, “No. My master has sent me. He says, ‘Just now two young men from the disciples of the prophets in the hills of Ephraim have arrived. Please give them 75 pounds of silver and two sets of clothing.’”"},{"num":23,"verse":"Naaman replied, “Please let me give you 150 pounds of silver.” Naaman urged him to take the silver. Naaman tied up 150 pounds of silver in two bags with two sets of clothing. He gave them to a couple of his own servants to carry in front of Gehazi."},{"num":24,"verse":"When Gehazi came to the Ophel in Samaria, he took these things and put them away in the house. Then he dismissed the men, and they left. "},{"num":25,"verse":"He went and stood in front of his master."},{"num":26,"verse":"Then Elisha said to him, “I went with you in spirit when the man turned around in his chariot to speak to you. How could you accept silver, clothes, olive orchards, vineyards, sheep, cattle, or slaves? "},{"num":27,"verse":"Naaman’s skin disease will cling to you and your descendants permanently!”"}]