[{"num":13,"verse":"“Look, I have seen many instances such as you describe. I understand what you are saying. "},{"num":2,"verse":"I know as much as you do. I’m not stupid. "},{"num":3,"verse":"Oh, how I long to speak directly to the Almighty. I want to talk this over with God himself. "},{"num":4,"verse":"For you are misinterpreting the whole thing. You are doctors who don’t know what they are doing. "},{"num":5,"verse":"Oh, please be quiet! That would be your highest wisdom."},{"num":6,"verse":"“Listen to me now, to my reasons for what I think and to my pleadings."},{"num":7,"verse":"“Must you go on ‘speaking for God’ when he never once has said the things that you are putting in his mouth? "},{"num":8,"verse":"Does God want your help if you are going to twist the truth for him? "},{"num":9,"verse":"Be careful that he doesn’t find out what you are doing! Or do you think you can fool God as well as men? "},{"num":10,"verse":"No, you will be in serious trouble with him if you use lies to try to help him out. "},{"num":11,"verse":"Doesn’t his majesty strike terror to your heart? How can you do this thing? "},{"num":12,"verse":"These tremendous statements you have made have about as much value as ashes. Your defense of God is as fragile as a clay vase!"},{"num":13,"verse":"“Be silent now and leave me alone, that I may speak—and I am willing to face the consequences. "},{"num":14,"verse":"Yes, I will take my life in my hand and say what I really think. "},{"num":15,"verse":"God may kill me for saying this—in fact, I expect him to. Nevertheless, I am going to argue my case with him. "},{"num":16,"verse":"This at least will be in my favor, that I am not godless, to be rejected instantly from his presence. "},{"num":17,"verse":"Listen closely to what I am about to say. Hear me out."},{"num":18,"verse":"“This is my case: I know that I am righteous. "},{"num":19,"verse":"Who can argue with me over this? If you could prove me wrong, I would stop defending myself and die."},{"num":20,"verse":"“O God, there are two things I beg you not to do to me; only then will I be able to face you. "},{"num":21,"verse":"Don’t abandon me. And don’t terrify me with your awesome presence. "},{"num":22,"verse":"Call to me to come—how quickly I will answer! Or let me speak to you, and you reply. "},{"num":23,"verse":"Tell me, what have I done wrong? Help me! Point out my sin to me. "},{"num":24,"verse":"Why do you turn away from me? Why hand me over to my enemy? "},{"num":25,"verse":"Would you blame a leaf that is blown about by the wind? Will you chase dry, useless straws?"},{"num":26,"verse":"“You write bitter things against me and bring up all the follies of my youth. "},{"num":27,"verse":"You send me to prison and shut me in on every side. I am like a fallen, rotten tree, like a moth-eaten coat."}]