[{"num":13,"verse":"Lo! mine eye, saith Job, hath seen all things, and mine ear hath heard (it all); and I understood all things."},{"num":2,"verse":"Even with your knowing, (that) also I know, and I am not lower than ye. (What you know, I also know, and I am not lower than ye.)"},{"num":3,"verse":"But nevertheless I shall speak to Almighty God, and I covet to dispute with God (and I desire to dispute with God);"},{"num":4,"verse":"and first I (shall) show you (to be) makers of lies, and lovers/favourers of wayward teachings. (but first I shall show you to be liars, and lovers of wayward teaching.)"},{"num":5,"verse":"And I would, that ye were still, that ye were guessed to be wise men. (And I wish, that ye held your peace, so that ye could be thought to be wise.)"},{"num":6,"verse":"Therefore hear ye my chastisings; and perceive ye the doom of my lips. (And so hear ye my arguments; and understand ye the judgement from my lips.)"},{"num":7,"verse":"Whether God hath need to your leasing, that ye speak guileful things for him? (Hath God a need for your lies, so that ye speak these guileful things for him?)"},{"num":8,"verse":"Whether ye take his face, and enforce to deem for God? (Do ye take his place, and endeavour to judge for God?)"},{"num":9,"verse":"Either it shall please him, from whom nothing may be hid? Whether he, as a man, shall be deceived by your falsenesses? (Shall he, like a man, be deceived by your falseness, or your duplicity?)"},{"num":10,"verse":"He shall reprove you; for ye take his face in huddles. (He shall rebuke you, if ye secretly accuse me, and judge me.)"},{"num":11,"verse":"Anon as he shall stir him, he shall trouble you; and his dread shall fall upon you. (At once he shall stir himself, and he shall trouble you; and the fear of him, or his terror, shall come upon you.)"},{"num":12,"verse":"Your mind shall be comparisoned to ashes; and your nolls shall be driven down into (the) clay."},{"num":13,"verse":"Be ye still a little, that I speak (so that I can speak), whatever thing my mind hath showed to me."},{"num":14,"verse":"Why rend I my flesh with my teeth, and bear my life in mine hands?"},{"num":15,"verse":"Yea, though God slay me, I shall hope in him; nevertheless I shall prove my ways in his sight. (Yea, even if God shall kill me, I shall still hope, or trust, in him; and I shall still argue my case before him.)"},{"num":16,"verse":"And he shall be my saviour; for why each hypocrite shall not come in his sight (for no hypocrite shall ever come before him)."},{"num":17,"verse":"Hear ye my word, and perceive ye with [your] ears (my) dark and hard privy speeches/(my) dark and hard figurative speeches. (Hear ye my voice, and perceive ye with your ears, my words of explanation.)"},{"num":18,"verse":"If I shall be deemed, I know that I shall be found just. (If I shall be judged, I know that I shall be justified, or found acquitted.)"},{"num":19,"verse":"Who is he that is deemed with me? Come he; why am I still, and am wasted? (Who is he who is judged with me? Come he; for if I hold my peace, I shall be destroyed.)"},{"num":20,"verse":"Do thou not to me two things only; and then I shall not be hid from thy face. (Do thou only two things for me; and then I shall not hide from thy face.)"},{"num":21,"verse":"Make thine hand far from me; and thy dread make not me afeared. (Take thy hand far away from me; and do not let my fear of thee make me afraid.)"},{"num":22,"verse":"Call thou me, and I shall answer thee; either certainly I shall speak, and (then) thou shalt answer me."},{"num":23,"verse":"How great sins and wickednesses have I? (How many sins and wickednesses have I?) Show thou to me my felonies, and my trespasses."},{"num":24,"verse":"Why hidest thou thy face, and deemest me thine enemy?"},{"num":25,"verse":"Thou showest thy might against a leaf, that is ravished away with the wind; and thou pursuest dry stubble."},{"num":26,"verse":"For thou writest bitternesses against me; and wilt waste me with the sins of my young waxing age. (For thou writest bitter charges against me; and wilt destroy me for the sins of my youth.)"},{"num":27,"verse":"Thou hast set my foot in a stock (Thou hast set my feet in the stocks), and thou hast kept (watch over) all my paths; and thou hast beheld the steps of my feet."},{"num":28,"verse":"And I shall be wasted as rot, and as a cloth, that is eaten of a moth. (And I shall be wasted by rot, and like a cloak, that is eaten by a moth.)"}]