[[],[{"type":"header","content":"Jesus Is Lord of the Sabbath"},{"type":"prose","content":"On a Sabbath, while he was going through the grainfields, his disciples plucked and ate some heads of grain, rubbing them in their hands."}],[{"type":"prose","content":"But some of the Pharisees said, “Why are you doing what is not lawful to do on the Sabbath?”"}],[{"type":"prose","content":"And Jesus answered them, "}],[{"type":"prose","content":"And he said to them, "},{"type":"header","content":"A Man with a Withered Hand"}],[{"type":"prose","content":"On another Sabbath, he entered the synagogue and was teaching, and a man was there whose right hand was withered."}],[{"type":"prose","content":"And the scribes and the Pharisees watched him, to see whether he would heal on the Sabbath, so that they might find a reason to accuse him."}],[{"type":"prose","content":"But he knew their thoughts, and he said to the man with the withered hand,  And he rose and stood there."}],[{"type":"prose","content":"And Jesus said to them, "}],[{"type":"prose","content":"And after looking around at them all he said to him,  And he did so, and his hand was restored."}],[{"type":"prose","content":"But they were filled with fury and discussed with one another what they might do to Jesus."},{"type":"header","content":"The Twelve Apostles"}],[{"type":"prose","content":"In these days he went out to the mountain to pray, and all night he continued in prayer to God."}],[{"type":"prose","content":"And when day came, he called his disciples and chose from them twelve, whom he named apostles:"}],[{"type":"prose","content":"Simon, whom he named Peter, and Andrew his brother, and James and John, and Philip, and Bartholomew,"}],[{"type":"prose","content":"and Matthew, and Thomas, and James the son of Alphaeus, and Simon who was called the Zealot,"}],[{"type":"prose","content":"and Judas the son of James, and Judas Iscariot, who became a traitor."},{"type":"header","content":"Jesus Ministers to a Great Multitude"}],[{"type":"prose","content":"And he came down with them and stood on a level place, with a great crowd of his disciples and a great multitude of people from all Judea and Jerusalem and the seacoast of Tyre and Sidon,"}],[{"type":"prose","content":"who came to hear him and to be healed of their diseases. And those who were troubled with unclean spirits were cured."}],[{"type":"prose","content":"And all the crowd sought to touch him, for power came out from him and healed them all."},{"type":"header","content":"The Beatitudes"}],[{"type":"prose","content":"And he lifted up his eyes on his disciples, and said:"},{"type":"header","content":"Jesus Pronounces Woes"},{"type":"header","content":"Love Your Enemies"},{"type":"header","content":"Judging Others"}],[{"type":"prose","content":"He also told them a parable: "},{"type":"header","content":"A Tree and Its Fruit"},{"type":"header","content":"Build Your House on the Rock"}]]