[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Both that which was sealed . . . and that which was open.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We are left to conjecture why there were two documents, and why one was sealed and the other open. Possibly, as in modern transactions, one was simply a duplicate copy of the other, the sealed document being the formal evidence of purchase kept by the buyer, and the other left with the vendor for reference. The more probable explanation, however, is that the unsealed document, which the witnesses did not subscribe or see, contained details which did not concern the witnesses, the price paid (though the mention of the witnesses before the weighing of the money militates against this view), the conditions of resumption by the vendor, possibly some reference to the period of seventy years, at the end of which, and not before, the heirs of Jeremiah might expect to enter on possession.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "According to the law and custom.—Better, to wit, the agreement and the conditions. The whole transaction may be compared, as an example of ancient conveyancing, with the transfer of the field and cave of Machpelah in Genesis 23",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "According to the law and custom.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "to wit, the agreement and the conditions. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The whole transaction may be compared, as an example of ancient conveyancing, with the transfer of the field and cave of Machpelah in Genesis 23",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32:1-15 Jeremiah, being in prison for his prophecy, purchased a piece of ground. This was to signify, that though Jerusalem was besieged, and the whole country likely to be laid waste, yet the time would come, when houses, and fields, and vineyards, should be again possessed. It concerns ministers to make it appear that they believe what they preach to others. And it is good to manage even our worldly affairs in faith; to do common business with reference to the providence and promise of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Translate: And I wrote the particulars of the purchase in the deed ... And I took the purchase-deed, both that which was sealed containing the oiler and the conditions, and that which was open etc. There were two indentures, of which one was called the purchase-deed, and was signed by the purchaser and the witnesses. It was then sealed, not in our sense of appending a seal in place of signatures, but to close it up. The open deed was probably an exact copy, and was that intended for common use. In case its authenticity was called in question, the sealed copy would have to be produced before the judge, the seal opened, and if its contents agreed with those of the open deed, the decision would be in the buyer's favor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By the offer is probably meant the specification. The conditions, literally, the statutes, would be the stipulations and terms of the sale, e. g. as to its restoration at the year of jubile, its price etc. The placing of the deeds in jar was of course intended to preserve them from damp during the long years of the exile. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "By the offer is probably meant the specification. The conditions, literally, the statutes, would be the stipulations and terms of the sale, e. g. as to its restoration at the year of jubile, its price etc. The placing of the deeds in jar was of course intended to preserve them from damp during the long years of the exile. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. evidence … sealed … open—Two deeds were drawn up in a contract of sale; the one, the original copy, witnessed and sealed with the public seal; the other not so, but open, and therefore less authoritative, being but a copy. Gataker thinks that the purchaser sealed the one with his own seal; the other he showed to witnesses that they might write their names on the back of it and know the contents; and that some details, for example, the conditions and time of redemption were in the sealed copy, which the parties might not choose to be known to the witnesses, and which were therefore not in the open copy. The sealed copy, when opened after the seventy years' captivity, would greatly confirm the faith of those living at that time. The \"law and custom\" refer, probably, not merely to the sealing up of the conditions and details of purchase, but also to the law of redemption, according to which, at the return to Judea, the deed would show that Jeremiah had bought the field by his right as next of kin (Le 25:13-16), [Ludovicus De Dieu].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " It is most probable that, upon such bargains and sales amongst the Jews, two instruments were made, the one sealed up, to be kept by the purchaser, the other open, to be showed to the judges, and by them ratified, and that this was the law and custom ordinarily amongst the Jews upon purchases; both which Jeremiah kept, the one for his use, the other to produce in court for ratification. There is no certainty in the guesses that some others make why there were two copies: nothing appeareth but that the prophet bought this little purchase with the same rites and circumstances that men ordinarily in that country made purchases in times of peace and civil order. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So I took the evidence of the purchase,.... The deed of purchase, the book or bill of sale, the instrument of the bargain, as before mentioned: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "both that which is sealed, according to the law and custom; which was both sealed by the buyer and seller, and was sealed up, and not to be looked into by everyone, only when there might be a necessity; this was the original copy: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and that which was open; the counter part or copy of the former, which though signed and sealed as the other, yet not sealed up, but was open and exposed to view; either for the relations to see what was done, as some; or for the judges, as others, to ratify and make authentic: or, as is most probable, this copy was laid up in some public register, to have recourse unto upon any occasion; however it was, it was according to the laws and customs of those times, which Jeremiah carefully attended to: or, as others, it lay open for the witnesses to sign; so there are three distinct things; first the written contract; then that as signed and sealed by buyer and seller, according to law; and then as signed, but not sealed, by the witnesses. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and that which was open; the counter part or copy of the former, which though signed and sealed as the other, yet not sealed up, but was open and exposed to view; either for the relations to see what was done, as some; or for the judges, as others, to ratify and make authentic: or, as is most probable, this copy was laid up in some public register, to have recourse unto upon any occasion; however it was, it was according to the laws and customs of those times, which Jeremiah carefully attended to: or, as others, it lay open for the witnesses to sign; so there are three distinct things; first the written contract; then that as signed and sealed by buyer and seller, according to law; and then as signed, but not sealed, by the witnesses. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So I took the deed of the purchase, both that which was sealed {g} according to the law and custom, and that which was open:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So I took the deed of the purchase, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "both",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that which was sealed ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "according",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the law and custom, and that which was open:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) According to the custom the instrument or evidence was sealed up with the common seal and a copy of it remained which contained the same in effect but was left open to be seen if anything should be called into doubt.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "both that which was sealed … and that which was open",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] but not implying two documents to be kept separate. They were the two parts of a whole. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jeremiah 32:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the law and custom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] better, with mg. containing ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the terms and conditions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The former Dr. however renders ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the injunction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz. to the seller, bidding him hand over the property, while the latter are the conditions on which it is purchased.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Jeremiah 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The purchase was concluded in full legal form. \"I wrote it (the necessary terms) in the letter (the usual letter of purchase), and sealed it, and took witnesses, and weighed out the money on the balance\" (it was then and still is the custom in the East to weigh money). חתם means here, not to append a seal instead of subscribing the name, or for attestation (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 2), but to seal up, make sure by sealing (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). For, from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", we perceive that two copies of the bill of purchase were prepared, one sealed up, and the other open; so that, in case the open one were lost, or were accidentally or designedly injured or defaced, a perfect original might still exist in the sealed-up copy. Then \"Jeremiah took the bill of purchase, the sealed one,\" - the specification and the conditions - \"and the open one.\" The words המּצוה והחקּים are in apposition with 'את־ספר וגו. The Vulgate renders stipulationes et rata; Jerome, stipulatione rata, which he explains by stipulationibus et sponsionibus corroborata. מצוה, usually \"a command, order,\" is probably employed here in the general sense of \"specification,\" namely, the object and the price of purchase; חקּים, \"statutes,\" the conditions and stipulations of sale. The apposition has the meaning, \"containing the agreement and the conditions.\" Both copies of this bill, the prophet-before the eyes of Hanamel, his cousin (דּדי, either in the general sense of a near relation, since the relationship has been stated exactly enough already, or בּן־ has been inadvertently omitted), and before the eyes of, i.e., in the presence of \"the witnesses, who wrote in the letter of purchase,\" i.e., had subscribed it as witnesses in attestation of the matter, and in the eyes of all the Jews who were sitting in the court of the prison, and in whose presence the transaction had been concluded - delivered up to his attendant Baruch, son of Nerijah, the son of Mahsejah, with the words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"Thus saith Jahveh of hosts, the God of Israel: Take these letters, this sealed-up letter of purchase and this open letter, and put them into an earthen vessel, that they may remain a long time there. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For thus saith Jahveh of hosts, the God of Israel: Houses, and fields, and vineyards shall still be bought in this land.\" - The second utterance of the Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") declares the reason why the letters were to be preserved in an earthen vessel, in order to protect them from damp, decay, and destruction, namely, because one could make use of them afterwards, when sale of property would still be taking place. There is also implied the intimation, that the present desolation of the land and the transportation of its inhabitants will only last during their time; and then the population of Judah will return, and enter again on the possession of their land. The purchase of the field on the part of Jeremiah had this meaning; and for the sake of this meaning it was announced to him by God, and completed before witnesses, in the presence of the Jews who happened to be in the court of the prison. ",
        "children": []
      }
    ]
  }
]