[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(40) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will make an everlasting covenant . . .—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The “covenant” thus promised is, it must be remembered, identical with that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—the “new covenant,” which shall never wax old and decay, but shall abide for ever. “My fear” is identical with “the fear of the Lord,” which is “the beginning of wisdom.” The curse of Israel had been that they had been without that fear to restrain them from evil, and that the mere dread of punishment had proved powerless to supply its place.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 32:40-44",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:40-44",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I will make an everlasting covenant with them ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The Jewish covenant, even with respect to the ceremonial ordinances contained in it, is sometimes called an ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "everlasting ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "covenant; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 24:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; because those ordinances were to continue for a long succession of ages; but when this expression is applied to the gospel covenant, there is a peculiar emphasis contained in it, implying that it should never be abolished, or give way to any other dispensation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That I will not turn away from them to do them good ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This clause manifestly shows, that this promise relates to those Jews and Israelites that should embrace the gospel, and become ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jews inwardly, and Israelites indeed; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for, as to others, God did turn away from doing them good, when their city was taken by Titus, and so many myriads of them perished by the sword, famine, and pestilence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But I will put my fear into their hearts ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— My Spirit shall beget in them a true reverence for, and genuine, loving fear of me, producing obedience to my laws, subjection to my authority, and perseverance in my ways, so ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that they shall not depart from me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Some justly infer from this declaration, that when once the body of the Jews shall be converted, they shall never again apostatize from God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yea, I will rejoice over them to do them good ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— I will not only do them good, but will take pleasure therein. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I will plant them, &c., assuredly, with my whole heart ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— With a true and lasting affection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Like as I have brought all this great evil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — They shall find me as true to my promises as to my threatenings. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And fields shall be bought in this land, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — So that it was not without good reason that I sent Hanameel unto thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was to assure thee that, though at present the Chaldeans shall prevail against Jerusalem, and the Jews shall be carried into captivity, and shall neither buy nor sell here, yet fields shall be bought here again. Men shall buy and sell, and seal evidences in all parts of this land, whereof you say, in despair, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is desolate without man or beast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Having no hope of the land being ever inhabited by your nation again. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For I will cause their captivity to return, saith the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The return of their captivity under Cyrus shall be an earnest of those greater blessings which I will bestow upon them at their general restoration. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32:26-44 God's answer discovers the purposes of his wrath against that generation of the Jews, and the purposes of his grace concerning future generations. It is sin, and nothing else, that ruins them. The restoration of Judah and Jerusalem is promised. This people were now at length brought to despair. But God gives hope of mercy which he had in store for them hereafter. Doubtless the promises are sure to all believers. God will own them for his, and he will prove himself theirs. He will give them a heart to fear him. All true Christians shall have a disposition to mutual love. Though they may have different views about lesser things, they shall all be one in the great things of God; in their views of the evil of sin, and the low estate of fallen man, the way of salvation through the Saviour, the nature of true holiness, the vanity of the world, and the importance of eternal things. Whom God loves, he loves to the end. We have no reason to distrust God's faithfulness and constancy, but only our own hearts. He will settle them again in Canaan. These promises shall surely be performed. Jeremiah's purchase was the pledge of many a purchase that should be made after the captivity; and those inheritances are but faint resemblances of the possessions in the heavenly Canaan, which are kept for all who have God's fear in their hearts, and do not depart from him. Let us then bear up under our trials, assured we shall obtain all the good he has promised us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "God's new covenant ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is on God's side, I will not turn away from them to do them good, i. e., I will never cease from doing them good. On their side, I will put My fear in their hearts that they depart not from Me. In these two conditions consists the certainty of the eternal duration of the covenant ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "40. (Jer 31:31, 33; Isa 55:3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "not depart from me—never yet fully realized as to the Israelites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will not turn away from them … good—(Isa 30:21). Jehovah compares Himself to a sedulous preceptor following his pupils everywhere to direct their words, gestures.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "put my fear in … hearts … not depart from me—Both the conversion and perseverance of the saints are the work of God alone, by the operation of the Holy Spirit.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This promise manifestly relateth to those Jews that should receive the Lord Jesus Christ, or that were Israelites indeed; for as to others, God did turn away from doing them good, when their city was taken by Titus; unless it be to be understood of a national conversion of the Jews, not yet effected. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will put my fear into their hearts, that they shall not depart from me; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " my Spirit, which shall beget in them a dread of me, so as they shall not depart from me. Hence some conclude well, that when once the body of the Jews shall be converted, they shall never again apostatize from God. It may well from hence be concluded, that both conversion unto God, and perseverance in the ways of God, are the gifts of God; we are kept by the power of God through faith unto salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will make an everlasting covenant with them,.... Which is made known and manifest at conversion; when the grace of it is applied; the blessings of it bestowed; and the promises of it made good; and therefore said to be made; for otherwise the covenant of grace here spoken of was made from all eternity with Christ, and his people in him; as appears from his being set up as the Mediator so early, and from the blessings and promises of it being of such a date. It is founded on the everlasting love of God, and is according to his eternal purpose; and is no other than an eternal transaction between the Father and the Son concerning the salvation of his elect; and which will last for ever, and never be antiquated, as the covenant under the former dispensation was; and which shows that this respects Gospel times: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that I will not turn away from them to do them good; he may withdraw his gracious presence for a while; but he never turns from his love and affections to his people; nor from his gracious purposes concerning them; nor from his promises to them; nor from his gifts bestowed on them; or so as to utterly leave them and forsake them, or cease to do them good: he has laid up goodness for them; he has bestowed much on them whom he has called by his grace; he has given himself to them as their God and portion; his Son as their Saviour and Redeemer, and all good things with him; his Spirit as their Sanctifier, with his gifts and graces; and he has wrought a good work in them; and he will continue to do them good, by fresh discoveries of his love; by granting his gracious presence; by carrying on his work of grace; by supplying their wants, and making all things work together for their good. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"my Word shall not turn away, &c.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but I will put my fear in their hearts; which is not naturally in the hearts of then; and, where it is, it is put there by the grace of God, and as a blessing of the covenant; it appears in those who are brought to a true sight of sin, in their humble sense of themselves, and dependence on the Lord; and in a reverent affection for him: and in a true and spiritual worship of him; and which is a security from a final and total apostasy from him, as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that they shall not depart from me; not but that they may and do sin against God; and there may be a partial departure from him in those that truly fear him; but not a wicked, final, and total one: the fear of God influences them to cleave close unto him; and the power of God keeps them from departing from him, from his doctrines, worship, and ordinances, from his people, and a profession of his name. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that they shall not depart from me; not but that they may and do sin against God; and there may be a partial departure from him in those that truly fear him; but not a wicked, final, and total one: the fear of God influences them to cleave close unto him; and the power of God keeps them from departing from him, from his doctrines, worship, and ordinances, from his people, and a profession of his name. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I will make an everlasting {u} covenant with them, that I will not turn away from them, to do them good; but I will put my fear in their hearts, that they shall not depart from me.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I will make an everlasting ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{u}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " covenant with them, that I will not turn away from them, to do them good; but I will put my fear in their hearts, that they shall not depart from me.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) Read Jer 31:1-33:26.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that they shall not depart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that it turn not away.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that it turn not away.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 40.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "An everlasting covenant.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is the \"new covenant\" of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., which is meant (for the phrase, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That I will not turn...  to do them good.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The comma in the Authorized Version impairs the sense. The prophet means, \"That I will not cease to show them favour\" (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jeremiah 32:40",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are to be understood like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They must in very deed become the people of the Lord, for God gives them one heart and one way of life, to fear Him always, i.e., through His Spirit He renews and sanctifies them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 24:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 11:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"One heart and one way\" that they may all with one mind and in one way fear me, no longer wander through many wicked ways (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). יראה is an infinitive, as often in Deut., e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 4:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from which the whole sentence has been derived, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 6:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to which the expression לטוב להם points. The everlasting covenant which the Lord wishes to conclude with them, i.e., the covenant-relationship which He desires to grant them, is, in fact, the new covenant, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here, however, only the eternal duration of it is made prominent, in order to comfort the pious in the midst of their present sufferings. Consequently, only the idea of the עולם is mainly set forth: \"that I shall not turn away from them, to do them good - no more withdraw from them my gracious benefits;\" but the uninterrupted bestowal of these implies also faithfulness to the Lord on the part of the people. The Lord desires to establish His redeemed people in this condition by putting His fear in their heart, namely, through His Spirit; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:33-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ושׂשׂתּי, \"And I shall rejoice over them, by doing them good,\" as was formerly the case (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is again to be, in time to come. בּאמת, in truth, properly, \"in faithfulness.\" This expression is strengthened by the addition, \"with my whole heart and my whole soul.\" - So much for the promise of restoration and renewal of the covenant people. This promise is confirmed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:42-44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by the assurance that the accomplishment of deliverance shall follow as certainly as the decree of the calamity has done; the change is similar to that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Finally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", there is the application made of this to the purchase of the field which the prophet had been commanded to fulfil; and the signification of this purchase is thus far determined, that after the restoration of Judah to their own land, fields shall once more be bought in full legal form: with this, the discourse returns to its starting-point, and finishes. The article is used generically in השׂדה; hence, on the repetition of the thought, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 32:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the plural שׂדות is employed instead. The enumeration of the several regions of the kingdom, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is a rhetorical individualization for strengthening the thought. The land of Benjamin is here made prominent in relation to the field purchased by Jeremiah at Anathoth in the land of Benjamin. The final sentence 'כּי אשׁיב  also serves for further proof. The Hiphil in this expression does not mean the same as the usual אשׁוּב: \"I turn the captivity,\" i.e., I change the adversity into prosperity. השׁיב expresses restitutio in statum incolumitatis seu integritatis more plainly than שׁוּב - not merely the change of misfortune or misery; but it properly means, to lead back or restore the captivity, i.e., to remove the condition of adversity by restoration of previous prosperity. The expression is analogous to קומם or בּנה חרבות, to build or raise ruins, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 58:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and קומם שׁממות, to raise up desolate places, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which does not mean to restore ruins or desolate places, but to build them up into inhabitable places (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to remove ruins or desolations by the building and restoration of cities. ",
        "children": []
      }
    ]
  }
]