[{"num":24,"verse":"but the next day, while it was still very early, they took the spices they had prepared, went to the tomb, "},{"num":2,"verse":"and found the stone rolled away from the tomb! "},{"num":3,"verse":"On entering, they discovered that the body of the Lord Yeshua was gone! "},{"num":4,"verse":"They were standing there, not knowing what to think about it, when suddenly two men in dazzlingly bright clothing stood next to them. "},{"num":5,"verse":"Terror-stricken, they bowed down with their faces to the ground. The two men said to them, “Why are you looking for the living among the dead? "},{"num":6,"verse":"He is not here; he has been raised. Remember how he told you while he was still in the Galil, "},{"num":7,"verse":"‘The Son of Man must be delivered into the hands of sinful men and be executed on a stake as a criminal, but on the third day be raised again’?” "},{"num":8,"verse":"Then they remembered his words; "},{"num":9,"verse":"and, returning from the tomb, they told everything to the Eleven and to all the rest. "},{"num":10,"verse":"The women who told the emissaries these things were Miryam of Magdala, Yochanah, Miryam the mother of Ya‘akov, and the others in their circle."},{"num":11,"verse":"But the emissaries didn’t believe them; in fact, they thought that what they said was utter nonsense! "},{"num":12,"verse":"However, Kefa got up and ran to the tomb. Stooping down, he saw only the burial cloths and went home wondering what had happened."},{"num":13,"verse":"That same day, two of them were going toward a village about seven miles from Yerushalayim called Amma’us, "},{"num":14,"verse":"and they were talking with each other about all the things that had happened. "},{"num":15,"verse":"As they talked and discussed, Yeshua himself came up and walked along with them, "},{"num":16,"verse":"but something kept them from recognizing him. "},{"num":17,"verse":"He asked them, “What are you talking about with each other as you walk along?” They stopped short, their faces downcast; "},{"num":18,"verse":"and one of them, named Cleopas, answered him, “Are you the only person staying in Yerushalayim that doesn’t know the things that have been going on there the last few days?” "},{"num":19,"verse":"“What things?” he asked them. They said to him, “The things about Yeshua from Natzeret. He was a prophet and proved it by the things he did and said before God and all the people. "},{"num":20,"verse":"Our head cohanim and our leaders handed him over, so that he could be sentenced to death and executed on a stake as a criminal. "},{"num":21,"verse":"And we had hoped that he would be the one to liberate Isra’el! Besides all that, today is the third day since these things happened; "},{"num":22,"verse":"and this morning, some of the women astounded us. They were at the tomb early "},{"num":23,"verse":"and couldn’t find his body, so they came back; but they also reported that they had seen a vision of angels who say he’s alive! "},{"num":24,"verse":"Some of our friends went to the tomb and found it exactly as the women had said, but they didn’t see him.”"},{"num":25,"verse":"He said to them, “Foolish people! So unwilling to put your trust in everything the prophets spoke! "},{"num":26,"verse":"Didn’t the Messiah have to die like this before entering his glory?” "},{"num":27,"verse":"Then, starting with Moshe and all the prophets, he explained to them the things that can be found throughout the Tanakh concerning himself."},{"num":28,"verse":"They approached the village where they were going. He made as if he were going on farther; "},{"num":29,"verse":"but they held him back, saying, “Stay with us, for it’s almost evening, and it’s getting dark.” So he went in to stay with them. "},{"num":30,"verse":"As he was reclining with them at the table, he took the matzah, made the b’rakhah, broke it and handed it to them. "},{"num":31,"verse":"Then their eyes were opened, and they recognized him. But he became invisible to them. "},{"num":32,"verse":"They said to each other, “Didn’t our hearts burn inside us as he spoke to us on the road, opening up the Tanakh to us?”"},{"num":33,"verse":"They got up at once, returned to Yerushalayim and found the Eleven gathered together with their friends, "},{"num":34,"verse":"saying, “It’s true! The Lord has risen! Shim‘on saw him!” "},{"num":35,"verse":"Then the two told what had happened on the road and how he had become known to them in the breaking of the matzah."},{"num":36,"verse":"They were still talking about it when — there he was, standing among them! "},{"num":37,"verse":"Startled and terrified, they thought they were seeing a ghost. "},{"num":38,"verse":"But he said to them, “Why are you so upset? Why are these doubts welling up inside you? "},{"num":39,"verse":"Look at my hands and my feet — it is I, myself! Touch me and see — a ghost doesn’t have flesh and bones, as you can see I do.” "},{"num":40,"verse":"As he said this, he showed them his hands and feet. "},{"num":41,"verse":"While they were still unable to believe it for joy and stood there dumbfounded, he said to them, “Have you something here to eat?” "},{"num":42,"verse":"They gave him a piece of broiled fish, "},{"num":43,"verse":"which he took and ate in their presence."},{"num":44,"verse":"Yeshua said to them, “This is what I meant when I was still with you and told you that everything written about me in the Torah of Moshe, the Prophets and the Psalms had to be fulfilled.” "},{"num":45,"verse":"Then he opened their minds, so that they could understand the Tanakh, "},{"num":46,"verse":"telling them, “Here is what it says: the Messiah is to suffer and to rise from the dead on the third day; "},{"num":47,"verse":"and in his name repentance leading to forgiveness of sins is to be proclaimed to people from all nations, starting with Yerushalayim. "},{"num":48,"verse":"You are witnesses of these things. "},{"num":49,"verse":"Now I am sending forth upon you what my Father promised, so stay here in the city until you have been equipped with power from above.”"},{"num":50,"verse":"He led them out toward Beit-Anyah; then, raising his hands, he said a b’rakhah over them; "},{"num":51,"verse":"and as he was blessing them, he withdrew from them and was carried up into heaven. "},{"num":52,"verse":"They bowed in worship to him, then returned to Yerushalayim, overflowing with joy. "},{"num":53,"verse":"And they spent all their time in the Temple courts, praising God."}]