[{"num":24,"verse":"On the morrow after the Sabbath, early in the morning, the women went to the tomb, bringing the spices they had prepared and other women with them. "},{"num":2,"verse":"And they found the stone rolled away from the sepulchre, "},{"num":3,"verse":"and went in, but did not find the body of the Lord Jesus. "},{"num":4,"verse":"And it happened as they wondered at this, behold, two men stood by them in shining vestures."},{"num":5,"verse":"And as the women became afraid and bowed down their faces to the earth, they said to them, Why do you seek the living among the dead? He is not here, but is risen. "},{"num":6,"verse":"Remember how he spoke to you when he was yet with you in Galilee, "},{"num":7,"verse":"saying that the Son of man must be delivered into the hands of sinful men and be crucified, and the third day rise again?"},{"num":8,"verse":"And they remembered his words, "},{"num":9,"verse":"and returned from the sepulchre, and told all these things to the eleven and to all the rest. "},{"num":10,"verse":"It was Mary Magdalene, Joanna, Mary Jacobi, and others that were with them, who told these things to the apostles. "},{"num":11,"verse":"But their words seemed to them like vain things, and they did not believe them."},{"num":12,"verse":"Then Peter arose and ran to the sepulchre, and stooped in and saw the linen cloths laid by themselves. And he departed, wondering in himself at that which had happened."},{"num":13,"verse":"And behold, two of them set out that same day for a town called Emmaus, which was about sixty furlongs from Jerusalem, "},{"num":14,"verse":"and they talked together about all these things that had happened. "},{"num":15,"verse":"And it so was, as they conversed together and discussed, that Jesus himself drew near and went alongside them. "},{"num":16,"verse":"But their eyes were held, so they could not know him. "},{"num":17,"verse":"And he said to them, What sort of conversations are these that you are having with each other as you walk and are sad?"},{"num":18,"verse":"And the one named Cleopas answered and said to him, Are you only a stranger in Jerusalem, and do not know about the things that have happened there in these days?"},{"num":19,"verse":"Jesus said to them, What things?"},{"num":20,"verse":"and how the high priests and our rulers delivered him to be condemned to death, and have crucified him. "},{"num":21,"verse":"But we trusted that it was he who would deliver Israel. And regarding all these things, today is just the third day since they happened. "},{"num":22,"verse":"Yea, and also certain women of our company have us mystified. They went early to the sepulchre, "},{"num":23,"verse":"but did not find his body, and came saying that they had seen a vision of angels who said that he was alive. "},{"num":24,"verse":"And some of those who were with us went their way to the sepulchre and found it just as the women had said, but they did not see him."},{"num":25,"verse":"And he said to them, O foolish ones, and slow of heart to believe all that the prophets have spoken! "},{"num":26,"verse":"Ought not the Christ to have suffered these things and to enter into his glory?"},{"num":27,"verse":"And he began at Moses and at all the prophets, and interpreted to them all the scriptures that were written about him. "},{"num":28,"verse":"And they drew near the town they were headed to, and Jesus made as though he would have gone further. "},{"num":29,"verse":"But they constrained him, saying, Stay with us, for it is drawing towards night and the day is far past. And he went in to stay with them."},{"num":30,"verse":"And it came to pass, as he sat at food with them, he took bread, blessed it, broke, and gave to them. "},{"num":31,"verse":"And their eyes were opened and they knew him; and he vanished out of their sight. "},{"num":32,"verse":"And they said between themselves, Did not our hearts burn within us while he talked with us along the road and as he opened to us the scriptures?"},{"num":33,"verse":"And they rose up the same hour and returned again to Jerusalem. And they found the eleven gathered together, and those who were with them, "},{"num":34,"verse":"who said, The Lord is risen indeed, and has appeared to Simon!"},{"num":35,"verse":"And the two told what things had happened along the road, and how they knew him in the breaking of bread."},{"num":36,"verse":"As they were thus speaking, Jesus himself stood in the midst of them and said to them, Peace be with you. "},{"num":37,"verse":"And they were startled and afraid, supposing they saw a spirit. "},{"num":38,"verse":"And he said to them, Why are you troubled, and why do doubts arise in your hearts? "},{"num":39,"verse":"Behold my hands and my feet, that it is even I myself. Handle me and see. For spirits do not have flesh and bones, as you see me to have."},{"num":40,"verse":"And when he had thus spoken, he showed them his hands and his feet. "},{"num":41,"verse":"And while they still could not believe for joy and wonderment, he said to them, Have you any food here? "},{"num":42,"verse":"And they gave him a piece of broiled fish and some honeycomb. "},{"num":43,"verse":"And he took it and ate it before them."},{"num":44,"verse":"And he said to them, These are the things that I told to you while I was still with you: that all must be fulfilled that was written about me in the law of Moses, and in the Prophets, and in the Psalms."},{"num":45,"verse":"Then he opened their wits to understand the scriptures, "},{"num":46,"verse":"and said to them, Thus it is written, and thus it was necessary for Christ to suffer, and to rise again from death the third day, "},{"num":47,"verse":"and that repentance and remission of sins should be preached in his name among all nations, and must begin at Jerusalem. "},{"num":48,"verse":"And you are witnesses of these things. "},{"num":49,"verse":"And behold, I will send the promise of my Father upon you. But stay in the city of Jerusalem until you are endued with power from on high."},{"num":50,"verse":"And he led them out into Bethany, and lifted up his hands and blessed them. "},{"num":51,"verse":"And it came to pass, as he blessed them, he departed from them and was carried up into heaven."},{"num":52,"verse":"And they worshipped him, and returned to Jerusalem with great joy, "},{"num":53,"verse":"and were continually in the temple, praising and lauding God."}]