[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23, 24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lamech said . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Following quickly upon music, we have poetry, but it is in praise of ferocity, and gives utterance to the pride of one who, by means of the weapons forged by his son, had taken violent revenge for an attack made upon him. Many commentators, however, regard the poem as hypothetical. “Were any one to wound me, I would with these weapons slay him.” It would thus be a song of exultation over the armour which Tubal-cain had invented. It more probably records a fact, and is intended to show that, side by side with progress in the material arts, moral degradation was going on. Cain’s own act is spoken of, not as a sin to be ashamed of, but as a deed of ancient heroism: not comparable, however, with the glory of Lamech, whose wrath shall be ten-fold. The poetry is vigorous, and marked by that parallelism which subsequently became the distinguishing quality of Hebrew verse. It should be translated:—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“Adah and Zillah, hear my voice,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ye wives of Lemech. give ear unto my rede.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For I have slain a man for wounding me:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Even a young man for bruising me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Truly Cain shall be avenged sevenfold,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And Lemech seventy and sevenfold.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is remarkable that both of the words used for the attack upon Lamech refer to such wounds as might be given by a blow with the fist, while his word means to pierce, or run through with a sharp weapon. “Young man” is literally child, but see on Genesis 21:14.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is remarkable that both of the words used for the attack upon Lamech refer to such wounds as might be given by a blow with the fist, while his word means to pierce, or run through with a sharp weapon. “Young man” is literally ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "child, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "but see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 21:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "With this boastful poem in praise of armed violence and bloodshed, joined with indications of luxury and a life of pleasure, the narrator closes the history of the race of Cain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:19-24 One of Cain's wicked race is the first recorded, as having broken the law of marriage. Hitherto, one man had but one wife at a time; but Lamech took two. Wordly things, are the only things that carnal, wicked people set their hearts upon, and are most clever and industrious about. So it was with this race of Cain. Here was a father of shepherds, and a father of musicians, but not a father of the faithful. Here is one to teach about brass and iron, but none to teach the good knowledge of the Lord: here are devices how to be rich, and how to be mighty, and how to be merry; but nothing of God, of his fear and service. Present things fill the heads of most. Lamech had enemies, whom he had provoked. He draws a comparison betwixt himself and his ancestor Cain; and flatters himself that he is much less criminal. He seems to abuse the patience of God in sparing Cain, into an encouragement to expect that he may sin unpunished.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In this fragment of ancient song, we have Lamek, under the strong excitement of having slain a man in self-defense, reciting to his wives the deed, and at the same time comforting them and himself with the assurance that if Cain the murderer would be avenegd sevenfold, he the manslayer in self-defense would be avenged seventy and seven-fold. This short ode has all the characteristics of the most perfect Hebrew poetry. Every pair of lines is a specimen of the Hebrew parallelism or rhythm of sentiment and style. They all belong to the synthetic, synonymous, or cognate parallel, the second member reiterating with emphasis the first. Here we observe that Lamek was a poet; one of his wives was probably a songstress, and the other had a taste for ornament. One daughter was the lovely, and three sons were the inventors of most of the arts which sustain and embellish life. This completes the picture of this remarkable family.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It has been noticed that the inventive powers were more largely developed in the line of Cain than in that of Sheth. And it has been suggested that the worldly character of the Cainites accounts for this. The Shethites contemplated the higher things of God, and therefore paid less attention to the practical arts of life. The Cainites, on the other hand, had not God in their thoughts, and therefore gave the more heed to the requisites and comforts of the present life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But besides this the Cainites, penetrating into the unknown tracts of this vast common, were compelled by circumstances to turn their thoughts to the invention of the arts by which the hardships of their condition might be abated. And as soon as they had conquered the chief difficulties of their new situation, the habits of industry and mental activity which they had acquired were turned to the embellishments of life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We have no grounds, however, for concluding that the descendants of Cain were as yet entirely and exclusively ungodly on the one hand, or on the other that the descendants of Sheth were altogether destitute of inventive genius or inattentive to its cultivation. With the exception of the assault that seemed to have provoked the homicidal act of Lamek, and the bigamy of Lamek himself, we find not much to condemn in the recorded conduct of the race of Cain; and in the names of some of them we discover the remembrance and recognition of God. Habel had a keeper of cattle before Jabal. The Cainites were also an older race than the Shethites. And when Noah was commissioned to build the ark, we have no reason to doubt that he was qualified in some measure by natural ability and previous training for such a task.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The line of Cain is traced no further than the seventh generation from Adam. We cannot tell whether there were any more in that line before the flood. The design of tracing it thus far, is to point out the origin of the arts of life, and the first instances of bigamy and homicide in self-defense. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The line of Cain is traced no further than the seventh generation from Adam. We cannot tell whether there were any more in that line before the flood. The design of tracing it thus far, is to point out the origin of the arts of life, and the first instances of bigamy and homicide in self-defense. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23, 24. Lamech said unto his wives—This speech is in a poetical form, probably the fragment of an old poem, transmitted to the time of Moses. It seems to indicate that Lamech had slain a man in self-defense, and its drift is to assure his wives, by the preservation of Cain, that an unintentional homicide, as he was, could be in no danger.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Adah and Zillah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " observing his fierceness and cruelty, feared that the vengeance of God or men would fall upon him, and upon them for his sake. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Be it so that I have slain a man, and that a young man, why do you concern yourselves in it? It is ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " own ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "wounding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hurt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not to yours; I must suffer for it, not you. Some take this to be a sorrowful confession of his bloody crime: q.d. I have murdered a man, to my wounding, &c. i.e. to my utter ruin, or to the wounding and grief of my heart and conscience. But this seems not to agree either with the quality of Cain’s family, or with the temper of Lamech’s person, or with the scope of the Holy Ghost in this place; which is to describe, not the virtues, but the crimes of that wicked race. According to the marginal translation, the sense may be this, Fear not for me; for if any man, though in his youth and strength, should assault me, and give me the first wound, he should pay dearly for it; and though I were wounded and weakened, the remainders of my strength would be sufficient to give him his death’s wound. The words also may be otherwise rendered; the particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chi",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being taken interrogatively, as it is ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Isaiah 29:6, Isaiah 36:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 36:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and elsewhere: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Have I slain a man to my wounding, and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "or, or",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a young man to my hurt?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. that thereby I should deserve such a mortal wound or hurt to be inflicted upon me by way of retaliation? You have therefore no cause of fear, either for my sake or for your own. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Lamech said unto his wives, Adah and Zillah,.... Confessing what he had done, or boasting what he would do should he be attacked; or in order to make his wives easy, who might fear from his fierceness and cruelty; and the murders he had committed, or on account of Abel's murder, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that either the judgments of God would fall upon him and them, or some man or other would dispatch him and his; wherefore calling them together, he thus bespeaks them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hear my voice, ye wives of Lamech, hearken unto my speech; this he said in an imperious manner to them, demanding their attention and regard, and as glorying in, instead of being ashamed of his polygamy, and in a blustering way, as neither fearing God nor man; or rather speaking comfortably to them, to remove their fears: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for I have slain a man to my wounding, and a young man to my hurt; which, as some say, were his great-grandfather Cain, and his son Tubalcain: according to a tradition of the Jews (i), it was after this manner; Cain being old, and blind, and weary, sat in a thicket among the trees to rest himself; when Lamech, who was blind also, and led by Tubalcain hunting, who seeing Cain, and taking him for a wild beast, bid Lamech draw his bow, which he did, and killed him; but coming nearer, and finding it was Cain, was wroth and angry, and slew the young man: the Arabic writers (k) tell the story with a little variation, and\"Lamech being in a wood with one of his sons, and hearing a noise in it, supposing it to be a wild beast, cast a stone, which fell upon Cain, and killed him ignorantly; and the lad that led him said, what hast thou done? thou hast killed Cain; at which being very sorrowful after the manner of penitents, he smote his hands together, and the lad standing before him, he struck his head with both his hands, and killed him unawares; and coming to his wives, Adah and Zillah, said to them, hear my word, he that slew Abel shall be avenged sevenfold, but Lamech seventy times seven, who killed a man with a cast of a stone, and a young man by clapping of his hands.''And our version, and others, imply, that he killed both a man, and a young man, or some one person or more, and that he was sorry for it, made confession of it; it was to the wounding and grief of his soul, which does not so well agree with one of the wicked race of Cain: wherefore the words may be rendered, \"though I have slain a man\" (l), that is nothing to you, you are not accountable for it, nor have any thing to fear coming upon you by reason of that; it is to my own wounding, damage, and hurt, if to any, and not to you. Some versions render it, \"I would slay a man\", &c. (m) any man, young or old, that should attack me; I fear no man: if any man wounds me, or offers to do me any hurt, I would slay him at once; I doubt not but I should be more than a match for him, be he who he will that shall set upon me, and kill him; though I might receive some slight wound, or some little hurt in the engagement, and therefore you need not be afraid of any man's hurting me. The Arabic version reads interrogatively, \"have I killed a man &c.?\" and so some others (n), I have not; with which agree the Targums of Onkelos and Jonathan,\"I have not killed a man;''for which he or his posterity should be punished, as they interpreted it; and therefore his wives had no need to fear any ill should befall him or them, or that the murder of Abel should be avenged on them, this being the seventh generation in which it was to be avenged, Genesis 4:15 wherefore it follows, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for I have slain a man to my wounding, and a young man to my hurt; which, as some say, were his great-grandfather Cain, and his son Tubalcain: according to a tradition of the Jews (i), it was after this manner; Cain being old, and blind, and weary, sat in a thicket among the trees to rest himself; when Lamech, who was blind also, and led by Tubalcain hunting, who seeing Cain, and taking him for a wild beast, bid Lamech draw his bow, which he did, and killed him; but coming nearer, and finding it was Cain, was wroth and angry, and slew the young man: the Arabic writers (k) tell the story with a little variation, and\"Lamech being in a wood with one of his sons, and hearing a noise in it, supposing it to be a wild beast, cast a stone, which fell upon Cain, and killed him ignorantly; and the lad that led him said, what hast thou done? thou hast killed Cain; at which being very sorrowful after the manner of penitents, he smote his hands together, and the lad standing before him, he struck his head with both his hands, and killed him unawares; and coming to his wives, Adah and Zillah, said to them, hear my word, he that slew Abel shall be avenged sevenfold, but Lamech seventy times seven, who killed a man with a cast of a stone, and a young man by clapping of his hands.''And our version, and others, imply, that he killed both a man, and a young man, or some one person or more, and that he was sorry for it, made confession of it; it was to the wounding and grief of his soul, which does not so well agree with one of the wicked race of Cain: wherefore the words may be rendered, \"though I have slain a man\" (l), that is nothing to you, you are not accountable for it, nor have any thing to fear coming upon you by reason of that; it is to my own wounding, damage, and hurt, if to any, and not to you. Some versions render it, \"I would slay a man\", &c. (m) any man, young or old, that should attack me; I fear no man: if any man wounds me, or offers to do me any hurt, I would slay him at once; I doubt not but I should be more than a match for him, be he who he will that shall set upon me, and kill him; though I might receive some slight wound, or some little hurt in the engagement, and therefore you need not be afraid of any man's hurting me. The Arabic version reads interrogatively, \"have I killed a man &c.?\" and so some others (n), I have not; with which agree the Targums of Onkelos and Jonathan,\"I have not killed a man;''for which he or his posterity should be punished, as they interpreted it; and therefore his wives had no need to fear any ill should befall him or them, or that the murder of Abel should be avenged on them, this being the seventh generation in which it was to be avenged, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wherefore it follows, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) R. Gedaliah, Shalshaleth Hakabala, fol. 74. 2. Jarchi in loc. (k) Elmacinus, p. 7. apud Hottinger. Smegma Oriental. l. 1. c. 8. p. 224, 225. (l) So the particle is sometimes used; see Nold. Part. Ebr. Concord. p. 399. (m) \"interficerem\", Vatablus; \"certe ausim interficere\", Piscator; \"sane occiderem, ant occiderim\", Muis, Rivet. (n) \"An virum inferfeci?\" De Dieu. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) R. Gedaliah, Shalshaleth Hakabala, fol. 74. 2. Jarchi in loc. (k) Elmacinus, p. 7. apud Hottinger. Smegma Oriental. l. 1. c. 8. p. 224, 225. (l) So the particle is sometimes used; see Nold. Part. Ebr. Concord. p. 399. (m) \"interficerem\", Vatablus; \"certe ausim interficere\", Piscator; \"sane occiderem, ant occiderim\", Muis, Rivet. (n) \"An virum inferfeci?\" De Dieu. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Lamech said unto his wives, Adah and Zillah, Hear my voice; ye wives of Lamech, hearken unto my speech: {r} for I have slain a man to my wounding, and a young man to my hurt.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Lamech said unto his wives, Adah and Zillah, Hear my voice; ye wives of Lamech, hearken unto my speech: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{r}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for I have slain a man to my wounding, and a young man to my hurt.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) His wives seeing that all men hated him for his cruelty, were afraid, therefore he brags that there is none strong enough to resist, even though he was already wounded.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a man for wounding me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lamech boasts that he has slain a man who had wounded him and a young man who had bruised him. Whether “a man” and “a young man” are the same person, or whether they mean a man and his son, cannot be decided. Lamech has exacted the vengeance of death for the insult of a blow2[11].",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[11] See for an explanation by Jewish tradition Appendix B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is, however, possible that the poem only describes an imaginary instance in which Lamech had retaliated in self-defence, and boasts that with the assistance of metal weapons Lamech’s capacity for revenge is increased elevenfold.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "23, 24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Song of the Sword. These verses are written in a poetical style, with the parallelism of clauses characteristic of Hebrew poetry. It is the first instance of Hebrew poetical composition in the Bible1[10]. It contains (1) the address of Lamech to his wives; (2) the announcement of a recent exploit; (3) the boast of confidence and security against injury or insult. It is generally supposed that Lamech’s Song is intended to represent his exultation after the invention of metal weapons by his son Tubal-Cain. The new possession inspired primitive man with confidence and eagerness for savage retaliation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[10] See G. Adam Smith’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Early Poetry of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 21 (Schweich Lectures, 1910).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The substance of line (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stichos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") 1 is repeated in line (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stichos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") 2: “Adah and Zillah” correspond to “Ye wives of Lamech,” and “Hear my voice” to “Hearken unto my speech.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In line (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stichos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") 3, the word “I have slain” gives the note to the whole distich; but “a man for wounding me” is repeated in greater detail in line (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stichos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") 4, “a young man for bruising me.” Line (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stichos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") 5 mentions the traditional vengeance promised for Cain; line (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stichos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") 6 boasts of a vengeance tenfold greater than this for Lamech.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 23, 24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Lamech said unto his wives",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words have an archaic simplicity which bespeak a high antiquity (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Havernick's 'Introd.,' p. 105), naturally fall into that peculiar form of parallelism which is a well-known characteristic of Hebrew poetry, and on this account, as well as from the subject, have been aptly denominated ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The Song of the Sword",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Ewald, p. 267). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Adah and gillah, Hear my voice;Ye wives of Lamech, hearken unto my speech:For I have slain a mum to my wounding (for my wound),And a young man to my hurt (because of my strife).If (for) Cain shall be avenged sevenfold,Truly (and) Lamech seventy and sevenfold.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Adah and gillah, Hear my voice;",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Ye wives of Lamech, hearken unto my speech:",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "For I have slain a mum to my wounding (for my wound),",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And a young man to my hurt (because of my strife).",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "If (for) Cain shall be avenged sevenfold,",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Truly (and) Lamech seventy and sevenfold.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Origen wrote two whole books of his commentary on Genesis on this song, and at last pronounced it inexplicable. The chief difficulty in its exegesis concerns the sense in which the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כִּי הָרַגְתִּי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are to be taken. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If the verb be rendered as a preterit (LXX., Vulgate, Syriac, Kalisch, Murphy, Alford, Jamieson, Luther), then Lamech is represented as informing his wives that in self-defense he has slain a young man who wounded him (not two men, as some read), but that there is no reason to apprehend danger on that account; for if God had promised to avenge Cain sevenfold, should any one kill him, he, being not a willful murderer, but at worst a culpable homicide, would be avenged seventy and sevenfold. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If the verb be regarded as a future (Aben Ezra, Calvin, Kiel, Speaker's. \"The preterit stands for the future... (4) In protestations and assurances in which the mind of the speaker views the action as already accomplished, being as good as done\" - Gesenius, 'Hebrews Gram.,'§ 126), then the father of Tubal-cain is depicted as exulting in the weapons which his son's genius had invented, and with boastful arrogance threatening death to the first man that should injure him, impiously asserting that by means of these same weapons he would exact upon his adversary a vengeance ten times greater than that which had been threatened against the murderer of Cain. Considering the character of the speaker and the spirit of the times, it is probable that this is the correct interpretation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A third interpretation proposes to understand the words of Lamech hypothetically, as thus: - \"If I should slay a man, then,\" &c. (Lunge, Bush); but this does not materially differ from the first, only putting the case conditionally, which the first asserts categorically. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A fourth gives to ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כִּי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the force of a question (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Stanley Leathes, ' Hebrews Gram.,' p. 202), and imagines Lamech to be assuring his wives, who are supposed to have been apprehensive of some evil befalling their husband through the use of Tubal-cain's dangerous weapons, that there was no cause for their anxieties and alarms, as he had not slain a man, that he should be wounded, or a young man, that he should be hurt; but this interpretation, it may be fairly urged, is too strained to be even probably correct. Genesis 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The family of the Cainites. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The geographical situation of the land of Nod, in the front of Eden (קדמת, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), where Cain settled after his departure from the place or the land of the revealed presence of God (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), cannot be determined. The name Nod denotes a land of flight and banishment, in contrast with Eden, the land of delight, where Jehovah walked with men. There Cain knew his wife. The text assumes it as self-evident that she accompanied him in his exile; also, that she was a daughter of Adam, and consequently a sister of Cain. The marriage of brothers and sisters was inevitable in the case of the children of the first men, if the human race was actually to descend from a single pair, and may therefore be justified in the face of the Mosaic prohibition of such marriages, on the ground that the sons and daughters of Adam represented not merely the family but the genus, and that it was not till after the rise of several families that the bands of fraternal and conjugal love became distinct from one another, and assumed fixed and mutually exclusive forms, the violation of which is sin. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) His son he named Hanoch (consecration), because he regarded his birth as a pledge of the renovation of his life. For this reason he also gave the same name to the city which he built, inasmuch as its erection was another phase in the development of his family. The construction of a city by Cain will cease to surprise us, if we consider that at the commencement of its erection, centuries had already passed since the creation of man, and Cain's descendants may by this time have increased considerably in numbers; also, that עיר does not necessarily presuppose a large town, but simply an enclosed space with fortified dwellings, in contradistinction to the isolated tents of shepherds; and lastly, that the words בנה ויהי, \"he was building,\" merely indicate the commencement and progress of the building, but not its termination. It appears more surprising that Cain, who was to be a fugitive and a vagabond upon the earth, should have established himself in the land of Nod. This cannot be fully explained, either on the ground that he carried on the pursuits of agriculture, which lead to settled abodes, or that he strove against the curse. In addition to both the facts referred to, there is also the circumstance, that the curse, \"the ground shall not yield to thee her strength,\" was so mollified by the grace of God, that Cain and his descendants were enabled to obtain sufficient food in the land of his settlement, though it was by dint of hard work and strenuous effort; unless, indeed, we follow Luther and understand the curse, that he should be a fugitive upon the earth, as relating to his expulsion from Eden, and his removal ad incertum locum et opus, non addita ulla vel promissione vel mandato, sicut avis quae in libero caelo incerta vagatur. The fact that Cain undertook the erection of a city, is also significant. Even if we do not regard this city as \"the first foundation-stone of the kingdom of the world, in which the spirit of the beast bears sway,\" we cannot fail to detect the desire to neutralize the curse of banishment, and create for his family a point of unity, as a compensation for the loss of unity in fellowship with God, as well as the inclination of the family of Cain for that which was earthly.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The powerful development of the worldly mind and of ungodliness among the Cainites was openly displayed in Lamech, in the sixth generation. Of the intermediate links, the names only are given. (On the use of the passive with the accusative of the object in the clause \"to Hanoch was born (they bore) Irad,\" see Ges. 143, 1.) Some of these names resemble those of the Sethite genealogy, viz., Irad and Jared, Mehujael and Mahalaleel, Methusael and Methuselah, also Cain and Cainan; and the names Enoch and Lamech occur in both families. But neither the recurrence of similar names, nor even of the same names, warrants the conclusion that the two genealogical tables are simply different forms of one primary legend. For the names, though similar in sound, are very different in meaning. Irad probably signifies the townsman, Jared, descent, or that which has descended; Mehujael, smitten of God, and Mahalaleel, praise of God; Methusael, man of prayer, and Methuselah, man of the sword or of increase. The repetition of the two names Enoch and Lamech even loses all significance, when we consider the different places which they occupy in the respective lines, and observe also that in the case of these very names, the more precise descriptions which are given so thoroughly establish the difference of character in the two individuals, as to preclude the possibility of their being the same, not to mention the fact, that in the later history the same names frequently occur in totally different families; e.g., Korah in the families of Levi (Exodus 6:21) and Esau (Genesis 36:5); Hanoch in those of Reuben (Genesis 46:9) and Midian (Genesis 25:4); Kenaz in those of Judah (Numbers 32:12) and Esau (Genesis 36:11). The identity and similarity of names can prove nothing more than that the two branches of the human race did not keep entirely apart from each other; a fact established by their subsequently intermarrying. - Lamech took two wives, and thus was the first to prepare the way for polygamy, by which the ethical aspect of marriage, as ordained by God, was turned into the lust of the eye and lust of the flesh. The names of the women are indicative of sensual attractions: Adah, the adorned; and Zillah, either the shady or the tinkling. His three sons are the authors of inventions which show how the mind and efforts of the Cainites were directed towards the beautifying and perfecting of the earthly life. Jabal (probably  equals  jebul, produce) became the father of such as dwelt in tents, i.e., of nomads who lived in tents and with their flocks, getting their living by a pastoral occupation, and possibly also introducing the use of animal food, in disregard of the divine command (Genesis 1:29). Jubal (sound), the father of all such as handle the harp and pipe, i.e., the inventors of stringed and wind instruments. כּנּור a guitar or harp; עוּגב the shepherd's reed or bagpipe. Tubal-Cain, \"hammering all kinds of cutting things (the verb is to be construed as neuter) in brass and iron;\" the inventor therefore of all kinds of edge-tools for working in metals: so that Cain, from קין to forge, is probably to be regarded as the surname which Tubal received on account of his inventions. The meaning of Tubal is obscure; for the Persian Tupal, iron-scoria, can throw no light upon it, as it must be a much later word. The allusion to the sister of Tubal-Cain is evidently to be attributed to her name, Naamah, the lovely, or graceful, since it reflects the worldly mind of the Cainites. In the arts, which owed their origin to Lamech's sons, this disposition reached its culminating point; and it appears in the form of pride and defiant arrogance in the song in which Lamech celebrates the inventions of Tubal-Cain (Genesis 4:23, Genesis 4:24): \"Adah and Zillah, hear my voice; ye wives of Lamech, hearken unto my speech: Men I slay for my wound, and young men for my stripes. For sevenfold is Cain avenged, and Lamech seven and seventy-fold.\" The perfect הרגתּי is expressive not of a deed accomplished, but of confident assurance (Ges. 126, 4; Ewald, 135c); and the suffixes in חבּרתי and פּצעי are to be taken in a passive sense. The idea is this: whoever inflicts a wound or stripe on me, whether man or youth, I will put to death; and for every injury done to my person, I will take ten times more vengeance than that with which God promised to avenge the murder of my ancestor Cain. In this song, which contains in its rhythm, its strophic arrangement of the thoughts, and its poetic diction, the germ of the later poetry, we may detect \"that Titanic arrogance, of which the Bible says that its power is its god (Habakkuk 1:11), and that it carries its god, viz., its sword, in its hand (Job 12:6)\" (Delitzsch). - According to these accounts, the principal arts and manufactures were invented by the Cainites, and carried out in an ungodly spirit; but they are not therefore to be attributed to the curse which rested upon the family. They have their roots rather in the mental powers with which man was endowed for the sovereignty and subjugation of the earth, but which, like all the other powers and tendencies of his nature, were pervaded by sin, and desecrated in its service. Hence these inventions have become the common property of humanity, because they not only may promote its intended development, but are to be applied and consecrated to this purpose for the glory of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The powerful development of the worldly mind and of ungodliness among the Cainites was openly displayed in Lamech, in the sixth generation. Of the intermediate links, the names only are given. (On the use of the passive with the accusative of the object in the clause \"to Hanoch was born (they bore) Irad,\" see Ges. 143, 1.) Some of these names resemble those of the Sethite genealogy, viz., Irad and Jared, Mehujael and Mahalaleel, Methusael and Methuselah, also Cain and Cainan; and the names Enoch and Lamech occur in both families. But neither the recurrence of similar names, nor even of the same names, warrants the conclusion that the two genealogical tables are simply different forms of one primary legend. For the names, though similar in sound, are very different in meaning. Irad probably signifies the townsman, Jared, descent, or that which has descended; Mehujael, smitten of God, and Mahalaleel, praise of God; Methusael, man of prayer, and Methuselah, man of the sword or of increase. The repetition of the two names Enoch and Lamech even loses all significance, when we consider the different places which they occupy in the respective lines, and observe also that in the case of these very names, the more precise descriptions which are given so thoroughly establish the difference of character in the two individuals, as to preclude the possibility of their being the same, not to mention the fact, that in the later history the same names frequently occur in totally different families; e.g., Korah in the families of Levi (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 6:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and Esau (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 36:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); Hanoch in those of Reuben (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 46:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and Midian (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); Kenaz in those of Judah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 32:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and Esau (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 36:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The identity and similarity of names can prove nothing more than that the two branches of the human race did not keep entirely apart from each other; a fact established by their subsequently intermarrying. - Lamech took two wives, and thus was the first to prepare the way for polygamy, by which the ethical aspect of marriage, as ordained by God, was turned into the lust of the eye and lust of the flesh. The names of the women are indicative of sensual attractions: Adah, the adorned; and Zillah, either the shady or the tinkling. His three sons are the authors of inventions which show how the mind and efforts of the Cainites were directed towards the beautifying and perfecting of the earthly life. Jabal (probably  equals  jebul, produce) became the father of such as dwelt in tents, i.e., of nomads who lived in tents and with their flocks, getting their living by a pastoral occupation, and possibly also introducing the use of animal food, in disregard of the divine command (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Jubal (sound), the father of all such as handle the harp and pipe, i.e., the inventors of stringed and wind instruments. כּנּור a guitar or harp; עוּגב the shepherd's reed or bagpipe. Tubal-Cain, \"hammering all kinds of cutting things (the verb is to be construed as neuter) in brass and iron;\" the inventor therefore of all kinds of edge-tools for working in metals: so that Cain, from קין to forge, is probably to be regarded as the surname which Tubal received on account of his inventions. The meaning of Tubal is obscure; for the Persian Tupal, iron-scoria, can throw no light upon it, as it must be a much later word. The allusion to the sister of Tubal-Cain is evidently to be attributed to her name, Naamah, the lovely, or graceful, since it reflects the worldly mind of the Cainites. In the arts, which owed their origin to Lamech's sons, this disposition reached its culminating point; and it appears in the form of pride and defiant arrogance in the song in which Lamech celebrates the inventions of Tubal-Cain (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): \"Adah and Zillah, hear my voice; ye wives of Lamech, hearken unto my speech: Men I slay for my wound, and young men for my stripes. For sevenfold is Cain avenged, and Lamech seven and seventy-fold.\" The perfect הרגתּי is expressive not of a deed accomplished, but of confident assurance (Ges. 126, 4; Ewald, 135c); and the suffixes in חבּרתי and פּצעי are to be taken in a passive sense. The idea is this: whoever inflicts a wound or stripe on me, whether man or youth, I will put to death; and for every injury done to my person, I will take ten times more vengeance than that with which God promised to avenge the murder of my ancestor Cain. In this song, which contains in its rhythm, its strophic arrangement of the thoughts, and its poetic diction, the germ of the later poetry, we may detect \"that Titanic arrogance, of which the Bible says that its power is its god (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and that it carries its god, viz., its sword, in its hand (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")\" (Delitzsch). - According to these accounts, the principal arts and manufactures were invented by the Cainites, and carried out in an ungodly spirit; but they are not therefore to be attributed to the curse which rested upon the family. They have their roots rather in the mental powers with which man was endowed for the sovereignty and subjugation of the earth, but which, like all the other powers and tendencies of his nature, were pervaded by sin, and desecrated in its service. Hence these inventions have become the common property of humanity, because they not only may promote its intended development, but are to be applied and consecrated to this purpose for the glory of God. ",
            "children": []
          }
        ]
      }
    ]
  }
]