[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:19-24 One of Cain's wicked race is the first recorded, as having broken the law of marriage. Hitherto, one man had but one wife at a time; but Lamech took two. Wordly things, are the only things that carnal, wicked people set their hearts upon, and are most clever and industrious about. So it was with this race of Cain. Here was a father of shepherds, and a father of musicians, but not a father of the faithful. Here is one to teach about brass and iron, but none to teach the good knowledge of the Lord: here are devices how to be rich, and how to be mighty, and how to be merry; but nothing of God, of his fear and service. Present things fill the heads of most. Lamech had enemies, whom he had provoked. He draws a comparison betwixt himself and his ancestor Cain; and flatters himself that he is much less criminal. He seems to abuse the patience of God in sparing Cain, into an encouragement to expect that he may sin unpunished.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In this fragment of ancient song, we have Lamek, under the strong excitement of having slain a man in self-defense, reciting to his wives the deed, and at the same time comforting them and himself with the assurance that if Cain the murderer would be avenegd sevenfold, he the manslayer in self-defense would be avenged seventy and seven-fold. This short ode has all the characteristics of the most perfect Hebrew poetry. Every pair of lines is a specimen of the Hebrew parallelism or rhythm of sentiment and style. They all belong to the synthetic, synonymous, or cognate parallel, the second member reiterating with emphasis the first. Here we observe that Lamek was a poet; one of his wives was probably a songstress, and the other had a taste for ornament. One daughter was the lovely, and three sons were the inventors of most of the arts which sustain and embellish life. This completes the picture of this remarkable family.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It has been noticed that the inventive powers were more largely developed in the line of Cain than in that of Sheth. And it has been suggested that the worldly character of the Cainites accounts for this. The Shethites contemplated the higher things of God, and therefore paid less attention to the practical arts of life. The Cainites, on the other hand, had not God in their thoughts, and therefore gave the more heed to the requisites and comforts of the present life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But besides this the Cainites, penetrating into the unknown tracts of this vast common, were compelled by circumstances to turn their thoughts to the invention of the arts by which the hardships of their condition might be abated. And as soon as they had conquered the chief difficulties of their new situation, the habits of industry and mental activity which they had acquired were turned to the embellishments of life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We have no grounds, however, for concluding that the descendants of Cain were as yet entirely and exclusively ungodly on the one hand, or on the other that the descendants of Sheth were altogether destitute of inventive genius or inattentive to its cultivation. With the exception of the assault that seemed to have provoked the homicidal act of Lamek, and the bigamy of Lamek himself, we find not much to condemn in the recorded conduct of the race of Cain; and in the names of some of them we discover the remembrance and recognition of God. Habel had a keeper of cattle before Jabal. The Cainites were also an older race than the Shethites. And when Noah was commissioned to build the ark, we have no reason to doubt that he was qualified in some measure by natural ability and previous training for such a task.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The line of Cain is traced no further than the seventh generation from Adam. We cannot tell whether there were any more in that line before the flood. The design of tracing it thus far, is to point out the origin of the arts of life, and the first instances of bigamy and homicide in self-defense. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The line of Cain is traced no further than the seventh generation from Adam. We cannot tell whether there were any more in that line before the flood. The design of tracing it thus far, is to point out the origin of the arts of life, and the first instances of bigamy and homicide in self-defense. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23, 24. Lamech said unto his wives—This speech is in a poetical form, probably the fragment of an old poem, transmitted to the time of Moses. It seems to indicate that Lamech had slain a man in self-defense, and its drift is to assure his wives, by the preservation of Cain, that an unintentional homicide, as he was, could be in no danger.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " If the slaughter of Cain shall be punished in him that shall kill him, whosoever he be, my death shall be much more certainly and severely revenged by God upon any man that shall murder me. These words may be either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. A profane scoff: q.d. Since Cain, my father and pattern in murder, was so far from being punished by the hand of God, that he had a special protection from him that no man should dare to touch him, I (whose murder is not so heinous as his was) shall not fare worse than he, and therefore have no reason to fear either God or men. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. An argument or ground of his security: q.d. I am not only secured by my own puissance, but by God’s providence; which certainly will be more watchful over me, who have not committed any such horrid crime, than over him that killed his own innocent brother. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If Cain shall be avenged sevenfold, truly Lamech seventy and sevenfold. Which if understood of him as confessing and lamenting his sin of murder, the sense is, if Cain was so severely punished for killing one man, of how much sorer punishment am I deserving, and shall have, who have killed two persons, and that after I had seen the punishment of Cain, and yet took no warning by it? or if he that killed Cain, who slew his brother, was to be avenged sevenfold, or to seven generations, then how much more, or longer, shall he be avenged, that shall slay me, who have slain none, or however not designedly; and therefore you may be easy and quiet, your fears, either from God or man, are groundless. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "If Cain shall be avenged sevenfold, truly Lamech {s} seventy and sevenfold.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If Cain shall be avenged sevenfold, truly Lamech ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{s}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " seventy and sevenfold.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) He mocked at God's tolerance in Cain jesting as though God would allow no one to punish him and yet give him permission to murder others.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seventy and sevenfold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 4:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Lamech boasts that seventy and seven deaths should be the penalty of revenge if he were slain.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The first note of warfare is sounded in this fierce exultation in a deed which has exceeded the limits of self-defence and passed into the region of the blood-feud. The possession of new weapons and the lust of revenge are here recorded as the typical elements of the war spirit. “Although, technically, the law of Vengeance was satisfied by a ‘life for a life,’ yet in practice the avenging of blood was often carried to the utmost length of ruthless ferocity. For one life many were taken, the murderer and his kinsfolk together.” (Gordon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Early Traditions of Genesis,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " p. 204.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 4:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The family of the Cainites. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The geographical situation of the land of Nod, in the front of Eden (קדמת, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), where Cain settled after his departure from the place or the land of the revealed presence of God (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), cannot be determined. The name Nod denotes a land of flight and banishment, in contrast with Eden, the land of delight, where Jehovah walked with men. There Cain knew his wife. The text assumes it as self-evident that she accompanied him in his exile; also, that she was a daughter of Adam, and consequently a sister of Cain. The marriage of brothers and sisters was inevitable in the case of the children of the first men, if the human race was actually to descend from a single pair, and may therefore be justified in the face of the Mosaic prohibition of such marriages, on the ground that the sons and daughters of Adam represented not merely the family but the genus, and that it was not till after the rise of several families that the bands of fraternal and conjugal love became distinct from one another, and assumed fixed and mutually exclusive forms, the violation of which is sin. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) His son he named Hanoch (consecration), because he regarded his birth as a pledge of the renovation of his life. For this reason he also gave the same name to the city which he built, inasmuch as its erection was another phase in the development of his family. The construction of a city by Cain will cease to surprise us, if we consider that at the commencement of its erection, centuries had already passed since the creation of man, and Cain's descendants may by this time have increased considerably in numbers; also, that עיר does not necessarily presuppose a large town, but simply an enclosed space with fortified dwellings, in contradistinction to the isolated tents of shepherds; and lastly, that the words בנה ויהי, \"he was building,\" merely indicate the commencement and progress of the building, but not its termination. It appears more surprising that Cain, who was to be a fugitive and a vagabond upon the earth, should have established himself in the land of Nod. This cannot be fully explained, either on the ground that he carried on the pursuits of agriculture, which lead to settled abodes, or that he strove against the curse. In addition to both the facts referred to, there is also the circumstance, that the curse, \"the ground shall not yield to thee her strength,\" was so mollified by the grace of God, that Cain and his descendants were enabled to obtain sufficient food in the land of his settlement, though it was by dint of hard work and strenuous effort; unless, indeed, we follow Luther and understand the curse, that he should be a fugitive upon the earth, as relating to his expulsion from Eden, and his removal ad incertum locum et opus, non addita ulla vel promissione vel mandato, sicut avis quae in libero caelo incerta vagatur. The fact that Cain undertook the erection of a city, is also significant. Even if we do not regard this city as \"the first foundation-stone of the kingdom of the world, in which the spirit of the beast bears sway,\" we cannot fail to detect the desire to neutralize the curse of banishment, and create for his family a point of unity, as a compensation for the loss of unity in fellowship with God, as well as the inclination of the family of Cain for that which was earthly.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The powerful development of the worldly mind and of ungodliness among the Cainites was openly displayed in Lamech, in the sixth generation. Of the intermediate links, the names only are given. (On the use of the passive with the accusative of the object in the clause \"to Hanoch was born (they bore) Irad,\" see Ges. 143, 1.) Some of these names resemble those of the Sethite genealogy, viz., Irad and Jared, Mehujael and Mahalaleel, Methusael and Methuselah, also Cain and Cainan; and the names Enoch and Lamech occur in both families. But neither the recurrence of similar names, nor even of the same names, warrants the conclusion that the two genealogical tables are simply different forms of one primary legend. For the names, though similar in sound, are very different in meaning. Irad probably signifies the townsman, Jared, descent, or that which has descended; Mehujael, smitten of God, and Mahalaleel, praise of God; Methusael, man of prayer, and Methuselah, man of the sword or of increase. The repetition of the two names Enoch and Lamech even loses all significance, when we consider the different places which they occupy in the respective lines, and observe also that in the case of these very names, the more precise descriptions which are given so thoroughly establish the difference of character in the two individuals, as to preclude the possibility of their being the same, not to mention the fact, that in the later history the same names frequently occur in totally different families; e.g., Korah in the families of Levi (Exodus 6:21) and Esau (Genesis 36:5); Hanoch in those of Reuben (Genesis 46:9) and Midian (Genesis 25:4); Kenaz in those of Judah (Numbers 32:12) and Esau (Genesis 36:11). The identity and similarity of names can prove nothing more than that the two branches of the human race did not keep entirely apart from each other; a fact established by their subsequently intermarrying. - Lamech took two wives, and thus was the first to prepare the way for polygamy, by which the ethical aspect of marriage, as ordained by God, was turned into the lust of the eye and lust of the flesh. The names of the women are indicative of sensual attractions: Adah, the adorned; and Zillah, either the shady or the tinkling. His three sons are the authors of inventions which show how the mind and efforts of the Cainites were directed towards the beautifying and perfecting of the earthly life. Jabal (probably  equals  jebul, produce) became the father of such as dwelt in tents, i.e., of nomads who lived in tents and with their flocks, getting their living by a pastoral occupation, and possibly also introducing the use of animal food, in disregard of the divine command (Genesis 1:29). Jubal (sound), the father of all such as handle the harp and pipe, i.e., the inventors of stringed and wind instruments. כּנּור a guitar or harp; עוּגב the shepherd's reed or bagpipe. Tubal-Cain, \"hammering all kinds of cutting things (the verb is to be construed as neuter) in brass and iron;\" the inventor therefore of all kinds of edge-tools for working in metals: so that Cain, from קין to forge, is probably to be regarded as the surname which Tubal received on account of his inventions. The meaning of Tubal is obscure; for the Persian Tupal, iron-scoria, can throw no light upon it, as it must be a much later word. The allusion to the sister of Tubal-Cain is evidently to be attributed to her name, Naamah, the lovely, or graceful, since it reflects the worldly mind of the Cainites. In the arts, which owed their origin to Lamech's sons, this disposition reached its culminating point; and it appears in the form of pride and defiant arrogance in the song in which Lamech celebrates the inventions of Tubal-Cain (Genesis 4:23, Genesis 4:24): \"Adah and Zillah, hear my voice; ye wives of Lamech, hearken unto my speech: Men I slay for my wound, and young men for my stripes. For sevenfold is Cain avenged, and Lamech seven and seventy-fold.\" The perfect הרגתּי is expressive not of a deed accomplished, but of confident assurance (Ges. 126, 4; Ewald, 135c); and the suffixes in חבּרתי and פּצעי are to be taken in a passive sense. The idea is this: whoever inflicts a wound or stripe on me, whether man or youth, I will put to death; and for every injury done to my person, I will take ten times more vengeance than that with which God promised to avenge the murder of my ancestor Cain. In this song, which contains in its rhythm, its strophic arrangement of the thoughts, and its poetic diction, the germ of the later poetry, we may detect \"that Titanic arrogance, of which the Bible says that its power is its god (Habakkuk 1:11), and that it carries its god, viz., its sword, in its hand (Job 12:6)\" (Delitzsch). - According to these accounts, the principal arts and manufactures were invented by the Cainites, and carried out in an ungodly spirit; but they are not therefore to be attributed to the curse which rested upon the family. They have their roots rather in the mental powers with which man was endowed for the sovereignty and subjugation of the earth, but which, like all the other powers and tendencies of his nature, were pervaded by sin, and desecrated in its service. Hence these inventions have become the common property of humanity, because they not only may promote its intended development, but are to be applied and consecrated to this purpose for the glory of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The powerful development of the worldly mind and of ungodliness among the Cainites was openly displayed in Lamech, in the sixth generation. Of the intermediate links, the names only are given. (On the use of the passive with the accusative of the object in the clause \"to Hanoch was born (they bore) Irad,\" see Ges. 143, 1.) Some of these names resemble those of the Sethite genealogy, viz., Irad and Jared, Mehujael and Mahalaleel, Methusael and Methuselah, also Cain and Cainan; and the names Enoch and Lamech occur in both families. But neither the recurrence of similar names, nor even of the same names, warrants the conclusion that the two genealogical tables are simply different forms of one primary legend. For the names, though similar in sound, are very different in meaning. Irad probably signifies the townsman, Jared, descent, or that which has descended; Mehujael, smitten of God, and Mahalaleel, praise of God; Methusael, man of prayer, and Methuselah, man of the sword or of increase. The repetition of the two names Enoch and Lamech even loses all significance, when we consider the different places which they occupy in the respective lines, and observe also that in the case of these very names, the more precise descriptions which are given so thoroughly establish the difference of character in the two individuals, as to preclude the possibility of their being the same, not to mention the fact, that in the later history the same names frequently occur in totally different families; e.g., Korah in the families of Levi (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 6:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and Esau (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 36:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); Hanoch in those of Reuben (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 46:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and Midian (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); Kenaz in those of Judah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 32:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and Esau (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 36:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The identity and similarity of names can prove nothing more than that the two branches of the human race did not keep entirely apart from each other; a fact established by their subsequently intermarrying. - Lamech took two wives, and thus was the first to prepare the way for polygamy, by which the ethical aspect of marriage, as ordained by God, was turned into the lust of the eye and lust of the flesh. The names of the women are indicative of sensual attractions: Adah, the adorned; and Zillah, either the shady or the tinkling. His three sons are the authors of inventions which show how the mind and efforts of the Cainites were directed towards the beautifying and perfecting of the earthly life. Jabal (probably  equals  jebul, produce) became the father of such as dwelt in tents, i.e., of nomads who lived in tents and with their flocks, getting their living by a pastoral occupation, and possibly also introducing the use of animal food, in disregard of the divine command (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Jubal (sound), the father of all such as handle the harp and pipe, i.e., the inventors of stringed and wind instruments. כּנּור a guitar or harp; עוּגב the shepherd's reed or bagpipe. Tubal-Cain, \"hammering all kinds of cutting things (the verb is to be construed as neuter) in brass and iron;\" the inventor therefore of all kinds of edge-tools for working in metals: so that Cain, from קין to forge, is probably to be regarded as the surname which Tubal received on account of his inventions. The meaning of Tubal is obscure; for the Persian Tupal, iron-scoria, can throw no light upon it, as it must be a much later word. The allusion to the sister of Tubal-Cain is evidently to be attributed to her name, Naamah, the lovely, or graceful, since it reflects the worldly mind of the Cainites. In the arts, which owed their origin to Lamech's sons, this disposition reached its culminating point; and it appears in the form of pride and defiant arrogance in the song in which Lamech celebrates the inventions of Tubal-Cain (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): \"Adah and Zillah, hear my voice; ye wives of Lamech, hearken unto my speech: Men I slay for my wound, and young men for my stripes. For sevenfold is Cain avenged, and Lamech seven and seventy-fold.\" The perfect הרגתּי is expressive not of a deed accomplished, but of confident assurance (Ges. 126, 4; Ewald, 135c); and the suffixes in חבּרתי and פּצעי are to be taken in a passive sense. The idea is this: whoever inflicts a wound or stripe on me, whether man or youth, I will put to death; and for every injury done to my person, I will take ten times more vengeance than that with which God promised to avenge the murder of my ancestor Cain. In this song, which contains in its rhythm, its strophic arrangement of the thoughts, and its poetic diction, the germ of the later poetry, we may detect \"that Titanic arrogance, of which the Bible says that its power is its god (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and that it carries its god, viz., its sword, in its hand (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")\" (Delitzsch). - According to these accounts, the principal arts and manufactures were invented by the Cainites, and carried out in an ungodly spirit; but they are not therefore to be attributed to the curse which rested upon the family. They have their roots rather in the mental powers with which man was endowed for the sovereignty and subjugation of the earth, but which, like all the other powers and tendencies of his nature, were pervaded by sin, and desecrated in its service. Hence these inventions have become the common property of humanity, because they not only may promote its intended development, but are to be applied and consecrated to this purpose for the glory of God. ",
            "children": []
          }
        ]
      }
    ]
  }
]