[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the Lord said unto Cain, Where is Abel thy brother?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is the beauty of these early narratives that the dealings of the Deity with mankind are all clothed in an anthropomorphic form, for the reasons of which see Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It seems, then, that Cain at first went away, scarcely conscious of the greatness of his crime. He had asserted his rights, had suppressed the usurpation of his privileges by the younger son, and if he had used force it was his brother’s fault for resisting him. So Jacob afterwards won the birthright by subtilty, and would have paid the same fearful penalty but for timely flight, and rich presents afterwards. But Cain could not quiet his conscience; remorse tracked his footsteps; and when in the household Abel came not, and the question was asked, Where is Abel? the voice of God repeated it in his own heart, Where is Abel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy brother!—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "brother still, and offspring of the same womb, even if too prosperous. But the strong-willed man resists. What has he to do with Abel? Is he “his brother’s keeper?”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 4:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Where is Abel thy brother? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not that God was ignorant where he was, but he asks him that he might convince him of his crime, and bring him to a confession of it; for those that would be justified before God, must accuse themselves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he said, I know not ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Thus in Cain, the devil was both a murderer and a liar from the beginning. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Am I my brother’s keeper? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Is he so young that he needs a guardian? Or didst thou assign any such office to me? Surely he is old enough to take care of himself, nor did I ever take charge of him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:8-15 Malice in the heart ends in murder by the hands. Cain slew Abel, his own brother, his own mother's son, whom he ought to have loved; his younger brother, whom he ought to have protected; a good brother, who had never done him any wrong. What fatal effects were these of our first parents' sin, and how must their hearts have been filled with anguish! Observe the pride, unbelief, and impenitence of Cain. He denies the crime, as if he could conceal it from God. He tries to cover a deliberate murder with a deliberate lie. Murder is a crying sin. Blood calls for blood, the blood of the murdered for the blood of the murderer. Who knows the extent and weight of a Divine curse, how far it reaches, how deep it pierces? Only in Christ are believers saved from it, and inherit the blessing. Cain was cursed from the earth. He found his punishment there where he chose his portion, and set his heart. Every creature is to us what God makes it, a comfort or a cross, a blessing or a curse. The wickedness of the wicked brings a curse upon all they do, and all they have. Cain complains not of his sin, but of his punishment. It shows great hardness of heart to be more concerned about our sufferings than our sins. God has wise and holy ends in prolonging the lives even of very wicked men. It is in vain to inquire what was the mark set upon Cain. It was doubtless known, both as a brand of infamy on Cain, and a token from God that they should not kill him. Abel, being dead, yet speaketh. He tells the heinous guilt of murder, and warns us to stifle the first risings of wrath, and teaches us that persecution must be expected by the righteous. Also, that there is a future state, and an eternal recompence to be enjoyed, through faith in Christ and his atoning sacrifice. And he tells us the excellency of faith in the atoning sacrifice and blood of the Lamb of God. Cain slew his brother, because his own works were evil, and his brother's righteous, 1Jo 3:12. In consequence of the enmity put between the Seed of the woman and the seed of the serpent, the war broke out, which has been waged ever since. In this war we are all concerned, none are neuter; our Captain has declared, He that is not with me is against me. Let us decidedly, yet in meekness, support the cause of truth and righteousness against Satan.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Where is Habel thy brother? - The interrogatory here reminds us of the question put to the hiding Adam, \"Where art thou?\" It is calculated to strike the conscience. The reply is different from that of Adam. The sin has now advanced from hasty, incautious yielding to the tempter, to reiterated and deliberate disobedience. Such a sinner must take different ground. Cain, therefore, attempts to parry the question, apparently on the vain supposition that no eye, not even that of the All-seeing, was present to witness the deed. \"I know not.\" In the madness of his confusion he goes further. He disputes the right of the Almighty to make the demand. \"Am I my brother's keeper?\" There is, as usual, an atom of truth mingled with the amazing falsehood of this surly response. No man is the absolute keeper of his brother, so as to be responsible for his safety when he is not present. This is what Cain means to insinuate. But every man is his brother's keeper so far that he is not himself to lay the hand of violence on him, nor suffer another to do so if he can hinder it. This sort of keeping the Almighty has a right to demand of every one - the first part of it on the ground of mere justice, the second on that of love. But Cain's reply betrays a desperate resort to falsehood, a total estrangement of feeling, a quenching of brotherly love, a predominence of that selfishness which freezes affection and kindles hatred. This is the way of Cain Jde 1:11.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. I know not—a falsehood. One sin leads to another.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Where is Abel?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not that God was ignorant where he was, but partly to convince him of his sin, and to lead him to repentance, and partly to instruct judges to inquire into causes, and hear the accused speak for themselves, before they pass sentence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy brother, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whom nature and near relation obliged thee to love and preserve. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Am I my brother’s keeper?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Why dost thou inquire of me concerning him who is of age to look to himself? Is he such a stripling that he needs a guardian? Or didst thou ever make me his guardian? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord said unto Cain, where is Abel thy brother?.... Perhaps this was said to him the next time he came to offer, he not being with him: this question is put, not as being ignorant where he was, but in order to bring Cain to a conviction and confession of his sin, to touch his conscience with it, and fill it with remorse for it; and, for the aggravation of it, observes the relation of Abel to him, his brother: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he said, I know not; which was a downright lie; for he must know where he had left him or laid him: this shows him to be under the influence of Satan, who was a liar, and the father of lies, as well as a murderer from the beginning; and that he was so blinded by him, as to forget whom he was speaking to; that he was the omniscient God, and knew the wickedness he had done, and the falsehood he now delivered, and was capable of confronting him with both, and of inflicting just punishment on him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Am I my brother's keeper? which was very saucily and impudently spoken: it is not only put by way of interrogation, but of admiration, as Jarchi observes, as wondering at it, that God should put such a question to him, since he knew he had not the charge of his brother, and his brother was at age to take care of himself; and if not, it rather belonged to God and his providence to take care of him, and not to him: so hardened was he in his iniquity, he had stretched out his hand against his brother, and now he stretched it out against God, and ran upon him, even on the thick bosses of his buckler. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Am I my brother's keeper? which was very saucily and impudently spoken: it is not only put by way of interrogation, but of admiration, as Jarchi observes, as wondering at it, that God should put such a question to him, since he knew he had not the charge of his brother, and his brother was at age to take care of himself; and if not, it rather belonged to God and his providence to take care of him, and not to him: so hardened was he in his iniquity, he had stretched out his hand against his brother, and now he stretched it out against God, and ran upon him, even on the thick bosses of his buckler. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD said unto Cain, Where is Abel thy brother? And he said, I know not: {h} Am I my brother's keeper?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the LORD said unto Cain, Where ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Abel thy brother? And he said, I know not: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "Am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I my brother's keeper?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) This is the nature of the reprobate when they are rebuke for their hypocrisy, even to neglect God and outrage him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the Lord said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The condensed narrative does not say whether Cain tried to conceal the body of Abel, or had fled at once from the spot. Apparently Jehovah speaks to him suddenly, when at a distance from the scene of the murder. The process of interrogation may be compared with that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:9-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I know not: am I my brother’s keeper?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cain’s reply consists of (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a statement which is a falsehood; and (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a question which is defiance. “Keeper,” perhaps with reference, in a mocking tone, to Abel’s occupation as a keeper of sheep. “Am I the keeper’s keeper?”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The first words of the first murderer renounce the obligations of brotherhood. The rejection of the family bond is the negation of love; it is the spirit of murder; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the Lord said unto Cain.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"Probably soon after the event, at the next time of sacrifice, and at the usual place of offering\" (Bonar). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Where is Abel thy brother",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? \"A question fitted to go straight to the murderer's conscience, and no less fitted to rouse his wrathful jealousy, as showing how truly Abel was the beloved one\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ibid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Whether spoken by Adam (Luther), or whispered within his breast by the still small voice of conscience, or, as is most probable, uttered from between the cherubim, Cain felt that he was being examined by a Divine voice (Calvin). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (in reply) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "he said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (adding falsehood, effrontery, and even profanity to murder), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I know not: am I my brother's keeper?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The inquiry neither of ignorance nor of innocence, but the desperate resort of one who felt himself closely tracked by avenging justice and about to be convicted of his crime. \"He showeth himself ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "alyer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in saying, 'I know not; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "wicked and profane",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in thinking he could hide his sin from God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "unjust",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in denying himself to be his brother's keeper; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "obstinate and desperate in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not confessing his sin\" (Willet; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). Genesis 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Defiance grows with sin, and punishment keeps pace with guilt. Adam and Eve fear before God, and acknowledge their sin; Cain boldly denies it, and in reply to the question, \"Where is Abel thy brother?\" declares, \"I know not, am I my brother's keeper?\" God therefore charges him with his crime: \"What hast thou done! voice of thy brother's blood crying to Me from the earth.\" The verb \"crying\" refers to the \"blood,\" since this is the principal word, and the voice merely expresses the adverbial idea of \"aloud,\" or \"listen\" (Ewald, 317d). דּמים (drops of blood) is sometimes used to denote natural hemorrhage (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 12:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 20:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but is chiefly applied to blood shed unnaturally, i.e., to murder. \"Innocent blood has no voice, it may be, that is discernible by human ears, but it has one that reaches God, as the cry of a wicked deed demanding vengeance\" (Delitzsch). Murder is one of the sins that cry to heaven. \"Primum ostendit Deus se de factis hominum cognoscere utcunque nullus queratur vel accuset; deinde sibi magis charam esse homonum vitam quam ut sanguinem innoxium impune effundi sinat; tertio curam sibi piorum esse non solum quamdiu vivunt sed etiam post mortem\" (Calvin). Abel was the first of the saints, whose blood is precious in the sight of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 116:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and by virtue of his faith, he being dead yet speaketh through his blood which cried unto God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]