[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The liberal deviseth liberal things . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, as before, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "noble.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew Henry's Concise Commentary32:1-8 Christ our righteous King, and his true disciples, are evidently here intended. The consolations and graces of his Spirit are as rivers of water in this dry land; and as the overhanging rock affords refreshing shade and shelter to the weary traveller in the desert, so his power, truth, and love, yield the believer the only real protection and refreshment in the weary land through which he journeys to heaven. Christ bore the storm himself, to keep it off from us. To him let the trembling sinner flee for refuge; for he alone can protect and refresh us in every trial. See what pains sinners take in sin; they labour at it, their hearts are intent upon it, and with art they work iniquity; but this is our comfort, that they can do no more mischief than God permits. Let us seek to have our hearts more freed from selfishness. The liberal soul devises liberal things concerning God, and desires that He will grant wisdom and prudence, the comforts of his presence, the influence of his Spirit, and in due time the enjoyment of his glory.Barnes' Notes on the BibleBut the liberal - This seems also to have the force of a proverbial expression. The word 'liberal' means generous, noble, large-hearted, benevolent; a man of large views and of public spirit; a man above covetousness, avarice, and self-seeking; a man who is willing to devote himself to the welfare of his country, and to the interests of his fellow-men. It is implied here that such persons would be selected to administer the affairs of the government I under the wise and virtuous prince of whom the prophet speaks.Deviseth liberal things - He purposes those things which will tend to promote the public welfare, and not those merely which will conduce to his private ends and gratification.And by liberal things shall he stand - Margin, 'Be established.' That is, according to the connection, he shall be confirmed, or approved in the government of the virtuous king referred to. It is, however, a proposition in a general form, and means also that a man by a liberal course shall be established; that is, his character, reputation, hopes, shall be established by it. This is true now. If a man wishes to obtain permanent peace and honor, the esteem of his fellow-men, or the evidence of divine approbation, it can be best done by large and liberal schemes to advance the happiness of a dying world. He who is avaricious and narrow-minded has no happiness, and no durable reputation; he who is large-hearted and benevolent, has the approbation of the wise and good, the favor of God, and a firm and unshaken support in the trials of life, and in the agonies of death. Jamieson-Fausset-Brown Bible Commentary8. liberal—rather, \"noble-minded.\"stand—shall be approved under the government of the righteous King.Matthew Poole's Commentary He who is truly liberal and virtuous will show it by designing and practising liberal or virtuous actions; and he who doth so will not destroy himself thereby, as wicked men falsely suppose, but establish and advance himself. But this verse also, as Well as the former, is and may be otherwise rendered; And (repeat, he shall be called, as before) liberal,  who deviseth liberal things, and persisteth or continueth in liberal things. If it be thought strange that so many verses should be spent in affirming that which in effect was said Isaiah 32:5, it must be considered that these verses do not only contain an affirmation, that they should be called vile persons, or churls, or liberal that were so; but also a description of their qualities and practices, which was useful for their conviction, and for the instruction of others. Gill's Exposition of the Entire BibleBut the liberal man deviseth liberal things,.... The man of a princely spirit consults and contrives, and delivers out things worthy of a prince and governor in the church of God; he that is one of a free spirit, that is made free by the Spirit of God, and is led into the doctrines of free grace, will study to deliver out the same to others, and, as he has freely received, he will freely give, and without any sinister, selfish, and mercenary ends and views: and by liberal things shall he stand; or, \"be established\" (i); both by the doctrines of free grace he dispenses to others, to be established by and with which is a good thing; and by the free communications of the gifts and grace of the Spirit to him, to supply and furnish him yet more and more for his work; by the discoveries of the free favour of God unto him; by the enjoyment of his gracious presence in private and in public; by the blessings of a free and well ordered covenant; and, at last, by being brought to eternal glory and happiness, in which he will be settled to all eternity; or, \"on liberal things shall he stand\"; grace here, and glory hereafter. The Targum is, \"the righteous consult truth, and they upon truth shall stand.'' (i) \"stabilietur\", Gataker. Geneva Study BibleBut the liberal deviseth liberal things; and by liberal things shall he stand.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "32:1-8 Christ our righteous King, and his true disciples, are evidently here intended. The consolations and graces of his Spirit are as rivers of water in this dry land; and as the overhanging rock affords refreshing shade and shelter to the weary traveller in the desert, so his power, truth, and love, yield the believer the only real protection and refreshment in the weary land through which he journeys to heaven. Christ bore the storm himself, to keep it off from us. To him let the trembling sinner flee for refuge; for he alone can protect and refresh us in every trial. See what pains sinners take in sin; they labour at it, their hearts are intent upon it, and with art they work iniquity; but this is our comfort, that they can do no more mischief than God permits. Let us seek to have our hearts more freed from selfishness. The liberal soul devises liberal things concerning God, and desires that He will grant wisdom and prudence, the comforts of his presence, the influence of his Spirit, and in due time the enjoyment of his glory.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "But the liberal - This seems also to have the force of a proverbial expression. The word 'liberal' means generous, noble, large-hearted, benevolent; a man of large views and of public spirit; a man above covetousness, avarice, and self-seeking; a man who is willing to devote himself to the welfare of his country, and to the interests of his fellow-men. It is implied here that such persons would be selected to administer the affairs of the government I under the wise and virtuous prince of whom the prophet speaks.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Deviseth liberal things - He purposes those things which will tend to promote the public welfare, and not those merely which will conduce to his private ends and gratification.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "And by liberal things shall he stand - Margin, 'Be established.' That is, according to the connection, he shall be confirmed, or approved in the government of the virtuous king referred to. It is, however, a proposition in a general form, and means also that a man by a liberal course shall be established; that is, his character, reputation, hopes, shall be established by it. This is true now. If a man wishes to obtain permanent peace and honor, the esteem of his fellow-men, or the evidence of divine approbation, it can be best done by large and liberal schemes to advance the happiness of a dying world. He who is avaricious and narrow-minded has no happiness, and no durable reputation; he who is large-hearted and benevolent, has the approbation of the wise and good, the favor of God, and a firm and unshaken support in the trials of life, and in the agonies of death. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "8. liberal—rather, \"noble-minded.\"",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "stand—shall be approved under the government of the righteous King.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " He who is truly liberal and virtuous will show it by designing and practising liberal or virtuous actions; and he who doth so will not destroy himself thereby, as wicked men falsely suppose, but establish and advance himself. But this verse also, as Well as the former, is and may be otherwise rendered; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "And",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (repeat, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "he shall be called",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as before) ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "liberal, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " who deviseth liberal things, and persisteth or continueth in liberal things. If it be thought strange that so many verses should be spent in affirming that which in effect was said ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 32:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it must be considered that these verses do not only contain an affirmation, that they should be called ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "vile persons",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "churls",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "liberal",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that were so; but also a description of their qualities and practices, which was useful for their conviction, and for the instruction of others. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "But the liberal man deviseth liberal things,.... The man of a princely spirit consults and contrives, and delivers out things worthy of a prince and governor in the church of God; he that is one of a free spirit, that is made free by the Spirit of God, and is led into the doctrines of free grace, will study to deliver out the same to others, and, as he has freely received, he will freely give, and without any sinister, selfish, and mercenary ends and views: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and by liberal things shall he stand; or, \"be established\" (i); both by the doctrines of free grace he dispenses to others, to be established by and with which is a good thing; and by the free communications of the gifts and grace of the Spirit to him, to supply and furnish him yet more and more for his work; by the discoveries of the free favour of God unto him; by the enjoyment of his gracious presence in private and in public; by the blessings of a free and well ordered covenant; and, at last, by being brought to eternal glory and happiness, in which he will be settled to all eternity; or, \"on liberal things shall he stand\"; grace here, and glory hereafter. The Targum is, ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "\"the righteous consult truth, and they upon truth shall stand.'' ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(i) \"stabilietur\", Gataker. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "But the liberal deviseth liberal things; and by liberal things shall he stand.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But the liberal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the noble man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "deviseth liberal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "noble",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") things—and thereby evinces genuine nobility.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by liberal things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …] Better: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in noble things doth he continue",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (nearly as R.V.). His generous impulses are sustained in his conduct.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "By liberal things shall he stand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to liberal things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Hebrew will bear either sense. SECTION IX. FURTHER DENUNCIATIONS OF ISRAEL, JOINED WITH PROMISES (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:9-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Isaiah 32:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A third fruit of the blessing is the naming and treating of every one according to his true character. \"The fool will no more be called a nobleman, nor the crafty a gentleman. For a fool speaks follies, and his heart does godless things, to practise tricks and to speak error against Jehovah, to leave the soul of hungry men empty, and to withhold the drink of thirsty ones. And the craft of a crafty man is evil, who devises stratagems to destroy suffering ones by lying words, even when the needy exhibits his right. But a noble man devises noble things, and to noble things he adheres.\" Nobility of birth and wealth will give place to nobility of character, so that the former will not exist or not be recognised without the latter. Nâdı̄bh is properly one who is noble in character, and then, dropping the ethical meaning, one who is noble by rank. The meaning of the word generosus follows the same course in the opposite direction. Shōă‛ is the man who is raised to eminence by the possession of property; the gentleman, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 34:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet explains for himself in what sense he uses the words nâbhâl and kı̄lai. We see from his explanation that kı̄lai neither signifies the covetous, from kūl (Saad.), nor the spendthrift, from killâh (Hitzig). Jerome gives the correct rendering, viz., fraudulentus; and Rashi and Kimchi very properly regard it as a contraction of nekhı̄lai. It is an adjective form derived from כּיל  equals  נכיל, like שׂיא  equals  נשׂיא (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The form כּלי in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used interchangeably with this, merely for the sake of the resemblance in sound to כּליו (machinatoris machinae pravae). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", commencing with ki (for), the fact that the nâbhâl (fool) and kı̄lai (crafty man) will lose their titles of honour, is explained on the simple ground that such men are utterly unworthy of them. Nâbhâl is a scoffer at religion, who thinks himself an enlightened man, and yet at the same time has the basest heart, and is a worthless egotist. The infinitives with Lamed show in what the immorality ('âven) consists, with which his heart is so actively employed. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ūbhedabbēr (\"and if he speak\") is equivalent to, \"even in the event of a needy man saying what is right and well founded:\" Vâv  equals  et in the sense of etiam ((cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); according to Knobel, it is equivalent to et quidem, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 4:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; whereas Ewald regards it as Vav conj. (283, d), \"and by going to law with the needy,\" but את־אביון would be the construction in this case (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not only does the noble man devise what is noble, but as such (הוּא) he adheres to it. We might also adopt this explanation, \"It is not upon gold or upon chance that he rises;\" but according to the Arabic equivalents, qūm signifies persistere here. ",
        "children": []
      }
    ]
  }
]