[{"header":"Jephthah’s Dispute with the Tribe of Ephraim"},{"num":12,"verse":"A little while later, the army of Ephraim was mustered, and they crossed to Zaphon. They confronted Jephthah and asked, “Why did you cross over to fight the Ammonites without calling us to accompany you? We’re going to burn your house down around you!”"},{"num":2,"verse":"But Jephthah replied to them, “My army and I were engaged in a serious fight with the Ammonites. I called for you, but you didn’t deliver me from their control. "},{"num":3,"verse":"When I saw that you wouldn’t be delivering me, I took my own life in my hands, crossed over to fight the Ammonites, and the Lord gave them into my control. So why have you come here today to fight me?” "},{"num":4,"verse":"Then Jephthah mustered all the men of Gilead, fought the tribe of Ephraim, and defeated them, because they had been claiming, “You descendants of Gilead are fugitives in the midst of the tribes of Ephraim and Manasseh.”"},{"header":"Shibboleth vs. Sibboleth"},{"num":5,"verse":"The descendants of Gilead seized control of the Jordan River’s fords along the border of Ephraim’s territory. Later on, when any fugitive from Ephraim asked them, “Let me cross over,” the men from Gilead would ask him, “Are you an Ephraimite?” If he said “No,” "},{"num":6,"verse":"they would order him, “Pronounce the word ‘Shibboleth’ right now.” If he said “Sibboleth,” not being able to pronounce it correctly, they would seize him and slaughter him there at the fords of the Jordan River. During those days 42,000 descendants of Ephraim died that way. "},{"num":7,"verse":"Jephthah governed Israel for six years. Then Jephthah died and was buried somewhere in the cities of Gilead."},{"header":"Ibzan, Israel’s Ninth Judge"},{"num":8,"verse":"After he died, Ibzan from Bethlehem governed Israel for ten years. "},{"num":9,"verse":"He had 30 sons and 30 daughters, but he gave his daughters in marriage to outsiders and brought in 30 outsiders for his sons. He governed Israel for seven years, "},{"num":10,"verse":"then he died and was buried in Bethlehem."},{"header":"Elon, Israel’s Tenth Judge"},{"num":11,"verse":"Elon the Zebulunite governed Israel after him for ten years. "},{"num":12,"verse":"Then Elon the Zebulunite died and was buried in Aijalon within the territory of Zebulun."},{"header":"Abdon, Israel’s Eleventh Judge"},{"num":13,"verse":"Hillel the Pirathonite’s son Abdon governed Israel after him. "},{"num":14,"verse":"He had 40 sons and 30 grandsons who rode on 70 donkeys. He governed Israel for eight years. "},{"num":15,"verse":"Then he died and was buried at Pirathon in the territory of Ephraim, in the mountainous region of the Amalekites."}]