[{"num":12,"verse":"Then the men of Ephraim were summoned and crossed over to Zaphon. They said to Jephthah, “Why did you cross over to fight against the children of Ammon without calling us to go with you? We will burn your house over you with fire.” "},{"num":2,"verse":"So Jephthah responded to them, “I and my people were in a bitter conflict with the children of Ammon, yet when I called you, you didn’t deliver me from their hand. "},{"num":3,"verse":"So when I saw that you weren’t going to deliver, I put my life in my hand and crossed over against the children of Ammon, and Adonai gave them into my hand. So why have you come up to me today, to fight me?”"},{"num":4,"verse":"Then Jephthah gathered all the men of Gilead and fought Ephraim. The men of Gilead defeated Ephraim, because they said, “You Gileadites are just fugitives of Ephraim in the midst of Ephraim and in the midst of Manasseh.” "},{"num":5,"verse":"The Gileadites captured the fords of the Jordan opposite Ephraim. So when any of the fugitives of Ephraim said, “Let me cross over,” the men of Gilead would ask him, “Are you an Ephraimite?” If he said, “No,” "},{"num":6,"verse":"then they would say to him, “Say now, ‘Shibboleth,’” and he said “Sibboleth” since he could not pronounce it right, then they would seize him and slay him at the fords of the Jordan. At that time 42,000 of Ephraim fell."},{"num":7,"verse":"Jephthah judged Israel six years. Then Jephthah the Gileadite died and was buried in one of the towns of Gilead. "},{"num":8,"verse":"After him Ibzan of Bethlehem judged Israel. "},{"num":9,"verse":"Now he had 30 sons, and 30 daughters—he sent them outside and brought in 30 girls from outside for his sons. He judged Israel seven years, "},{"num":10,"verse":"then Ibzan died and was buried in Bethlehem."},{"num":11,"verse":"Then after him Elon the Zebulunite judged Israel. He judged Israel ten years, "},{"num":12,"verse":"then Elon the Zebulunite died and was buried in Aijalon in the land of Zebulun. "},{"num":13,"verse":"After him Abdon son of Hillel the Pirathonite judged Israel. "},{"num":14,"verse":"He had 40 sons and 30 grandsons who rode on 70 donkeys, and he judged Israel eight years. "},{"num":15,"verse":"Then Abdon son of Hillel the Pirathonite died and was buried in Pirathon in the land of Ephraim, in the hill country of the Amalekites."}]