[{"num":1,"verse":"Paul, an apostle of Christ Jesus by the will of God in-relation-to the promise of life in Christ Jesus, "},{"num":2,"verse":"to Timothy, beloved child: Grace, mercy, peace from God the Father and Christ Jesus our Lord."},{"header":"I Give Thanks For Your Sincere Faith, And Remind You To Rekindle The Gift of God In You"},{"num":3,"verse":"I have gratitude to God, Whom I have served from my ancestors with a clean conscience, as I have unceasing remembrance concerning you in my prayers by night and by day— "},{"num":4,"verse":"yearning to see you, having remembered your tears, in order that I may be filled with joy; "},{"num":5,"verse":"having received a reminder of the sincere faith in you which first dwelt in your grandmother Lois and your mother Eunice. And I am convinced that it is also in you, "},{"num":6,"verse":"for which reason I am reminding you to be rekindling the gift of God which is in you through the laying-on of my hands. "},{"num":7,"verse":"For God did not give us a spirit of fearfulness, but of power and love and a sound-mind."},{"header":"Suffer Hardship With Me For The Gospel. Hold The Teachings In Faith And Love"},{"num":8,"verse":"Therefore, do not be ashamed-of the testimony of our Lord nor me His prisoner, but suffer-hardship-with me for the good-news according-to the power of God: "},{"num":9,"verse":"the One having saved us and called us with a holy calling, not according-to our works but according to His own purpose and grace— it having been given to us in Christ Jesus before eternal times "},{"num":10,"verse":"but now having been revealed through the appearance of our Savior Christ Jesus, He having abolished death and brought-to-light life and immortality through the good-news "},{"num":11,"verse":"for which I was appointed a proclaimer and apostle and teacher, "},{"num":12,"verse":"for which reason I also am suffering these things. But I am not ashamed, for I know in Whom I have believed and am convinced that He is able to guard my deposit until that day. "},{"num":13,"verse":"Be holding the pattern of healthy words which you heard from me in the faith and love which are in Christ Jesus. "},{"num":14,"verse":"Guard the good deposit through the Holy Spirit dwelling in us."},{"header":"For Some Have Turned Away From Me. But Not All"},{"num":15,"verse":"You know this— that all the ones in Asia turned-away-from me, among whom are Phygelus and Hermogenes. "},{"num":16,"verse":"May the Lord grant mercy to the household of Onesiphorus, because he often refreshed me and was not ashamed-of my chain, "},{"num":17,"verse":"but having come-to-be in Rome, he sought me diligently and found me. "},{"num":18,"verse":"May the Lord grant him to find mercy from the Lord on that day. And you know very-well how many things he ministered in Ephesus."}]