[{"header":"Greeting and Thanksgiving"},{"num":1,"verse":"Paul, an apostle of Christ Jesus by the will of God, in accordance with the promise of life, which is in Christ Jesus,"},{"num":2,"verse":"To Timothy, my child, whom I love:"},{"num":3,"verse":"I thank God, whom I serve with a clean conscience as my ancestors did, as I constantly remember you in my prayers night and day. "},{"num":4,"verse":"When I remember your tears, I long to see you, so that I may be filled with joy. "},{"num":5,"verse":"I remember your sincere faith, which first lived in your grandmother Lois and your mother Eunice, and I am convinced that it also lives in you."},{"header":"Guard the Gospel"},{"num":6,"verse":"For this reason I am reminding you to fan into flame the gift of God, which is in you through the laying on of my hands. "},{"num":7,"verse":"For God did not give us a timid spirit, but a spirit of power and love and sound judgment. "},{"num":8,"verse":"So do not be ashamed of the testimony about our Lord or of me his prisoner. Instead, join with me in suffering for the gospel while relying on the power of God. "},{"num":9,"verse":"He saved us and called us with a holy calling, not because of our works, but because of his own purpose and grace. This grace was given to us in Christ Jesus before time began, "},{"num":10,"verse":"and it has now been revealed through the appearance of our Savior Christ Jesus, who abolished death and brought life and immortality to light through the gospel. "},{"num":11,"verse":"For this gospel I was appointed a herald, apostle, and teacher of the Gentiles, "},{"num":12,"verse":"and that is why I am suffering these things. But I am not ashamed, because I know the one in whom I have believed, and I am convinced that he is able to guard what I have entrusted to him until that day."},{"num":13,"verse":"Hold fast to the pattern of sound words that you heard from me, with faith and love in Christ Jesus. "},{"num":14,"verse":"Through the Holy Spirit, who lives in us, guard the good deposit that was entrusted to you."},{"header":"Onesiphorus"},{"num":15,"verse":"You know that everyone in the province of Asia turned away from me, including Phygelus and Hermogenes. "},{"num":16,"verse":"May the Lord grant mercy to the household of Onesiphorus, because he refreshed me many times and was not ashamed of my chains. "},{"num":17,"verse":"On the contrary, after he arrived in Rome, he searched diligently for me and found me. "},{"num":18,"verse":"May the Lord grant that he will find mercy from the Lord on that day. And you know very well how much he did when he served in Ephesus."}]