[{"num":1,"verse":"Greetings from Paul, an apostle of Christ Jesus. I am an apostle because God wanted me to be. God sent me to tell people about the promise of life that is in Christ Jesus."},{"num":2,"verse":"To Timothy, a dear son to me."},{"header":"Thanksgiving and Encouragement"},{"num":3,"verse":"I always remember you in my prayers day and night. And in these prayers I thank God for you. He is the God my ancestors served, and I have always served him with a clear conscience."},{"num":4,"verse":"I remember that you cried for me. I want very much to see you so that I can be filled with joy."},{"num":5,"verse":"I remember your true faith. That kind of faith first belonged to your grandmother Lois and to your mother Eunice. I know you now have that same faith."},{"num":6,"verse":"That is why I want you to remember the gift God gave you. God gave you that gift when I laid my hands on you. Now I want you to use that gift and let it grow more and more, like a small flame grows into a fire."},{"num":7,"verse":"The Spirit God gave us does not make us afraid. His Spirit is a source of power and love and self-control."},{"num":8,"verse":"So don’t be ashamed to tell people about our Lord Jesus. And don’t be ashamed of me—I am in prison for the Lord. But suffer with me for the Good News. God gives us the strength to do that."},{"num":9,"verse":"God saved us and chose us to be his holy people, but not because of anything we ourselves did. God saved us and made us his people because that was what he wanted and because of his grace. That grace was given to us through Christ Jesus before time began."},{"num":10,"verse":"And now it has been shown to us in the coming of our Savior Christ Jesus. He destroyed death and showed us the way to have life. Yes, through the Good News Jesus showed us the way to have life that cannot be destroyed."},{"num":11,"verse":"I was chosen to tell people that message as an apostle and teacher."},{"num":12,"verse":"And I suffer now because of that work. But I am not ashamed, because I know the one I have put my trust in. And I am sure that he is able to protect what I have put into his care until that Day."},{"num":13,"verse":"What you heard me teach is an example of what you should teach. Follow that model of right teaching with the faith and love we have in Christ Jesus."},{"num":14,"verse":"This teaching is a treasure that you have been trusted with. Protect it with the help of the Holy Spirit, who lives inside us."},{"num":15,"verse":"You know that everyone in Asia has left me. Even Phygelus and Hermogenes have left me."},{"num":16,"verse":"I pray that the Lord will show mercy to the family of Onesiphorus. Many times Onesiphorus encouraged me. He was not ashamed that I was in prison."},{"num":17,"verse":"No, he was not ashamed. When he came to Rome, he looked and looked for me until he found me."},{"num":18,"verse":"I pray that the Lord Jesus will make sure Onesiphorus receives mercy from the Lord God on that Day. You know how many ways this brother helped me in Ephesus."}]