[{"header":"Salutation"},{"num":1,"verse":"Paul, an apostle of Jesus Christ by the will of God, according to the promise of life which is in Christ Jesus,"},{"num":2,"verse":"To Timothy, my beloved son:"},{"header":"Loyalty to the Gospel"},{"num":3,"verse":"I thank God, whom I serve with a pure conscience as my forefathers did, as I continually remember you in my prayers night and day, "},{"num":4,"verse":"greatly desiring to see you, remembering your tears, that I may be filled with joy, "},{"num":5,"verse":"remembering the genuine faith that first lived in your grandmother Lois and your mother Eunice and that I am persuaded lives in you also."},{"num":6,"verse":"Therefore I remind you to stir up the gift of God, which is in you by the laying on of my hands. "},{"num":7,"verse":"For God has not given us the spirit of fear, but of power, and love, and self-control. "},{"num":8,"verse":"So do not be ashamed of the testimony of our Lord, nor of me, His prisoner. But share in the sufferings of the gospel by the power of God, "},{"num":9,"verse":"who has saved us and called us with a holy calling, not by our works, but by His own purpose and grace, which was given us in Christ Jesus before the world began, "},{"num":10,"verse":"but is now revealed by the appearing of our Savior, Jesus Christ, who has abolished death and has brought life and immortality to light through the gospel, "},{"num":11,"verse":"for which I was appointed a preacher, an apostle, and a teacher of the Gentiles. "},{"num":12,"verse":"For these things I suffer, but I am not ashamed, for I know whom I have believed, and am persuaded that He is able to keep that which I have committed to Him until that Day."},{"num":13,"verse":"Follow the pattern of sound teaching which you have heard from me in the faith and love that is in Christ Jesus. "},{"num":14,"verse":"Guard the treasure that was committed to you through the Holy Spirit who lives in us."},{"num":15,"verse":"You know that all those who are in Asia have turned away from me, including Phygelus and Hermogenes."},{"num":16,"verse":"May the Lord grant mercy to the house of Onesiphorus, for he often refreshed me and was not ashamed of my chains. "},{"num":17,"verse":"But when he arrived in Rome, he searched me out very diligently and found me. "},{"num":18,"verse":"May the Lord grant that he may find mercy from the Lord on that Day. You know very well how many ways he ministered to me at Ephesus."}]