[{"header":"The Birth of Jesus"},{"num":2,"verse":"At that time, Augustus Caesar sent an order that all people in the countries under Roman rule must list their names in a register. "},{"num":2,"verse":"This was the first registration; it was taken while Quirinius was governor of Syria. "},{"num":3,"verse":"And all went to their own towns to be registered."},{"num":4,"verse":"So Joseph left Nazareth, a town in Galilee, and went to the town of Bethlehem in Judea, known as the town of David. Joseph went there because he was from the family of David. "},{"num":5,"verse":"Joseph registered with Mary, to whom he was engaged and who was now pregnant. "},{"num":6,"verse":"While they were in Bethlehem, the time came for Mary to have the baby, "},{"num":7,"verse":"and she gave birth to her first son. Because there were no rooms left in the inn, she wrapped the baby with pieces of cloth and laid him in a feeding trough."},{"header":"Shepherds Hear About Jesus"},{"num":8,"verse":"That night, some shepherds were in the fields nearby watching their sheep. "},{"num":9,"verse":"Then an angel of the Lord stood before them. The glory of the Lord was shining around them, and they became very frightened. "},{"num":10,"verse":"The angel said to them, “Do not be afraid. I am bringing you good news that will be a great joy to all the people. "},{"num":11,"verse":"Today your Savior was born in the town of David. He is Christ, the Lord. "},{"num":12,"verse":"This is how you will know him: You will find a baby wrapped in pieces of cloth and lying in a feeding box.”"},{"num":13,"verse":"Then a very large group of angels from heaven joined the first angel, praising God and saying:"},{"num":15,"verse":"When the angels left them and went back to heaven, the shepherds said to each other, “Let’s go to Bethlehem. Let’s see this thing that has happened which the Lord has told us about.”"},{"num":16,"verse":"So the shepherds went quickly and found Mary and Joseph and the baby, who was lying in a feeding trough. "},{"num":17,"verse":"When they had seen him, they told what the angels had said about this child. "},{"num":18,"verse":"Everyone was amazed at what the shepherds said to them. "},{"num":19,"verse":"But Mary treasured these things and continued to think about them. "},{"num":20,"verse":"Then the shepherds went back to their sheep, praising God and thanking him for everything they had seen and heard. It had been just as the angel had told them."},{"num":21,"verse":"When the baby was eight days old, he was circumcised and was named Jesus, the name given by the angel before the baby began to grow inside Mary."},{"header":"Jesus Is Presented in the Temple"},{"num":22,"verse":"When the time came for Mary and Joseph to do what the law of Moses taught about being made pure, they took Jesus to Jerusalem to present him to the Lord. "},{"num":23,"verse":"(It is written in the law of the Lord: “Every firstborn male shall be given to the Lord.”) "},{"num":24,"verse":"Mary and Joseph also went to offer a sacrifice, as the law of the Lord says: “You must sacrifice two doves or two young pigeons.”"},{"header":"Simeon Sees Jesus"},{"num":25,"verse":"In Jerusalem lived a man named Simeon who was a good man and godly. He was waiting for the time when God would take away Israel’s sorrow, and the Holy Spirit was in him. "},{"num":26,"verse":"Simeon had been told by the Holy Spirit that he would not die before he saw the Christ promised by the Lord. "},{"num":27,"verse":"The Spirit led Simeon to the Temple. When Mary and Joseph brought the baby Jesus to the Temple to do what the law said they must do, "},{"num":28,"verse":"Simeon took the baby in his arms and thanked God:"},{"num":33,"verse":"Jesus’ father and mother were amazed at what Simeon had said about him. "},{"num":34,"verse":"Then Simeon blessed them and said to Mary, “God has chosen this child to cause the fall and rise of many in Israel. He will be a sign from God that many people will not accept "},{"num":35,"verse":"so that the thoughts of many will be made known. And the things that will happen will make your heart sad, too.”"},{"header":"Anna Sees Jesus"},{"num":36,"verse":"There was a prophetess, Anna, from the family of Phanuel in the tribe of Asher. Anna was very old. She had once been married for seven years. "},{"num":37,"verse":"Then her husband died, and she was a widow for eighty-four years. Anna never left the Temple but worshiped God, going without food and praying day and night. "},{"num":38,"verse":"Standing there at that time, she thanked God and spoke about Jesus to all who were waiting for God to free Jerusalem."},{"header":"Joseph and Mary Return Home"},{"num":39,"verse":"When Joseph and Mary had done everything the law of the Lord commanded, they went home to Nazareth, their own town in Galilee. "},{"num":40,"verse":"The little child grew and became strong. He was filled with wisdom, and God’s goodness was upon him."},{"header":"Jesus As a Boy"},{"num":41,"verse":"Every year Jesus’ parents went to Jerusalem for the Passover Feast. "},{"num":42,"verse":"When he was twelve years old, they went to the feast as they always did. "},{"num":43,"verse":"After the feast days were over, they started home. The boy Jesus stayed behind in Jerusalem, but his parents did not know it. "},{"num":44,"verse":"Thinking that Jesus was with them in the group, they traveled for a whole day. Then they began to look for him among their family and friends. "},{"num":45,"verse":"When they did not find him, they went back to Jerusalem to look for him there. "},{"num":46,"verse":"After three days they found Jesus sitting in the Temple with the teachers, listening to them and asking them questions. "},{"num":47,"verse":"All who heard him were amazed at his understanding and answers. "},{"num":48,"verse":"When Jesus’ parents saw him, they were astonished. His mother said to him, “Son, why did you do this to us? Your father and I were very worried about you and have been looking for you.”"},{"num":49,"verse":"Jesus said to them, “Why were you looking for me? Didn’t you know that I must be in my Father’s house?” "},{"num":50,"verse":"But they did not understand the meaning of what he said."},{"num":51,"verse":"Jesus went with them to Nazareth and was obedient to them. But his mother kept in her mind all that had happened. "},{"num":52,"verse":"Jesus became wiser and grew physically. People liked him, and he pleased God."}]