[{"header":"The census brings Mary and Joseph to Bethlehem"},{"num":1,"verse":"At that time a proclamation was made by Caesar Augustus that all the inhabited world should be registered. This was the first census, undertaken while Cyrenius was governor of Syria and everybody went to the town of his birth to be registered. Joseph went up from the town of Nazareth in Galilee to David’s town, Bethlehem, in Judea, because he was a direct descendant of David, to be registered with his future wife, Mary, now in the later stages of her pregnancy. So it happened that it was while they were there in Bethlehem that she came to the end of her time. She gave birth to her first child, a son. And as there was no place for them inside the inn, she wrapped him up and laid him in a manger."},{"header":"A vision comes to shepherds on the hill-side"},{"num":8,"verse":"There were some shepherds living in the same part of the country, keeping guard throughout the night over their flocks in the open fields. Suddenly an angel of the Lord stood by their side, the splendour of the Lord blazed around them, and they were terror-stricken. But the angel said to them, “Do not be afraid! Listen, I bring you glorious news of great joy which is for all the people. This very day, in David’s town, a Saviour has been born for you. He is Christ, the Lord. Let this prove it to you: you will find a baby, wrapped up and lying in a manger.”"},{"num":13,"verse":"And in a flash there appeared with the angel a vast host of the armies of Heaven, praising God, saying, “Glory to God in the highest Heaven! Peace upon earth among men of goodwill!”"},{"num":15,"verse":"When the angels left them and went back into Heaven, the shepherds said to each other, “Now let us go straight to Bethlehem and see this thing which the Lord has made known to us.”"},{"num":16,"verse":"So they came as fast as they could and they found Mary and Joseph—and the baby lying in the manger. And when they had seen this sight, they told everybody what had been said to them about the little child. And those who heard them were amazed at what the shepherds said. But Mary treasured all these things and turned them over in her mind. The shepherds went back to work, glorifying and praising God for everything that they had heard and seen, which had happened just as they had been told."},{"header":"Mary and Joseph bring their newly-born son to the Temple"},{"num":21,"verse":"At the end of the eight days, the time came for circumcising the child and he was called Jesus, the name given to him by the angel before his conception."},{"num":22,"verse":"When the “purification” time, stipulated by the Law of Moses, was completed, they brought Jesus to Jerusalem to present him to the Lord. This was to fulfil a requirement of the Law—‘Every male who opens the womb shall be called holy to the Lord’."},{"num":24,"verse":"They also offered the sacrifice prescribed by the Law—‘A pair of turtle doves, or two young pigeons’."},{"num":25,"verse":"In Jerusalem was a man by the name of Simeon. He was an upright man, devoted to the service of God, living in expectation of the “salvation of Israel”. His heart was open to the Holy Spirit, and it had been revealed to him that he would not die before he saw the Lord’s Christ. He had been led by the Spirit to go into the Temple, and when Jesus’ parents brought the child in to have done to him what the Law required, he took him up in his arms, blessed God, and said—“At last, Lord, you can dismiss your servant in peace, as you promised! For with my own eyes I have seen your salvation which you have made ready for every people—a light to show truth to the Gentiles and bring glory to your people Israel.”"},{"num":33,"verse":"The child’s father and mother were still amazed at what was said about him, when Simeon gave them his blessing. He said to Mary, the child’s mother, “This child is destined to make many fall and many rise in Israel and to set up a standard which many will attack—for he will expose the secret thoughts of many hearts. And for you ... your very soul will be pierced by a sword.”"},{"num":36,"verse":"There was also present, Anna, the daughter of Phanuel of the tribe of Asher, who was a prophetess. She was a very old woman, having had seven years’ married life and was now a widow of eighty-four. She spent her whole life in the Temple and worshipped God night and day with fastings and prayers. She came up at this very moment, praised God and spoke about Jesus to all those in Jerusalem who were expecting redemption."},{"num":39,"verse":"When they had completed all the requirements of the Law of the Lord, they returned to Galilee, to their own town of Nazareth. The child grew up and became strong and full of wisdom. And God’s blessing was upon him."},{"header":"Twelve years later: the boy Jesus goes with his parents to Jerusalem"},{"num":41,"verse":"Every year at the Passover festival Jesus’ parents used to go to Jerusalem. When he was twelve years old they went up to the city as usual for the festival. When it was over they started back home, but the boy Jesus stayed behind in Jerusalem, without his parents’ knowledge. They went a day’s journey assuming that he was somewhere in their company, and then they began to look for him among their relations and acquaintances. They failed to find him, however, and turned back to the city, looking for him as they went. Three days later, they found him—in the Temple, sitting among the teachers, listening to them and asking them questions. All those who heard him were astonished at his powers of comprehension and at the answers that he gave. When Joseph and Mary saw him, they could hardly believe their eyes, and his mother said to him, “Why have you treated us like this, my son? Here have your father and I been very worried, looking for you everywhere!”"},{"num":49,"verse":"And Jesus replied, “But why were you looking for me? Did you not know that I must be in my Father’s house?”"},{"num":50,"verse":"But they did not understand his reply. Then he went home with them to Nazareth and was obedient to them. And his mother treasured all these things in her heart. And as Jesus continued to grow in body and mind, he grew also in the love of God and of those who knew him."}]