[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:15-28 It is essential that the service of God's people be performed with a willing mind. For LOVE is the only genuine principle whence all acceptable service of God can spring. The Father seeks only such to worship him, as worship him in spirit and in truth. The carnal mind of man is enmity against God, therefore, is not capable of such spiritual worship. Hence the necessity of being born again. But numbers rest in mere forms, as tasks imposed upon them. Joshua puts them to their choice; but not as if it were indifferent whether they served God or not. Choose you whom ye will serve, now the matter is laid plainly before you. He resolves to do this, whatever others did. Those that are bound for heaven, must be willing to swim against the stream. They must not do as the most do, but as the best do. And no one can behave himself as he ought in any station, who does not deeply consider his religious duties in family relations. The Israelites agree with Joshua, being influenced by the example of a man who had been so great a blessing to them; We also will serve the Lord. See how much good great men do, by their influence, if zealous in religion. Joshua brings them to express full purpose of heart to cleave to the Lord. They must come off from all confidence in their own sufficiency, else their purposes would be in vain. The service of God being made their deliberate choice, Joshua binds them to it by a solemn covenant. He set up a monument of it. In this affecting manner Joshua took his last leave of them; if they perished, their blood would be upon their own heads. Though the house of God, the Lord's table, and even the walls and trees before which we have uttered our solemn purposes of serving him, would bear witness against us if we deny him, yet we may trust in him, that he will put his fear into our hearts, that we shall not depart from him. God alone can give grace, yet he blesses our endeavours to engage men to his service.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Choose - Service of God in sincerity and truth can only result from a free and willing allegiance of the heart. This accordingly is what Joshua invites, as Moses had done before him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14-28. Now therefore fear the Lord, and serve him in sincerity and in truth—After having enumerated so many grounds for national gratitude, Joshua calls on them to declare, in a public and solemn manner, whether they will be faithful and obedient to the God of Israel. He avowed this to be his own unalterable resolution, and urged them, if they were sincere in making a similar avowal, \"to put away the strange gods that were among them\"—a requirement which seems to imply that some were suspected of a strong hankering for, or concealed practice of, the idolatry, whether in the form of Zabaism, the fire-worship of their Chaldean ancestors, or the grosser superstitions of the Canaanites.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the Lord our God, he it is that brought us up and our fathers, out of the land of Egypt,.... When Pharaoh, the king of it, refused to let them go, yet he wrought such wonders in it and inflicted such plagues on it, as obliged Pharaoh and his people to dismiss them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from the house of bondage: where they were held in the greatest thraldom and slavery, and their lives made bitter and miserable: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and which did those great signs in our sight; meaning the wonders and marvellous things wrought before Pharaoh and his people, and in the sight of Israel, Psalm 78:11; though Abarbinel is of opinion it refers to what had been done in their sight of late in the land of Canaan, as the dividing of the waters of Jordan, the fall of the walls of Jericho, the standing still of the sun in Gibeon; but this seems not so well to agree with what follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and which did those great signs in our sight; meaning the wonders and marvellous things wrought before Pharaoh and his people, and in the sight of Israel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; though Abarbinel is of opinion it refers to what had been done in their sight of late in the land of Canaan, as the dividing of the waters of Jordan, the fall of the walls of Jericho, the standing still of the sun in Gibeon; but this seems not so well to agree with what follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and preserved us in all the way wherein we went: in the wilderness from serpents and scorpions, and beasts of prey, and from all dangers from every quarter: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and among all the people through whom we passed; through whose borders they passed, as the Edomites, Moabites, and Amorites; though the above writer seems to understand it of preservation from the dangers of their enemies in the land of Canaan. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and among all the people through whom we passed; through whose borders they passed, as the Edomites, Moabites, and Amorites; though the above writer seems to understand it of preservation from the dangers of their enemies in the land of Canaan. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For the LORD our God, he it is that brought us up and our fathers out of the land of Egypt, from the house of bondage, and which did those great signs in our sight, and preserved us in all the way wherein we went, and among all the people through whom we passed:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the Lord our God, he it is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The people ground their promises of fidelity for the future on the dealings of God with them in the past, (i) their deliverance from Egypt; (ii) the great signs wrought in that land; (iii) their preservation in the wilderness; (iv) the expulsion of the Amorites.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For the Lord our God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for Jehovah our God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see note on ver. 2). The Israelites, we may observe, were no sceptics, nor ever became such. Their sin was not open rebellion, but the attempt to engraft upon God's service conduct incompatible with it, which led in practice to the same result - a final antagonism to God. But they believed in Jehovah; they had no doubt of the miracles He had worked, nor of the fact that His protecting hand had delivered them from all their perils, and had achieved for them all their victories. Nor do we find, amid all their sins, that they ever committed themselves to a formal denial of His existence and authority. To this, in the worst times, the prophets appeal, and though Israelitish obstinacy contested their conclusions, it never disputed their premises. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Did those great signs.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Here the people, in their answer, imply the circumstances which Joshua had omitted. This remark presupposes the miraculous passage of the Red Sea and the Jordan, and the other great miracles recorded in the books of Moses and Joshua. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And among all the people through whom we passed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Hebrew is stronger, \"through ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the midst",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of whom.\" As the destruction of the Amorites is mentioned afterwards, this must refer to the safe passage of the Israelites, not only among the wandering bands of Ishmaelites in the wilderness, but along the borders of king Arad the Canaanite, of Edom, and of Moab (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 20:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). This close, yet incidental, agreement on the part of the writers of two separate books serves to establish the trustworthiness of the writers. Joshua 24:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The people responded to this appeal by declaring, with an expression of horror at idolatry, their hearty resolution to serve the Lord, who was their God, and had shown them such great mercies. The words, \"that brought us up and our fathers out of the land of Egypt, out of the house of bondage,\" call to mind the words appended to the first commandment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which they hereby promise to observe. With the clause which follows, \"who did those great signs in our sight,\" etc., they declare their assent to all that Joshua had called to their mind in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:3-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"We also\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as well as thou and thy house (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]