[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:15-28 It is essential that the service of God's people be performed with a willing mind. For LOVE is the only genuine principle whence all acceptable service of God can spring. The Father seeks only such to worship him, as worship him in spirit and in truth. The carnal mind of man is enmity against God, therefore, is not capable of such spiritual worship. Hence the necessity of being born again. But numbers rest in mere forms, as tasks imposed upon them. Joshua puts them to their choice; but not as if it were indifferent whether they served God or not. Choose you whom ye will serve, now the matter is laid plainly before you. He resolves to do this, whatever others did. Those that are bound for heaven, must be willing to swim against the stream. They must not do as the most do, but as the best do. And no one can behave himself as he ought in any station, who does not deeply consider his religious duties in family relations. The Israelites agree with Joshua, being influenced by the example of a man who had been so great a blessing to them; We also will serve the Lord. See how much good great men do, by their influence, if zealous in religion. Joshua brings them to express full purpose of heart to cleave to the Lord. They must come off from all confidence in their own sufficiency, else their purposes would be in vain. The service of God being made their deliberate choice, Joshua binds them to it by a solemn covenant. He set up a monument of it. In this affecting manner Joshua took his last leave of them; if they perished, their blood would be upon their own heads. Though the house of God, the Lord's table, and even the walls and trees before which we have uttered our solemn purposes of serving him, would bear witness against us if we deny him, yet we may trust in him, that he will put his fear into our hearts, that we shall not depart from him. God alone can give grace, yet he blesses our endeavours to engage men to his service.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Choose - Service of God in sincerity and truth can only result from a free and willing allegiance of the heart. This accordingly is what Joshua invites, as Moses had done before him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14-28. Now therefore fear the Lord, and serve him in sincerity and in truth—After having enumerated so many grounds for national gratitude, Joshua calls on them to declare, in a public and solemn manner, whether they will be faithful and obedient to the God of Israel. He avowed this to be his own unalterable resolution, and urged them, if they were sincere in making a similar avowal, \"to put away the strange gods that were among them\"—a requirement which seems to imply that some were suspected of a strong hankering for, or concealed practice of, the idolatry, whether in the form of Zabaism, the fire-worship of their Chaldean ancestors, or the grosser superstitions of the Canaanites.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the people said unto Joshua,.... A third time, that as by the mouth of two or three witnesses everything is confirmed, so by three testimonies of the same persons: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the Lord our God will we serve; as they had before declared, and to which they add: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and his voice will we obey; or his word, as the Targum, not only his word of command, but his essential Word, the Son of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and his voice will we obey; or his word, as the Targum, not only his word of command, but his essential Word, the Son of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the people said unto Joshua, The LORD our God will we serve, and his voice will we obey.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the people said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For the third time (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the representatives of the nation avow that they will serve Jehovah and hearken only to His voice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the people said unto Joshua.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The triple repetition of the promise adds to the solemnity of the occasion and the binding force of the engagement. Joshua 24:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the repeated and decided declaration of the people, \"the Lord our God will we serve, and to His voice will we hearken,\" Joshua completed the covenant with them that day. This conclusion of a covenant was really a solemn renewal of the covenant made at Sinai, like that which took place under Moses in the steppes of Moab (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"And set them a statute and right at Shechem,\" sc., through the renewal of the covenant. These words recall ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the guidance of Israel to bitter water, and the sweetening of that water by the means which the Lord pointed out to Moses, are described as setting a statute and right for Israel, and then explained by the promise, that if they would hearken to the voice of Jehovah, He would keep them from all the diseases of Egypt. And in accordance with this, by the renewal of the covenant at Shechem, there were set for Israel, a חק, i.e., a statute, which bound the people to a renewed and conscientious maintenance of the covenant, and a משׁפּט, or right, by virtue of which they might expect on this condition the fulfilment of all the covenant mercies of the Lord. ",
        "children": []
      }
    ]
  }
]