[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24:29-33 Joseph died in Egypt, but gave commandment concerning his bones, that they should not rest in their grave till Israel had rest in the land of promise. Notice also the death and burial of Joshua, and of Eleazar the chief priest. The most useful men, having served their generation, according to the will of God, one after another, fall asleep and see corruption. But Jesus, having spent and ended his life on earth more effectually than either Joshua or Joseph, rose from the dead, and saw no corruption. And the redeemed of the Lord shall inherit the kingdom he prepared for them from the foundation of the world. They will say in admiration of the grace of Jesus, Unto him that loved us, and washed us from our sins in his own blood, and hath made us kings and priests unto God and his Father, to him be glory and dominion for ever and ever. Amen.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Consult the marginal references.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That was by the sanctuary of the Lord - i. e. the spot where Abraham and Jacob had sacrificed and worshipped, and which might well be regarded by their posterity as a holy place or sanctuary. Perhaps the very altar of Abraham and Jacob was still remaining. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That was by the sanctuary of the Lord - i. e. the spot where Abraham and Jacob had sacrificed and worshipped, and which might well be regarded by their posterity as a holy place or sanctuary. Perhaps the very altar of Abraham and Jacob was still remaining. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jos 24:29, 30. His Age and Death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "29, 30. Joshua … died—Lightfoot computes that he lived seventeen, others twenty-seven years, after the entrance into Canaan. He was buried, according to the Jewish practice, within the limits of his own inheritance. The eminent public services he had long rendered to Israel and the great amount of domestic comfort and national prosperity he had been instrumental in diffusing among the several tribes, were deeply felt, were universally acknowledged; and a testimonial in the form of a statue or obelisk would have been immediately raised to his honor, in all parts of the land, had such been the fashion of the times. The brief but noble epitaph by the historian is, Joshua, \"the servant of the Lord.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they buried him in the border of his inheritance,.... In a field belonging to his estate; for they buried not in towns and cities in those times. The Greek version adds,\"and they put into the tomb, in which he was buried, the stone knives with which he circumcised the children of Israel at Gilgal, when he brought them out of Egypt;''and an Arabic writer (e) affirms the same, but without any foundation: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in Timnathserah, which is in Mount Ephraim; which was his city, and where he dwelt; and of which See Gill on Joshua 19:50; and his grave was near the city; here, they say (f), his father Nun, and Caleb also, were buried: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in Timnathserah, which is in Mount Ephraim; which was his city, and where he dwelt; and of which See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 19:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and his grave was near the city; here, they say (f), his father Nun, and Caleb also, were buried: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "on the north side of the hill of Gaash; of the brooks or valleys of Gnash mention is made in 2 Samuel 23:30; which very probably were at the bottom of this hill. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "on the north side of the hill of Gaash; of the brooks or valleys of Gnash mention is made in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which very probably were at the bottom of this hill. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Patricides, p. 31. apud Hottinger. Smegma, p. 523. (f) Cippi Heb. p. 32. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Patricides, p. 31. apud Hottinger. Smegma, p. 523. (f) Cippi Heb. p. 32. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they buried him in the border of his inheritance in Timnathserah, which is in mount Ephraim, on the north side of the hill of Gaash.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they buried him in the border of his inheritance in Timnath-serah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For the probable site of this spot, see above, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 19:50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A photograph brought out by the “Palestine Exploration Committee” gives a representation of the tomb of Joshua. “It is certainly the most striking monument in the country,” says Lieut. Conder, “and strongly recommends itself to the mind as an authentic site.” The tomb is a square chamber, with five excavations in three of its sides, the central one forming a passage leading into a second chamber beyond. A great number of lamp-niches cover the walls of the porch—upwards of 200—arranged in vertical rows. A single cavity with a niche for a lamp may be identified, it is thought, with the resting-place of the warrior-chief of Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the hill of Gaash",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This mountain is also mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 11:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Alexandrine and Arabic versions have appended to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the traditionary legend that the knives of stone, with which Joshua performed the rite of circumcision at Gilgal, were buried with him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 30.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the border of his inheritance in Timnath-Serah.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rather, perhaps, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "within",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the border. For Timnath-Serah, see note on Joshua 19:50. The burial-place of Joshua has been supposed to be identified by the Palestine Exploration Committee. Lieutenant Conder describes what he saw at Tibneh. Amid a number of tombs he found one evidently, from more than 200 lamp niches on the walls of the porch, the sepulchre of a man of distinction. The simple character of the ornamentation, he thinks, and the entire absence of it in the interior of the tomb itself, not only suggest an early date, but are in harmony with the character of the simple yet noble-minded warrior, whose tomb it is supposed to be (see Quart. Paper, oct. 1873). In later papers, however (see Oct. 1877, and Jan. 1878), Lieutenant Conder abandons Tibneh for Kerr Haris, on the ground that Jewish tradition, usually found to be correct, is in its favour. And more mature reflection has induced him to modify his former opinion as to the early date of the tombs. Until these researches commenced, the situation of the hill Gaash was unknown, though it is mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (\"the brooks\" or \"valleys of Gaash\"), and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 11:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nothing in these places serves to identify it. This passage is copied, with a few minute verbal discrepancies, into the Book of Judges (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:6-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), a strong ground, according to all ordinary haws of literary criticism, for concluding that the latter book was written after the former. This is the chain of evidence by which the authenticity of the historical books of the Scriptures is established, not, of course, beyond the reach of cavil or dispute, but to the satisfaction of practical men. The LXX. as well as the Arabic translators have added here the following words: \"There they placed with him in the sepulchre, in which they buried him there, the stone knives with which he circumcised the children of Israel in Gilgal, when he led them out from Egypt, as the Lord commanded, and they are there unto this day.\" This passage is not found in the Hebrew. And as the Arabic and the LXX. do not altogether agree, the probability seems to be that some apocryphal legend was inserted here at a very early date. Joshua 24:30",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Death and Burial of Joshua and Eleazar. - With the renewal of the covenant Joshua had ended his vocation. He did not formally lay down his office, because there was no immediate successor who had been appointed by God. The ordinary rulers of the congregation were enough, when once they were settled in Canaan, viz., the elders as heads and judges of the nation, together with the high priest, who represented the nation in its relation to God, and could obtain for it the revelation of the will of God through the right of the Urim and Thummim. In order therefore to bring the history of Joshua and his times to a close, nothing further remained than to give an account of his death, with a short reference to the fruit of his labours, and to add certain other notices for which no suitable place had hitherto presented itself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Joshua 24:29-30",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24:29-30",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Soon after these events (vv. 1-28) Joshua died, at the age of 110, like his ancestor Joseph (Genesis 50:26), and was buried in his hereditary possessions at Timnath-serah, upon the mountains of Ephraim, to the north of Mount Gaash. Timnath-serah is still in existence see at Joshua 19:50). Mount Gaash, however, has not been discovered.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Soon after these events (vv. 1-28) Joshua died, at the age of 110, like his ancestor Joseph (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 50:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and was buried in his hereditary possessions at Timnath-serah, upon the mountains of Ephraim, to the north of Mount Gaash. Timnath-serah is still in existence see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 19:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Mount Gaash, however, has not been discovered.",
            "children": []
          }
        ]
      }
    ]
  }
]