[{"num":1,"verse":"The word of Adonai came to Yonah the son of Amitai: "},{"num":2,"verse":"“Set out for the great city of Ninveh, and proclaim to it that their wickedness has come to my attention.”"},{"num":3,"verse":"But Yonah, in order to get away from Adonai, prepared to escape to Tarshish. He went down to Yafo, found a ship headed for Tarshish, paid the fare and went aboard, intending to travel with them to Tarshish and get away from Adonai. "},{"num":4,"verse":"However, Adonai let loose over the sea a violent wind, which created such stormy conditions that the ship threatened to break to pieces. "},{"num":5,"verse":"The sailors were frightened, and each cried out to his god. They threw the cargo overboard to make the ship easier for them to control."},{"num":6,"verse":"The ship’s captain found him and said to him, “What do you mean by sleeping? Get up! Call on your god! Maybe the god will remember us, and we won’t die.”"},{"num":7,"verse":"Then they said to each other, “Come, let’s draw lots to find out who is to blame for this calamity.” They drew lots, and Yonah was singled out. "},{"num":8,"verse":"They said to him, “Tell us now, why has this calamity come upon us? What work do you do? Where are you from? What is your country? Which is your people?” "},{"num":9,"verse":"He answered them, “I am a Hebrew; and I fear Adonai, the God of heaven, who made both the sea and the dry land.” "},{"num":10,"verse":"At this the men grew very afraid and said to him, “What is this that you have done?” For the men knew he was trying to get away from Adonai, since he had told them. "},{"num":11,"verse":"They asked him, “What should we do to you, so that the sea will be calm for us?” — for the sea was getting rougher all the time. "},{"num":12,"verse":"“Pick me up,” he told them, “and throw me into the sea. Then the sea will be calm for you; because I know it’s my fault that this terrible storm has come over you.”"},{"num":13,"verse":"Nevertheless, the men rowed hard, trying to reach the shore. But they couldn’t, because the sea kept growing wilder against them. "},{"num":14,"verse":"Finally they cried to Adonai, “Please, Adonai, please! Don’t let us perish for causing the death of this man, and don’t hold us to account for shedding innocent blood; because you, Adonai, have done what you saw fit.” "},{"num":15,"verse":"Then they picked up Yonah and threw him into the sea, and the sea stopped raging. "},{"num":16,"verse":"Seized with great fear of Adonai, they offered a sacrifice to Adonai and made vows."}]