[{"header":"Jonah Tries to Run Away from the Lord"},{"num":1,"verse":"The Lord spoke his word to Jonah, son of Amittai. He said, "},{"num":2,"verse":"“Leave at once for the important city, Nineveh. Announce to the people that I can no longer overlook the wicked things they have done.”"},{"num":3,"verse":"Jonah immediately tried to run away from the Lord by going to Tarshish. He went to Joppa and found a ship going to Tarshish. He paid for the trip and went on board. He wanted to go to Tarshish to get away from the Lord."},{"num":4,"verse":"The Lord sent a violent wind over the sea. The storm was so powerful that the ship was in danger of breaking up. "},{"num":5,"verse":"The sailors were afraid, and they cried to their gods for help. They began to throw the cargo overboard to lighten the ship’s load."},{"num":6,"verse":"The captain of the ship went to him and asked, “How can you sleep? Get up, and pray to your God. Maybe he will notice us, and we won’t die.”"},{"num":7,"verse":"Then the sailors said to each other, “Let’s throw dice to find out who is responsible for bringing this disaster on us.” So they threw dice, and the dice indicated that Jonah was responsible."},{"num":8,"verse":"They asked him, “Tell us, why has this disaster happened to us? What do you do for a living? Where do you come from? What country are you from? What nationality are you?”"},{"num":9,"verse":"Jonah answered them, “I’m a Hebrew. I worship the Lord, the God of heaven. He is the God who made the sea and the land.”"},{"num":10,"verse":"Then the men were terrified. They knew that he was running away from the Lord, because he had told them. They asked Jonah, “Why have you done this?”"},{"num":11,"verse":"The storm was getting worse. So they asked Jonah, “What should we do with you to calm the sea?”"},{"num":12,"verse":"He told them, “Throw me overboard. Then the sea will become calm. I know that I’m responsible for this violent storm.”"},{"num":13,"verse":"Instead, the men tried to row harder to get the ship back to shore, but they couldn’t do it. The storm was getting worse."},{"num":14,"verse":"So they cried to the Lord for help: “Please, Lord, don’t let us die for taking this man’s life. Don’t hold us responsible for the death of an innocent man, because you, Lord, do whatever you want.” "},{"num":15,"verse":"Then they took Jonah and threw him overboard, and the sea became calm. "},{"num":16,"verse":"The men were terrified of the Lord. They offered sacrifices and made vows to the Lord."},{"num":17,"verse":"The Lord sent a big fish to swallow Jonah. Jonah was inside the fish for three days and three nights."}]