[[],[{"type":"header","content":"Jonah’s Disobedience"},{"type":"prose","content":"The word of the LORD came to Jonah the son of Amittai, saying,"}],[{"type":"prose","content":"“Arise, go to Nineveh, the great city, and cry out against it, because their wickedness has come up before Me.”"}],[{"type":"prose","content":"But Jonah got up to flee to Tarshish from the presence of the LORD. So he went down to Joppa, found a ship that was going to Tarshish, paid the fare, and boarded it to go with them to Tarshish away from the presence of the LORD."}],[{"type":"prose","content":"However, the LORD hurled a great wind on the sea and there was a great storm on the sea, so that the ship was about to break up."}],[{"type":"prose","content":"Then the sailors became afraid and every man cried out to his god, and they hurled the cargo which was in the ship into the sea to lighten  for them. But Jonah had gone below into the stern of the ship, had lain down, and fallen sound asleep."}],[{"type":"prose","content":"So the captain approached him and said, “How is it that you are sleeping? Get up, call on your god! Perhaps  god will be concerned about us so that we will not perish.”"}],[{"type":"prose","content":"And each man said to his mate, “Come, let’s cast lots so that we may find out on whose account this catastrophe  us.” So they cast lots, and the lot fell on Jonah."}],[{"type":"prose","content":"Then they said to him, “Tell us, now! On whose account  this catastrophe  us? What is your occupation, and where do you come from? What is your country, and from what people are you?”"}],[{"type":"prose","content":"So he said to them, “I am a Hebrew, and I fear the LORD God of heaven who made the sea and the dry land.”"}],[{"type":"prose","content":"Then the men became extremely afraid, and they said to him, “How could you do this?” For the men knew that he was fleeing from the presence of the LORD, because he had told them."}],[{"type":"prose","content":"So they said to him, “What should we do to you so that the sea will become calm for us?”—for the sea was becoming increasingly stormy."}],[{"type":"prose","content":"And he said to them, “Pick me up and hurl me into the sea. Then the sea will become calm for you, because I know that on account of me this great storm  upon you.”"}],[{"type":"prose","content":"However, the men rowed  to return to land, but they could not, because the sea was becoming  stormier against them."}],[{"type":"prose","content":"Then they cried out to the LORD and said, “We earnestly pray, O LORD, do not let us perish on account of this man’s life, and do not put innocent blood on us; for You, LORD, have done as You pleased.”"}],[{"type":"prose","content":"So they picked up Jonah and hurled him into the sea, and the sea stopped its raging."}],[{"type":"prose","content":"Then the men became extremely afraid of the LORD, and they offered a sacrifice to the LORD and made vows."}],[{"type":"prose","content":"And the LORD designated a great fish to swallow Jonah, and Jonah was in the stomach of the fish for three days and three nights."}]]