[{"num":1,"verse":"And the word of the Lord was made to Jonah, the son of Amittai, and said,"},{"num":2,"verse":"Rise thou, and go into Nineveh, the great city, and preach thou therein, for the malice thereof goeth up before me. (Rise thou up, and go to the great city of Nineveh, and preach thou there, for the malice of the people there goeth up before me.)"},{"num":3,"verse":"And Jonah rose for to flee into Tarshish, from the face of the Lord. And he came down to Joppa, and found a ship going into Tarshish, and he gave ship-hire to them; and he went down into it, for to go with them into Tarshish, from the face of the Lord. (But Jonah rose up to flee to Tarshish, away from the Lord. And he came down to Joppa, and found a ship going to Tarshish, and he bought passage with them; and he went down into it, to go with them to Tarshish, away from the Lord.)"},{"num":4,"verse":"Forsooth the Lord sent a great wind into the sea, and a great tempest was made in the sea, and the ship was in peril for to be all-broken."},{"num":5,"verse":"And shipmen dreaded, and men cried to their god; and sent vessels, that were in the ship, into the sea, that it were made lighter of them. And Jonah went down into the inner things of the ship, and slept by a grievous sleep. (And the shipmen feared, and the men cried out to their god; and they sent vessels, or equipment, and other things, that were on the ship, into the sea, so that it was made lighter. And Jonah was down in the hold of the ship, and slept a troubled sleep.)"},{"num":6,"verse":"And the governor came to him, and said to him, Why art thou cast down in sleep? rise thou, call thy God to help, if peradventure God again-think of us, and we perish not. (And the captain came down to him, and said, Why art thou sleeping? rise thou up, call thy God to help us, and perhaps your God shall remember us, and then we shall not perish.)"},{"num":7,"verse":"And a man said to his fellows, Come ye, and cast we lots, and know we, why this evil is to us. And they cast lots, and lot fell on Jonah. (And a man said to his fellows, Come ye, and cast we lots, and then we shall know, why this evil hath come upon us. And they cast lots, and the lot fell upon Jonah.)"},{"num":8,"verse":"And they said to him, Show thou to us, for cause of what thing this evil is to us; what is thy work, which is thy land, and whither goest thou, either of what people art thou? (And they said to him, Tell thou us, for what cause, or for what reason, hath this evil come upon us; what is thy work, which is thy land, and where goest thou, and of what people art thou?)"},{"num":9,"verse":"And he said to them, I am an Hebrew, and I dread the Lord God of heaven, that made the sea and the dry land. (And he said to them, I am a Hebrew, and I fear the Lord God of heaven, who made the sea and the dry land.)"},{"num":10,"verse":"And the men dreaded with great dread, and said to him, Why didest thou this thing? for the men knew that he flew from the face of the Lord, for Jonah had showed to them. (And the men had great fear, and said to him, Why didest thou do this? for the men knew that he had fled from the Lord, for earlier Jonah had told them that.)"},{"num":11,"verse":"And they said to him, What shall we do to thee, and the sea shall cease from us? for the sea went, and waxed great on them. (And they said to him, What shall we do to thee, and then the sea shall cease from threatening us? for the sea grew great against them.)"},{"num":12,"verse":"And he said to them, Take ye me, and throw, or send me, into the sea, and the sea shall cease from you; for I know, that for me this great tempest is on you. (And he said to them, Take ye me, and throw me into the sea, and then the sea shall cease from threatening you; for I know, that it is because of me, that this great tempest hath come upon you.)"},{"num":13,"verse":"And the men rowed, for to turn again to the dry land, and they might not, for the sea went, and waxed great on them. (And the men rowed, to try to return to the dry land, but they could not, for the sea grew great against them.)"},{"num":14,"verse":"And they cried to the Lord, and said, Lord, we beseech, that we perish not in the life of this man, and that thou give not on us innocent blood; for thou, Lord, didest as thou wouldest. (And they cried out to the Lord, and said, Lord, we beseech thee, that we perish not for taking the life of this man, and that thou do not put innocent blood upon us; for all this, Lord, is as thou desirest/for all this is thy doing, Lord.)"},{"num":15,"verse":"And they took Jonah, and threw into the sea; and the sea stood of his boiling. (And then they took Jonah, and threw him into the sea; and at last the sea ceased its boiling.)"},{"num":16,"verse":"And the men dreaded the Lord with great dread, and offered hosts to the Lord, and vowed avows. (And the men feared the Lord with great fear, and offered sacrifices to the Lord, and vowed vows.)"},{"num":17,"verse":"And the Lord made ready a great fish, that he should swallow Jonah; and Jonah was in the womb of the fish three days and three nights. (And the Lord made ready a great fish, that would swallow Jonah; and then Jonah was in the womb of the fish for three days and three nights.)"}]