[{"header":"Joshua’s Charge to the Leaders"},{"num":23,"verse":"A long time later, after the Lord had given Israel rest from all their enemies around them, Joshua was old and advanced in years. "},{"num":2,"verse":"Joshua called for all Israel, their elders, clan heads, judges, and officials, and said to them, “I am old and advanced in years. "},{"num":3,"verse":"You have seen all that the Lord your God did to all these peoples before you, for it is the Lord your God who has waged war for you. "},{"num":4,"verse":"See, I have allotted to you as an inheritance the land of these peoples who remain, along with the land of the peoples whom I defeated, from the Jordan to the Mediterranean Sea in the west. "},{"num":5,"verse":"The Lord your God will drive them out and dispossess them from before you, and you will inherit their land, as the Lord your God told you."},{"num":6,"verse":"“Now be very strong to observe and enact all that is written in the Book of the Law of Moses, so that you do not deviate from it to the right or the left. "},{"num":7,"verse":"Do not assimilate with these peoples remaining among you. Do not invoke the names of their gods, nor swear by, serve, or worship them. "},{"num":8,"verse":"Instead, cling to the Lord your God, as you have done until today."},{"num":9,"verse":"“For the Lord has dispossessed before you great and mighty peoples, and as for you, not a single man has been able to stand against you until today. "},{"num":10,"verse":"One man from among you can make a thousand flee, for it is the Lord your God who wages war for you, as He told you. "},{"num":11,"verse":"Now be careful, therefore, to love the Lord your God!"},{"num":12,"verse":"“For if you should turn and cling to the remainder of these peoples who are left with you, and you intermarry and assimilate with them, and they with you, "},{"num":13,"verse":"know for certain that the Lord your God will no longer drive out these nations from before you. But they shall be snares and traps to you, a whip on your sides and thorns in your eyes, until you perish from off this good ground that the Lord your God has given you."},{"num":14,"verse":"“Now, I am going the way of all the earth. You know in all your hearts and souls that not a single word has failed out of all the good things that the Lord your God has said concerning you. All came true for you. Not a single word among them failed. "},{"num":15,"verse":"So just as every good thing that the Lord your God said to you came to be, even so the Lord can bring every bad thing upon you until He has destroyed you from this good land that the Lord your God gave you. "},{"num":16,"verse":"If you break the covenant of the Lord your God that He commanded you, and go and serve other gods and worship them, the anger of the Lord will burn against you, and you will quickly perish from the good land that He gave you.”"}]