[{"header":"Salutation"},{"num":2,"verse":"May mercy, peace, and love be multiplied to you."},{"header":"Judgment on False Teachers(A)"},{"num":3,"verse":"Beloved, while I diligently tried to write to you of the salvation we have in common, I found it necessary to write and appeal to you to contend for the faith which was once delivered to the saints. "},{"num":4,"verse":"For there are some men who secretly crept in, who were marked long ago for this condemnation. They are ungodly men, who pervert the grace of our God into immorality and deny the only Lord God and our Lord Jesus Christ."},{"num":5,"verse":"Now I want to remind you, though you already know, that the Lord saved the people out of the land of Egypt and afterward destroyed those who did not believe. "},{"num":6,"verse":"Likewise, the angels who did not keep to their first domain, but forsook their own dwelling, He has kept in everlasting chains under darkness for the judgment of the great day. "},{"num":7,"verse":"Just as Sodom and Gomorrah, and the surrounding cities in like manner, gave themselves to immorality and went after different flesh, they serve as an example by suffering the punishment of eternal fire."},{"num":8,"verse":"Likewise, these ungodly dreamers defile the flesh, reject authority, and slander celestial beings. "},{"num":9,"verse":"Yet Michael the archangel, when contending with the devil in a dispute about the body of Moses, did not dare to pronounce upon him a railing judgment. But he said, “The Lord rebuke you!” "},{"num":10,"verse":"But these men slander those things that they do not understand. But they destroy themselves in those things that, like unreasoning animals, they know by instinct."},{"num":11,"verse":"Woe to them! For they have gone in the way of Cain, have run greedily after the error of Balaam for a reward, and perished in the rebellion of Korah."},{"num":12,"verse":"These are the ones who are stains on your love feasts as they feast with you irreverently and care only for themselves. They are clouds without water, carried along by winds; autumn trees without fruit, twice dead, uprooted; "},{"num":13,"verse":"raging waves of the sea, which are foaming up their own shame; wandering stars for whom the gloom of darkness has been kept forever."},{"num":14,"verse":"Enoch, the seventh generation from Adam, also prophesied of these men, saying, “Look! The Lord is coming with ten thousand of His holy ones, "},{"num":15,"verse":"to execute judgment on everyone, and to convict all who are godless of all their wicked deeds that they have committed, and of all the terrible words that godless sinners have spoken against Him.” "},{"num":16,"verse":"These men are grumblers, complainers, who walk after their own lusts. Their mouths speak arrogant words, and they flatter others to gain profit."},{"header":"Warnings and Exhortations"},{"num":17,"verse":"But, beloved, remember the words that were previously spoken by the apostles of our Lord Jesus Christ. "},{"num":18,"verse":"They said to you, “In the last days there will be scoffers who will walk after their own ungodly desires.” "},{"num":19,"verse":"These are the men who cause divisions, sensual, devoid of the Spirit."},{"num":20,"verse":"But you, beloved, build yourselves up in your most holy faith. Pray in the Holy Spirit. "},{"num":21,"verse":"Keep yourselves in the love of God while you are waiting for the mercy of our Lord Jesus Christ, which leads to eternal life."},{"num":22,"verse":"On some have compassion, using discernment. "},{"num":23,"verse":"And others save with fear while pulling them out of the fire, hating even the garment stained by the flesh."},{"header":"Benediction"},{"num":24,"verse":"Now to Him who is able to keep you from falling and to present you blameless before the presence of His glory with rejoicing, "},{"num":25,"verse":"to the only wise God our Savior, be glory and majesty, dominion and power, both now and forever. Amen."}]