[{"num":2,"verse":"[Oh, I know, I have been rash to talk out plainly this way to God!] I will [in my thinking] stand upon my post of observation and station myself on the tower or fortress, and will watch to see what He will say within me and what answer I will make [as His mouthpiece] to the perplexities of my complaint against Him."},{"num":2,"verse":"And the Lord answered me and said, Write the vision and engrave it so plainly upon tablets that everyone who passes may [be able to] read [it easily and quickly] as he hastens by."},{"num":3,"verse":"For the vision is yet for an appointed time and it hastens to the end [fulfillment]; it will not deceive or disappoint. Though it tarry, wait [earnestly] for it, because it will surely come; it will not be behindhand on its appointed day."},{"num":4,"verse":"Look at the proud; his soul is not straight or right within him, but the [rigidly] just and the [uncompromisingly] righteous man shall live by his faith and in his faithfulness."},{"num":5,"verse":"Moreover, wine and wealth are treacherous; the proud man [the Chaldean invader] is restless and cannot stay at home. His appetite is large like that of Sheol and [his greed] is like death and cannot be satisfied; he gathers to himself all nations and collects all people as if he owned them."},{"num":6,"verse":"Shall not all these [victims of his greed] take up a taunt against him and in scoffing derision of him say, Woe to him who piles up that which is not his! [How long will he possess it?] And [woe to him] who loads himself with promissory notes for usury!"},{"num":7,"verse":"Shall [your debtors] not rise up suddenly who shall bite you, exacting usury of you, and those awake who will vex you [toss you to and fro and make you tremble violently]? Then you will be booty for them."},{"num":8,"verse":"Because you [king of Babylon] have plundered many nations, all who are left of the people shall plunder you—because of men’s blood and for the violence done to the earth, to the city and all the people who live in each city."},{"num":9,"verse":"Woe to him who obtains wicked gain for his house, [who thinks by so doing] to set his nest on high that he may be preserved from calamity and delivered from the power of evil!"},{"num":10,"verse":"You have devised shame to your house by cutting off and putting an end to many peoples, and you have sinned against and forfeited your own life."},{"num":11,"verse":"For the stone shall cry out of the wall [built in sin, to accuse you], and the beam out of the woodwork will answer it [agreeing with its charge against you]."},{"num":12,"verse":"Woe to him who builds a town with blood and establishes a city by iniquity!"},{"num":13,"verse":"Behold, is it not by appointment of the Lord of hosts that the nations toil only to satisfy the fire [that will consume their work], and the peoples weary themselves only for emptiness, falsity, and futility?"},{"num":14,"verse":"But [the time is coming when] the earth shall be filled with the knowledge of the glory of the Lord as the waters cover the sea."},{"num":15,"verse":"Woe to him who gives his neighbors drink, who pours out your bottle to them and adds to it your poisonous and blighting wrath and also makes them drunk, that you may look on their stripped condition and pour out foul shame [on their glory]!"},{"num":16,"verse":"You [yourself] will be filled with shame and contempt instead of glory. Drink also and be like an uncircumcised [heathen]! The cup [of wrath] in the Lord’s right hand will come around to you [O destroyer], and foul shame shall be upon your own glory!"},{"num":17,"verse":"For the violence done to Lebanon will cover and overwhelm you; the destruction of the animals [which the violence frightened away] will terrify you on account of men’s blood and the violence done to the land, to the city and all its inhabitants."},{"num":18,"verse":"What profit is the graven image when its maker has formed it? It is only a molten image and a teacher of lies. For the maker trusts in his own creations [as his gods] when he makes dumb idols."},{"num":19,"verse":"Woe to him who says to the wooden image, Awake! and to the dumb stone, Arise, teach! [Yet, it cannot, for] behold, it is laid over with gold and silver and there is no breath at all inside it!"},{"num":20,"verse":"But the Lord is in His holy temple; let all the earth hush and keep silence before Him."}]