[{"header":"The Lord's Answer to Habakkuk"},{"num":2,"verse":"I will climb my watchtower and wait to see what the Lord will tell me to say and what answer he will give to my complaint."},{"num":2,"verse":"The Lord gave me this answer: “Write down clearly on tablets what I reveal to you, so that it can be read at a glance. "},{"num":3,"verse":"Put it in writing, because it is not yet time for it to come true. But the time is coming quickly, and what I show you will come true. It may seem slow in coming, but wait for it; it will certainly take place, and it will not be delayed. "},{"num":4,"verse":"And this is the message: ‘Those who are evil will not survive, but those who are righteous will live because they are faithful to God.’”"},{"header":"Doom on the Unrighteous"},{"num":5,"verse":"Wealth is deceitful. Greedy people are proud and restless—like death itself they are never satisfied. That is why they conquer nation after nation for themselves. "},{"num":6,"verse":"The conquered people will taunt their conquerors and show their scorn for them. They will say, “You take what isn't yours, but you are doomed! How long will you go on getting rich by forcing your debtors to pay up?”"},{"num":7,"verse":"But before you know it, you that have conquered others will be in debt yourselves and be forced to pay interest. Enemies will come and make you tremble. They will plunder you! "},{"num":8,"verse":"You have plundered the people of many nations, but now those who have survived will plunder you because of the murders you have committed and because of your violence against the people of the world and its cities."},{"num":9,"verse":"You are doomed! You have made your family rich with what you took by violence, and have tried to make your own home safe from harm and danger! "},{"num":10,"verse":"But your schemes have brought shame on your family; by destroying many nations you have only brought ruin on yourself. "},{"num":11,"verse":"Even the stones of the walls cry out against you, and the rafters echo the cry."},{"num":12,"verse":"You are doomed! You founded a city on crime and built it up by murder. "},{"num":13,"verse":"The nations you conquered wore themselves out in useless labor, and all they have built goes up in flames. The Lord Almighty has done this. "},{"num":14,"verse":"But the earth will be as full of the knowledge of the Lord's glory as the seas are full of water."},{"num":15,"verse":"You are doomed! In your fury you humiliated and disgraced your neighbors; you made them stagger as though they were drunk. "},{"num":16,"verse":"You in turn will be covered with shame instead of honor. You yourself will drink and stagger. The Lord will make you drink your own cup of punishment, and your honor will be turned to disgrace. "},{"num":17,"verse":"You have cut down the forests of Lebanon; now you will be cut down. You killed its animals; now animals will terrify you. This will happen because of the murders you have committed and because of your violence against the people of the world and its cities."},{"num":18,"verse":"What's the use of an idol? It is only something that a human being has made, and it tells you nothing but lies. What good does it do for its maker to trust it—a god that can't even talk! "},{"num":19,"verse":"You are doomed! You say to a piece of wood, “Wake up!” or to a block of stone, “Get up!” Can an idol reveal anything to you? It may be covered with silver and gold, but there is no life in it."},{"num":20,"verse":"The Lord is in his holy Temple; let everyone on earth be silent in his presence."}]