[{"num":2,"verse":"¶ I will stand upon my watch and affirm my foot upon the fortress and will watch to see what he will say in me and what I shall answer to my question."},{"num":2,"verse":"And the LORD answered me and said, Write the vision and make it plain upon tables that he may run that reads it."},{"num":3,"verse":"For the vision is yet for an appointed time, but at the end it shall speak and not lie; though it tarry, wait for it because it will surely come; wait for it."},{"num":4,"verse":"Behold, he whose soul is not upright in him will become filled with pride, but the just in his faith shall live."},{"num":5,"verse":"¶ Even more than he who is given over to wine, the transposer, the proud man, shall not remain, who enlarges his desire as Sheol and is as death and cannot be satisfied, but gathered unto him all the Gentiles and heaps unto him all the peoples;"},{"num":6,"verse":"Shall not all these take up a parable against him and a taunting enigma against him and say, Woe to him that multiplied that which was not his! And for how long would he pile thick clay upon himself?"},{"num":7,"verse":"Shall they not rise up suddenly that shall bite thee and awake those that shall take thy place, and thou shalt be for a prey unto them?"},{"num":8,"verse":"Because thou hast spoiled many nations, all the other peoples shall spoil thee because of human blood and for the robberies of the land, of the cities, and of all that dwell therein."},{"num":9,"verse":"Woe to him that covets ill-gotten gain by violence for his house that he may set his nest on high, that he may escape from the power of evil!"},{"num":10,"verse":"Thou hast taken shameful counsel for thy house by cutting off many peoples and hast committed a sin against thy life."},{"num":11,"verse":"For the stone shall cry out from the wall, and the beam out of the timber shall answer it."},{"num":12,"verse":"Woe to him that builds the city with blood and founds the village with iniquity!"},{"num":13,"verse":"Is this not of the LORD of the hosts? Therefore the peoples shall labour for the fire, and the Gentiles shall weary themselves in vain."},{"num":14,"verse":"For the earth shall be filled with the knowledge of the glory of the LORD as the waters cover the sea."},{"num":15,"verse":"¶ Woe unto him that gives his neighbours drink, that puts thy bottle to them, and makes them drunken also, that thou may look on their nakedness!"},{"num":16,"verse":"Thou hast filled thyself with dishonour instead of honour; drink thou also, and thy foreskin shall be uncovered; the cup of the LORD’s right hand shall be turned unto thee, and shameful vomit shall fall upon thy glory."},{"num":17,"verse":"For the violence of Lebanon shall fall upon thee and the destruction of the wild beasts shall break thee, because of the human blood, and of the robbery of the land, of the cities, and of all that dwell therein."},{"num":18,"verse":"Of what profit is the graven image that its maker has sculpted; the molten image, that teaches lies, so that in making dumb images the maker trusts in his work?"},{"num":19,"verse":"Woe unto him that saith to the wood, Awake; to the dumb stone, Arise! Can it ever teach? Behold, it is laid over with gold and silver, and there is no breath at all within it."},{"num":20,"verse":"But the LORD is in his holy temple: let all the earth keep silence before him."}]