[{"num":2,"verse":"I will stand upon my watch, and set me upon the matzor (rampart), and will watch to see what Hashem will speak in me, and what He shall answer to my tokhakhah (complaint)."},{"num":2,"verse":"And Hashem answered me, and said, Write the chazon, and make it plain upon tablets, so that a herald may run with it."},{"num":3,"verse":"For the chazon is yet for a mo’ed (an appointed time); it speaks of HaKetz (the End), and does not lie; though it tarry, wait for him [Moshiach— see Sanhedrin 97b]; because he will surely come, and will not tarry."},{"num":4,"verse":"Hinei, his nashamah which is puffed up is not upright in him; but the tzaddik shall live by his emunah. [Bereshis 15:6]"},{"num":5,"verse":"Yea also, yayin is a boged (betrayer, treacherous); he is a proud man, never at rest, who enlargeth his appetite as Sheol; like Mavet, it cannot be satisfied, but gathereth unto it kol HaGoyim, and collecteth unto it kol HaAmim;"},{"num":6,"verse":"Shall not all these take up a mashal against such, with mocking poem riddles against him, and say, Hoy (Woe) to him that increaseth that which is not his! For how long? And to him that loadeth himself by the weight of pledges (i.e., heaps up by borrowing)!"},{"num":7,"verse":"Shall not thy biters (charging neshekh) arise suddenly and awake that shall oppress thee, and thou shalt be for plunder unto them?"},{"num":8,"verse":"Because thou hast plundered many Goyim, all the remnant of the Amim shall plunder thee; because of [shefach] dahm, and for the chamas eretz, the city, and of all that dwell therein."},{"num":9,"verse":"Hoy (Woe) to him that coveteth an evil gain for his bais, that he may set his ken (nest) on high, that he may be delivered from the power of ruin!"},{"num":10,"verse":"Thy counsel hast brought shame to thy bais by cutting off amim rabbim and hast sinned against thy nashamah."},{"num":11,"verse":"For the even (stone) shall cry out of the wall, and the beam out of the timber shall answer it."},{"num":12,"verse":"Hoy (Woe) to him that buildeth a town with [shefach] dahm, and foundeth a city by iniquity!"},{"num":13,"verse":"Hinei, is it not from Hashem Tzva’os that the people shall labor only to feed the eish, and the people shall weary themselves in vain?"},{"num":14,"verse":"For the earth shall be filled with the da’as of the kavod Hashem, as the waters cover the yam."},{"num":15,"verse":"Hoy (Woe) unto him that giveth his neighbor drink, pressing thy bottle to him, and makest him drunken also, that thou mayest look on their nakedness!"},{"num":16,"verse":"Thou art filled with shame instead of kavod; drink thou also, and let thy foreskin be uncovered; the kos of Hashem’s right hand shall be turned against thee, and utter shame shall be on thy kavod."},{"num":17,"verse":"For the chamas of the Levanon shall cover thee, and the decimation of animals, by which you terrorized them, because of [shefach] dahm, and for the chamas eretz, and to the city, and all that dwell therein."},{"num":18,"verse":"What profiteth the pesel (graven image) that the maker thereof hath shaped it; the molten image, and moreh sheker, that the maker of his work trusteth therein, to make dumb elilim (idols)?"},{"num":19,"verse":"Hoy (woe) unto him that saith to the wood, Awake; to the dumb even (stone), Arise, it shall teach! Hinei, it is laid over with zahav and kesef, and there is no ruach at all in it."},{"num":20,"verse":"But Hashem is in His Heikhal Kodesh; let kol ha’aretz keep silence before Him."}]