[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-10 While Jeremiah looks upon the potter's work, God darts into his mind two great truths. God has authority, and power, to form and fashion kingdoms and nations as he pleases. He may dispose of us as he thinks fit; and it would be as absurd for us to dispute this, as for the clay to quarrel with the potter. But he always goes by fixed rules of justice and goodness. When God is coming against us in judgments, we may be sure it is for our sins; but sincere conversion from the evil of sin will prevent the evil of punishment, as to persons, and to families, and nations.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The wheels - literally, \"the two wheels.\" The lower one was worked by the feet to give motion to the upper one, which was a flat disc or plate of wood, on which the potter laid the clay, and moulded it with his fingers as it revolved rapidly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. marred—spoiled. \"Of clay\" is the true reading, which was corrupted into \"as clay\" (Margin), through the similarity of the two Hebrew letters, and from Jer 18:6, \"as the clay.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then the word of the Lord came unto me, saying. While he was in the potter's house, and after he had observed his manner of working, and the change he had made in his work, the Lord spoke to him, and applied it in the following manner. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then the word of the LORD came to me, saying,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The emblem and its interpretation. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Arise and go down into the potter's house; there will I cause thee to hear my words. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And I went down into the potter's house; and, behold, he wrought on the wheels. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the vessel was marred, that he wrought in clay, in the hand of the potter; then he made again another vessel of it, as seemed good to the potter to make. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then came the word of Jahveh to me, saying: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cannot I do with you as this potter, house of Israel? saith Jahveh. Behold, as the clay in the hand of the potter, so are ye in mine hand, house of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Now I speak concerning a people and kingdom, to root it out and pluck up and destroy it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But if that people turns from its wickedness, against which I spake, the it repents me of the evil which I thought to do it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And now I speak concerning a people and a kingdom, to build and to plant it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If it do that which is evil in mine eyes, so that it hearkens not unto my voice, then it repents me of the good which I said I would do unto it.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By God's command Jeremiah is to go and see the potter's treatment of the clay, and to receive thereafter God's interpretation of the same. Here he has set before his eyes that which suggests a comparison of man to the clay and of God to the potter, a comparison that frequently occurred to the Hebrews, and which had been made to appear in the first formation of man (cf. Job 10:9; Job 33:6; Isaiah 29:16; Isaiah 45:9; Isaiah 64:7). This is done that he may forcibly represent to the people, by means of the emblem, the power of the Lord to do according to His will with all nations, and so with Israel too. From the \"go down,\" we gather that the potteries of Jerusalem lay in a valley near the city. האבנים are the round frames by means of which the potter moulded his vessels. This sig. of the word is well approved here; but in Exodus 1:16, where too it is found, the meaning is doubtful, and it is a question whether the derivation is from אבן or from אופן, wheel. The perfecta consec. ונשׁחת and ושׁב designate, taken in connection with the participle עשׂה, actions that were possibly repeated: \"and if the vessel was spoilt, he made it over again;\" cf. Ew. 342, b. עשׂה , working in clay, of the material in which men work in order to make something of it; cf. Exodus 31:4.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "By God's command Jeremiah is to go and see the potter's treatment of the clay, and to receive thereafter God's interpretation of the same. Here he has set before his eyes that which suggests a comparison of man to the clay and of God to the potter, a comparison that frequently occurred to the Hebrews, and which had been made to appear in the first formation of man (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 64:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This is done that he may forcibly represent to the people, by means of the emblem, the power of the Lord to do according to His will with all nations, and so with Israel too. From the \"go down,\" we gather that the potteries of Jerusalem lay in a valley near the city. האבנים are the round frames by means of which the potter moulded his vessels. This sig. of the word is well approved here; but in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where too it is found, the meaning is doubtful, and it is a question whether the derivation is from אבן or from אופן, wheel. The perfecta consec. ונשׁחת and ושׁב designate, taken in connection with the participle עשׂה, actions that were possibly repeated: \"and if the vessel was spoilt, he made it over again;\" cf. Ew. 342, b. עשׂה , working in clay, of the material in which men work in order to make something of it; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 31:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Instead of בּחמר several codd. and editt. have כּחמר, as in Jeremiah 18:6, to which Ew. and Hitz. both take objection, so that they delete כחמר (Ew.) or כּחמר בּיד היּוצר (Hitz.) as being glosses, since the words are not in the lxx. The attempts of Umbr. and Nag. to obtain a sense for כּחמר are truly of such a kind as only to strengthen the suspicion of spuriousness. Umbr., who is followed by Graf, expounds: \"as the clay in the hand of the potter does;\" whereto Hitz. justly replies: \"but is then the (failure) solely its own doing?\" Ng. will have כ to be the כ verit.: the vessel was marred, as clay in the hand of the potter, in which case the כחמר still interrupts. But the failure of the attempts to make a good sense of כחמר does in no respect justify the uncritical procedure of Ew. and Hitz. in deleting the word without considering that the reading is by no means established, since not only do the most important and correct editions and a great number of codd. read בּחמר, but Aquila, Theodot., the Chald, and Syr. give this reading; Norzi and Houbig. call it lectio accuratiorum codicum, and the Masora on Jeremiah 18:6 and Job 10:9 confirms it. Cf. de Rossi variae lectt. ad h. l. and the critical remarks in the Biblia Hal. by J. H. Michaelis, according to which כחמר plainly made its way into the present verse from Jeremiah 18:6 by the error of a copyist; and it can only be from his prejudice in favour of the lxx that Hitz. pronounces כחמר original, as being \"the reading traditionally in use.\") ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Instead of בּחמר several codd. and editt. have כּחמר, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to which Ew. and Hitz. both take objection, so that they delete כחמר (Ew.) or כּחמר בּיד היּוצר (Hitz.) as being glosses, since the words are not in the lxx. The attempts of Umbr. and Nag. to obtain a sense for כּחמר are truly of such a kind as only to strengthen the suspicion of spuriousness. Umbr., who is followed by Graf, expounds: \"as the clay in the hand of the potter does;\" whereto Hitz. justly replies: \"but is then the (failure) solely its own doing?\" Ng. will have כ to be the כ verit.: the vessel was marred, as clay in the hand of the potter, in which case the כחמר still interrupts. But the failure of the attempts to make a good sense of כחמר does in no respect justify the uncritical procedure of Ew. and Hitz. in deleting the word without considering that the reading is by no means established, since not only do the most important and correct editions and a great number of codd. read בּחמר, but Aquila, Theodot., the Chald, and Syr. give this reading; Norzi and Houbig. call it lectio accuratiorum codicum, and the Masora on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " confirms it. Cf. de Rossi variae lectt. ad h. l. and the critical remarks in the Biblia Hal. by J. H. Michaelis, according to which כחמר plainly made its way into the present verse from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 18:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by the error of a copyist; and it can only be from his prejudice in favour of the lxx that Hitz. pronounces כחמר original, as being \"the reading traditionally in use.\") ",
            "children": []
          }
        ]
      }
    ]
  }
]