[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That thy benefit should not be . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The benefit derived from the service of Onesimus St. Paul acknowledges as coming from Philemon, because given with his consent. He will not keep Onesimus and ask that consent by letter, lest it should be “as it were of necessity:” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "lest it should wear even the semblance of constraint.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:8-14 It does not lower any one to condescend, and sometimes even to beseech, where, in strictness of right, we might command: the apostle argues from love, rather than authority, in behalf of one converted through his means; and this was Onesimus. In allusion to that name, which signifies profitable, the apostle allows that in time past he had been unprofitable to Philemon, but hastens to mention the change by which he had become profitable. Unholy persons are unprofitable; they answer not the great end of their being. But what happy changes conversion makes! of evil, good; of unprofitable, useful. Religious servants are treasures in a family. Such will make conscience of their time and trusts, and manage all they can for the best. No prospect of usefulness should lead any to neglect their obligations, or to fail in obedience to superiors. One great evidence of true repentance consists in returning to practise the duties which have been neglected. In his unconverted state, Onesimus had withdrawn, to his master's injury; but now he had seen his sin and repented, he was willing and desirous to return to his duty. Little do men know for what purposes the Lord leaves some to change their situations, or engage in undertakings, perhaps from evil motives. Had not the Lord overruled some of our ungodly projects, we may reflect upon cases, in which our destruction must have been sure.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But without thy mind would I do nothing - Nothing in the matter referred to. He would not retain Onesimus in his service, much as he needed his assistance, without the cordial consent of Philemon. He would not give him occasion for hard feeling or complaint, as if Paul had induced him to leave his master, or as if he persuaded him to remain with him when he wished to return - or as if he kept him away from him when he owed him or had wronged him. All that is said here is entirely consistent with the supposition that Onesimus was disposed to return to his master, and with the supposition that Paul did not compel or urge him to do it. For it is probable that if Onesimus had proposed to return, it would have been easy for Paul to have retained him with him. He might have represented his own want of a friend. He might have appealed to his gratitude on account of his efforts for his conversion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He might have shown him that he was under no moral obligation to go back. He might have refused to give him this letter, and might have so represented to him the dangers of the way, and the probability of a harsh reception, as effectually to have dissuaded him from such a purpose. But, in that case, it is clear that this might have caused hard feeling in the bosom of Philemon, and rather than do that he preferred to let him return to his master, and to plead for him that he might have a kind reception. It is, therefore, by no means necessary to suppose that Paul felt that Onesimus was under obligation to return, or that he was disposed to compel him, or that Onesimus was not inclined to return voluntarily; but all the cirumstances of the case are met by the supposition that, if Paul retained him, Philemon might conceive that he had injured him. Suppose, as seems to have been the case, that Onesimus \"owed\" Philemon PLamentations 1:18, and then suppose that Paul had chosen to retain him with himself, and had dissuaded him from returning to him, would not Philemon have had reason to complain of it?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He might have shown him that he was under no moral obligation to go back. He might have refused to give him this letter, and might have so represented to him the dangers of the way, and the probability of a harsh reception, as effectually to have dissuaded him from such a purpose. But, in that case, it is clear that this might have caused hard feeling in the bosom of Philemon, and rather than do that he preferred to let him return to his master, and to plead for him that he might have a kind reception. It is, therefore, by no means necessary to suppose that Paul felt that Onesimus was under obligation to return, or that he was disposed to compel him, or that Onesimus was not inclined to return voluntarily; but all the cirumstances of the case are met by the supposition that, if Paul retained him, Philemon might conceive that he had injured him. Suppose, as seems to have been the case, that Onesimus \"owed\" Philemon P",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 1:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and then suppose that Paul had chosen to retain him with himself, and had dissuaded him from returning to him, would not Philemon have had reason to complain of it?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There was, therefore, on every account, great propriety in his saying that he did not wish to use any influence over him to retain him with him when he purposed to return to Colosse, and that he felt that it would be wrong for him to keep him, much as he needed him, without the consent of Philemon. Nor is it necessary, by what is said here, to suppose that Onesimus was a slave, and that Paul believed that Philemon had a right to him and to his services as such. All that he says here would be met by the supposition that he was a hired servant, and would be in fact equally proper even on the supposition that he was an apprentice. In either case, he would feel that he gave just ground of complaint on the part of Philemon if, when Onesimus desired to return, he used any influence to dissuade him from it, and to retain him with himself. It would have been a violation of the rule requiring us to do to others as we would wish them to do unto us, and Paul therefore felt unwilling, much as he needed the services of Onesimus, to make use of any influence to retain him with him without the consent of his master.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That thy benefit - The favor which I might receive from thee by having the services of Onesimus. If Onesimus should remain with him and assist him, he would feel that the benefit which would be conferred by his services would be in fact bestowed by Philemon, for he had a right to the service of Onesimus, and, while Paul enjoyed it, he would be deprived of it. The word rendered \"benefit\" here -  ἀγαθόν agathon - means good, and the sense is, \"the good which you would do me;\" to wit, by the service of Onesimus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Should not be as it were of necessity - As it would be it Paul should detain Onesimus with him without affording Philemon an opportunity of expressing his assent. Paul would even then have felt that he was in fact receiving a \"good\" at the expense of Philemon, but it would not be a voluntary favor on his part.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But willingly - As it would be if he had given his consent that Onesimus should remain with him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But willingly - As it would be if he had given his consent that Onesimus should remain with him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. without thy mind—that is, consent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "should not be as—\"should not appear as a matter of necessity, but of free will.\" Had Paul kept Onesimus, however willing to gratify Paul Philemon might be, he would have no opportunity given him of showing he was so, his leave not having been asked.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But without thy mind would I do nothing; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but he was thy servant, and I would not do it without thy knowledge and consent, that it might not be thought that thou hadst done me a kindness necessarily, but that thou mightest do it freely. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That thy benefit should not be as it were of necessity, but willingly:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which seems to argue that St. Paul expected that he, being reconciled to Onesimus, should send him back to Paul; unless he means the benefit done to Onesimus, in not revenging the wrong he had done him, should not be of necessity, because he was out of his reach, but freely, having him first in his power. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But without thy mind would I do nothing,.... Which shows great modesty and humility in the apostle, that though as such he had an authority, which he could have used, as well as had understanding and judgment how to have used it without consulting Philemon, or having his sense of this affair, yet chose to consult him: and it also shows the strict regard the apostle had to equity and justice, that he would do nothing with another man's servant without his consent; he would not seem to alienate, or engross another man's right and property, whatever power he might have, as an apostle, to have retained Onesimus as a minister to him, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That thy benefit should not be as it were of necessity, but willingly; that is, that his goodness in forgiving his servant, and renouncing all claim and property in him, and admitting him to continue in the service of the apostle, might not look like a forced thing; but that it might appear to be a voluntary action, when he should of himself return him, after he had been thus sent to him, and received by him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That thy benefit should not be as it were of necessity, but willingly; that is, that his goodness in forgiving his servant, and renouncing all claim and property in him, and admitting him to continue in the service of the apostle, might not look like a forced thing; but that it might appear to be a voluntary action, when he should of himself return him, after he had been thus sent to him, and received by him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But without thy mind would I do nothing; that thy benefit should not be as it were of {e} necessity, but willingly.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But without thy mind would I do nothing; that thy benefit should not be as it were of ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " necessity, but willingly.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) That you might not seem to have lent me your servant on constraint, but willingly.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Philemon 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". With the thought of this verse ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς κατὰ ἀνάγκην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": “St. Paul does not say ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατὰ ἀνάγκην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς κατὰ ἀνάγκην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He will not suppose that it would really be constraint; but it must not even wear the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "appearance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of being so. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς ἐν ἀφροσύνῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” (Lightfoot).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mind",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Properly, “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "opinion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "decision",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Latin Versions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "consilium",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "would I do nothing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit., “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nothing I willed to do",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” The A. V. represents the idiom rightly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that thy benefit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The primary reason, doubtless, was that it was Onesimus’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "duty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to return, and Paul’s to give him up. But this delicate subsidiary motive was not less real.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thy benefit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "”",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ":",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—lit., “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy good",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thy kindness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reference seems to be to Philemon’s general kindness to his friend, of which the permission to Onesimus to stay would have been an instance. So Ellicott.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of necessity, but willingly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It might seem that he almost suggests to Philemon to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "send Onesimus back to him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But this is not likely in itself, in view of the long and costly journey involved; and besides, he looks forward to visit Colossæ himself before long (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Philemon 1:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). What he means is that he sends back Onesimus, because to retain him would be to get a benefit from Philemon willing ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "or not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Philemon’s “good” had always been willingly given.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As it were",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” softens the “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of necessity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "”",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ";",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Philemon might not be unwilling, but there would be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the look of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his being so.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Philemon 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὡς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as it were",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A mitigating particle; for although Philemon had not been compelled, yet his willingness would not have so much appeared [had Paul kept Onesimus without formally asking Philemon’s leave].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάγκην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "necessity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") for Philemon could not have resisted.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But without thy mind I would do nothing.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The \"would\" of Ver. 13 is ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐβουλόμην",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the \"would\" here is ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἠθέλησα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The former denoted natural but indeterminate impulse; the latter deliberate conclusion of the will (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 7:15, 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Mind",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " knowledge and decision. \"Why was he unwilling? For many causes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Because grave penalties were denounced by Roman law upon those who received or retained fugitive slaves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That he might not seem to keep back something which was due to Philemon, perhaps to his injury; of which, perhaps, Philemon might have complained. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Because Onesimus himself chose to go back, in order that he might show conclusively that he had net embraced the Christian religion that he might withdraw himself from the power of his lawful lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That the gospel might not be by this means slandered, as if under the pretext of it slaves might withdraw themselves with impunity from their lords\" (Estius and others). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thy benefit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- goodness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "as it were of necessity, but willingly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Philemon would not really have had the choice of granting or refusing given to him, had St. Paul kept Onesimus still at Rome, and merely written to inform him of the fact. His consent might then fairly have been said to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "extorted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not freely given.  This latter word is an ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἅπαξ λεγόμενον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (unique phrase) so far as the New Testament is concerned, though it is found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the LXX., as in Xenophon and other classical writers. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the adverb ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἑκουσίως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is found. Philemon 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I would (ἠθέλησα)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare I would, Plm 1:13. Here the aorist tense and the verb meaning to will denote a single, decisive resolution.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As it were of necessity (ὡς κατὰ ἀνάγκην)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ὡς as it were, Rev., as, marks the appearance of necessity. Philemon's kindly reception of Onesimus must not even seem to be constrained. ",
        "children": []
      }
    ]
  }
]