[{"header":"Jesus is Taken to Pilate(A)"},{"num":15,"verse":"As soon as it was morning, the high priests convened a meeting with the elders and scribes and the whole Council. They bound Jesus with chains, led him away, and handed him over to Pilate. "},{"num":2,"verse":"Pilate asked him, “Are you the king of the Jews?”"},{"num":3,"verse":"The high priests kept accusing him of many things. "},{"num":4,"verse":"So Pilate asked him again, “Don’t you have any answer? Look how many accusations they’re bringing against you!” "},{"num":5,"verse":"But since Jesus no longer answered, Pilate was astonished."},{"header":"Jesus is Sentenced to Death(B)"},{"num":6,"verse":"At every festival, Pilate would release any one prisoner whom the people requested. "},{"num":7,"verse":"Now there was a man in prison named Barabbas. He had been with the insurgents who had committed murder during the rebellion. "},{"num":8,"verse":"So the crowd came and began to request that Pilate do for them what he always did. "},{"num":9,"verse":"Pilate answered them, “Do you want me to release the king of the Jews for you?” "},{"num":10,"verse":"because he knew that the high priests had handed him over due to jealousy."},{"num":11,"verse":"But the high priests stirred up the crowd to get him to release Barabbas for them instead. "},{"num":12,"verse":"So Pilate asked them again, “Then what should I do with the man you call ‘the King of the Jews’?”"},{"num":13,"verse":"“Crucify him!” they shouted back."},{"num":14,"verse":"“Why?” Pilate asked them. “What has he done wrong?”"},{"num":15,"verse":"So Pilate, wanting to satisfy the crowd, released Barabbas for them, but he had Jesus whipped and handed over to be crucified."},{"header":"The Soldiers Make Fun of Jesus(C)"},{"num":16,"verse":"The soldiers led Jesus into the courtyard of the palace (that is, the governor’s headquarters) and called out the whole guard. "},{"num":17,"verse":"They dressed him in a purple robe, twisted some thorns into a victor’s crown, and placed it on his head. "},{"num":18,"verse":"They began to greet him, “Long live the king of the Jews!” "},{"num":19,"verse":"They kept hitting him on the head with a stick, spitting on him, kneeling in front of him, and worshiping him. "},{"num":20,"verse":"When they had finished making fun of him, they stripped him of the purple robe, put his own clothes back on him, and led him away to crucify him."},{"header":"Jesus is Crucified(D)"},{"num":21,"verse":"They forced a certain passer-by named Simon of Cyrene, the father of Alexander and Rufus, who happened to be coming in from the country, to carry Jesus’ cross. "},{"num":22,"verse":"They took Jesus to a place called Golgotha, which means Skull Place. "},{"num":23,"verse":"They tried to give him wine mixed with myrrh, but he wouldn’t accept it. "},{"num":24,"verse":"Then they crucified him. They divided his clothes among themselves by throwing dice to see what each one would get. "},{"num":25,"verse":"It was nine in the morning when they crucified him. "},{"num":26,"verse":"The written notice of the charge against him read, “The king of the Jews.” "},{"num":27,"verse":"They crucified two bandits with him, one on his right and the other on his left. "},{"num":29,"verse":"Those who passed by kept insulting him, shaking their heads, and saying, “Ha! You who were going to destroy the sanctuary and rebuild it in three days— "},{"num":30,"verse":"save yourself and come down from the cross!”"},{"num":31,"verse":"In the same way, the high priests, along with the scribes, were also making fun of him among themselves. They kept saying, “He saved others, but can’t save himself! "},{"num":32,"verse":"Let the Messiah, the king of Israel, come down from the cross now, since seeing is believing!” Even the men who were crucified with him kept insulting him."},{"header":"Jesus Dies on the Cross(E)"},{"num":33,"verse":"At noon, darkness came over the whole land until three in the afternoon. "},{"num":34,"verse":"At three o’clock, Jesus cried out with a loud voice, “Eloi, eloi, lema sabachthani?” (which means, “My God, my God, why have you forsaken me?”)"},{"num":35,"verse":"When some of the people standing there heard this, they said, “Listen! He’s calling for Elijah!”"},{"num":36,"verse":"So someone ran and soaked a sponge in some sour wine. Then he put it on a stick and offered Jesus a drink, saying, “Wait! Let’s see if Elijah comes to take him down!”"},{"num":37,"verse":"Then Jesus gave a loud cry and breathed his last. "},{"num":38,"verse":"The curtain in the sanctuary was torn in two from top to bottom. "},{"num":39,"verse":"When the centurion who stood facing Jesus saw how he had cried out and breathed his last, he said, “This man certainly was the Son of God!”"},{"num":40,"verse":"Now there were women watching from a distance. Among them were Mary Magdalene, Mary the mother of young James and Joseph, and Salome. "},{"num":41,"verse":"They used to accompany him and care for him while he was in Galilee. Many other women who had come up to Jerusalem with him were there, too."},{"header":"Jesus is Buried(F)"},{"num":42,"verse":"It was the Day of Preparation, that is, the day before the Sabbath. Since it was already evening, "},{"num":43,"verse":"Joseph of Arimathea, a highly respected member of the Council, who was waiting for the kingdom of God, went boldly to Pilate and asked for the body of Jesus. "},{"num":44,"verse":"Pilate was amazed to hear that Jesus had already died, so he summoned the centurion to ask him if he was in fact dead. "},{"num":45,"verse":"When he learned from the centurion that he was dead, he let Joseph have the corpse. "},{"num":46,"verse":"Joseph bought some linen cloth, took the body down, wrapped it in the cloth, laid it in a tomb that had been cut out of the rock, and rolled a stone against the door of the tomb. "},{"num":47,"verse":"Now Mary Magdalene and Mary the mother of Joseph observed where the body had been laid."}]