[[],[{"type":"header","content":"Jesus before Pilate"},{"type":"prose","content":"Early in the morning the chief priests with the elders, scribes, and the entire Council immediately held a consultation; and they bound Jesus and led Him away, and turned Him over to Pilate."}],[{"type":"prose","content":"Pilate questioned Him: “ You are the King of the Jews?” And He answered him, "}],[{"type":"prose","content":"And the chief priests  accusing Him of many things."}],[{"type":"prose","content":"But Pilate questioned Him again, saying, “Do You offer nothing in answer? See how many charges they are bringing against You!”"}],[{"type":"prose","content":"But Jesus said nothing further in answer, so Pilate was amazed."}],[{"type":"prose","content":"Now at  Feast he used to release for them  one prisoner whom they requested."}],[{"type":"prose","content":"And the one named Barabbas had been imprisoned with the rebels who had committed murder in the revolt."}],[{"type":"prose","content":"And the crowd went up and began asking  as he had been accustomed to do for them."}],[{"type":"prose","content":"Pilate answered them, saying, “Do you want me to release for you the King of the Jews?”"}],[{"type":"prose","content":"For he was aware that the chief priests had handed Him over because of envy."}],[{"type":"prose","content":"But the chief priests stirred up the crowd  to release Barabbas for them instead."}],[{"type":"prose","content":"And responding again, Pilate said to them, “Then what shall I do with Him whom you call the King of the Jews?”"}],[{"type":"prose","content":"They shouted back, “Crucify Him!”"}],[{"type":"prose","content":"But Pilate said to them, “Why, what evil has He done?” But they shouted all the more, “Crucify Him!”"}],[{"type":"prose","content":"Intent on satisfying the crowd, Pilate released Barabbas for them, and after having Jesus flogged, he handed Him over to be crucified."}],[{"type":"header","content":"Jesus Is Mocked"},{"type":"prose","content":"Now the soldiers took Him away into the palace (that is, the Praetorium), and they *called together the whole  cohort."}],[{"type":"prose","content":"And they *dressed Him in purple, and after twisting together a crown of thorns, they put it on Him;"}],[{"type":"prose","content":"and they began saluting Him: “Hail, King of the Jews!”"}],[{"type":"prose","content":"And they  beat His head with a reed and spit on Him, and kneeling, they bowed down before Him."}],[{"type":"prose","content":"And after they had mocked Him, they took the purple  off Him and put His  garments on Him. And they *led Him out to crucify Him."}],[{"type":"prose","content":"And they *compelled a passer-by coming from the country, Simon of Cyrene (the father of Alexander and Rufus), to carry His cross."}],[{"type":"header","content":"The Crucifixion"},{"type":"prose","content":"Then they *brought Him to the place Golgotha, which is translated, Place of a Skull."}],[{"type":"prose","content":"And they tried to give Him wine mixed with myrrh; but He did not take ."}],[{"type":"prose","content":"And they *crucified Him, and *divided up His garments among themselves, casting lots for them  what each man would take."}],[{"type":"prose","content":"Now it was the third hour when they crucified Him."}],[{"type":"prose","content":"The inscription of the charge against Him read, “THE KING OF THE JEWS.”"}],[{"type":"prose","content":"And they *crucified two rebels with Him, one on His right and one on His left."}],[{"type":"prose","content":"Those passing by were hurling abuse at Him, shaking their heads and saying, “Ha! You who  destroy the temple and rebuild it in three days,"}],[{"type":"prose","content":"save Yourself by coming down from the cross!”"}],[{"type":"prose","content":"In the same way the chief priests also, along with the scribes, were mocking  among themselves and saying, “He saved others; He cannot save Himself!"}],[{"type":"prose","content":"Let  Christ, the King of Israel, come down now from the cross, so that we may see and believe!” Those who were crucified with Him were also insulting Him."}],[{"type":"prose","content":"When the sixth hour came, darkness fell over the whole land until the ninth hour."}],[{"type":"prose","content":"At the ninth hour Jesus cried out with a loud voice,  which is translated, "}],[{"type":"prose","content":"And when some of the bystanders heard , they  saying, “Look! He is calling for Elijah!”"}],[{"type":"prose","content":"And someone ran and filled a sponge with sour wine, put it on a reed, and gave Him a drink, saying, “Let us see if Elijah comes to take Him down.”"}],[{"type":"prose","content":"But Jesus let out a loud cry, and died."}],[{"type":"prose","content":"And the veil of the temple was torn in two from top to bottom."}],[{"type":"prose","content":"And when the centurion, who was standing right in front of Him, saw that He died in this way, he said, “Truly this man was the Son of God!”"}],[{"type":"prose","content":"Now there were also  women watching from a distance, among whom  Mary Magdalene, Mary the mother of James the Less and Joses, and Salome."}],[{"type":"prose","content":"When He was in Galilee, they used to follow Him and serve Him; and  many other women who came up with Him to Jerusalem."}],[{"type":"header","content":"Jesus Is Buried"},{"type":"prose","content":"When evening had already come, since it was the preparation day, that is, the day before the Sabbath,"}],[{"type":"prose","content":"Joseph of Arimathea came, a prominent member of the Council, who was himself also waiting for the kingdom of God; and he gathered up courage and went in before Pilate, and asked for the body of Jesus."}],[{"type":"prose","content":"Now Pilate wondered if He was dead by this time, and summoning the centurion, he questioned him as to whether He was already dead."}],[{"type":"prose","content":"And after learning this from the centurion, he granted the body to Joseph."}],[{"type":"prose","content":"Joseph bought a linen cloth, took Him down, wrapped Him in the linen cloth, and laid Him in a tomb which had been cut out in the rock; and he rolled a stone against the entrance of the tomb."}],[{"type":"prose","content":"Mary Magdalene and Mary the  of Joses were watching  where He was laid."}]]