[{"num":15,"verse":"And as soon as it was boker, the Rashei Hakohanim (the Chief Priests) with the Zekenim and Sofrim (Scribes) and [the] whole Sanhedrin, having performed the akedah (binding) of Rebbe, Melech HaMoshiach, led [him] away and handed [him] over to Pilate. [BERESHIS 22:9]"},{"num":2,"verse":"And Pilate questioned Rebbe, Melech HaMoshiach, Are you the Melech HaYehudim? And, in reply, he says, You say so."},{"num":3,"verse":"And the Rashei Hakohanim were accusing Rebbe, Melech HaMoshiach [of] many things."},{"num":4,"verse":"And Pilate again questioned him, saying, Do you not answer anything? Look how many things they accuse you [of]."},{"num":5,"verse":"But Rebbe, Melech HaMoshiach no longer answered anything, so Pilate was astounded. [YESHAYAH 53:7]"},{"num":6,"verse":"Now [at] every Chag he was releasing to them one prisoner for whom they were making bakosha (request)."},{"num":7,"verse":"Now there was the one being called Bar-Abba, who had been imprisoned with his fellow insurrectionists and who, at the time of the Mered (Revolt, Uprising), had committed retzach (murder)."},{"num":8,"verse":"So the crowd came and began to ask Pilate to do for them just as in the past was his custom."},{"num":9,"verse":"But Pilate answered them, saying, Do you wish [that] I should release to you the Melech HaYehudim?"},{"num":10,"verse":"For Pilate knew that because of kinah (envy) the Rashei Hakohanim had handed him over to him."},{"num":11,"verse":"But the Rashei Hakohanim incited the crowd that Pilate should instead release Bar-Abba to them."},{"num":12,"verse":"But Pilate, in reply again, was saying to them, What then do you wish [that] I should do with the one whom you call the Melech HaYehudim?"},{"num":13,"verse":"And again they cried out, Let him be talui al HaEtz (being hanged on the Tree)! [DEVARIM 21:23]"},{"num":14,"verse":"But Pilate was saying to them, Why? What ra’ah has he committed? But they all the more cried out, Let him be talui al HaEtz (being hanged on the Tree)! [DEVARIM 21:23]"},{"num":15,"verse":"So Pilate, desiring to placate the crowd, released to them Bar-Abba, and handed over Rebbe, Melech HaMoshiach to be scourged [with the flagellum] and to be talui al HaEtz (to be hanged on the Tree, DEVARIM 21:23)."},{"num":16,"verse":"And the chaiyalim (soldiers) led away Rebbe, Melech HaMoshiach into the courtyard, which is [the] Praetorium, the governor’s headquarters, and they called together [the] whole cohort."},{"num":17,"verse":"And they clothe him in [royal] purple and place upon him a keter (crown) of thorns that they had woven together."},{"num":18,"verse":"And they began to greet him, Hail, Melech HaYehudim!"},{"num":19,"verse":"And they were striking him [on] the rosh with a staff and they were spitting on him and bending their knees and bowing down before him. [TEHILLIM 22:8,17]"},{"num":20,"verse":"After mocking him, they stripped him of [royal] purple and clothed him in his garments. And they lead him out that they might make him be talui al HaEtz (being hanged on the Tree). [DEVARIM 21:23]"},{"num":21,"verse":"And a certain Shimon from Cyrene was passing by, who was coming in from [the] countryside. He was the father of Alexander and Rufus. The chaiyalim (soldiers) requisition him in order that he carry Moshiach’s Etz. [DEVARIM 21:23; YESHAYAH 53:4-5]"},{"num":22,"verse":"And they bring Rebbe, Melech HaMoshiach to a place called Gulgotha, which means, being translated, Place of the Skull."},{"num":23,"verse":"And they were giving to him yayin having been mixed with myrrh, but this one did not take it. [TEHILLIM 69:22 (21); MISHLE 31:6]"},{"num":24,"verse":"And they hanged Rebbe, Melech HaMoshiach on HaEtz and YICHALLEKU VEGADAI (they divide the garments) of Rebbe, Melech HaMoshiach, and VAPPILU GORAL (they cast lots) for them, to decide what each might take. [TEHILLIM 22:19 (18)]"},{"num":25,"verse":"Now it was [the] third hour when they nailed and hanged Rebbe, Melech HaMoshiach on HAETZ. [DEVARIM 21:23]"},{"num":26,"verse":"And the inscription of the charge against him was inscribed above his rosh, Melech HaYehudim."},{"num":27,"verse":"And with him they also nailed, each to his own etz, shnei shodedim, one on [the] right, one on [the] left of him."},{"num":28,"verse":"[And the Kitvei Hakodesh was fulfilled, VES POSHEIM NIMNAH (and with lawless persons he was numbered YESHAYAH 53:12).]"},{"num":29,"verse":"And the ones passing by were reviling him and shaking their heads and saying, Ha! The one bringing churban on the Beis HaMikdash and rebuilding [it] in shlosha yamim, [TEHILLIM 22:7; 109:25]"},{"num":30,"verse":"Save yourself! Come down from the etz!"},{"num":31,"verse":"Likewise, also, the Rashei Hakohanim with the Sofrim were also mocking him, saying, He saved others, but himself he is not able to save. [TEHILLIM 22:7]"},{"num":32,"verse":"Let the Moshiach, let Rebbe Melech HaMoshiach of Yisroel, let [him] come down now from the etz, in order that we may see and have emunah! And the ones having been hanged on the etz on either side of him were reproaching him. [Mk 8:31]"},{"num":33,"verse":"And when the sixth hour came [high noon], it became choshech over kol haaretz until [the] ninth hour. [AMOS 8:9]"},{"num":34,"verse":"And at the ninth hour, he cried out in a kol gadol (loud voice), Eloi, Eloi lamah sabachthani?‖which means, being translated, ELI ELI LAMAH AZAVTANI? (My G-d, my G-d, why have you forsaken me? [TEHILLIM 22:1])"},{"num":35,"verse":"And some of the ones having been standing nearby and having heard, were saying, Hinei! He calls for Eliyahu HaNavi!"},{"num":36,"verse":"And someone having run and having filled a sponge with CHOMETZ (vinegar TEHILLIM 69:21), and having placed it on a staff, gave a drink to him, saying, Leave him alone. Let us see if Eliyahu Hanavi comes to take him down."},{"num":37,"verse":"And Rebbe, Melech HaMoshiach, having uttered a kol gadol (loud voice) and having breathed his last, expired."},{"num":38,"verse":"And the Parochet in the Heikhal was torn in two from top to bottom."},{"num":39,"verse":"And the centurion, having stood nearby opposite him, and having seen that he expired this way, said Beemes (actually, in truth), this man was the Ben HaElohim!"},{"num":40,"verse":"And there were also nashim (women) looking on from a distance, among whom [were] Miryam from Magdala, and Miryam the Em of the younger Yaakov and of Yosi, and Shlomit. [TEHILLIM 38:11]"},{"num":41,"verse":"They were with Rebbe, Melech HaMoshiach in the Galil and they had been following him [as talmidat] and serving him, and there were many other Jewish women who, with Rebbe Melech HaMoshiach, had made their aliyah leregel (pilgrimage) up to Yerushalayim."},{"num":42,"verse":"And already, erev (evening) fast approaching, vibahlt (since) it was Preparation Day, which is the day before Shabbos,"},{"num":43,"verse":"Yosef of Ramatayim, a member of the Sanhedrin and a man of chashivut (prominence) there, a man who was also himself looking forward to the Malchut Hashem, had the bold chozek to go into Pilate and ask for the gufat Yehoshua."},{"num":44,"verse":"And Pilate was amazed that Rebbe, Melech HaMoshiach was already niftar (deceased), and Pilate summoned the centurion to question him whether Yehoshua was niftar already."},{"num":45,"verse":"And having found out from the centurion, he gave the geviyah (body) to Yosef. [BERESHIS 47:18]"},{"num":46,"verse":"And having bought linen cloth tachrichim (shrouds) and having taken Rebbe, Melech HaMoshiach down, he wrapped him in the tachrichim (shrouds) and placed him in a kever which had been cut from rock, and he rolled a stone against the entrance of the kever."},{"num":47,"verse":"And Miryam of Magdala and Miryam the Em of Yosi were observing [T.N. as chevra kadesha shomrim eyewitnesses] of where Rebbe, Melech HaMoshiach had been laid."}]