[{"header":"David Learns of Saul’s Death"},{"num":1,"verse":"After the death of Saul, David returned from his victory over the Amalekites and spent two days in Ziklag."},{"num":2,"verse":"On the third day a man arrived from Saul’s army camp. He had torn his clothes and put dirt on his head to show that he was in mourning. He fell to the ground before David in deep respect."},{"num":3,"verse":"“Where have you come from?” David asked."},{"num":4,"verse":"“What happened?” David demanded. “Tell me how the battle went.”"},{"num":5,"verse":"“How do you know Saul and Jonathan are dead?” David demanded of the young man."},{"num":6,"verse":"The man answered, “I happened to be on Mount Gilboa, and there was Saul leaning on his spear with the enemy chariots and charioteers closing in on him."},{"num":7,"verse":"When he turned and saw me, he cried out for me to come to him. ‘How can I help?’ I asked him."},{"num":8,"verse":"“He responded, ‘Who are you?’"},{"num":9,"verse":"“Then he begged me, ‘Come over here and put me out of my misery, for I am in terrible pain and want to die.’"},{"num":10,"verse":"“So I killed him,” the Amalekite told David, “for I knew he couldn’t live. Then I took his crown and his armband, and I have brought them here to you, my lord.”"},{"num":11,"verse":"David and his men tore their clothes in sorrow when they heard the news."},{"num":12,"verse":"They mourned and wept and fasted all day for Saul and his son Jonathan, and for the Lord’s army and the nation of Israel, because they had died by the sword that day."},{"num":13,"verse":"Then David said to the young man who had brought the news, “Where are you from?”"},{"num":14,"verse":"“Why were you not afraid to kill the Lord’s anointed one?” David asked."},{"num":15,"verse":"Then David said to one of his men, “Kill him!” So the man thrust his sword into the Amalekite and killed him."},{"num":16,"verse":"“You have condemned yourself,” David said, “for you yourself confessed that you killed the Lord’s anointed one.”"},{"header":"David’s Song for Saul and Jonathan"},{"num":17,"verse":"Then David composed a funeral song for Saul and Jonathan,"},{"num":18,"verse":"and he commanded that it be taught to the people of Judah. It is known as the Song of the Bow, and it is recorded in The Book of Jashar."}]