[{"header":"Proof for Moses"},{"num":4,"verse":"Then Moses said to God, “But the Israelites will not believe me when I tell them that you sent me. They will say, ‘The Lord did not appear to you.’”"},{"num":2,"verse":"But the Lord said to Moses, “What is that you have in your hand?”"},{"num":3,"verse":"Then God said, “Throw your walking stick on the ground.”"},{"num":4,"verse":"but the Lord said to him, “Reach out and grab the snake by its tail.”"},{"num":5,"verse":"Then God said, “Use your stick in this way, and the people will believe that you saw the Lord, the God of your ancestors, the God of Abraham, the God of Isaac, and the God of Jacob.”"},{"num":6,"verse":"Then the Lord said to Moses, “I will give you another proof. Put your hand under your robe.”"},{"num":7,"verse":"Then God said, “Now put your hand into your robe again.” So Moses put his hand into his robe again. Then he brought his hand out, and his hand was changed. Now his hand was good again, as it was before."},{"num":8,"verse":"Then God said, “If the people don’t believe you when you use your walking stick, then they will believe you when you show them this sign."},{"num":9,"verse":"If they still refuse to believe after you show them both of these signs, then take some water from the Nile River. Pour the water on the ground, and as soon as it touches the ground, it will become blood.”"},{"num":10,"verse":"Then Moses said to the Lord, “But, Lord, I am telling you, I am not a good speaker. I have never been able to speak well. And that hasn’t changed since you started talking to me. I am still not a good speaker. You know that I speak slowly and don’t use the best words.”"},{"num":11,"verse":"Then the Lord said to him, “Who made a person’s mouth? And who can make someone deaf or not able to speak? Who can make a person blind? Who can make a person able to see? I am the one. I am the Lord."},{"num":12,"verse":"So go. I will be with you when you speak. I will give you the words to say.”"},{"num":13,"verse":"But Moses said, “My Lord, I beg you to send someone else, not me.”"},{"num":14,"verse":"Then the Lord became angry with Moses and said, “All right! I’ll give you someone to help you. Aaron the Levite is your brother, isn’t he? He is a good speaker. In fact, Aaron is already coming to meet you, and he will be happy to see you."},{"num":15,"verse":"I will tell you what to say. Then you will tell Aaron, and I will help him say it well. I will tell both of you what to do."},{"num":16,"verse":"So Aaron will speak for you. Like God, you will speak to him, and he will tell the people what you say."},{"num":17,"verse":"So go and carry your walking stick with you. Use it and the other miracles to show the people that I am with you.”"},{"header":"Moses Leaves Midian"},{"num":18,"verse":"Then Moses went back to Jethro, his father-in-law. Moses said to him, “Please let me go back to Egypt. I want to see if my people are still alive.”"},{"num":19,"verse":"Then, while Moses was still in Midian, the Lord said to him, “It is safe for you to go back to Egypt now. The men who wanted to kill you are now dead.”"},{"num":20,"verse":"So Moses put his wife and children on the donkey and returned to Egypt. He carried his walking stick with him—the walking stick with the power of God."},{"num":21,"verse":"While Moses was traveling back to Egypt, the Lord spoke to him, “When you talk to Pharaoh remember to show him all the miracles that I have given you the power to do. But I will cause Pharaoh to be very stubborn. He will not let the people go."},{"num":22,"verse":"Then you should say to Pharaoh, ‘This is what the Lord says: Israel is my firstborn son."},{"num":23,"verse":"And I am telling you to let my son go and worship me. If you refuse to let Israel go, then I will kill your firstborn son.’”"},{"header":"Moses’ Son Circumcised"},{"num":24,"verse":"On the way to Egypt, Moses stopped at a place to spend the night. The Lord met Moses at that place and tried to kill him."},{"num":25,"verse":"But Zipporah took a flint knife and circumcised her son. She took the skin and touched his feet. Then she said to Moses, “You are a bridegroom of blood to me.”"},{"num":26,"verse":"Zipporah said this because she had to circumcise her son. So God let Moses live."},{"header":"Moses Arrives in Egypt"},{"num":27,"verse":"The Lord had spoken to Aaron and told him, “Go out into the desert and meet Moses.” So Aaron went and met Moses at the Mountain of God. He saw Moses and kissed him."},{"num":28,"verse":"Moses told Aaron everything the Lord had commanded him to say and all the miracles he must do to prove that God had sent him."},{"num":29,"verse":"So Moses and Aaron went and gathered together all the elders of the Israelites."},{"num":30,"verse":"Then Aaron spoke to the people and told them everything the Lord had told Moses. Then Moses did the miracles for all the people to see,"},{"num":31,"verse":"and they believed what they had heard. Then the Israelites understood that the Lord had seen their troubles and had come to help them. So they bowed down and worshiped God."}]