[[],[{"type":"header","content":"Moses Given Powerful Signs"},{"type":"prose","content":"Then Moses answered, “But behold, they will not believe me or listen to my voice, for they will say, ‘The  did not appear to you.’”"}],[{"type":"prose","content":"The  said to him, “What is that in your hand?” He said, “A staff.”"}],[{"type":"prose","content":"And he said, “Throw it on the ground.” So he threw it on the ground, and it became a serpent, and Moses ran from it."}],[{"type":"prose","content":"But the  said to Moses, “Put out your hand and catch it by the tail”—so he put out his hand and caught it, and it became a staff in his hand—"}],[{"type":"prose","content":"“that they may believe that the , the God of their fathers, the God of Abraham, the God of Isaac, and the God of Jacob, has appeared to you.”"}],[{"type":"prose","content":"Again, the  said to him, “Put your hand inside your cloak.” And he put his hand inside his cloak, and when he took it out, behold, his hand was leprous like snow."}],[{"type":"prose","content":"Then God said, “Put your hand back inside your cloak.” So he put his hand back inside his cloak, and when he took it out, behold, it was restored like the rest of his flesh."}],[{"type":"prose","content":"“If they will not believe you,” God said, “or listen to the first sign, they may believe the latter sign."}],[{"type":"prose","content":"If they will not believe even these two signs or listen to your voice, you shall take some water from the Nile and pour it on the dry ground, and the water that you shall take from the Nile will become blood on the dry ground.”"}],[{"type":"prose","content":"But Moses said to the , “Oh, my Lord, I am not eloquent, either in the past or since you have spoken to your servant, but I am slow of speech and of tongue.”"}],[{"type":"prose","content":"Then the  said to him, “Who has made man's mouth? Who makes him mute, or deaf, or seeing, or blind? Is it not I, the ?"}],[{"type":"prose","content":"Now therefore go, and I will be with your mouth and teach you what you shall speak.”"}],[{"type":"prose","content":"But he said, “Oh, my Lord, please send someone else.”"}],[{"type":"prose","content":"Then the anger of the  was kindled against Moses and he said, “Is there not Aaron, your brother, the Levite? I know that he can speak well. Behold, he is coming out to meet you, and when he sees you, he will be glad in his heart."}],[{"type":"prose","content":"You shall speak to him and put the words in his mouth, and I will be with your mouth and with his mouth and will teach you both what to do."}],[{"type":"prose","content":"He shall speak for you to the people, and he shall be your mouth, and you shall be as God to him."}],[{"type":"prose","content":"And take in your hand this staff, with which you shall do the signs.”"},{"type":"header","content":"Moses Returns to Egypt"}],[{"type":"prose","content":"Moses went back to Jethro his father-in-law and said to him, “Please let me go back to my brothers in Egypt to see whether they are still alive.” And Jethro said to Moses, “Go in peace.”"}],[{"type":"prose","content":"And the  said to Moses in Midian, “Go back to Egypt, for all the men who were seeking your life are dead.”"}],[{"type":"prose","content":"So Moses took his wife and his sons and had them ride on a donkey, and went back to the land of Egypt. And Moses took the staff of God in his hand."}],[{"type":"prose","content":"And the  said to Moses, “When you go back to Egypt, see that you do before Pharaoh all the miracles that I have put in your power. But I will harden his heart, so that he will not let the people go."}],[{"type":"prose","content":"Then you shall say to Pharaoh, ‘Thus says the , Israel is my firstborn son,"}],[{"type":"prose","content":"and I say to you, “Let my son go that he may serve me.” If you refuse to let him go, behold, I will kill your firstborn son.’”"}],[{"type":"prose","content":"At a lodging place on the way the  met him and sought to put him to death."}],[{"type":"prose","content":"Then Zipporah took a flint and cut off her son's foreskin and touched Moses' feet with it and said, “Surely you are a bridegroom of blood to me!”"}],[{"type":"prose","content":"So he let him alone. It was then that she said, “A bridegroom of blood,” because of the circumcision."}],[{"type":"prose","content":"The  said to Aaron, “Go into the wilderness to meet Moses.” So he went and met him at the mountain of God and kissed him."}],[{"type":"prose","content":"And Moses told Aaron all the words of the  with which he had sent him to speak, and all the signs that he had commanded him to do."}],[{"type":"prose","content":"Then Moses and Aaron went and gathered together all the elders of the people of Israel."}],[{"type":"prose","content":"Aaron spoke all the words that the  had spoken to Moses and did the signs in the sight of the people."}],[{"type":"prose","content":"And the people believed; and when they heard that the  had visited the people of Israel and that he had seen their affliction, they bowed their heads and worshiped."}]]