[{"header":"Chapter 4"},{"num":1,"verse":"“But,” objected Moses, “suppose they do not believe me or listen to me? For they may say, ‘The Lord did not appear to you.’” "},{"num":2,"verse":"The Lord said to him: What is in your hand? “A staff,” he answered. "},{"num":3,"verse":"God said: Throw it on the ground. So he threw it on the ground and it became a snake, and Moses backed away from it. "},{"num":4,"verse":"Then the Lord said to Moses: Now stretch out your hand and take hold of its tail. So he stretched out his hand and took hold of it, and it became a staff in his hand. "},{"num":5,"verse":"That is so they will believe that the Lord, the God of their ancestors, the God of Abraham, the God of Isaac, and the God of Jacob, did appear to you."},{"num":6,"verse":"Again the Lord said to him: Put your hand into the fold of your garment. So he put his hand into the fold of his garment, and when he drew it out, there was his hand covered with scales, like snowflakes. "},{"num":7,"verse":"Then God said: Put your hand back into the fold of your garment. So he put his hand back into the fold of his garment, and when he drew it out, there it was again like his own flesh. "},{"num":8,"verse":"If they do not believe you or pay attention to the message of the first sign, they should believe the message of the second sign. "},{"num":9,"verse":"And if they do not believe even these two signs and do not listen to you, take some water from the Nile and pour it on the dry land. The water you take from the Nile will become blood on the dry land."},{"num":10,"verse":"Aaron’s Office as Assistant. Moses, however, said to the Lord, “If you please, my Lord, I have never been eloquent, neither in the past nor now that you have spoken to your servant; but I am slow of speech and tongue.” "},{"num":11,"verse":"The Lord said to him: Who gives one person speech? Who makes another mute or deaf, seeing or blind? Is it not I, the Lord? "},{"num":12,"verse":"Now go, I will assist you in speaking and teach you what you are to say. "},{"num":13,"verse":"But he said, “If you please, my Lord, send someone else!” "},{"num":14,"verse":"Then the Lord became angry with Moses and said: I know there is your brother, Aaron the Levite, who is a good speaker; even now he is on his way to meet you. When he sees you, he will truly be glad. "},{"num":15,"verse":"You will speak to him and put the words in his mouth. I will assist both you and him in speaking and teach you both what you are to do. "},{"num":16,"verse":"He will speak to the people for you: he will be your spokesman, and you will be as God to him. "},{"num":17,"verse":"Take this staff in your hand; with it you are to perform the signs."},{"num":18,"verse":"Moses’ Return to Egypt. After this Moses returned to Jethro his father-in-law and said to him, “Let me return to my kindred in Egypt, to see whether they are still living.” Jethro replied to Moses, “Go in peace.” "},{"num":19,"verse":"Then the Lord said to Moses in Midian: Return to Egypt, for all those who sought your life are dead. "},{"num":20,"verse":"So Moses took his wife and his sons, mounted them on the donkey, and started back to the land of Egypt. Moses took the staff of God with him. "},{"num":21,"verse":"The Lord said to Moses: On your return to Egypt, see that you perform before Pharaoh all the wonders I have put in your power. But I will harden his heart and he will not let the people go. "},{"num":22,"verse":"So you will say to Pharaoh, Thus says the Lord: Israel is my son, my firstborn. "},{"num":23,"verse":"I said to you: Let my son go, that he may serve me. Since you refused to let him go, I will kill your son, your firstborn."},{"num":24,"verse":"On the journey, at a place where they spent the night, the Lord came upon Moses and sought to put him to death. "},{"num":25,"verse":"But Zipporah took a piece of flint and cut off her son’s foreskin and, touching his feet, she said, “Surely you are a spouse of blood to me.” "},{"num":26,"verse":"So God let Moses alone. At that time she said, “A spouse of blood,” in regard to the circumcision."},{"num":27,"verse":"The Lord said to Aaron: Go into the wilderness to meet Moses. So he went; when meeting him at the mountain of God, he kissed him. "},{"num":28,"verse":"Moses told Aaron everything the Lord had sent him to say, and all the signs he had commanded him to do. "},{"num":29,"verse":"Then Moses and Aaron went and gathered all the elders of the Israelites. "},{"num":30,"verse":"Aaron told them everything the Lord had said to Moses, and he performed the signs before the people. "},{"num":31,"verse":"The people believed, and when they heard that the Lord had observed the Israelites and had seen their affliction, they knelt and bowed down."}]