[{"num":4,"verse":"And Moshe answered and said, But, what if they will not believe me, nor pay heed unto my voice but will say, Hashem hath not appeared unto thee."},{"num":2,"verse":"And Hashem said unto him, What is that in thine yad? And he said, A matteh (a rod, staff)."},{"num":3,"verse":"And He said, Cast it on the ground. And he cast it on the ground, and it became a nachash; and Moshe fled from before it."},{"num":4,"verse":"And Hashem said unto Moshe, Put forth thine yad, and take it by the tail. And he put forth his yad, and caught it, and it became a matteh in his yad;"},{"num":5,"verse":"That they may believe that Hashem Elohei Avotam, Elohei Avraham, Elohei Yitzchak, and Elohei Ya’akov, hath appeared unto thee."},{"num":6,"verse":"And Hashem said furthermore unto him, Put now thine yad into thy kheyk. And he put his yad into his kheyk; and when he took it out, hinei, his yad was leprous as snow."},{"num":7,"verse":"And He said, Put thine yad into thy kheyk again. And he put his yad into his kheyk again; and plucked it out of his kheyk, and, hinei, it was turned again as his other basar."},{"num":8,"verse":"And it shall come to pass, if they will not believe thee, neither pay heed to the voice of haOt Harishon, that they will believe the voice of haOt haAcharon."},{"num":9,"verse":"And it shall come to pass, if they will not believe also these two otot, neither pay heed unto thy voice, that thou shalt take of the mayim of the Nile, and pour it upon the yabashah (dry land); and the mayim which thou takest out of the Nile shall become dahm upon the yabashah."},{"num":10,"verse":"And Moshe said unto Hashem, O Adonoi, I am not an ish devarim, neither heretofore, nor since Thou hast spoken unto Thy eved; but I am slow of speech, and of a slow lashon."},{"num":11,"verse":"And Hashem said unto him, Who hath made man’s peh (mouth)? Or who maketh dumb, or deaf, or seeing, or blind? Is it not I, Hashem?"},{"num":12,"verse":"Now therefore go, and Eh-heh-yeh (I will be) with thy mouth, and teach thee what thou shalt say."},{"num":13,"verse":"And he said, O Adonoi, send, now, by the yad of him whom Thou wilt send."},{"num":14,"verse":"And the Af Hashem was kindled against Moshe, and He said, Is there not Aharon thy ach the Levi? I know that he can speak well. And also, hinei, he cometh forth to meet thee; and when he seeth thee, he will be glad in his lev."},{"num":15,"verse":"And thou shalt speak unto him, and put words in his mouth; and Eh-heh-yeh (I will be) with thy mouth, and with his mouth, and will teach you what ye shall do."},{"num":16,"verse":"And he shall be thy spokesman unto the people; and he shall be, even he shall be to thee instead of a mouth, and thou shalt be to him instead of Elohim."},{"num":17,"verse":"And thou shalt take this matteh in thine yad, wherewith thou shalt do haOtot."},{"num":18,"verse":"And Moshe went and returned to Yitro his khoten (father-in-law), and said unto him, Let me go, now, and return unto my achim which are in Mitzrayim, and see whether they be yet alive. And Yitro said to Moshe, Lech l’shalom (go in peace)."},{"num":19,"verse":"And Hashem said unto Moshe in Midyan, Go, shuv (return) into Mitzrayim; for all the anashim are dead which sought thy life."},{"num":20,"verse":"And Moshe took his isha and his banim, and set them upon a donkey, and he returned to Eretz Mitzrayim; and matteh HaElohim in his yad."},{"num":21,"verse":"And Hashem said unto Moshe, When thou goest to return into Mitzrayim, see that thou do all those mofetim before Pharaoh, which I have put in thine yad: but I will harden his lev, that he shall not let HaAm go."},{"num":22,"verse":"And thou shalt say unto Pharaoh, Thus saith Hashem, Yisroel is beni (My son), even My bechor (first-born):"},{"num":23,"verse":"And I say unto thee, Let beni (My son) go, that he may serve Me: and if thou refuse to let him go, hinei, I will slay thy ben, even thy bechor."},{"num":24,"verse":"And it came to pass on the derech at the malon, that Hashem met him, and sought to kill him."},{"num":25,"verse":"Then Tzipporah took a sharp stone, and cut off the arlat ben (foreskin of son) of her, and cast it at his feet, and said, Surely a choson damim (a bridegroom of blood) art thou to me."},{"num":26,"verse":"So He let him go; then she said, A choson damim thou art, because of the circumcision (i.e., [bris] milah)."},{"num":27,"verse":"And Hashem said to Aharon, Go into the midbar to meet Moshe. And he went, and met him in the Har HaElohim, and kissed him."},{"num":28,"verse":"And Moshe told Aharon kol divrei Hashem who had sent him, and all haOtot He had commanded him."},{"num":29,"verse":"And Moshe and Aharon went and assembled together kol Ziknei Bnei Yisroel;"},{"num":30,"verse":"And Aharon spoke all hadevarim which Hashem had spoken unto Moshe; and he did haOtot before the eyes of HaAm."},{"num":31,"verse":"And HaAm believed; and when they heard that Hashem had visited the Bnei Yisroel, and that He had looked upon their oni, then they bowed their heads and worshiped."}]