[{"header":"Objections and Excuses"},{"num":4,"verse":"Then Moses said, “But look, they will not believe me or listen to my voice. They will say, ‘Adonai has not appeared to you.’”"},{"num":2,"verse":"So Adonai said to him, “What is that in your hand?”"},{"num":3,"verse":"Then He said, “Cast it on the ground.” When he cast it to the ground, it became a serpent, so Moses fled from before it. "},{"num":4,"verse":"Then Adonai said to Moses, “Stretch out your hand, and take it by the tail.” So he put out his hand, laid hold of it, and it became a staff in his hand."},{"num":5,"verse":"“This is so that they may believe Adonai, the God of their fathers—the God of Abra-ham, Isaac and Jacob—has appeared to you.”"},{"num":6,"verse":"Adonai also said to him, “Now put your hand within your cloak.” So he put his hand inside, and when he took it out, his hand had tza-ra’at—white as snow. "},{"num":7,"verse":"Then He said, “Put your hand back into your cloak.” So he put his hand back in, and when he took it out it was restored again as the rest of his skin."},{"num":8,"verse":"Then He said, “If they do not believe you, or listen to the voice of the first sign, they will believe the message of the latter sign. "},{"num":9,"verse":"But if they do not believe even these two signs nor listen to your voice, you are to take the water of the river and pour it on the dry land. The water which you take out of the river will become blood on the ground.”"},{"num":10,"verse":"But Moses said to Adonai, “Adonai, I am not a man of words—not yesterday, nor the day before, nor since You have spoken to Your servant—because I have a slow mouth and a heavy tongue.”"},{"num":11,"verse":"So Adonai said to him, “Who made man’s mouth? Or who makes a man mute or deaf, seeing or blind? Is it not I, Adonai? "},{"num":12,"verse":"Now go! I will be with your mouth and teach you what to say.”"},{"num":13,"verse":"But he said, “Please, please, send it by another hand.”"},{"num":14,"verse":"Then the anger of Adonai was kindled against Moses, so He said, “In fact, Aaron the Levite is your brother. I know that he can speak well. Moreover, he is on his way to meet you! When he sees you, he will be glad in his heart. "},{"num":15,"verse":"You are to speak to him and put the words in his mouth. I will be with your mouth and with his, and teach you what to do. "},{"num":16,"verse":"He will be your spokesman to the people, so that he may act as a mouthpiece for you, and it will be as if you were as God for him. "},{"num":17,"verse":"Now then, you must take this staff in your hand to do the signs.”"},{"header":"Moses Returns to Egypt"},{"num":18,"verse":"So Moses went, returned to his father-in-law Jethro and said to him, “Please let me go, so I may return to my kinsmen who are in Egypt and see whether they are still alive.”"},{"num":19,"verse":"Then Adonai said to Moses in Midian, “Go, return to Egypt, for all the men that sought your life are dead.” "},{"num":20,"verse":"So Moses took his wife and his sons, set them on a donkey and returned to the land of Egypt. Moses took the staff of God in his hand."},{"num":21,"verse":"Adonai said to Moses, “When you go back to Egypt, see that you do all the wonders before Pharaoh that I have put in your hand. Still, I will harden his heart, and he will not let the people go. "},{"num":22,"verse":"You are to say to Pharaoh, “This is what Adonai says: ‘Israel is My son, My firstborn. "},{"num":23,"verse":"So I have said to you, Let My son go, that he may serve Me, but you have refused to let him go. Behold, I will slay your son, your firstborn.’”"},{"num":24,"verse":"It happened along the way, at a lodging place, that Adonai met him and sought to kill him! "},{"num":25,"verse":"But Zipporah took a flint, cut off the foreskin of her son, and threw it at his feet, saying, “You are surely a bridegroom of blood to me.” "},{"num":26,"verse":"She said, “A bridegroom of blood” because of the circumcision. Then He let him alone."},{"num":27,"verse":"Now Adonai said to Aaron, “Go into the wilderness to meet Moses.” So he went and met him at the mountain of God, and kissed him. "},{"num":28,"verse":"Then Moses told Aaron all the words of Adonai with which He had been sent, along with all the signs that He had commanded him to do. "},{"num":29,"verse":"Then Moses and Aaron went and assembled all the elders of Bnei-Yisrael. "},{"num":30,"verse":"Aaron spoke all the words that Adonai had spoken to Moses and did the signs in the sight of the people. "},{"num":31,"verse":"So the people believed. When they heard that Adonai had remembered Bnei-Yisrael and had seen their affliction, they bowed their heads and worshipped."}]