[{"header":"Who Has Bewitched You? Do You Live By The Spirit And Faith, Or The Flesh And Law?"},{"num":3,"verse":"O foolish Galatians, who bewitched you, before whose eyes Jesus Christ was portrayed as crucified? "},{"num":2,"verse":"I want to learn only this from you: did you receive the Spirit by works of the Law or by the hearing of  faith? "},{"num":3,"verse":"Are you so foolish? Having begun-with the Spirit are you now perfecting-yourselves with the flesh? "},{"num":4,"verse":"Did you suffer so many things in-vain— if indeed it really was in-vain? "},{"num":5,"verse":"Did then the One supplying you the Spirit and working miracles among you do it because-of  works of the Law, or because-of the hearing of faith?"},{"header":"The Children of Abraham Are The Ones Living By Faith, Not By The Law"},{"num":6,"verse":"Just as Abraham “ believed God and it was credited to him for righteousness” [Gen 15:6], "},{"num":7,"verse":"know then that the ones of  faith— these are the sons of Abraham. "},{"num":8,"verse":"Now the Scripture, having foreseen that God declares the Gentiles righteous by faith, announced-the-good-news-beforehand to Abraham: that “All the Gentiles will be blessed in you”[Gen 12:3]. "},{"num":9,"verse":"So then the ones of faith are being blessed together-with Abraham, the man-of-faith. "},{"num":10,"verse":"For all-who are of the works of the Law are under a curse, for it has been written that “Cursed is everyone who is not continuing-in all the things having been written in the book of the Law, that he might do them”[Deut 27:26]. "},{"num":11,"verse":"And that no one is declared-righteous by the Law before God is evident, because “The righteous one will live by faith” [Hab 2:4]. "},{"num":12,"verse":"But the Law is not of faith, but “The one having done these things shall live by them” [Lev 18:5]. "},{"num":13,"verse":"Christ redeemed us from the curse of the Law, having become a curse for us— because it has been written, “Cursed is everyone hanging on a tree” [Deut 21:23]— "},{"num":14,"verse":"in order that the blessing of  Abraham might come to the Gentiles in Christ Jesus, in order that we might receive the promise of  the Spirit through faith."},{"header":"God’s Promises To Abraham Were Not Cancelled By The Law Which Came Later"},{"num":15,"verse":"Brothers, I speak in accordance with human thinking: Though it is [a covenant] of a human, no one sets-aside or adds-conditions-to a covenant having been ratified. "},{"num":16,"verse":"Now the promises were spoken to Abraham and to his seed. He does not say [in Gen 13:15] “and to seeds”, as-though speaking in reference to many; but as-though speaking in reference to one, “and to your seed”— who is Christ. "},{"num":17,"verse":"And this I say: the Law, having come-about after four-hundred and thirty years, does not un-ratify the covenant having been previously-ratified by God, so as to do-away-with the promise. "},{"num":18,"verse":"For if the inheritance is of  the Law, it is no longer of the promise. But God has freely-given it to Abraham through the promise!"},{"header":"The Law Was Added Because of Transgressions, Until The Christ Should Come"},{"num":19,"verse":"Why then the Law? It was added because of the transgressions until which time the Seed should come to Whom the promise has been made, having been commanded through angels by the hand of a mediator. "},{"num":20,"verse":"Now a mediator is not [a mediator] of [only] one [party], but God is one."},{"header":"The Law Served To Lead Us To Faith In Christ So As To Inherit The Abrahamic Promises"},{"num":21,"verse":"Is the Law then against the promises of God? May it never be! For if a Law being able to give-life had been given, righteousness really would have been by the Law! "},{"num":22,"verse":"But the Scripture confined all things under sin, in order that the promise by faith in Jesus Christ might be given to the ones believing. "},{"num":23,"verse":"And before the faith came, we were being kept-in-custody under the Law— being confined until the faith destined to be revealed. "},{"num":24,"verse":"So then the Law has been our tutor leading-to Christ, in order that we might be declared-righteous by faith. "},{"num":25,"verse":"But the faith having come, we are no longer under a tutor! "},{"num":26,"verse":"For you all are sons of God through faith in Christ Jesus! "},{"num":27,"verse":"For all you who were baptized into Christ put-on Christ. "},{"num":28,"verse":"There is no Jew nor Greek, there is no slave nor free, there is no male and female. For you all are one in Christ Jesus. "},{"num":29,"verse":"And if you are Christ’s, then you are seed of Abraham— heirs according-to the promise."}]