[[],[{"type":"prose","content":"O thoughtless Galatians, who did bewitch you, not to obey the truth -- before whose eyes Jesus Christ was described before among you crucified?"}],[{"type":"prose","content":"this only do I wish to learn from you -- by works of law the Spirit did ye receive, or by the hearing of faith?"}],[{"type":"prose","content":"so thoughtless are ye! having begun in the Spirit, now in the flesh do ye end?"}],[{"type":"prose","content":"so many things did ye suffer in vain! if, indeed, even in vain."}],[{"type":"prose","content":"He, therefore, who is supplying to you the Spirit, and working mighty acts among you -- by works of law or by the hearing of faith [is it]?"}],[{"type":"prose","content":"according as Abraham did believe God, and it was reckoned to him -- to righteousness;"}],[{"type":"prose","content":"know ye, then, that those of faith -- these are sons of Abraham,"}],[{"type":"prose","content":"and the Writing having foreseen that by faith God doth declare righteous the nations did proclaim before the good news to Abraham --"}],[{"type":"prose","content":"`Blessed in thee shall be all the nations;' so that those of faith are blessed with the faithful Abraham,"}],[{"type":"prose","content":"for as many as are of works of law are under a curse, for it hath been written, `Cursed [is] every one who is not remaining in all things that have been written in the Book of the Law -- to do them,'"}],[{"type":"prose","content":"and that in law no one is declared righteous with God, is evident, because `The righteous by faith shall live;'"}],[{"type":"prose","content":"and the law is not by faith, but -- `The man who did them shall live in them.'"}],[{"type":"prose","content":"Christ did redeem us from the curse of the law, having become for us a curse, for it hath been written, `Cursed is every one who is hanging on a tree,'"}],[{"type":"prose","content":"that to the nations the blessing of Abraham may come in Christ Jesus, that the promise of the Spirit we may receive through the faith."}],[{"type":"prose","content":"Brethren, as a man I say [it], even of man a confirmed covenant no one doth make void or doth add to,"}],[{"type":"prose","content":"and to Abraham were the promises spoken, and to his seed; He doth not say, `And to seeds,' as of many, but as of one, `And to thy seed,' which is Christ;"}],[{"type":"prose","content":"and this I say, A covenant confirmed before by God to Christ, the law, that came four hundred and thirty years after, doth not set aside, to make void the promise,"}],[{"type":"prose","content":"for if by law [be] the inheritance, [it is] no more by promise, but to Abraham through promise did God grant [it]."}],[{"type":"prose","content":"Why, then, the law? on account of the transgressions it was added, till the seed might come to which the promise hath been made, having been set in order through messengers in the hand of a mediator --"}],[{"type":"prose","content":"and the mediator is not of one, and God is one --"}],[{"type":"prose","content":"the law, then, [is] against the promises of God? -- let it not be! for if a law was given that was able to make alive, truly by law there would have been the righteousness,"}],[{"type":"prose","content":"but the Writing did shut up the whole under sin, that the promise by faith of Jesus Christ may be given to those believing."}],[{"type":"prose","content":"And before the coming of the faith, under law we were being kept, shut up to the faith about to be revealed,"}],[{"type":"prose","content":"so that the law became our child-conductor -- to Christ, that by faith we may be declared righteous,"}],[{"type":"prose","content":"and the faith having come, no more under a child-conductor are we,"}],[{"type":"prose","content":"for ye are all sons of God through the faith in Christ Jesus,"}],[{"type":"prose","content":"for as many as to Christ were baptized did put on Christ;"}],[{"type":"prose","content":"there is not here Jew or Greek, there is not here servant nor freeman, there is not here male and female, for all ye are one in Christ Jesus;"}],[{"type":"prose","content":"and if ye [are] of Christ then of Abraham ye are seed, and according to promise -- heirs."}]]