[{"num":10,"verse":"Now de I egō,  Paul Paulos myself autos,  appeal parakaleō to  you hymeis by dia the ho meekness prautēs and kai gentleness epieikeia of ho Christ Christos—I  who hos when kata present prosōpon am “ timid tapeinos”  among en you hymeis,  but de when  away apeimi am  “ bold tharreō”  toward eis you hymeis. "},{"num":2,"verse":"I  ask deomai · de that  when  I  am  present pareimi I  may  not mē have  to  be  “ bold tharreō,”  with ho such  a  confidence pepoithēsis as hos I  expect logizomai I  will  dare tolmaō to  use  against epi those tis who ho think logizomai that  we hēmeis are  walking peripateō according kata to  the  flesh sarx. "},{"num":3,"verse":"For gar though  we  walk peripateō in en the  flesh sarx, we are  not ou waging war  according kata to  the  flesh sarx, "},{"num":4,"verse":"for gar the ho weapons hoplon of ho our hēmeis warfare strateia are  not ou of  the  flesh sarkikos,  but alla are  empowered dynatos by ho God theos for pros tearing kathairesis down  strongholds ochurōma.  We  tear  down kathaireō arguments logismos"},{"num":5,"verse":"and kai every pas lofty hypsōma idea  that  is  raised epairō against kata the ho knowledge gnōsis of ho God theos,  and kai we  take  captive aichmalōtizō every pas thought noēma to eis make  it  · ho obey hypakoē · ho Christ Christos. "},{"num":6,"verse":"And kai we  are echō ready en hetoimos to  avenge ekdikeō every pas act  of  disobedience parakoē,  whenever hotan your hymeis obedience hypakoē becomes  complete plēroō.  · ho"},{"num":7,"verse":"You  are  looking blepō · ho at kata outward prosōpon appearances .  If ei anyone tis has  persuaded peithō himself heautou that  he  belongs eimi to  Christ Christos,  he  should  remind logizomai himself epi heautou that hoti just  as kathōs he autos belongs  to  Christ Christos,  so houtōs also kai do  we hēmeis. "},{"num":8,"verse":"For gar even te if ean I  boast  about kauchaomai it tis, and  more  than  that perissoteros,  about peri the ho authority exousia which hos the ho Lord kyrios gave didōmi us hēmeis for eis building oikodomē you  up  and kai not ou for eis tearing kathairesis you hymeis down, I will  not ou be ashamed. "},{"num":9,"verse":"I  do  not mē want  to hina seem dokeō as hōs though  I  am  trying  to  frighten ekphobeō you hymeis with dia my ho letters epistolē. "},{"num":10,"verse":"For hoti some  are  saying phēmi, “ His ho letters epistolē are  weighty barys and kai forceful ischuros,  but de his ho physical sōma presence parousia · ho is  weak asthenēs,  and kai his ho rhetoric logos amounts  to  nothing exoutheneō.” "},{"num":11,"verse":"Let logizomai such  a  person toioutos consider logizomai this houtos,  · ho that hoti what hoios we  are eimi in ho word logos through dia letters epistolē when  absent apeimi,  such toioutos we  also kai are  in ho act ergon when  present pareimi. "},{"num":12,"verse":"For gar we  would  not ou dare tolmaō to  classify enkrinō or ē compare synkrinō ourselves heautou with  some tis of  those ho who  are  recommending synistēmi themselves heautou.  Rather alla,  when metreō they autos measure metreō themselves heautou by en themselves heautou and kai compare synkrinō themselves heautou by  themselves heautou,  they  are  without ou understanding syniēmi. "},{"num":13,"verse":"We hēmeis,  however de,  will kauchaomai not ou boast kauchaomai beyond eis · ho proper ametros limits ,  but alla only  within kata the ho measure metron of  the ho sphere kanōn of  action  which hos God theos has  assigned merizō to  us hēmeis · ho as  a  measure metron,  extending ephikneomai even kai as  far  as achri you hymeis. "},{"num":14,"verse":"For gar it is  not ou as hōs though  we  had  not mē come ephikneomai to eis you hymeis,  over-reaching hyperekteinō ourselves heautou,  for gar we  did  come phthanō even kai as  far  as achri you hymeis with en the ho gospel euangelion of ho Christ Christos. "},{"num":15,"verse":"We will  not ou go  beyond eis · ho proper  limits ametros by  boasting kauchaomai in en the  labors kopos of  others allotrios,  but de we  have echō hope elpis that  as  your hymeis faith pistis continues  to  grow auxanō,  · ho our hēmeis area  of  activity kanōn among en you hymeis will  be  greatly eis enlarged megalynō,  · ho"},{"num":16,"verse":"so  that eis we  may  preach  the  gospel euangelizō in  places ho beyond hyperekeina you hymeis,  not ou boasting  about kauchaomai the work  already eis done  in en another allotrios person’ s  territory kanōn.  · ho"},{"num":17,"verse":"But  rather de, “ Let kauchaomai the ho one  who  boasts kauchaomai,  boast kauchaomai in en the  Lord kyrios.” "},{"num":18,"verse":"For gar it is  not ou the ho one  who  recommends synistēmi himself heautou who ekeinos is eimi approved dokimos,  but alla the  one  whom hos the ho Lord kyrios recommends synistēmi. "}]