[{"header":"Paul Speaks Up for His Service to the Church"},{"num":10,"verse":"Christ is humble and free of pride. Because of this, I make my appeal to you. I, Paul, am the one you call “shy” when I am face to face with you. But when I am away from you, you think I am “bold” toward you. "},{"num":2,"verse":"I am coming to see you. Please don’t make me be as bold as I expect to be toward some people. They think that I live the way the people of this world live. "},{"num":3,"verse":"I do live in the world. But I don’t fight my battles the way the people of the world do. "},{"num":4,"verse":"The weapons I fight with are not the weapons the world uses. In fact, it is just the opposite. My weapons have the power of God to destroy the camps of the enemy. "},{"num":5,"verse":"I destroy every claim and every reason that keeps people from knowing God. I keep every thought under control in order to make it obey Christ. "},{"num":6,"verse":"Until you have obeyed completely, I will be ready to punish you every time you don’t obey."},{"num":7,"verse":"You are judging only by how things look on the surface. Suppose someone is sure they belong to Christ. Then they should consider again that we belong to Christ just as much as they do. "},{"num":8,"verse":"Do I brag too much about the authority the Lord gave me? If I do, it’s because I want to build you up, not tear you down. And I’m not ashamed of that kind of bragging. "},{"num":9,"verse":"Don’t think that I’m trying to scare you with my letters. "},{"num":10,"verse":"Some say, “His letters sound important. They are powerful. But in person he doesn’t seem like much. And what he says doesn’t amount to anything.” "},{"num":11,"verse":"People like that have a lot to learn. What I say in my letters when I’m away from you, I will do in my actions when I’m with you."},{"num":12,"verse":"I don’t dare to compare myself with those who praise themselves. I’m not that kind of person. They measure themselves by themselves. They compare themselves with themselves. When they do that, they are not wise. "},{"num":13,"verse":"But I won’t brag more than I should. God himself has given me an opportunity for serving. I will only brag about what I have done with that opportunity. This opportunity for serving also includes you. "},{"num":14,"verse":"I am not going too far in my bragging. I would be going too far if I hadn’t come to where you live. But I did get there with the good news about Christ. "},{"num":15,"verse":"And I won’t brag about work done by others. If I did, I would be bragging more than I should. As your faith continues to grow, I hope that my work among you will greatly increase. "},{"num":16,"verse":"Then I will be able to preach the good news in the areas beyond you. I don’t want to brag about work already done in someone else’s territory. "},{"num":17,"verse":"But, “The one who brags should brag about what the Lord has done.” (Jeremiah 9:24) "},{"num":18,"verse":"Those who praise themselves are not accepted. Those the Lord praises are accepted."}]