[{"num":3,"verse":"For behold, the Lord, the Lord of hosts, is taking away from Jerusalem and from Judah the stay and the staff [every kind of prop], the whole stay of bread and the whole stay of water,"},{"num":2,"verse":"The mighty man and the man of war, the judge and the [professional] prophet, the one who foretells by divination and the old man,"},{"num":3,"verse":"The captain of fifty and the man of rank, the counselor and the expert craftsman and the skillful enchanter."},{"num":4,"verse":"And I will make boys their princes, and with childishness shall they rule over them [with outrage instead of justice]."},{"num":5,"verse":"And the people shall be oppressed, each one by another, and each one by his neighbor; the child shall behave himself proudly and with insolence against the old man, and the lowborn against the honorable [person of rank]."},{"num":6,"verse":"When a man shall take hold of his brother in the house of his father, saying, You have a robe, you shall be our judge and ruler, and this heap of ruins shall be under your control—"},{"num":7,"verse":"In that day he will answer, saying, I will not be a healer and one who binds up; I am not a physician. For in my house is neither bread nor clothing; you shall not make me judge and ruler of the people."},{"num":8,"verse":"For Jerusalem is ruined and Judah is fallen, because their speech and their deeds are against the Lord, to provoke the eyes of His glory and defy His glorious presence."},{"num":9,"verse":"Their respecting of persons and showing of partiality witnesses against them; they proclaim their sin like Sodom; they do not hide it. Woe to them! For they have brought evil [as a reward upon themselves]."},{"num":10,"verse":"Say to the righteous that it shall be well with them, for they shall eat the fruit of their deeds."},{"num":11,"verse":"Woe to the wicked! It shall be ill with them, for what their hands have done shall be done to them."},{"num":12,"verse":"As for My people, children are their oppressors, and women rule over them. O My people, your leaders cause you to err, and they confuse (destroy and swallow up) the course of your paths."},{"num":13,"verse":"The Lord stands up to contend, and stands to judge the peoples and His people."},{"num":14,"verse":"The Lord enters into judgment with the elders of His people and their princes: For [by your exactions and oppressions you have robbed the people and ruined the country] you have devoured the vineyard; the spoil of the poor is in your houses."},{"num":15,"verse":"What do you mean by crushing My people and grinding the faces of the poor? says the Lord God of hosts."},{"num":16,"verse":"Moreover, the Lord said, Because the daughters of Zion are haughty and walk with outstretched necks and with undisciplined (flirtatious and alluring) eyes, tripping along with mincing and affected gait, and making a tinkling noise with [the anklets on] their feet,"},{"num":17,"verse":"Therefore the Lord will smite with a scab the crown of the heads of the daughters of Zion [making them bald], and the Lord will cause them to be [taken as captives and to suffer the indignity of being] stripped naked."},{"num":18,"verse":"In that day the Lord will take away the finery of their tinkling anklets, the caps of network, the crescent head ornaments,"},{"num":19,"verse":"The pendants, the bracelets or chains, and the spangled face veils and scarfs,"},{"num":20,"verse":"The headbands, the short ankle chains [attached from one foot to the other to insure a measured gait], the sashes, the perfume boxes, the amulets or charms [suspended from the ears or neck],"},{"num":21,"verse":"The signet rings and nose rings,"},{"num":22,"verse":"The festal robes, the cloaks, the stoles and shawls, and the handbags,"},{"num":23,"verse":"The hand mirrors, the fine linen [undergarments], the turbans, and the [whole body-enveloping] veils."},{"num":24,"verse":"And it shall come to pass that instead of the sweet odor of spices there shall be the stench of rottenness; and instead of a girdle, a rope; and instead of well-set hair, baldness; and instead of a rich robe, a girding of sackcloth; and searing [of captives by the scorching heat] instead of beauty."},{"num":25,"verse":"Your men shall fall by the sword, and your mighty men in battle."},{"num":26,"verse":"And [Jerusalem’s] gates shall lament and mourn [as those who wail for the dead]; and she, being ruined and desolate, shall sit upon the ground."}]