[{"header":"Circumcision—Proof of the Agreement"},{"num":17,"verse":"When Abram was 99 years old, the Lord appeared to him. He said, “I am God All-Powerful. Obey me and live the right way."},{"num":2,"verse":"If you do this, I will prepare an agreement between us. I will promise to make your people a great nation.”"},{"num":3,"verse":"Then Abram bowed down before God. God said to him,"},{"num":4,"verse":"“This is my part of our agreement: I will make you the father of many nations."},{"num":5,"verse":"I will change your name from Abram to Abraham, because I am making you the father of many nations."},{"num":6,"verse":"I will give you many descendants. New nations and kings will come from you."},{"num":7,"verse":"And I will prepare an agreement between me and you. This agreement will also be for all your descendants. It will continue forever. I will be your God and the God of all your descendants."},{"num":8,"verse":"And I will give this land to you and to all your descendants. I will give you the land you are traveling through—the land of Canaan. I will give you this land forever, and I will be your God.”"},{"num":9,"verse":"Then God said to Abraham, “Now, this is your part of the agreement: You and all your descendants will obey my agreement."},{"num":10,"verse":"This is my agreement that all of you must obey. This is the agreement between me and you and all your descendants. Every male must be circumcised."},{"num":11,"verse":"You will cut the skin to show that you follow the agreement between me and you."},{"num":12,"verse":"When the baby boy is eight days old, you will circumcise him. Every boy born among your people and every boy who is a slave of your people must be circumcised."},{"num":13,"verse":"So every baby boy in your nation will be circumcised. Every boy who is born from your family or bought as a slave will be circumcised."},{"num":14,"verse":"Abraham, this is the agreement between you and me: Any male who is not circumcised will be cut off from his people because he has broken my agreement.”"},{"header":"Isaac—the Promised Son"},{"num":15,"verse":"God said to Abraham, “I will give Sarai, your wife, a new name. Her new name will be Sarah."},{"num":16,"verse":"I will bless her. I will give her a son, and you will be the father. She will be the mother of many new nations. Kings of nations will come from her.”"},{"num":17,"verse":"Abraham bowed his face to the ground to show he respected God. But he laughed and said to himself, “I am 100 years old. I cannot have a son, and Sarah is 90 years old. She cannot have a child.”"},{"num":18,"verse":"Then Abraham said to God, “I hope Ishmael will live and serve you.”"},{"num":19,"verse":"God said, “No, I said that your wife Sarah will have a son. You will name him Isaac. I will make my agreement with him that will continue forever with all his descendants."},{"num":20,"verse":"“You mentioned Ishmael, and I heard you. I will bless him, and he will have many children. He will be the father of twelve great leaders. His family will become a great nation."},{"num":21,"verse":"But I will make my agreement with Isaac, the son who Sarah will have. He will be born at this same time next year.”"},{"num":22,"verse":"After God finished talking with Abraham, God went up into heaven."},{"num":23,"verse":"Then Abraham gathered together Ishmael and all the slaves born in his house. He also gathered all the slaves he had bought. Every man and boy in Abraham’s house was gathered together, and they were all circumcised. Abraham circumcised them that day, just as God had told him to do."},{"num":24,"verse":"Abraham was 99 years old when he was circumcised."},{"num":25,"verse":"And Ishmael, his son, was 13 years old when he was circumcised."},{"num":26,"verse":"Abraham and his son were circumcised on the same day."},{"num":27,"verse":"Also, on that day all the men in Abraham’s house were circumcised. All the slaves born in his house and all the slaves he had bought were circumcised."}]