[{"header":"Circumcision, the Sign of the Covenant"},{"num":17,"verse":"When Abram was ninety-nine years old, the Lord appeared to him and said, “I am the Almighty God. Obey me and always do what is right. "},{"num":2,"verse":"I will make my covenant with you and give you many descendants.” "},{"num":3,"verse":"Abram bowed down with his face touching the ground, and God said, "},{"num":4,"verse":"“I make this covenant with you: I promise that you will be the ancestor of many nations. "},{"num":5,"verse":"Your name will no longer be Abram, but Abraham, because I am making you the ancestor of many nations. "},{"num":6,"verse":"I will give you many descendants, and some of them will be kings. You will have so many descendants that they will become nations."},{"num":7,"verse":"“I will keep my promise to you and to your descendants in future generations as an everlasting covenant. I will be your God and the God of your descendants. "},{"num":8,"verse":"I will give to you and to your descendants this land in which you are now a foreigner. The whole land of Canaan will belong to your descendants forever, and I will be their God.”"},{"num":9,"verse":"God said to Abraham, “You also must agree to keep the covenant with me, both you and your descendants in future generations. "},{"num":10,"verse":"You and your descendants must all agree to circumcise every male among you. "},{"num":11,"verse":"From now on you must circumcise every baby boy when he is eight days old, including slaves born in your homes and slaves bought from foreigners. This will show that there is a covenant between you and me. "},{"num":13,"verse":"Each one must be circumcised, and this will be a physical sign to show that my covenant with you is everlasting. "},{"num":14,"verse":"Any male who has not been circumcised will no longer be considered one of my people, because he has not kept the covenant with me.”"},{"num":15,"verse":"God said to Abraham, “You must no longer call your wife Sarai; from now on her name is Sarah. "},{"num":16,"verse":"I will bless her, and I will give you a son by her. I will bless her, and she will become the mother of nations, and there will be kings among her descendants.”"},{"num":17,"verse":"Abraham bowed down with his face touching the ground, but he began to laugh when he thought, “Can a man have a child when he is a hundred years old? Can Sarah have a child at ninety?” "},{"num":18,"verse":"He asked God, “Why not let Ishmael be my heir?”"},{"num":19,"verse":"But God said, “No. Your wife Sarah will bear you a son and you will name him Isaac. I will keep my covenant with him and with his descendants forever. It is an everlasting covenant. "},{"num":20,"verse":"I have heard your request about Ishmael, so I will bless him and give him many children and many descendants. He will be the father of twelve princes, and I will make a great nation of his descendants. "},{"num":21,"verse":"But I will keep my covenant with your son Isaac, who will be born to Sarah about this time next year.” "},{"num":22,"verse":"When God finished speaking to Abraham, he left him."},{"num":23,"verse":"On that same day Abraham obeyed God and circumcised his son Ishmael and all the other males in his household, including the slaves born in his home and those he had bought. "},{"num":24,"verse":"Abraham was ninety-nine years old when he was circumcised, "},{"num":25,"verse":"and his son Ishmael was thirteen. "},{"num":26,"verse":"They were both circumcised on the same day, "},{"num":27,"verse":"together with all of Abraham's slaves."}]