[{"header":"The Covenant of Circumcision"},{"num":17,"verse":"When Abram was 99 years old, the Lord appeared to him. He said, “I am the Mighty God. Walk faithfully with me. Live in a way that pleases me. "},{"num":2,"verse":"I will now act on my covenant between me and you. I will greatly increase the number of your children after you.”"},{"num":3,"verse":"Abram fell with his face to the ground. God said to him, "},{"num":4,"verse":"“This is my covenant with you. You will be the father of many nations. "},{"num":5,"verse":"You will not be called Abram anymore. Your name will be Abraham, because I have made you a father of many nations. "},{"num":6,"verse":"I will greatly increase the number of your children after you. Nations and kings will come from you. "},{"num":7,"verse":"I will make my covenant with you last forever. It will be between me and you and your family after you for all time to come. I will be your God. And I will be the God of all your family after you. "},{"num":8,"verse":"You are now living in Canaan as an outsider. But I will give you the whole land of Canaan. You will own it forever and so will all your family after you. And I will be their God.”"},{"num":9,"verse":"Then God said to Abraham, “You must keep my covenant. You and your family after you must keep it for all time to come. "},{"num":10,"verse":"Here is my covenant that you and your family after you must keep. You and every male among you must be circumcised. "},{"num":11,"verse":"That will be the sign of the covenant between me and you. "},{"num":12,"verse":"It must be done for all time to come. Every male among you who is eight days old must be circumcised. That includes those who are born into your own family or outside it. It also includes those bought with money from a stranger. "},{"num":13,"verse":"So any male born into your family or bought with your money must be circumcised. My covenant will last forever. Your body will have the mark of my covenant on it. "},{"num":14,"verse":"Any male who has not been circumcised will be separated from his people. He has broken my covenant.”"},{"num":15,"verse":"God also said to Abraham, “Do not continue to call your wife by the name Sarai. Her name will be Sarah. "},{"num":16,"verse":"I will give her my blessing. You can be sure that I will give you a son by her. I will bless her so that she will be the mother of nations. Kings of nations will come from her.”"},{"num":17,"verse":"Abraham fell with his face to the ground. He laughed and said to himself, “Can a 100-year-old man have a son? Can Sarah have a child at the age of 90?” "},{"num":18,"verse":"Abraham said to God, “I really wish Ishmael could receive your blessing!”"},{"num":19,"verse":"Then God said, “Yes, I will bless Ishmael. But your wife Sarah will have a son by you. And you will name him Isaac. I will establish my covenant with him. That covenant will last forever. It will be for Isaac and his family after him. "},{"num":20,"verse":"I have heard what you said about Ishmael. I will surely bless him. I will make his family very large. He will be the father of 12 rulers. And I will make him into a great nation. "},{"num":21,"verse":"But I will establish my covenant with Isaac. By this time next year, Sarah will have a son by you.” "},{"num":22,"verse":"When God had finished speaking with Abraham, God left him."},{"num":23,"verse":"On that same day Abraham circumcised his son Ishmael. He also circumcised every male who was born into his family or bought with his money. He did exactly as God had told him. "},{"num":24,"verse":"Abraham was 99 years old when he was circumcised. "},{"num":25,"verse":"His son Ishmael was 13. "},{"num":26,"verse":"Abraham and his son Ishmael were both circumcised on that same day. "},{"num":27,"verse":"And every male in Abraham’s household was circumcised along with him. That included those born into his family or bought from a stranger."}]