[[],[{"type":"header","content":"The Sign of the Covenant"},{"type":"prose","content":"When Abram was ninety-nine years old, the  appeared to Abram, and said to him, “I am God Almighty; walk before me, and be blameless. "}],[{"type":"prose","content":"And I will make my covenant between me and you, and will make you exceedingly numerous.” "}],[{"type":"prose","content":"Then Abram fell on his face; and God said to him, "}],[{"type":"prose","content":"“As for me, this is my covenant with you: You shall be the ancestor of a multitude of nations. "}],[{"type":"prose","content":"No longer shall your name be Abram, but your name shall be Abraham; for I have made you the ancestor of a multitude of nations. "}],[{"type":"prose","content":"I will make you exceedingly fruitful; and I will make nations of you, and kings shall come from you. "}],[{"type":"prose","content":"I will establish my covenant between me and you, and your offspring after you throughout their generations, for an everlasting covenant, to be God to you and to your offspring after you. "}],[{"type":"prose","content":"And I will give to you, and to your offspring after you, the land where you are now an alien, all the land of Canaan, for a perpetual holding; and I will be their God.”"}],[{"type":"prose","content":"God said to Abraham, “As for you, you shall keep my covenant, you and your offspring after you throughout their generations. "}],[{"type":"prose","content":"This is my covenant, which you shall keep, between me and you and your offspring after you: Every male among you shall be circumcised. "}],[{"type":"prose","content":"You shall circumcise the flesh of your foreskins, and it shall be a sign of the covenant between me and you. "}],[{"type":"prose","content":"Throughout your generations every male among you shall be circumcised when he is eight days old, including the slave born in your house and the one bought with your money from any foreigner who is not of your offspring. "}],[{"type":"prose","content":"Both the slave born in your house and the one bought with your money must be circumcised. So shall my covenant be in your flesh an everlasting covenant. "}],[{"type":"prose","content":"Any uncircumcised male who is not circumcised in the flesh of his foreskin shall be cut off from his people; he has broken my covenant.”"}],[{"type":"prose","content":"God said to Abraham, “As for Sarai your wife, you shall not call her Sarai, but Sarah shall be her name. "}],[{"type":"prose","content":"I will bless her, and moreover I will give you a son by her. I will bless her, and she shall give rise to nations; kings of peoples shall come from her.” "}],[{"type":"prose","content":"Then Abraham fell on his face and laughed, and said to himself, “Can a child be born to a man who is a hundred years old? Can Sarah, who is ninety years old, bear a child?” "}],[{"type":"prose","content":"And Abraham said to God, “O that Ishmael might live in your sight!” "}],[{"type":"prose","content":"God said, “No, but your wife Sarah shall bear you a son, and you shall name him Isaac. I will establish my covenant with him as an everlasting covenant for his offspring after him. "}],[{"type":"prose","content":"As for Ishmael, I have heard you; I will bless him and make him fruitful and exceedingly numerous; he shall be the father of twelve princes, and I will make him a great nation. "}],[{"type":"prose","content":"But my covenant I will establish with Isaac, whom Sarah shall bear to you at this season next year.” "}],[{"type":"prose","content":"And when he had finished talking with him, God went up from Abraham."}],[{"type":"prose","content":"Then Abraham took his son Ishmael and all the slaves born in his house or bought with his money, every male among the men of Abraham’s house, and he circumcised the flesh of their foreskins that very day, as God had said to him. "}],[{"type":"prose","content":"Abraham was ninety-nine years old when he was circumcised in the flesh of his foreskin. "}],[{"type":"prose","content":"And his son Ishmael was thirteen years old when he was circumcised in the flesh of his foreskin. "}],[{"type":"prose","content":"That very day Abraham and his son Ishmael were circumcised; "}],[{"type":"prose","content":"and all the men of his house, slaves born in the house and those bought with money from a foreigner, were circumcised with him."}]]