[{"num":11,"verse":"A false balance and unrighteous dealings are extremely offensive and shamefully sinful to the Lord, but a just weight is His delight."},{"num":2,"verse":"When swelling and pride come, then emptiness and shame come also, but with the humble (those who are lowly, who have been pruned or chiseled by trial, and renounce self) are skillful and godly Wisdom and soundness."},{"num":3,"verse":"The integrity of the upright shall guide them, but the willful contrariness and crookedness of the treacherous shall destroy them."},{"num":4,"verse":"Riches provide no security in any day of wrath and judgment, but righteousness (uprightness and right standing with God) delivers from death."},{"num":5,"verse":"The righteousness of the blameless shall rectify and make plain their way and keep it straight, but the wicked shall fall by their own wickedness."},{"num":6,"verse":"The righteousness of the upright [their rectitude in every area and relation] shall deliver them, but the treacherous shall be taken in their own iniquity and greedy desire."},{"num":7,"verse":"When the wicked man dies, his hope [for the future] perishes; and the expectation of the godless comes to nothing."},{"num":8,"verse":"The [uncompromisingly] righteous is delivered out of trouble, and the wicked gets into it instead."},{"num":9,"verse":"With his mouth the godless man destroys his neighbor, but through knowledge and superior discernment shall the righteous be delivered."},{"num":10,"verse":"When it goes well with the [uncompromisingly] righteous, the city rejoices, but when the wicked perish, there are shouts of joy."},{"num":11,"verse":"By the blessing of the influence of the upright and God’s favor [because of them] the city is exalted, but it is overthrown by the mouth of the wicked."},{"num":12,"verse":"He who belittles and despises his neighbor lacks sense, but a man of understanding keeps silent."},{"num":13,"verse":"He who goes about as a talebearer reveals secrets, but he who is trustworthy and faithful in spirit keeps the matter hidden."},{"num":14,"verse":"Where no wise guidance is, the people fall, but in the multitude of counselors there is safety."},{"num":15,"verse":"He who becomes security for an outsider shall smart for it, but he who hates suretyship is secure [from its penalties]."},{"num":16,"verse":"A gracious and good woman wins honor [for her husband], and violent men win riches but a woman who hates righteousness is a throne of dishonor for him."},{"num":17,"verse":"The merciful, kind, and generous man benefits himself [for his deeds return to bless him], but he who is cruel and callous [to the wants of others] brings on himself retribution."},{"num":18,"verse":"The wicked man earns deceitful wages, but he who sows righteousness (moral and spiritual rectitude in every area and relation) shall have a sure reward [permanent and satisfying]."},{"num":19,"verse":"He who is steadfast in righteousness (uprightness and right standing with God) attains to life, but he who pursues evil does it to his own death."},{"num":20,"verse":"They who are willfully contrary in heart are extremely disgusting and shamefully vile in the eyes of the Lord, but such as are blameless and wholehearted in their ways are His delight!"},{"num":21,"verse":"Assuredly [I pledge it] the wicked shall not go unpunished, but the multitude of the [uncompromisingly] righteous shall be delivered."},{"num":22,"verse":"As a ring of gold in a swine’s snout, so is a fair woman who is without discretion."},{"num":23,"verse":"The desire of the [consistently] righteous brings only good, but the expectation of the wicked brings wrath."},{"num":24,"verse":"There are those who [generously] scatter abroad, and yet increase more; there are those who withhold more than is fitting or what is justly due, but it results only in want."},{"num":25,"verse":"The liberal person shall be enriched, and he who waters shall himself be watered."},{"num":26,"verse":"The people curse him who holds back grain [when the public needs it], but a blessing [from God and man] is upon the head of him who sells it."},{"num":27,"verse":"He who diligently seeks good seeks [God’s] favor, but he who searches after evil, it shall come upon him."},{"num":28,"verse":"He who leans on, trusts in, and is confident in his riches shall fall, but the [uncompromisingly] righteous shall flourish like a green bough."},{"num":29,"verse":"He who troubles his own house shall inherit the wind, and the foolish shall be servant to the wise of heart."},{"num":30,"verse":"The fruit of the [uncompromisingly] righteous is a tree of life, and he who is wise captures human lives [for God, as a fisher of men—he gathers and receives them for eternity]."},{"num":31,"verse":"Behold, the [uncompromisingly] righteous shall be recompensed on earth; how much more the wicked and the sinner! And if the righteous are barely saved, what will become of the ungodly and wicked?"}]