[{"num":3,"verse":"Were you raised from death with Christ? Then look for the things which are in heaven. There Christ is sitting at the right hand of God."},{"num":2,"verse":"Think about the things that are in heaven, not about things that are on earth."},{"num":3,"verse":"Your old life died with Christ and your new life is kept with Christ in God."},{"num":4,"verse":"Christ is our life. When he comes again and is seen, then you will also be seen with him. And you will be great."},{"num":5,"verse":"So then, put to death those things of this world which are in you. I mean these things: wrong sex, things that are not clean, a heart that is burning to do wrong things, wanting what is wrong, and wanting to have what other people have. This last one is like worshipping an idol."},{"num":6,"verse":"They are things that make God angry."},{"num":7,"verse":"You used to do these things when you lived that way."},{"num":8,"verse":"But now you must stop all these: being angry, hating people, wrong feelings toward others, saying wrong things about people, and dirty talking."},{"num":9,"verse":"Do not tell lies to one another. You have stopped being the person you used to be who did wrong things."},{"num":10,"verse":"And now you have become a new person. That new person is always learning more and more until he becomes like God who made him."},{"num":11,"verse":"In this new person, there is no difference between a Greek and a Jew. There is no difference between a man who is circumcised with the mark of the Jew and a man who is not circumcised. There is no difference between a person from a friendly country or someone from a country which is not friendly. There is no difference between a slave and a person who is free. Christ is everything and is in all of them."},{"num":12,"verse":"You are chosen by God. He loves you and has made you holy. So then, care for one another. Be kind. Do not be proud. Be humble. Be patient."},{"num":13,"verse":"Be patient with one another. If any one has a complaint against another, forgive that one. Christ forgave you. So you should forgive each other."},{"num":14,"verse":"Beside all these, you must have love. This joins everything together as it should be."},{"num":15,"verse":"Hold on to the peace of God which is in your hearts. You were called to have peace because you are all like one body. Be thankful."},{"num":16,"verse":"Let your hearts be filled with the word of Christ. Be very wise when you teach people and help them to understand what is right and wrong. Sing with music. Sing praises and Christian songs. Sing to the Lord with praise in your hearts."},{"num":17,"verse":"Whatever you say, or whatever you do, do everything in the name of the Lord Jesus. Give thanks to God the Father through Jesus."},{"num":18,"verse":"Wives, obey your husbands. This is the right way to live when you belong to the Lord."},{"num":19,"verse":"Husbands, love your wives and do not be unkind to them."},{"num":20,"verse":"Children, obey your parents in everything. This pleases the Lord."},{"num":21,"verse":"Fathers, do not make your children angry. They might stop trying to do right."},{"num":22,"verse":"Servants, obey your boss in everything. Obey always, not only when he is looking at you as if you were pleasing a man. Do it with all your heart because you respect the Lord."},{"num":23,"verse":"Whatever your work is, do it gladly. Do it as you would do it unto the Lord and not for people."},{"num":24,"verse":"You know you will get pay from the Lord, for you are the servants of the Lord Christ."},{"num":25,"verse":"The person who does wrong will be punished for the wrong he has done. God does not love one person more than another."}]