[{"num":3,"verse":"If, then, ye were raised with the Christ, the things above seek ye, where the Christ is, on the right hand of God seated,"},{"num":2,"verse":"the things above mind ye, not the things upon the earth,"},{"num":3,"verse":"for ye did die, and your life hath been hid with the Christ in God;"},{"num":4,"verse":"when the Christ -- our life -- may be manifested, then also we with him shall be manifested in glory."},{"num":5,"verse":"Put to death, then, your members that [are] upon the earth -- whoredom, uncleanness, passion, evil desire, and the covetousness, which is idolatry --"},{"num":6,"verse":"because of which things cometh the anger of God upon the sons of the disobedience,"},{"num":7,"verse":"in which also ye -- ye did walk once, when ye lived in them;"},{"num":8,"verse":"but now put off, even ye, the whole -- anger, wrath, malice, evil-speaking, filthy talking -- out of your mouth."},{"num":9,"verse":"Lie not one to another, having put off the old man with his practices,"},{"num":10,"verse":"and having put on the new, which is renewed in regard to knowledge, after the image of Him who did create him;"},{"num":11,"verse":"where there is not Greek and Jew, circumcision and uncircumcision, foreigner, Scythian, servant, freeman -- but the all and in all -- Christ."},{"num":12,"verse":"Put on, therefore, as choice ones of God, holy and beloved, bowels of mercies, kindness, humble-mindedness, meekness, long-suffering,"},{"num":13,"verse":"forbearing one another, and forgiving each other, if any one with any one may have a quarrel, as also the Christ did forgive you -- so also ye;"},{"num":14,"verse":"and above all these things, [have] love, which is a bond of the perfection,"},{"num":15,"verse":"and let the peace of God rule in your hearts, to which also ye were called in one body, and become thankful."},{"num":16,"verse":"Let the word of Christ dwell in you richly, in all wisdom, teaching and admonishing each other, in psalms, and hymns, and spiritual songs, in grace singing in your hearts to the Lord;"},{"num":17,"verse":"and all, whatever ye may do in word or in work, [do] all things in the name of the Lord Jesus -- giving thanks to the God and Father, through him."},{"num":18,"verse":"The wives! be subject to your own husbands, as is fit in the Lord;"},{"num":19,"verse":"the husbands! love your wives, and be not bitter with them;"},{"num":20,"verse":"the children! obey the parents in all things, for this is well-pleasing to the Lord;"},{"num":21,"verse":"the fathers! vex not your children, lest they be discouraged."},{"num":22,"verse":"The servants! obey in all things those who are masters according to the flesh, not in eye-service as men-pleasers, but in simplicity of heart, fearing God;"},{"num":23,"verse":"and all, whatever ye may do -- out of soul work -- as to the Lord, and not to men,"},{"num":24,"verse":"having known that from the Lord ye shall receive the recompense of the inheritance -- for the Lord Christ ye serve;"},{"num":25,"verse":"and he who is doing unrighteously shall receive what he did unrighteously, and there is no acceptance of persons."}]