[{"header":"A Collection for God’s People"},{"num":16,"verse":"When you collect money for God’s people, I want you to do exactly what I told the churches in Galatia to do. "},{"num":2,"verse":"That is, each Sunday each of you must put aside part of what you have earned. If you do this, you won’t have to take up a collection when I come. "},{"num":3,"verse":"Choose some followers to take the money to Jerusalem. I will send them on with the money and with letters which show that you approve of them. "},{"num":4,"verse":"If you think I should go along, they can go with me."},{"header":"Paul’s Travel Plans"},{"num":5,"verse":"After I have gone through Macedonia, I hope to see you "},{"num":6,"verse":"and visit with you for a while. I may even stay all winter, so that you can help me on my way to wherever I will be going next. "},{"num":7,"verse":"If the Lord lets me, I would rather come later for a longer visit than to stop off now for only a short visit. "},{"num":8,"verse":"I will stay in Ephesus until Pentecost, "},{"num":9,"verse":"because there is a wonderful opportunity for me to do some work here. But there are also many people who are against me."},{"num":10,"verse":"When Timothy arrives, give him a friendly welcome. He is doing the Lord’s work, just as I am. "},{"num":11,"verse":"Don’t let anyone mistreat him. I am looking for him to return to me together with the other followers. So when he leaves, send him off with your blessings."},{"num":12,"verse":"I have tried hard to get our friend Apollos to visit you with the other followers. He doesn’t want to come just now, but he will come when he can."},{"header":"Personal Concerns and Greetings"},{"num":13,"verse":"Keep alert. Be firm in your faith. Stay brave and strong. "},{"num":14,"verse":"Show love in everything you do."},{"num":15,"verse":"You know that Stephanas and his family were the first in Achaia to have faith in the Lord. They have done all they can for God’s people. My friends, I ask you "},{"num":16,"verse":"to obey leaders like them and to do the same for all others who work hard with you."},{"num":17,"verse":"I was glad to see Stephanas and Fortunatus and Achaicus. Having them here was like having you. "},{"num":18,"verse":"They made me feel much better, just as they made you feel better. You should appreciate people like them."},{"num":19,"verse":"Greetings from the churches in Asia."},{"num":20,"verse":"All of the Lord’s followers send their greetings."},{"num":21,"verse":"I am signing this letter myself: PAUL."},{"num":22,"verse":"I pray that God will put a curse on everyone who doesn’t love the Lord. And may the Lord come soon."},{"num":23,"verse":"I pray that the Lord Jesus will be kind to you."},{"num":24,"verse":"I love everyone who belongs to Christ Jesus."}]