[{"num":16,"verse":"Of the gathering for the saints: as I have arranged in the congregations of Galatia, let you do the same. "},{"num":2,"verse":"Upon some Sunday, let every one of you put aside at home and lay up whatever he thinks meet, so that there will be no gatherings when I come. "},{"num":3,"verse":"When I have come, whomever you may approve by your letters, them I will send to bring your gift to Jerusalem. "},{"num":4,"verse":"And if it seems that I should go, they may go with me."},{"num":5,"verse":"I want to come to you after I have gone over Macedonia, for I will be going throughout Macedonia. "},{"num":6,"verse":"Perhaps I will stay with you a while, or over the winter, so that you may bring me on my way wherever I go. "},{"num":7,"verse":"I do not want to see you now in passing, but I trust to stay a while with you, if God permits. "},{"num":8,"verse":"I will remain at Ephesus until Pentecost, "},{"num":9,"verse":"for a great door, and fruitful, is opened to me, and there are many adversaries."},{"num":10,"verse":"If Timothy comes, see that he be without fear with you. For he works the work of the Lord, as I do. "},{"num":11,"verse":"Let no one dishonour him, but send him onwards in peace, so that he may come to me. For I am waiting for him with the brethren."},{"num":12,"verse":"To speak of brother Apollos: I greatly urged him to go to you with the brethren, but his mind was not at all to go at this time. However, he will go when he has the opportunity."},{"num":13,"verse":"Watch, stand fast in the faith, acquit yourselves like men, and be strong. "},{"num":14,"verse":"Let all you do be done in love."},{"num":15,"verse":"Brethren, you know the house of Stephanas, how they are the first fruits of Achaia, and that they have devoted themselves to minister to the saints. "},{"num":16,"verse":"I beseech you to show regard for such persons, and to all who help and labour. "},{"num":17,"verse":"I am glad of the coming of Stephanas, Fortunatus, and Achaicus, for that which was missing on your part, they have supplied. "},{"num":18,"verse":"They have comforted my spirit and yours. See therefore that you acknowledge such people."},{"num":19,"verse":"The congregations of Asia greet you. Aquila and Priscilla greet you heartily in the Lord, and so does the congregation that is in their house. "},{"num":20,"verse":"All the brethren greet you. Greet one another with a holy kiss."},{"num":21,"verse":"The greeting of me, Paul, with my own hand. "},{"num":22,"verse":"If anyone does not love the Lord Jesus Christ, the same be anathema maranatha. "},{"num":23,"verse":"The grace of the Lord Jesus Christ be with you all. "},{"num":24,"verse":"My love be with you all in Christ Jesus. Amen."}]