[{"num":16,"verse":"And concerning the collection that [is] for the saints, as I directed to the assemblies of Galatia, so also ye -- do ye;"},{"num":2,"verse":"on every first [day] of the week, let each one of you lay by him, treasuring up whatever he may have prospered, that when I may come then collections may not be made;"},{"num":3,"verse":"and whenever I may come, whomsoever ye may approve, through letters, these I will send to carry your favour to Jerusalem;"},{"num":4,"verse":"and if it be meet for me also to go, with me they shall go."},{"num":5,"verse":"And I will come unto you, when I pass through Macedonia -- for Macedonia I do pass through --"},{"num":6,"verse":"and with you, it may be, I will abide, or even winter, that ye may send me forward whithersoever I go,"},{"num":7,"verse":"for I do not wish to see you now in the passing, but I hope to remain a certain time with you, if the Lord may permit;"},{"num":8,"verse":"and I will remain in Ephesus till the Pentecost,"},{"num":9,"verse":"for a door to me hath been opened -- great and effectual -- and withstanders [are] many."},{"num":10,"verse":"And if Timotheus may come, see that he may become without fear with you, for the work of the Lord he doth work, even as I,"},{"num":11,"verse":"no one, then, may despise him; and send ye him forward in peace, that he may come to me, for I expect him with the brethren;"},{"num":12,"verse":"and concerning Apollos our brother, much I did entreat him that he may come unto you with the brethren, and it was not at all [his] will that he may come now, and he will come when he may find convenient."},{"num":13,"verse":"Watch ye, stand in the faith; be men, be strong;"},{"num":14,"verse":"let all your things be done in love."},{"num":15,"verse":"And I entreat you, brethren, ye have known the household of Stephanas, that it is the first-fruit of Achaia, and to the ministration to the saints they did set themselves --"},{"num":16,"verse":"that ye also be subject to such, and to every one who is working with [us] and labouring;"},{"num":17,"verse":"and I rejoice over the presence of Stephanas, and Fortunatus, and Achaicus, because the lack of you did these fill up;"},{"num":18,"verse":"for they did refresh my spirit and yours; acknowledge ye, therefore, those who [are] such."},{"num":19,"verse":"Salute you do the assemblies of Asia; salute you much in the Lord do Aquilas and Priscilla, with the assembly in their house;"},{"num":20,"verse":"salute you do all the brethren; salute ye one another in an holy kiss."},{"num":21,"verse":"The salutation of [me] Paul with my hand;"},{"num":22,"verse":"if any one doth not love the Lord Jesus Christ -- let him be anathema! The Lord hath come!"},{"num":23,"verse":"The grace of the Lord Jesus Christ [is] with you;"},{"num":24,"verse":"my love [is] with you all in Christ Jesus. Amen."}]