[{"header":"Honor Widows"},{"num":5,"verse":"Do not sharply reprimand an older man, but appeal to him as [you would to] a father, to younger men as brothers, "},{"num":2,"verse":"to older women as mothers, to younger women as sisters, in all purity [being careful to maintain appropriate relationships]."},{"num":3,"verse":"Honor and help those widows who are truly widowed [alone, and without support]. "},{"num":4,"verse":"But if a widow has children or grandchildren [who are adults], see to it that these first learn to show great respect to their own family [as their religious duty and natural obligation], and to compensate their parents or grandparents [for their upbringing]; for this is acceptable and pleasing in the sight of God. "},{"num":5,"verse":"Now a woman who is really a widow and has been left [entirely] alone [without adequate income] trusts in God and continues in supplications and prayers night and day. "},{"num":6,"verse":"Whereas she who lives for pleasure and self-indulgence is spiritually dead even while she still lives. "},{"num":7,"verse":"Keep instructing [the people to do] these things as well, so that they may be blameless and beyond reproach. "},{"num":8,"verse":"If anyone fails to provide for his own, and especially for those of his own family, he has denied the faith [by disregarding its precepts] and is worse than an unbeliever [who fulfills his obligation in these matters]."},{"num":9,"verse":"A widow is to be put on the list [to receive regular assistance] only if she is over sixty years of age, [having been] the wife of one man, "},{"num":10,"verse":"and has a reputation for good deeds; [she is eligible] if she has brought up children, if she has shown hospitality to strangers, if she has washed the feet of the saints (God’s people), if she has assisted the distressed, and has devoted herself to doing good in every way. "},{"num":11,"verse":"But refuse [to enroll the] younger widows, for when they feel their natural desires in disregard of Christ, they wish to marry again, "},{"num":12,"verse":"and so they incur condemnation for having set aside their previous pledge. "},{"num":13,"verse":"Now at the same time, they also learn to be idle as they go from house to house; and not only idle, but also gossips and busybodies [meddlers in things that do not concern them], talking about things they should not mention. "},{"num":14,"verse":"So I want younger widows to get married, have children, manage their households, and not give opponents of the faith any occasion for slander. "},{"num":15,"verse":"Some [widows] have already turned away [from the faith] to follow Satan. "},{"num":16,"verse":"If any believing woman has [dependent] widows [in her household], she must assist them [according to her ability]; and the church must not be burdened [with them], so that it may assist those who are truly widows [those who are all alone and are dependent]."},{"header":"Concerning Elders"},{"num":17,"verse":"The elders who perform their leadership duties well are to be considered worthy of double honor (financial support), especially those who work hard at preaching and teaching [the word of God concerning eternal salvation through Christ]. "},{"num":18,"verse":"For the Scripture says, “You shall not muzzle the ox while it is treading out the grain [to keep it from eating],” and, “The worker is worthy of his wages [he deserves fair compensation].” "},{"num":19,"verse":"Do not accept an accusation against an elder unless it is based on [the testimony of at least] two or three witnesses. "},{"num":20,"verse":"As for those [elders] who continue in sin, reprimand them in the presence of all [the congregation], so that the rest will be warned. "},{"num":21,"verse":"I solemnly charge you in the presence of God and of Christ Jesus and of His chosen angels that you guard and keep these rules without bias, doing nothing out of favoritism. "},{"num":22,"verse":"Do not hurry to lay hands on anyone [ordaining and approving someone for ministry or an office in the church, or in reinstating expelled offenders], and thereby share in the sins of others; keep yourself free from sin."},{"num":23,"verse":"No longer continue drinking [only] water, but use a little wine for the sake of your stomach and your frequent illnesses."},{"num":24,"verse":"The sins of some people are conspicuous, leading the way for them into judgment [so that they are clearly not qualified for ministry]; but the sins of others appear later [for they are hidden and follow behind them]. "},{"num":25,"verse":"Likewise, good deeds are quite evident, and those which are otherwise cannot be hidden [indefinitely]."}]