[{"num":5,"verse":"Do not sharply censure or rebuke an older man, but entreat and plead with him as [you would with] a father. Treat younger men like brothers;"},{"num":2,"verse":"[Treat] older women like mothers [and] younger women like sisters, in all purity."},{"num":3,"verse":"[Always] treat with great consideration and give aid to those who are truly widowed (solitary and without support)."},{"num":4,"verse":"But if a widow has children or grandchildren, see to it that these are first made to understand that it is their religious duty [to defray their natural obligation to those] at home, and make return to their parents or grandparents [for all their care by contributing to their maintenance], for this is acceptable in the sight of God."},{"num":5,"verse":"Now [a woman] who is a real widow and is left entirely alone and desolate has fixed her hope on God and perseveres in supplications and prayers night and day,"},{"num":6,"verse":"Whereas she who lives in pleasure and self-gratification [giving herself up to luxury and self-indulgence] is dead even while she [still] lives."},{"num":7,"verse":"Charge [the people] thus, so that they may be without reproach and blameless."},{"num":8,"verse":"If anyone fails to provide for his relatives, and especially for those of his own family, he has disowned the faith [by failing to accompany it with fruits] and is worse than an unbeliever [who performs his obligation in these matters]."},{"num":9,"verse":"Let no one be put on the roll of widows [who are to receive church support] who is under sixty years of age or who has been the wife of more than one man;"},{"num":10,"verse":"And she must have a reputation for good deeds, as one who has brought up children, who has practiced hospitality to strangers [of the brotherhood], washed the feet of the saints, helped to relieve the distressed, [and] devoted herself diligently to doing good in every way."},{"num":11,"verse":"But refuse [to enroll on this list the] younger widows, for when they become restive and their natural desires grow strong, they withdraw themselves against Christ [and] wish to marry [again]."},{"num":12,"verse":"And so they incur condemnation for having set aside and slighted their previous pledge."},{"num":13,"verse":"Moreover, as they go about from house to house, they learn to be idlers, and not only idlers, but gossips and busybodies, saying what they should not say and talking of things they should not mention."},{"num":14,"verse":"So I would have younger [widows] marry, bear children, guide the household, [and] not give opponents of the faith occasion for slander or reproach."},{"num":15,"verse":"For already some [widows] have turned aside after Satan."},{"num":16,"verse":"If any believing woman or believing man has [relatives or persons in the household who are] widows, let him relieve them; let the church not be burdened [with them], so that it may [be free to] assist those who are truly widows (those who are all alone and are dependent)."},{"num":17,"verse":"Let the elders who perform the duties of their office well be considered doubly worthy of honor [and of adequate financial support], especially those who labor faithfully in preaching and teaching."},{"num":18,"verse":"For the Scripture says, You shall not muzzle an ox when it is treading out the grain, and again, The laborer is worthy of his hire."},{"num":19,"verse":"Listen to no accusation [presented before a judge] against an elder unless it is confirmed by the testimony of two or three witnesses."},{"num":20,"verse":"As for those who are guilty and persist in sin, rebuke and admonish them in the presence of all, so that the rest may be warned and stand in wholesome awe and fear."},{"num":21,"verse":"I solemnly charge you in the presence of God and of Christ Jesus and of the chosen angels that you guard and keep [these rules] without personal prejudice or favor, doing nothing from partiality."},{"num":22,"verse":"Do not be in a hurry in the laying on of hands [giving the sanction of the church too hastily in reinstating expelled offenders or in ordination in questionable cases], nor share or participate in another man’s sins; keep yourself pure."},{"num":23,"verse":"Drink water no longer exclusively, but use a little wine for the sake of your stomach and your frequent illnesses."},{"num":24,"verse":"The sins of some men are conspicuous (openly evident to all eyes), going before them to the judgment [seat] and proclaiming their sentence in advance; but the sins of others appear later [following the offender to the bar of judgment and coming into view there]."},{"num":25,"verse":"So also, good deeds are evident and conspicuous, and even when they are not, they cannot remain hidden [indefinitely]."}]