[{"num":5,"verse":"Do  not mē rebuke epiplēssō but alla encourage parakaleō an  older  man presbyteros as hōs a  father patēr,  younger  men neos as hōs brothers adelphos, "},{"num":2,"verse":"older  women presbyteros as hōs mothers mētēr,  younger  women neos as hōs sisters adelphē with en all pas purity hagneia. "},{"num":3,"verse":"Honor timaō widows chēra who ho are  truly ontōs widows chēra. "},{"num":4,"verse":"But de if ei a  certain tis widow chēra has echō children teknon or ē grandchildren ekgonos,  let  them  learn manthanō to  show  godliness eusebeō first prōton to eusebeō · ho their  own idios household oikos and kai to  make apodidōmi some  return amoibē to  their ho parents progonos;  for gar this houtos is eimi pleasing apodektos before enōpion · ho God theos. "},{"num":5,"verse":"But de the ho true ontōs widow chēra,  · kai who  has  been  left  totally  alone monoō,  has  set  her  hope elpizō on epi God theos and kai continues prosmenō in ho entreaties deēsis and kai · ho prayers proseuchē night nyx and kai day hēmera. "},{"num":6,"verse":"But de the ho one  who  has  lived  for  pleasure spatalaō,  even  though  living zaō,  has  died thnēskō. "},{"num":7,"verse":"Command parangellō these  things houtos as  well kai,  so  that hina they  may  be eimi above  reproach anepilēmptos. "},{"num":8,"verse":"But de if ei anyone tis does pronoeō not ou care  for pronoeō · ho his  own idios,  · kai especially malista his  household  members oikeios,  he  has  disowned arneomai the ho faith pistis and kai is eimi worse cheirōn than  an  unbeliever apistos. "},{"num":9,"verse":"Let  a  widow chēra be  enrolled katalegō if  she  is ginomai not mē less  than elassōn sixty hexēkonta years  old etos, a  woman gynē of  one heis man anēr, "},{"num":10,"verse":"being  witnessed  to martyreō by en good kalos deeds ergon,  if ei she  raised  children teknotropheō,  if ei she  showed  hospitality xenodocheō,  if ei she  washed niptō the  feet pous of  the  saints hagios,  if ei she  helped eparkeō the  afflicted thlibō,  if ei she  earnestly  pursued epakoloutheō every pas good agathos work ergon. "},{"num":11,"verse":"But de refuse paraiteomai to enroll  younger neos widows chēra,  for gar when hotan their  passions  draw  them  away katastrēniaō from ho Christ Christos,  they  desire thelō to  marry gameō"},{"num":12,"verse":"and  come echō under  judgment krima since hoti they  abandoned atheteō their ho former prōtos faith pistis. "},{"num":13,"verse":"But de at  the  same  time hama they manthanō also kai learn manthanō to be  idlers argos,  flitting  about perierchomai among  · ho houses oikia,  but de not ou only monon idlers argos but alla also kai gossips phlyaros and kai busybodies periergos,  speaking laleō about  things ho that  they  should dei not mē. "},{"num":14,"verse":"So oun,  I  wish boulomai younger neos widows  to  marry gameō,  to  bear  children teknogoneō,  to  manage  their  households oikodespoteō,  to  give didōmi the ho Accuser antikeimai no mēdeis occasion aphormē for charin slander loidoria, "},{"num":15,"verse":"for gar some tis have  already ēdē strayed ektrepō after opisō · ho Satan Satanas. "},{"num":16,"verse":"If ei any tis believing pistos woman  has echō widows chēra,  let  her  care  for eparkeō them autos,  and kai the ho church ekklēsia should  not mē be  burdened bareō so  that hina it  may  care  for eparkeō the ho true ontōs widows chēra. "},{"num":17,"verse":"Let axioō the ho elders presbyteros who  have  been  serving proistēmi well kalōs be  considered  worthy  of axioō double diplous honor timē,  namely malista,  those ho who  are  laboring  hard kopiaō at en preaching logos and kai teaching didaskalia. "},{"num":18,"verse":"For gar Scripture graphē says legō,  · ho “ Do phimoō not ou muzzle phimoō an  ox bous that  is  treading  out aloaō the grain,”  and kai, “ Worthy axios is  the ho worker ergatēs of ho his autos wage misthos.” "},{"num":19,"verse":"Do paradechomai not mē accept paradechomai an  accusation katēgoria against kata an  elder presbyteros,  except ektos ei on epi the  evidence  of  two dyo or ē three treis witnesses martys. "},{"num":20,"verse":"Confront elenchō those ho who  persist  in  sinning hamartanō before enōpion everyone pas,  so  that hina · kai the ho rest loipos may  stand  in echō fear phobos. "},{"num":21,"verse":"I  solemnly  charge diamartyromai you  before enōpion · ho God theos and kai Christ Christos Jesus Iēsous and kai the ho elect eklektos angels angelos that hina you  keep phylassō these  things houtos without chōris prejudging prokrima,  doing poieō nothing mēdeis with kata partiality prosklisis. "},{"num":22,"verse":"Do epitithēmi not mēdeis lay epitithēmi hands cheir on  anyone mēdeis quickly tacheōs or mēde share  in koinōneō the  sins hamartia of  others allotrios;  keep tēreō yourself seautou pure hagnos. "},{"num":23,"verse":"( No  longer mēketi drink  only  water hydropoteō,  but alla use chraomai a  little oligos wine oinos,  on  account  of dia your  · ho stomach stomachos and kai · ho your sy frequent pyknos illnesses astheneia.) "},{"num":24,"verse":"The ho sins hamartia of  some tis people anthrōpos are eimi conspicuous prodēlos,  going  before proagō them  into eis judgment krisis,  but de they  also kai follow  after epakoloutheō some tis. "},{"num":25,"verse":"So hōsautōs also kai the ho good kalos works ergon · ho of some are  conspicuous prodēlos,  and kai those ho that  are echō not  conspicuous allōs are dynamai not ou able dynamai to  be  hidden kryptō. "}]