[{"num":5,"verse":"Do not rebuke an elder, but encourage him as a father, and the younger men as brothers;"},{"num":2,"verse":"the elder women as mothers, the younger as sisters, with all pureness."},{"num":3,"verse":"Honor widows which are truly widows."},{"num":4,"verse":"But if any widow has children or nephews, let them learn first to show godliness toward their own house, and to repay their family. For that is an honorable thing, and acceptable before God."},{"num":5,"verse":"And she who is a true widow, and left alone, trusts in God, and continues in supplications and prayers night and day."},{"num":6,"verse":"But she who lives in pleasure is dead while she lives."},{"num":7,"verse":"Therefore, warn them of these things, so that they may be blameless."},{"num":8,"verse":"If there is anyone who does not look out for his own, and namely for those of his household, he denies the faith and is worse than an unbeliever."},{"num":9,"verse":"Do not let a widow under 60 years old be registered; who has been the wife of one husband"},{"num":10,"verse":"and has a reputation for good works (whether she has nourished her children, taken in strangers, washed the saints’ feet, ministered to those who were in adversity, and if she has constantly pursued every good work)."},{"num":11,"verse":"But refuse the younger widows. For when their desires begin to draw them away from Christ, they will marry,"},{"num":12,"verse":"having damnation because they have broken their first faith."},{"num":13,"verse":"And also, being idle, they learn to go about from house to house. Indeed, not only are they idle, but also gossips and busybodies, speaking things which are not necessary."},{"num":14,"verse":"Therefore, I desire that the younger women marry, and bear children, and govern the house, and give no opportunity for the adversary to speak evil."},{"num":15,"verse":"For some have already turned back after Satan."},{"num":16,"verse":"If any faithful man or faithful woman has widows, let them minister to them, and do not let the church be charged, so that there may be enough for those who are true widows."},{"num":17,"verse":"Let the elders who rule well have double the honor, especially those who labor in the word and doctrine."},{"num":18,"verse":"For the Scripture says, “You shall not muzzle the mouth of the ox that treads out the corn,” and, “The laborer is worthy of his wages.”"},{"num":19,"verse":"Receive no accusation against an elder unless by two or three witnesses."},{"num":20,"verse":"Rebuke those who sin openly, so that the rest may also fear."},{"num":21,"verse":"I charge you before God and the Lord Jesus Christ and the elect angels to observe these things, without preferring one to another. And do nothing with partiality."},{"num":22,"verse":"Do not quickly lay hands on anyone or share in the sins of others. Keep yourself pure."},{"num":23,"verse":"Drink water no longer. But use a little wine for your stomach’s sake, and your frequent infirmities."},{"num":24,"verse":"Some men’s sins are evident, preceding them to judgment. But some follow afterward."},{"num":25,"verse":"Likewise, good works are also evident beforehand. And those which are otherwise cannot be hidden."}]