[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And Jesus went into the temple.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Here, again, there is a gap to be filled up from another Gospel. St. Mark (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") says definitely that on the day of His solemn entry He went into the Temple, “looked round about on all things there,”—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on the scene of traffic and disorder described in this verse—and then, “the evening-tide being come” (or, “the hour being now late”), went back to Bethany, and did what is here narrated on the following day. So, with a like difference of order, St. Mark places the sentence on the barren fig-tree on the next morning, and before the cleansing of the Temple. (Comp. Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) St. John (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:13-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") records an act of like nature as occurring at the commencement of our Lord’s ministry, on the first visit to Jerusalem after His baptism. Critics who have started with the assumption that the repetition of such an act was impossible, have inferred accordingly that the narrative has been misplaced either by the Three or by St. John, some holding with the latter and some with the former, on grounds more or less arbitrary. From the purest human historical point of view, we may, I believe, accept both narratives as true. If Jesus of Nazareth had been only a patriot Jew, filled with an intense enthusiasm for the holiness of the Temple, what more likely than that He should commence His work with a protest against its desecration? If the evils against which He thus protested, after being suppressed for a time, reappeared in all their enormity, what more probable than that He should renew the protest at this stage of His work, backed as He now was by the equal enthusiasm of the people? What more natural, again, than that the second cleansing should revive the memory of the first, and call up with it the words which are recorded by St. John, and not by the Three, and which served as the basis of the charge that He had threatened to destroy the Temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:61",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 14:58",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There is—it cannot be concealed—a real difficulty in the omission of the earlier cleansing by the Three, and in the absence of any reference to the later cleansing by the Fourth; but the fact in either case is only one of many like facts incident to the structure of the Gospels. The Three knew nothing—or rather, they record nothing—as to our Lord’s ministry in Jerusalem prior to this last entry. The Fourth, writing a Gospel supplementary either to the Three or to the current oral teaching which they embodied, systematically passes over, with one or two notable exceptions, what they had recorded, and confines his work to reporting, with marvellous vividness and fulness, specially selected incidents.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Cast out them that sold and bought in the temple.—The apparent strangeness of the permission of what seems to us so manifest a desecration, was obviously not felt by the Jews as we feel it. Pilgrims came from all parts of the world to keep the Passover, to offer their sacrifices, sin-offerings, or thank-offerings, according to the circumstances of each case. They did not bring the victims with them. What plan, it might seem, could be more convenient than that they should find a market where they could buy them as near as possible to the place where the sacrifice was to be offered? One of the courts of the Temple was therefore assigned for the purpose, and probably the priests found their profit in the arrangement by charging a fee or rent of some kind for the privilege of holding stalls. There is no trace of the practice prior to the Captivity, but the dispersion of the Jews afterwards naturally led men to feel the want of such accommodation more keenly. But this permission brought with it another as its inevitable sequel. The pilgrims brought with them the coinage of their own country—Syrian, Egyptian, Greek, as the case might be—and their money was either not current in Palestine, or, as being stamped with the symbols of heathen worship, could not be received into the Corban, or treasury of the Temple. For their convenience, therefore, money-changers were wanted, who, of course, made the usual agio, or profit, on each transaction. We must picture to ourselves, in addition to all the stir and bustle inseparable from such traffic, the wrangling and bitter words and reckless oaths which necessarily grew out of it with such a people as the Jews. The history of Christian churches has not been altogether without parallels that may help us to understand how such a desecration came to be permitted. Those who remember the state of the great cathedral of London, as painted in the literature of Elizabeth and James, when mules and horses laden with market produce, were led through St. Paul’s as a matter of every-day occurrence, and bargains were struck there, and burglaries planned, and servants hired, and profligate assignations made and kept, will feel that even Christian and Protestant England has hardly the right to cast a stone at the priests and people of Jerusalem.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Cast out them that sold and bought in the temple.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The apparent strangeness of the permission of what seems to us so manifest a desecration, was obviously not felt by the Jews as we feel it. Pilgrims came from all parts of the world to keep the Passover, to offer their sacrifices, sin-offerings, or thank-offerings, according to the circumstances of each case. They did not bring the victims with them. What plan, it might seem, could be more convenient than that they should find a market where they could buy them as near as possible to the place where the sacrifice was to be offered? One of the courts of the Temple was therefore assigned for the purpose, and probably the priests found their profit in the arrangement by charging a fee or rent of some kind for the privilege of holding stalls. There is no trace of the practice prior to the Captivity, but the dispersion of the Jews afterwards naturally led men to feel the want of such accommodation more keenly. But this permission brought with it another as its inevitable sequel. The pilgrims brought with them the coinage of their own country—Syrian, Egyptian, Greek, as the case might be—and their money was either not current in Palestine, or, as being stamped with the symbols of heathen worship, could not be received into the Corban, or treasury of the Temple. For their convenience, therefore, money-changers were wanted, who, of course, made the usual ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "agio,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or profit, on each transaction. We must picture to ourselves, in addition to all the stir and bustle inseparable from such traffic, the wrangling and bitter words and reckless oaths which necessarily grew out of it with such a people as the Jews. The history of Christian churches has not been altogether without parallels that may help us to understand how such a desecration came to be permitted. Those who remember the state of the great cathedral of London, as painted in the literature of Elizabeth and James, when mules and horses laden with market produce, were led through St. Paul’s as a matter of every-day occurrence, and bargains were struck there, and burglaries planned, and servants hired, and profligate assignations made and kept, will feel that even Christian and Protestant England has hardly the right to cast a stone at the priests and people of Jerusalem.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And the seats of them that sold doves.—The Greek has the article—“the doves,” that were so familiar an object in the Temple courts. There is a characteristic feature in this incident as compared with the earlier cleansing. Then, as taking into account, apparently, the less glaringly offensive nature of the traffic, our Lord had simply bidden the dealers in doves to depart, with their stalls and bird-cages (John 2:16). Now, as if indignant at their return to the desecrating work which He had then forbidden, He places them also in the same condemnation as the others.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And the seats of them that sold doves.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The Greek has the article—“",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " doves,” that were so familiar an object in the Temple courts. There is a characteristic feature in this incident as compared with the earlier cleansing. Then, as taking into account, apparently, the less glaringly offensive nature of the traffic, our Lord had simply bidden the dealers in doves to depart, with their stalls and bird-cages (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Now, as if indignant at their return to the desecrating work which He had then forbidden, He places them also in the same condemnation as the others.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 21:12-14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:12-14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Jesus went into the temple — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He did not go up to the court, or to the palace, though he came in as a king; but to the temple; for his kingdom is spiritual, and not of this world. It is in holy things that he rules, and in the temple of God that he exercises authority. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And cast out them that sold and bought ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, doves and oxen for sacrifice. He had cast them out three years before, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) bidding them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not make ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "house a house of merchandise: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "upon the repetition of the offence, he uses sharper words; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the temple ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, in the outer court of it, where the Gentiles used to worship. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The money-changers ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The exchangers of foreign money into current coin, which those who came from distant parts might want to offer for the service of the temple. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "said unto them ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As he turned them out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is written ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 56:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My house shall be called a house of prayer ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To all nations, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That is, a place to which they shall resort for the performance of religious worship: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but ye have made it a den of thieves ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— A harbour of wicked men; a place where traffic is carried on by persons of the most infamous character, who live by deceit and oppression, and practise the vilest extortion, even in the house of the most righteous and blessed God. “Let it be observed, that the word rendered temple here, is ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ιερον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ναος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". By the latter word was meant properly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "including only the vestibule, the holy place or sanctuary, and the most holy. Whereas the former comprehended all the courts. It was in the outermost court that this sort of traffic was exercised. For want of a name, in European languages, peculiar to each, these two are confounded in most modern translations. To the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ναος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or temple, strictly so called, none of those people had access, not even our Lord himself, because not of the posterity of Aaron.” — Campbell. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the blind and lame ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Having heard of his arrival in the city, and requested their friends to lead them to the place where he was; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "came to him in the temple, and he healed them ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In the presence of all the people. “Many such afflicted persons would, no doubt, be waiting in the several avenues of the temple to ask alms, at a time when there would be such a vast concourse of people: and there seems a peculiar propriety in our Lord’s multiplying these astonishing miracles, both to vindicate the extraordinary act of authority he had just been performing, and to make this his last visit to Jerusalem as convincing as possible, that those who would not submit to him might be left so much the more inexcusable.” — Doddridge.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:12-17 Christ found some of the courts of the temple turned into a market for cattle and things used in the sacrifices, and partly occupied by the money-changers. Our Lord drove them from the place, as he had done at his entering upon his ministry, Joh 2:13-17. His works testified of him more than the hosannas; and his healing in the temple was the fulfilling the promise, that the glory of the latter house should be greater than the glory of the former. If Christ came now into many parts of his visible church, how many secret evils he would discover and cleanse! And how many things daily practised under the cloak of religion, would he show to be more suitable to a den of thieves than to a house of prayer!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This paragraph contains the account of the barren fig-tree, and of the cleansing of the temple. See also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:12-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:45-48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Matthew 21:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:12",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And Jesus went into the temple of God ... - From Mark 11:11-15, it is probable that this cleansing of the temple did not take place on the day that he entered Jerusalem in triumph, but on the day following.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Jesus went into the temple of God ... - From ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 11:11-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is probable that this cleansing of the temple did not take place on the day that he entered Jerusalem in triumph, but on the day following.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He came and looked round upon all things, Mark says, and went out to Bethany with the twelve. On the day following, returning from Bethany, he saw the fig-tree. Entering into the temple, he purified it \"on that day;\" or perhaps he \"finished\" the work of purifying it on that day, which he commenced the day before. Matthew has mentioned the purifying of the temple, which was performed, probably, on two successive days, or has stated the \"fact,\" without being particular as to the order of events. Mark has stated the order more particularly, and has \"divided\" what Matthew mentions together.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The \"temple of God,\" that is, the temple dedicated and devoted to the service of God, was built on Mount Moriah. The first temple was built by Solomon, about 1005 years before Christ, 1 Kings 6, He took seven years to build it, according to 1 Kings 6:38. David, his father, had contemplated the design of building it, and had prepared many materials for it, but was prevented because he had been a man of war, 1 Chronicles 22:1-9; 1 Kings 5:5. This temple, erected with great magnificence, remained until it was destroyed by the Babylonians under Nebuchadnezzar, 584 years before Christ, 2 Chronicles 36:6-7, 2 Chronicles 36:19.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The \"temple of God,\" that is, the temple dedicated and devoted to the service of God, was built on Mount Moriah. The first temple was built by Solomon, about 1005 years before Christ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", He took seven years to build it, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 6:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". David, his father, had contemplated the design of building it, and had prepared many materials for it, but was prevented because he had been a man of war, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 22:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This temple, erected with great magnificence, remained until it was destroyed by the Babylonians under Nebuchadnezzar, 584 years before Christ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 36:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 36:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "After the Babylonian captivity the temple was rebuilt by Zerubbabel, but with vastly inferior and diminished splendor. The aged people wept when they compared it with the glory of the former temple, Ezra 3:8, Ezra 3:12. This was called the \"second\" temple. This temple was often defiled in the wars before the time of Christ. It had become much decayed and impaired Herod the Great, being exceedingly unpopular among the Jews on account of his cruelties (see the notes at Matthew 2), was desirous of doing something to obtain the favor of the people, and accordingly, about 16 years before Christ, and in the 18th year of his reign, he commenced the work of repairing it. This he did, not by taking it down entirely at once, but by removing one part after another, until it had become, in fact, a new temple, greatly surpassing the former in magnificence. It was still called by the Jews the \"second\" temple; and by Christ's coming to this temple thus repaired, was fulfilled the prophecy in Haggai 2:9. On this building Herod employed 18,000 men, and completed it so as to be suitable for use in 9 years, or about 8 years before Christ. But additions continued to be made to it, and it continued increasing in splendor and magnificence until 64 a.d. John says John 2:20, \"forty and six years was this temple in building.\" Christ was then 30 years of age, which, added to the 16 years occupied in repairing it before his birth, makes 46 years.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "After the Babylonian captivity the temple was rebuilt by Zerubbabel, but with vastly inferior and diminished splendor. The aged people wept when they compared it with the glory of the former temple, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This was called the \"second\" temple. This temple was often defiled in the wars before the time of Christ. It had become much decayed and impaired Herod the Great, being exceedingly unpopular among the Jews on account of his cruelties (see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), was desirous of doing something to obtain the favor of the people, and accordingly, about 16 years before Christ, and in the 18th year of his reign, he commenced the work of repairing it. This he did, not by taking it down entirely at once, but by removing one part after another, until it had become, in fact, a new temple, greatly surpassing the former in magnificence. It was still called by the Jews the \"second\" temple; and by Christ's coming to this temple thus repaired, was fulfilled the prophecy in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Haggai 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". On this building Herod employed 18,000 men, and completed it so as to be suitable for use in 9 years, or about 8 years before Christ. But additions continued to be made to it, and it continued increasing in splendor and magnificence until 64 a.d. John says ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 2:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"forty and six years was this temple in building.\" Christ was then 30 years of age, which, added to the 16 years occupied in repairing it before his birth, makes 46 years.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The word \"temple\" was given not merely to the sacred edifice or house itself, but to all the numerous chambers, courts, and rooms connected with it on the top of Mount Moriah. The temple itself was a small edifice, and was surrounded by courts and chambers half a mile in circumference. Into the sacred edifice itself our Saviour never went. The high priest only went into the holy of holies, and that but once a year, and none but priests were permitted to enter the holy place. Our Saviour was neither. He was of the tribe of \"Judah,\" and he consequently was allowed to enter no further than the other Israelites into the temple. The works that he is said to have performed in the temple, therefore, are to be understood as having been performed in the courts surrounding the sacred edifice. These courts will now be described. The temple was erected on Mount Moriah. The space on the summit of the mount was not, however, large enough for the buildings necessary to be erected. It was therefore enlarged by building high walls from the valley below and filling up the space within. One of these walls was 600 feet in height. The ascent to the temple was by high flights of steps. The entrance to the temple, or to the courts on the top of the mount, was by nine gates, all of them extremely splendid. On every side they were thickly coated with gold and silver. But there was one gate of special magnificence: this was called the Beautiful Gate, Acts 3:2. It was on the east side, and was made of Corinthian brass, one of the most precious metals in ancient times. See the Introduction to 1 Corinthians, section 1. This gate was 50 cubits, or 75 feet, in height.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The word \"temple\" was given not merely to the sacred edifice or house itself, but to all the numerous chambers, courts, and rooms connected with it on the top of Mount Moriah. The temple itself was a small edifice, and was surrounded by courts and chambers half a mile in circumference. Into the sacred edifice itself our Saviour never went. The high priest only went into the holy of holies, and that but once a year, and none but priests were permitted to enter the holy place. Our Saviour was neither. He was of the tribe of \"Judah,\" and he consequently was allowed to enter no further than the other Israelites into the temple. The works that he is said to have performed in the temple, therefore, are to be understood as having been performed in the courts surrounding the sacred edifice. These courts will now be described. The temple was erected on Mount Moriah. The space on the summit of the mount was not, however, large enough for the buildings necessary to be erected. It was therefore enlarged by building high walls from the valley below and filling up the space within. One of these walls was 600 feet in height. The ascent to the temple was by high flights of steps. The entrance to the temple, or to the courts on the top of the mount, was by nine gates, all of them extremely splendid. On every side they were thickly coated with gold and silver. But there was one gate of special magnificence: this was called the Beautiful Gate, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It was on the east side, and was made of Corinthian brass, one of the most precious metals in ancient times. See the Introduction to 1 Corinthians, section 1. This gate was 50 cubits, or 75 feet, in height.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The whole temple, with all its courts, was surrounded by a wall about 25 feet in height. This was built on the wall raised from the base to the top of the mountain, so that from the top of it to the bottom, in a perpendicular descent, was in some places not far from 600 feet. This was particularly the case on the southeast corner; and it was here, probably, that Satan wished our Saviour to cast himself down. See the notes at Matthew 4:6.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The whole temple, with all its courts, was surrounded by a wall about 25 feet in height. This was built on the wall raised from the base to the top of the mountain, so that from the top of it to the bottom, in a perpendicular descent, was in some places not far from 600 feet. This was particularly the case on the southeast corner; and it was here, probably, that Satan wished our Saviour to cast himself down. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "On the inside of this wall, between the gates, were piazzas or covered porches. On the eastern, northern, and western sides there were two rows of these porches; on the south, three. These porches were covered walks, about 20 feet in width, paved with marble of different colors, with a flat roof of costly cedar, which was supported by pillars of solid marble, so large that three men could scarcely stretch their arms so as to meet around them. These walks or porches afforded a grateful shade and protection to the people in hot or stormy weather. The one on the east side was distinguished for its beauty, and was called Solomon's porch, John 10:23; Acts 3:11. It stood over the vast terrace or wall which he had raised from the valley beneath, and which was the only thing of his work that remained in the second temple.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "On the inside of this wall, between the gates, were piazzas or covered porches. On the eastern, northern, and western sides there were two rows of these porches; on the south, three. These porches were covered walks, about 20 feet in width, paved with marble of different colors, with a flat roof of costly cedar, which was supported by pillars of solid marble, so large that three men could scarcely stretch their arms so as to meet around them. These walks or porches afforded a grateful shade and protection to the people in hot or stormy weather. The one on the east side was distinguished for its beauty, and was called Solomon's porch, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 10:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 3:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It stood over the vast terrace or wall which he had raised from the valley beneath, and which was the only thing of his work that remained in the second temple.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "When a person entered any of the gates into this space within the wall he saw the temple rising before him with great magnificence; but the space was not clear all the way up to it. Going forward, he came to another wall, enclosing considerable ground, considered more holy than the rest of the hill. The space between this first and second wall was called \"the court of the Gentiles.\" It was so called because Gentiles might come into it, but they could proceed no further. On the second wall and on the gates were inscriptions in Hebrew, Greek, and Latin, forbidding any Gentile or unclean person from proceeding further on pain of death. This \"court\" was not of equal dimensions all the way round the temple. On the east, north, and west it was quite narrow. On the south it was wide, occupying nearly half of the whole surface of the hill. In this court the Gentiles might come. Here was the place where much secular business was transacted. This was the place occupied by the buyers and sellers, and by the money-changers, and which Jesus purified by casting them out.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The enclosure within the second wall was nearly twice as long from east to west as from north to south. This enclosure was also divided. The eastern part of it was called \"the court of the women;\" so called because women might advance thus far, but no farther. This court was square. It was entered by three gates; one on the north, one on the east directly opposite to the Beautiful gate, and one on the south. In passing from the court of the Gentiles to that of the women, it was necessary to ascend about 9 feet by steps. This court of the women was enclosed with a double wall, with a space between the walls about 15 feet in width, paved with marble. The inner of these two walls was much higher than the one outside. The court of the women was paved with marble. In the corners of that court were different structures for the various uses of the temple. It was in this court that the Jews commonly worshipped. Here, probably, Peter and John, with others, went up to pray, Acts 3:1. Here, too, the Pharisee and publican prayed - the Pharisee near the gate that led forward to the temple; the publican standing far off, on the other side of the court, Luke 18:9-14. Paul also was seized here, and charged with defiling the temple by bringing the Gentiles into that holy place, Acts 21:26-30.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The enclosure within the second wall was nearly twice as long from east to west as from north to south. This enclosure was also divided. The eastern part of it was called \"the court of the women;\" so called because women might advance thus far, but no farther. This court was square. It was entered by three gates; one on the north, one on the east directly opposite to the Beautiful gate, and one on the south. In passing from the court of the Gentiles to that of the women, it was necessary to ascend about 9 feet by steps. This court of the women was enclosed with a double wall, with a space between the walls about 15 feet in width, paved with marble. The inner of these two walls was much higher than the one outside. The court of the women was paved with marble. In the corners of that court were different structures for the various uses of the temple. It was in this court that the Jews commonly worshipped. Here, probably, Peter and John, with others, went up to pray, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here, too, the Pharisee and publican prayed - the Pharisee near the gate that led forward to the temple; the publican standing far off, on the other side of the court, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 18:9-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Paul also was seized here, and charged with defiling the temple by bringing the Gentiles into that holy place, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 21:26-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A high wall on the west side of the court of the women divided it from the court of the Israelites, so called because all the males of the Jews might advance there. To this court there was an ascent of fifteen steps. These steps were in the form of a half circle. The great gate to which these steps led was called the gate \"Nicanor.\" Besides this, there were three gates on each side, leading from the court of the women to the court of the Israelites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Within the court of the \"Israelites\" was the court of the \"priests,\" separated by a wall about 1 1/2 foot in height. Within that court was the altar of burnt-offering and the laver standing in front of it. Here the priests performed the daily service of the temple. In this place, also, were accommodations for the \"priests\" when not engaged in conducting the service of the temple, and for the Levites who conducted the music of the sanctuary.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The temple, properly so called, stood within this court. It surpassed in splendor all the other buildings of the holy city; perhaps in magnificence it was unequalled in the world. It fronted the east, looking down through the gates Nicanor and the Beautiful Gate, and onward to the Mount of Olives. From the Mount of Olives on the east there was a beautiful and commanding view of the whole sacred edifice. It was there that our Saviour sat when the disciples directed his attention to the goodly stones with which the temple was built, Mark 13:1. The entrance into the temple itself was from the court \"of the priests,\" by an ascent of twelve steps. The \"porch\" in front of the temple was 150 feet high and as many broad. The open space in this perch through which the temple was entered was 115 feet high and 37 broad, without doors of any sort, The appearance of this, built, as it was, with white marble, and decorated with plates of silver, from the Mount of Olives was exceedingly dazzling and splendid. Josephus says that in the rising of the sun it reflected so strong and dazzling an effulgence that the eye of the spectator was obliged to turn away. To strangers at a distance, it appeared like a mountain covered with snow, for where it was not decorated with plates of gold it was extremely white and glistening.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The temple, properly so called, stood within this court. It surpassed in splendor all the other buildings of the holy city; perhaps in magnificence it was unequalled in the world. It fronted the east, looking down through the gates Nicanor and the Beautiful Gate, and onward to the Mount of Olives. From the Mount of Olives on the east there was a beautiful and commanding view of the whole sacred edifice. It was there that our Saviour sat when the disciples directed his attention to the goodly stones with which the temple was built, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 13:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The entrance into the temple itself was from the court \"of the priests,\" by an ascent of twelve steps. The \"porch\" in front of the temple was 150 feet high and as many broad. The open space in this perch through which the temple was entered was 115 feet high and 37 broad, without doors of any sort, The appearance of this, built, as it was, with white marble, and decorated with plates of silver, from the Mount of Olives was exceedingly dazzling and splendid. Josephus says that in the rising of the sun it reflected so strong and dazzling an effulgence that the eye of the spectator was obliged to turn away. To strangers at a distance, it appeared like a mountain covered with snow, for where it was not decorated with plates of gold it was extremely white and glistening.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mt 21:10-22. Stir about Him in the City—Second Cleansing of the Temple, and Miracles There—Glorious Vindication of the Children's Testimony—The Barren Fig Tree Cursed, with Lessons from It. ( = Mr 11:11-26; Lu 19:45-48).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the exposition, see on [1334]Lu 19:45-48; and [1335]Mr 11:12-26.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 21:14\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jesus went into the temple of God,.... At Jerusalem, which was built by his order, and dedicated to his worship, and where the Shechaniah, or the divine presence was. Christ went not to the tower of David, the strong hold of Zion, the palace of his father David; for he entered not as a temporal king; but he went to the house of his heavenly Father, as the lord and proprietor of it, to preach in it, and purge it; whereby the glory of the latter house became greater than that of the former; and so several prophecies had their accomplishment, particularly ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though this was not the first time by many, of Christ's being in the temple; yet this his entrance was the most public and magnificent of any: after, he had alighted from the colt, and sent back that and the ass to their proper owners, as is very probable, he went by the eastern gate, called the king's gate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into the temple; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and cast out all them that sold and bought in the temple: not in the holy of holies, nor in the holy place, nor in the court of the priests, nor in the court of the Israelites, but in the court of the Gentiles, and in the mountain of the house, in which were shops, where various things were sold, relating to sacrifices. What these persons bought and sold, whom Christ cast out, is not said, but may be collected from John 2:14 where besides \"doves\", of which hereafter, mention is made, of \"sheep\" and \"oxen\"; which were brought to be sold, on account of the passover, for it was then near their time of passover as now; for besides the lambs and kids, which were here also sold and bought for the passover supper, sheep and oxen were here also killed and sold for the Chagiga, or feast (p), which was the day following: here likewise the drink offerings were bought and sold, of which take the following account. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and cast out all them that sold and bought in the temple: not in the holy of holies, nor in the holy place, nor in the court of the priests, nor in the court of the Israelites, but in the court of the Gentiles, and in the mountain of the house, in which were shops, where various things were sold, relating to sacrifices. What these persons bought and sold, whom Christ cast out, is not said, but may be collected from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " where besides \"doves\", of which hereafter, mention is made, of \"sheep\" and \"oxen\"; which were brought to be sold, on account of the passover, for it was then near their time of passover as now; for besides the lambs and kids, which were here also sold and bought for the passover supper, sheep and oxen were here also killed and sold for the Chagiga, or feast (p), which was the day following: here likewise the drink offerings were bought and sold, of which take the following account. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"There were fifteen presidents  \"in the sanctuary\": Jochanan ben Phinehas was over the tickets, and Ahijah over the drink offerings, &c.--He that inquired for drink offerings, went to Jochanan, who was appointed over the tickets: he gave him the money, and took a ticket; he then went to Ahijah, that was appointed over the drink offerings, and gave him the ticket, and received from him the drink offerings; and in the evening they came together, and Ahijah produced the tickets, and took for them the money (q).'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This was one way of buying and selling in the temple; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and overthrew the tables of the money changers; of which sort were they, who sat in the temple at certain times, to receive the half shekel, and change the money of such, who wanted one, by which they gained something, to themselves. It was a custom in our Lord's time, for every Israelite, once a year, to pay half a shekel towards the temple charge and service, which was founded upon the orders given by God to Moses in the wilderness; that upon his numbering the people, to take of everyone that was twenty years of age and upwards, rich or poor, half a shekel, Exodus 30:13 though this does not seem to be designed as a perpetual rule. However, it now obtained, and was annually paid: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and overthrew the tables of the money changers; of which sort were they, who sat in the temple at certain times, to receive the half shekel, and change the money of such, who wanted one, by which they gained something, to themselves. It was a custom in our Lord's time, for every Israelite, once a year, to pay half a shekel towards the temple charge and service, which was founded upon the orders given by God to Moses in the wilderness; that upon his numbering the people, to take of everyone that was twenty years of age and upwards, rich or poor, half a shekel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " though this does not seem to be designed as a perpetual rule. However, it now obtained, and was annually paid: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"On the first day of Adar (which answers to our February) they proclaimed concerning the shekels (r).'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That is, they gave public notice, in all the cities in Israel, that the time of paying the half shekel was near at hand, that they might get their money ready, for everyone was obliged to pay it: the Jews (s) say, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"it is an affirmative command of the law, that every man in Israel should pay the half shekel every year; even though a poor man that is maintained by alms, he is obliged to it, and must beg it of others, or sell his coat upon his back and pay it, as it is said, Exodus 30:15. The rich shall not give more, &c.--All are bound to give it, priests, Levites, and Israelites, and strangers, and servants, that are made free; but not women, nor servants, nor children.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"it is an affirmative command of the law, that every man in Israel should pay the half shekel every year; even though a poor man that is maintained by alms, he is obliged to it, and must beg it of others, or sell his coat upon his back and pay it, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The rich shall not give more, &c.--All are bound to give it, priests, Levites, and Israelites, and strangers, and servants, that are made free; but not women, nor servants, nor children.'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Notice being thus given (t), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"on the fifteenth day (of the same month),  \"tables\" were placed in the province, or city (which Bartenora (u) interprets of Jerusalem; but Maimonides (w) says, the word used is the name of all the cities in the land of Israel, excepting Jerusalem), and on the twenty fifth they sit,  \"in the sanctuary\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The same is related by Maimonides (x), after this manner: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"On the first of Adar they proclaim concerning the shekels, that every man may prepare his half shekel, and be ready to give it on the fifteenth;  \"the exchangers\" sit in every province or city, and mildly ask it; everyone that gives them it, they take it of them; and he that does not give, they do not compel him to give: on the twenty fifth, they sit in the sanctuary to collect it; and henceforward they urge him that does not give, until he gives; and everyone that does not give, they oblige him to give pledge, and they, take his pledge, whether he will or not, and even his coat.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This gives us a plain account of these money changers; of their tables, and of their sitting at them in the temple, and on what account. Now these exchangers had a profit in every shekel they changed (y). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"When a man went to an exchanger, and changed a shekel for two half shekels, he gave him an addition to the shekel; and the addition is called  \"Kolbon\"; wherefore, when two men gave a shekel for them both, they were both obliged to pay the \"Kolbon\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jesus went into the temple of God, and cast out all them that sold and bought in the temple, and overthrew the tables of the moneychangers, and the seats of them that sold doves,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Different from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the narrative is more precise; comp. Weiss’ note on Mark.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In the court of the Gentiles were the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tabernae",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "הניות",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where animals, incense, oil, wine, and other requisites for sacrifice were exposed for sale. Lightfoot on this passage.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The money-changers (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κολλυβ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., see Phrynichus, p. 440) exchanged on commission (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "קולבון",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Maimonides, Shekal. 3) ordinary money for the two drachmae pieces which were used in paying the temple tribute (see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This cleansing of the temple is, with Chrysostom, Paulus, Kuinoel, Tholuck, Olshausen, Kern, Ebrard, Baumgarten",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Crusius, Schleiermacher, Hengstenberg, Wieseler, to be regarded as the second that took place, the first being that recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., and which occurred on the occasion of the first visit to Jerusalem. The abuse having been repeated, there is no reason why Jesus should not have repeated this purifying process, and that (in answer to Hofmann, Luthardt, Hengstenberg) without any essential difference. The absence, in the synoptical account, of any allusion to a previous occasion, is sufficiently explicable from the length of time that intervened, and from the fact that the Synoptists take no notice generally of what took place during the earlier visit to Judea. The similarity of the accompanying circumstances may be accounted for from the similarity of the incidents themselves; whereas the supposition that the cleansing took place only on one occasion would necessarily involve a chronological derangement extending to almost the whole period of Christ’s ministry,—a derangement which can neither be fairly imputed to the synoptical narrative nor even conceived of as far as John is concerned, whose testimony is that of an eye-witness. This is not “wishy-washy criticism” (Keim), but it is based upon the authenticity of the fourth Gospel, as well as upon the weighty and unanimous testimony of the synoptical writers, to sacrifice whose authority for the sake of John would be both one-sided and violent. This, however, is what Wetstein, Lücke, Neander, de Wette, Bleek, Ewald, Weizsäcker have done. Others, again, have rejected the fourth evangelist’s account, so far as its chronology is concerned, in favour of that of the Synoptists (Ziegler, Theile, Strauss, Baur, Weisse, Hilgenfeld, Schenkel, Keim). Comp., further, the remarks under ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:12-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus visits the Temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:15-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:45-48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cast out all them that sold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] It is probable that a look of divine authority, the enthusiasm of His Galilæan followers, and the consciousness of wrongdoing on the part of the traders, rather than any special exercise of miraculous power, effected this triumph of Jesus in His Father’s House.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them that sold and bought in the temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The traffic consisted in the sale of oxen and sheep, and such requisites for sacrifice as wine, salt, and oil. This merchandise took place in the Court of the Gentiles.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the tables of the moneychangers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Greek word signifies those who took a small coin (Hebr. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Kolbon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Grk. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κόλλυβος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", perhaps a Phœnician word) as a fee for exchanging the money of the worshippers, who were required to pay in Hebrew coin. This exaction of the fee was itself unlawful (Lightfoot). And probably other dishonest practices were rife.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that sold doves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "12–14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Second Cleansing of the Temple",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:15-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:45-46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is clear from the other Synoptists that the Cleansing of the Temple took place on Nisan 10, not on the day of the entry. St Mark says (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that “when he had looked round about on all things there, the eventide being come he went back to Bethany.” In point of time “the cursing of the fig-tree” should precede the “Cleansing of the Temple.” St Mark adds to this account “would not suffer that any man should carry any vessel through the temple.” St Matthew alone mentions the healing of the lame and the blind, and omits the incident of “the widow’s mite,” recorded by the other Synoptists. The first “Cleansing of the Temple,” at the commencement of our Lord’s ministry, is recorded ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:13-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐξέβαλε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cast out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")[916] though He was meek, and had been just called so in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the early part of His ministry, our Lord had purified the temple; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Those who profaned it had, however, returned; and now, when near the end of His course, He purifies it once more, though it was soon to be destroyed; see ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 23:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πάντας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A great miracle. Even a large body of soldiers would not have ventured to attempt it.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοὺς πωλοῦντας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "those who sold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) They had wished to offer every accommodation for public worship, especially at the time of the Passover; but by degrees they appear to have pushed their licence further.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ ἱερῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",[917] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and indeed in its uttermost part, the court of the Gentiles; where the Gentiles [or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] were wont ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to pray",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[916] This ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "casting out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " did not occur on that very day, a day so full of grace and joy; but when men refused to obey the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "intimation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " conveyed by His eyes and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "look",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (of which Mark, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", makes mention: [in the ‘eventide’ of the same day “Jesus entered the temple, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "looked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " round about upon all things,” and not until the morrow He “began to cast out them that sold.”—ED.]), the Lord on the following day exhibited more severe specimens of His most just indignation. Comp. with this, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Harm.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 447.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[917] The fuller reading, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ ἱερῷ τοῦ Θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which the larger Ed. had pronounced to be an inferior reading, is regarded as almost equal in authority to that of the text by the margin of the Ed. 2 and the Germ. Vers.—E. B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is no primary authority for the fuller reading here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Εἰς τὸ ἱερόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", omitting ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the beginning of the sentence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is read by Lachm., with BL",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Orig. Hilar. 713, Memph. and Theb. Versions. D",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ac",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Vulg. and Rec. Text add ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ Θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—ED.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 12-17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The second cleansing of the temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:15-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:45-48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Went into the temple.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The event here narrated seems to have taken place on the day following the triumphal entry; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". on the Monday of the Holy Week. This can be gathered from St. Mark's narrative, where it is stated that, on the day of triumph, Jesus was escorted to the temple, but merely \"looked round about on all things,\" and then returned for the night to Bethany, visiting the temple again on the following morning, and driving out those who profaned it. St. Matthew often groups events, not in their proper chronological order, but in a certain logical sequence which corresponded with his design. Thus he connects the cleansing with the triumphal entry, in order to display another example of Christ's self-manifestation at this time, and his purpose to show who he was and to put forth his claims publicly. In this visit of Christ we see the King coming to his palace, the place where his honour dwelleth, the fitting termination of his glorious march. This cleansing of the temple must not be confounded with the earlier incident narrated by St. John (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). The two acts marked respectively the beginning and close of Christ's earthly ministry, and denote the reverence which he taught for the house and the worshiper God. The part of the temple which he now visited, and which was profaned to secular use, was the court of the Gentiles, separated from the sanctuary by a stone partition, and considered of lesser sanctity, though really an integral part of the temple. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Cast out all them that sold and bought.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In this large open space  a market had been established, with the connivance, and much to the pecuniary emolument, of the priests. These let out the sacred area, of which they were the appointed guardians, to greedy and irreligious traders, who made a gain of others' piety. We find no trace of this market in the Old Testament; it probably was established after the Captivity, whence the Jews brought back that taste for commercial business and skill in financial matters for which they have ever since been celebrated. In the eyes of worldly-minded men the sanctity of a building and its appendages was no impediment to traffic and trade, hence they were glad to utilize the temple court, under the sanction of the priests, for the convenience of those who came from all regions to celebrate the great festivals. Here was sold all that was required for the sacrifices which worshippers were minded to offer - animals for victims, meal, incense, salt, etc. The scandalous abuse of the holy precincts, or the plain traces of it (if, as it was late in the day, the traffickers themselves had departed for a time), Christ had observed at his previous visit, when he \"looked round about upon all things\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and now he proceeded to remedy the crying evil The details of the expulsion are not given. On the first occasion, we are told, he used \"a scourge of small cords;\" as far as we know, at this time he effected the purification unarmed and alone. It was a marvellous impulse that forced the greedy crew to obey the order of this unknown Man; their own consciences made them timid; they fled in dismay before the stern indignation of his eye, deserted their gainful trade to escape the reproach of that invincible zeal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Money changers.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " These persons exchanged (for a certain percentage) foreign money or other coins for the half shekel demanded from all adults for the service of the temple (see on Matthew 17:24). They may have lent money to the needy. The sellers also probably played into their bands by refusing to receive any but current Jewish money in exchange for their wares. It is also certain that no coins stamped with a heathen symbol, or bearing a heathen monarch's image, could be paid into the temple treasury. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The seats of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "them that sold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "doves.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " These birds were used by the poor in the place of costlier victims (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The sellers were often women, who sat with tables before them on which were set cages containing the doves. Matthew 21:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The money-changers (κολλυβιστῶν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From κόλλυβος, the rate of exchange. These changers sat in the temple, in the court of the Gentiles, to change the foreign coins of pilgrims into the shekel of the sanctuary for payment of the annual tribute. See on Matthew 17:24. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From κόλλυβος, the rate of exchange. These changers sat in the temple, in the court of the Gentiles, to change the foreign coins of pilgrims into the shekel of the sanctuary for payment of the annual tribute. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 17:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]