[{"header":"A Prayer of Thanks"},{"num":118,"verse":"Give thanks to the Lord, for He is good. His loving-kindness lasts forever. "},{"num":2,"verse":"Let Israel say, “His loving-kindness lasts forever.” "},{"num":3,"verse":"Let the house of Aaron say, “His loving-kindness lasts forever.” "},{"num":4,"verse":"Let those who fear the Lord say, “His loving-kindness lasts forever.”"},{"num":5,"verse":"I cried to the Lord in my trouble, and He answered me and put me in a good place. "},{"num":6,"verse":"The Lord is with me. I will not be afraid of what man can do to me. "},{"num":7,"verse":"The Lord is with me. He is my Helper. I will watch those lose who fight against me. "},{"num":8,"verse":"It is better to trust in the Lord than to trust in man. "},{"num":9,"verse":"It is better to trust in the Lord than to trust in rulers."},{"num":10,"verse":"All nations gathered around me. But I cut them off in the name of the Lord. "},{"num":11,"verse":"They gathered around me. Yes, they were on every side. But I cut them off in the name of the Lord. "},{"num":12,"verse":"They were all around me like bees and they died out fast like burning thorns. I will destroy them in the name of the Lord. "},{"num":13,"verse":"You pushed me back so that I was falling, but the Lord helped me. "},{"num":14,"verse":"The Lord is my strength and my song. He is the One Who saves me."},{"num":15,"verse":"The joy of being saved is being heard in the tents of those who are right and good. The right hand of the Lord does powerful things. "},{"num":16,"verse":"The Lord’s right hand is lifted high. The right hand of the Lord does powerful things. "},{"num":17,"verse":"I will not die but live. And I will tell of what the Lord has done. "},{"num":18,"verse":"The Lord has punished me but He has not given me over to death."},{"num":19,"verse":"Open to me the gates of what is right and good. I will go through them and give thanks to the Lord. "},{"num":20,"verse":"This is the gate of the Lord. Those who are right with God will pass through it. "},{"num":21,"verse":"I will give thanks to You, for You have answered me. And You are the One Who saves me."},{"num":22,"verse":"The stone that was put aside by the workmen has become the most important stone in the building. "},{"num":23,"verse":"The Lord has done this. We think it is great! "},{"num":24,"verse":"This is the day that the Lord has made. Let us be full of joy and be glad in it. "},{"num":25,"verse":"O Lord, we beg You to save us! O Lord, we ask that You let everything go well for us! "},{"num":26,"verse":"Great and honored is he who comes in the name of the Lord. We honor you from the house of the Lord. "},{"num":27,"verse":"The Lord is God. He has given us light. Tie the gift with rope to the horns of the altar on this special day. "},{"num":28,"verse":"You are my God and I will give You thanks. You are my God and I will praise You. "},{"num":29,"verse":"Give thanks to the Lord, for He is good. His loving-kindness lasts forever."}]