[{"num":118,"verse":"Oh, thank the Lord, for he’s so good! His loving-kindness is forever."},{"num":2,"verse":"Let the congregation of Israel praise him with these same words: “His loving-kindness is forever.” "},{"num":3,"verse":"And let the priests of Aaron chant, “His loving-kindness is forever.” "},{"num":4,"verse":"Let the Gentile converts chant, “His loving-kindness is forever.”"},{"num":5,"verse":"In my distress I prayed to the Lord, and he answered me and rescued me. "},{"num":6,"verse":"He is for me! How can I be afraid? What can mere man do to me? "},{"num":7,"verse":"The Lord is on my side; he will help me. Let those who hate me beware."},{"num":8,"verse":"It is better to trust the Lord than to put confidence in men. "},{"num":9,"verse":"It is better to take refuge in him than in the mightiest king!"},{"num":10,"verse":"Though all the nations of the world attack me, I will march out behind his banner and destroy them. "},{"num":11,"verse":"Yes, they surround and attack me; but with his flag flying above me I will cut them off. "},{"num":12,"verse":"They swarm around me like bees; they blaze against me like a roaring flame. Yet beneath his flag I shall destroy them. "},{"num":13,"verse":"You did your best to kill me, O my enemy, but the Lord helped me. "},{"num":14,"verse":"He is my strength and song in the heat of battle, and now he has given me the victory. "},{"num":15,"verse":"Songs of joy at the news of our rescue are sung in the homes of the godly. The strong arm of the Lord has done glorious things! "},{"num":17,"verse":"I shall not die but live to tell of all his deeds. "},{"num":18,"verse":"The Lord has punished me but not handed me over to death."},{"num":19,"verse":"Open the gates of the Temple—I will go in and give him my thanks. "},{"num":20,"verse":"Those gates are the way into the presence of the Lord, and the godly enter there. "},{"num":21,"verse":"O Lord, thank you so much for answering my prayer and saving me."},{"num":22,"verse":"The stone rejected by the builders has now become the capstone of the arch! "},{"num":23,"verse":"This is the Lord’s doing, and it is marvelous to see! "},{"num":24,"verse":"This is the day the Lord has made. We will rejoice and be glad in it. "},{"num":25,"verse":"O Lord, please help us. Save us. Give us success. "},{"num":26,"verse":"Blessed is the one who is coming, the one sent by the Lord. We bless you from the Temple."},{"num":27,"verse":"Jehovah God is our light. I present to him my sacrifice upon the altar, for you are my God, and I shall give you this thanks and this praise. "},{"num":29,"verse":"Oh, give thanks to the Lord, for he is so good! For his loving-kindness is forever."}]