[{"num":8,"verse":"Once again a huge crowd had followed them, and they had nothing to eat. So Jesus called His disciples together."},{"num":6,"verse":"So, as before, He commanded the people to sit down; and He took the rounds of flatbread, gave thanks for them, and broke them. His disciples took what He gave them and fed the people. "},{"num":7,"verse":"They also had a few small fish, which, after He had spoken a blessing, He likewise gave His followers to pass to the people. "},{"num":8,"verse":"When all had eaten their fill and they had gathered up the food that remained, seven baskets were full."},{"num":9,"verse":"On this occasion, there were about 4,000 people who had eaten the food that Jesus provided. Jesus sent the crowd home; "},{"num":10,"verse":"then, immediately, He got into a boat with His disciples and sailed away. Upon their arrival in Dalmanutha in the district of Magdala, "},{"num":11,"verse":"they were met by Pharisees—ready with their questions and tests—seeking some sign from heaven that His teaching was from God."},{"num":13,"verse":"He left the Pharisees and sailed across to the other shore."},{"num":14,"verse":"The disciples had forgotten to buy provisions, so they had only one round of flatbread among them. "},{"num":15,"verse":"Jesus took this moment to warn them."},{"num":22,"verse":"When they came into Bethsaida, a group brought a blind man to Jesus, and they begged Him to touch the man and heal him. "},{"num":23,"verse":"So Jesus guided the man out of the village, away from the crowd; and He spat on the man’s eyes and touched them."},{"num":25,"verse":"Jesus touched his eyes again; and when the man looked up, he could see everything clearly."},{"num":26,"verse":"Jesus sent him away to his house."},{"num":27,"verse":"As He traveled with His disciples into the villages of Caesarea Philippi, He posed an important question to them."},{"num":28,"verse":"They told Him about the great speculation concerning His identity."},{"num":31,"verse":"And He went on to teach them many things about Himself: how the Son of Man would suffer; how He would be rejected by the elders, chief priests, and scribes; how He would be killed; and how, after three days, God would raise Him from the dead."},{"num":32,"verse":"He said all these things in front of them all, but Peter took Jesus aside to rebuke Him."},{"num":34,"verse":"He gathered the crowd and His disciples alike."}]