[{"header":"Preparations for Passover"},{"num":1,"verse":"The people had not been able to celebrate the Passover Festival at the proper time in the first month, because not enough priests were ritually clean and not many people had assembled in Jerusalem. So King Hezekiah, his officials, and the people of Jerusalem agreed to celebrate it in the second month, and the king sent word to all the people of Israel and Judah. He took special care to send letters to the tribes of Ephraim and Manasseh, inviting them to come to the Temple in Jerusalem to celebrate the Passover in honor of the Lord, the God of Israel. "},{"num":4,"verse":"The king and the people were pleased with their plan, "},{"num":5,"verse":"so they invited all the Israelites, from Dan in the north to Beersheba in the south, to come together in Jerusalem and celebrate the Passover according to the Law, in larger numbers than ever before. "},{"num":6,"verse":"Messengers went out at the command of the king and his officials through all Judah and Israel with the following invitation:"},{"num":7,"verse":"Do not be like your ancestors and your Israelite relatives who were unfaithful to the Lord their God. As you can see, he punished them severely. "},{"num":8,"verse":"Do not be stubborn as they were, but obey the Lord. Come to the Temple in Jerusalem, which the Lord your God has made holy forever, and worship him so that he will no longer be angry with you. "},{"num":9,"verse":"If you return to the Lord, then those who have taken your relatives away as prisoners will take pity on them and let them come back home. The Lord your God is kind and merciful, and if you return to him, he will accept you.”"},{"num":10,"verse":"The messengers went to every city in the territory of the tribes of Ephraim and Manasseh, and as far north as the tribe of Zebulun, but people laughed at them and made fun of them. "},{"num":11,"verse":"Still, there were some from the tribes of Asher, Manasseh, and Zebulun who were willing to come to Jerusalem. "},{"num":12,"verse":"God was also at work in Judah and united the people in their determination to obey his will by following the commands of the king and his officials."},{"header":"Passover Is Celebrated"},{"num":13,"verse":"A great number of people gathered in Jerusalem in the second month to celebrate the Festival of Unleavened Bread. "},{"num":14,"verse":"They took all the altars that had been used in Jerusalem for offering sacrifices and burning incense and threw them into Kidron Valley. "},{"num":15,"verse":"And on the fourteenth day of the month they killed the lambs for the Passover sacrifice. The priests and Levites who were not ritually clean became so ashamed that they dedicated themselves to the Lord, and now they could sacrifice burnt offerings in the Temple. "},{"num":16,"verse":"They took their places in the Temple according to the instructions in the Law of Moses, the man of God. The Levites gave the blood of the sacrifices to the priests, who sprinkled it on the altar. "},{"num":17,"verse":"Because many of the people were not ritually clean, they could not kill the Passover lambs, so the Levites did it for them and dedicated the lambs to the Lord. "},{"num":18,"verse":"In addition, many of those who had come from the tribes of Ephraim, Manasseh, Issachar, and Zebulun had not performed the ritual of purification, and so they were observing Passover improperly. King Hezekiah offered this prayer for them: "},{"num":19,"verse":"“O Lord, the God of our ancestors, in your goodness forgive those who are worshiping you with all their heart, even though they are not ritually clean.” "},{"num":20,"verse":"The Lord answered Hezekiah's prayer; he forgave the people and did not harm them. "},{"num":21,"verse":"For seven days the people who had gathered in Jerusalem celebrated the Festival of Unleavened Bread with great joy, and day after day the Levites and the priests praised the Lord with all their strength. "},{"num":22,"verse":"Hezekiah praised the Levites for their skill in conducting the worship of the Lord."},{"header":"A Second Celebration"},{"num":23,"verse":"they all decided to celebrate for another seven days. So they celebrated with joy. "},{"num":24,"verse":"King Hezekiah contributed 1,000 bulls and 7,000 sheep for the people to kill and eat, and the officials gave them another 1,000 bulls and 10,000 sheep. A large number of priests went through the ritual of purification. "},{"num":25,"verse":"So everyone was happy—the people of Judah, the priests, the Levites, the people who had come from the north, and the foreigners who had settled permanently in Israel and Judah. "},{"num":26,"verse":"The city of Jerusalem was filled with joy, because nothing like this had happened since the days of King Solomon, the son of David. "},{"num":27,"verse":"The priests and the Levites asked the Lord's blessing on the people. In his home in heaven God heard their prayers and accepted them."}]