[{"num":45,"verse":"1 The majesty of Solomon, his honor, strength, beauty, riches, and power are praised, and also his marriage with the Egyptian being an heathen woman, is blessed. 10 If that she can renounce her people and the love of her country, and gave herself wholly to her husband.  Under the which figure, the wonderful majesty and increase of the kingdom of Christ and his Church his spouse, now taken of the Gentiles, is described."},{"num":1,"verse":"Mine heart will utter forth a good matter: I will entreat in my works of the king: my tongue is as the pen of a swift writer."},{"num":2,"verse":"Thou art fairer than the children of men: grace is poured in thy lips, because God hath blessed thee forever."},{"num":3,"verse":"Gird thy sword upon thy thigh, O most mighty, to wit, thy worship and thy glory:"},{"num":4,"verse":"And prosper with thy glory: ride upon the word of truth and of meekness and of righteousness: so thy right hand shall teach thee terrible things."},{"num":5,"verse":"Thine arrows are sharp to pierce the heart of the King’s enemies: therefore the people shall fall under thee."},{"num":6,"verse":"Thy throne, O God, is forever and ever: the scepter of thy kingdom, is a scepter of righteousness."},{"num":7,"verse":"Thou lovest righteousness, and hatest wickedness, because God, even thy God, hath anointed thee with the oil of gladness above thy fellows."},{"num":8,"verse":"All thy garments smell of myrrh and aloes, and cassia, when thou comest out of the ivory palaces where they have made thee glad."},{"num":9,"verse":"King’s daughters were among thine honorable wives: upon thy right hand did stand the Queen in a vesture of gold of Ophir."},{"num":10,"verse":"Hearken, O daughter, and consider, and incline thine ear: forget also thine own people and thy father’s house."},{"num":11,"verse":"So shall the King have pleasure in thy beauty: for he is thy Lord, and reverence thou him."},{"num":12,"verse":"And the daughter of Tyre with the rich of the people, shall do homage before thy face with presents."},{"num":13,"verse":"The King’s daughter is all glorious within: her clothing is of broidered gold."},{"num":14,"verse":"She shall be brought unto the King in raiment of needlework: the virgins that follow after her, and her companions shall be brought unto thee."},{"num":15,"verse":"With joy and gladness shall they be brought, and shall enter into the king’s palace."},{"num":16,"verse":"Instead of thy fathers shall thy children be: thou shalt make them princes through all the earth."},{"num":17,"verse":"I will make thy Name to be remembered through all generations: therefore shall the people give thanks unto thee, world without end."}]