[[],[{"type":"header","content":"Concluding Words"},{"type":"prose","content":"Keep on loving each other as brothers and sisters."}],[{"type":"prose","content":"Don’t forget to show hospitality to strangers, for some who have done this have entertained angels without realizing it!"}],[{"type":"prose","content":"Remember those in prison, as if you were there yourself. Remember also those being mistreated, as if you felt their pain in your own bodies."}],[{"type":"prose","content":"Give honor to marriage, and remain faithful to one another in marriage. God will surely judge people who are immoral and those who commit adultery."}],[{"type":"prose","content":"Don’t love money; be satisfied with what you have. For God has said,"}],[{"type":"prose","content":"So we can say with confidence,"}],[{"type":"prose","content":"Remember your leaders who taught you the word of God. Think of all the good that has come from their lives, and follow the example of their faith."}],[{"type":"prose","content":"Jesus Christ is the same yesterday, today, and forever."}],[{"type":"prose","content":"So do not be attracted by strange, new ideas. Your strength comes from God’s grace, not from rules about food, which don’t help those who follow them."}],[{"type":"prose","content":"We have an altar from which the priests in the Tabernacle have no right to eat."}],[{"type":"prose","content":"Under the old system, the high priest brought the blood of animals into the Holy Place as a sacrifice for sin, and the bodies of the animals were burned outside the camp."}],[{"type":"prose","content":"So also Jesus suffered and died outside the city gates to make his people holy by means of his own blood."}],[{"type":"prose","content":"So let us go out to him, outside the camp, and bear the disgrace he bore."}],[{"type":"prose","content":"For this world is not our permanent home; we are looking forward to a home yet to come."}],[{"type":"prose","content":"Therefore, let us offer through Jesus a continual sacrifice of praise to God, proclaiming our allegiance to his name."}],[{"type":"prose","content":"And don’t forget to do good and to share with those in need. These are the sacrifices that please God."}],[{"type":"prose","content":"Obey your spiritual leaders, and do what they say. Their work is to watch over your souls, and they are accountable to God. Give them reason to do this with joy and not with sorrow. That would certainly not be for your benefit."}],[{"type":"prose","content":"Pray for us, for our conscience is clear and we want to live honorably in everything we do."}],[{"type":"prose","content":"And especially pray that I will be able to come back to you soon."}],[{"type":"prose","content":"I urge you, dear brothers and sisters, to pay attention to what I have written in this brief exhortation."}],[{"type":"prose","content":"I want you to know that our brother Timothy has been released from jail. If he comes here soon, I will bring him with me to see you."}],[{"type":"prose","content":"Greet all your leaders and all the believers there. The believers from Italy send you their greetings."}],[{"type":"prose","content":"May God’s grace be with you all."}]]