[{"header":"The Practical Life of God’s People"},{"num":13,"verse":"Let the family continue to care for one another. "},{"num":2,"verse":"Don’t forget to be hospitable; by that means, some people have entertained angels without realizing it. "},{"num":3,"verse":"Remember people in prison, as though you were in prison with them. When you think of people who are having a difficult time, remember that you too live in a frail body."},{"num":4,"verse":"Let marriage be honoured by everyone; let the marriage bed remain undefiled. God will judge those who misbehave sexually or commit adultery."},{"num":5,"verse":"Keep your life free from love of money; be content with what you have. He himself has said, after all, ‘I will never, ever, leave you or forsake you.’ "},{"num":6,"verse":"That’s why we can be cheerfully confident, and say, ‘The Lord is helping me; I’m not going to be afraid; what can anyone do to me?’"},{"num":7,"verse":"Remember your leaders, who spoke God’s word to you. Look carefully at how their lives came to complete fruition, and imitate their faith. "},{"num":8,"verse":"Jesus the Messiah is the same, yesterday, today and for ever."},{"header":"Outside the Old City, Seeking the New"},{"num":9,"verse":"Don’t let yourselves be carried off by strange teachings of whatever sort. The heart needs to be strengthened by grace, you see, not by rules about what to eat, which don’t do any good to those who observe them."},{"num":10,"verse":"We have an altar from which those who minister in the Tabernacle are not allowed to eat. "},{"num":11,"verse":"For the bodies of the animals whose blood is taken into the sanctuary by the high priest as a sin-offering are burned outside the camp. "},{"num":12,"verse":"That’s why Jesus too suffered outside the gate, so that he might make the people holy with his own blood. "},{"num":13,"verse":"So, then, let’s go out to him, outside the camp, bearing his shame. "},{"num":14,"verse":"Here, you see, we have no city that lasts; we are looking for the one that is still to come."},{"num":15,"verse":"Our part, then, is this: to bring, through him, a continual sacrifice of praise to God – that is, mouths that confess his name, and do so fruitfully. "},{"num":16,"verse":"Don’t neglect to do good, and to let ‘fellowship’ mean what it says. God really enjoys sacrifices of that kind!"},{"header":"The God of Peace Be with You"},{"num":17,"verse":"Obey your leaders; submit to them. They are keeping watch over your lives, you see, as people who will have to give account. Make sure they can do this with joy, not with a groan as a burden. That would be of no value to you."},{"num":18,"verse":"Pray for us! Our conscience is clear; we are quite sure of it. We wish to act appropriately in everything. "},{"num":19,"verse":"I beg you especially to do this, so that I may quickly be restored to you."},{"num":20,"verse":"May the God of peace, who led up from the dead our Lord Jesus, the great shepherd of the sheep, through the blood of the eternal covenant, "},{"num":21,"verse":"make you complete in every good work so that you may do his will. May he perform, in you, whatever will be pleasing in his sight, through Jesus the Messiah. Glory be to him for ever and ever, Amen!"},{"num":22,"verse":"I beg you, my dear family, bear with this word of exhortation; I’ve written to you quite briefly, after all. "},{"num":23,"verse":"You should know that our brother Timothy has been released. If he comes soon, I will see you and him at the same time."},{"num":24,"verse":"Greet all your leaders, and all God’s people. Those from Italy send you greetings. "},{"num":25,"verse":"Grace be with you all."}]