[{"num":20,"verse":"Avraham traveled from there toward the Negev and lived between Kadesh and Shur. While living as an alien in G’rar, "},{"num":2,"verse":"Avraham was saying of Sarah his wife, “She is my sister”; so Avimelekh king of G’rar sent and took Sarah. "},{"num":3,"verse":"But God came to Avimelekh in a dream one night and said to him, “You are about to die because of the woman you have taken, since she is someone’s wife.” "},{"num":4,"verse":"Now Avimelekh had not come near her; so he said, “Lord, will you kill even an upright nation? "},{"num":5,"verse":"Didn’t he himself say to me, ‘She is my sister’? And even she herself said, ‘He is my brother.’ In doing this, my heart has been pure and my hands innocent.” "},{"num":6,"verse":"God said to him in the dream, “Yes, I know that in doing this, your heart has been pure; and I too have kept you from sinning against me. This is why I didn’t let you touch her. "},{"num":7,"verse":"Therefore, return the man’s wife to him now. He is a prophet, and he will pray for you, so that you will live. But if you don’t return her, know that you will certainly die — you and all who belong to you.”"},{"num":8,"verse":"Avimelekh got up early in the morning, called all his servants and told them these things; and the men became very afraid. "},{"num":9,"verse":"Then Avimelekh called Avraham and said to him, “What have you done to us? How have I sinned against you to cause you to bring on me and my kingdom a great sin? You have done things to me that are just not done.” "},{"num":10,"verse":"Avimelekh went on, asking Avraham, “Whatever could have caused you to do such a thing?” "},{"num":11,"verse":"Avraham replied, “It was because I thought, ‘There could not possibly be any fear of God in this place, so they will kill me in order to get my wife.’ "},{"num":12,"verse":"But she actually is also my sister, the daughter of my father but not the daughter of my mother, and so she became my wife. "},{"num":13,"verse":"When God had me leave my father’s house, I told her, ‘Do me this favor: wherever we go, say about me, “He is my brother.”’”"},{"num":14,"verse":"Avimelekh took sheep, cattle, and male and female slaves, and gave them to Avraham; and he returned to him Sarah his wife. "},{"num":15,"verse":"Then Avimelekh said, “Look, my country lies before you; live where you like.” "},{"num":16,"verse":"To Sarah he said, “Here, I have given your brother a thousand pieces of silver. That will allay the suspicions of everyone who is with you. Before everyone you are cleared.” "},{"num":17,"verse":"Avraham prayed to God, and God healed Avimelekh and his wife and slave-girls, so that they could have children. "},{"num":18,"verse":"For Adonai had made every woman in Avimelekh’s household infertile on account of Sarah Avraham’s wife."}]