[{"num":20,"verse":"And Abraham departed thence towards the south country, and dwelt between Kadesh and Shur, and sojourned at Gerar."},{"num":2,"verse":"And Abraham said of Sarah his wife, She is my sister. And Abimelech the king of Gerar sent and took Sarah."},{"num":3,"verse":"But God came to Abimelech in a dream by night, and said to him, Behold, thou art [but] a dead man, because of the woman that thou hast taken; for she is a man's wife."},{"num":4,"verse":"But Abimelech had not come near her. And he said, Lord, wilt thou also kill a righteous nation?"},{"num":5,"verse":"Did he not say to me, She is my sister? and she, even she said, He is my brother. In the integrity of my heart and in the innocency of my hands have I done this."},{"num":6,"verse":"And God said to him in a dream, I also knew that thou didst this in the integrity of thy heart, and I, too, have withheld thee from sinning against me: therefore have I not suffered thee to touch her."},{"num":7,"verse":"And now, restore the man's wife; for he is a prophet, and will pray for thee, that thou mayest live. And if thou do not restore [her], know that thou shalt certainly die, thou and all that is thine."},{"num":8,"verse":"And Abimelech rose early in the morning, and called all his servants, and spoke all these words in their ears; and the men were greatly afraid."},{"num":9,"verse":"And Abimelech called Abraham and said to him, What hast thou done to us? And in what have I sinned against thee, that thou hast brought on me, and on my kingdom, a great sin? Thou hast done to me deeds that ought not to be done."},{"num":10,"verse":"And Abimelech said to Abraham, What hast thou seen that thou hast done this?"},{"num":11,"verse":"And Abraham said, Because I said, Surely the fear of God is not in this place, and they will kill me for my wife's sake."},{"num":12,"verse":"But she is also truly my sister, the daughter of my father, but not the daughter of my mother; and she became my wife."},{"num":13,"verse":"And it came to pass when God caused me to wander from my father's house, that I said to her, Let this be thy kindness which thou shalt shew to me: at every place whither we shall come, say of me, He is my brother."},{"num":14,"verse":"And Abimelech took sheep and oxen, and bondmen and bondwomen, and gave [them] to Abraham, and restored him Sarah his wife."},{"num":15,"verse":"And Abimelech said, Behold, my land is before thee: dwell where it is good in thine eyes."},{"num":16,"verse":"And to Sarah he said, Behold, I have given thy brother a thousand [pieces] of silver; behold, let that be to thee a covering of the eyes, in respect of all that are with thee, and with all; and she was reproved."},{"num":17,"verse":"And Abraham prayed to God, and God healed Abimelech, and his wife and his handmaids, and they bore [children]."},{"num":18,"verse":"For Jehovah had fast closed up all the wombs of the house of Abimelech because of Sarah Abraham's wife."}]