[{"header":"Abraham and Abimelek"},{"num":20,"verse":"Abraham moved south into the Negev Desert. He lived between Kadesh and Shur. For a while he stayed in Gerar. "},{"num":2,"verse":"There Abraham said about his wife Sarah, “She’s my sister.” Then Abimelek, the king of Gerar, sent for Sarah and took her."},{"num":3,"verse":"So God appeared to Abimelek in a dream one night. He said to him, “You are as good as dead because of the woman you have taken. She is already married.”"},{"num":4,"verse":"But Abimelek hadn’t gone near her. So he said, “Lord, will you destroy a nation that hasn’t done anything wrong? "},{"num":5,"verse":"Didn’t Abraham say to me, ‘She’s my sister’? And didn’t she also say, ‘He’s my brother’? I had no idea I was doing anything wrong.”"},{"num":6,"verse":"Then God spoke to him in the dream. He said, “Yes, I know you had no idea you were doing anything wrong. So I have kept you from sinning against me. That is why I did not let you touch her. "},{"num":7,"verse":"Now return the man’s wife to him. He is a prophet. So he will pray for you, and you will live. But what if you do not return her? Then you can be sure that you and all your people will die.”"},{"num":8,"verse":"Early the next morning Abimelek sent for all his officials. When he told them everything that had happened, they were really afraid. "},{"num":9,"verse":"Then Abimelek called Abraham in. Abimelek said, “What have you done to us? Have I done something wrong to you? Why have you brought so much guilt on me and my kingdom? You have done things to me that should never be done.” "},{"num":10,"verse":"Abimelek also asked Abraham, “Why did you do this?”"},{"num":11,"verse":"Abraham replied, “I thought, ‘There is no respect for God in this place. They will kill me because of my wife.’ "},{"num":12,"verse":"Besides, she really is my sister. She’s the daughter of my father, but not the daughter of my mother. And she became my wife. "},{"num":13,"verse":"God had me wander away from my father’s house. So I said to her, ‘Here is how you can show your love to me. Everywhere we go, say about me, “He’s my brother.” ’ ”"},{"num":14,"verse":"Then Abimelek gave Abraham sheep and cattle and male and female slaves. He also returned his wife Sarah to him. "},{"num":15,"verse":"Abimelek said, “Here is my land. Live anywhere you want to.”"},{"num":16,"verse":"He said to Sarah, “I’m giving your brother 25 pounds of silver. This will show everyone with you that I am sorry for what I did to you. You haven’t done anything wrong.”"},{"num":17,"verse":"Then Abraham prayed to God, and God healed Abimelek. He also healed his wife and his female slaves so they could have children again. "},{"num":18,"verse":"The Lord had kept all the women in Abimelek’s house from having children. He had done it because of Abraham’s wife Sarah."}]