[{"num":20,"verse":"Now Abraham moved south to the Negeb and settled between Kadesh and Shur. One day, when visiting the city of Gerar, "},{"num":2,"verse":"he declared that Sarah was his sister! Then King Abimelech sent for her, and had her brought to him at his palace."},{"num":3,"verse":"But that night God came to him in a dream and told him, “You are a dead man, for that woman you took is married.”"},{"num":4,"verse":"But Abimelech hadn’t slept with her yet, so he said, “Lord, will you slay an innocent man? "},{"num":5,"verse":"He told me, ‘She is my sister,’ and she herself said, ‘Yes, he is my brother.’ I hadn’t the slightest intention of doing anything wrong.”"},{"num":6,"verse":"“Yes, I know,” the Lord replied. “That is why I held you back from sinning against me; that is why I didn’t let you touch her. "},{"num":7,"verse":"Now restore her to her husband, and he will pray for you (for he is a prophet) and you shall live. But if you don’t return her to him, you are doomed to death along with all your household.”"},{"num":8,"verse":"The king was up early the next morning, and hastily called a meeting of all the palace personnel and told them what had happened. And great fear swept through the crowd."},{"num":9,"verse":"Then the king called for Abraham. “What is this you’ve done to us?” he demanded. “What have I done that deserves treatment like this, to make me and my kingdom guilty of this great sin? Who would suspect that you would do a thing like this to me? Whatever made you think of this vile deed?”"},{"num":11,"verse":"“Well,” Abraham said, “I figured this to be a godless place. ‘They will want my wife and will kill me to get her,’ I thought. And besides, she is my sister—or at least a half sister (we both have the same father)—and I married her. "},{"num":13,"verse":"And when God sent me traveling far from my childhood home, I told her, ‘Have the kindness to mention, wherever we come, that you are my sister.’”"},{"num":14,"verse":"Then King Abimelech took sheep and oxen and servants—both men and women—and gave them to Abraham, and returned Sarah his wife to him."},{"num":15,"verse":"“Look my kingdom over, and choose the place where you want to live,” the king told him. "},{"num":16,"verse":"Then he turned to Sarah. “Look,” he said, “I am giving your ‘brother’ a thousand silver pieces as damages for what I did, to compensate for any embarrassment and to settle any claim against me regarding this matter. Now justice has been done.”"},{"num":17,"verse":"Then Abraham prayed, asking God to cure the king and queen and the other women of the household, so that they could have children; "},{"num":18,"verse":"for God had stricken all the women with barrenness to punish Abimelech for taking Abraham’s wife."}]