[{"num":3,"verse":"Beloved, I am now writing you this second letter. In [both of] them I have stirred up your unsullied (sincere) mind by way of remembrance,"},{"num":2,"verse":"That you should recall the predictions of the holy (consecrated, dedicated) prophets and the commandment of the Lord and Savior [given] through your apostles (His special messengers)."},{"num":3,"verse":"To begin with, you must know and understand this, that scoffers (mockers) will come in the last days with scoffing, [people who] walk after their own fleshly desires"},{"num":4,"verse":"And say, Where is the promise of His coming? For since the forefathers fell asleep, all things have continued exactly as they did from the beginning of creation."},{"num":5,"verse":"For they willfully overlook and forget this [fact], that the heavens [came into] existence long ago by the word of God, and the earth also which was formed out of water and by means of water,"},{"num":6,"verse":"Through which the world that then [existed] was deluged with water and perished."},{"num":7,"verse":"But by the same word the present heavens and earth have been stored up (reserved) for fire, being kept until the day of judgment and destruction of the ungodly people."},{"num":8,"verse":"Nevertheless, do not let this one fact escape you, beloved, that with the Lord one day is as a thousand years and a thousand years as one day."},{"num":9,"verse":"The Lord does not delay and is not tardy or slow about what He promises, according to some people’s conception of slowness, but He is long-suffering (extraordinarily patient) toward you, not desiring that any should perish, but that all should turn to repentance."},{"num":10,"verse":"But the day of the Lord will come like a thief, and then the heavens will vanish (pass away) with a thunderous crash, and the [material] elements [of the universe] will be dissolved with fire, and the earth and the works that are upon it will be burned up."},{"num":11,"verse":"Since all these things are thus in the process of being dissolved, what kind of person ought [each of] you to be [in the meanwhile] in consecrated and holy behavior and devout and godly qualities,"},{"num":12,"verse":"While you wait and earnestly long for (expect and hasten) the coming of the day of God by reason of which the flaming heavens will be dissolved, and the [material] elements [of the universe] will flare and melt with fire?"},{"num":13,"verse":"But we look for new heavens and a new earth according to His promise, in which righteousness (uprightness, freedom from sin, and right standing with God) is to abide."},{"num":14,"verse":"So, beloved, since you are expecting these things, be eager to be found by Him [at His coming] without spot or blemish and at peace [in serene confidence, free from fears and agitating passions and moral conflicts]."},{"num":15,"verse":"And consider that the long-suffering of our Lord [His slowness in avenging wrongs and judging the world] is salvation (that which is conducive to the soul’s safety), even as our beloved brother Paul also wrote to you according to the spiritual insight given him,"},{"num":16,"verse":"Speaking of this as he does in all of his letters. There are some things in those [epistles of Paul] that are difficult to understand, which the ignorant and unstable twist and misconstrue to their own utter destruction, just as [they distort and misinterpret] the rest of the Scriptures."},{"num":17,"verse":"Let me warn you therefore, beloved, that knowing these things beforehand, you should be on your guard, lest you be carried away by the error of lawless and wicked [persons and] fall from your own [present] firm condition [your own steadfastness of mind]."},{"num":18,"verse":"But grow in grace (undeserved favor, spiritual strength) and recognition and knowledge and understanding of our Lord and Savior Jesus Christ (the Messiah). To Him [be] glory (honor, majesty, and splendor) both now and to the day of eternity. Amen (so be it)!"}]