[{"header":"Be Ready for the Day of the Lord"},{"num":3,"verse":"Dear friends, this is now the second of two letters I am writing to you, in which I have been trying to stimulate your pure minds by reminding you "},{"num":2,"verse":"to recall the words spoken in the past by the holy prophets and the commandment of our Lord and Savior spoken through your apostles."},{"num":3,"verse":"First of all you must understand this: In the last days mockers will come and, following their own desires, will ridicule us "},{"num":4,"verse":"by saying, “What happened to the Messiah’s promise to return? Ever since our ancestors died, everything continues as it did from the beginning of creation.” "},{"num":5,"verse":"But they deliberately ignore the fact that long ago the heavens existed and the earth was formed by God’s word out of water and with water, "},{"num":6,"verse":"by which the world at that time was deluged with water and destroyed. "},{"num":7,"verse":"Now by that same word, the present heavens and earth have been reserved for fire and are being kept for the day when ungodly people will be judged and destroyed."},{"num":8,"verse":"Don’t forget this fact, dear friends: With the Lord a single day is like a thousand years, and a thousand years are like a single day. "},{"num":9,"verse":"The Lord is not slow about his promise, as some people understand slowness, but is being patient with you. He does not want anyone to perish, but everyone to find room for repentence. "},{"num":10,"verse":"But the Day of the Lord will come like a thief. On that day the heavens will disappear with a roaring sound, the elements will be destroyed by fire, and the earth and everything done on it will be exposed."},{"num":11,"verse":"Since everything will be destroyed in this way, think of the kind of holy and godly people you ought to be "},{"num":12,"verse":"as you look forward to and hasten the coming of the day of God, when the heavens will be set ablaze and dissolved and the elements will melt with fire. "},{"num":13,"verse":"But in keeping with his promise, we are looking forward to new heavens and a new earth, where righteousness is at home."},{"num":14,"verse":"So then, dear friends, since you are looking forward to this, make every effort to have the Lord find you at peace and without spot or fault. "},{"num":15,"verse":"Think of our Lord’s patience as facilitating salvation, just as our dear brother Paul also wrote to you according to the wisdom given him. "},{"num":16,"verse":"He speaks about this subject in all his letters. Some things in them are hard to understand, which ignorant and unstable people distort, leading to their own destruction, as they do the rest of the Scriptures."},{"num":17,"verse":"And so, dear friends, since you already know these things, continuously be on your guard not to be carried away by the deception of lawless people. Otherwise, you may fall from your secure position. "},{"num":18,"verse":"Instead, continue to grow in the grace and knowledge of our Lord and Savior Jesus, the Messiah. Glory belongs to him both now and on that eternal day! Amen."}]