[{"header":"Zedekiah’s Request Denied"},{"num":21,"verse":"This is the word that came to Jeremiah from the Lord when King Zedekiah sent Pashhur son of Malchijah and the priest Zephaniah son of Maaseiah to Jeremiah, asking, "},{"num":2,"verse":"“Inquire of the Lord on our behalf, since King Nebuchadnezzar of Babylon is making war against us. Perhaps the Lord will perform for us something like all his past wondrous works so that Nebuchadnezzar will withdraw from us.”"},{"num":3,"verse":"But Jeremiah answered, “This is what you are to say to Zedekiah: "},{"num":4,"verse":"‘This is what the Lord, the God of Israel, says: I am about to repel the weapons of war in your hands, those you are using to fight the king of Babylon and the Chaldeans who are besieging you outside the wall, and I will bring them into the center of this city. "},{"num":5,"verse":"I myself will fight against you with an outstretched hand and a strong arm, with anger, fury, and intense wrath. "},{"num":6,"verse":"I will strike the residents of this city, both people and animals. They will die in a severe plague. "},{"num":7,"verse":"Afterward—this is the Lord’s declaration—King Zedekiah of Judah, his officers, and the people—those in this city who survive the plague, the sword, and the famine—I will hand over to King Nebuchadnezzar of Babylon, to their enemies, yes, to those who intend to take their lives. He will put them to the sword; he won’t spare them or show pity or compassion.’"},{"header":"A Warning for the People"},{"num":8,"verse":"“But tell this people, ‘This is what the Lord says: Look, I am setting before you the way of life and the way of death. "},{"num":9,"verse":"Whoever stays in this city will die by the sword, famine, and plague, but whoever goes out and surrenders to the Chaldeans who are besieging you will live and will retain his life like the spoils of war. "},{"num":10,"verse":"For I have set my face against this city to bring disaster and not good—this is the Lord’s declaration. It will be handed over to the king of Babylon, who will burn it.’"},{"num":11,"verse":"“And to the house of the king of Judah say this: ‘Hear the word of the Lord! "},{"num":12,"verse":"House of David, this is what the Lord says:"}]