[[],[{"type":"header","content":"No Deliverance from Babylon"},{"type":"prose","content":"The  spoke through Jeremiah when King Zedekiah sent Pashhur son of Malkijah and Zephaniah son of Maaseiah, the priest, to speak with him. They begged Jeremiah,"}],[{"type":"prose","content":"“Please speak to the  for us and ask him to help us. King Nebuchadnezzar of Babylon is attacking Judah. Perhaps the  will be gracious and do a mighty miracle as he has done in the past. Perhaps he will force Nebuchadnezzar to withdraw his armies.”"}],[{"type":"prose","content":"Jeremiah replied, “Go back to King Zedekiah and tell him,"}],[{"type":"prose","content":"‘This is what the , the God of Israel, says: I will make your weapons useless against the king of Babylon and the Babylonians who are outside your walls attacking you. In fact, I will bring your enemies right into the heart of this city."}],[{"type":"prose","content":"I myself will fight against you with a strong hand and a powerful arm, for I am very angry. You have made me furious!"}],[{"type":"prose","content":"I will send a terrible plague upon this city, and both people and animals will die."}],[{"type":"prose","content":"And after all that, says the , I will hand over King Zedekiah, his staff, and everyone else in the city who survives the disease, war, and famine. I will hand them over to King Nebuchadnezzar of Babylon and to their other enemies. He will slaughter them and show them no mercy, pity, or compassion.’"}],[{"type":"prose","content":"“Tell all the people, ‘This is what the  says: Take your choice of life or death!"}],[{"type":"prose","content":"Everyone who stays in Jerusalem will die from war, famine, or disease, but those who go out and surrender to the Babylonians will live. Their reward will be life!"}],[{"type":"prose","content":"For I have decided to bring disaster and not good upon this city, says the . It will be handed over to the king of Babylon, and he will reduce it to ashes.’"},{"type":"header","content":"Judgment on Judah’s Kings"}],[{"type":"prose","content":"“Say to the royal family of Judah, ‘Listen to this message from the !"}],[{"type":"prose","content":"This is what the  says to the dynasty of David: "}]]