[{"header":"Jerusalem Will Be Captured by the Babylonians"},{"num":21,"verse":"Yahweh spoke his word to Jeremiah when King Zedekiah sent Pashhur, son of Malchiah, and the priest Zephaniah, son of Maaseiah, to Jeremiah. They said, "},{"num":2,"verse":"“Consult Yahweh for us, because King Nebuchadnezzar of Babylon is attacking us. Maybe Yahweh will perform miracles for us so that Nebuchadnezzar will retreat.”"},{"num":3,"verse":"Jeremiah responded to them, “This is what you should say to Zedekiah, "},{"num":4,"verse":"‘This is what Yahweh Elohim of Israel says: I’m going to take your weapons away from you. You are using these weapons to fight the king of Babylon as well as the Babylonians who are now blockading you outside the wall. I will bring the Babylonians inside this city. "},{"num":5,"verse":"I will fight you in anger, fury, and rage with my powerful hand and my mighty arm. "},{"num":6,"verse":"I will defeat those who live in this city, both people and animals. They will die from a terrible plague. "},{"num":7,"verse":"Afterwards, declares Yahweh, I will hand over Judah’s King Zedekiah, his officials, the people, and everyone else in this city who survives the plague, war, and famine. They will be handed over to King Nebuchadnezzar of Babylon and to their enemies who want to kill them. Nebuchadnezzar will kill them with swords. He won’t spare them, show them compassion, or care for them.’"},{"num":8,"verse":"“Say to these people, ‘This is what Yahweh says: I am going to give you the choice of life or death. "},{"num":9,"verse":"Those who live in this city will die in the war, famine, or plague. Those of you who go out and surrender to the Babylonians will live. You will escape with your lives. "},{"num":10,"verse":"I’ve decided to harm this city, not to do good to it, declares Yahweh. It will be handed over to the king of Babylon, and he will burn it down.’"},{"num":11,"verse":"“Say to the nation of the king of Judah, ‘Listen to the word of Yahweh, "},{"num":12,"verse":"descendants of David. This is what Yahweh says:"}]