[{"num":1,"verse":"It was in the days of Ahasuerus [Xerxes], the Ahasuerus who reigned from India to Ethiopia over 127 provinces."},{"num":2,"verse":"In those days when King Ahasuerus sat on his royal throne which was in Shushan or Susa [the capital of the Persian Empire] in the palace or castle,"},{"num":3,"verse":"In the third year of his reign he made a feast for all his princes and his courtiers. The chief officers of the Persian and Median army and the nobles and governors of the provinces were there before him"},{"num":4,"verse":"While he showed the riches of his glorious kingdom and the splendor and excellence of his majesty for many days, even 180 days."},{"num":5,"verse":"And when these days were completed, the king made a feast for all the people present in Shushan the capital, both great and small, a seven-day feast in the court of the garden of the king’s palace."},{"num":6,"verse":"There were hangings of fine white cloth, of green and of blue [cotton], fastened with cords of fine linen and purple to silver rings or rods and marble pillars. The couches of gold and silver rested on a [mosaic] pavement of porphyry, white marble, mother-of-pearl, and [precious] colored stones."},{"num":7,"verse":"Drinks were served in different kinds of golden goblets, and there was royal wine in abundance, according to the liberality of the king."},{"num":8,"verse":"And drinking was according to the law; no one was compelled to drink, for the king had directed all the officials of his palace to serve only as each guest desired."},{"num":9,"verse":"Also Queen Vashti gave a banquet for the women in the royal house which belonged to King Ahasuerus."},{"num":10,"verse":"On the seventh day, when the king’s heart was merry with wine, he commanded Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carkas, the seven eunuchs who ministered to King Ahasuerus as attendants,"},{"num":11,"verse":"To bring Queen Vashti before the king, with her royal crown, to show the peoples and the princes her beauty, for she was fair to behold."},{"num":12,"verse":"But Queen Vashti refused to come at the king’s command conveyed by the eunuchs. Therefore the king was enraged, and his anger burned within him."},{"num":13,"verse":"Then the king spoke to the wise men who knew the times—for this was the king’s procedure toward all who were familiar with law and judgment—"},{"num":14,"verse":"Those next to him being Carshena, Shethar, Admatha, Tarshish, Meres, Marsena, and Memucan, the seven princes of Persia and Media who were in the king’s presence and held first place in the kingdom."},{"num":15,"verse":"[He said] According to the law, what is to be done to Queen Vashti because she has not done the bidding of King Ahasuerus conveyed by the eunuchs?"},{"num":16,"verse":"And Memucan answered before the king and the princes, Vashti the queen has not only done wrong to the king but also to all the princes and to all the peoples who are in all the provinces of King Ahasuerus."},{"num":17,"verse":"For this deed of the queen will become known to all women, making their husbands contemptible in their eyes, since they will say, King Ahasuerus commanded Queen Vashti to be brought before him, but she did not come."},{"num":18,"verse":"This very day the ladies of Persia and Media who have heard of the queen’s behavior will be telling it to all the king’s princes. So contempt and wrath in plenty will arise."},{"num":19,"verse":"If it pleases the king, let a royal command go forth from him and let it be written among the laws of the Persians and Medes, so that it may not be changed, that Vashti is to [be divorced and] come no more before King Ahasuerus; and let the king give her royal position to another who is better than she."},{"num":20,"verse":"So when the king’s decree is made and proclaimed throughout all his kingdom, extensive as it is, all wives will give honor to their husbands, high and low."},{"num":21,"verse":"This advice pleased the king and the princes, and the king did what Memucan proposed."},{"num":22,"verse":"He sent letters to all the royal provinces, to each in its own script and to every people in their own language, saying that every man should rule in his own house and speak there in the language of his own people. [If he had foreign wives, let them learn his language.]"}]