[{"header":"Queen Vashti Defies King Xerxes"},{"num":1,"verse":"From his royal throne in Persia's capital city of Susa, King Xerxes ruled 127 provinces, all the way from India to Ethiopia."},{"num":3,"verse":"In the third year of his reign he gave a banquet for all his officials and administrators. The armies of Persia and Media were present, as well as the governors and noblemen of the provinces. "},{"num":4,"verse":"For six whole months he made a show of the riches of the imperial court with all its splendor and majesty."},{"num":5,"verse":"After that, the king gave a banquet for all the people in the capital city of Susa, rich and poor alike. It lasted a whole week and was held in the gardens of the royal palace. "},{"num":6,"verse":"The courtyard there was decorated with blue and white cotton curtains, tied by cords of fine purple linen to silver rings on marble columns. Couches made of gold and silver had been placed in the courtyard, which was paved with white marble, red feldspar, shining mother-of-pearl, and blue turquoise. "},{"num":7,"verse":"Drinks were served in gold cups, no two of them alike, and the king was generous with the royal wine. "},{"num":8,"verse":"There were no limits on the drinks; the king had given orders to the palace servants that everyone could have as much as they wanted."},{"num":9,"verse":"Meanwhile, inside the royal palace Queen Vashti was giving a banquet for the women."},{"num":10,"verse":"On the seventh day of his banquet the king was drinking and feeling happy, so he called in the seven eunuchs who were his personal servants, Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carkas. "},{"num":11,"verse":"He ordered them to bring in Queen Vashti, wearing her royal crown. The queen was a beautiful woman, and the king wanted to show off her beauty to the officials and all his guests. "},{"num":12,"verse":"But when the servants told Queen Vashti of the king's command, she refused to come. This made the king furious."},{"num":13,"verse":"Now it was the king's custom to ask for expert opinion on questions of law and order, so he called for his advisers, who would know what should be done. "},{"num":14,"verse":"Those he most often turned to for advice were Carshena, Shethar, Admatha, Tarshish, Meres, Marsena, and Memucan—seven officials of Persia and Media who held the highest offices in the kingdom. "},{"num":15,"verse":"He said to these men, “I, King Xerxes, sent my servants to Queen Vashti with a command, and she refused to obey it! What does the law say that we should do with her?”"},{"num":16,"verse":"Then Memucan declared to the king and his officials: “Queen Vashti has insulted not only the king but also his officials—in fact, every man in the empire! "},{"num":17,"verse":"Every woman in the empire will start looking down on her husband as soon as she hears what the queen has done. They'll say, ‘King Xerxes commanded Queen Vashti to come to him, and she refused.’ "},{"num":18,"verse":"When the wives of the royal officials of Persia and Media hear about the queen's behavior, they will be telling their husbands about it before the day is out. Wives everywhere will have no respect for their husbands, and husbands will be angry with their wives. "},{"num":19,"verse":"If it please Your Majesty, issue a royal proclamation that Vashti may never again appear before the king. Have it written into the laws of Persia and Media, so that it can never be changed. Then give her place as queen to some better woman. "},{"num":20,"verse":"When your proclamation is made known all over this huge empire, every woman will treat her husband with proper respect, whether he's rich or poor.”"},{"num":21,"verse":"The king and his officials liked this idea, and the king did what Memucan suggested. "},{"num":22,"verse":"To each of the royal provinces he sent a message in the language and the system of writing of that province, saying that every husband should be the master of his home and speak with final authority."}]