[{"header":"Queen Vashti Disobeys King Xerxes"},{"num":1,"verse":"In the days of Xerxes the following events took place. This was the same Xerxes who ruled over 127 provinces from India to Sudan. "},{"num":2,"verse":"At the time when King Xerxes sat on the royal throne in the fortress of Susa, "},{"num":3,"verse":"he held a banquet in the third year of his reign. The banquet was for all his officials and advisers, that is, the military officers of the Persians and Medes, the nobles and officials of the provinces who had access to him. "},{"num":4,"verse":"He showed them the enormous wealth of his kingdom and the costly splendor of his greatness for many days, 180 to be exact. "},{"num":5,"verse":"When those days were over, the king held a banquet lasting seven days. This banquet was held in the enclosed garden of the king’s palace for all people in the fortress of Susa, whatever their rank."},{"num":6,"verse":"The garden had white and violet linen curtains. These curtains were attached to silver rods and marble pillars by cords made of white and purple fine linen. Gold and silver couches were on a mosaic pavement of purple rock, white marble, pearl-like stone, and black marble. "},{"num":7,"verse":"People drank from golden cups. No two cups were alike. The king also provided plenty of royal wine out of his royal generosity. "},{"num":8,"verse":"The drinking followed this rule: Drink as you please. (The king had ordered all the waiters in his palace to let everyone do as he pleased.)"},{"num":9,"verse":"Queen Vashti also held a banquet for the women at the royal palace of King Xerxes."},{"num":10,"verse":"On the seventh day when the king was drunk on wine, he ordered Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carcas, the seven eunuchs who served under King Xerxes, "},{"num":11,"verse":"to bring Queen Vashti in front of the king, wearing her royal crown. He wanted to show the people, especially the officials, her beauty, because she was very attractive. "},{"num":12,"verse":"But Queen Vashti refused the king’s command that the eunuchs delivered to her. As a result, the king became very angry, and his rage burned inside him."},{"num":13,"verse":"Now, the king usually asked for advice from all the experts in royal decrees and decisions, "},{"num":14,"verse":"from those closest to him—Carshena, Shethar, Admatha, Tarshish, Meres, Marsena, and Memucan. These seven officials of the Persians and Medes had access to the king and held the highest rank in the kingdom. The king asked these wise men who knew the times, "},{"num":15,"verse":"“According to the royal decrees, what must we do with Queen Vashti since she did not obey King Xerxes’ command, which the eunuchs delivered?”"},{"num":16,"verse":"Then Memucan spoke up in the presence of the king and the officials, “Queen Vashti has done wrong, not only against the king but also against all the officials and all the people in every province of King Xerxes. "},{"num":17,"verse":"The news of what the queen has done will spread to all women, and they will despise their husbands. They will say, ‘King Xerxes ordered Queen Vashti to be brought to him, but she would not come.’ "},{"num":18,"verse":"Today the wives of the officials in Persia and Media who have heard what the queen did will talk back to all the king’s officials. There will be contempt and short tempers. "},{"num":19,"verse":"If it pleases you, Your Majesty, issue a royal decree. It should be recorded in the decrees of the Persians and Medes, never to be repealed, that Vashti may never again appear in front of King Xerxes. Furthermore, Your Majesty, you should give her royal position to another woman who is more worthy than she. "},{"num":20,"verse":"When you issue your decree, your whole kingdom, great as it is, will hear it. Then all the wives will honor their husbands, regardless of their status.”"},{"num":21,"verse":"The king and his officials approved of this, and so the king did as Memucan suggested. "},{"num":22,"verse":"He sent official documents to all the king’s provinces, to each province in its own script and to the people in each province in their own language: “Let every husband be the ruler in his own house and speak with authority.”"}]