[{"header":"God Will Destroy Damascus"},{"num":17,"verse":"The special word about Damascus: “See, Damascus will no longer be a city. It will be destroyed and laid waste. "},{"num":2,"verse":"The cities of Aroer are left empty. They will be for the flocks to lie down in, and no one will make them afraid. "},{"num":3,"verse":"The strong city will be gone from Ephraim. Damascus will no longer rule. And those of Syria who are left alive will be like the shining-greatness of the sons of Israel,” says the Lord of All."},{"num":4,"verse":"In that day Jacob will lose his shining-greatness. And he will lose the fat of his flesh. "},{"num":5,"verse":"It will be like one who gathers the standing grain, taking the ears of grain with his arm or like one who gathers the ears of grain in the valley of Rephaim. "},{"num":6,"verse":"Yet some good will be left in it, as when an olive tree is shaken. There will still be two or three olives on the highest branch, and four or five on the branches of a tree that gives much fruit, says the Lord God of Israel."},{"num":7,"verse":"In that day man will turn to his Maker. His eyes will look to the Holy One of Israel. "},{"num":8,"verse":"He will not look to the altars, the work of his hands. He will not look to what his fingers have made, or to the false goddess Asherah and the altars of special perfume."},{"num":9,"verse":"In that day their strong cities will be like places left empty among the trees, or like high branches which they left behind because of the sons of Israel. The land will be laid waste. "},{"num":10,"verse":"For you have forgotten the God Who saves you. You have not remembered the rock where you are safe. So you plant beautiful plants, and put them with the vine-cuttings of a strange god. "},{"num":11,"verse":"In the day that you plant it you fence it in, and in the morning your seed is growing. But its fruit will waste away in a day of sickness and pain which cannot be healed."},{"header":"Other Nations Are Like Grain Worth Nothing"},{"num":12,"verse":"Listen to the cry of sorrow of many people. They sound like the noise of the seas and the noise of nations! They sound like the rushing of powerful waters. "},{"num":13,"verse":"The nations move on like the noise of many waters. But God will speak sharp words to them and they will run far away. They will be blown away like the part of grain that is of no worth by the wind in the mountains. They will be like dust blown around in a storm. "},{"num":14,"verse":"At evening time there is much fear! Before morning, they are gone. This will be what will come to those who take what belongs to us. It will be what happens to those who rob us."}]