[{"num":17,"verse":"The massa (burden) of Damascus. Hinei, Damascus is taken away from being a city, and it shall be a heap of ruins."},{"num":2,"verse":"The cities of Aroer are deserted; they shall be for adarim (flocks), which shall lie down, and none shall make them afraid."},{"num":3,"verse":"The fortified city also shall cease from Ephrayim, and the mamlechah from Damascus, and the remnant of Aram (Syria); they shall be like the kavod Bnei Yisroel, saith Hashem Tzva’os."},{"num":4,"verse":"And in that day it shall come to pass, that the kavod Ya’akov shall fade, and the fatness of his basar shall waste away."},{"num":5,"verse":"And it shall be as when the katzir (reaper, harvester) gathereth the standing grain, and reapeth the heads of grain with his zero’a; and it shall be as when one gleans heads of grain in the Emek Rephaim."},{"num":6,"verse":"Yet a remnant of gleanings shall be left in it, as the beating of a zayit (olive tree), two or three olives in the rosh of the uppermost olive branch, four or five in the poriyyah (fruitful) olive branches thereof, saith Hashem Elohei Yisroel."},{"num":7,"verse":"At that day shall ha’adam look to Oseihu (his Maker), and his eyes shall have respect to Kadosh Yisroel."},{"num":8,"verse":"And he shall not look to the mizbechot, the ma’aseh of his hands, neither shall respect that which his etzbe’ot (fingers) have made, either the Asherim or the incense altars."},{"num":9,"verse":"In that day shall their strong cities be like abandoned places in the choresh (thicket), or like branches they abandoned before the Bnei Yisroel; and there shall be desolation."},{"num":10,"verse":"Because thou hast forgotten the G-d of thy salvation, and hast not been mindful of the Tzur of thy Ma’oz; therefore shalt thou plant delightful plants, and shalt set them with zemorat zar (foreign vines)."},{"num":11,"verse":"In the day thou shalt set out thy plants to make them grow, and in the boker shalt thou bring thy zera to blossom; but the katzir (harvest) shall be a heap in the day of sickness and of incurable pain."},{"num":12,"verse":"Oy to the multitude of amim rabbim, which make an uproar like the roaring of the seas; and to the uproar of nations, that make a roar like the roar of mighty waters."},{"num":13,"verse":"The nations shall roar like the roaring of mayim rabbim; but He shall rebuke them, and they shall flee far off, and shall be chased as the motz (chaff) of the harim before the ruach, and like whirling dust before the storm."},{"num":14,"verse":"And hinei at erev, terror; and before boker, he [that terrorizes] is no more. This is the chelek of them that loot us, and the goral (lot) of them that plunder us."}]