[{"num":4,"verse":"Hear the word of the Lord, you children of Israel, for the Lord has a controversy (a pleading contention) with the inhabitants of the land, because there is no faithfulness, love, pity and mercy, or knowledge of God [from personal experience with Him] in the land."},{"num":2,"verse":"There is nothing but [false] swearing and breaking faith and killing and stealing and committing adultery; they break out [into violence], one [deed of] bloodshed following close on another."},{"num":3,"verse":"Therefore shall the land [continually] mourn, and all who dwell in it shall languish, together with the wild beasts of the open country and the birds of the heavens; yes, the fishes of the sea also shall [perish because of the drought] be collected and taken away."},{"num":4,"verse":"Yet let no man strive, neither let any man reprove [another—do not waste your time in mutual recriminations], for with you is My contention, O priest."},{"num":5,"verse":"And you shall stumble in the daytime, and the [false] prophet also shall stumble with you in the night; and I will destroy your mother [the priestly nation]."},{"num":6,"verse":"My people are destroyed for lack of knowledge; because you [the priestly nation] have rejected knowledge, I will also reject you that you shall be no priest to Me; seeing you have forgotten the law of your God, I will also forget your children."},{"num":7,"verse":"The more they increased and multiplied [in prosperity and power], the more they sinned against Me; I will change their glory into shame."},{"num":8,"verse":"They feed on the sin of My people and set their heart on their iniquity."},{"num":9,"verse":"And it shall be: Like people, like priest; I will punish them for their ways and repay them for their doings."},{"num":10,"verse":"For they shall eat and not have enough; they shall play the harlot and beget no increase, because they have forsaken the Lord for harlotry;"},{"num":11,"verse":"Harlotry and wine and new wine take away the heart and the mind and the spiritual understanding."},{"num":12,"verse":"My people [habitually] ask counsel of their [senseless] wood [idols], and their staff [of wood] gives them oracles and instructs them. For the spirit of harlotry has led them astray and they have played the harlot, withdrawing themselves from subjection to their God."},{"num":13,"verse":"They sacrifice on the tops of the mountains, and they burn incense upon the hills and under oaks, poplars, and terebinths, because there the shade is good. Therefore your daughters play the harlot and your sons’ wives commit adultery."},{"num":14,"verse":"I will not punish your daughters when they play the harlot nor your daughters-in-law when they commit adultery, for [the fathers and husbands] themselves go aside in order to be alone with women who prostitute themselves for gain, and they sacrifice at the altar with dedicated harlots [who surrender their chastity in honor of the goddess]. Therefore the people without understanding shall stumble and fall and come to ruin."},{"num":15,"verse":"Though you, Israel, play the harlot and worship idols, let not Judah offend and become guilty; come not to Gilgal, neither go up to Beth-aven [contemptuous reference to Bethel, then noted for idolatry], nor swear [in idolatrous service, saying], As the Lord lives."},{"num":16,"verse":"For Israel has behaved stubbornly, like a stubborn heifer. How then should he expect to be fed and treated by the Lord like a lamb in a large pasture?"},{"num":17,"verse":"Ephraim is joined [fast] to idols, [so] let him alone [to take the consequences]."},{"num":18,"verse":"Their drinking carousal over, they go habitually to play the harlot; [Ephraim’s] rulers [continue to] love shame more than her glory [which is the Lord, Israel’s God]."},{"num":19,"verse":"The resistless wind [of God’s wrath] has bound up [Israel] in its wings or skirts, and [in captivity] they and their altars shall be put to shame because of their sacrifices [to calves, to sun, moon, and stars, and to heathen gods]."}]