[{"num":4,"verse":"¶ Hear the word of the LORD, ye sons of Israel; for the LORD contends with the inhabitants of the land because there is no truth, nor mercy, nor knowledge of God in the earth."},{"num":2,"verse":"By swearing and lying and murdering and stealing and committing adultery, they prevailed, and blood touches blood."},{"num":3,"verse":"Therefore the earth shall mourn, and every one that dwells therein shall be cut off, with the beasts of the field and the fowls of heaven; and even the fishes of the sea shall be caught."},{"num":4,"verse":"Certainly man does not contend with nor reprehend man; for thy people are as those that resist the priest."},{"num":5,"verse":"Therefore thou shalt fall in the day, and the prophet shall also fall with thee by night, and I will cut off thy mother."},{"num":6,"verse":"¶ My people were cut off because they lacked wisdom; because thou hast rejected wisdom, I will cast thee out of the priesthood; seeing thou hast forgotten the law of thy God, I will also forget thy sons."},{"num":7,"verse":"According to their greatness, so did they sin against me; therefore I will change their honour into shame."},{"num":8,"verse":"They eat up the sin of my people, and in their iniquity they raise up their soul."},{"num":9,"verse":"The people shall become like the priest; and I will visit his ways upon him, and they shall reward him according to his doings."},{"num":10,"verse":"For they shall eat and not be satisfied; they shall commit whoredom and shall not increase because they have quit showing hospitality unto the LORD."},{"num":11,"verse":"Whoredom and wine and new wine take away the heart."},{"num":12,"verse":"¶ My people ask counsel of their wooden idol, and their stick declares unto them; for the spirit of whoredoms has caused them to err, and they have gone a whoring under their gods."},{"num":13,"verse":"They sacrifice upon the tops of the mountains and burn incense upon the hills, under oaks and poplars and elms, that had good shade; therefore your daughters shall commit whoredom, and your daughters-in-law shall commit adultery."},{"num":14,"verse":"I will not visit upon your daughters when they commit whoredom, nor upon your daughters-in-law when they commit adultery: for they offer with whores, and they sacrifice with cult prostitutes; therefore the people without understanding shall fall."},{"num":15,"verse":"Though thou, Israel, play the harlot, yet let not Judah be guilty; and do not come unto Gilgal, neither go up to Bethaven, nor swear, The LORD lives,"},{"num":16,"verse":"for Israel has turned away as a wild heifer; shall the LORD now feed them as rams in a large place?"},{"num":17,"verse":"Ephraim is given over to idols; leave him."},{"num":18,"verse":"Their drink has become corrupted; they have committed whoredom continually; her princes love gifts, shamefully."},{"num":19,"verse":"The wind has bound her up in her wings, and they shall be ashamed because of their sacrifices."}]