[{"num":4,"verse":"Hear the Devar Hashem, ye Bnei Yisroel: for Hashem hath a controversy with the yoshvei ha’aretz, because there is no emes, nor chesed, nor da’as Elohim in ha’aretz. [See 11:7-9; 1K 1:18-19 OJBC]"},{"num":2,"verse":"By aloh (false swearing, perjury), and kachash (lying), and ratzo’ach (murder), and ganov (stealing), and na’of (committing adultery) they break away, and damim b’damim they follow (bloodshed follows bloodshed)."},{"num":3,"verse":"Therefore shall ha’aretz mourn, and every one that dwelleth therein shall waste away languishing, with the wild beasts of the sadeh, and with the fowls of Shomayim; yea, the dagim of the yam also shall disappear."},{"num":4,"verse":"Yet let no ish bring a point of contention, nor reprove another; for thy people are as they that strive with the kohen."},{"num":5,"verse":"Therefore shalt thou stumble and fall in the yom, and the navi also shall stumble and fall with thee in the lailah, and I will destroy thy em."},{"num":6,"verse":"Ami are destroyed for lack of da’as (knowledge); because thou hast rejected da’as, I will also reject thee, that thou shalt be no kohen to Me; seeing thou hast forgotten the torat Eloheicha, I will also forget thy banim."},{"num":7,"verse":"The more they increased, the more they sinned against Me; therefore will I change their kavod into kalon (ignominy, shame)."},{"num":8,"verse":"They [i.e., the kohanim] feed on the chattat (sin) of Ami, and they relish their avon (iniquity)."},{"num":9,"verse":"And there shall be, like Am (People), like kohen; and I will visit them with punishment for their ways, and repay them for their doings."},{"num":10,"verse":"For they shall eat, and not have enough; they shall commit whoredom, and shall not increase; because they have abandoned being shomer to heed Hashem."},{"num":11,"verse":"Zenut (prostitution, whoredom) and yayin and tirosh take away the lev (understanding)."},{"num":12,"verse":"Ami (My people) consult a piece of wood, and their staff declareth unto them; for the ruach zenunim hath caused them to err, and they have played the zonah, forsaking Eloheihem."},{"num":13,"verse":"They sacrifice upon the tops of the mountains, and burn incense upon the hills, under oak and poplar and terebinth, because the shade thereof is tov; therefore your daughters shall commit whoredom, and your daughters-in-law shall commit ni’uf (adultery)."},{"num":14,"verse":"I will not visit punishment upon your daughters when they commit whoredom, nor your daughters-in-law when they commit ni’uf (adultery); because the men consort with zonot, and they sacrifice with kedeshot (temple prostitutes); thus the Am without binah (understanding) shall come to ruin."},{"num":15,"verse":"Though thou, Yisroel, play the zonah, yet let not Yehudah become guilty; and come not ye unto Gilgal, neither go ye up to Beit-Aven (House of Iniquity, pejorative name for Bethel), nor swear, Chai Hashem (As the L-rd lives)."},{"num":16,"verse":"For Yisroel slideth back (i.e., is stubborn, rebellious, unmanageable) like a backsliding parah (stubborn, rebellious cow); now Hashem will feed them like a lamb in a wide field."},{"num":17,"verse":"Ephrayim [i.e., the Northern Kingdom, Israel] is joined to atzabim (idols); leave him alone."},{"num":18,"verse":"When their drink is sour [i.e., when intoxicated], they have committed whoredom; her mogenim (shields, rulers) deeply love kalon (ignominy, shame)."},{"num":19,"verse":"The wind hath bound her up in her wings, and their zevakhot (sacrifices) shall bring them bushah (shame)."}]