[{"num":52,"verse":"Awake, awake, put on your strength, O Zion; put on your beautiful garments, O Jerusalem, the holy city; for henceforth there shall no more come into you the uncircumcised and the unclean."},{"num":2,"verse":"Shake yourself from the dust; arise, sit [erect in a dignified place], O Jerusalem; loose yourself from the bonds of your neck, O captive Daughter of Zion."},{"num":3,"verse":"For thus says the Lord: You were sold for nothing, and you shall be redeemed without money."},{"num":4,"verse":"For thus says the Lord God: My people went down at the first into Egypt to sojourn there; and [many years later Sennacherib] the Assyrian oppressed them for nothing. [Now I delivered you from both Egypt and Assyria; what then can prevent Me from delivering you from Babylon?]"},{"num":5,"verse":"But now what have I here, says the Lord, seeing that My people have been taken away for nothing? Those who rule over them howl [with joy], says the Lord, and My name continually is blasphemed all day long."},{"num":6,"verse":"Therefore My people shall know what My name is and what it means; therefore they shall know in that day that I am He who speaks; behold, I Am!"},{"num":7,"verse":"How beautiful upon the mountains are the feet of him who brings good tidings, who publishes peace, who brings good tidings of good, who publishes salvation, who says to Zion, Your God reigns!"},{"num":8,"verse":"Hark, your watchmen lift up their voices; together they sing for joy; for they shall see eye to eye the return of the Lord to Zion."},{"num":9,"verse":"Break forth joyously, sing together, you waste places of Jerusalem, for the Lord has comforted His people, He has redeemed Jerusalem!"},{"num":10,"verse":"The Lord has made bare His holy arm before the eyes of all the nations [revealing Himself as the One by Whose direction the redemption of Israel from captivity is accomplished], and all the ends of the earth shall witness the salvation of our God."},{"num":11,"verse":"Depart, depart, go out from there [the lands of exile]! Touch no unclean thing! Go out of the midst of her [Babylon]; cleanse yourselves and be clean, you who bear the vessels of the Lord [on your journey from there]."},{"num":12,"verse":"For you will not go out with haste, nor will you go in flight [as was necessary when Israel left Egypt]; for the Lord will go before you, and the God of Israel will be your rear guard."},{"num":13,"verse":"Behold, My Servant shall deal wisely and shall prosper; He shall be exalted and extolled and shall stand very high."},{"num":14,"verse":"[For many the Servant of God became an object of horror; many were astonished at Him.] His face and His whole appearance were marred more than any man’s, and His form beyond that of the sons of men—but just as many were astonished at Him,"},{"num":15,"verse":"So shall He startle and sprinkle many nations, and kings shall shut their mouths because of Him; for that which has not been told them shall they see, and that which they have not heard shall they consider and understand."}]