[{"num":38,"verse":"Bezalel made the burnt offering altar of acacia wood; its top was five cubits square and it was three cubits high."},{"num":2,"verse":"He made its horns on the four corners of it; the horns were of one piece with it, and he overlaid it with bronze."},{"num":3,"verse":"He made all the utensils and vessels of the altar, the pots, shovels, basins, forks or fleshhooks, and firepans; all its utensils and vessels he made of bronze."},{"num":4,"verse":"And he made for the altar a bronze grate of network under its ledge, extending halfway down it."},{"num":5,"verse":"He cast four rings for the four corners of the bronze grating to be places for the poles [with which to carry it]."},{"num":6,"verse":"And he made the poles of acacia wood and overlaid them with bronze."},{"num":7,"verse":"And he put the poles through the rings on the altar’s sides with which to carry it; he made it hollow with planks."},{"num":8,"verse":"He made the laver and its base of bronze from the mirrors of the women who ministered at the door of the Tent of Meeting."},{"num":9,"verse":"And he made the court: for the south side the hangings of the court were of fine twined linen, a hundred cubits;"},{"num":10,"verse":"Their pillars and their bronze sockets or bases were twenty; the hooks of the pillars and their joinings were silver."},{"num":11,"verse":"And for the north side the hangings were [also] a hundred cubits; their pillars and their sockets or bases of bronze were twenty; the hooks of the pillars and their joinings were of silver."},{"num":12,"verse":"But for the west side were hangings of fifty cubits; their pillars and their sockets or bases were ten; the hooks of the pillars and their joinings were of silver."},{"num":13,"verse":"And for the front, the east side, fifty cubits."},{"num":14,"verse":"The hangings for one side of the gate were fifteen cubits; their pillars three and their sockets or bases three."},{"num":15,"verse":"Also for the other side of the court gate, left and right, were hangings of fifteen cubits; their pillars three and their sockets or bases three."},{"num":16,"verse":"All the hangings around the court were of fine twined linen."},{"num":17,"verse":"The sockets for the pillars were of bronze, the hooks of the pillars and their joinings of silver, the overlaying of their tops of silver, and all the pillars of the court were joined with silver."},{"num":18,"verse":"The hanging or screen for the gate of the court was embroidered in blue, purple, and scarlet [stuff], and fine twined linen; the length was twenty cubits and the height in the breadth was five cubits, corresponding to the hangings of the court."},{"num":19,"verse":"Their pillars were four and their sockets of bronze four; their hooks were of silver, and the overlaying of their tops and their joinings were of silver."},{"num":20,"verse":"All the pegs for the tabernacle and around the court were of bronze."},{"num":21,"verse":"This is the sum of the things for the tabernacle of the Testimony, as counted at the command of Moses, for the work of the Levites under the direction of Ithamar son of Aaron, the [high] priest."},{"num":22,"verse":"Bezalel son of Uri, the son of Hur, of the tribe of Judah, made all that the Lord commanded Moses."},{"num":23,"verse":"With him was Aholiab son of Ahisamach, of the tribe of Dan, an engraver, a skillful craftsman, and embroiderer in blue, purple, and scarlet [stuff], and in fine linen."},{"num":24,"verse":"All the gold that was used for the work in all the building and furnishing of the sanctuary, the gold from the offering, was 29 talents and 730 shekels, by the shekel of the sanctuary."},{"num":25,"verse":"And the silver from those numbered of the congregation was 100 talents and 1,775 shekels, by sanctuary standards:"},{"num":26,"verse":"A beka for each man, that is, half a shekel, by the sanctuary shekel, for everyone who was counted, from twenty years old and upward, for 603,550 men."},{"num":27,"verse":"The 100 talents of silver were for casting the sockets or bases of the sanctuary and of the veil; 100 sockets for the 100 talents, a talent for a socket."},{"num":28,"verse":"Of the 1,775 shekels he made hooks for the pillars, and overlaid their tops, and made joinings for them."},{"num":29,"verse":"The bronze of the offering was 70 talents and 2,400 shekels."},{"num":30,"verse":"With it Bezalel made the sockets for the door of the Tent of Meeting, and the bronze altar and the bronze grate for it, and all the utensils of the altar,"},{"num":31,"verse":"The sockets of the court round about and of the court gate, and all the pegs of the tabernacle and around the court."}]