[{"num":38,"verse":"1 The altar of burnt offerings. 8 The brazen Laver. 9 The Court. 24 The sum of that the people offered."},{"num":1,"verse":"Also he made the altar of the burnt offering of Shittim wood: five cubits was the length thereof, and five cubits the breadth thereof: it was square and three cubits high."},{"num":2,"verse":"And he made unto it horns in the four corners thereof: the horns thereof were of the same, and he overlaid it with brass."},{"num":3,"verse":"Also he made all the instruments of the altar: the ashpans, and the besoms and the basins, the fleshhooks, and the censers: all the instruments thereof made he of brass."},{"num":4,"verse":"Moreover, he made a brazen grate wrought like a net to the Altar, under the compass of it beneath in the midst of it."},{"num":5,"verse":"And cast four rings of brass for the four ends of the grate to put bars in."},{"num":6,"verse":"And he made the bars of Shittim wood, and covered them with brass."},{"num":7,"verse":"The which bars he put into the rings on the sides of the altar to bear it withal, and made it hollow within the boards."},{"num":8,"verse":"¶ Also he made the laver of brass, and the foot of it of brass of the glasses of the women that did assemble and came together at the door of the Tabernacle of the Congregation."},{"num":9,"verse":"¶ Finally, he made the court on the South side full South: the hangings of the court were of fine twined linen, having an hundred cubits."},{"num":10,"verse":"Their pillars were twenty, and their brazen sockets twenty: the hooks of the pillars and their fillets were of silver."},{"num":11,"verse":"And on the North side the hangings were an hundred cubits: their pillars twenty, and their sockets of brass twenty, the hooks of the pillars, and their fillets of silver."},{"num":12,"verse":"On the west side also were hangings of fifty cubits, their ten pillars with their ten sockets: the hooks of the pillars, and their fillets of silver."},{"num":13,"verse":"And toward the East side, full East were hangings of fifty cubits."},{"num":14,"verse":"The hangings of the one side were fifteen cubits, their three pillars, and their three sockets:"},{"num":15,"verse":"And of the other side of the court gate on both sides were hangings of fifteen cubits, with their three pillars and their three sockets."},{"num":16,"verse":"All the hangings of the court round about were of fine twined linen."},{"num":17,"verse":"But the sockets of the pillars were of brass: the hooks of the pillars and their fillets of silver, and the covering of their chapiters of silver: and all the pillars of the court were hooped about with silver."},{"num":18,"verse":"He made also the hanging of the gate of the court of needle work, blue silk, and purple, and scarlet, and fine twined linen even twenty cubits long, and five cubits in height and breadth, like the hangings of the court."},{"num":19,"verse":"And their pillars were four with their four sockets of brass: their hooks of silver, and the covering of the chapiters, and their fillets of silver."},{"num":20,"verse":"But all the pins of the Tabernacle and of the court round about were of brass."},{"num":21,"verse":"¶ These are the parts of the Tabernacle, I mean, of the Tabernacle of the Testimony, which was appointed by the commandment of Moses for the office of the Levites, by the hand of Ithamar son to Aaron the Priest."},{"num":22,"verse":"So Bezalel the son of Uri, the son of Hur of the tribe of Judah, made all that the Lord commanded Moses."},{"num":23,"verse":"And with him Aholiab son of Ahisamach of the tribe of Dan, a cunning workman and an embroiderer, and a worker of needle work in blue silk, and in purple, and in scarlet, and in fine linen."},{"num":24,"verse":"All the gold that was occupied in all the work wrought for the holy place (which was the gold of the offering) was nine and twenty talents and seven hundred and thirty shekels, according to the shekel of the Sanctuary."},{"num":25,"verse":"But the silver of them that were numbered in the Congregation, was an hundred talents, and a thousand seven hundred seventy and five shekels, after the shekel of the Sanctuary."},{"num":26,"verse":"A portion for a man, that is, half a shekel after the shekel of the Sanctuary, for all them that were numbered from twenty years old and above, among six hundred thousand, and three thousand, and five hundred and fifty men."},{"num":27,"verse":"Moreover there were an hundred talents of silver, to cast the sockets of the Sanctuary, and the sockets of the veil: an hundred sockets of an hundred talents, a talent for a socket."},{"num":28,"verse":"But he made the hooks for the pillars of a thousand seven hundred and seventy and five shekels, and overlaid their chapiters, and made fillets about them."},{"num":29,"verse":"Also the brass of the offering was seventy talents, and two thousand, and four hundred shekels."},{"num":30,"verse":"Whereof he made the sockets to the door of the Tabernacle of the Congregation, and the brazen altar, and the brazen grate which was for it, with all the instruments of the Altar."},{"num":31,"verse":"And the sockets of the court round about, and the sockets for the court gate, and all the pins of the Tabernacle, and all the pins of the court round about."}]