[[],[{"type":"header","content":"Building the Altar of Burnt Offering"},{"type":"prose","content":"Next Bezalel used acacia wood to construct the square altar of burnt offering. It was 7 1⁄2 feet wide, 7 1⁄2 feet long, and 4 1⁄2 feet high."}],[{"type":"prose","content":"He made horns for each of its four corners so that the horns and altar were all one piece. He overlaid the altar with bronze."}],[{"type":"prose","content":"Then he made all the altar utensils of bronze—the ash buckets, shovels, basins, meat forks, and firepans."}],[{"type":"prose","content":"Next he made a bronze grating and installed it halfway down the side of the altar, under the ledge."}],[{"type":"prose","content":"He cast four rings and attached them to the corners of the bronze grating to hold the carrying poles."}],[{"type":"prose","content":"He made the poles from acacia wood and overlaid them with bronze."}],[{"type":"prose","content":"He inserted the poles through the rings on the sides of the altar. The altar was hollow and was made from planks."},{"type":"header","content":"Building the Washbasin"}],[{"type":"prose","content":"Bezalel made the bronze washbasin and its bronze stand from bronze mirrors donated by the women who served at the entrance of the Tabernacle."},{"type":"header","content":"Building the Courtyard"}],[{"type":"prose","content":"Then Bezalel made the courtyard, which was enclosed with curtains made of finely woven linen. On the south side the curtains were 150 feet long."}],[{"type":"prose","content":"They were held up by twenty posts set securely in twenty bronze bases. He hung the curtains with silver hooks and rings."}],[{"type":"prose","content":"He made a similar set of curtains for the north side—150 feet of curtains held up by twenty posts set securely in bronze bases. He hung the curtains with silver hooks and rings."}],[{"type":"prose","content":"The curtains on the west end of the courtyard were 75 feet long, hung with silver hooks and rings and supported by ten posts set into ten bases."}],[{"type":"prose","content":"The east end, the front, was also 75 feet long."}],[{"type":"prose","content":"The courtyard entrance was on the east end, flanked by two curtains. The curtain on the right side was 22 1⁄2 feet long and was supported by three posts set into three bases."}],[{"type":"prose","content":"The curtain on the left side was also 22 1⁄2 feet long and was supported by three posts set into three bases."}],[{"type":"prose","content":"All the curtains used in the courtyard were made of finely woven linen."}],[{"type":"prose","content":"Each post had a bronze base, and all the hooks and rings were silver. The tops of the posts of the courtyard were overlaid with silver, and the rings to hold up the curtains were made of silver."}],[{"type":"prose","content":"He made the curtain for the entrance to the courtyard of finely woven linen, and he decorated it with beautiful embroidery in blue, purple, and scarlet thread. It was 30 feet long, and its height was 7 1⁄2 feet, just like the curtains of the courtyard walls."}],[{"type":"prose","content":"It was supported by four posts, each set securely in its own bronze base. The tops of the posts were overlaid with silver, and the hooks and rings were also made of silver."}],[{"type":"prose","content":"All the tent pegs used in the Tabernacle and courtyard were made of bronze."},{"type":"header","content":"Inventory of Materials"}],[{"type":"prose","content":"This is an inventory of the materials used in building the Tabernacle of the Covenant. The Levites compiled the figures, as Moses directed, and Ithamar son of Aaron the priest served as recorder."}],[{"type":"prose","content":"Bezalel son of Uri, grandson of Hur, of the tribe of Judah, made everything just as the  had commanded Moses."}],[{"type":"prose","content":"He was assisted by Oholiab son of Ahisamach, of the tribe of Dan, a craftsman expert at engraving, designing, and embroidering with blue, purple, and scarlet thread on fine linen cloth."}],[{"type":"prose","content":"The people brought special offerings of gold totaling 2,193 pounds, as measured by the weight of the sanctuary shekel. This gold was used throughout the Tabernacle."}],[{"type":"prose","content":"The whole community of Israel gave 7,545 pounds of silver, as measured by the weight of the sanctuary shekel."}],[{"type":"prose","content":"This silver came from the tax collected from each man registered in the census. (The tax is one beka, which is half a shekel, based on the sanctuary shekel.) The tax was collected from 603,550 men who had reached their twentieth birthday."}],[{"type":"prose","content":"The hundred bases for the frames of the sanctuary walls and for the posts supporting the inner curtain required 7,500 pounds of silver, about 75 pounds for each base."}],[{"type":"prose","content":"The remaining 45 pounds of silver was used to make the hooks and rings and to overlay the tops of the posts."}],[{"type":"prose","content":"The people also brought as special offerings 5,310 pounds of bronze,"}],[{"type":"prose","content":"which was used for casting the bases for the posts at the entrance to the Tabernacle, and for the bronze altar with its bronze grating and all the altar utensils."}],[{"type":"prose","content":"Bronze was also used to make the bases for the posts that supported the curtains around the courtyard, the bases for the curtain at the entrance of the courtyard, and all the tent pegs for the Tabernacle and the courtyard."}]]