[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore say.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—These words, again repeated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", refer to what the people of Jerusalem had said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their saying these things was a reason, not for what God would do, but for His declaring His merciful purpose beforehand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As a little sanctuary.—Rather, as a sanctuary for a little. The original word is to be taken as an adverb rather than an adjective, and in itself may refer either to time or to amount: either a sanctuary for a little time, or a sanctuary in some degree. The connection points to the former as the true sense; for a little while, during the term of their captivity, God’s presence with them spiritually would be instead of the outward symbolical presence in His Temple. The contrast is striking. God has already said that he would abandon the Temple, and give up Jerusalem to destruction, and cast out its people; but now to the exiles, scattered among the heathen, He would Himself be for a sanctuary.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "As a little sanctuary.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "as a sanctuary for a little. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The original word is to be taken as an adverb rather than an adjective, and in itself may refer either to time or to amount: either a sanctuary for a little time, or a sanctuary in some degree. The connection points to the former as the true sense; for a little while, during the term of their captivity, God’s presence with them spiritually would be instead of the outward symbolical presence in His Temple. The contrast is striking. God has already said that he would abandon the Temple, and give up Jerusalem to destruction, and cast out its people; but now to the exiles, scattered among the heathen, He would Himself be for a sanctuary.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 11:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore say — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In vindication of the captives; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Although I have cast them far off — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not from myself, but from you and your polluted land, and out of the way of the dreadful judgments which are approaching; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among the heathen — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Chaldeans, or those among whom the Chaldeans have placed them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and have scattered them among the countries",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Have separated them from each other, and dispersed them in many countries; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yet will I be to them as a little sanctuary — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A sanctuary, or a refuge and protection “for a short time,” (so Bishop Newcome,) that is, during the seventy years’ captivity; or a little one in opposition to the great temple at Jerusalem; which, when its inhabitants were in the greatest need, should afford them the least help. But I, says God, will really be to my captives what the proud, self-deceiving Jews promise themselves from their temple, namely, their defence, support, and comfort. To me shall they flee, and in me shall they be safe, as he was that took hold on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the horns of the altar. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or rather, they shall have such communion with me in the land of their captivity, as it was thought could be had nowhere but in the temple. They shall have the tokens of my presence with them, and my grace in their hearts shall sanctify their prayers and praises, as truly as ever the altar at the temple sanctified the gift. Observe, reader, they that are deprived of the benefit of public ordinances, if it be not their own fault, may have the want of them abundantly supplied in the immediate communications of divine grace and comforts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:14-21 The pious captives in Babylon were insulted by the Jews who continued in Jerusalem; but God made gracious promises to them. It is promised, that God will give them one heart; a heart firmly fixed for God, and not wavering. All who are made holy have a new spirit, a new temper and dispositions; they act from new principles, walk by new rules, and aim at new ends. A new name, or a new face, will not serve without a new spirit. If any man be in Christ, he is a new creature. The carnal heart, like a stone, cannot be made to feel. Men live among the dead and dying, and are neither concerned nor humbled. He will make their hearts tender and fit to receive impressions: this is God's work, it is his gift by promise; and a wonderful and happy change is wrought by it, from death to life. Their practices shall be agreeable to those principles. These two must and will go together. When the sinner feels his need of these blessings, let him present the promises as prayers in the name of Christ, they will be performed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As a little sanctuary - Rather, I will be to them for a little while a sanctuary. The blessing was provisional, they were to look forward to a blessing more complete. For a little while they were to be satisfied with God's special presence in a foreign land, but they were to look forward to a renewal of His presence in the restored temple of Jerusalem. \"sanctuary\" means here strictly the holy place, the tabernacle of the Most High: Yahweh will Himself be to the exiles in the place of the local sanctuary, in which the Jews of Jerusalem so much prided themselves (compare the margin reference). Here is the germ from which is developed ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 40-48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the picture of the kingdom of God in its new form. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. Although—anticipating the objection of the priests at Jerusalem, that the exiles were \"cast far off.\" Though this be so, and they are far from the outer temple at Jerusalem, I will be their asylum or sanctuary instead (Ps 90:1; 91:9; Isa 8:14). My shrine is the humble heart: a preparation for gospel catholicity when the local and material temple should give place to the spiritual (Isa 57:15; 66:1; Mal 1:11; Joh 4:21-24; Ac 7:48, 49). The trying discipline of the exile was to chasten the outcasts so as to be meet recipients of God's grace, for which the carnal confidence of the priests disqualified them. The dispersion served the end of spiritualizing and enlarging the views even of the better Jews, so as to be able to worship God everywhere without a material temple; and, at the same time, it diffused some knowledge of God among the greatest Gentile nations, thus providing materials for the gathering in of the Christian Church among the Gentiles; so marvellously did God overrule a present evil for an ultimate good. Still more does all this hold good in the present much longer dispersion which is preparing for a more perfect and universal restoration (Isa 2:2-4; Jer 3:16-18). Their long privation of the temple will prepare them for appreciating the more, but without Jewish narrowness, the temple that is to be (Eze 40:1-44:31).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a little—rather, \"for a little season\"; No matter how long the captivity may be, the seventy years will be but as a little season, compared with their long subsequent settlement in their land. This holds true only partially in the case of the first restoration; but as in a few centuries they were dispersed again, the full and permanent restoration is yet future (Jer 24:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in apology and vindication of them, backed with excellent promises in the following verses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Say; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " say to them, and of them in Babylon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Although I have cast them far off:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the obstinate Jews at Jerusalem will call them apostates and renegades; but let such false accusers know that they were sent thither, and that I the Lord sent them thither, and will own them there too. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Far off; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not from myself, but from you, your polluted land, and dreadful approaching judgments. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Among the heathen; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Chaldeans, or such as the Chaldeans placed them among. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Scattered them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " dispersed and separated them from one another in many countries which were under the king of Babylon. Yet they are dear to me, and my purposes are for them more gracious than yours are for them, or than mine are for you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As a little sanctuary; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for a little while, i.e. during the seventy years’ captivity; or for a few of them, the remnant was ever little: or, as it refers to the sanctuary, a little one in opposition to that great, rich, splendid, and admired temple at Jerusalem, which when they need most, shall help least; but I, saith God, will be really to my captives what the proud self-deceiving Jews promise their temple shall be to them, both for glory, defence, and for worship, which shall with heart and love be given by these I have sent away; and wherever they are, their prayers, synagogue worship, and obedience shall be to me as well-pleasing as they shall desire. They at a distance weep on Chebar banks; you, O rebellious! pollute the temple by your idolatries. I will comfort the mourners; I will punish you polluters of my temple and worship. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore say, thus saith the Lord God,.... Since they were so insulted and ill treated by their brethren the Jews: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "although I have cast them afar off among the Heathen; both the ten tribes, even all the house of Israel, who were carried into Assyria, and placed in the cities of the Medes, in Halath and Habor, by the river Gozan, 2 Kings 17:6; and those of the Jews in Jeconiah's captivity, among whom were Ezekiel, and his brethren, and his kindred: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "although I have cast them afar off among the Heathen; both the ten tribes, even all the house of Israel, who were carried into Assyria, and placed in the cities of the Medes, in Halath and Habor, by the river Gozan, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and those of the Jews in Jeconiah's captivity, among whom were Ezekiel, and his brethren, and his kindred: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and although I have scattered them among the countries; and therefore, what with the distance of the place where they were, and the dispersion of them among the people where they resided, their case might seem to be desperate; and that there was no probability, and scarce any possibility, of their being preserved as a people, and of their restoration to their own land: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yet will I be to them a little sanctuary in the countries where they shall come; their dwelling place, as he has been to his people in all generations their protection from all their enemies, in whom, and by whose power, they should be safe; and whose presence they should enjoy, though deprived of public ordinances, of temple worship and service; though they were at a distance from the great sanctuary, the temple, the inhabitants of Jerusalem boasted of, yet the Lord would make up the want of that to them with himself. The Targum, Jarchi, and Kimchi (m) interpret this of the synagogues, which were second to the temple, the Israelites had in foreign countries, where they prayed to the Lord, and worshipped him, and enjoyed his presence. It may be rendered, \"the sanctuary of a few\" (n); they being but few, especially that were truly godly, that were carried captive: or, \"a sanctuary for a little while\" (o); that is, during seventy years, and then they should be returned, as follows. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I have given them synagogues, second to my sanctuary, and they are as few in the provinces where they are carried captive.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Ex T. Bab. Megilla, fol. 29. 1.((n)  \"ad sanctuarium paucitatis\", Calvin; \"in sanctuarium paucorum\", Cocceius. So Ben Melech says the word is a substantive in some copies. (o) Paulisper, Junius & Tremellius, Polanus, Castalio. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Ex T. Bab. Megilla, fol. 29. 1.((n)  \"ad sanctuarium paucitatis\", Calvin; \"in sanctuarium paucorum\", Cocceius. So Ben Melech says the word is a substantive in some copies. (o) Paulisper, Junius & Tremellius, Polanus, Castalio. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore say, Thus saith the Lord GOD; Although I have cast them far off among the nations, and although I have scattered them among the countries, yet will I be to them as a little {h} sanctuary in the countries where they shall come.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Therefore say, Thus saith the Lord GOD; Although I have cast them far off among the nations, and although I have scattered them among the countries, yet will I be to them as a little ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " sanctuary in the countries where they shall come.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) They will be yet a little church: showing that the Lord will ever have some to call on his Name, whom he will preserve and restore, though they are for a time afflicted.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yet will I be to them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather: and ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "have been to them for a sanctuary but little",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the countries where they are come. The expression “for a sanctuary but little” refers to the taunt of the dwellers in Jerusalem that the exiles were far from the sanctuary and had no part in Jehovah. It is true that he had not been to the exiles in great measure that which a “sanctuary” is, viz. a presence of Jehovah, a sanctification, and a religious joy. It is doubtful if “sanctuary” has anywhere (even ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the meaning of asylum, protection; the sanctuary is the abode of Jehovah, and his presence there sanctifies those in the midst of whom he dwells. The exiles longed to be near the sanctuary and mourned their distance from it (Psalms 84, 137); while those left in the land boasted of the possession of it and looked on the exiles as outcasts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yet will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I be unto them as a little sanctuary",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; better, with the Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a little while",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as marking that the state described was transient and provisional. For a time, Ezekiel and the exiles were to find the presence of Jehovah manifested as in the vision of Chebar (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:4-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or felt spiritually, and this would make the spot where they found themselves as fully a holy place as the temple had been. There also they would have a \"house of God.\" But this was not to be their permanent lot. There was to be a restoration to \"the land of Israel\" (ver. 17; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to the visible sanctuary, to a second temple no longer desecrated by the pollutions that had defiled the first. As with all such prophecies, the words had \"springing and germinant accomplishments.\" In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 40-48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", we have Ezekiel's ideal vision of their fulfilment. A literal but incomplete fulfilment is formed in the work of restoration achieved by Zerubbabel, Ezra, and Nehemiah, and the hopes then cherished by Haggai and Zechariah. A more complete but less literal fulfilment appears in the Church of Christ as the true Israel of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and in the Jerusalem which is above (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 4:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the fact that in the seer's vision of that heavenly city there is no temple, but the presence of \"the Lord God Almighty and the Lamb\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), we find the crowning development of Ezekiel's thought. Intermediate expansions are found ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the gradual substitution of the synagogue for the temple in the religious life of Israel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in our Lord's words to the woman of Samaria (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:21-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in his promise that where two or three are gathered together in his Name, there he would be in the midst of them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 18:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The thought that it is the presence of Jehovah that makes the sanctuary, not the sanctuary that secures the presence, Ezekiel may have learnt from the fate of Shiloh (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:60",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Ezekiel 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Promise of the Gathering of Israel out of the Nations",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 11:14. And the word of Jehovah came to me, saying,  Ezekiel 11:15. Son of man, thy brethren, thy brethren are the people of thy proxy, and the whole house of Israel, the whole of it, to whom the inhabitants of Jerusalem say, Remain far away from Jehovah; to us the land is given for a possession. Ezekiel 11:16. Therefore say, Thus saith the Lord Jehovah, Ye, I have sent them far away, and have scattered them in the lands, but I have become to them a sanctuary for a little while in the lands whither they have come. Ezekiel 11:17. Therefore say, Thus saith the Lord Jehovah, And I will gather you from the nations, and will collect you together from the lands in which ye are scattered, and will give you the land of Israel. Ezekiel 11:18. And they will come thither, and remove from it all its detestable things, and all its abominations. Ezekiel 11:19. And I will give them one heart, and give a new spirit within you; and will take the heart of stone out of their flesh, and give them a heart of flesh; Ezekiel 11:20. That they may walk in my statutes, and preserve my rights, and do them: and they will be my people, and I will be their God. Ezekiel 11:21. But those whose heart goeth to the heart of their detestable things and their abominations, I will give their way upon their head, is the saying of the Lord Jehovah. - The prophet had interceded, first of all for the inhabitants of Jerusalem (Ezekiel 9:8), and then for the rulers of the nation, and had asked God whether He would entirely destroy the remnant of Israel. To this God replies that his brethren, in whom he is to interest himself, are not these inhabitants of Jerusalem and these rulers of the nation, but the Israelites carried into exile, who are regarded by these inhabitants at Jerusalem as cut off from the people of God. The nouns in Ezekiel 11:15 are not \"accusatives, which are resumed in the suffix to הרחקתּים in Ezekiel 11:16,\" as Hitzig imagines, but form an independent clause, in which אחיך is the subject, and אנשׁי גאלּתך as well as כּל־בּית ישׂראל sa llew sa the predicates. The repetition of \"thy brethren\" serves to increase the force of the expression: thy true, real brethren; not in contrast to the priests, who were lineal relations (Hvernick), but in contrast to the Israelites, who had only the name of Israel, and denied its nature.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And the word of Jehovah came to me, saying,  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Son of man, thy brethren, thy brethren are the people of thy proxy, and the whole house of Israel, the whole of it, to whom the inhabitants of Jerusalem say, Remain far away from Jehovah; to us the land is given for a possession. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Therefore say, Thus saith the Lord Jehovah, Ye, I have sent them far away, and have scattered them in the lands, but I have become to them a sanctuary for a little while in the lands whither they have come. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Therefore say, Thus saith the Lord Jehovah, And I will gather you from the nations, and will collect you together from the lands in which ye are scattered, and will give you the land of Israel. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And they will come thither, and remove from it all its detestable things, and all its abominations. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I will give them one heart, and give a new spirit within you; and will take the heart of stone out of their flesh, and give them a heart of flesh; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That they may walk in my statutes, and preserve my rights, and do them: and they will be my people, and I will be their God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But those whose heart goeth to the heart of their detestable things and their abominations, I will give their way upon their head, is the saying of the Lord Jehovah. - The prophet had interceded, first of all for the inhabitants of Jerusalem (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 9:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and then for the rulers of the nation, and had asked God whether He would entirely destroy the remnant of Israel. To this God replies that his brethren, in whom he is to interest himself, are not these inhabitants of Jerusalem and these rulers of the nation, but the Israelites carried into exile, who are regarded by these inhabitants at Jerusalem as cut off from the people of God. The nouns in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are not \"accusatives, which are resumed in the suffix to הרחקתּים in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",\" as Hitzig imagines, but form an independent clause, in which אחיך is the subject, and אנשׁי גאלּתך as well as כּל־בּית ישׂראל sa llew sa the predicates. The repetition of \"thy brethren\" serves to increase the force of the expression: thy true, real brethren; not in contrast to the priests, who were lineal relations (Hvernick), but in contrast to the Israelites, who had only the name of Israel, and denied its nature.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "These brethren are to be the people of his proxy; and toward these he is to exercise גּאלּה. גּאלּה is the business, or the duty and right, of the Gol. According to the law, the Gol was the brother, or the nearest relation, whose duty it was to come to the help of his impoverished brother, not only by redeeming (buying back) his possession, which poverty had compelled him to sell, but to redeem the man himself, if he had been sold to pay his debts (vid., Leviticus 25:25, Leviticus 25:48). The Gol therefore became the possessor of the property of which his brother had been unjustly deprived, if it were not restored till after his death (Numbers 5:8). Consequently he was not only the avenger of blood, but the natural supporter and agent of his brother; and גּאלּה signifies not merely redemption or kindred, but proxy, i.e., both the right and obligation to act as the legal representative, the avenger of blood, the hair, etc., of the brother. The words \"and the whole of the house of Israel\" are a second predicate to \"thy brethren,\" and affirm that the brethren, for whom Ezekiel can and is to intercede, form the whole of the house of Israel, the term \"whole\" being rendered more emphatic by the repetition of כּל in כּלּה. A contrast is drawn between this \"whole house of Israel\" and the inhabitants of Jerusalem, who say to those brethren, \"Remain far away from Jehovah, to us is the land given for a possession.\" It follows from this, first of all, that the brethren of Ezekiel, towards whom he was to act as Gol, were those who had been taken away from the land, his companions in exile; and, secondly, that the exiles formed the whole of the house of Israel, that is to say, that they alone would be regarded by God as His people, and not the inhabitants of Jerusalem or those left in the land, who regarded the exiles as no longer a portion of the nation: simply because, in their estrangement from God, they looked upon the mere possession of Jerusalem as a pledge of participation in the grace of God. This shows the prophet where the remnant of the people of God is to be found. To this there is appended in Ezekiel 11:16. a promise of the way in which the Lord will make this remnant His true people. לכן, therefore, viz., because the inhabitants of Jerusalem regard the exiles as rejected by the Lord, Ezekiel is to declare to them that Jehovah is their sanctuary even in their dispersion (v. 16); and because the others deny that they have any share in the possession of the land, the Lord will gather them together again, and give them the land of Israel (Ezekiel 11:17). The two לכן are co-ordinate, and introduce the antithesis to the disparaging sentence pronounced by the inhabitants of Jerusalem upon those who have been carried into exile. The כּי before the two leading clauses in Ezekiel 11:16 does not mean \"because,\" serving to introduce a protasis, to which Ezekiel 11:17 would form the apodosis, as Ewald affirms; but it stands before the direct address in the sense of an assurance, which indicates that there is some truth at the bottom of the judgment pronounced by their opponents, the inhabitants of Jerusalem. The thought is this: the present position of affairs is unquestionably that Jehovah has scattered them (the house of Israel) among the Gentiles; but He has not therefore cast them off. He has become a sanctuary to them in the lands of their dispersion. Migdâsh does not mean either asylum or an object kept sacred (Hitzig), but a sanctuary, more especially the temple. They had, indeed, lost the outward temple (at Jerusalem); but the Lord Himself had become their temple. What made the temple into a sanctuary was the presence of Jehovah, the covenant God, therein. This even the exiles were to enjoy in their banishment, and in this they would possess a substitute for the outward temple. This thought is rendered still more precise by the word מעט, which may refer either to time or measure, and signify \"for a short time,\" or \"in some measure.\" It is difficult to decide between these two renderings. In support of the latter, which Kliefoth prefers (after the lxx and Vulgate), it may be argued that the manifestation of the Lord, both by the mission of prophets and by the outward deliverances and inward consolations which He bestowed upon the faithful, was but a partial substitute to the exile for His gracious presence in the temple and in the holy land. Nevertheless, the context, especially the promise in Ezekiel 11:17, that He will gather them again and lead them back into the land of Israel, appears to favour the former signification, namely, that this substitution was only a provisional one, and was only to last for a short time, although it also implies that this could not and was not meant to be a perfect substitute for the gracious presence of the Lord. For Israel, as the people of God, could not remain scattered abroad; it must possess the inheritance bestowed upon it by the Lord, and have its God in the midst of it in its own land, and that in a manner more real than could possibly be the case in captivity among the Gentiles. This will be fully realized in the heavenly Jerusalem, where the Lord God Almighty and the Lamb will be a temple to the redeemed (Revelation 21:22). Therefore will Jehovah gather together the dispersed once more, and lead them back into the land of Israel, i.e., into the land which He designed for Israel; whereas the inhabitants of Jerusalem, who boast of their possession of Canaan (Ezekiel 11:15), will lose what they now possess. Those who are restored will then remove all idolatrous abominations (Ezekiel 11:17), and receive from God a new and feeling heart (Ezekiel 11:19), so that they will walk in the ways of God, and be in truth the people of God (Ezekiel 11:20).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "These brethren are to be the people of his proxy; and toward these he is to exercise גּאלּה. גּאלּה is the business, or the duty and right, of the Gol. According to the law, the Gol was the brother, or the nearest relation, whose duty it was to come to the help of his impoverished brother, not only by redeeming (buying back) his possession, which poverty had compelled him to sell, but to redeem the man himself, if he had been sold to pay his debts (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The Gol therefore became the possessor of the property of which his brother had been unjustly deprived, if it were not restored till after his death (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Consequently he was not only the avenger of blood, but the natural supporter and agent of his brother; and גּאלּה signifies not merely redemption or kindred, but proxy, i.e., both the right and obligation to act as the legal representative, the avenger of blood, the hair, etc., of the brother. The words \"and the whole of the house of Israel\" are a second predicate to \"thy brethren,\" and affirm that the brethren, for whom Ezekiel can and is to intercede, form the whole of the house of Israel, the term \"whole\" being rendered more emphatic by the repetition of כּל in כּלּה. A contrast is drawn between this \"whole house of Israel\" and the inhabitants of Jerusalem, who say to those brethren, \"Remain far away from Jehovah, to us is the land given for a possession.\" It follows from this, first of all, that the brethren of Ezekiel, towards whom he was to act as Gol, were those who had been taken away from the land, his companions in exile; and, secondly, that the exiles formed the whole of the house of Israel, that is to say, that they alone would be regarded by God as His people, and not the inhabitants of Jerusalem or those left in the land, who regarded the exiles as no longer a portion of the nation: simply because, in their estrangement from God, they looked upon the mere possession of Jerusalem as a pledge of participation in the grace of God. This shows the prophet where the remnant of the people of God is to be found. To this there is appended in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". a promise of the way in which the Lord will make this remnant His true people. לכן, therefore, viz., because the inhabitants of Jerusalem regard the exiles as rejected by the Lord, Ezekiel is to declare to them that Jehovah is their sanctuary even in their dispersion (v. 16); and because the others deny that they have any share in the possession of the land, the Lord will gather them together again, and give them the land of Israel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The two לכן are co-ordinate, and introduce the antithesis to the disparaging sentence pronounced by the inhabitants of Jerusalem upon those who have been carried into exile. The כּי before the two leading clauses in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " does not mean \"because,\" serving to introduce a protasis, to which ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " would form the apodosis, as Ewald affirms; but it stands before the direct address in the sense of an assurance, which indicates that there is some truth at the bottom of the judgment pronounced by their opponents, the inhabitants of Jerusalem. The thought is this: the present position of affairs is unquestionably that Jehovah has scattered them (the house of Israel) among the Gentiles; but He has not therefore cast them off. He has become a sanctuary to them in the lands of their dispersion. Migdâsh does not mean either asylum or an object kept sacred (Hitzig), but a sanctuary, more especially the temple. They had, indeed, lost the outward temple (at Jerusalem); but the Lord Himself had become their temple. What made the temple into a sanctuary was the presence of Jehovah, the covenant God, therein. This even the exiles were to enjoy in their banishment, and in this they would possess a substitute for the outward temple. This thought is rendered still more precise by the word מעט, which may refer either to time or measure, and signify \"for a short time,\" or \"in some measure.\" It is difficult to decide between these two renderings. In support of the latter, which Kliefoth prefers (after the lxx and Vulgate), it may be argued that the manifestation of the Lord, both by the mission of prophets and by the outward deliverances and inward consolations which He bestowed upon the faithful, was but a partial substitute to the exile for His gracious presence in the temple and in the holy land. Nevertheless, the context, especially the promise in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that He will gather them again and lead them back into the land of Israel, appears to favour the former signification, namely, that this substitution was only a provisional one, and was only to last for a short time, although it also implies that this could not and was not meant to be a perfect substitute for the gracious presence of the Lord. For Israel, as the people of God, could not remain scattered abroad; it must possess the inheritance bestowed upon it by the Lord, and have its God in the midst of it in its own land, and that in a manner more real than could possibly be the case in captivity among the Gentiles. This will be fully realized in the heavenly Jerusalem, where the Lord God Almighty and the Lamb will be a temple to the redeemed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Therefore will Jehovah gather together the dispersed once more, and lead them back into the land of Israel, i.e., into the land which He designed for Israel; whereas the inhabitants of Jerusalem, who boast of their possession of Canaan (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), will lose what they now possess. Those who are restored will then remove all idolatrous abominations (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and receive from God a new and feeling heart (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), so that they will walk in the ways of God, and be in truth the people of God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The fulfilment of this promise did, indeed, begin with the return of a portion of the exiles under Zerubbabel; but it was not completed under either Zerubbabel or Ezra, or even in the Maccabean times. Although Israel may have entirely relinquished the practice of gross idolatry after the captivity, it did not then attain to that newness of heart which is predicted in Ezekiel 11:19, Ezekiel 11:20. This only commenced with the Baptist's preaching of repentance, and with the coming of Christ; and it was realized in the children of Israel, who accepted Jesus in faith, and suffered Him to make them children of God. Yet even by Christ this prophecy has not yet been perfectly fulfilled in Israel, but only in part, since the greater portion of Israel has still in its hardness that stony heart which must be removed out of its flesh before it can attain to salvation. The promise in Ezekiel 11:19 has for its basis the prediction in Deuteronomy 30:6. \"What the circumcision of the heart is there, viz., the removal of all uncleanliness, of which outward circumcision was both the type and pledge, is represented here as the giving of a heart of flesh instead of one of stone\" (Hengstenberg). I give them one heart. לב אחד, which Hitzig is wrong in proposing to alter into לב , another heart, after the lxx, is supported and explained by Jeremiah 32:39, \"I give them one heart and one way to fear me continually\" (cf. Zephaniah 3:9 and Acts 4:32). One heart is not an upright, undivided heart (לב ), but a harmonious, united heart, in contrast to the division or plurality of hearts which prevails in the natural state, in which every one follows his own heart and his own mind, turning \"every one to his own way\" (Isaiah 53:6). God gives one heart, when He causes all hearts and minds to become one. This can only be effected by His giving a \"new spirit,\" taking away the stone-heart, and giving a heart of flesh instead. For the old spirit fosters nothing but egotism and discord. The heart of stone has no susceptibility to the impressions of the word of God and the drawing of divine grace. In the natural condition, the heart of man is as hard as stone. \"The word of God, the external leadings of God, pass by and leave no trace behind. The latter may crush it, and yet not break it. Even the fragments continue hard; yea, the hardness goes on increasing\" (Hengstenberg). The heart of flesh is a tender heart, susceptible to the drawing of divine grace (compare Ezekiel 36:26, where these figures, which are peculiar to Ezekiel, recur; and for the substance of the prophecy, Jeremiah 31:33). The fruit of this renewal of heart is walking in the commandments of the Lord; and the consequence of the latter is the perfect realization of the covenant relation, true fellowship with the Lord God. But judgment goes side by side with this renewal. Those who will not forsake their idols become victims to the judgment (Ezekiel 11:21). The first hemistich of Ezekiel 11:21 is a relative clause, in which אשׁר is to be supplied and connected with לבּם: \"Whose heart walketh after the heart of their abominations.\" The heart, which is attributed to the abominations and detestations, i.e., to the idols, is the inclination to idolatry, the disposition and spirit which manifest themselves in the worship of idols. Walking after the heart of the idols forms the antithesis to walking after the heart of God (1 Samuel 13:14). For 'דּרכּם וגו, \"I will give their way,\" see Ezekiel 9:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The fulfilment of this promise did, indeed, begin with the return of a portion of the exiles under Zerubbabel; but it was not completed under either Zerubbabel or Ezra, or even in the Maccabean times. Although Israel may have entirely relinquished the practice of gross idolatry after the captivity, it did not then attain to that newness of heart which is predicted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This only commenced with the Baptist's preaching of repentance, and with the coming of Christ; and it was realized in the children of Israel, who accepted Jesus in faith, and suffered Him to make them children of God. Yet even by Christ this prophecy has not yet been perfectly fulfilled in Israel, but only in part, since the greater portion of Israel has still in its hardness that stony heart which must be removed out of its flesh before it can attain to salvation. The promise in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " has for its basis the prediction in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 30:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"What the circumcision of the heart is there, viz., the removal of all uncleanliness, of which outward circumcision was both the type and pledge, is represented here as the giving of a heart of flesh instead of one of stone\" (Hengstenberg). I give them one heart. לב אחד, which Hitzig is wrong in proposing to alter into לב , another heart, after the lxx, is supported and explained by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"I give them one heart and one way to fear me continually\" (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 4:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). One heart is not an upright, undivided heart (לב ), but a harmonious, united heart, in contrast to the division or plurality of hearts which prevails in the natural state, in which every one follows his own heart and his own mind, turning \"every one to his own way\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). God gives one heart, when He causes all hearts and minds to become one. This can only be effected by His giving a \"new spirit,\" taking away the stone-heart, and giving a heart of flesh instead. For the old spirit fosters nothing but egotism and discord. The heart of stone has no susceptibility to the impressions of the word of God and the drawing of divine grace. In the natural condition, the heart of man is as hard as stone. \"The word of God, the external leadings of God, pass by and leave no trace behind. The latter may crush it, and yet not break it. Even the fragments continue hard; yea, the hardness goes on increasing\" (Hengstenberg). The heart of flesh is a tender heart, susceptible to the drawing of divine grace (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 36:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where these figures, which are peculiar to Ezekiel, recur; and for the substance of the prophecy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The fruit of this renewal of heart is walking in the commandments of the Lord; and the consequence of the latter is the perfect realization of the covenant relation, true fellowship with the Lord God. But judgment goes side by side with this renewal. Those who will not forsake their idols become victims to the judgment (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The first hemistich of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is a relative clause, in which אשׁר is to be supplied and connected with לבּם: \"Whose heart walketh after the heart of their abominations.\" The heart, which is attributed to the abominations and detestations, i.e., to the idols, is the inclination to idolatry, the disposition and spirit which manifest themselves in the worship of idols. Walking after the heart of the idols forms the antithesis to walking after the heart of God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). For 'דּרכּם וגו, \"I will give their way,\" see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 9:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]