[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Your slain . . . they are the flesh.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—They had boasted of the protection of their strong city: it should be a security only to the dead who had fallen by their own violence. The living who vainly trusted in its strength should be brought out of it, and delivered as captives to the stranger. The prophecy here takes up their own simile of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and shows that it shall not avail them. On the contrary, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is expressly said that the figure, in their sense of it, shall not be true. The use of and repeated recurrence to this singular figure may illustrate the familiarity of the people with language of this kind, and help us to appreciate the figurative character of many of Ezekiel’s expressions.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew Henry's Concise Commentary11:1-13 Where Satan cannot persuade men to look upon the judgment to come as uncertain, he gains his point by persuading them to look upon it as at a distance. These wretched rulers dare to say, We are as safe in this city as flesh in a boiling pot; the walls of the city shall be to us as walls of brass, we shall receive no more damage from the besiegers than the caldron does from the fire. When sinners flatter themselves to their own ruin, it is time to tell them they shall have no peace if they go on. None shall remain in possession of the city but those who are buried in it. Those are least safe who are most secure. God is often pleased to single out some sinners for warning to others. Whether Pelatiah died at that time in Jerusalem, or when the fulfilment of the prophecy drew near, is uncertain. Like Ezekiel, we ought to be much affected with the sudden death of others, and we should still plead with the Lord to have mercy on those who remain.Barnes' Notes on the BibleAll that shall remain in the city are the buried dead. Bloodshed and murder were at this time rife in Jerusalem, and these were among the chief crimes that were bringing down judgment upon the city. All the inhabitants that should yet survive were destined to be carried away into exile. Jamieson-Fausset-Brown Bible Commentary7. The city is a caldron to them, but it shall not be so to you. Ye shall meet your doom on the frontier.Matthew Poole's Commentary Therefore;  your murders are the cause of my severity, and such sins first or last are surely punished. Your slain: see Ezekiel 11:6. Or, your slain, because when they might and would have saved their life by a seasonable submission, you persuaded them to an obstinate opposition against the Chaldeans to their destruction. Whom ye have laid,  or placed (as the word bears); it is not unlike that they who persuaded all to stay did provide, or at least help, as many as did stay, to habitations, and placed them in houses or lodgings. The flesh;  the pieces which are to be east into the caldron, and here be punished. But I,  that is, the mighty, eternal, and just God, will bring you forth, not in mercy, but in wrath, by the conquering hand of Babylon; I will draw you out to greater torment. Gill's Exposition of the Entire BibleTherefore thus saith the Lord God,.... Applying the parabolical expressions they had derided, and explaining them, in a different sense from what they had put upon them: your slain whom ye have laid in the midst of it, they are the flesh; the prophets they had killed; the persons, who had died innocently for crimes laid to their charge they had not been guilty of; and such who had fallen by one judgment or another since the siege, they were the persons intended by \"the flesh\", and not such as were alive; and therefore could promise themselves nothing from this proverb they had taken up, and scoffed at: and this city is the cauldron; that holds the slain, and in which they will lie and continue, and not the living: but I will bring you forth out of the midst of it: where they promised themselves safety, and a long continuance; yet should not abide, but be carried captive. Geneva Study BibleTherefore thus saith the Lord GOD; Your slain whom ye have laid in the midst of it, they are {c} the flesh, and this city is the caldron: but I will bring you forth out of the midst of it.(c) Contrary to their vain confidence he shows in what sense the city is the caldron: that is, because of the dead bodies that have been murdered in it, and so lit as flesh in the caldron.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "11:1-13 Where Satan cannot persuade men to look upon the judgment to come as uncertain, he gains his point by persuading them to look upon it as at a distance. These wretched rulers dare to say, We are as safe in this city as flesh in a boiling pot; the walls of the city shall be to us as walls of brass, we shall receive no more damage from the besiegers than the caldron does from the fire. When sinners flatter themselves to their own ruin, it is time to tell them they shall have no peace if they go on. None shall remain in possession of the city but those who are buried in it. Those are least safe who are most secure. God is often pleased to single out some sinners for warning to others. Whether Pelatiah died at that time in Jerusalem, or when the fulfilment of the prophecy drew near, is uncertain. Like Ezekiel, we ought to be much affected with the sudden death of others, and we should still plead with the Lord to have mercy on those who remain.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "All that shall remain in the city are the buried dead. Bloodshed and murder were at this time rife in Jerusalem, and these were among the chief crimes that were bringing down judgment upon the city. All the inhabitants that should yet survive were destined to be carried away into exile. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "7. The city is a caldron to them, but it shall not be so to you. Ye shall meet your doom on the frontier.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Therefore; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " your murders are the cause of my severity, and such sins first or last are surely punished. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Your slain:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " see ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Ezekiel 11:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "your slain",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", because when they might and would have saved their life by a seasonable submission, you persuaded them to an obstinate opposition against the Chaldeans to their destruction. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Whom ye have laid, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or placed (as the word bears); it is not unlike that they who persuaded all to stay did provide, or at least help, as many as did stay, to habitations, and placed them in houses or lodgings. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The flesh; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the pieces which are to be east into the caldron, and here be punished. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "But I, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that is, the mighty, eternal, and just God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "will bring you forth",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not in mercy, but in wrath, by the conquering hand of Babylon; I will draw you out to greater torment. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Therefore thus saith the Lord God,.... Applying the parabolical expressions they had derided, and explaining them, in a different sense from what they had put upon them: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "your slain whom ye have laid in the midst of it, they are the flesh; the prophets they had killed; the persons, who had died innocently for crimes laid to their charge they had not been guilty of; and such who had fallen by one judgment or another since the siege, they were the persons intended by \"the flesh\", and not such as were alive; and therefore could promise themselves nothing from this proverb they had taken up, and scoffed at: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and this city is the cauldron; that holds the slain, and in which they will lie and continue, and not the living: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "but I will bring you forth out of the midst of it: where they promised themselves safety, and a long continuance; yet should not abide, but be carried captive. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Therefore thus saith the Lord GOD; Your slain whom ye have laid in the midst of it, they are {c} the flesh, and this city is the caldron: but I will bring you forth out of the midst of it.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(c) Contrary to their vain confidence he shows in what sense the city is the caldron: that is, because of the dead bodies that have been murdered in it, and so lit as flesh in the caldron.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Those slain in the midst of Jerusalem will be the only “flesh” that will remain in the pot. The living conspirators who think they shall be safe shall be dragged forth and judged far away from the protecting city, on the borders of Israel. The figure of the pot and flesh is used differently in ch. 24. (The Heb. is probably to be spelled so as to give the meaning “I will bring you forth.”)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They are the flesh,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. The prophet is led to retort their derisive or defiant words. Not they, but the carcases of their victims, were as the \"flesh\" in the \"caldron.\" For themselves, there was another fate in reserve. Neither to be protected by the caldron nor to meet their doom in it, but to be brought out of it. Death, by famine, sword, or pestilence (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), might be the doom of some, but for others, perhaps specially for those whom the prophet addresses, there would be captivity first, and death from the sword which they feared, afterwards. Ezekiel 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Spirit of Jehovah fell upon me, and said to me: Say, Thus saith Jehovah, So ye say, O house of Israel, and what riseth up in your spirit, that I know. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Ye have increased your slain in this city, and filled its streets with slain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore, thus saith the Lord Jehovah, Your slain, whom ye have laid in the midst of it, they are the flesh, and it is the pot; but men will lead you out of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sword you fear; but the sword shall I bring upon you, is the saying of the Lord Jehovah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". I shall lead you out of it and give you into the hand of foreigners, and shall execute judgments upon you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". By the sword shall ye fall: on the frontier of Israel shall I judge you; and ye shall learn that I am Jehovah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It shall not be as a pot to you, so that you should be flesh therein: on the frontier of Israel shall I judge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And ye shall learn that I am Jehovah, in whose statutes ye have not walked, and my judgments ye have not done, but have acted according to the judgments of the heathen who are round about you. - For תּפּל עלי , compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Instead of the \"hand\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the Spirit of Jehovah is mentioned here; because what follows is simply a divine inspiration, and there is no action connected with it. The words of God are directed against the \"house of Israel,' whose words and thoughts are discerned by God, because the twenty-five men are the leaders and counsellors of the nation. מעלות, thoughts, suggestions of the mind, may be explained from the phrase עלה על לב, to come into the mind. Their actions furnish the proof of the evil suggestions of their heart. They have filled the city with slain; not \"turned the streets of the city into a battle-field,\" however, by bringing about the capture of Jerusalem in the time of Jeconiah, as Hitzig would explain it. The words are to be understood in a much more general sense, as signifying murder, in both the coarser and the more refined signification of the word.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Calvin has given the correct explanation, thus: \"He does not mean that men had been openly assassinated in the streets of Jerusalem; but under this form of speech he embraces all kinds of injustice. For we know that all who oppressed the poor, deprived men of their possessions, or shed innocent blood, were regarded as murderers in the sight of God.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "מלּאתים is a copyist's error for מלּאתם. Those who have been murdered by you are the flesh in the caldron (Ezekiel 11:7). Ezekiel gives them back their own words, as words which contain an undoubted truth, but in a different sense from that in which they have used them. By their bloodshed they have made the city into a pot in which the flesh of the slain is pickled. Only in this sense is Jerusalem a pot for them; not a pot to protect the flesh from burning while cooking, but a pot into which the flesh of the slaughtered is thrown. Yet even in this sense will Jerusalem not serve as a pot to these worthless counsellors (Ezekiel 11:11). They will lead you out of the city (הוציא, in Ezekiel 11:7, is the 3rd pers. sing. with an indefinite subject). The sword which ye fear, and from which this city is to protect you, will come upon you, and cut you down - not in Jerusalem, but on the frontier of Israel. על־גּבוּל, in Ezekiel 11:10, cannot be taken in the sense of \"away over the frontier,\" as Kliefoth proposes; if only because of the synonym אל־גּבוּל in Ezekiel 11:11. This threat was literally fulfilled in the bloody scenes at Riblah (Jeremiah 52:24-27). It is not therefore a vaticinium ex eventu, but contains the general thought, that the wicked who boasted of security in Jerusalem or in the land of Israel as a whole, but were to be led out of the land, and judged outside. This threat intensifies the punishment, as Calvin has already shown.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "מלּאתים is a copyist's error for מלּאתם. Those who have been murdered by you are the flesh in the caldron (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Ezekiel gives them back their own words, as words which contain an undoubted truth, but in a different sense from that in which they have used them. By their bloodshed they have made the city into a pot in which the flesh of the slain is pickled. Only in this sense is Jerusalem a pot for them; not a pot to protect the flesh from burning while cooking, but a pot into which the flesh of the slaughtered is thrown. Yet even in this sense will Jerusalem not serve as a pot to these worthless counsellors (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). They will lead you out of the city (הוציא, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is the 3rd pers. sing. with an indefinite subject). The sword which ye fear, and from which this city is to protect you, will come upon you, and cut you down - not in Jerusalem, but on the frontier of Israel. על־גּבוּל, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cannot be taken in the sense of \"away over the frontier,\" as Kliefoth proposes; if only because of the synonym אל־גּבוּל in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This threat was literally fulfilled in the bloody scenes at Riblah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:24-27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is not therefore a vaticinium ex eventu, but contains the general thought, that the wicked who boasted of security in Jerusalem or in the land of Israel as a whole, but were to be led out of the land, and judged outside. This threat intensifies the punishment, as Calvin has already shown.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"He threatens a double punishment; first, that God will cast them out of Jerusalem, in which they delight, and where they say that they will still make their abode for a long time to come, so that exile may be the first punishment. He then adds, secondly, that He will not be content with exile, but will send a severer punishment, after they have been cast out, and both home and land have spued them out as a stench which they could not bear. I will judge you at the frontier of Israel, i.e., outside the holy land, so that when one curse shall have become manifest in exile, a severer and more formidable punishment shall still await you.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Ezekiel 11:11 the negation (לא) of the first clause is to be supplied in the second, as, for example, in Deuteronomy 33:6. For Ezekiel 11:12, compare the remarks on Ezekiel 5:7. The truth and the power of this word are demonstrated at once by what is related in the following verse. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the negation (לא) of the first clause is to be supplied in the second, as, for example, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", compare the remarks on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The truth and the power of this word are demonstrated at once by what is related in the following verse. ",
            "children": []
          }
        ]
      }
    ]
  }
]