[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall so come in like manner as ye have seen him go into heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—So our Lord, following the great prophecy of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", had spoken of Himself as “coming in the clouds of heaven” (see Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:64",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in visible ‘majesty and glory. Here, again, men have asked questions which they cannot answer; not only, when shall the end be, but where shall the Judge thus appear? what place shall be the chosen scene of His second Advent? So far as we dare to localise what is left undefined, the words of the angels suggest the same scene, as well as the same manner. Those who do not shrink from taking the words of prophecy in their most literal sense, have seen in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", an intimation that the Valley of Jehosophat (= Jehovah judges)—the “valley of decision”—shall witness the great Assize, and that the feet of the Judge shall stand upon the Mount of Olives, from which He had ascended into heaven. This was the current mediæval view, and seems, if we are to localise at all, to be more probable than any other.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Luke",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " - ActsTHE ASCENSIONWAS, IS, IS TO COMELuke 2:16",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " - Acts",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "THE ASCENSION",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "WAS, IS, IS TO COME",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These three fragments, which I have ventured to isolate and bring together, are all found in one author’s writings. Luke’s biography of Jesus stretches from the cradle in Bethlehem to the Ascension from Olivet. He narrates the Ascension twice, because it has two aspects. In one it looks backward, and is necessary as the completion of what was begun in the birth. In one it looks forward, and makes necessary, as its completion, that coming which still lies in the future. These three stand up, like linked summits in a mountain. We can understand none of them unless we embrace them all. If the story of the birth is true, a life so begun cannot end in an undistinguished death like that of all men. And if the Ascension from Olivet is true, that cannot close the history of His relations to men. The creed which proclaims He was ‘born of the Virgin Mary’ must go on to say ‘. . . He ascended up into heaven’; and cannot pause till it adds ‘. . . From thence He shall come to judge the quick and the dead.’ So we have then three points to consider in this sermon.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Note first, the three great moments. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Note first, the three great moments.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The thing that befell at Bethlehem, in the stable of the inn, was a commonplace and insignificant enough event looked at from the outside: the birth of a child to a young mother. It had its elements of pathos in its occurring at a distance from home, among the publicity and discomforts of an inn stable, and with some cloud of suspicion over the mother’s fair fame. But the outside of a fact is the least part of it. A little film of sea-weed floats upon the surface, but there are fathoms of it below the water. Men said, ‘A child is born.’ Angels said, and bowed their faces in adoration, ‘The Word has become flesh’. The eternal, self-communicating personality in the Godhead, passed voluntarily into the condition of humanity. Jesus was born, the Son of God came. Only when we hold fast by that great truth do we pierce to the centre of what was done in that poor stable, and possess the key to all the wonders of His life and death.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " From the manger we pass to the mountain. A life begun by such a birth cannot be ended, as I have said, by a mere ordinary death. The Alpha and the Omega of that alphabet must belong to the same fount of type. A divine conformity forbids that He who was born of the Virgin Mary should have His body laid to rest in an undistinguished grave. And so what Bethlehem began, Olivet carries on.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Note the circumstances of this second of these great moments. The place is significant. Almost within sight of the city, a stone’s throw probably from the home where He had lodged, and where He had conquered death in the person of Lazarus; not far from the turn of the road where the tears had come into His eyes amidst the shouting of the rustic procession, as He had looked across the valley; just above Gethsemane, where He had agonised on that bare hillside to which He had often gone for communion with the Father in heaven. There, in some dimple of the hill, and unseen but by the little group that surrounded Him, He passed from their midst. The manner of the departure is yet more significant than the place. Here were no whirlwind, no chariots and horses of fire, no sudden rapture; but, as the narrative makes emphatic, a slow, leisurely, self-originated floating upwards. He was borne up from them, and no outward vehicle or help was needed; but by His own volition and power He rose towards the heavens. ‘And a cloud received Him out of their sight’-the Shechinah cloud, the bright symbol of the Divine Presence which had shone round the shepherds on the pastures of Bethlehem, and enwrapped Him and the three disciples on the Mount of Transfiguration. It came not to lift Him on its soft folds to the heavens, but in order that, first, He might be plainly seen till the moment that He ceased to be seen, and might not dwindle into a speck by reason of distance; and secondly, that it might teach the truth, that, as His body was received into the cloud, so He entered into the glory which He ‘had with the Father before the world was.’ Such was the second of these moments.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The third great moment corresponds to these, is required by them, and crowns them. The Ascension was not only the close of Christ’s earthly life which would preserve congruity with its beginning, but it was also the clear manifestation that, as He came of His own will, so He departed by His own volition. ‘I came forth from the Father, and am come into the world. Again, I leave the world and go unto the Father.’ Thus the earthly life is, as it were, islanded in a sea of glory, and that which stretches away beyond the last moment of visibility, is like that which stretched away beyond the first moment of corporeity; the eternal union with the eternal Father. But such an entrance on and departure from earth, and such a career on earth, can only end in that coming again of which the angels spoke to the gazing eleven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Mark the emphasis of their words. ‘This same Jesus,’ the same in His manhood, ‘shall so come, in like manner, as ye have seen Him go.’ How much the ‘in like manner’ may mean we can scarcely dogmatically affirm. But this, at least, is clear, that it cannot mean less than corporeally visible, locally surrounded by angel-guards, and perhaps, according to a mysterious prophecy, to the same spot from which He ascended. But, at all events, there are the three moments in the manifestation of the Son of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Look, in the second place, at the threefold phases of our Lord’s activity which are thus suggested. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Look, in the second place, at the threefold phases of our Lord’s activity which are thus suggested.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I need not dwell, in more than a sentence or two, on the first of these. Each of these three moments is the inauguration of a form of activity which lasts till the emergence of the next of the triad.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The birth at Bethlehem had, for its consequence and purpose, a threefold end: the revelation of God in humanity, the manifestation of perfect manhood to men, and the rendering of the great sacrifice for the sins of the world. These three-showing us God; showing ourselves as we are and as we may be; as we ought to be, and, blessed be His name, as we shall be, if we observe the conditions; and the making reconciliation for the sins of the whole world-these are the things for which the Babe lying in the manger was born and came under the limitations of humanity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Turn to the second of the three, and what shall we say of it? That Ascension has for its great purpose the application to men of the results of the Incarnation. He was born that He might show us God and ourselves, and that He might die for us. He ascended up on high in order that the benefits of that Revelation and Atonement might be extended through, and appropriated by, the whole world.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One chief thought which is enforced by the narrative of the Ascension is the permanence, the eternity of the humanity of Jesus Christ. He ascended up where He was before, but He who ascended is not altogether the same as He who had been there before, for He has taken up with Him our nature to the centre of the universe and the throne of God, and there, ‘bone of our bone, and flesh of our flesh,’ a true man in body, soul, and spirit, He lives and reigns. The cradle at Bethlehem assumes even greater solemnity when we think of it as the beginning of a humanity that is never laid aside. So we can look confidently to all that blaze of light where He sits, and feel that, howsoever the body of His humiliation may have been changed into the body of His glory, He still remains corporeally and spiritually a true Son of man. Thus the face that looks down from amidst the blaze, though it be ‘as the sun shineth in his strength,’ is the old face; and the breast which is girded with the golden girdle is the same breast on which the seer had leaned his happy head; and the hand that holds the sceptre is the hand that was pierced with the nails; and the Christ that is ascended up on high is the Christ that loved and pitied adulteresses and publicans, and took the little child in His gracious arms-’The same yesterday, and to-day, and for ever.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ’s Ascension is as the broad seal of heaven attesting the completeness of His work on earth. It inaugurates His repose which is not the sign of His weariness, but of His having finished all which He was born to do. But that repose is not idleness. Rather it is full of activity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " On the Cross He shouted with a great voice ere He died, ‘It is finished.’ But centuries, perhaps millenniums, yet will have to elapse before the choirs of angels shall be able to chant, ‘It is done: the kingdoms of the world are the kingdoms of God and of His Christ.’ All the interval is filled by the working of that ascended Lord whose session at the right hand of God is not only symbolical of perfect repose and a completed sacrifice, but also of perfect activity in and with His servants.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He has gone-to rest, to reign, to work, to intercede, and to prepare a place for us. For if our Brother be indeed at the right hand of God, then our faltering feet may travel to the Throne, and our sinful selves may be at home there. The living Christ, working to-day, is that of which the Ascension from Olivet gives us the guarantee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The third great moment will inaugurate yet another form of activity as necessary and certain as either of the two preceding. For if His cradle was what we believe it to have been, and if His sacrifice was what Scripture tells us it is, and if through all the ages He, crowned and regnant, is working for the diffusion of the powers of His Cross and the benefits of His Incarnation, there can be no end to that course except the one which is expressed for us by the angels’ message to the gazing disciples: He shall so come in like manner as ye have seen Him go. He will come to manifest Himself as the King of the world and its Lord and Redeemer. He will come to inaugurate the great act of Judgment, which His great act of Redemption necessarily draws after it, and Himself be the Arbiter of the fates of men, the determining factor in whose fates has been their relation to Him. No doubt many who never heard His name upon earth will, in that day be, by His clear eye and perfect judgment, discerned to have visited the sick and the imprisoned, and to have done many acts for His sake. And for us who know Him, and have heard His name, the way in which we stand affected in heart and will to Christ reveals and settles our whole character, shapes our whole being, and will determine our whole destiny. He comes, not only to manifest Himself so as that ‘every eye shall see Him,’ and to divide the sheep from the goats, but also in order that He may reign for ever and gather into the fellowship of His love and the community of His joys all who love and trust Him here. These are the triple phases of our Lord’s activity suggested by the three great moments.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, notice the triple attitude which we should assume to Him and to them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Lastly, notice the triple attitude which we should assume to Him and to them.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "For the first, the cradle, with its consequence of the Cross, our response is clinging faith, grateful memory, earnest following, and close conformity. For the second, the Ascension, with its consequence of a Christ that lives and labours for us, and is with us, our attitude ought to be an intense realisation of the fact of His present working and of His present abode with us. The centre of Christian doctrine has, amongst average Christians, been far too exclusively fixed within the limits of the earthly life, and in the interests of a true and comprehensive grasp of all the blessedness that Christianity is capable of bringing to men, I would protest against that type of thought, earnest and true as it may be within its narrow limits, which is always pointing men to the past fact of a Cross, and slurs over and obscures the present fact of a living Christ who is with us, and in us. One difference between Him and all other benefactors and teachers and helpers is this, that, as ages go on, thicker and ever-thickening folds of misty oblivion wrap them, and their influence diminishes as new circumstances emerge, but this Christ’s power laughs at the centuries, and is untinged by oblivion, and is never out of date. For all others we have to say-’having served his generation,’ or a generation or two more, ‘according to the will of God, he fell on sleep.’ But Christ knows no corruption, and is for ever more the Leader, and the Companion, and the Friend, of each new age.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren! the Cross is incomplete without the throne. We are told to go back to the historical Christ. Yes, Amen, I say! But do not let that make us lose our grasp of the living Christ who is with us to-day. Whilst we rejoice over the ‘Christ that died,’ let us go on with Paul to say, ‘Yea! rather, that is risen again, and is even at the right hand of God, who also maketh intercession for us.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For that future, discredited as the thought of the second corporeal coming of the Lord Jesus in visible fashion and to a locality has been by the fancies and the vagaries of so-called Apocalyptic expositors, let us not forget that it is the hope of Christ’s Church, and that ‘they who love His appearing’ is, by the Apostle, used as the description and definition of the Christian character. We have to look forwards as well as backwards and upwards, and to rejoice in the sure and certain confidence that the Christ who has come is the Christ who will come.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For us the past should be full of Him, and memory and faith should cling to His Incarnation and His Cross. The present should be full of Him, and our hearts should commune with Him amidst the toils of earth. The future should be full of Him, and our hopes should be based upon no vague anticipations of a perfectibility of humanity, nor upon any dim dreams of what may lie beyond the grave; but upon the concrete fact that Jesus Christ has risen, and that Jesus Christ is glorified. Does my faith grasp the Christ that was-who died for me? Does my heart cling to the Christ who is-who lives and reigns, and with whom my life is hid in God? Do my hopes crystallise round, and anchor upon, the Christ that is to come, and pierce the dimness of the future and the gloom of the grave, looking onwards to that day of days when He, who is our life, shall appear, and we shall appear also with Him in glory?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:6-11 They were earnest in asking about that which their Master never had directed or encouraged them to seek. Our Lord knew that his ascension and the teaching of the Holy Spirit would soon end these expectations, and therefore only gave them a rebuke; but it is a caution to his church in all ages, to take heed of a desire of forbidden knowledge. He had given his disciples instructions for the discharge of their duty, both before his death and since his resurrection, and this knowledge is enough for a Christian. It is enough that He has engaged to give believers strength equal to their trials and services; that under the influence of the Holy Spirit they may, in one way or other, be witnesses for Christ on earth, while in heaven he manages their concerns with perfect wisdom, truth, and love. When we stand gazing and trifling, the thoughts of our Master's second coming should quicken and awaken us: when we stand gazing and trembling, they should comfort and encourage us. May our expectation of it be stedfast and joyful, giving diligence to be found of him blameless.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye men of Galilee - Galilee was the place of their former residence, and they were commonly known by the name of Galileans.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Why stand ye ... - There is doubtless a slight degree of censure implied in this, as well as a design to call their attention away from a vain attempt to see the departed Saviour. The impropriety may have been:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) In the feeling of disappointment, as if he would not restore the kingdom to Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) Possibly they were expecting that he would again soon appear, though he had often foretold them that he would ascend to heaven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) there might have been an impropriety in their earnest desire for the mere bodily presence of the Lord Jesus, when it was more important that he should be in heaven. We may see here also that it is our duty not to stand in idleness, and to gaze even toward heaven. We, as well as the apostles, have a great work to do, and we should actively engage in it without delay.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Gazing up - Looking up.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This same Jesus - This was said to comfort them. The same tried friend who had been so faithful to them would return. They ought not, therefore, to look with despondency at his departure.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Into heaven - This expression denotes into the immediate presence of God; or into the place of perpetual purity and happiness, where God especially manifests his favor. The same thing is frequently designated by his sitting on the right hand of God, as emblematic of power, honor, and favor. See the Mark 16:19; Mark 14:62 notes; Hebrews 1:3; Hebrews 8:1 notes; Acts 7:55 note; Romans 8:34 note; Ephesians 1:20 note.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Into heaven - This expression denotes into the immediate presence of God; or into the place of perpetual purity and happiness, where God especially manifests his favor. The same thing is frequently designated by his sitting on the right hand of God, as emblematic of power, honor, and favor. See the ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 16:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:62",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " notes; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " notes; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:55",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall so come - At the day of judgment. John 14:3, \"if I go and prepare a place for you, I will come again,\" etc.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall so come - At the day of judgment. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 14:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"if I go and prepare a place for you, I will come again,\" etc.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In like manner ... - In clouds, as he ascended. See the Acts 1:9 note; 1 Thessalonians 4:16 note. This address was designed to comfort the disciples. Though their master and friend was taken from them, yet he was not removed forever. He would come again with similar majesty and glory to vindicate his people, and to tread his enemies under his feet. The design for which he will come will be to judge the world, Matthew 25. There will be an evident fitness and propriety in his coming for such reasons as the following:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In like manner ... - In clouds, as he ascended. See the ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Thessalonians 4:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note. This address was designed to comfort the disciples. Though their master and friend was taken from them, yet he was not removed forever. He would come again with similar majesty and glory to vindicate his people, and to tread his enemies under his feet. The design for which he will come will be to judge the world, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There will be an evident fitness and propriety in his coming for such reasons as the following:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Because his appropriate work in heaven as mediator will have been accomplished; his people will have been saved; the great enemy of God and man will have been subdued; death will have been conquered; and the gospel will have shown its power in subduing all forms of wickedness; in removing the effects of sin; in establishing the Law, and in vindicating the honor of God; and all will have been done that is necessary to establish the authority of God throughout the universe. It will be proper, therefore, that this mysterious order of things shall be wound up, and the results become a matter of record in the history of the universe. This will be better than it would be to suffer an eternal millennium on the earth, while the saints should many of them slumber, and the wicked still be in their graves.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) it is proper that he should come to vindicate his people, and raise them up to glory. Here they have been persecuted, oppressed, put to death. Their character is assailed; they are poor; and the world despises them. It is fit that God should show himself to be their friend; that he should do justice to their injured names and motives; that he should bring out hidden and obscure virtue, and vindicate it; that he should enter every grave and bring forth his friends to life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) it is proper that he should show his hatred of sin. Here it triumphs. The wicked are rich, and honored, and mighty, and say, Where is the promise of his coming? 2 Peter 3:4. It is right that he should defend his cause. Hence, the Lord Jesus will come to guard the avenues to heaven, and to see that the universe suffers no wrong by the admission of an improper person to the skies.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) it is proper that he should show his hatred of sin. Here it triumphs. The wicked are rich, and honored, and mighty, and say, Where is the promise of his coming? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Peter 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is right that he should defend his cause. Hence, the Lord Jesus will come to guard the avenues to heaven, and to see that the universe suffers no wrong by the admission of an improper person to the skies.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) the great transactions of redemption have been public, open, often grand. The apostasy was public, in the face of angels and of the universe. Sin has been open, public high-handed. Misery has been public, and has rolled its deep and turbid waves in the face of the universe. Death has been public; all worlds have seen the race cut down and moulder. The death of Jesus was public: the angels saw it; the heavens were clothed with mourning; the earth shook, and the dead arose. Jesus was publicly whipped, cursed, crucified; and it is proper that he should publicly triumph - that all heaven rejoicing, and all hell at length humbled, should see his public victory. Hence, he will come with clouds - with angels - with fire - and will raise the dead, and exhibit to all the universe the amazing close of the scheme of redemption.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. Ye men of Galilee, why stand ye gazing up into heaven, &c.—\"as if your now glorified Head were gone from you never to return: He is coming again; not another, but 'this same Jesus'; and 'as ye have seen Him go, in the like manner shall He come'—as personally, as visibly, as gloriously; and let the joyful expectation of this coming swallow up the sorrow of that departure.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which also said; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the two angels (in the form of men) before mentioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye men of Galilee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, the apostles, who were of that country. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Why stand ye gazing up into heaven?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They are roused out of the ecstasy they were in at that glorious sight, to learn what was so much to their and our advantage. Shall so come: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Visibly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. In a cloud. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. By his own power. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. With the like majesty. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "5. With the same soul and body. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Which also said, ye men of Galilee,.... And which was said by them, not to reproach them with their country, but partly to let them know that they knew them, who they were, and from whence they came; and partly to observe the rich and distinguishing grace of God in choosing such mean and contemptible persons to be the apostles of Christ, and eyewitnesses of his majesty: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "why stand ye gazing up into heaven? reproving them for their curiosity in looking after Christ with their bodily eyes, who was no more in common to be seen this way, but with an eye of faith; and for their desire after his corporeal presence, which they were not to look for; and as if they expected he would return again immediately, whereas his return will not be till the end of the world: and besides, they were not to remain on that spot, or stand gazing there; they were to go to Jerusalem, and abide there, as Christ had ordered, till they should receive the Holy Spirit in an extraordinary way; and then they were to preach a crucified Christ, and declare that he was risen from the dead, and was gone to heaven, and was ordained to be the Judge of quick and dead, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This same Jesus; and not another; the same in person, in body and soul: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which is taken up from you into heaven; who was taken up in a cloud out of their sight, and received into heaven, where he will be till the times of the restitution of all things; and which might be matter of grief to them, because of the loss of his bodily presence; though it should have been rather joyful to them, since he was gone to the Father, and as their forerunner, to prepare a place, and make intercession for them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall so come in like manner as ye have seen him go into heaven; he shall come in the same flesh, in the same human nature; he shall come in the clouds of heaven, and shall be attended with his mighty angels, as he now was; he shall descend himself in person, as he now ascended in person; and as he went up with a shout, and with the sound of a trumpet, see Psalm 47:5 so he shall descend with a shout, with the voice of the archangel, and the trump of God; and, it may be, he shall descend upon the very spot from whence he ascended; see Zechariah 14:4 and it is a notion of the Jews, that the resurrection of the Israelites will be there: they say (m), that \"when the dead shall live, the Mount of Olives shall be cleaved asunder, and all the dead of Israel shall come out from under it; yea, even the righteous which die in captivity shall pass through a subterranean cavern, and come out from under the Mount of Olives. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "shall so come in like manner as ye have seen him go into heaven; he shall come in the same flesh, in the same human nature; he shall come in the clouds of heaven, and shall be attended with his mighty angels, as he now was; he shall descend himself in person, as he now ascended in person; and as he went up with a shout, and with the sound of a trumpet, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 47:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " so he shall descend with a shout, with the voice of the archangel, and the trump of God; and, it may be, he shall descend upon the very spot from whence he ascended; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and it is a notion of the Jews, that the resurrection of the Israelites will be there: they say (m), that \"when the dead shall live, the Mount of Olives shall be cleaved asunder, and all the dead of Israel shall come out from under it; yea, even the righteous which die in captivity shall pass through a subterranean cavern, and come out from under the Mount of Olives. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Targum in Cant. viii. 5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Targum in Cant. viii. 5. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Which also said, Ye men of Galilee, why stand ye gazing up into heaven? this same Jesus, which is taken up {g} from you into heaven, shall so come in like manner as ye have seen him go into heaven.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which also said, Ye men of Galilee, why stand ye gazing up into heaven? this same Jesus, which is taken up ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from you into heaven, shall so come in like manner as ye have seen him go into heaven.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) That is, out of your sight.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄνδρες Γαλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄνδρες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in similar expressions is often indicative of respect as in classical Greek, but as addressed by angels to men it may denote the earnestness of the address (Nösgen). St. Chrysostom saw in the salutation a wish to gain the confidence of the disciples: “Else, why needed they to be told of their country who knew it well enough?” Calvin also rejects the notion that the angels meant to blame the slowness and dulness of apprehension of Galilæans. At the same time the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Γαλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". seems to remind us that things which are despised (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") hath God chosen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ex Galilæa nunquam vel certe raro fuerat propheta; at omnes Apostoli",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Bengel); see also below.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὗτος ὁ Ἰησοῦς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": if the mention of their northern home had reminded the disciples of their early choice by Christ and of all that He had been to them, the personal name Jesus would assure them that their master would still be a human Friend and divine Saviour; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hic Jesus: qui vobis fuit eritque semper Jesus, id est, Salvator",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Corn. à Lap.).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πορευόμενον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": on the frequency of the verb in St. Luke as compared with other N.T. writers, often used to give effect and vividness to the scene, both Friedrich and Zeller remark; St. Peter uses the same word of our Lord’s Ascension, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 3:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As at the Birth of Christ, so too at His Ascension the angels’ message was received obediently and joyfully, for only thus can we explain ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ye men of Galilee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Galilæan dialect was a marked peculiarity of the apostolic band. It seems also to have been our Lord’s manner of speech. For when Peter is accused (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:73",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of being one of Christ’s followers the words of the accusation are “Surely thou art one of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for thy speech bewrayeth thee.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall so come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This promise of the return of Jesus, on the immediate expectation of which so many of the first Christians fixed their thoughts, explains those words in the abridged account of the Ascension in St Luke’s Gospel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), “They returned to Jerusalem with great joy.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Γαλιλαῖοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye men of Galilee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") In apparitions which are vouchsafed to individuals, the angels employed the proper name: instead of which in this place the name of their country is employed, under which they all are included. Out of Galilee seldom, if ever, a prophet had arisen; hut all the apostles had come out of it.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "why?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A similar ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Why",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " occurs in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐμβλέποντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gazing earnestly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with a lingering look up into heaven, which now it serves no purpose to look at, since Jesus is no longer to he seen.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὕτως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅν τρόπον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so, in like manner as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A similar phrase occurs, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 27:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even as it was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " told me:” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐλεύσεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It is the Ascension of Christ, rather than His Advent to judgment, which is described in Scripture as His ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "return",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He is said ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not only because He had not previously come to judge, but because His Adwent in glory shall be much more remarkable than His first Advent. The world had not believed that the Son of GOD had ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": in respect to believers He is said to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "return",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "come again",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "return",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and receive you to Myself.” Then He shall be revealed in His own day. The verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cometh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " already was employed in the prophecy of Enoch, Jude ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He shall come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in a visible manner, in a cloud, with a trumpet, with an attendant train, and perhaps in the same place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “the mount called Olivet.” Add ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “His feet shall stand in that day upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Mount of Olives",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is before Jerusalem on the east.” Comp. the annot. of Michaëlis, and the note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “As the lightning cometh ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of the East",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so shall the coming of the Son of man be” [It is probable that Christ’s coming will be from the East]. Not those who saw Him ascending are said to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "about to see",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him when He shall come. Between His Ascension and His Coming in glory no event intervenes equal in importance to each of these two events: therefore these two are joined together. Naturally therefore the apostles, before the giving of the Apocalypse, set before them the day of Christ as very near. And it accords with the majesty of Christ, that during the whole period between His Ascension and His Advent, He should without intermission be expected.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- Looking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gazing up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "this same",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "was received",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "taken",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "beheld",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "him going",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "have seen him go",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In like manner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in a cloud. The description of our Lord's second advent constantly makes mention of clouds. \"Behold, he cometh with clouds\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"One like the Son of man came with the clouds of heaven\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and so ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:64",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 21:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). We are reminded of the grand imagery of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Who maketh the clouds his chariot, who walketh upon the wings of the wind.\" It may be remarked that the above is by far the fullest account we have of the ascension of our Lord. St. Luke appears to have learnt some further particulars concerning it in the interval between writing his Gospel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:50-52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and writing the Acts. But allusions to the Ascension are frequent (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:62",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 20:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 4:8, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Philippians 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 3:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). With reference to Zeller's assertion, that in St. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Luke's",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Gospel the Ascension is represented as taking place on the day of the Resurrection, it may freely be admitted that the narrative in the Gospel does not mark distinctly the interval of time between the different appearances and discourses of our Lord from the day of the Resurrection to that of the Ascension. It seems to group them according to their logical connection rather than according to their chronological sequence, and to be a general account of what Jesus said between the Resurrection and the Ascension. But there is nothing whatever in the text of St. Luke to indicate that what is related in the section Luke 24:44-49 took place at the same time as the things related in the preceding verses. And when we compare with that section what is contained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:4, 5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it becomes clear that it did not. Because the words \"assembling together with them,\" in ver. 4, clearly indicate a different occasion from the apparitions on the day of the Resurrection; and as the words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:44-49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " correspond with those in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:4, 5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it must have been also on a different occasion that they were spoken. Again, the narrative of St. John, both in the twentieth and the twenty-first chapters, as well as that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:10, 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", precludes the possibility of the Ascension having taken place, or having been thought to have taken place, on the day of the Resurrection, or for many days after, so that to force a meaning upon the last chapter of St. Luke's Gospel which it does not necessarily bear, and which places it at variance with St. Luke's own account in the Acts (Acts 1:3; 13:31), and with the Church traditions as preserved by St. Matthew, St. Mark and St. John, is a violent and willful transaction. Acts 1:11",
        "children": []
      }
    ]
  }
]