[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He was taken up; and a cloud received him . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is remarkable how little stress is laid in the Gospels on the fact which has always been so prominent in the creeds of Christendom. Neither St. John nor St. Matthew record it. It is barely mentioned with utmost brevity in the verses which close the Gospel of St. Mark, and in which many critics see, indeed, a fragment of apostolic teaching, but not part of the original Gospel. The reasons of this silence are, however, not far to seek. It was because the Ascension was from the first part of the creed of Christendom that the Evangelists said so little. The fact had been taught to every catechumen. They would not embellish it—as, for example, the Assumption of the Virgin was embellished in later legends—by fantastic details. That it was so received is clear. It is implied in our Lord’s language, as recorded by St. John, “What and if ye shall see the Son of Man ascend up where He was before?” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:62",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and such words would hardly have been brought before believers at the close of the apostolic age if they had received no fulfilment. It is assumed in the earliest form of the Church’s creed, “He was received up into glory,” the verb being identical with that which St. Luke employs in St. Peter’s speeches (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 2:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 3:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and in St. Paul’s epistles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Timothy 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). We may add that there was something like a moral necessity, assuming the Resurrection as a fact, for such a conclusion to our Lord’s work on earth. Two other alternatives may, perhaps, be just imagined as possible: He might, like Lazarus, have lived out His restored life to its appointed term, and then died the common death of all men; but in that case where would have been the victory over death, and the witness that He was the Son of Man? He might have lived on an endless life on earth; but in this case, being such as He was, conflict, persecution, and suffering would have come again and again at every stage, and in each instance a miracle would have been needed to save the suffering from passing on to death, or many deaths must have been followed by many resurrections. When we seek, however, to realise the process of the Ascension, we find ourselves in a region of thought in which it is not easy to move freely. With our thoughts of the relations of the earth to space and the surrounding orbs, we find it hard to follow that upward motion, and to ask what was its direction and where it terminated. We cannot get beyond the cloud; but that cloud was the token of the glory of the Eternal Presence, as the Shechinah that of old filled the Temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 8:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 6:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and it is enough for us to know that where God is there also is Christ, in the glory of the Father, retaining still, though under new conditions and laws, the human nature which made Him like unto His brethren.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 1:9-11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:9-11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when he had spoken these things ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Had given them these instructions; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "while they beheld ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— And had their eyes fixed upon him, with great earnestness and high expectation of some extraordinary event, consequent on this solemn preparation, and while they were receiving his blessing, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he was taken up ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Was lifted up from the ground, in a miraculous manner, gradually rising higher and higher, till at length ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a cloud ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Conducted probably by the ministry of angels; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "received",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him out of their sight ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, covered him about, and carried him into heaven; not in a sudden, but leisurely manner, that they might behold him departing, and see the proof of his having come down from heaven. He did not grant his disciples the privilege of seeing him come out of the grave, because they might see him after he was risen, which would be a satisfaction sufficient; but as they could not see him in heaven while they continued on earth, he granted them the favour of seeing him go up toward heaven, and of having their eyes fixed upon him with so much care and intention of mind, that they could not be deceived. Observe, reader, our Lord ascended into heaven from the mount of Olives, at or near the place where he had been apprehended and bound, and from whence he had been led away like a felon to be tried for his life, insulted, scourged, and condemned to crucifixion! He now goes off in triumph from the same mountain, into a place and state worthy of his innocence and dignity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And while they looked steadfastly toward heaven ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, continued with their eyes fixed the way that he was gone; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as he went up ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In his triumphant ascent; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "behold two men ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Two angels in the form of men; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stood by them ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Unexpectedly. Though they had assumed the form and garb of men, they were, by the majesty and splendour of their appearance, known of the apostles to be angels. And, indeed, as his resurrection had been honoured with the appearance of angels, it was natural to think that his ascension into heaven would be so likewise; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in white apparel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Emblematical of their holiness and happiness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which also said, Ye men of Galilee ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— So they call them, to put them in mind of the meanness of their original condition: Christ had put a great honour upon them, in making them his ambassadors; but they must remember they are men of Galilee, illiterate and despised by the wise and learned of the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Why stand ye here, gazing up into heaven ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— With so much surprise and amazement? it seems, they looked up steadfastly after he was gone out of sight, expecting, perhaps, to see him come down again immediately. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This same Jesus, which is taken up into heaven ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who is gone to that world from whence he came, and in which he is to make his final abode; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall so come as you have seen him go into heaven ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He shall come ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in like manner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, visible, in a cloud, in his own person, with the same body, and with such majesty and glory as you have now seen him ascend with. “The angels spake of his coming to judge the world at the last day, a description of which Jesus had given in his lifetime, saying, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Son of man shall come in the glory of his Father, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. We may therefore infer that the cloud whereon he now ascended, being like that in which he is to come again, was more bright and pure than the clearest lambent flame; for it was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the glory of the Father, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the shechinah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or visible symbol of the divine presence, which appeared to the patriarchs in ancient times; which filled the temple at its dedication, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 7:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and which, in its greatest splendour, cannot be beheld with mortal eyes, and so, for that reason, is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the light inaccessible, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in which God dwells, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was on this occasion, probably, that our Lord’s body was changed, acquiring the glories of immortality, perhaps, in the view of his disciples; for flesh and blood, such as he rose with, cannot inherit the kingdom of God. Accordingly, the body which he now has is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a glorious body, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and declared to be of the same nature with that which the saints shall have after their resurrection, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Php 3:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Wherefore, though the Scripture is silent as to the time when this change passed upon Christ’s body, we must suppose that it happened either immediately before his ascension, or in the time of it, or soon after it. As he ascended up into the skies, the flaming cloud which surrounded him, leaving a tract of light behind it, marked his passage through the air, but gradually lost its magnitude in the eyes of them who stood below, till, soaring high, he and it vanished out of their sight.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“In this illustrious manner did the Saviour depart, after having finished the grand work which he came down upon earth to execute; a work which God himself, in the remotest eternity, contemplated with pleasure; which angels anciently with joy described as to happen; and which, through all eternity to come, shall, at periods the most immensely distant from the time of its execution, be looked back upon with inexpressible delight by every inhabitant of heaven. For though the little affairs of time may vanish altogether and be lost, when they are removed far back by the endless progression of duration, this object is such, that no distance, however great, can lessen it. The kingdom of God is erected upon the incarnation and sufferings of the Son of God, the kingdom and city of God comprehending all the virtuous beings that are in the universe, made happy by goodness and love; and therefore none of them can ever forget the foundation on which their happiness stands firmly established. In particular, the human species, recovered by this labour of the Son of God, will view their deliverer, and look back on his stupendous undertaking with high ravishment, while they are feasting without interruption on its sweet fruits, ever growing more delicious. The rest of the members likewise of the city of God will contemplate it with perpetual pleasure, as the happy means of recovering their kindred that were lost; and, it may be, as the grand confirmation of the whole rational system, in their subjection to him who liveth and reigneth for ever, and whose favour is better than life.” — Macknight.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:6-11 They were earnest in asking about that which their Master never had directed or encouraged them to seek. Our Lord knew that his ascension and the teaching of the Holy Spirit would soon end these expectations, and therefore only gave them a rebuke; but it is a caution to his church in all ages, to take heed of a desire of forbidden knowledge. He had given his disciples instructions for the discharge of their duty, both before his death and since his resurrection, and this knowledge is enough for a Christian. It is enough that He has engaged to give believers strength equal to their trials and services; that under the influence of the Holy Spirit they may, in one way or other, be witnesses for Christ on earth, while in heaven he manages their concerns with perfect wisdom, truth, and love. When we stand gazing and trifling, the thoughts of our Master's second coming should quicken and awaken us: when we stand gazing and trembling, they should comfort and encourage us. May our expectation of it be stedfast and joyful, giving diligence to be found of him blameless.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "While they beheld - While they saw him. It was of importance to state that circumstance, and to state it distinctly. It is not affirmed in the New Testament that they \"saw him rise\" from the dead, because the evidence of that fact could be better established by their seeing him after he was risen. But the truth of his \"ascension to heaven\" could not be confirmed in that manner. Hence, it was so arranged that he should ascend in open day, and in the presence of his apostles; and that not when they were asleep, or were inattentive to what was occurring, but when they were engaged in a conversation that' would fix the attention, and even when they were looking upon him. Had Jesus vanished secretly, or had he disappeared in the night, the apostles would have been amazed and confounded; perhaps they would even have doubted whether they had not been deceived. But when they saw him leave them in this manner, they could not doubt that he had ascended to heaven, and that God approved his work, and would carry it forward. This event was exceedingly important:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) It was a confirmation of the truth of the Christian religion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) it enabled the apostles to state distinctly where the Lord Jesus was, and at once directed their affections and their thoughts away from the earth, and opened their eyes on the glory of the scheme of religion they were to establish. If their Saviour was in heaven, it settled the question about the nature of his kingdom. It was clear that it was not designed to be a temporal kingdom. The reasons why it was proper that the Lord Jesus should ascend to heaven rather than remain on earth were:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That he had \"finished\" the work which God gave him to do \"on the earth\" John 17:4; John 19:30, and it was proper that he should be received back to the glory which he had with the Father before the world was, John 17:4-5; Philippians 2:6, Philippians 2:9-10.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) That he had \"finished\" the work which God gave him to do \"on the earth\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 17:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 19:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and it was proper that he should be received back to the glory which he had with the Father before the world was, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 17:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) it was proper that he should ascend in order that the Holy Spirit might come down and perform his part of the work of redemption. Jesus, by his personal ministry, as a man, could be but in one place; the Holy Spirit could be in all places, and could apply the work to all people. See note on John 16:7.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) it was proper that he should ascend in order that the Holy Spirit might come down and perform his part of the work of redemption. Jesus, by his personal ministry, as a man, could be but in one place; the Holy Spirit could be in all places, and could apply the work to all people. See note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 16:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) a part of the work of Christ was yet to be performed in heaven. That was the work of intercession. The high priest of the Jews not only made an atonement, but also presented the blood of sacrifice before the mercy-seat, as the priest of the people, Leviticus 16:11-14. This was done to typify the entrance of the great high priest of our profession into the heavens, Hebrews 9:7-8, Hebrews 9:11-12. The work which he performs there is the work of intercession, Hebrews 7:25. This is properly the work which an advocate performs in a court for his client. As applicable to Christ, the meaning is, that he, as our great high priest, still manages our cause in heaven; secures our interests; obtains for us grace and mercy. His work, in this respect, consists in his appearing in the presence of God for us Hebrews 9:24; in his presenting the merits of his blood Hebrews 9:12, Hebrews 9:14; and in securing the continuance of the mercy which has been bestowed on us, and which is still needful for our welfare. The Lord Jesus also ascended that he might assume and exercise the office of King in the immediate seat of power. All worlds were made subject to him for the welfare of the church; and it was needful that he should be solemnly invested with that power in the presence of God as the reward of his earthly toils. 1 Corinthians 15:25, \"he must reign until he hath put all enemies under his feet.\" Compare Ephesians 1:20-22; Philippians 2:6-11.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) a part of the work of Christ was yet to be performed in heaven. That was the work of intercession. The high priest of the Jews not only made an atonement, but also presented the blood of sacrifice before the mercy-seat, as the priest of the people, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:11-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This was done to typify the entrance of the great high priest of our profession into the heavens, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The work which he performs there is the work of intercession, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This is properly the work which an advocate performs in a court for his client. As applicable to Christ, the meaning is, that he, as our great high priest, still manages our cause in heaven; secures our interests; obtains for us grace and mercy. His work, in this respect, consists in his appearing in the presence of God for us ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; in his presenting the merits of his blood ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in securing the continuance of the mercy which has been bestowed on us, and which is still needful for our welfare. The Lord Jesus also ascended that he might assume and exercise the office of King in the immediate seat of power. All worlds were made subject to him for the welfare of the church; and it was needful that he should be solemnly invested with that power in the presence of God as the reward of his earthly toils. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"he must reign until he hath put all enemies under his feet.\" Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 1:20-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:6-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A cloud received him - He entered into the region of the clouds, and was hid from their view. But two others of our race have been taken bodily from earth to heaven. Enoch was transported (Genesis 5:24; compare Hebrews 11:5); and Elijah was taken up by a whirlwind, 2 Kings 2:11. It is remarkable that when the return of the Saviour is mentioned, it is uniformly said that he will return in the clouds, Acts 1:11; Matthew 24:30; Matthew 26:64; Mark 13:26; Revelation 1:7; Daniel 7:13. The clouds are an emblem of sublimity and grandeur, and perhaps this is all that is intended by these expressions, Deuteronomy 4:11; 2 Samuel 22:12; Psalm 97:2; Psalm 104:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A cloud received him - He entered into the region of the clouds, and was hid from their view. But two others of our race have been taken bodily from earth to heaven. Enoch was transported (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and Elijah was taken up by a whirlwind, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is remarkable that when the return of the Saviour is mentioned, it is uniformly said that he will return in the clouds, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:64",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 13:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The clouds are an emblem of sublimity and grandeur, and perhaps this is all that is intended by these expressions, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 97:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9-11. while they beheld, he was taken up—See on [1932]Lu 24:50-53. Lest it should be thought He had disappeared when they were looking in some other direction, and so was only concluded to have gone up to heaven, it is here expressly said that \"while they were looking He was taken up, and a cloud received Him out of their sight.\" So Elijah, \"If thou see me when I am taken from thee\" (2Ki 2:10); \"And Elisha saw it\" (Ac 1:12). (See on [1933]Lu 9:32.)",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "9 Mr 16:19 Luke 24:51",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "9 Mr 16:19 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". As he did not actually give up his life till all was fulfilled, so he did not leave the world till all was revealed by him that was necessary for us. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "While they beheld; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they might be eye witnesses, and most unexceptionable. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He was taken up; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not by an external help of angels, but by his own power, and the agility of his now glorious body. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And a cloud received him out of their sight:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this, though a true cloud, yet was a more than ordinarily glorious one, suitable to the majesty of him that used it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he had spoken these things,.... That the times and seasons were not to be known by them, but to be kept a secret by the Father: that they should tarry at Jerusalem, and in a few days be baptized with the Holy Ghost, and receive such power, abilities, strength, and courage thereby, as to bear a noble testimony for Christ, not only there, but in all the world; and when he had given them a fresh commission, and told them where they should go, what they should preach, and what miracles they should perform, and blessed them, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "While they be held; all the Oriental versions, add, \"him\"; that is Christ, while they looked wistly at him, being attentive to what he said to them, so that they were not asleep; nor did Christ become invisible to them, or disappear before his ascension, but was visible to them in it; hence they were eyewitnesses of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he was taken up. Luke in his Gospel says, \"carried up\": very likely by angels, since these not only attended him in his ascension, but are the chariots of the Lord, in which he went up to heaven; see Psalm 68:17 nor is this at all inconsistent with his proper deity, or that divine power he had of elevating himself, which he could do without the assistance of others; but this makes for the glory of his majesty, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he was taken up. Luke in his Gospel says, \"carried up\": very likely by angels, since these not only attended him in his ascension, but are the chariots of the Lord, in which he went up to heaven; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " nor is this at all inconsistent with his proper deity, or that divine power he had of elevating himself, which he could do without the assistance of others; but this makes for the glory of his majesty, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And a cloud received him out of their sight; which was done partly for the same purpose, to add to the grandeur and magnificence of Christ's ascension; and partly to check the curiosity of the disciples, and prevent their gazing any more at him: and it may be that this, cloud was no other than a number of angels that appeared in this form; just as Elijah was taken up to heaven by angels, who appeared in the form of horses and chariots of fire; and the rather this may be the sense here, since it is certain, that there was a large number of angels which attended Christ at his ascension; and by whom he was then seen, Psalm 68:17 whereas, if these are not intended by the cloud, no more than two are here taken notice of, and these not as going along with Christ, but staying behind to converse with his disciples; to which may be added, that Christ was \"received\" by this cloud which descended to meet him, and joining him, escorted him to heaven: at least it may be thought, if it was a real cloud, that there was a multitude of angels in it, which accompanied him to the heavenly regions; for it can hardly be thought that a multitude of the heavenly host should descend at his birth, and sing glory to God upon his coming into this world; and not as large a number attend him with shouts and acclamations, at his going out of it, when he had done his work he came about, and was ascending to his God and Father, to take his place at his right hand on his throne; see Psalm 47:5. The Ethiopic version adds, \"and he ascended to heaven\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And a cloud received him out of their sight; which was done partly for the same purpose, to add to the grandeur and magnificence of Christ's ascension; and partly to check the curiosity of the disciples, and prevent their gazing any more at him: and it may be that this, cloud was no other than a number of angels that appeared in this form; just as Elijah was taken up to heaven by angels, who appeared in the form of horses and chariots of fire; and the rather this may be the sense here, since it is certain, that there was a large number of angels which attended Christ at his ascension; and by whom he was then seen, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " whereas, if these are not intended by the cloud, no more than two are here taken notice of, and these not as going along with Christ, but staying behind to converse with his disciples; to which may be added, that Christ was \"received\" by this cloud which descended to meet him, and joining him, escorted him to heaven: at least it may be thought, if it was a real cloud, that there was a multitude of angels in it, which accompanied him to the heavenly regions; for it can hardly be thought that a multitude of the heavenly host should descend at his birth, and sing glory to God upon his coming into this world; and not as large a number attend him with shouts and acclamations, at his going out of it, when he had done his work he came about, and was ascending to his God and Father, to take his place at his right hand on his throne; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 47:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Ethiopic version adds, \"and he ascended to heaven\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{4} And when he had spoken these things, while they beheld, he was taken up; and a cloud received him out of their sight.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{4}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And when he had spoken these things, while they beheld, he was taken up; and a cloud received him out of their sight.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) After Christ had promised the full power of the Holy Spirit, with whom he would govern his church (even though he would be absent in body), he took up his body from us into heavenly tabernacles to remain there until the latter day of judgment, as the angels witness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καὶ νεφέλη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "annexes what occurred after the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπήρθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He was taken up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on high, not yet immediately into heaven). The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cloud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which received Him (into itself) from before their eyes, is the visible manifestation of the presence of God, who takes to Himself His Son into the glory of heaven. Comp. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Chrysostom calls ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " cloud ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸ ὄχημα τὸ βασιλικόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Concerning ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the ascension",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " itself, which was certainly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bodily",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the occurrence of which has clothed itself with Luke in the traditionary form of an external visible event (according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:64",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), see remark subjoined to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The representation of the scene betrays a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "more developed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " tradition than in the Gospel, but not a special ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "design",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Schnecken-burger: sanction of the foregoing promise and intimation; Baumgarten: that the exalted Christ was to appear as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the acting subject properly speaking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the further course of the Book of Acts). Nothing of this kind is indicated.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπήρθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the word in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is different, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπήρθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " seems not merely to denote our Lord’s first leaving the ground (as Weiss, Overbeck), but also to be more in accordance with the calm and grandeur of the event than ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπήρθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; this latter word would rather denote a taking away by violence.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ νεφέλη ὑπέλαβε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the cloud is here, as elsewhere, the symbol of the divine glory, and it was also as St. Chrysostom called it: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸ ὄχημα τὸ βασιλίκον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we read that our Lord was received up ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν δόξη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “in glory,” R.V.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "while they beheld",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] That they might have as clear proof of His Ascension as they had received of the reality of His Resurrection, He is taken from them while they are still gazing on Him and with His words yet sounding in their ears. In the Gospel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") it is “while He blessed them.” From the narrative in this place the witnesses of the Ascension seem to have been only the eleven, and this is stated expressly in St Mark’s Gospel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so that although in St Luke’s Gospel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the two disciples who had returned from Emmaus are related to have come unto the eleven to report what they had seen, we are not to conclude that they remained with them during all the other events recorded in that chapter, an additional evidence that that chapter relates to events which happened in the course of several days and not all in close sequence on the same day. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Νεφέλη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a cloud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Therefore the Lord did not disappear (vanish away) of Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- Said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "spoken",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as they were looking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "while they beheld",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. They were to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "αὐτόπται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", eye-witnesses, of the Lord's ascension, arid so it is particularly noted that he was taken ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "as they were looking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He did not disappear from their sight till he reached the cloud which enveloped him. Acts 1:9",
        "children": []
      }
    ]
  }
]