[{"header":"Special Dream about Locusts"},{"num":7,"verse":"This is what the Lord God showed me: He was making a gathering of locusts when the spring grain began to grow. The spring grain was after the king’s share had been cut. "},{"num":2,"verse":"When they had finished eating the grass I said, “Lord God, forgive! O that Jacob may stay alive for he is so small!” "},{"num":3,"verse":"So the Lord changed His mind about this. “It will not be,” said the Lord."},{"header":"Special Dream about Fire"},{"num":4,"verse":"This is what the Lord God showed me: The Lord God was calling for a punishment by fire. It dried up the deep waters and began to destroy the farm land. "},{"num":5,"verse":"Then I said, “Lord God, I beg You to stop! How can Jacob stay alive, for he is so small?” "},{"num":6,"verse":"So the Lord changed His mind about this. “This also will not be,” said the Lord God."},{"header":"Special Dream about a String"},{"num":7,"verse":"This is what He showed me: The Lord was standing by a wall made straight by a string held in His hand. "},{"num":8,"verse":"The Lord said to me, “What do you see, Amos?” And I said, “A string.” Then the Lord said, “See, I am about to put a straight string among my people Israel. I will not change My mind again about punishing them. "},{"num":9,"verse":"The high places of Isaac will be destroyed. The holy places of Israel will be laid waste. Then I will rise up against the people of Jeroboam with the sword.”"},{"header":"Amos and Amaziah"},{"num":10,"verse":"Then Amaziah, the religious leader of Bethel, sent word to King Jeroboam of Israel, saying, “Amos has made plans against you among the people of Israel. His words will destroy the land. "},{"num":11,"verse":"For this is what Amos is saying: ‘Jeroboam will die by the sword, and the people of Israel will be taken away from their own land to a strange land.’” "},{"num":12,"verse":"Then Amaziah said to Amos, “Go, you who tell what is going to happen in the future! Run away to the land of Judah! There eat your bread, and there speak your words! "},{"num":13,"verse":"But never speak about your special dreams again at Bethel. For it is a holy place of the king, a place where the nation worships.”"},{"num":14,"verse":"Amos answered Amaziah, saying, “I am not a man who tells what is going to happen in the future, or the son of such a man. I take care of sheep and cattle, and grow fig trees. "},{"num":15,"verse":"But the Lord took me from following the flock and said to me, ‘Go and speak in My name to My people Israel.’ "},{"num":16,"verse":"So now hear the Word of the Lord. You are saying, ‘Do not speak against Israel or preach against the people of Isaac.’ "},{"num":17,"verse":"So this is what the Lord says: ‘Your wife will sell the use of her body in the city. Your sons and daughters will be killed by the sword. Your land will be divided and given to others. You yourself will die in an unclean land. And Israel will be driven away from this land to a strange country.’”"}]