[{"num":2,"verse":"And I, brethren, when I came to you declaring unto you the testimony of God, came not with excellency of speech or of wisdom."},{"num":2,"verse":"For I determined not to know anything among you, save Jesus Christ and Him crucified."},{"num":3,"verse":"And I was with you in weakness and in fear and in much trembling."},{"num":4,"verse":"And my speech and my preaching were not with enticing words of man’s wisdom, but in demonstration of the Spirit and of power,"},{"num":5,"verse":"that your faith should not stand on the wisdom of man, but on the power of God."},{"num":6,"verse":"However, we speak wisdom among those who are perfect, yet not the wisdom of this world, nor of the princes of this world, who are coming to nought."},{"num":7,"verse":"But we speak the wisdom of God in a mystery, even the hidden wisdom which God ordained before the world for our glory —"},{"num":8,"verse":"wisdom which none of the princes of this world knew; for had they known it, they would not have crucified the Lord of Glory."},{"num":9,"verse":"But as it is written: “Eye hath not seen, nor ear heard, neither have entered into the heart of man the things which God hath prepared for them that love Him.”"},{"num":10,"verse":"But God hath revealed them unto us by His Spirit. For the Spirit searcheth all things, yea, the deep things of God."},{"num":11,"verse":"For what man knoweth the things of a man, save the spirit of man which is in him? Even so no man knoweth the things of God, but the Spirit of God."},{"num":12,"verse":"Now we have received, not the spirit of the world, but the Spirit which is of God, that we might know the things that are freely given to us by God."},{"num":13,"verse":"These things also we speak, not in the words which man’s wisdom teacheth, but which the Holy Ghost teacheth, comparing spiritual things with spiritual."},{"num":14,"verse":"But the natural man receiveth not the things of the Spirit of God, for they are foolishness unto him; neither can he know them, because they are spiritually discerned."},{"num":15,"verse":"But he that is spiritual judgeth all things, yet he himself is judged by no man."}]