[{"header":"Ancient heroes"},{"num":6,"verse":"When the number of people started to increase throughout the fertile land, daughters were born to them."},{"num":2,"verse":"The divine beings saw how beautiful these human women were, so they married the ones they chose."},{"num":3,"verse":"The Lord said, “My breath will not remain in humans forever, because they are flesh. They will live one hundred twenty years.”"},{"num":4,"verse":"In those days, giants lived on the earth and also afterward, when divine beings and human daughters had sexual relations and gave birth to children. These were the ancient heroes, famous men."},{"header":"Great flood"},{"num":5,"verse":"The Lord saw that humanity had become thoroughly evil on the earth and that every idea their minds thought up was always completely evil."},{"num":6,"verse":"The Lord regretted making human beings on the earth, and he was heartbroken."},{"num":7,"verse":"So the Lord said, “I will wipe off of the land the human race that I’ve created: from human beings to livestock to the crawling things to the birds in the skies, because I regret I ever made them.”"},{"num":8,"verse":"But as for Noah, the Lord approved of him."},{"num":9,"verse":"These are Noah’s descendants. In his generation, Noah was a moral and exemplary man; he walked with God."},{"num":10,"verse":"Noah had three sons: Shem, Ham, and Japheth."},{"num":11,"verse":"In God’s sight, the earth had become corrupt and was filled with violence."},{"num":12,"verse":"God saw that the earth was corrupt, because all creatures behaved corruptly on the earth."},{"num":13,"verse":"God said to Noah, “The end has come for all creatures, since they have filled the earth with violence. I am now about to destroy them along with the earth,"},{"num":14,"verse":"so make a wooden ark. Make the ark with nesting places and cover it inside and out with tar."},{"num":15,"verse":"This is how you should make it: four hundred fifty feet long, seventy-five feet wide, and forty-five feet high."},{"num":16,"verse":"Make a roof for the ark and complete it one foot from the top. Put a door in its side. In the hold below, make the second and third decks."},{"num":17,"verse":"“I am now bringing the floodwaters over the earth to destroy everything under the sky that breathes. Everything on earth is about to take its last breath."},{"num":18,"verse":"But I will set up my covenant with you. You will go into the ark together with your sons, your wife, and your sons’ wives."},{"num":19,"verse":"From all living things—from all creatures—you are to bring a pair, male and female, into the ark with you to keep them alive."},{"num":20,"verse":"From each kind of bird, from each kind of livestock, and from each kind of everything that crawls on the ground—a pair from each will go in with you to stay alive."},{"num":21,"verse":"Take some from every kind of food and stow it as food for you and for the animals.”"},{"num":22,"verse":"Noah did everything exactly as God commanded him."}]