[{"header":"The Sins of Everyone on Earth"},{"num":6,"verse":"There began to be many human beings on the earth. And daughters were born to them. "},{"num":2,"verse":"The sons of God saw that the daughters of human beings were beautiful. So they married any of them they chose. "},{"num":3,"verse":"Then the Lord said, “My Spirit will not struggle with human beings forever. They will have only 120 years to live.”"},{"num":4,"verse":"The Nephilim were on the earth in those days. That was when the sons of God went to the daughters of human beings. Children were born to them. The Nephilim were famous heroes who lived long ago. Nephilim were also on the earth later on."},{"num":5,"verse":"The Lord saw how bad the sins of everyone on earth had become. They only thought about evil things. "},{"num":6,"verse":"The Lord was very sad that he had made human beings on the earth. His heart was filled with pain. "},{"num":7,"verse":"So the Lord said, “I created human beings, but I will wipe them out. I will also destroy the animals, the birds in the sky, and the creatures that move along the ground. I am very sad that I have made human beings.” "},{"num":8,"verse":"But the Lord was very pleased with Noah."},{"header":"Noah and the Flood"},{"num":9,"verse":"Here is the story of Noah’s family line."},{"num":10,"verse":"Noah had three sons. Their names were Shem, Ham and Japheth."},{"num":11,"verse":"The earth was very sinful in God’s eyes. It was full of people who did mean and harmful things. "},{"num":12,"verse":"God saw how sinful the earth had become. All its people were living very sinful lives. "},{"num":13,"verse":"So God said to Noah, “I am going to put an end to everyone. They have filled the earth with their harmful acts. I am certainly going to destroy them and the earth. "},{"num":14,"verse":"So make yourself an ark out of cypress wood. Make rooms in it. Cover it with tar inside and out. "},{"num":15,"verse":"Here is how I want you to build it. The ark has to be 450 feet long. It has to be 75 feet wide and 45 feet high. "},{"num":16,"verse":"Make a roof for it. Leave below the roof an opening all the way around that is a foot and a half high. Put a door in one side of the ark. Make lower, middle and upper decks. "},{"num":17,"verse":"I am going to bring a flood on the earth. It will destroy all life under the sky. It will destroy every living creature that breathes. Everything on earth will die. "},{"num":18,"verse":"But I will make my covenant with you. You will go into the ark. Your sons and your wife and your sons’ wives will enter it with you. "},{"num":19,"verse":"Bring a male and a female of every living thing into the ark. They will be kept alive with you. "},{"num":20,"verse":"Two of every kind of bird will come to you. Two of every kind of animal will also come to you. And so will two of every kind of creature that moves along the ground. All of them will be kept alive with you. "},{"num":21,"verse":"Take every kind of food that you will need. Store it away as food for you and them.”"},{"num":22,"verse":"Noah did everything just as God commanded him."}]