[{"header":"The Poor Widow Gave More"},{"num":21,"verse":"Jesus looked up and saw rich people putting their gifts into the offering box. "},{"num":2,"verse":"He saw a poor widow there putting in two small coins. "},{"num":3,"verse":"He said, “Truly I tell you, this poor widow put in more than everyone, "},{"num":4,"verse":"for all these put in some of their leftovers as gifts to God, but she, out of her poverty, put in all that she had to live on.”"},{"header":"The Destruction of Jerusalem and the End of the World"},{"num":5,"verse":"As some were talking about the temple, how it was decorated with beautiful stones and offerings, Jesus said, "},{"num":6,"verse":"“These things that you see here—the days will come when there will not be one stone left on another—every one will be thrown down.”"},{"num":7,"verse":"They asked him, “Teacher, when will these things happen? And what is the sign that these things are about to happen?”"},{"num":8,"verse":"He said, “Watch out so that you are not deceived! For many will come in my name, saying, ‘I am he,’ and ‘The time is near.’ Do not follow them. "},{"num":9,"verse":"Whenever you hear of wars and revolutions, do not be terrified, for these things must happen first, but the end will not be right then.”"},{"num":10,"verse":"Then he said to them, “Nation will rise against nation, and kingdom against kingdom. "},{"num":11,"verse":"There will be great earthquakes, famines, and plagues in various places. There will be horrifying sights and great signs from heaven. "},{"num":12,"verse":"But before all these things, they will lay their hands on you and will persecute you, handing you over to synagogues and prisons, bringing you before kings and governors for my name’s sake. "},{"num":13,"verse":"It will turn out to be your opportunity to testify. "},{"num":14,"verse":"So make up your minds not to prepare beforehand how to defend yourselves, "},{"num":15,"verse":"for I will give you words and wisdom that none of your adversaries will be able to withstand or contradict. "},{"num":16,"verse":"You will be betrayed even by parents, brothers, relatives, and friends. They will put some of you to death. "},{"num":17,"verse":"You will be hated by all people for my name’s sake. "},{"num":18,"verse":"But not a hair of your head will perish. "},{"num":19,"verse":"By patient endurance you will gain your lives."},{"num":20,"verse":"“When you see Jerusalem surrounded by armies, then know that its desolation is near. "},{"num":21,"verse":"Then let those who are in Judea flee to the mountains. Let those who are inside the city get out. Let those who are in the country not enter the city. "},{"num":22,"verse":"For these are days of vengeance, to fulfill all that has been written. "},{"num":23,"verse":"How terrible it will be for those who are pregnant and nursing infants in those days! For there will be great distress in the land and wrath against this people. "},{"num":24,"verse":"They will fall by the edge of the sword and be taken captive to all nations. Jerusalem will be trampled on by Gentiles until the times of the Gentiles are fulfilled."},{"num":25,"verse":"“There will be signs in the sun, moon, and stars. And on the earth nations will be in anguish, in perplexity at the roaring of the sea and the surging waves, "},{"num":26,"verse":"people fainting from fear and expectation of the things coming on the world, for the powers of the heavens will be shaken. "},{"num":27,"verse":"And then they will see the Son of Man coming in a cloud with power and great glory. "},{"num":28,"verse":"But when these things begin to happen, stand up and lift up your heads, because your redemption is near.”"},{"num":29,"verse":"He told them a parable. “Look at the fig tree and all the trees. "},{"num":30,"verse":"As soon as they are sprouting leaves, you can see for yourselves and know that summer is actually near. "},{"num":31,"verse":"So also, when you see these things happening, know that the kingdom of God is near. "},{"num":32,"verse":"Amen I tell you: This generation will not pass away until all these things happen. "},{"num":33,"verse":"Heaven and earth will pass away, but my words will never pass away."},{"header":"Be Ready!"},{"num":34,"verse":"“Watch yourselves or else your hearts will be weighed down with carousing, drunkenness, and the worries of this life, and that day may come on you suddenly. "},{"num":35,"verse":"For it will come like a trap on all those who dwell on the face of the whole earth. "},{"num":36,"verse":"Stay alert all the time, praying that you may be able to escape all these things that are going to happen and that you may be able to stand before the Son of Man.”"},{"num":37,"verse":"During the days, Jesus was teaching in the temple courts, and each night he would go out and spend the night on the Mount of Olives. "},{"num":38,"verse":"And all the people came early in the morning to listen to him in the temple courts."}]