[{"num":9,"verse":"The time approached for the king’s order and decree to be carried out, the day when the enemies of the Jews hoped to overpower them. But, as it turned out, the opposite took place — the Jews overpowered those who hated them. Thus, on the thirteenth day of the twelfth month, the month of Adar, "},{"num":2,"verse":"the Jews assembled in their cities throughout all the provinces of King Achashverosh to attack anyone who tried to do them harm; and no one was able to withstand them; because all the peoples were afraid of them. "},{"num":3,"verse":"All the officials of the provinces, the army commanders, the governors and those occupied with the king’s affairs helped the Jews; because they were afraid of Mordekhai. "},{"num":4,"verse":"For Mordekhai had become a powerful person in the king’s palace, and his fame had spread through all the provinces; Mordekhai continued to grow increasingly powerful."},{"num":5,"verse":"The Jews put all their enemies to the sword; there was great slaughter and destruction, as they did whatever they wanted to those who hated them; "},{"num":6,"verse":"in Shushan the capital, the Jews slaughtered 500 men. "},{"num":7,"verse":"They put to death the ten sons of Haman the son of Hamdata, the enemy of the Jews — Parshandata, Dalfon, Aspata, Porata, Adalya, Aridata, Parmashta, Arisai, Aridai and Vaizata. But they did not touch the spoil."},{"num":11,"verse":"The same day, after the king had been told the number of those killed in Shushan the capital, "},{"num":12,"verse":"he said to Ester the queen, “If the Jews have slaughtered 500 men in Shushan the capital and the ten sons of Haman, what have they done in the rest of the royal provinces! Now, whatever your request, you will be granted it; whatever more you want, it will be done.” "},{"num":13,"verse":"Ester replied, “If it pleases the king, let the Jews in Shushan act again tomorrow in accordance with today’s decree; also have Haman’s ten sons hanged on the gallows.” "},{"num":14,"verse":"The king ordered these things done — a decree was issued in Shushan, and they hanged Haman’s ten sons. "},{"num":15,"verse":"So the Jews in Shushan assembled also on the fourteenth day of the month of Adar and killed 300 men in Shushan, but they did not touch the spoil."},{"num":16,"verse":"The other Jews, those in the royal provinces, had assembled, defended their lives and won rest from their enemies, killing 75,000 of those who hated them, but without touching the spoil, "},{"num":17,"verse":"on the thirteenth day of the month Adar. So on the fourteenth day of Adar they rested and made it a holiday for celebrating and rejoicing. "},{"num":18,"verse":"However, the Jews of Shushan assembled on both the thirteenth and fourteenth days of Adar, so it was on the fifteenth that they rested and made it a holiday for celebrating and rejoicing. "},{"num":19,"verse":"This is why the Jews of the villages, those who live in unwalled towns, make the fourteenth day of the month of Adar a day for celebrating and rejoicing, a holiday and a time for sending each other portions [of food]."},{"num":20,"verse":"Mordekhai recorded these events and sent letters to all the Jews in all the provinces of King Achashverosh, both near and far, "},{"num":21,"verse":"instructing them to observe the fourteenth day of the month of Adar and the fifteenth day, every year, "},{"num":22,"verse":"[to commemorate] the days on which the Jews obtained rest from their enemies and the month which for them was turned from sorrow into gladness and from mourning into a holiday; they were to make them days of celebrating and rejoicing, sending portions [of food] to each other and giving gifts to the poor."},{"num":23,"verse":"So the Jews took it upon themselves to continue what they had already begun to do, and as Mordekhai had written to them; "},{"num":24,"verse":"because Haman the son of Hamdata the Agagi, the enemy of the Jews, had plotted against the Jews to destroy them and had thrown pur (that is, “cast lots”) to crush and destroy them; "},{"num":25,"verse":"but when Ester came before the king, he ordered by letters that [Haman’s] wicked scheme, which he had plotted against the Jews, should recoil on his own head, and that he and his sons should be hanged on the gallows. "},{"num":26,"verse":"This is why these days have been called Purim, after the word pur. Thus, because of everything written in this letter, and what they had seen concerning this matter, and what had come upon them, "},{"num":27,"verse":"the Jews resolved and took upon themselves, their descendants and all who might join them that without fail they would observe these two days in accordance with what was written in [this letter] and at the appointed time, every year; "},{"num":28,"verse":"and that these days would be remembered and observed throughout every generation, every family, every province and every city; and that these days of Purim would never cease among the Jews or their memory be lost by their descendants."},{"num":29,"verse":"Then Ester the queen, the daughter of Avichayil, and Mordekhai the Jew, gave full written authority to confirm a second letter about Purim. "},{"num":30,"verse":"He sent copies of it to all the Jews, to the 127 provinces of the kingdom of Achashverosh, ensuring their peace and security "},{"num":31,"verse":"and requiring the observance of these days of Purim at their designated times, as Mordekhai the Jew and Ester the queen had enjoined them, and as they had established for themselves and their descendants concerning the matters of fasting and lamenting. "},{"num":32,"verse":"At Ester’s order these matters of Purim were confirmed and put in writing in the book."}]