[[],[],[{"type":"prose","content":"On the thirteenth day of the twelfth month, the month of Adar, the king’s order came into effect. This was the very day that the enemies of the Jews had planned to overpower them, but the tables were now turned: the Jews overpowered those who hated them! The Jews had gathered in the cities throughout King Xerxes’ provinces to lay hands on those who were seeking their ruin. Not one man was able to stand up against them—fear made cowards of them all. What’s more, all the government officials, satraps, governors—everyone who worked for the king—actually helped the Jews because of Mordecai; they were afraid of him. Mordecai by now was a power in the palace. As Mordecai became more and more powerful, his reputation had grown in all the provinces."}],[{"type":"prose","content":"So the Jews finished off all their enemies with the sword, slaughtering them right and left, and did as they pleased to those who hated them. In the palace complex of Susa the Jews massacred five hundred men. They also killed the ten sons of Haman son of Hammedatha, the archenemy of the Jews:"}],[{"type":"prose","content":"But they took no plunder. That day, when it was all over, the number of those killed in the palace complex was given to the king. The king told Queen Esther, “In the palace complex alone here in Susa the Jews have killed five hundred men, plus Haman’s ten sons. Think of the killing that must have been done in the rest of the provinces! What else do you want? Name it and it’s yours. Your wish is my command.”"}],[{"type":"prose","content":"“If it please the king,” Queen Esther responded, “give the Jews of Susa permission to extend the terms of the order another day. And have the bodies of Haman’s ten sons hanged in public display on the gallows.”"}],[{"type":"prose","content":"The king commanded it: The order was extended; the bodies of Haman’s ten sons were publicly hanged."}],[{"type":"prose","content":"The Jews in Susa went at it again. On the fourteenth day of Adar they killed another three hundred men in Susa. But again they took no plunder."}],[{"type":"prose","content":"Meanwhile in the rest of the king’s provinces, the Jews had organized and defended themselves, freeing themselves from oppression. On the thirteenth day of the month of Adar, they killed seventy-five thousand of those who hated them but did not take any plunder. The next day, the fourteenth, they took it easy and celebrated with much food and laughter. But in Susa, since the Jews had banded together on both the thirteenth and fourteenth days, they made the fifteenth their holiday for laughing and feasting. (This accounts for why Jews living out in the country in the rural villages remember the fourteenth day of Adar for celebration, their day for parties and the exchange of gifts.)* * *"}],[{"type":"prose","content":"Mordecai wrote all this down and sent copies to all the Jews in all King Xerxes’ provinces, regardless of distance, calling for an annual celebration on the fourteenth and fifteenth days of Adar as the occasion when Jews got relief from their enemies, the month in which their sorrow turned to joy, mourning somersaulted into a holiday for parties and fun and laughter, the sending and receiving of presents and of giving gifts to the poor."}],[{"type":"prose","content":"And they did it. What started then became a tradition, continuing the practice of what Mordecai had written to them.* * *"}],[{"type":"prose","content":"Haman son of Hammedatha, the Agagite, the archenemy of all Jews, had schemed to destroy all Jews. He had cast the  (the lot) to throw them into a panic and destroy them. But when Queen Esther intervened with the king, he gave written orders that the evil scheme that Haman had worked out should boomerang back on his own head. He and his sons were hanged on the gallows. That’s why these days are called “Purim,” from the word  or “lot.”"}],[{"type":"prose","content":"Therefore, because of everything written in this letter and because of all that they had been through, the Jews agreed to continue. It became a tradition for them, their children, and all future converts to remember these two days every year on the specified dates set down in the letter. These days are to be remembered and kept by every single generation, every last family, every province and city. These days of Purim must never be neglected among the Jews; the memory of them must never die out among their descendants."}],[{"type":"prose","content":"Queen Esther, the daughter of Abihail, backed Mordecai the Jew, using her full queenly authority in this second Purim letter to endorse and ratify what he wrote. Calming and reassuring letters went out to all the Jews throughout the 127 provinces of Xerxes’ kingdom to fix these days of Purim their assigned place on the calendar, dates set by Mordecai the Jew—what they had agreed to for themselves and their descendants regarding their fasting and mourning. Esther’s word confirmed the tradition of Purim and was written in the book.* * *"}]]