[{"header":"Chapter 9"},{"num":1,"verse":"The Massacre Reversed. When the day arrived on which the order decreed by the king was to be carried out, the thirteenth day of the twelfth month, Adar, on which the enemies of the Jews had expected to overpower them, the situation was reversed: the Jews overpowered those who hated them. "},{"num":2,"verse":"The Jews mustered in their cities throughout the provinces of King Ahasuerus to attack those who sought to do them harm, and no one could withstand them, for fear of them fell upon all the peoples. "},{"num":3,"verse":"Moreover, all the officials of the provinces, the satraps, governors, and royal procurators supported the Jews out of fear of Mordecai; "},{"num":4,"verse":"for Mordecai was powerful in the royal palace, and the report was spreading through all the provinces that he was continually growing in power."},{"num":5,"verse":"The Jews struck down all their enemies with the sword, killing and destroying them; they did to those who hated them as they pleased. "},{"num":6,"verse":"In the royal precinct of Susa, the Jews killed and destroyed five hundred people. "},{"num":7,"verse":"They also killed Parshandatha, Dalphon, Aspatha, "},{"num":8,"verse":"Poratha, Adalia, Aridatha, "},{"num":9,"verse":"Parmashta, Arisai, Aridai, and Vaizatha, "},{"num":10,"verse":"the ten sons of Haman, son of Hammedatha, the foe of the Jews. However, they did not engage in plundering."},{"num":11,"verse":"On the same day, when the number of those killed in the royal precinct of Susa was reported to the king, "},{"num":12,"verse":"he said to Queen Esther: “In the royal precinct of Susa the Jews have killed and destroyed five hundred people, as well as the ten sons of Haman. What must they have done in the other royal provinces! You shall again be granted whatever you ask, and whatever you request shall be honored.” "},{"num":13,"verse":"So Esther said, “If it pleases your majesty, let the Jews in Susa be permitted again tomorrow to act according to today’s decree, and let the ten sons of Haman be impaled on stakes.” "},{"num":14,"verse":"The king then gave an order that this be done, and the decree was published in Susa. So the ten sons of Haman were impaled, "},{"num":15,"verse":"and the Jews in Susa mustered again on the fourteenth of the month of Adar and killed three hundred people in Susa. However, they did not engage in plundering."},{"num":16,"verse":"The other Jews, who dwelt in the royal provinces, also mustered and defended themselves, and obtained rest from their enemies. They killed seventy-five thousand of those who hated them, but they did not engage in plunder. "},{"num":17,"verse":"This happened on the thirteenth day of the month of Adar."},{"num":18,"verse":"The Jews in Susa, however, mustered on the thirteenth and fourteenth of the month. But on the fifteenth they rested, and made it a day of joyful banqueting. "},{"num":19,"verse":"That is why the rural Jews, who dwell in villages, celebrate the fourteenth of the month of Adar as a day of joyful banqueting, a holiday on which they send food to one another."},{"num":20,"verse":"Mordecai recorded these events and sent letters to all the Jews, both near and far, in all the provinces of King Ahasuerus. "},{"num":21,"verse":"He ordered them to celebrate every year both the fourteenth and the fifteenth of the month of Adar "},{"num":22,"verse":"as the days on which the Jews obtained rest from their enemies and as the month which was turned for them from sorrow into joy, from mourning into celebration. They were to observe these days with joyful banqueting, sending food to one another and gifts to the poor. "},{"num":23,"verse":"The Jews adopted as a custom what they had begun doing and what Mordecai had written to them."},{"num":24,"verse":"Summary of the Story. Haman, son of Hammedatha the Agagite, the foe of all the Jews, had planned to destroy them and had cast the pur, or lot, for the time of their defeat and destruction. "},{"num":25,"verse":"Yet, when the plot became known to the king, the king ordered in writing that the wicked plan Haman had devised against the Jews should instead be turned against Haman and that he and his sons should be impaled on stakes. "},{"num":26,"verse":"And so these days have been named Purim after the word pur."},{"num":27,"verse":"the Jews established and adopted as a custom for themselves, their descendants, and all who should join them, the perpetual obligation of celebrating these two days every year in the manner prescribed by this letter, and at the time appointed. "},{"num":28,"verse":"These days were to be commemorated and kept in every generation, by every clan, in every province, and in every city. These days of Purim were never to be neglected among the Jews, nor forgotten by their descendants."},{"num":29,"verse":"Queen Esther, daughter of Abihail, and Mordecai the Jew, wrote to confirm with full authority this second letter about Purim, "},{"num":30,"verse":"and Mordecai sent documents concerning peace and security to all the Jews in the hundred and twenty-seven provinces of Ahasuerus’ kingdom. "},{"num":31,"verse":"Thus were established, for their appointed time, these days of Purim which Mordecai the Jew and Queen Esther had designated for the Jews, just as they had previously enjoined upon themselves and upon their descendants the duty of fasting and supplication. "},{"num":32,"verse":"The command of Esther confirmed these prescriptions for Purim and was recorded in the book."}]