[{"header":"Chapter 9"},{"num":1,"verse":"Triumph of the Jews. On the thirteenth day of the twelfth month of Adar, the edict of the king was to become effective. It was on this day that the enemies of the Jews had expected to become masters of them. But in a role reversal it was the Jews who became masters of their enemies."},{"num":2,"verse":"The Jews assembled in their cities in all the provinces of King Ahasuerus to attack those seeking their destruction. No one could withstand them, because the people of all the other nationalities were afraid of them."},{"num":3,"verse":"Moreover, all of the provinces, the satraps, the governors and the king’s administrators helped the Jews, out of fear of Mordecai."},{"num":4,"verse":"Mordecai was powerful in the palace: his fame spread throughout the provinces, and his power kept on growing."},{"num":5,"verse":"The Jews overcame all their enemies with the sword, killing and destroying them, and did what they pleased to their enemies."},{"num":6,"verse":"In the citadel of Susa, they killed and destroyed five hundred men."},{"num":7,"verse":"They also killed Parshandatha, Dalphon, Aspatha,"},{"num":8,"verse":"Porathai, Adalia, Aridatha,"},{"num":9,"verse":"Parmashta, Arisai, Aridai, and Vaizatha,"},{"num":10,"verse":"the ten sons of Haman, son of Hammedatha, the enemy of the Jews. However, they did not engage in plundering."},{"num":11,"verse":"On the same day, the number of those slain in the citadel of Susa was reported to the king."},{"num":12,"verse":"He said to Queen Esther, “The Jews have killed and destroyed five hundred men and the ten sons of Haman in the citadel of Susa. But what must they have done in the other royal provinces! You shall again be granted whatever you ask, and whatever you request will be honored.”"},{"num":13,"verse":"“If it pleases the king,” Esther replied, “let the Jews in Susa be permitted again to carry out this day’s edict tomorrow also, and let the ten sons of Haman be hanged on gibbets.”"},{"num":14,"verse":"The king then gave an order that this should be done. An edict was issued in Susa, and they hanged the ten sons of Haman."},{"num":15,"verse":"The Jews in Susa came together on the fourteenth day of the month of Adar, and they put to death three hundred men in Susa. However, they did not engage in plundering."},{"num":16,"verse":"Meanwhile, the other Jews who were in the king’s provinces also assembled to protect themselves and to obtain rest from their enemies. They killed seventy-five thousand of them, but they did not engage in plundering."},{"num":17,"verse":"This took place on the thirteenth day of the month of Adar, and on the fourteenth day of the month they rested and made it a day of feasting and joy."},{"num":18,"verse":"The Jews in Susa, however, had assembled on the thirteenth and fourteenth of the month of Adar. On the fifteenth of the month they rested, and made it a day of feasting and joy."},{"num":19,"verse":"That is why rural Jews, who live in villages, observe the fourteenth of the month of Adar as a day of feasting and rejoicing, a holiday on which they give presents to one another. Instead, those who live in large cities celebrate the fifteenth of Adar as a day of feasting and joy and give presents to each other."},{"num":20,"verse":"The Feast of Purim. Mordecai recorded these events, and dispatched letters to all the Jews throughout the provinces of King Ahasuerus, to both those who were near and those who were far off."},{"num":21,"verse":"He commanded them to celebrate every year the fourteenth and fifteenth days of the month of Adar,"},{"num":22,"verse":"as the time when the Jews succeeded in obtaining relief from their enemies and as the month when their sorrow was turned into joy and their mourning into a day of celebration. He wrote them to observe these days as days of feasting and rejoicing, sending food to one another and gifts to the poor."},{"num":23,"verse":"So the Jews accepted all that Mordecai had written to them."},{"num":24,"verse":"For Haman, son of Hammedatha, the Agagite, the enemy of the Jews, had hatched a plot to destroy them and had cast the pur (that is, the lot) for their defeat and destruction."},{"num":25,"verse":"But when Esther entered the royal presence, the king gave written orders that the wicked scheme Haman had devised against the Jews should be turned against him instead and that he and his sons should be hanged on gibbets."},{"num":26,"verse":"(Therefore, these days were called Purim, from the word pur.)"},{"num":28,"verse":"These days were to be remembered in every generation by every family, and in every province and in every city. Moreover, these days of Purim were never to fall into disuse among the Jews, nor should their memory die out among their descendants."},{"num":29,"verse":"Queen Esther, daughter of Abihail and of Mordecai the Jew, wrote with complete authority to confirm this second letter about Purim."},{"num":30,"verse":"And Mordecai sent documents about peace and security to all the Jews in the one hundred and twenty-seven provinces of Ahasuerus’s kingdom."},{"num":31,"verse":"Thus, there were established, for their appointed time, these days of Purim that Mordecai the Jew and Queen Esther had designated for the Jews, and as they had established for themselves and for their race, the duty of fasting and supplication."},{"num":32,"verse":"Esther’s decree confirmed these rules concerning Purim, and it was recorded in the book."},{"header":"Chapter 10"},{"num":3,"verse":"The Greatness of Mordecai.King Ahasuerus imposed tribute throughout the land to its distant shores.And all his acts of power and might, as well as an account of the greatness of Mordecai, whom the king promoted, are set down in the book of the annals of the kings of Media and Persia.Mordecai the Jew was second in rank to King Ahasuerus, preeminent among the Jews, and held in high esteem by his fellow Jews because he worked for the good of his people and was the herald of peace for his whole race."},{"header":"Epilogue"},{"header":"Chapter F"},{"num":6,"verse":"Mordecai’s Dream Fulfilled.Then Mordecai said: “All this is God’s doing,for I remember the dream I had about these events, and not one of them has failed to be fulfilled—the tiny spring that became a river, the light that shone, the sun, the abundance of water. The river is Esther, whom the king married and established as queen.The two dragons are Haman and myself.The nations are those who joined together to extinguish the name of the Jews.And my nation is Israel who cried to God for deliverance and was saved."},{"num":9,"verse":"“The Lord has saved his people and delivered us from all these evils. God has performed great signs and wonders such as have never before occurred among the nations.To accomplish this he prepared two lots, one for the people of God and one for all the nations.These lots were cast at the prescribed hour and time, on the day of judgment before God and all the nations.And God remembered his people and rendered a verdict of justice in favor of his heritage."},{"num":10,"verse":"“Therefore, they are to assemble with joy and gladness before God and celebrate these days in the month of Adar, on the fourteenth and fifteenth of that month, from generation to generation among his people Israel forever.”"},{"num":11,"verse":"A Postscript about Purim.In the fourth year of the reign of Ptolemy and Cleopatra, Dositheus, who said he was a priest and Levite, and his son, Ptolemy, brought to Egypt the preceding letter about Purim, saying that it was genuine and had been translated by Lysimachus, son of Ptolemy, of the community of Jerusalem."}]