[{"num":9,"verse":"The king’s order had to be carried out on the 13th day of the 12th month. That was the month of Adar. On that day the enemies of the Jews had hoped to win the battle over them. But now everything had changed. The Jews had gained the advantage over those who hated them. "},{"num":2,"verse":"The Jews gathered together in their cities. They gathered in all the territories King Xerxes ruled over. They came together to attack those who were trying to destroy them. No one could stand up against them. The people from all the other nations were afraid of them. "},{"num":3,"verse":"All the nobles in the territories helped the Jews. So did the royal officials, the governors and the king’s officers. That’s because they were so afraid of Mordecai. "},{"num":4,"verse":"He was well known in the palace. His fame spread all through the territories. So he became more and more important."},{"num":5,"verse":"The Jews struck down with swords all their enemies. They killed them and destroyed them. They did what they pleased to those who hated them. "},{"num":6,"verse":"The Jews killed 500 men. They destroyed them in the fort of Susa. "},{"num":7,"verse":"They also killed Parshandatha, Dalphon, Aspatha, "},{"num":8,"verse":"Poratha, Adalia, Aridatha, "},{"num":9,"verse":"Parmashta, Arisai, Aridai and Vaizatha. "},{"num":10,"verse":"They were the ten sons of Haman. He was the son of Hammedatha. Haman had been the enemy of the Jews. They didn’t take anything that belonged to their enemies."},{"num":11,"verse":"A report was brought to the king that same day. He was told how many men had been killed in the fort of Susa. "},{"num":12,"verse":"He said to Queen Esther, “The Jews have killed 500 men. They destroyed them in the fort of Susa. They also killed the ten sons of Haman there. What have they done in the rest of my territories? Now what do you want? I’ll give it to you. What do you want me to do for you? I’ll do that too.”"},{"num":13,"verse":"“If it pleases you,” Esther answered, “let the Jews in Susa carry out today’s order tomorrow also. Stick poles through the dead bodies of Haman’s ten sons. Set them up where everyone can see them.”"},{"num":14,"verse":"So the king commanded that it be done. An order was sent out in Susa. And the king’s men did to the bodies of Haman’s sons everything they were told to do. "},{"num":15,"verse":"The Jews in Susa came together on the 14th day of the month of Adar. They put 300 men to death in Susa. But they didn’t take anything that belonged to those men."},{"num":16,"verse":"During that time, the rest of the Jews also gathered together. They lived in the king’s territories. They came together to fight for their lives. They didn’t want their enemies to bother them anymore. They wanted to get some peace and rest. So they killed 75,000 of their enemies. But they didn’t take anything that belonged to them. "},{"num":17,"verse":"It happened on the 13th of Adar. On the 14th day they rested. They made it a day to celebrate with great joy. And they enjoyed good food."},{"num":18,"verse":"But the Jews in Susa had gathered together on the 13th and 14th. Then on the 15th they rested. They made it a day to celebrate with great joy. And they enjoyed good food."},{"num":19,"verse":"That’s why Jews who live out in the villages celebrate on the 14th of Adar. They celebrate that day with great joy. And they enjoy good food. They also give presents to each other on that day."},{"header":"Purim Is Celebrated"},{"num":20,"verse":"Mordecai wrote down these events. He sent letters to all the Jews all through the territories of King Xerxes. It didn’t matter whether the Jews lived nearby or far away. "},{"num":21,"verse":"Mordecai told them to celebrate the 14th and 15th days of the month of Adar. He wanted them to do it every year. "},{"num":22,"verse":"Mordecai told the Jews to celebrate the time when they got rest from their enemies. That was the month when their sadness was turned into joy. It was when their weeping turned into a day for celebrating. He wrote the letters to celebrate those days as times of joy. He wanted the people to enjoy good food. He told them to give presents of food to one another. He also wanted them to give gifts to people who were poor."},{"num":23,"verse":"So the Jews agreed to continue the celebrating they had started. They kept doing what Mordecai had written to them. "},{"num":24,"verse":"Haman was the son of Hammedatha, the Agagite. He had been the enemy of all the Jews. He had planned to destroy them. He had cast the lot to destroy them completely. The lot was called Pur. "},{"num":25,"verse":"But the king had found out about Haman’s evil plan. So the king had sent out written orders. He had ordered that Haman’s evil plan against the Jews should happen to him instead. The king also commanded that poles be stuck through the dead bodies of Haman and his sons. Then they should be set up where everyone could see them. "},{"num":26,"verse":"The days the Jews were celebrating were called Purim. Purim comes from the word Pur. Pur means Lot. Now the Jews celebrate these two days every year. They do it because of everything that was written in Mordecai’s letter. They also do it because of what they had seen and what had happened to them. "},{"num":27,"verse":"So they established it as a regular practice. They decided they would always observe these two days of the year. They would celebrate in the required way. And they would celebrate at the appointed time. They and their children after them would always observe these days. And so would all who join them. "},{"num":28,"verse":"The days should be remembered and celebrated. They should be remembered by every family for all time to come. They should be celebrated in every territory and in every city. The Jews should never stop celebrating the days of Purim. Their children after them should always remember these days."},{"num":29,"verse":"So Queen Esther, the daughter of Abihail, wrote a second letter. She wrote it together with Mordecai the Jew. They wanted to give their full authority to this second letter about Purim. "},{"num":30,"verse":"Mordecai sent letters to all the Jews in the 127 territories of the kingdom of Xerxes. The letters had messages of kindness and hope in them. "},{"num":31,"verse":"The letters established the days of Purim at their appointed times. They spoke about what Mordecai the Jew and Queen Esther had ordered the people to do. Everything should be done in keeping with the directions the Jews had set up for themselves and their children after them. The directions applied to their times of fasting and sadness. "},{"num":32,"verse":"Esther’s order established the rules about Purim. It was written down in the records."}]