[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall I bring to the birth . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The implied thought is that God will not leave His work of national restoration unfinished. There shall not be that frustration of hopes when they seem just on the point of being fulfilled which the history of the world so often records. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 66:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 66:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall I bring to the birth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Shall I disappoint and render abortive a design of which I myself was the author, when every thing is ripe for execution, and the effect just ready to be produced? Shall I begin a work and not perfect it? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall I cause to bring forth, and shut the womb ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That there should not be a continual succession of converts in all ages? Zion shall not bring forth once only, but she shall continue to be fruitful: her womb shall not be shut: she shall every day bring forth more and more children, and my presence shall be with my church to the end of the world. Thus the prophet still carries on the comparison between the natural and the spiritual birth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "66:5-14 The prophet turns to those that trembled at God's word, to comfort and encourage them. The Lord will appear, to the joy of the humble believer, and to the confusion of hypocrites and persecutors. When the Spirit was poured out, and the gospel went forth from Zion, multitudes were converted in a little time. The word of God, especially his promises, and ordinances, are the consolations of the church. The true happiness of all Christians is increased by every convert brought to Christ. The gospel brings with it, wherever it is received in its power, such a river of peace, as will carry us to the ocean of boundless and endless bliss. Divine comforts reach the inward man; the joy of the Lord will be the strength of the believer. Both God's mercy and justice shall be manifested, and for ever magnified.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall I bring to the birth? - The sense of this verse is plain. It is, that God would certainly accomplish what he had here predicted, and for which he had made ample arrangements and preparations. He would not commence the work, and then abandon it. The figure which is used here is obvious; but one which does not render very ample illustration proper. Jarchi has well expressed it: 'Num ego adducerem uxorem meam ad sellam partus, sc. ad partitudinem, et non aperirem uterum ejus, ut foetum suum in lucem produceret? Quasi diceret; an ego incipiam rem nec possim eam perficere?'",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall I cause to bring forth? - Lowth and Noyes render this, 'Shall I, who begat, restrain the birth?' This accurately expresses the idea. The meaning of the whole is, that God designed the great and sudden increase of his church; that the plan was long laid; and that, having done this, he would not abandon it, but would certainly effect his designs. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall I cause to bring forth? - Lowth and Noyes render this, 'Shall I, who begat, restrain the birth?' This accurately expresses the idea. The meaning of the whole is, that God designed the great and sudden increase of his church; that the plan was long laid; and that, having done this, he would not abandon it, but would certainly effect his designs. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. cause to bring forth, and shut—rather, \"Shall I who beget, restrain the birth?\" [Lowth], (Isa 37:3; Ho 13:13); that is, Shall I who have begun, not finish My work of restoring Israel? (1Sa 3:12; Ro 11:1; Php 1:6).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shut—(compare Re 3:7, 8).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The work before spoken of seemeth not after the manner of men, who do things that are great gradually, nor in an ordinary course of nature, whose motions also bring things by degrees to their perfection; but you must consider who it is that speaketh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "saith the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " now as is the God, so is his strength. Again, men may undertake things, and for want of power not bring them to perfection; but shall I do such a thing? I have by many prophecies and promises secured you in the expectation of such a thing, and shall I not by my providence effect it? I, that in the ordinary course of my providence use to give a birth to women, to whom I have given a power to conceive, shall I not give a birth to Zion, to my people, whom by my prophecies and promises I have made to conceive such hopes and expectations? Nor shall Zion once only bring forth, but she shall go on teeming; her womb shall not be shut, she shall every day bring forth more and more children; my presence shall be with my church to that end, to the end of the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall I bring to the birth, and not cause to bring forth, saith the Lord?.... Or, \"to the place of breaking\" forth of children, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the womb, and the mouth of it: or, \"shall I break or open\" that, so some (s) render it; lest too much should or seem to be attributed to the Church, she being said to travail in birth, and bring forth children, this is said by the Lord. The church may pray, and her ministers preach, and both be said to travail in birth, but it is the Lord that brings to it; regeneration is not the work of man, but of God; it is he that beget, again, quickens, renews, and sanctifies; it is he that begins the work of grace in regeneration, in real and thorough convictions of sin; which are right when men are convinced of the impurity of their nature, the exceeding sinfulness of sin, have a godly sorrow for it, and forsake it: the work is begun when souls feel the burden of sin; the inward struggling, of grace and corruption; a want of spiritual food, and hunger after it; desires after spiritual things, and a glowing love and affection for them; and when light is infused, faith, fear, and love produced, and every other grace implanted; and he that has begun the good work will perform it; as Jarchi rightly gives the sense of the clause, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"shall I begin a thing, and not be able to finish it?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "no, he is a rock, and his work is perfect, as in creation and redemption, so in regeneration and conversion; as may be concluded, from his power to effect it, and his promise to do it; the grace of Christ, and the indwelling of the Spirit; the impotency of everything to hinder it, and the glory of the three divine Persons concerned in it. As in the natural birth it is he that gives strength to conceive, forms the embryo in the womb, ripens it for the birth, and takes the child out of its mother's womb; so he does all that answers hereunto in the spiritual birth. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall I cause to bring forth, and shut the womb, saith thy God? no, I will not. As God has regenerated many souls in the first times of the Gospel, and many more since, in various nations, in each of the ages and periods of time; so he has not ceased, nor will he cease from this work, until all his elect are born again; for everyone that is chosen of the Father, given to the Son, taken into covenant, and redeemed by his blood, shall be begotten again to a lively hope of a glorious inheritance; God will not shut the womb of conversion until they are all brought to faith in Christ, and repentance towards God. He will beget many more sons and daughters; and he will cause the fulness of the Gentiles to be brought forth and brought in, and convert his ancient people the Jews; all his promises shall be performed, and all prophecies relating to these things shall be accomplished. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(s)  \"matricem frangam?\" Montanus; \"an ego aperirem os matricis?\" Junius & Tremellius, Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s)  \"matricem frangam?\" Montanus; \"an ego aperirem os matricis?\" Junius & Tremellius, Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Shall I {k} bring to the birth, and not cause to bring forth? saith the LORD: shall I cause to bring forth, and shut the womb? saith thy God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall I ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " bring to the birth, and not cause to bring forth? saith the LORD: shall I cause to bring forth, and shut ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "the womb",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "? saith thy God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Declaring by this that as by his power and providence women travailed and delivered so he gives power to bring forth the Church at his appointed time.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; “the children are come to the birth, and there is not strength to bring forth.” But in this crisis Jehovah Himself is present, and what He begins He will carry on to its marvellous issue.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The second half of the verse should be rendered as in R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shall I that cause to bring forth shut",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the womb? &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall I bring to the birth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.? ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"Should I arrange all the preliminary circumstances for the restoration of my people, and stop there?\" (Cheyne). Nay, should I, having done so much, interpose at the last moment, to shut the womb? Without such interposition, matters have progressed so far, that the result must come. Isaiah 66:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "All of these fall victims to the judgment; and yet Zion is not left either childless or without population. \"Before she travailed she brought forth; before pains came upon her, she was delivered of a boy. Who hath heard such a thing? Who hath seen anything like it? Are men delivered of a land in one day? or is a nation begotten at once? For Zion hath travailed, yea, hath brought forth her children. Should I bring to the birth, and not cause to bring forth? saith Jehovah: or should I, who cause to bring forth, shut it? saith thy God.\" Before Zion travaileth, before any labour pains come upon her (chēbhel with tzere), she has already given birth, or brought with ease into the world a male child (hı̄mlit like millēt, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 34:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to cause to glide out). This boy, of whom she is delivered with such marvellous rapidity, is a whole land full of men, an entire nation. The seer exclaims with amazement, like Zion herself in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"who hath heard such a thing, or seen anything like it? is a land brought to the birth (hăyūchal followed by 'erets for hăthūchal, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Ges. 147), i.e., the population of a whole land (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 18:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that in one day, or a nation born all at once (yivvâlēd, with munach attached to the kametz, and metheg to the tzere)? This unheard-of event has taken place now, for Zion has travailed, yea, has also brought forth her children,\" - not one child, but her children, a whole people that calls her mother.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: There is a certain similarity in the saying, with which a talmudic teacher roused up the sleepy scholars of the Beth ha-Midrash: \"There was once a woman, who was delivered of 600,000 children in one day,\" viz., Jochebed, who, when she gave birth to Moses, brought 600,000 to the light of freedom (Exodus 12:37).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: There is a certain similarity in the saying, with which a talmudic teacher roused up the sleepy scholars of the Beth ha-Midrash: \"There was once a woman, who was delivered of 600,000 children in one day,\" viz., Jochebed, who, when she gave birth to Moses, brought 600,000 to the light of freedom (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For\" (kı̄) presupposes the suppressed thought, that this unexampled event has now occurred: yâledâh follows châlâh with gam, because chı̄l signifies strictly parturire; yâl, parere. Zion, the mother, is no other than the woman of the sun in Revelation 12; but the child born of her there is the shepherd of the nations, who proceeds from her at the end of the days, whereas here it is the new Israel of the last days; for the church, which is saved through all her tribulations, is both the mother of the Lord, by whom Babel is overthrown, and the mother of that Israel which inherits the promises, that the unbelieving mass have failed to obtain. Isaiah 66:9 follows with an emphatic confirmation of the things promised. Jehovah inquires: \"Should I create the delivery (cause the child to break through the matrix) and not the birth (both hiphil, causative), so that although the child makes an effort to pass the opening of the womb, it never comes to the light of day? Or should I be one to bring it to the birth, and then to have closed, viz., the womb, so that the word of bringing forth should remain ineffectual, when all that is required is the last effort to bring to the light the fruit of the womb?\" From the expression \"thy God,\" we see that the questions are addressed to Zion, whose faith they are intended to strengthen. According to Hofmann (Schriftbeweis, ii. 1, 149, 150), the future יאמר affirms what Jehovah will say, when the time for bringing forth arrives, and the perfect אמר what He is saying now: \"Should I who create the bringing forth have shut up?\" And He comforts the now barren daughter Zion (Isaiah 54:1) with the assurance, that her barrenness is not meant to continue for ever. \"The prediction,\" says Hofmann, \"which is contained in ה יאמר, of the ultimate issue of the fate of Zion, is so far connected with the consolation administered for the time present, that she who is barren now is exhorted to anticipate the time when the former promise shall be fulfilled.\" But this change in the standpoint is artificial, and contrary to the general use of the expression ה יאמר elsewhere (see at Isaiah 40:1). Moreover, the meaning of the two clauses, which constitute here as elsewhere a disjunctive double question in form more than in sense, really runs into one. The first member affirms that Jehovah will complete the bringing to the birth; the second, that He will not ultimately frustrate what He has almost brought to completion: an ego sum is qui parere faciat et (uterum) occluserim (occludam)? There is no other difference between יאמר and אמר, than that the former signifies the word of God which is sounding at the present moment, the latter the word that has been uttered and is resounding still. The prophetic announcement of our prophet has advanced so far, that the promised future is before the door. The church of the future is already like the fruit of the body ripe for the birth, and about to separate itself from the womb of Zion, which has been barren until now. The God by whom everything has been already so far prepared, will suddenly cause Zion to become a mother - a boy, viz., a whole people after Jehovah's own heart, will suddenly lie in her lap, and this new-born Israel, not the corrupt mass, will build a temple for Jehovah. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"For\" (kı̄) presupposes the suppressed thought, that this unexampled event has now occurred: yâledâh follows châlâh with gam, because chı̄l signifies strictly parturire; yâl, parere. Zion, the mother, is no other than the woman of the sun in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but the child born of her there is the shepherd of the nations, who proceeds from her at the end of the days, whereas here it is the new Israel of the last days; for the church, which is saved through all her tribulations, is both the mother of the Lord, by whom Babel is overthrown, and the mother of that Israel which inherits the promises, that the unbelieving mass have failed to obtain. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 66:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " follows with an emphatic confirmation of the things promised. Jehovah inquires: \"Should I create the delivery (cause the child to break through the matrix) and not the birth (both hiphil, causative), so that although the child makes an effort to pass the opening of the womb, it never comes to the light of day? Or should I be one to bring it to the birth, and then to have closed, viz., the womb, so that the word of bringing forth should remain ineffectual, when all that is required is the last effort to bring to the light the fruit of the womb?\" From the expression \"thy God,\" we see that the questions are addressed to Zion, whose faith they are intended to strengthen. According to Hofmann (Schriftbeweis, ii. 1, 149, 150), the future יאמר affirms what Jehovah will say, when the time for bringing forth arrives, and the perfect אמר what He is saying now: \"Should I who create the bringing forth have shut up?\" And He comforts the now barren daughter Zion (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 54:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") with the assurance, that her barrenness is not meant to continue for ever. \"The prediction,\" says Hofmann, \"which is contained in ה יאמר, of the ultimate issue of the fate of Zion, is so far connected with the consolation administered for the time present, that she who is barren now is exhorted to anticipate the time when the former promise shall be fulfilled.\" But this change in the standpoint is artificial, and contrary to the general use of the expression ה יאמר elsewhere (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Moreover, the meaning of the two clauses, which constitute here as elsewhere a disjunctive double question in form more than in sense, really runs into one. The first member affirms that Jehovah will complete the bringing to the birth; the second, that He will not ultimately frustrate what He has almost brought to completion: an ego sum is qui parere faciat et (uterum) occluserim (occludam)? There is no other difference between יאמר and אמר, than that the former signifies the word of God which is sounding at the present moment, the latter the word that has been uttered and is resounding still. The prophetic announcement of our prophet has advanced so far, that the promised future is before the door. The church of the future is already like the fruit of the body ripe for the birth, and about to separate itself from the womb of Zion, which has been barren until now. The God by whom everything has been already so far prepared, will suddenly cause Zion to become a mother - a boy, viz., a whole people after Jehovah's own heart, will suddenly lie in her lap, and this new-born Israel, not the corrupt mass, will build a temple for Jehovah. ",
            "children": []
          }
        ]
      }
    ]
  }
]