[{"header":"Jeremiah’s Message in the Temple"},{"num":26,"verse":"Soon after Jehoiakim became king of Judah, the Lord said:"},{"num":2,"verse":"Jeremiah, I have a message for everyone who comes from the towns of Judah to worship in my temple. Go to the temple courtyard and speak every word that I tell you. "},{"num":3,"verse":"Maybe the people will listen this time. And if they stop doing wrong, I will change my mind and not punish them for their sins. "},{"num":4,"verse":"Tell them that I have said:"},{"header":"Jeremiah on Trial"},{"num":7,"verse":"The prophets, the priests, and everyone else in the temple heard what I said, "},{"num":8,"verse":"and as soon as I finished, they all crowded around me and started shouting, “Why did you preach that the Lord will destroy this temple, just as he destroyed Shiloh? Why did you say that Jerusalem will be empty and lie in ruins? You ought to be put to death for saying such things in the Lord’s name!” Then they had me arrested."},{"num":10,"verse":"The royal officers heard what had happened, and they came from the palace to the new gate of the temple to be the judges at my trial. "},{"num":11,"verse":"While they listened, the priests and the prophets said to the crowd, “All of you have heard Jeremiah prophesy that Jerusalem will be destroyed. He deserves the death penalty.”"},{"num":12,"verse":"Then I told the judges and everyone else:"},{"num":16,"verse":"The judges and the other people told the priests and prophets, “Since Jeremiah only told us what the Lord our God had said, we don’t think he deserves to die.”"},{"num":17,"verse":"Then some of the leaders from other towns stepped forward. They told the crowd that "},{"num":18,"verse":"years ago when Hezekiah was king of Judah, a prophet named Micah from the town of Moresheth had said:"},{"num":19,"verse":"Then the leaders continued:"},{"num":20,"verse":"After these leaders finished speaking, an important man named Ahikam son of Shaphan spoke up for me as well. And so, I wasn’t handed over to the crowd to be killed."},{"header":"Uriah the Prophet"}]