[{"header":"Jeremiah Is Arrested"},{"num":26,"verse":"Yahweh spoke his word when Judah’s King Jehoiakim, son of Josiah, began to rule. He said, "},{"num":2,"verse":"“This is what Yahweh says: Stand in the courtyard of Yahweh’s temple, and speak to all the people who come from the cities of Judah to worship in Yahweh’s temple. Tell them everything that I command you to tell them. Don’t leave out a single word. "},{"num":3,"verse":"Maybe they’ll listen, and they’ll turn from their evil ways. Then I’ll change my plan about the disaster I intend to bring on them because of the evil they have done.”"},{"num":4,"verse":"The Lord added, “Also say to them, ‘This is what Yahweh says: Suppose you don’t listen to me and don’t follow my teachings that I set in front of you. "},{"num":5,"verse":"Suppose you don’t listen to the words of my servants the prophets, whom I sent to you again and again, even though you didn’t listen. "},{"num":6,"verse":"Then I will do to this temple what I did to Shiloh. I will turn this city into something that will be cursed by all the nations on earth.’”"},{"num":7,"verse":"The priests, the prophets, and all the people heard Jeremiah speaking these things in Yahweh’s temple. "},{"num":8,"verse":"But as soon as Jeremiah finished saying everything that Yahweh had commanded him to say, the priests, the prophets, and all the people grabbed him and said, “You must die! "},{"num":9,"verse":"Why do you prophesy in Yahweh’s name that this temple will be like Shiloh and this city will become a pile of rubble with no one living here?” Then all the people crowded around Jeremiah in Yahweh’s temple."},{"num":10,"verse":"When the officials of Judah heard about these things, they went from the king’s palace to Yahweh’s temple. They sat at the entrance of New Gate to Yahweh’s temple. "},{"num":11,"verse":"Then the priests and the prophets said to the officials and all the people, “This man is condemned to die because he prophesied against this city as you yourselves have heard.”"},{"num":12,"verse":"Then Jeremiah said to all the officials and all the people, “Yahweh sent me to prophesy everything that you have heard me say against this temple and against this city. "},{"num":13,"verse":"Now, change your ways and what you are doing, and listen to Yahweh your Elohim. Then Yahweh will change his plan about the disaster that he intends to bring on you."},{"num":14,"verse":"“My life is in your hands. Do with me whatever you think is good and right. "},{"num":15,"verse":"But know for certain that if you put me to death, you, this city, and the people living in it will be guilty of killing an innocent person. Yahweh has certainly sent me to speak all these things to you.”"},{"num":16,"verse":"Then the officials and all the people said to the priests and prophets, “This man should not be condemned to die. He has spoken to us in the name of Yahweh our Elohim.”"},{"num":17,"verse":"Then some of the leaders in the land got up and said to the entire crowd, "},{"num":18,"verse":"“Micah from Moresheth prophesied at the time of Judah’s King Hezekiah and said to all the people of Judah, ‘This is what Yahweh Tsebaoth says:"},{"num":19,"verse":"Did Judah’s King Hezekiah and all the people of Judah put Micah to death? No! Hezekiah feared Yahweh and sought Yahweh’s favor. So Yahweh changed his plan about the disaster he intended to bring on them. But we are about to bring a bigger disaster on ourselves.”"},{"num":20,"verse":"There was another man prophesying in the name of Yahweh. His name was Uriah, son of Shemaiah, from Kiriath Jearim. He prophesied against this city and this land as Jeremiah did. "},{"num":21,"verse":"When King Jehoiakim and all his personal troops and officials heard what Uriah said, the king wanted to put him to death. But Uriah heard about it and fled in fear to Egypt. "},{"num":22,"verse":"King Jehoiakim sent soldiers to Egypt: Elnathan (son of Achbor) and other soldiers along with him. "},{"num":23,"verse":"They brought Uriah from Egypt and took him to King Jehoiakim. The king executed Uriah and threw his body into the burial ground for the common people. "},{"num":24,"verse":"Ahikam, son of Shaphan, supported Jeremiah. So Jeremiah was not handed over to the people to be put to death."}]