[{"header":"Chapter 21"},{"num":1,"verse":"Sacrifice for Untraceable Killing. If the body of a dead man is found lying on the ground of the land that the Lord, your God, has given you to possess, and it is not known who killed him,"},{"num":2,"verse":"have your elders and judges go out and measure the distance from the body to the neighboring towns."},{"num":3,"verse":"The elders of the town that is nearest to the body are to take a heifer that has never worked nor worn a yoke."},{"num":4,"verse":"The elders of that town will then lead it down to a valley with a flowing stream that has not been plowed nor planted. In that valley they are to slit the heifer’s throat."},{"num":5,"verse":"The priests, the sons of Levi, will then come forward, for the Lord, your God, has chosen them to minister to him and to pronounce blessings in the name of the Lord and to decide all disputes and cases of assault."},{"num":6,"verse":"The elders of the town that is nearest to the body will wash their hands over the heifer whose throat had been slit in the valley,"},{"num":7,"verse":"and they will proclaim, “Our hands have not shed this blood, nor have our eyes seen it shed."},{"num":8,"verse":"Accept this atonement for your people Israel, O Lord, whom you have redeemed, and do not hold your people responsible for the shedding of innocent blood.” This shall atone for the bloodshed."},{"num":9,"verse":"In this way you will have purged yourself of the guilt of shedding innocent blood, since you will have done what is right in the sight of the Lord."},{"num":10,"verse":"Marrying a Female Captive. When you go to war against your enemies and the Lord, your God, delivers them into your hands and you take them captive,"},{"num":11,"verse":"if you see a beautiful woman among them and you desire her, you can take her as your wife."},{"num":12,"verse":"Bring her into your house, and have her shave her head and trim her nails"},{"num":13,"verse":"and have her throw out the clothes she was wearing when she was taken captive. She is to live in your house for a full month and mourn her father and her mother. Then you may go to her and be her husband and she will be your wife."},{"num":14,"verse":"If you are not pleased with her, you are to let her go wherever she wishes. You are not to sell her or treat her like a slave, for you have already humbled her."},{"num":15,"verse":"Law of the Firstborn. If a man has two wives, and he loves one and dislikes the other, and they both bear him children, both the one who is loved and the one who is disliked, and the son of the one who is disliked is the firstborn,"},{"num":16,"verse":"then when he gives his inheritance to his sons, he is not to give the rights of the firstborn to the son of the woman he loves in preference to the true firstborn, the son of the woman he dislikes."},{"num":17,"verse":"He must acknowledge the son of the woman whom he disliked as the firstborn, giving him a double portion of everything that he owned. That son is the first sign of his strength, and the right of firstborn belongs to him."},{"num":18,"verse":"Punishing a Rebellious Son. If someone has a stubborn and rebellious son who will not listen to his father or his mother, and will not heed them even when he is disciplined,"},{"num":19,"verse":"then his father and mother are to take hold of him and bring him out to the elders at the town gate."},{"num":20,"verse":"They are to say to the town elders, “This son of ours is stubborn and rebellious. He will not listen to us. He is a glutton and a drunkard.”"},{"num":21,"verse":"Then all the men of that town will stone him to death. You must purge the evil from your midst. All of Israel will hear of it and be filled with fear."},{"num":22,"verse":"Burying a Criminal. If a man guilty of a capital offense is put to death and his body is hanging from a tree,"},{"num":23,"verse":"you are not to leave his body on the tree overnight. Be sure to bury him that day, for anyone who is hung from a tree is under God’s curse. You must not desecrate the land that the Lord, your God, is giving you as an inheritance."}]