[{"num":21,"verse":"If one be found slain in ha’adamah which Hashem Eloheicha giveth thee to possess it, lying in the sadeh, and it be not known who hath slain him;"},{"num":2,"verse":"Then thy zekenim and thy shofetim shall come forth, and they shall measure unto the towns which are round about him that is slain;"},{"num":3,"verse":"And it shall be, that the town which is next unto the slain man, even the zekenim of that town shall take a heifer, which hath not been worked with, and which hath not pulled the ol (yoke);"},{"num":4,"verse":"And the zekenim of that town shall bring down the heifer unto a wadi with running water, which is neither plowed nor sown, and shall break the heifer’s neck there in the wadi;"},{"num":5,"verse":"And the kohanim the Bnei Levi shall come near; for them Hashem Eloheicha hath chosen to minister unto Him, and to bless in the Shem of Hashem; and by their word shall every controversy and every assault be tried;"},{"num":6,"verse":"And all the zekenim of that town, that are next unto the slain man, shall wash their hands over the heifer whose neck was broken in the valley;"},{"num":7,"verse":"And they shall answer and say, Yadeinu (our hands) are not guilty of shefach dahm (shedding blood), neither have our eyes seen it."},{"num":8,"verse":"Kapper (atone), O Hashem, for Thy people Yisroel, whom Thou hast redeemed, and lay not dahm naki (innocent blood) unto the charge of Thy people Yisroel. And the shefach dahm shall be atoned for."},{"num":9,"verse":"So shalt thou put away the guilt of dahm naki from among you, when thou shalt do that which is right in the sight of Hashem."},{"header":"[KI TETZE]"},{"num":10,"verse":"When thou goest forth to milchamah against thine enemies, and Hashem Eloheicha hath delivered them into thine hands, and thou hast taken them captive,"},{"num":11,"verse":"And seest among the captives an eshet yefat to’ar (a woman who is beautiful of form), and hast a desire unto her, that thou wouldest have her to be thy wife;"},{"num":12,"verse":"Then thou shalt bring her home to thine bais, and she shall shave her rosh, and trim her nails;"},{"num":13,"verse":"And she shall put the raiment of her captivity from off her, and shall remain in thine bais, and mourn her av and her em a full month; and after that thou shalt go in unto her, and be her ba’al, and she shall be thy isha."},{"num":14,"verse":"And it shall be, if thou have no delight in her, then thou shalt let her go whither she will; but thou shalt not sell her at all for kesef, thou shalt not make merchandise of her, because thou hast humbled her."},{"num":15,"verse":"If an ish have two nashim, one beloved, and another hated, and they have born him banim, both the beloved and the hated; and if the bechor be hers that was hated;"},{"num":16,"verse":"Then it shall be, on the yom when he wills his possessions to his banim, that he may not make the ben of the beloved bechor before the ben of the hated, which is indeed the bechor;"},{"num":17,"verse":"But he shall acknowledge the ben of the hated for the bechor, by giving him a double portion of all that he hath; for he is the beginning of his strength; the mishpat habechorah (right of the firstborn) is his."},{"num":18,"verse":"If an ish have a stubborn and rebellious ben, which will not obey the voice of his av, or the voice of his em, and that, when they have chastened him, will not give heed unto them;"},{"num":19,"verse":"Then shall his av and his em lay hold on him, and bring him out unto the zekenim of his town, and unto the sha’ar (gate) of his place;"},{"num":20,"verse":"And they shall say unto the zekenim of his town, This our ben is stubborn and rebellious, he will not obey our voice; he is a zolel (glutton) and a soveh (drunkard)."},{"num":21,"verse":"And all the men of his town shall stone him with avanim (stones), that he die; so shalt thou put harah away from among you; and all Yisroel shall hear and fear."},{"num":22,"verse":"And if an ish have committed a chet (sin) mishpat mavet (worthy of death), and he is put to death, and thou hang him on an etz;"},{"num":23,"verse":"His nevelah shall not remain all night upon the etz, but thou shalt in any wise bury him that day; for he that is talui (hanged) is under Kilelat Elohim (curse of G-d); that thy adamah be not defiled, which Hashem Eloheicha giveth thee for a nachalah [see 2Sm 18:14; Yn 19:31; Ga 3:13]."}]