[{"num":21,"verse":"When the carrion of a man slain is found in the land which thy Lord God shall give to thee, and he that is guilty of his death is unknown, (When the corpse of a slain man is found in the land which the Lord thy God shall give to thee, and he who is guilty of his death is unknown,)"},{"num":2,"verse":"the greater men in birth and thy judges shall go out, and they shall mete from the place of the carrion the spaces of all the cities about; (the men of great age, that is, the elders, and the judges shall go out, and they shall measure the distance from the corpse to all the cities thereabouts;)"},{"num":3,"verse":"and which city they see to be nearer that carrion, than another, the elder men of that city shall take of [the] drove a cow calf, that hath not drawn yoke, neither hath cut the earth with a (plow)share; (and whichever city they see to be nearer to that corpse, than any other, the elders of that city shall take a cow calf from the herd, that hath not yet worn a yoke, nor hath cut the earth with a plowshare;)"},{"num":4,"verse":"and they shall lead that cow calf to a sharp stony valley, that was never eared, nor received seed; and in that valley they shall cut the head off the cow calf. (and they shall lead that cow calf to a valley of sharp stones, that was never plowed, nor received seed; and in that valley they shall cut off the head of the cow calf.)"},{"num":5,"verse":"And the priests, the sons of Levi, shall nigh, which thy Lord God chose, that they minister to him, and bless in his name, and all the cause shall hang at their word; and whatever thing is clean either unclean, be it deemed by them. (And the levitical priests shall come forth, whom the Lord thy God hath chosen to minister to him, and bless in his name, and all the cases shall hang on their words; and whatever thing is clean or unclean, shall be judged, or determined, by them.)"},{"num":6,"verse":"And the greater men in birth of that city shall come to the slain man, and they shall wash their hands on the cow calf, that was slain in the valley; (And the men of great age, that is, the elders, of the city that is nearest to the slain man shall come, and they shall wash their hands over the cow calf, that was killed in the valley;)"},{"num":7,"verse":"and they shall say, Our hands shed not out this blood, neither our eyes have seen who shed it."},{"num":8,"verse":"Lord, be merciful to thy people Israel, whom thou hast again-bought, and areckon thou not innocent blood in the midst of thy people Israel. And the guilt of blood shall be done away from them. (Lord, be merciful to thy people Israel, whom thou hast bought back, or hast redeemed, and put thou not the guilt of innocent blood on thy people Israel. And so the guilt for the innocent blood shall be done away from them.)"},{"num":9,"verse":"Forsooth thou shalt be alien, or unguilty, from the blood of the innocent which is shed, when thou hast done that that the Lord commanded. (And so thou shalt be free from any guilt for the innocent blood which is shed, when thou hast done what the Lord commanded.)"},{"num":10,"verse":"If thou goest out to battle against thine enemies, that thy Lord God betaketh them in thine hand, and thou leadest (back) prisoners, (When thou goest out to battle against thy enemies, and the Lord thy God delivereth them into thy hands, and thou takest some prisoners,)"},{"num":11,"verse":"and thou seest in the number of those prisoners a fair woman, and thou lovest her, and will have her to wife (and will have her for your wife),"},{"num":12,"verse":"thou shalt bring her into thine house; which woman shall shave her hair, and she shall cut her nails about, (thou shalt bring her into thy house; and this woman shall shave off her hair, and she shall pare her nails,)"},{"num":13,"verse":"and she shall put away the cloth, wherein she was taken, and she shall sit in thine house, and she shall beweep her father and her mother by a month (and she shall put away the clothes in which she was taken prisoner, and she shall sit in thy house, and she shall weep for her father and her mother for a full month); and afterward thou shalt enter to her, and thou shalt sleep with her, and she shall be thy wife."},{"num":14,"verse":"But if afterward she sitteth not in thy soul, that is, (if she) pleaseth not thy will, thou shalt deliver her free, neither thou shalt be able to sell her for money, neither oppress by power, for thou madest her low. (But if afterward she sitteth not right with thy soul, that is, if she pleaseth not thy will, thou shalt set her free, and thou shalt not be able to sell her for money, nor oppress her by force, for thou hast made her low.)"},{"num":15,"verse":"If a man hath two wives, one loved, and another hateful, and he begetteth of her free children, and the son of the odious wife is the first begotten, (If a man hath two wives, one loved, and the other hated, and he begetteth children with them, and the son of the hated wife is the first-born,)"},{"num":16,"verse":"and the father will part his chattel betwixt his sons, he shall not be able to make the son of the loved wife his first begotten son, and set him before the son of the hateful wife, (and the father will divide his possessions between his sons, he shall not be able to make the son of the loved wife his first-born son, and set him before the son of the hated wife,)"},{"num":17,"verse":"but he shall know the son of the hateful wife to be his first begotten son, and he shall give to that son all things double of those things that he hath; for this son is the beginning of his free children, and the first engendered things be due to him. (but he shall acknowledge the son of the hated wife to be his first-born son, and he shall give double to that son of all the things that he hath; for this son is the first of his children, and the rights of the first-born son be due to him.)"},{"num":18,"verse":"If a man beget a son (who is a) rebel, and a froward (boy), that heareth not the behest of his father and mother, and he is chastised, and despiseth to obey to them, (If a man beget a son who is rebellious, and froward, who obeyeth not his father or his mother, and after that he is chastised, he still despiseth to obey them,)"},{"num":19,"verse":"they shall take him, and lead him to the elder men of that city, and to the gate of doom, (or of judgement);"},{"num":20,"verse":"and they shall say to them, This our son is overthwart, and (a) rebel; he despiseth to hear our behests, or admonishings, he giveth attention to gluttonies, and to lechery, and to feasts. (and they shall say to them, Our son here is froward and rebellious; he despiseth to hear our commands, or our admonishments, and he only giveth attention to gluttonies, and to lechery, and to feasts.)"},{"num":21,"verse":"The people of the city shall oppress him with stones, and he shall die, (so) that ye do away evil from the midst of you, and that all Israel hear (of) it, and dread."},{"num":22,"verse":"When a man doeth a sin which is worthy to be punished by death, and he is deemed to (be put to) death, and is hanged in a gibbet (and is hanged on a gallows),"},{"num":23,"verse":"his carrion shall not dwell in the tree, but it shall be buried in the same day; for he that hangeth in the tree/for he that hangeth in the cross is cursed of God, and thou shalt not defoul thy land which thy Lord God gave thee into possession. (his corpse shall not remain on the gallows, but it shall be buried on the same day; for he who hangeth on a tree is cursed by God, and thou shalt not defile thy land which the Lord thy God shall give thee for a possession.)"}]