[{"header":"Abimelek"},{"num":9,"verse":"Abimelek son of Jerub-Baal went to Shechem, to his mother’s brothers. He spoke to them and to the house of his mother’s father saying, "},{"num":2,"verse":"“Please say in the hearing of all of the leaders of Shechem, ‘Which is better for you, to have all seventy sons of Jerub-Baal rule over you, or for one man to rule over you? Remember that I am your own flesh and bone.’ ”"},{"num":3,"verse":"So his mother’s brothers spoke all these things about him in the hearing of all the leaders of Shechem, and their hearts inclined toward Abimelek, for they said, “He is our brother.” "},{"num":4,"verse":"They gave him seventy silver coins from the temple of Baal-Berith. Abimelek hired unprincipled and undisciplined men, and they followed him. "},{"num":5,"verse":"He went to his father’s house at Ophrah and killed his brothers, the seventy sons of Jerub-Baal, on a single stone. Yet Jotham, the youngest son of Jerub-Baal, survived because he hid himself. "},{"num":6,"verse":"All the leaders of Shechem and everyone from Beth Millo gathered together by the oak near the pillar in Shechem to make Abimelek king."},{"num":7,"verse":"When Jotham heard this, he went and stood on the top of Mount Gerizim. He raised his voice and called out, saying to them, “Listen to me, leaders of Shechem, so that God may listen to you! "},{"num":8,"verse":"The trees once went out to anoint a king over them. They said to the olive tree, ‘Rule over us!’"},{"num":9,"verse":"“Yet the olive tree said to them, ‘Should I stop making oil, by which God and men are honored, to go and sway over the trees?’"},{"num":10,"verse":"“So the trees said to the fig tree, ‘You come and rule over us.’"},{"num":11,"verse":"“Yet the fig tree said to them, ‘Should I stop making my sweet aroma and my fruit, to go and sway over the trees?’"},{"num":12,"verse":"“So the trees said to the grapevine, ‘You come and rule over us.’"},{"num":13,"verse":"“Yet the grapevine said to them, ‘Should I stop making my fresh wine, which cheers God and men, to go and sway over the trees?’"},{"num":14,"verse":"“So the trees said to the thorn bush, ‘You come and rule over us.’"},{"num":15,"verse":"“The thorn bush said to the trees, ‘If you really want to anoint me king over you, then come and take refuge in my shade. If not, let fire come out from the thorn bush and consume the cedars of Lebanon!’"},{"num":16,"verse":"“Now then, did you show good faith and integrity when you made Abimelek king? Did you deal well with Jerub-Baal and his family? Did you do to him as his actions deserved, "},{"num":17,"verse":"considering that my father waged war for you, risked his life for you, and delivered you from the hands of Midian? "},{"num":18,"verse":"Yet you have taken a stand against my father’s family today. You killed his seventy sons, each on a single stone. You made Abimelek, son of his slave woman, king over the leaders of Shechem because he is your brother. "},{"num":19,"verse":"So if you did show good faith and integrity in what you did with Jerub-Baal and his family today, then rejoice in Abimelek, and may he also rejoice in you. "},{"num":20,"verse":"If not, let fire come out from Abimelek and consume the leaders of Shechem and Beth Millo, and let fire come out from the leaders of Shechem and from Beth Millo and consume Abimelek!”"},{"num":21,"verse":"Then Jotham ran away and fled. He went to Beer and lived there because of Abimelek his brother."},{"header":"The Downfall of Abimelek"},{"num":22,"verse":"After Abimelek ruled over Israel for three years, "},{"num":23,"verse":"God sent an evil spirit between Abimelek and the leaders of Shechem, and the leaders of Shechem dealt treacherously with Abimelek, "},{"num":24,"verse":"so that the violence done to the seventy sons of Jerub-Baal and their blood might come back upon Abimelek their brother, who killed them, and upon the leaders of Shechem, who empowered him to kill his brothers. "},{"num":25,"verse":"The leaders of Shechem set ambushes against him on the hilltops and robbed all who passed by them on the road. This was told to Abimelek."},{"num":26,"verse":"Gaal, the son of Ebed, and his brothers came to Shechem, and the leaders of Shechem trusted him. "},{"num":27,"verse":"They went out to the field, gathered and trod their grapes, and had a celebration. They went to the temple of their god and ate, drank, and cursed Abimelek. "},{"num":28,"verse":"Gaal son of Ebed said, “Who is Abimelek, and who is Shechem, that we should serve him? Is he not the son of Jerub-Baal, and is not Zebul his officer? Serve the sons of Hamor, the father of Shechem. Why should we serve Abimelek? "},{"num":29,"verse":"If only this people were under my command, I would get rid of Abimelek.” So he said to Abimelek, “Muster your army and come out!”"},{"num":30,"verse":"Then Zebul the city ruler heard the words of Gaal son of Ebed and he burned with anger. "},{"num":31,"verse":"He secretly sent messengers to Abimelek, saying, “Gaal, the son of Ebed, and his brothers have come to Shechem and are fortifying the city against you. "},{"num":32,"verse":"So now, get up at night, you and the people with you, and lie in wait in the field. "},{"num":33,"verse":"In the morning at sunrise, get up early and attack the city. He and the people with him will come out to you, then you can do to them as you find opportunity.”"},{"num":34,"verse":"So Abimelek and all the people who were with him got up at night and lay in wait by Shechem in four companies. "},{"num":35,"verse":"When Gaal son of Ebed went out and stood at the entrance of the city gate, then Abimelek and the people who were with him got up from their hiding places."},{"num":36,"verse":"Gaal saw these people and said to Zebul, “Look, people are coming down from the hilltops.”"},{"num":37,"verse":"Gaal spoke again and said, “Look, people are coming down the middle of the land, and a company is coming by way of the Diviner’s Oak.”"},{"num":38,"verse":"Then Zebul said to him, “Where is your mouth now, which said, ‘Who is Abimelek, that we should serve him?’ Are not these the people you dismissed out of hand? Go now, I pray, and fight against them.”"},{"num":39,"verse":"So Gaal went out before the leaders of Shechem and fought Abimelek. "},{"num":40,"verse":"Abimelek chased him, and Gaal fled from him. Many fell wounded at the entrance of the gate. "},{"num":41,"verse":"Abimelek stayed in Arumah, and Zebul drove out Gaal and his brothers from living in Shechem."},{"num":42,"verse":"The next day the people went out into the field, and this was told to Abimelek. "},{"num":43,"verse":"So he took the people and divided them into three companies, and they laid in wait in the field. When the people came out from the city, he rose up against them and struck them down. "},{"num":44,"verse":"Abimelek and the company that was with him rushed forward and stood at the entrance of the city gate. The two other combat units attacked everyone in the field and struck them down. "},{"num":45,"verse":"Abimelek fought against the city all that day. He captured the city and killed the people inside it; he tore down the city and spread salt over it."},{"num":46,"verse":"When the leaders of the Tower of Shechem heard this, they entered the fortified temple of El-Berith. "},{"num":47,"verse":"Abimelek was told that all the leaders of the Tower of Shechem had gathered together. "},{"num":48,"verse":"So Abimelek and all the people who were with him went up Mount Zalmon. He took an axe in his hand and cut off a tree branch, lifted it, and carried it on his shoulder. Then he said to the men who were with him, “What you have seen me do, hurry and do the same.” "},{"num":49,"verse":"So everyone likewise cut off a branch and followed Abimelek. They placed them on the fortification and set the fortification on fire over them. So all the people of the Tower of Shechem died, about a thousand men and women."},{"num":50,"verse":"Then Abimelek went to Thebez and encamped against Thebez and captured it. "},{"num":51,"verse":"But there was a fortified tower within the city, so all of the men and women and the leaders of the city fled there. They shut themselves in and went up to the top of the tower. "},{"num":52,"verse":"Abimelek came to the tower and fought against it. But as he drew near to the tower entrance to burn it with fire, "},{"num":53,"verse":"a certain woman dropped an upper millstone on the head of Abimelek, and it crushed his skull."},{"num":54,"verse":"Urgently he called to the young man who carried his gear and said to him, “Draw your sword and kill me, so that people may not say about me, ‘A woman killed him.’ ” So the young man pierced him through, and he died. "},{"num":55,"verse":"Then the men of Israel saw that Abimelek was dead, so everyone went home."},{"num":56,"verse":"Thus God repaid the wickedness of Abimelek, which he committed against his father by killing his seventy brothers. "},{"num":57,"verse":"God also repaid the evil deeds of the men of Shechem, and the curse of Jotham son of Jerub-Baal came upon them."}]