[{"header":"The Triumphal Entry"},{"num":11,"verse":"When they approached Jerusalem, at Bethphage and Bethany near the Mount of Olives, he sent two of his disciples "},{"num":2,"verse":"and told them, “Go into the village ahead of you. As soon as you enter it, you will find a colt tied there, on which no one has ever sat. Untie it and bring it. "},{"num":3,"verse":"If anyone says to you, ‘Why are you doing this?’ say, ‘The Lord needs it and will send it back here right away.’”"},{"num":4,"verse":"So they went and found a colt outside in the street, tied by a door. They untied it, "},{"num":5,"verse":"and some of those standing there said to them, “What are you doing, untying the colt?” "},{"num":6,"verse":"They answered them just as Jesus had said; so they let them go."},{"num":7,"verse":"They brought the colt to Jesus and threw their clothes on it, and he sat on it. "},{"num":8,"verse":"Many people spread their clothes on the road, and others spread leafy branches cut from the fields. "},{"num":9,"verse":"Those who went ahead and those who followed shouted:"},{"num":11,"verse":"He went into Jerusalem and into the temple. After looking around at everything, since it was already late, he went out to Bethany with the Twelve."},{"header":"The Barren Fig Tree Is Cursed"},{"num":12,"verse":"The next day when they went out from Bethany, he was hungry. "},{"num":13,"verse":"Seeing in the distance a fig tree with leaves, he went to find out if there was anything on it. When he came to it, he found nothing but leaves; for it was not the season for figs. "},{"num":14,"verse":"He said to it, “May no one ever eat fruit from you again!” And his disciples heard it."},{"header":"Cleansing the Temple"},{"num":15,"verse":"They came to Jerusalem, and he went into the temple and began to throw out those buying and selling. He overturned the tables of the money changers and the chairs of those selling doves, "},{"num":16,"verse":"and would not permit anyone to carry goods through the temple. "},{"num":17,"verse":"He was teaching them: “Is it not written, My house will be called a house of prayer for all nations? But you have made it a den of thieves!”"},{"num":18,"verse":"The chief priests and the scribes heard it and started looking for a way to kill him. For they were afraid of him, because the whole crowd was astonished by his teaching."},{"num":19,"verse":"Whenever evening came, they would go out of the city."},{"header":"The Barren Fig Tree Is Withered"},{"num":20,"verse":"Early in the morning, as they were passing by, they saw the fig tree withered from the roots up. "},{"num":21,"verse":"Then Peter remembered and said to him, “Rabbi, look! The fig tree that you cursed has withered.”"},{"num":22,"verse":"Jesus replied to them, “Have faith in God. "},{"num":23,"verse":"Truly I tell you, if anyone says to this mountain, ‘Be lifted up and thrown into the sea,’ and does not doubt in his heart, but believes that what he says will happen, it will be done for him. "},{"num":24,"verse":"Therefore I tell you, everything you pray and ask for—believe that you have received it and it will be yours. "},{"num":25,"verse":"And whenever you stand praying, if you have anything against anyone, forgive him, so that your Father in heaven will also forgive you your wrongdoing.”"},{"header":"The Authority of Jesus Challenged"},{"num":27,"verse":"They came again to Jerusalem. As he was walking in the temple, the chief priests, the scribes, and the elders came "},{"num":28,"verse":"and asked him, “By what authority are you doing these things? Who gave you this authority to do these things?”"},{"num":29,"verse":"Jesus said to them, “I will ask you one question; then answer me, and I will tell you by what authority I do these things. "},{"num":30,"verse":"Was John’s baptism from heaven or of human origin? Answer me.”"},{"num":31,"verse":"They discussed it among themselves: “If we say, ‘From heaven,’ he will say, ‘Then why didn’t you believe him?’ "},{"num":32,"verse":"But if we say, ‘Of human origin’”—they were afraid of the crowd, because everyone thought that John was truly a prophet. "},{"num":33,"verse":"So they answered Jesus, “We don’t know.”"}]