[[],[{"type":"header","content":"The Triumphal Entry"},{"type":"prose","content":"And as they *approached Jerusalem, at Bethphage and Bethany, near the Mount of Olives, He *sent two of His disciples,"}],[{"type":"prose","content":"and *said to them, "}],[{"type":"prose","content":"They went away and found a colt tied at the door, outside in the street; and they *untied it."}],[{"type":"prose","content":"And some of the bystanders were saying to them, “What are you doing, untying the colt?”"}],[{"type":"prose","content":"And they told them just as Jesus had said, and they gave them permission."}],[{"type":"prose","content":"They *brought the colt to Jesus and *put their cloaks on it; and He sat on it."}],[{"type":"prose","content":"And many people spread their cloaks on the road, and others  leafy branches which they had cut from the fields."}],[{"type":"prose","content":"And those who went in front and those who followed were shouting:"},{"type":"poetry","content":"“Hosanna!"},{"type":"poetry","content":";"}],[{"type":"poetry","content":"Blessed  the coming kingdom of our father David;"},{"type":"poetry","content":"Hosanna in the highest!”"}],[{"type":"prose","content":"And  entered Jerusalem  into the temple ; and after looking around at everything, He left for Bethany with the twelve, since it was already late."}],[{"type":"prose","content":"On the next day, when they had left Bethany, He became hungry."}],[{"type":"prose","content":"Seeing from a distance a fig tree in leaf, He went  if perhaps He would find anything on it; and when He came to it, He found nothing but leaves, for it was not the season for figs."}],[{"type":"prose","content":"And He said to it,  And His disciples were listening."}],[{"type":"header","content":"Jesus Drives Money Changers from the Temple"},{"type":"prose","content":"Then they *came to Jerusalem. And He entered the temple  and began to drive out those who were selling and buying on the temple , and He overturned the tables of the money changers and the seats of those who were selling doves;"}],[{"type":"prose","content":"and He would not allow anyone to carry merchandise through the temple ."}],[{"type":"prose","content":"And He  to teach and say to them, "}],[{"type":"prose","content":"And the chief priests and the scribes heard , and they  seeking how to put Him to death; for they were afraid of Him, because all the crowd was astonished at His teaching."}],[{"type":"prose","content":"And whenever evening came, they would leave the city."}],[{"type":"prose","content":"As they were passing by in the morning, they saw the fig tree withered from the roots ."}],[{"type":"prose","content":"And being reminded, Peter *said to Him, “Rabbi, look, the fig tree that You cursed has withered.”"}],[{"type":"prose","content":"And Jesus answered and *said to them, "}],[{"type":"prose","content":"[]"}],[{"type":"header","content":"Jesus’ Authority Questioned"},{"type":"prose","content":"And they *came again to Jerusalem. And as He was walking in the temple , the chief priests, the scribes, and the elders *came to Him,"}],[{"type":"prose","content":"and  saying to Him, “By what authority are You doing these things, or who gave You this authority to do these things?”"}],[{"type":"prose","content":"But Jesus said to them, "}],[{"type":"prose","content":"And they  considering  among themselves, saying, “If we say, ‘From heaven,’ He will say, ‘Then why did you not believe him?’"}],[{"type":"prose","content":"But should we say, ‘From men’?”—they were afraid of the people, for they all considered John to have been a real prophet."}],[{"type":"prose","content":"Answering Jesus, they *said, “We do not know.” And Jesus *said to them, "}]]