[{"header":"Plots against Nehemiah"},{"num":6,"verse":"Sanballat, Tobiah, Geshem, and our other enemies learned that I had completely rebuilt the wall. All I lacked was hanging the doors in the gates. "},{"num":2,"verse":"Then Sanballat and Geshem sent a message, asking me to meet with them in one of the villages in Ono Valley. I knew they were planning to harm me in some way. "},{"num":3,"verse":"So I sent messengers to tell them, “My work is too important to stop now and go there. I can’t afford to slow down the work just to visit with you.” "},{"num":4,"verse":"They invited me four times, but each time I refused to go."},{"num":5,"verse":"Finally, Sanballat sent an official to me with an unsealed letter, "},{"num":6,"verse":"which said:"},{"num":8,"verse":"I sent a message back to Sanballat, saying, “None of this is true! You are making it all up.”"},{"num":9,"verse":"Our enemies were trying to frighten us and to keep us from our work. But I asked God to give me strength."},{"num":10,"verse":"One day I went to visit Shemaiah. He was looking very worried, and he said, “Let’s hurry to the holy place of the temple and hide there. We will lock the temple doors, because your enemies are planning to kill you tonight.”"},{"num":11,"verse":"I answered, “Why should someone like me have to run and hide in the temple to save my life? I won’t go!”"},{"num":12,"verse":"Suddenly I realized that God had not given Shemaiah this message. But Tobiah and Sanballat had paid him to trick me "},{"num":13,"verse":"and to frighten me into doing something wrong, because they wanted to ruin my good name."},{"num":14,"verse":"Then I asked God to punish Tobiah and Sanballat for what they had done. I prayed that God would punish the prophet Noadiah and the other prophets who, together with her, had tried to frighten me."},{"header":"The Work Is Finished"},{"num":15,"verse":"On the twenty-fifth day of the month Elul, the wall was completely rebuilt. It had taken fifty-two days. "},{"num":16,"verse":"When our enemies in the surrounding nations learned that the work was finished, they felt helpless, because they knew that our God had helped us rebuild the wall."},{"num":17,"verse":"All this time the Jewish leaders and Tobiah had been writing letters back and forth. "},{"num":18,"verse":"Many people in Judah were loyal to Tobiah for two reasons: Shecaniah son of Arah was his father-in-law, and Tobiah’s son Jehohanan had married the daughter of Meshullam son of Berechiah. "},{"num":19,"verse":"The people would always tell me about the good things Tobiah had done, and then they would tell Tobiah everything I had said. So Tobiah kept sending letters, trying to frighten me."}]