[{"header":"Chapter 6"},{"num":1,"verse":"Plots Against Nehemiah. When it had been reported to Sanballat, Tobiah, Geshem the Arab, and our other enemies that I had rebuilt the wall and that there was no breach left in it (though up to that time I had not yet set up the doors in the gates), "},{"num":2,"verse":"Sanballat and Geshem sent me this message: “Come, let us hold council together at Chephirim in the plain of Ono.” They were planning to do me harm. "},{"num":3,"verse":"I sent messengers to them with this reply: “I am engaged in a great enterprise and am unable to come down. Why should the work stop, while I leave it to come down to you?” "},{"num":4,"verse":"Four times they sent me this same proposal, and each time I gave the same reply. "},{"num":5,"verse":"Then, the fifth time, Sanballat sent me the same message by one of his servants, who bore an unsealed letter "},{"num":6,"verse":"containing this text: “Among the nations it has been reported—Gashmu is witness to this—that you and the Jews are planning a rebellion; that for this reason you are rebuilding the wall; and that you are to be their king. "},{"num":7,"verse":"Also, that you have set up prophets in Jerusalem to proclaim you king of Judah. Now, since matters like these will reach the ear of the king, come, let us hold council together.” "},{"num":8,"verse":"I sent him this answer: “Nothing of what you report is happening; rather, it is the invention of your own mind.” "},{"num":9,"verse":"They were all trying to intimidate us, thinking, “They will be discouraged from continuing with the work, and it will never be completed.” But instead, I then redoubled my efforts."},{"num":10,"verse":"I went to the house of Shemaiah, son of Delaiah, son of Mehetabel, who was confined to his house, and he said: “Let us meet in the house of God, inside the temple building; let us lock the doors of the temple. For they are coming to kill you—by night they are coming to kill you.” "},{"num":11,"verse":"My answer was: “A man like me take flight? Should a man like me enter the temple to save his life? I will not go!” "},{"num":12,"verse":"For on consideration, it was plain to me that God had not sent him; rather, because Tobiah and Sanballat had bribed him, he voiced this prophecy concerning me, "},{"num":13,"verse":"that I might act on it out of fear and commit this sin. Then they would have had a shameful story with which to discredit me. "},{"num":14,"verse":"Keep in mind Tobiah and Sanballat, my God, because of these things they did; keep in mind as well Noadiah the woman prophet and the other prophets who were trying to intimidate me."},{"num":15,"verse":"Completion of the Work. The wall was finished on the twenty-fifth day of Elul; the work had taken fifty-two days. "},{"num":16,"verse":"When all our enemies had heard of this, and all the neighboring Gentiles round about had taken note of it, they were very discouraged, for they knew that it was with our God’s help that this work had been completed. "},{"num":17,"verse":"At that same time, however, many letters were going to Tobiah from the nobles of Judah, and Tobiah’s letters were reaching them, "},{"num":18,"verse":"for many in Judah were in league with him, since he was the son-in-law of Shecaniah, son of Arah, and his son Jehohanan had married the daughter of Meshullam, son of Berechiah. "},{"num":19,"verse":"They would praise his good deeds in my presence and relate to him whatever I said; and Tobiah sent letters trying to intimidate me."}]