[{"header":"The Day of the Lord"},{"num":2,"verse":"Blow a horn in Zion! Give the sound of danger on My holy mountain! Let all the people of the land shake in fear, for the day of the Lord is coming. The day is near. "},{"num":2,"verse":"It will be a day of darkness, a day of clouds and much darkness. A large and powerful army will come like darkness spreading over the mountains. There has never been anything like it, and there will never be anything like it again for all time to come. "},{"num":3,"verse":"Fire destroys in front of them and behind them. The land is like the garden of Eden in front of them, but a desert waste is left behind them. Nothing gets away from them. "},{"num":4,"verse":"They look like horses. They run like war horses. "},{"num":5,"verse":"As they jump on the tops of the mountains they sound like war-wagons. They sound like a fire burning up the dry grass, like a powerful army ready for battle. "},{"num":6,"verse":"Nations suffer in front of them. All faces turn white. "},{"num":7,"verse":"They run like strong men. They go over the wall like soldiers. They each walk straight on, and do not turn from their paths. "},{"num":8,"verse":"They do not push each other. Each one walks in his path. When they break through those who fight against them, their path is not changed. "},{"num":9,"verse":"They rush upon the city. They run on the wall. They go into the houses through the windows like a robber. "},{"num":10,"verse":"The earth shakes in front of them. The heavens shake. The sun and the moon become dark, and the stars stop shining. "},{"num":11,"verse":"The Lord thunders in front of His army. His army has too many to number. Those who obey His Word are powerful. The day of the Lord is very great and fills people with fear and wonder. Who can live through it?"},{"header":"A Call to Turn from Sin"},{"num":12,"verse":"“Yet even now,” says the Lord, “return to Me with all your heart, crying in sorrow and eating no food. "},{"num":13,"verse":"Tear your heart and not your clothes.” Return to the Lord your God, for He is full of loving-kindness and loving-pity. He is slow to anger, full of love, and ready to keep His punishment from you. "},{"num":14,"verse":"It may be that He will turn and have pity, and leave good behind for you. He may leave you a grain gift and a drink gift for the Lord your God. "},{"num":15,"verse":"Blow a horn in Zion. Set apart a time when no food will be eaten. Call together a holy meeting. "},{"num":16,"verse":"Gather the people and make them holy. Gather together the leaders, the children, and the nursing babies. Let the man to be married come out of his room, and the bride come out of her room. "},{"num":17,"verse":"Let the religious leaders who serve the Lord cry between the porch and the altar. Let them say, “Have pity on Your people, O Lord. Do not put your people to shame. And do not make the nations speak against them. Why should the people of the nations say, ‘Where is their God?’”"},{"header":"The Lord Gives Food Again"},{"num":18,"verse":"Then the Lord will be jealous for His land and have pity on His people. "},{"num":19,"verse":"The Lord will say to His people, “I am going to send you grain, new wine, and oil, and you will be filled with them. I will never again put you to shame among the nations. "},{"num":20,"verse":"I will take the army from the north far from you, and will drive it into a hot and dry land. The ones in front will be driven into the sea in the east. The ones in the back will be driven into the sea in the west. And a bad smell will rise up from their dead bodies. For He has done great things.”"},{"num":21,"verse":"Do not be afraid, O land. Have joy and be glad, for the Lord has done great things. "},{"num":22,"verse":"Do not be afraid, you animals of the field. For the fields of the desert have turned green and there is fruit on the trees. The fig trees and vines are full of fruit. "},{"num":23,"verse":"Be glad, O sons of Zion. Be happy in the Lord your God. For He has given the early rain to help you. He has poured down much rain for you, both fall and spring rains, as before. "},{"num":24,"verse":"The grain-floors will be full of grain, and the crushing-places will flow over with new wine and oil. "},{"num":25,"verse":"“I will pay you back for the years that your food was eaten by the flying locust, the jumping locust, the destroying locust, and the chewing locust, My large army which I sent among you. "},{"num":26,"verse":"You will have much to eat and be filled. And you will praise the name of the Lord your God, Who has done wonderful things for you. Then My people will never be put to shame. "},{"num":27,"verse":"You will know that I am in Israel. You will know that I am the Lord your God, and that there is no other. And My people will never be put to shame."},{"header":"God Sends His Spirit"},{"num":28,"verse":"“In the last days I will send My Spirit on all men. Then your sons and daughters will speak God’s Word. Your old men will dream dreams. Your young men will see special dreams. "},{"num":29,"verse":"Yes, on My servants, both men and women, I will pour out My Spirit in those days. "},{"num":30,"verse":"I will show powerful works in the heavens and on the earth, like blood and fire and clouds of smoke. "},{"num":31,"verse":"The sun will turn dark and the moon will turn to blood before the day of the Lord. His coming will be a great and troubled day. "},{"num":32,"verse":"It will be that whoever calls on the name of the Lord will be saved from the punishment of sin. For on Mount Zion and in Jerusalem some will be taken out of trouble, as the Lord has said. Those whom the Lord calls will be kept alive."}]