[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(34) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the Philistines’ land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Abimelech on returning to Gerar is said to have gone back “into the land of the Philistines!’ But Beer-sheba also in a general way belonged to his dominions, and Abraham dwelt there in peace by reason of the treaty which existed between him and the Philistine king.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:22-34 Abimelech felt sure that the promises of God would be fulfilled to Abraham. It is wise to connect ourselves with those who are blessed of God; and we ought to requite kindness to those who have been kind to us. Wells of water are scarce and valuable in eastern countries. Abraham took care to have his title to the well allowed, to prevent disputes in future. No more can be expected from an honest man than that he be ready to do right, as soon as he knows he has done wrong. Abraham, being now in a good neighbourhood, stayed a great while there. There he made, not only a constant practice, but an open profession of his religion. There he called on the name of the Lord, as the everlasting God; probably in the grove he planted, which was his place of prayer. Abraham kept up public worship, in which his neighbours might join. Good men should do all they can to make others so. Wherever we sojourn, we must neither neglect nor be ashamed of the worship of Jehovah.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Returned unto the land of the Philistines. - Beer-sheba was on the borders of the land of the Philistines. Going therefore to Gerar, they returned into that land. In the transactions with Hagar and with Abimelek, the name God is employed, because the relation of the Supreme Being with these parties is more general or less intimate than with the heir of promise. The same name, however, is used in reference to Abraham and Sarah, who stand in a twofold relation to him as the Eternal Potentate, and the Author of being and blessing. Hence, the chapter begins and ends with Yahweh, the proper name of God in communion with man. \"Eshel is a field under tillage\" in the Septuagint, and a tree in Onkelos. It is therefore well translated a grove in the King James Version, though it is rendered \"the tamarisk\" by many. The planting of a grove implies that Abraham now felt he had a resting-place in the land, in consequence of his treaty with Abimelek. He calls upon the name of the Lord with the significant surname of the God of perpetuity, the eternal, unchangeable God. This marks him as the \"sure and able\" performer of his promise, as the everlasting vindicator of the faith of treaties, and as the infallible source of the believer's rest and peace. Accordingly, Abraham sojourned in the land of the Philistines many days. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - Abraham Was Tested",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. מריה  morı̂yâh, \"Moriah\"; Samaritan: מוראה  môr'âh; \"Septuagint,\" ὑψηλή  hupsēlē, Onkelos, \"worship.\" Some take the word to be a simple derivative, as the Septuagint and Onkelos, meaning \"vision, high, worship.\" It might mean \"rebellious.\" Others regard it as a compound of יה  yâh, \"Jah, a name of God,\" and מראה  mı̂r'eh, \"shown,\" מורה  môreh, \"teacher,\" or מורא  môrā', \"fear.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14. יראה  yı̂r'ēh, \"Jireh, will provide.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16, נאם  ne'um, ῥῆμα  rēma, \"dictum, oracle; related: speak low.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21. בוּז  bûz, \"Buz, scoffing.\" קמוּאל  qemû'ēl, \"Qemuel, gathered of God.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22. חזו  chăzô, \"Chazo, vision.\" פלדשׁ  pı̂ldâsh, \"Pildash, steelman? wanderer?\" ידלף  yı̂dlâp, \"Jidlaph; related: trickle, weep.\" בתוּאל  betû'ēl, \"Bethuel, dwelling of God.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23. רבקה  rı̂bqâh, \"Ribqah, noose.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24. ראוּמה  re'ûmâh, \"Reumah, exalted.\" טבה  ṭebach, \"Tebach, slaughter.\" גחם  gacham, \"Gacham, brand.\" תחשׁ  tachash, \"Tachash, badger or seal.\" <מעכה  ma‛ăkâh, \"Ma'akah; related: press, crush.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The grand crisis, the crowning event in the history of Abraham, now takes place. Every needful preparation has been made for it. He has been called to a high and singular destiny. With expectant acquiescence he has obeyed the call. By the delay in the fulfillment of the promise, he has been taught to believe in the Lord on his simple word. Hence, as one born again, he has been taken into covenant with God. He has been commanded to walk in holiness, and circumcised in token of his possessing the faith which purifieth the heart. He has become the intercessor and the prophet. And he has at length become the parent of the child of promise. He has now something of unspeakable worth, by which his spiritual character may be thoroughly tested. Since the hour in which he believed in the Lord, the features of his resemblance to God have been shining more and more through the darkness of his fallen nature - freedom of resolve, holiness of walk, interposing benevolence, and paternal affection. The last prepares the way for the highest point of moral likeness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Verse 1-19",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God tests Abraham's unreserved obedience to his will. \"The God.\" The true, eternal, and only God, not any tempter to evil, such as the serpent or his own thoughts. \"Tempted Abraham.\" To tempt is originally to try, prove, put to the test. It belongs to the dignity of a moral being to be put to a moral probation. Such assaying of the will and conscience is worthy both of God the assayer, and of man the assayed. \"Thine only one.\" The only one born of Sarah, and heir of the promise. \"Whom thou lovest.\" An only child gathers round it all the affections of the parent's heart. \"The land of Moriah.\" This term, though applied in 2 Chronicles 3:1 to the mount on which the temple of Solomon was built, is here the name of a country, containing, it may be, a range of mountains or other notable place to which it was especially appropriated. Its formation and meaning are very doubtful, and there is nothing in the context to lend us any aid in its explanation. It was evidently known to Abraham before he set out on his present journey. It is not to be identified with Moreh in Genesis 12:6, as the two names occur in the same document, and, being different in form, they naturally denote different things. Moreh is probably the name of a man. Moriah probably refers to some event that had occurred in the land, or some characteristic of its inhabitants. If a derivative, like בריה  porı̂yâh, \"fruitful,\" it may mean the land of the rebellious, a name not inapposite to any district inhabited by the Kenaanites, who were disposed to rebellion themselves Genesis 14:4, or met with rebellion from the previous inhabitants. If a compound of the divine name, Jah, whatever be the other element, it affords an interesting trace of the manifestation and worship of the true God under the name of Jab at some antecedent period. The land of Moriah comprehended within its range the population to which Melkizedec ministered as priest.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God tests Abraham's unreserved obedience to his will. \"The God.\" The true, eternal, and only God, not any tempter to evil, such as the serpent or his own thoughts. \"Tempted Abraham.\" To tempt is originally to try, prove, put to the test. It belongs to the dignity of a moral being to be put to a moral probation. Such assaying of the will and conscience is worthy both of God the assayer, and of man the assayed. \"Thine only one.\" The only one born of Sarah, and heir of the promise. \"Whom thou lovest.\" An only child gathers round it all the affections of the parent's heart. \"The land of Moriah.\" This term, though applied in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the mount on which the temple of Solomon was built, is here the name of a country, containing, it may be, a range of mountains or other notable place to which it was especially appropriated. Its formation and meaning are very doubtful, and there is nothing in the context to lend us any aid in its explanation. It was evidently known to Abraham before he set out on his present journey. It is not to be identified with Moreh in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as the two names occur in the same document, and, being different in form, they naturally denote different things. Moreh is probably the name of a man. Moriah probably refers to some event that had occurred in the land, or some characteristic of its inhabitants. If a derivative, like בריה  porı̂yâh, \"fruitful,\" it may mean the land of the rebellious, a name not inapposite to any district inhabited by the Kenaanites, who were disposed to rebellion themselves ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or met with rebellion from the previous inhabitants. If a compound of the divine name, Jah, whatever be the other element, it affords an interesting trace of the manifestation and worship of the true God under the name of Jab at some antecedent period. The land of Moriah comprehended within its range the population to which Melkizedec ministered as priest.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And offer him for a burnt-offering. - Abraham must have felt the outward inconsistency between the sacrifice of his son, and the promise that in him should his seed be called. But in the triumph of faith he accounted that God was able to raise him up, even from the dead. On no other principle can the prompt, mute, unquestioning obedience of Abraham be explained. Human sacrifice may have been not unknown; but this in no way met the special difficulty of the promise. The existence of such a custom might seem to have smoothed away the difficulty of a parent offering the sacrifice of a son. But the moral difficulty of human sacrifice is not so removed. The only solution of this, is what the ease itself actually presents; namely, the divine command. It is evident that the absolute Creator has by right entire control over his creatures. He is no doubt bound by his eternal rectitude to do no wrong to his moral creatures. But the creature in the present case has forfeited the life that was given, by sin. And, moreover, we cannot deny that the Almighty may, for a fit moral purpose, direct the sacrifice of a holy being, who should eventually receive a due recompense for such a degree of voluntary obedience. This takes away the moral difficulty, either as to God who commands, or Abraham who obeys. Without the divine command, it is needless to say that it was not lawful for Abraham to slay his son.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Upon one of the hills of which I will tell thee. - This form of expression dearly shows that Moriah was not at that time the name of the particular hill on which the sacrifice was to be offered. It was the general designation of the country in which was the range of hills on one of which the solemn transaction was to take place. \"And Abraham rose up early in the morning.\" There is no hesitation or lingering in the patriarch. If this has to be done, let it be done at once.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Upon one of the hills of which I will tell thee. - This form of expression dearly shows that Moriah was not at that time the name of the particular hill on which the sacrifice was to be offered. It was the general designation of the country in which was the range of hills on one of which the solemn transaction was to take place. \"And Abraham rose up early in the morning.\" There is no hesitation or lingering in the patriarch. If this has to be done, let it be done at once.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34. Abraham sojourned in the Philistines' land—a picture of pastoral and an emblem of Christian life.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Abraham sojourned in the Philistines' land many days. Even many years, days being sometimes put for years; having entered into covenant with Abimelech, the king of the country, and settled a good correspondence with him, and having his friendship and good will, which commanded respect from his subjects, Abraham sojourned very quietly and comfortably for many years, chiefly at Beersheba; the Jewish writers say (a) he sojourned here twenty six years. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Jarchi & Bereshit Rabba, sect. 54. fol. 48. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Jarchi & Bereshit Rabba, sect. 54. fol. 48. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Abraham sojourned in the Philistines' land many days.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 34.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Abraham sojourned in the Philistines' land many days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The apparent contradiction between the statement of this verse and that of Ver. 32 may be removed by supposing either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that as the land of the Philistines had no fixed boundary toward the desert, Beersheba may at this time have been claimed for the kingdom of Gerar (Keil); or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that as Beersheba was situated on the confines of the Philistines' territory, Abraham must frequently have sojourned in their country while pasturing his flocks (Rosenmüller). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 21:34",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abraham sojourned a long time there in the Philistines' land. There Isaac was probably born, and grew up to be a young man (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), capable of carrying the wood for a sacrifice; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The expression \"in the land of the Philistines\" appears to be at variance with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Abimelech and Phicol are said to have returned to the land of the Philistines. But the discrepancy is easily reconciled, on the supposition that at that time the land of the Philistines had no fixed boundary, at all events, towards the desert. Beersheba did not belong to Gerar, the kingdom of Abimelech in the stricter sense; but the Philistines extended their wanderings so far, and claimed the district as their own, as is evident from the fact that Abimelech's people had taken the well from Abraham. On the other hand, Abraham with his numerous flocks would not confine himself to the Wady es Seba, but must have sought for pasture-ground in the whole surrounding country; and as Abimelech had given him full permission to dwell in his land (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he would still, as heretofore, frequently come as far as Gerar, so that his dwelling at Beersheba (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") might be correctly described as sojourning (nomadizing) in the land of the Philistines. ",
        "children": []
      }
    ]
  }
]