[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy terribleness hath deceived thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The substantive does not occur elsewhere. Etymo-logically it may mean “terror of,” or “object of terror;” but a cognate word is found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the sense of an “idol,” probably of the Phallic or Priapus type, and that is probably the meaning. Such an idol is called scornfully the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "horror ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of Edom, just as the God of Israel was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the fear of Isaac” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). So Milton speaks of Chemosh as the “obscene ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dread ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of Moab’s sons” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Par. Lost, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I. 406.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O thou that dwellest in the clefts of the rock.—Better, perhaps, in the fortresses of Sela. The words describe with a wonderful vividness the aspect of the rock-fortresses of Edom, the cities built into a ravine. The remains of Petra (the Sela of 2Kings 14:7; Isaiah 16:1), commonly referred to as illustrating this description, are, it must be remembered, of Roman origin; but there can be little doubt that it occupied the site of an earlier city, and that there were other fortresses, even more like the eagle’s nest, perched upon the summit of the crags. In Job 39:27-30 we have a picture of the eagle’s nest drawn by a writer who was probably familiar with these rock fortresses.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "O thou that dwellest in the clefts of the rock.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, perhaps, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "in the fortresses of Sela. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The words describe with a wonderful vividness the aspect of the rock-fortresses of Edom, the cities built into a ravine. The remains of Petra (the Sela of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), commonly referred to as illustrating this description, are, it must be remembered, of Roman origin; but there can be little doubt that it occupied the site of an earlier city, and that there were other fortresses, even more like the eagle’s nest, perched upon the summit of the crags. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:27-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we have a picture of the eagle’s nest drawn by a writer who was probably familiar with these rock fortresses.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "49:7-22 The Edomites were old enemies to the Israel of God. But their day is now at hand; it is foretold, not only to warn them, but for the sake of the Israel of God, whose afflictions were aggravated by them. Thus Divine judgments go round from nation to nation; the earth is full of commotion, and nothing can escape the ministers of Divine vengeance. The righteousness of God is to be observed amidst the violence of men.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Edom's \"terribleness\" consisted in her cities being hewn in the sides of inaccessible rocks, from where she could suddenly descend for predatory warfare, and retire to her fastnesses without fear of reprisals.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The clefts of the rock - Or, the fastnesses of Sela, the rock-city, Petra (see Isaiah 16:1).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The clefts of the rock - Or, the fastnesses of Sela, the rock-city, Petra (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The hill - i. e., Bozrah.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The hill - i. e., Bozrah.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. terribleness—the terror which thou didst inspire into others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "deceived thee—rendered thee proudly confident, as if none would dare to assail thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "dwellest in … rock—Petra, the chief of Idumea, was cut in the rocks; its ruins are very remarkable. The whole south of Idumea abounds in cave dwellings and rocks.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "though … nest … eagle—(Job 39:27; Ob 3, 4). The eagle builds its nest in the highest craggy eyry.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy terribleness hath deceived thee, and the pride of thine heart:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Obadiah in his prophecy against Edom useth much the same expressions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Obadiah 1:3,4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word that is here used being of the number of those which are but once found in Scripture, hath given interpreters liberty to abound in their senses of it; some translating it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "arrogance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", some, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thine idol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the best interpreters understand by it their terribleness to others, their being so potent that others were all afraid of them; this deceived them, making them to conclude themselves secure, and out of danger; to which is also added the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pride",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the heart. The country of Edom being mountainous, they are said to ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "dwell in the clefts of the rocks, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, in places impregnable, and inaccessible as they thought, in the heights of the hill. But the Lord lets them know no place was to his power inaccessible or impregnable, for if they dwell as ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "high as the eagle, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which the Scripture tells us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 39:27,28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "maketh her nest on high, and dwelleth and abideth upon the rock, upon the crag of the rock",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", yet he would bring them down. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thy terribleness hath deceived thee, and the pride of thine heart,.... Some render it, \"thine idol\" (o); see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which, being terrible to them, they thought it might be so to others, and protect them. In the place referred to the word \"miphlezeth\" is used, and comes from the same root with this, which signifies to be terrible and formidable, and cause to tremble, as the idols of the Gentiles were to their worshippers, and others. The Vulgate Latin version of the above place interprets it of Priapus, which was an idol set up in gardens to frighten birds and thieves from coming thither (p). So Kimchi observes, that some interpret it here of idolatrous worship or superstition; but it is to be understood either of the roughness and terribleness of their country, abounding with rocks and mountains, which made it inaccessible; or rather of that terror which they struck into their neighbouring nations, by their wealth and riches, their power and strength, their courage and valour, and skill in military affairs; and having such strong cities, fortresses, and fastnesses, natural and artificial, of which they were proud; and, on account of all which, fancied that none would dare to invade them; or, if they did, their attempts would be fruitless; and this deceived them, making them careless and secure: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O thou that dwellest in the clefts of the rock; the land of Idumea being very hilly and rocky. Jerom (q) says, who lived near it, that all the southern part of Idumea, from Eleutheropolis to Petra and Hailah, had their habitations in caves cut out of rocks: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that holdest the height of the hill; that dwelt on the tops of hills and mountains, and in towers and fortified places built upon them, as Kimchi and Ben Melech; who think respect is had particularly to Mount Seir. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"for thou art like to an eagle that dwells in the clefts of the rock, whose high habitation is inn strong place;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hence it follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "though thou shouldest make thy nest as high as the eagle, I will bring thee down from thence, saith the Lord; signifying, though they might think themselves as safe and as much out of the reach of men as an eagle's nest, and were as high and as secure in their own imaginations; yet they should be come at by their enemies, be fetched out of their strong holds, and reduced to the lowest and most miserable state and condition; of which they might be assured, since the Lord had spoken it, who would do it by the hand of the Chaldeans. The allusion to the eagle is very pertinent to illustrate the self-exaltation and self-security of the Edomites; the eagle being a bird that flies higher than any other, as Kimchi on the place observes, even up to the clouds, and out of sight; hence Homer (r) calls it the high flying eagle; and which builds its nest in high places, in the tops of rocks; so Aristotle (s) says, they make their nests, not in plains, but in high places, especially in cragged rocks; and Pliny (t) relates that they build their nests in rocks; and he also says (u) of the vultures, who seem to be meant by the eagles in Matthew 24:28; that they build their nests in the highest rocks, and which no man can reach. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "though thou shouldest make thy nest as high as the eagle, I will bring thee down from thence, saith the Lord; signifying, though they might think themselves as safe and as much out of the reach of men as an eagle's nest, and were as high and as secure in their own imaginations; yet they should be come at by their enemies, be fetched out of their strong holds, and reduced to the lowest and most miserable state and condition; of which they might be assured, since the Lord had spoken it, who would do it by the hand of the Chaldeans. The allusion to the eagle is very pertinent to illustrate the self-exaltation and self-security of the Edomites; the eagle being a bird that flies higher than any other, as Kimchi on the place observes, even up to the clouds, and out of sight; hence Homer (r) calls it the high flying eagle; and which builds its nest in high places, in the tops of rocks; so Aristotle (s) says, they make their nests, not in plains, but in high places, especially in cragged rocks; and Pliny (t) relates that they build their nests in rocks; and he also says (u) of the vultures, who seem to be meant by the eagles in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; that they build their nests in the highest rocks, and which no man can reach. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) \"simulacrum tuum\", Pagninus, Vatablus; \"idolum\", Grotius. So R. Sol. Urbin Ohel Moed, fol. 12. 1.((p) \"--------Deus, inde ego furum, aviumque Maxima formido.\" Horat. Sermon. l. 1. Satyr. 8. ver. 3, 4. \"Et custos furum atque avium cum falce saligna Hellespontiaci servet tutela Priapi\". Virgil. Georgic. l. 4. ver. 110, 111. (q) Comment. in Obad. fol. 52. C. (r) Iliad. 22. v. 308. (s) De Hist. Animal. l. 9. c. 32. (t) Nat. Hist. l. 10. c. 3.((u) Ibid. c. 6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) \"simulacrum tuum\", Pagninus, Vatablus; \"idolum\", Grotius. So R. Sol. Urbin Ohel Moed, fol. 12. 1.((p) \"--------Deus, inde ego furum, aviumque Maxima formido.\" Horat. Sermon. l. 1. Satyr. 8. ver. 3, 4. \"Et custos furum atque avium cum falce saligna Hellespontiaci servet tutela Priapi\". Virgil. Georgic. l. 4. ver. 110, 111. (q) Comment. in Obad. fol. 52. C. (r) Iliad. 22. v. 308. (s) De Hist. Animal. l. 9. c. 32. (t) Nat. Hist. l. 10. c. 3.((u) Ibid. c. 6. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thy terribleness hath deceived thee, and the pride of thine heart, O thou that dwellest in the clefts of the rock, that holdest the height of the hill: though thou shouldest make thy nest as high as the eagle, I will bring thee down from thence, saith the LORD.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As for thy terribleness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The text is probably corrupt, but no certain emendation has been suggested. If it stands, we must take the sense to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O thy trembling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. either (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") how wilt thou tremble at the greatness of thy fall! or (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") how will the lookers on tremble at the horror of this sight! The Hebrew noun is absent from Ob. and is not found elsewhere.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the rock",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] mg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sela",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Sela was perhaps identical with Petra, which “lay in an amphitheatre of mountains, accessible only through the narrow gorge, called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sik",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", winding in with precipitous sides from the W.; and the mountain sides round Petra, and the ravines about it, contain innumerable rock-hewn cavities, some being tombs, but others dwellings, in which the ancient inhabitants lived.” Dr. See also G. A. Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Book of the Twelve Prophets",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", II. 179. Petra was fifty miles S. of the Dead Sea.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the eagle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thy terribleness.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is certainly the best rendering of this ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἅπαξ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "λεγόμενον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The \"terribleness\"  of Edom consisted in the fact that the other nations shrank from disturbing her in her rocky fastness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the clefts of the rock.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Probably with an allusion to the rock city Sela, or Petra (\"rock\"); as perhaps in \"the height of the hill\" to the situation of Bozrah; see on ver. 13 (Graf). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As the eagle.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not any eagle is meant, but the griffon (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Gypsfulvus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or great vulture (Tristram). Jeremiah 49:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The nature and occasion of the judgment decreed. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"I have heard tidings from Jahveh, and a messenger has been sent among the nations: Gather yourselves together, and go against her, and arise to the battle! ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For, behold, I have made thee small among the nations, despised among men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thy terribleness hath deceived thee, the pride of thy heart, O thou that dwellest in the hiding-places of the rock, that holdest the height of the hill. Though thou makest thy nest high like the eagle, thence will I bring thee down, saith Jahveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And Edom shall become an astonishment; every passer-by shall be astonished at her, and shall hiss at all her plagues. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As [it was in] the overthrow of Sodom and Gomorrah, saith Jahveh, no man shall dwell there, nor shall a son of man sojourn there.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This judgment will immediately take place. The nations who are to make Edom small and despised have been already summoned by the Lord to the war. Jeremiah has taken this idea from Obadiah 1:1, Obadiah 1:2. The subject in \"I have heard\" is the prophet, who has heard the information from Jahveh. In Obadiah is found the plural, \"we have heard,\" because the prophet includes himself among the people; this is to show that the news serves as a consolation to Israel, because Edom shall be punished for his crimes committed against Judah. This view was not before the mind of Jeremiah; with him the prevailing representation is, that judgment, from which Edom cannot be excepted, is passed upon all nations. Therefore he has chosen the singular, \"I have heard.\" In the succeeding clause the perf. Pual שׁלּח has been changed into שׁלוּח, as the more usual form. The messenger is to be considered as having been sent by the Lord for the purpose of summoning the nations to war, as he actually does in the second hemistich. The message agrees, in the nature of its contents, with Obadiah 1:1; but Jeremiah has dealt somewhat freely with its form. The statement with regard to the object of the war, Jeremiah 49:15, agrees pretty exactly with Obadiah 1:2. The account, too, which is given of the cause of the judgment, i.e., the guilt of Edom arising from his trusting in the impregnable character of his habitation, is derived from Obadiah 1:3, Obadiah 1:4. Jeremiah has intensified the idea by the additional use of תּפלצתּך, but has also made certain limitations of the expression by omitting some clauses found in Obadiah. The word just named is ἅπ. λεγ., and has been variously explained. The verb פּלץ occurs only in Job 9:6, with the meaning of quaking, trembling; and the noun פּלּצוּת pretty frequently in the sense of fear, shuddering, horror; further, מפלצת is used in 1 Kings 15:13; 2 Chronicles 15:16, of an idol, monster, object of horror. Hence Rabbinical writers have been inclined to understand תּפלצת as meaning idolatry; in this they are followed by J. D. Michaelis, Meier, and Ngelsbach. The last-named writer translates, \"Thy monster (idol) led thee astray.\" But even though this meaning were better established from the use of language than it is, yet the mention of idolatry, or even of an idol, is quite unsuitable in this passage. The lxx render ἡ παιγνία σου i.e., risus or jocus tuus, Chald. טפשׁוּתך, \"thy folly,\" - evidently a mere guess from the context. The best ascertained translation is, \"Thy terror,\" i.e., the terror which thou dost inspire, or the fear of thee, \"hath misled thee, the pride of thine heart,\" so that \"the pride,\" etc., forms an apposition to \"thy terror.\" The combination of the fem. תּפלצתּך with the verb השּׁיא in the masc. is not decisive against this. Following the example of Schleussner (O arrogantiam tuam), Hitzig and Graf would take the word as an exclamation, \"Terror to thee! horror on thee!\" and thy point for support to הפכּכם, Isaiah 29:16. But an exclamation is out of place here, and incompatible with the derivation of the following words from Obadiah. Since Jeremiah appropriates from Obadiah the thought, \"thy pride hath misled thee,\" תּפלצתּך may possibly be meant as a mere intensification of זדוי לבּך. The pride of Edom increased because the other nations were afraid to make war on him in his rocky dwelling, so difficult of access. On שׂכני בּחגוי הסּלע, see on Obadiah 1:3. The succeeding apposition-clause מרום שׁבתּו, found in Obadiah, is modified by Jeremiah into תּפשׂי מרום גּבעה otni , \"thou that seizest, or holdest (as in Jeremiah 40:10), the height of the hill.\" In the expression חגוי there is perhaps implied an allusion to the rock-city סלע, or Petra, in the Wady Musa (see on 2 Kings 14:7), and in מרום גּבעה ni dn another allusion to Bozrah, which lay on a hill; see on Jeremiah 49:13. On Jeremiah 49:16, cf. Obadiah 1:4. Jeremiah has omitted the hyperbolic addition, \"among the stars.\" In Jeremiah 49:17 and Jeremiah 49:18 the devastation of Edom is further portrayed. On Jeremiah 49:17, cf. Jeremiah 25:11, Jeremiah 25:38; with 17b agrees Jeremiah 19:8, almost word for word. The comparison with Sodom, etc., is a reminiscence from Deuteronomy 29:22, and is repeated in the prophecy concerning Babylon, 50:40; cf. Isaiah 13:19; Amos 4:11. \"Her neighbours\" are Admah and Zeboim, Deuteronomy 29:22; Hosea 11:8. The comparison with Sodom is not so to be understood as if it indicated that Edom shall be destroyed in the same manner as Sodom; it is merely stated that the land of Edom shall become a desert waste, like the region of the Dead Sea, uninhabited, and with no human beings in it; cf. Jeremiah 49:33 and Jeremiah 50:40.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This judgment will immediately take place. The nations who are to make Edom small and despised have been already summoned by the Lord to the war. Jeremiah has taken this idea from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The subject in \"I have heard\" is the prophet, who has heard the information from Jahveh. In Obadiah is found the plural, \"we have heard,\" because the prophet includes himself among the people; this is to show that the news serves as a consolation to Israel, because Edom shall be punished for his crimes committed against Judah. This view was not before the mind of Jeremiah; with him the prevailing representation is, that judgment, from which Edom cannot be excepted, is passed upon all nations. Therefore he has chosen the singular, \"I have heard.\" In the succeeding clause the perf. Pual שׁלּח has been changed into שׁלוּח, as the more usual form. The messenger is to be considered as having been sent by the Lord for the purpose of summoning the nations to war, as he actually does in the second hemistich. The message agrees, in the nature of its contents, with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but Jeremiah has dealt somewhat freely with its form. The statement with regard to the object of the war, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", agrees pretty exactly with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The account, too, which is given of the cause of the judgment, i.e., the guilt of Edom arising from his trusting in the impregnable character of his habitation, is derived from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jeremiah has intensified the idea by the additional use of תּפלצתּך, but has also made certain limitations of the expression by omitting some clauses found in Obadiah. The word just named is ἅπ. λεγ., and has been variously explained. The verb פּלץ occurs only in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with the meaning of quaking, trembling; and the noun פּלּצוּת pretty frequently in the sense of fear, shuddering, horror; further, מפלצת is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 15:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 15:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of an idol, monster, object of horror. Hence Rabbinical writers have been inclined to understand תּפלצת as meaning idolatry; in this they are followed by J. D. Michaelis, Meier, and Ngelsbach. The last-named writer translates, \"Thy monster (idol) led thee astray.\" But even though this meaning were better established from the use of language than it is, yet the mention of idolatry, or even of an idol, is quite unsuitable in this passage. The lxx render ἡ παιγνία σου i.e., risus or jocus tuus, Chald. טפשׁוּתך, \"thy folly,\" - evidently a mere guess from the context. The best ascertained translation is, \"Thy terror,\" i.e., the terror which thou dost inspire, or the fear of thee, \"hath misled thee, the pride of thine heart,\" so that \"the pride,\" etc., forms an apposition to \"thy terror.\" The combination of the fem. תּפלצתּך with the verb השּׁיא in the masc. is not decisive against this. Following the example of Schleussner (O arrogantiam tuam), Hitzig and Graf would take the word as an exclamation, \"Terror to thee! horror on thee!\" and thy point for support to הפכּכם, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But an exclamation is out of place here, and incompatible with the derivation of the following words from Obadiah. Since Jeremiah appropriates from Obadiah the thought, \"thy pride hath misled thee,\" תּפלצתּך may possibly be meant as a mere intensification of זדוי לבּך. The pride of Edom increased because the other nations were afraid to make war on him in his rocky dwelling, so difficult of access. On שׂכני בּחגוי הסּלע, see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The succeeding apposition-clause מרום שׁבתּו, found in Obadiah, is modified by Jeremiah into תּפשׂי מרום גּבעה otni , \"thou that seizest, or holdest (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 40:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the height of the hill.\" In the expression חגוי there is perhaps implied an allusion to the rock-city סלע, or Petra, in the Wady Musa (see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and in מרום גּבעה ni dn another allusion to Bozrah, which lay on a hill; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". On ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jeremiah has omitted the hyperbolic addition, \"among the stars.\" In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the devastation of Edom is further portrayed. On ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; with 17b agrees ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 19:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", almost word for word. The comparison with Sodom, etc., is a reminiscence from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 29:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and is repeated in the prophecy concerning Babylon, 50:40; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 13:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 4:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Her neighbours\" are Admah and Zeboim, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 29:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The comparison with Sodom is not so to be understood as if it indicated that Edom shall be destroyed in the same manner as Sodom; it is merely stated that the land of Edom shall become a desert waste, like the region of the Dead Sea, uninhabited, and with no human beings in it; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      }
    ]
  }
]