[{"num":21,"verse":"The Davar which came unto Yirmeyah from Hashem, when HaMelech Tzidkiyah sent unto him Pashchur Ben Malkiyah, and Tzephanyah Ben Ma’aseiyah the kohen, saying,"},{"num":2,"verse":"Inquire, now, of Hashem for us; for Nevuchadretzar Melech Bavel maketh war against us; if it be so that Hashem will deal with us according to all His nifle’ot (wondrous deeds), that he may withdraw from us."},{"num":3,"verse":"Then said Yirmeyah unto them, Thus shall ye say to Tzidkiyah;"},{"num":4,"verse":"Thus saith Hashem Elohei Yisroel; Hineni, I will turn back against you the weapons of milchamah (war) that are in your hands, wherewith ye fight against Melech Bavel, and against the Kasdim (Chaldeans), which besiege you outside the chomah (wall), and I will assemble them inside this city."},{"num":5,"verse":"And I Myself will fight against you with an outstretched yad (hand) and with a zero’a chazakah (strong arm), even in anger, and in chemah, and in ketzef gadol (great wrath)."},{"num":6,"verse":"And I will strike down the inhabitants of this city, both ha’adam and habehemah; they shall die of dever gadol (great plague)."},{"num":7,"verse":"And afterward, saith Hashem, I will deliver Tzidkiyah Melech Yehudah, and his avadim, and HaAm, and such as are survivors in this city from dever, from the cherev, and from the ra’av (famine), into the yad Nevuchadretzar Melech Bavel, and into the yad of their oyevim (enemies), and into the yad of those that seek their nefesh; and he shall strike them down with the edge of the cherev; he shall not spare them, neither have pity, nor have rachamim."},{"num":8,"verse":"And unto this people thou shalt say, Thus saith Hashem; Hineni, I set before you the Derech HaChayyim and the Derech HaMavet."},{"num":9,"verse":"He that abideth in this city shall die by cherev, and by ra’av (famine), and by dever (plague); but he that goeth out, and falleth to the Kasdim (Chaldeans) that besiege you, he shall live, and his nefesh shall be unto him as plunder."},{"num":10,"verse":"For I have set my face against this city for ra’ah, and not for tovah, saith Hashem; it shall be given into the yad Melech Bavel, and he shall set eish to it to burn it down."},{"num":11,"verse":"And touching the Bais Melech Yehudah, say, Hear ye the Devar Hashem;"},{"num":12,"verse":"O Bais Dovid, thus saith Hashem; Execute mishpat in the boker, and save him that is robbed out of the yad oshek (hand of the oppressor), lest My chemah (fury) go out like eish, and burn that none can quench it, because of the wickedness of your deeds."},{"num":13,"verse":"Hineni, I am against thee, O inhabitant of the emek (valley), and tzur (rock) of the plain, saith Hashem; which say, Who shall come down against us? Or who shall enter into our me’onot (dwelling places, homes)?"},{"num":14,"verse":"But I will visit you in punishment according to the p’ri (fruit) of your deeds, saith Hashem; and I will kindle an eish in the ya’ar (forest) thereof, and it shall devour all things round about it."}]