[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(25) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Pharaoh called for Moses.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Pharaoh suffered from the kakerlaque equally with his subjects, or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "more",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " than his subjects. It was “upon him,” inflicting its painful bites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); it was “upon his palaces” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), destroying his rich and magnificent furniture; it was upon his lands, ravaging and devastating them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He therefore gave way before this plague almost at once, and without waiting for any remonstrance on the part of the magicians or others, “called for Moses.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the land.—Pretending to grant the request made of him, Pharaoh mars all by this little clause. A three days’ journey into the wilderness had been demanded from the first (Exodus 5:3), and no less could be accepted.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "In the land.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Pretending to grant the request made of him, Pharaoh mars all by this little clause. A three days’ journey into the wilderness had been demanded from the first (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 5:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and no less could be accepted.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:20-32 Pharaoh was early at his false devotions to the river; and shall we be for more sleep and more slumber, when any service to the Lord is to be done? The Egyptians and the Hebrews were to be marked in the plague of flies. The Lord knows them that are his, and will make it appear, perhaps in this world, certainly in the other, that he has set them apart for himself. Pharaoh unwillingly entered into a treaty with Moses and Aaron. He is content they should sacrifice to their God, provided they would do it in the land of Egypt. But it would be an abomination to God, should they offer the Egyptian sacrifices; and it would be an abomination to the Egyptians, should they offer to God the objects of the worship of the Egyptians, namely, their calves or oxen. Those who would offer acceptable sacrifice to God, must separate themselves from the wicked and profane. They must also retire from the world. Israel cannot keep the feast of the Lord, either among the brick-kilns or among the flesh-pots of Egypt. And they must sacrifice as God shall command, not otherwise. Though they were in slavery to Pharaoh, yet they must obey God's commands. Pharaoh consents for them to go into the wilderness, provided they do not go so far but that he might fetch them back again. Thus, some sinners, in a pang of conviction, part with their sins, yet are loth they should go very far away; for when the fright is over, they will turn to them again. Moses promised the removal of this plague. But let not Pharaoh deal deceitfully any more. Be not deceived; God is not mocked: if we think to cheat God by a sham repentance and a false surrender of ourselves to him, we shall put a fatal cheat upon our own souls. Pharaoh returned to his hardness. Reigning lusts break through the strongest bonds, and make men presume and go from their word. Many seem in earnest, but there is some reserve, some beloved, secret sin. They are unwilling to look upon themselves as in danger of everlasting misery. They will refrain from other sins; they do much, give much, and even punish themselves much. They will leave it off sometimes, and, as it were, let their sin depart a little way; but will not make up their minds to part with all and follow Christ, bearing the cross. Rather than that, they venture all. They are sorrowful, but depart from Christ, determined to keep the world at present, and they hope for some future season, when salvation may be had without such costly sacrifices; but, at length, the poor sinner is driven away in his wickedness, and left without hope to lament his folly.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To your God - Pharaoh now admits the existence and power of the God whom he had professed not to know; but, as Moses is careful to record, he recognizes Him only as the national Deity of the Israelites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the land - i. e. in Egypt, not beyond the frontier. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the land - i. e. in Egypt, not beyond the frontier. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25-32. Pharaoh called for Moses, … Go ye, sacrifice to your God in the land, &c.—Between impatient anxiety to be freed from this scourge and a reluctance on the part of the Hebrew bondsmen, the king followed the course of expediency; he proposed to let them free to engage in their religious rites within any part of the kingdom. But true to his instructions, Moses would accede to no such arrangement; he stated a most valid reason to show the danger of it, and the king having yielded so far as to allow them a brief holiday across the border, annexed to this concession a request that Moses would entreat with Jehovah for the removal of the plague. He promised to do so, and it was removed the following day. But no sooner was the pressure over than the spirit of Pharaoh, like a bent bow, sprang back to its wonted obduracy, and, regardless of his promise, he refused to let the people depart.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He and his people not being able to endure this plague of flies any longer; and we read in profane history of such creatures being so troublesome, that people have been obliged to quit their habitations, and seek for new ones; so Pausanias (t) relates of the inhabitants of Myus, that such a number of flies rose out of the lake, that the men were obliged to leave the city, and go to Miletus; so Aelian (u) reports, that the inhabitants of Megara were driven from thence by a multitude of flies, as were the inhabitants of Phaselis by wasps, which creatures also might be in this mixture of insects: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, go ye, sacrifice to your God in the land; that is, in the land of Goshen, in the place where they were; he was willing to allow them the liberty of sacrificing to their God, which it seems they had before; but then he would not consent they should go out of the land to do it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Achaica, sive l. 7. p. 400. (u) De Animal. l. 11. c. 28. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Achaica, sive l. 7. p. 400. (u) De Animal. l. 11. c. 28. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Pharaoh called for Moses and for Aaron, and said, Go ye, sacrifice to your God in the land.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. in Egypt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "25–29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Pharaoh, as before (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 8), entreats for a removal of the plague. At first he will only give permission for the Israelites to hold their festival in Egypt; but afterwards, in consequence of Moses’ representations, he grants leave for a journey of three days in the wilderness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 25-32.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The fourth plague moves the Pharaoh more than any preceding one. He still cannot bring himself to grant the demand of Moses; but he offers a compromise. The Israelites shall have a respite from their toils, and be permitted to hold their festival, and offer the needful sacrifices in Egypt (ver. 25). When this offer is for good reasons not accepted, he yields even further - he will let the people go and sacrifice ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in the wilderness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - only they must not \"go far away\"(ver. 28). Having made this promise, he obtains for the second time the intercession of Moses and the discontinuance of the plague in consequence of it. But then, as before, when he saw that there was respite (ver. 15), he retracted his promise, hardened himself, and refused to allow the people to quit Egypt (ver. 32). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 25.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in Egypt within the limits of my dominions, so that I may not lose sight of you - far less run the risk of losing you altogether. Exodus 8:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This plague, by which the land was destroyed (תּשּׁחת), or desolated, inasmuch as the flies not only tortured, \"devoured\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the men, and disfigured them by the swellings produced by their sting, but also killed the plants in which they deposited their eggs, so alarmed Pharaoh that he sent for Moses and Aaron, and gave them permission to sacrifice to their God \"in the land.\" But Moses could not consent to this restriction. \"It is not appointed so to do\" (נכון does not mean aptum, conveniens, but statutum, rectum), for two reasons: (1) because sacrificing in the land would be an abomination to the Egyptians, and would provoke them most bitterly (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and (2) because they could only sacrifice to Jehovah their God as He had directed them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The abomination referred to did not consist in their sacrificing animals which the Egyptians regarded as holy. For the word תּועבה (abomination) would not be applicable to the sacred animals. Moreover, the cow was the only animal offered in sacrifice by the Israelites, which the Egyptians regarded as sacred. The abomination would rather be this, that the Iran would not carry out the rigid regulations observed by the Egyptians with regard to the cleanness of the sacrificial animals (vid., Hengstenberg, p. 114), and in fact would not observe the sacrificial rites of the Egyptians at all. The Egyptians would be very likely to look upon this as an insult to their religion and their gods; \"the violation of the recognised mode of sacrificing would be regarded as a manifestation of contempt for themselves and their gods\" (Calvin), and this would so enrage them that they would stone the Israelites. The הן before נזבּח in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the interjection lo! but it stands before a conditional clause, introduced without a conditional particle, in the sense of if, which it has retained in the Chaldee, and in which it is used here and there in the Hebrew (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      }
    ]
  }
]