[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:20-32 Pharaoh was early at his false devotions to the river; and shall we be for more sleep and more slumber, when any service to the Lord is to be done? The Egyptians and the Hebrews were to be marked in the plague of flies. The Lord knows them that are his, and will make it appear, perhaps in this world, certainly in the other, that he has set them apart for himself. Pharaoh unwillingly entered into a treaty with Moses and Aaron. He is content they should sacrifice to their God, provided they would do it in the land of Egypt. But it would be an abomination to God, should they offer the Egyptian sacrifices; and it would be an abomination to the Egyptians, should they offer to God the objects of the worship of the Egyptians, namely, their calves or oxen. Those who would offer acceptable sacrifice to God, must separate themselves from the wicked and profane. They must also retire from the world. Israel cannot keep the feast of the Lord, either among the brick-kilns or among the flesh-pots of Egypt. And they must sacrifice as God shall command, not otherwise. Though they were in slavery to Pharaoh, yet they must obey God's commands. Pharaoh consents for them to go into the wilderness, provided they do not go so far but that he might fetch them back again. Thus, some sinners, in a pang of conviction, part with their sins, yet are loth they should go very far away; for when the fright is over, they will turn to them again. Moses promised the removal of this plague. But let not Pharaoh deal deceitfully any more. Be not deceived; God is not mocked: if we think to cheat God by a sham repentance and a false surrender of ourselves to him, we shall put a fatal cheat upon our own souls. Pharaoh returned to his hardness. Reigning lusts break through the strongest bonds, and make men presume and go from their word. Many seem in earnest, but there is some reserve, some beloved, secret sin. They are unwilling to look upon themselves as in danger of everlasting misery. They will refrain from other sins; they do much, give much, and even punish themselves much. They will leave it off sometimes, and, as it were, let their sin depart a little way; but will not make up their minds to part with all and follow Christ, bearing the cross. Rather than that, they venture all. They are sorrowful, but depart from Christ, determined to keep the world at present, and they hope for some future season, when salvation may be had without such costly sacrifices; but, at length, the poor sinner is driven away in his wickedness, and left without hope to lament his folly.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Three days' journey - See the ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25-32. Pharaoh called for Moses, … Go ye, sacrifice to your God in the land, &c.—Between impatient anxiety to be freed from this scourge and a reluctance on the part of the Hebrew bondsmen, the king followed the course of expediency; he proposed to let them free to engage in their religious rites within any part of the kingdom. But true to his instructions, Moses would accede to no such arrangement; he stated a most valid reason to show the danger of it, and the king having yielded so far as to allow them a brief holiday across the border, annexed to this concession a request that Moses would entreat with Jehovah for the removal of the plague. He promised to do so, and it was removed the following day. But no sooner was the pressure over than the spirit of Pharaoh, like a bent bow, sprang back to its wonted obduracy, and, regardless of his promise, he refused to let the people depart.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Pharaoh said, I will let you go, that ye may sacrifice to the Lord your God in the wilderness,.... He does not say three days, though as he allowed them to go into the wilderness and sacrifice, they could not go and come again in less time; nor would Moses have accepted of the grant, as it seems by what follows he had, if he had obliged them to less time: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "only you shall not go very far away; his meaning is, as Aben Ezra observes, that they should go no further than three days' journey; he was jealous that this was only an excuse to get entirely out of his dominions, and never return more. He might have heard of their claim to the land of Canaan, and of their talk, and hope, and expectation, of going and settling there; and so understood this motion of theirs, to have leave to go into the wilderness for three days, to sacrifice to the Lord, was only a pretence; that their real intention was to proceed on in their journey to Canaan; however, being in this great distress, he made as if he was willing to grant what they desired, and very importunately urged they would pray he might be delivered from this plague: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "entreat for me; the words seem to be spoken in haste, and with great eagerness and vehemence. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "entreat for me; the words seem to be spoken in haste, and with great eagerness and vehemence. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Pharaoh said, I will let you go, that ye may sacrifice to the LORD your God in the wilderness; only ye shall not {h} go very far away: intreat for me.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Pharaoh said, I will let you go, that ye may sacrifice to the LORD your God in the wilderness; only ye shall not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " go very far away: intreat for me.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) So the wicked instruct God's messengers how far they may go.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Pharaoh recognises the force of Moses’ argument, and grants the required permission: they are only not to go very far away.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Only ye shall not go very far away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here for the first time Pharaoh shows his real objection to letting the Israelites go - he is afraid that they will escape him. So he suggests the compromise, that they shall just enter the wilderness on his eastern border, remaining near the frontier, and therefore within his reach. Moses seems to have made no objection to this proviso. As Kalisch says, \"he committal himself entirely to the guidance and direction of God.\" The three days' journey which he had requested by Divine command (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") would not take him far beyond the Egyptian frontier. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Entreat for me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare ver. 8. An abbreviated form is now used, as sufficiently intelligible. Exodus 8:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "These reasons commended themselves to the heathen king from his own religious standpoint. He promised, therefore, to let the people go into the wilderness and sacrifice, provided they did not go far away, if Moses and Aaron would release him and his people from this plague through their intercession. Moses promised that the swarms should be removed the following day, but told the king not to deceive them again as he had done before (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But Pharaoh hardened his heart as soon as the plague was taken away, just as he had done after the second plague (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to which the word \"also\" refers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 8:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]