[[],[{"type":"header","content":"David Made King over Judah"},{"type":"prose","content":"So it happened after this that David inquired of the LORD, saying, “Shall I go up into one of the cities of Judah?” And the LORD said to him, “Go up.” David asked, “Where shall I go?” And He said, “To Hebron.” "}],[{"type":"prose","content":"So David went up there [to Hebron] with his two wives also, Ahinoam of Jezreel and Abigail the widow of Nabal of Carmel [in Judah]. "}],[{"type":"prose","content":"And David brought up his men who were with him, each one with his household; and they lived in the cities of Hebron. "}],[{"type":"prose","content":"Then the men of Judah came and there they anointed David king over the house of Judah.Then they told David, “It was the men of Jabesh-gilead who buried Saul.” "}],[{"type":"prose","content":"So David sent messengers to the men of Jabesh-gilead, and said to them, “May you be blessed by the LORD because you showed this graciousness  loyalty to Saul your lord (king), and buried him. "}],[{"type":"prose","content":"Now may the LORD show lovingkindness and truth  faithfulness to you. I too will show this goodness to you, because you have done this thing. "}],[{"type":"prose","content":"So now, let your hands be strong and be valiant; for your lord Saul is dead, and also the house of Judah has anointed me king over them.”"}],[{"type":"header","content":"Ish-bosheth Made King over Israel"},{"type":"prose","content":"Now [Saul’s cousin] Abner the son of Ner, commander of Saul’s army, had taken Ish-bosheth the son of Saul and brought him over to Mahanaim. "}],[{"type":"prose","content":"He made him king over Gilead, over the Ashurites, over Jezreel, over Ephraim, over Benjamin, even over all Israel [except Judah]. "}],[{"type":"prose","content":"Ish-bosheth, Saul’s son, was forty years old when he became king over Israel, and he reigned for two years. But the house of Judah followed David. "}],[{"type":"prose","content":"And the time that David was king in Hebron over the house of Judah was seven years and six months."}],[{"type":"header","content":"Civil War"},{"type":"prose","content":"Now Abner the son of Ner and the servants of Ish-bosheth the son of Saul went out from Mahanaim to Gibeon. "}],[{"type":"prose","content":"Joab [David’s nephew] the son of Zeruiah and the servants of David also went out and met them by the pool of Gibeon. They sat down, with one group on one side of the pool and the other group on the other side of the pool. "}],[{"type":"prose","content":"Then Abner said to Joab, “Let the young men now stand and have a contest before us.” And Joab said, “Let them stand.” "}],[{"type":"prose","content":"So they stood up and went over by number, twelve for Benjamin and Ish-bosheth the son of Saul, and twelve of the servants of David. "}],[{"type":"prose","content":"Each one of them seized his opponent by the head and  his sword into his opponents side; so they fell down together. Therefore that place was called Helkath-hazzurim [that is, the Field of Sides], which is in Gibeon. "}],[{"type":"prose","content":"There was a very fierce battle that day, and Abner and the men of Israel were beaten before the servants of David."}],[{"type":"prose","content":"Three sons of Zeruiah [the half sister of David] were there: Joab, Abishai, and Asahel. Now Asahel was as light  swift-footed as one of the [wild] gazelles in the field. "}],[{"type":"prose","content":"Asahel pursued Abner and did not turn to the right or to the left as he followed him. "}],[{"type":"prose","content":"Then Abner looked behind him and said, “Is that you, Asahel?” He answered, “It is I.” "}],[{"type":"prose","content":"So Abner said to him, “Turn to your right or to your left, and grab one of the young men and take his armor for yourself.” But Asahel was not willing to turn away from pursuing Abner. "}],[{"type":"prose","content":"Abner repeated again, “Turn away from following me. Why should I have to strike you to the ground? How would I be able to face Joab your brother [and look him in the eye]?” "}],[{"type":"prose","content":"But Asahel refused to turn away; so Abner struck him in the abdomen with the butt end of his spear, and the spear came out his back; and he fell there and died on that spot. And it came about that everyone who came to the place where Asahel fell and died, stood still [and reflected]."}],[{"type":"prose","content":"But Joab and Abishai [Asahel’s brothers] pursued Abner. When the sun was going down, they came to the hill of Ammah, which is in front of Giah on the way to the wilderness of Gibeon. "}],[{"type":"prose","content":"And the sons of [the tribe of] Benjamin gathered together behind Abner and became one troop, and took their stand on the top of a hill. "}],[{"type":"prose","content":"Then Abner called to Joab, “Must the sword devour forever? Do you not know that it will be bitter in the end? How long [will it be] before you tell the people to stop pursuing their brothers?” "}],[{"type":"prose","content":"Joab said, “As God lives, if you had not spoken, then the people certainly would have stopped pursuing their brothers in the morning.” "}],[{"type":"prose","content":"So Joab blew the trumpet; and all the people halted and no longer pursued Israel, nor did they fight anymore. "}],[{"type":"prose","content":"Then Abner and his men went through the Arabah (desert region) all that night, crossed the Jordan, went through Bithron and walked the whole morning and came to Mahanaim [where Ish-bosheth ruled Israel]."}],[{"type":"prose","content":"Joab returned from pursuing Abner; and when he had gathered all the people together, nineteen of David’s servants were missing, besides Asahel. "}],[{"type":"prose","content":"But the servants of David had struck down many of Benjamin and Abner’s men;  three hundred and sixty men died. "}],[{"type":"prose","content":"And they picked up [the body of] Asahel and buried him in the tomb of his father in Bethlehem. Then Joab and his men walked all night and they arrived in Hebron at daybreak."}]]