[{"header":"David Reigns in Hebron"},{"num":2,"verse":"After this, David asked the Lord, “Should I go up into one of the cities of Judah?”"},{"num":2,"verse":"So David went there with his two wives, Ahinoam of Jezre’el and Abigail of Carmel, who was Nabal’s widow. "},{"num":3,"verse":"David also brought along the men who were with him, each man together with his household, and they settled in the towns around Hebron."},{"num":4,"verse":"The men of Judah came there and anointed David to be king over the house of Judah."},{"num":5,"verse":"So David sent messengers to the men of Jabesh Gilead and said to them, “You are blessed by the Lord because you performed this act of mercy and faithfulness for your master Saul by burying him. "},{"num":6,"verse":"Now may the Lord deal with you with mercy and faithfulness. I also will treat you well because you have done this. "},{"num":7,"verse":"Now let your hands be strong and courageous, for your master Saul is dead, and the house of Judah has anointed me to be king over them.”"},{"num":8,"verse":"However, Abner son of Ner, the commander of Saul’s army, had taken Ishbosheth, the son of Saul, to Mahanaim "},{"num":9,"verse":"and made him king over Gilead, Ashuri, and Jezre’el, and over Ephraim, Benjamin, and all Israel. "},{"num":10,"verse":"Ishbosheth, Saul’s son, was forty years old when he became king over Israel, and he reigned for two years."},{"num":11,"verse":"David was king in Hebron over the house of Judah for seven years and six months."},{"num":12,"verse":"Abner son of Ner and the followers of Ishbosheth son of Saul went out from Mahanaim to Gibeon. "},{"num":13,"verse":"Joab son of Zeruiah and the followers of David went out and confronted them at the pool of Gibeon. They took up positions on the opposite sides of the pool."},{"num":14,"verse":"Abner said to Joab, “The young men should get up and compete in front of us.”"},{"num":15,"verse":"So twelve representatives for Benjamin and Ishbosheth son of Saul got up and crossed over to confront twelve representatives for David. "},{"num":16,"verse":"Each one grabbed his opponent’s head and thrust his sword into his side. Together, they all fell. So that place, which is near Gibeon, was called Helkath Hatsurim. "},{"num":17,"verse":"A fierce battle took place that day. Abner and the men of Israel were beaten by the followers of David."},{"num":18,"verse":"Three sons of Zeruiah were there, namely, Joab, Abishai, and Asahel. Asahel was a fast runner, like one of the gazelles out in the fields. "},{"num":19,"verse":"Asahel pursued Abner and did not turn aside to the right or to the left from his pursuit."},{"num":20,"verse":"Abner looked behind him and said, “Is that you, Asahel?”"},{"num":21,"verse":"Abner said to him, “Turn to your right hand or to your left and capture one of the young men for yourself and strip off his equipment for yourself.” But Asahel would not turn aside."},{"num":22,"verse":"So Abner warned him again, “Turn aside. Stop following me. Why should I strike you to the ground? How could I face Joab your brother?” "},{"num":23,"verse":"But Asahel refused to turn aside, so Abner struck him in the stomach with the pointed butt of his spear. The spear came out his back, and he fell down and died right there. Everyone stopped and just stood there when they came to the place where Asahel had fallen and died."},{"num":24,"verse":"But Joab and Abishai keep pursuing Abner. The sun was going down when they came to the hill of Ammah in front of Giah, on the way to the wilderness of Gibeon. "},{"num":25,"verse":"The Benjaminites rallied together behind Abner, joined in one formation, and took their stand on the top of one hill."},{"num":26,"verse":"Abner called to Joab, “Will the sword continue to devour? Do you not know that it will be bitter when all this is over? How long will you delay telling the people to stop pursuing their brothers?”"},{"num":27,"verse":"Joab said, “As God lives, if you had not spoken, surely it would have been morning before the people would have given up pursuing their brothers.” "},{"num":28,"verse":"So Joab blew the ram’s horn, and all the people stopped pursuing Israel. They did not continue to fight."},{"num":29,"verse":"Abner and his men traveled through the Arabah all that night. They crossed the Jordan, marched through the entire region of Bithron, and came to Mahanaim."},{"num":30,"verse":"Joab returned from pursuing Abner and gathered together all his troops. Besides Asahel, nineteen of David’s men were missing. "},{"num":31,"verse":"The followers of David had struck dead three hundred sixty of Abner’s men from the tribe of Benjamin. "},{"num":32,"verse":"The men of Judah picked up Asahel and buried him in the tomb of his father at Bethlehem."}]