[[],[{"type":"header","content":"The Fifth Trumpet—the Bottomless Pit"},{"type":"prose","content":"Then the fifth angel sounded [his trumpet], and I saw a star (angelic being) that had fallen from heaven to the earth; and the key of the bottomless pit (abyss) was given to him (the star-angel). "}],[{"type":"prose","content":"He opened the bottomless pit, and smoke like the smoke of a great furnace flowed out of the pit; and the sun and the atmosphere were darkened by the smoke from the pit. "}],[{"type":"prose","content":"Then out of the smoke came locusts upon the earth, and power [to hurt] was given to them, like the power which the earth’s scorpions have. "}],[{"type":"prose","content":"They were told not to hurt the grass of the earth, nor any green thing, nor any tree, but [to hurt] only the people who do not have the seal (mark of ownership, protection) of God on their foreheads. "}],[{"type":"prose","content":"They were not permitted to kill anyone, but to torment  cause them extreme pain for five months; and their torment was like the torment from a scorpion when it stings a man. "}],[{"type":"prose","content":"And in those days people will seek death and will not find it; and they will long to die [to escape the pain], but [will discover that] death evades them."}],[{"type":"prose","content":"The locusts resembled horses prepared  equipped for battle; and on their heads appeared to be [something like] golden crowns, and their faces resembled human faces. "}],[{"type":"prose","content":"They had hair like the hair of women, and their teeth were like  of lions. "}],[{"type":"prose","content":"They had breastplates (scales) like breastplates made of iron; and the [whirring] noise of their wings was like the [thunderous] noise of countless horse-drawn chariots charging [at full speed] into battle. "}],[{"type":"prose","content":"They have tails like scorpions, and stingers; and in their tails is their power to hurt people for five months. "}],[{"type":"prose","content":"They have as king over them, the angel of the abyss (the bottomless pit); in Hebrew his name is Abaddon (destruction), and in Greek he is called Apollyon (destroyer-king)."}],[{"type":"prose","content":"The first woe has passed; behold, two woes are still coming after these things."}],[{"type":"header","content":"The Sixth Trumpet—Army from the East"},{"type":"prose","content":"Then the sixth angel sounded [his trumpet], and I heard a solitary voice from the four horns of the golden altar which stands before God, "}],[{"type":"prose","content":"saying to the sixth angel who had the trumpet, “Release the four angels who are bound at the great river Euphrates.” "}],[{"type":"prose","content":"So the four angels, who had been prepared for the [appointed] hour and day and month and year, were released to kill a third of mankind. "}],[{"type":"prose","content":"The number of the troops of cavalry was twice ten thousand times ten thousand (two hundred million); I heard the number of them. "}],[{"type":"prose","content":"And this is how I saw the horses and their riders in my vision:  had breastplates [the color] of fire and of hyacinth (sapphire blue) and of brimstone (yellow); and the heads of the horses looked like the heads of lions; and from out of their mouths came fire and smoke and brimstone (burning sulfur). "}],[{"type":"prose","content":"A third of mankind was killed by these three plagues—by the fire and the smoke and the brimstone that came from the mouths of the horses. "}],[{"type":"prose","content":"For the power of the horses [to do harm] is in their mouths and in their tails; for their tails are like serpents and have heads, and it is with them that they do harm."}],[{"type":"prose","content":"The rest of mankind, who were not killed by these plagues, did not repent even then of the works of their hands, so as to cease worshiping  paying homage to the demons and the idols of gold and of silver and of bronze and of stone and of wood, which can neither see nor hear nor walk; "}],[{"type":"prose","content":"and they did not repent of their murders nor of their sorceries (drugs, intoxications) nor of their [sexual] immorality nor of their thefts."}]]