[{"num":9,"verse":"The fifth angel sounded his shofar; and I saw a star that had fallen out of heaven onto the earth, and he was given the key to the shaft leading down to the Abyss. "},{"num":2,"verse":"He opened the shaft of the Abyss, and there went up smoke from the shaft like the smoke of a huge furnace; the sun was darkened, and the sky too, by the smoke from the shaft. "},{"num":3,"verse":"Then out of the smoke onto the earth came locusts, and they were given power like the power scorpions have on earth. "},{"num":4,"verse":"They were instructed not to harm the grass on the earth, any green plant or any tree, but only the people who did not have the seal of God on their foreheads. "},{"num":5,"verse":"The locusts were not allowed to kill them, only to inflict pain on them for five months; and the pain they caused was like the pain of a scorpion sting. "},{"num":6,"verse":"In those days people will seek death but will not find it; they will long to die, but death will elude them."},{"num":7,"verse":"Now these locusts looked like horses outfitted for battle. On their heads were what looked like crowns of gold, and their faces were like human faces. "},{"num":8,"verse":"They had hair like women’s hair, and their teeth were like those of lions. "},{"num":9,"verse":"Their chests were like iron breastplates, and the sound their wings made was like the roar of many horses and chariots rushing into battle. "},{"num":10,"verse":"They had tails like those of scorpions, with stings; and in their tails was their power to hurt people for five months. "},{"num":11,"verse":"They had as king over them the angel of the Abyss, whose name in Hebrew is “Abaddon” and in our language, “Destroyer.”"},{"num":12,"verse":"The first woe has passed, but there are still two woes to come."},{"num":13,"verse":"The sixth angel sounded his shofar, and I heard a voice from the four horns of the gold altar before God, "},{"num":14,"verse":"saying to the sixth angel, the one with the shofar, “Release the four angels that are bound at the great river Euphrates!” "},{"num":15,"verse":"And they were released. These four angels had been kept ready for this moment, for this day and month and year, to kill a third of mankind; "},{"num":16,"verse":"and the number of cavalry soldiers was two hundred million! — I heard the number."},{"num":17,"verse":"Here is how the horses looked in the vision: the riders had breastplates that were fire-red, iris-blue and sulfur-yellow; the horses’ heads were like lions’ heads; and from their mouths issued fire, smoke and sulfur. "},{"num":18,"verse":"It was these three plagues that killed a third of mankind — the fire, smoke and sulfur issuing from the horses’ mouths. "},{"num":19,"verse":"For the power of the horses was in their mouths — and also in their tails, for their tails were like snakes with heads, and with them they could cause injury."},{"num":20,"verse":"The rest of mankind, those who were not killed by these plagues, even then did not turn from what they had made with their own hands — they did not stop worshipping demons and idols made of gold, silver, bronze, stone and wood, which cannot see or hear or walk. "},{"num":21,"verse":"Nor did they turn from their murdering, their involvement with the occult and with drugs, their sexual immorality or their stealing."}]