[{"num":9,"verse":"And the fifth angel sounded [his] trumpet: and I saw a star out of the heaven fallen to the earth; and there was given to it the key of the pit of the abyss."},{"num":2,"verse":"And it opened the pit of the abyss; and there went up smoke out of the pit as [the] smoke of a great furnace; and the sun and the air were darkened with the smoke of the pit."},{"num":3,"verse":"And out of the smoke came forth locusts on the earth, and power was given to them as the scorpions of the earth have power;"},{"num":4,"verse":"and it was said to them, that they should not injure the grass of the earth, nor any green thing, nor any tree, but the men who have not the seal of God on their foreheads:"},{"num":5,"verse":"and it was given to them that they should not kill them, but that they should be tormented five months; and their torment [was] as [the] torment of a scorpion when it strikes a man."},{"num":6,"verse":"And in those days shall men seek death, and shall in no way find it; and shall desire to die, and death flees from them."},{"num":7,"verse":"And the likenesses of the locusts [were] like to horses prepared for war; and upon their heads as crowns like gold, and their faces as faces of men;"},{"num":8,"verse":"and they had hair as women's hair, and their teeth were as of lions,"},{"num":9,"verse":"and they had breastplates as breastplates of iron, and the sound of their wings [was] as the sound of chariots of many horses running to war;"},{"num":10,"verse":"and they have tails like scorpions, and stings; and their power [was] in their tails to hurt men five months."},{"num":11,"verse":"They have a king over them, the angel of the abyss: his name in Hebrew, Abaddon, and in Greek he has [for] name Apollyon."},{"num":12,"verse":"The first woe has passed. Behold, there come yet two woes after these things."},{"num":13,"verse":"And the sixth angel sounded [his] trumpet: and I heard a voice from the four horns of the golden altar which [is] before God,"},{"num":14,"verse":"saying to the sixth angel that had the trumpet, Loose the four angels which are bound at the great river Euphrates."},{"num":15,"verse":"And the four angels were loosed, who are prepared for the hour and day and month and year, that they might slay the third part of men;"},{"num":16,"verse":"and the number of the hosts of horse [was] twice ten thousand times ten thousand. I heard their number."},{"num":17,"verse":"And thus I saw the horses in the vision, and those that sat upon them, having breastplates of fire and jacinth and brimstone; and the heads of the horses [were] as heads of lions, and out of their mouths goes out fire and smoke and brimstone."},{"num":18,"verse":"By these three plagues were the third part of men killed, by the fire and the smoke and the brimstone which goes out of their mouths."},{"num":19,"verse":"For the power of the horses is in their mouth and in their tails: for their tails [are] like serpents, having heads, and with them they injure."},{"num":20,"verse":"And the rest of men who were not killed with these plagues repented not of the works of their hands, that they should not worship demons, and the golden and silver and brazen and stone and wooden idols, which can neither see nor hear nor walk."},{"num":21,"verse":"And they repented not of their murders, nor of their witchcrafts, nor of their fornication, nor of their thefts."}]