[{"header":"The Fifth Trumpet"},{"num":9,"verse":"Then the fifth angel sounded his trumpet, and I saw a star that fell from heaven to earth, and he was handed the key to the shaft leading down to the pit of the deep. "},{"num":2,"verse":"He opened the shaft of the bottomless pit and a blanket of smoke began to rise out of it, like the smoke of a giant furnace. The sun and the atmosphere were darkened with the smoke rising from the shaft."},{"num":3,"verse":"And out of the smoke appeared locusts swarming onto the earth, and they were given authority like that of scorpions to inflict pain. "},{"num":4,"verse":"They were told not to harm the grass, or any green growth or any tree, but only to afflict those who did not have the seal of God on their foreheads. "},{"num":5,"verse":"The locusts were given authority to torment them for five months, but not to kill them. Their painful torment is like the scorpion’s sting, "},{"num":6,"verse":"and during that time people will seek death but will not find it; they will long to die but death will elude them."},{"num":7,"verse":"The locusts had the appearance of horses equipped for battle. On their heads were what seemed like golden crowns. And their faces were like human faces. "},{"num":8,"verse":"Their hair was long, like women’s hair, and their teeth like lion’s teeth. "},{"num":9,"verse":"They wore breastplates that seemed like iron, and their wings made a sound like the noise of horses and chariots rushing into battle. "},{"num":10,"verse":"They had tails and stingers like scorpions, with power to injure people for five months. "},{"num":11,"verse":"The angel of the bottomless pit was king over them, and his name in Hebrew is Destruction and in Greek Destroyer. "},{"num":12,"verse":"This is but the first woe; there are still two more to come."},{"header":"The Sixth Trumpet"},{"num":13,"verse":"Then the sixth angel sounded his trumpet, and I heard a voice from the four horns of the golden altar before God, "},{"num":14,"verse":"responding to the sixth angel, who blew his trumpet, “Set free the four angels who are confined at the great river Euphrates.”"},{"num":15,"verse":"So the four angels were released, who had been prepared for the right hour, day, month, and year, to kill a third of humanity."},{"num":16,"verse":"I heard the number of soldiers on horseback—it was twice ten thousand times ten thousand. "},{"num":17,"verse":"And in my vision I saw the horses with riders wearing breastplates of fire and of sapphire and of sulfur. The horses had lions’ heads breathing out fire and smoke and sulfur. "},{"num":18,"verse":"They killed a third of humanity by these three plagues—the fire, the smoke, and the sulfur that came from their mouths. "},{"num":19,"verse":"For the lethal power of the horses was in their mouths and their tails, and their tails had snakes’ heads that inflict injuries."},{"num":20,"verse":"Those not killed by these plagues did not repent of their deeds so that they would stop worshiping demons and idols of gold, silver, bronze, stone, and wood—blind and mute idols that have to be carried around. "},{"num":21,"verse":"And they did not repent of their murders or their sorceries or their thefts or their immorality."}]