[{"num":3,"verse":"And he [the malach] showed me Yehoshua the Kohen HaGadol standing before the Malach Hashem, and HaSatan standing at his right hand to accuse him."},{"num":2,"verse":"And Hashem said unto HaSatan, Hashem rebuke thee, O HaSatan; even Hashem that hath chosen Yerushalayim rebuke thee. Is not this a brand, a burning stick, snatched out of the eish?"},{"num":3,"verse":"Now Yehoshua was clothed with filthy garments, and stood before the malach."},{"num":4,"verse":"And he [the malach] answered and spoke unto those that stood before him, saying, Take away the filthy garments from him. And unto him he said, See, I have taken away thine avon (iniquity, guilt) from thee, and I will clothe thee with machalatzot (extra fine, white clothing)."},{"num":5,"verse":"And I said, Let them set a tzanif tahor (clean turban, mitznefet, Shemot 28:4) upon his head. So they set a tzanif tahor upon his head, and clothed him with garments. And the Malach Hashem stood by."},{"num":6,"verse":"And the Malach Hashem testified unto Yehoshua, saying,"},{"num":7,"verse":"Thus saith Hashem Tzva’os: If thou shalt walk in My ways, and if thou shalt keep My charge, then thou shalt also judge My Beis [Hamikdash], and shalt also keep My courts, and I will give thee ways to walk among these standing here."},{"num":8,"verse":"Hear now, O Yehoshua the Kohen HaGadol, thou, and thy fellows that sit before thee, for they are Anshei Mofet (men of portent); for, hinei, I will bring forth Avdi Tzemach [My Servant, the Branch i.e., Moshiach Ben Dovid Yehoshua, see Jer 23:5; 30:9; 33:15; Ezra 3:8; Zech 6:11-12; Mt 2:23; Isa 4:2; 9:2-7; 11:1-12; 53:2, 11; Moshiach the new \"Joshua\" Isa 49:8]."},{"num":9,"verse":"For hinei the even (stone) that I have set before Yehoshua; upon one even (stone) shall be shivah einayim (seven eyes); hineni, I will engrave the inscription thereof, saith Hashem Tzva’os, and I will remove the avon (iniquity, guilt) of that land in Yom Echad."},{"num":10,"verse":"In Yom HaHu, saith Hashem Tzva’os, shall ye invite every man his neighbor under the vine and under the fig tree."}]