[[],[{"type":"header","content":"Giving Thanks for Faith and Perseverance"},{"type":"prose","content":"Paul, Silvanus, and Timothy,To the church of the Thessalonians in God our Father and the Lord Jesus Christ:"}],[{"type":"prose","content":"Grace to you and peace from God our Father and the Lord Jesus Christ."}],[{"type":"prose","content":"We ought always to give thanks to God for you, brothers , as is  fitting, because your faith is increasing abundantly, and the love of each and every one of you toward one another grows  greater."}],[{"type":"prose","content":"As a result, we ourselves speak proudly of you among the churches of God for your perseverance and faith in the midst of all your persecutions and afflictions which you endure."}],[{"type":"prose","content":" a plain indication of God’s righteous judgment so that you will be considered worthy of the kingdom of God, for which you indeed are suffering."}],[{"type":"prose","content":"For after all it is  right for God to repay with affliction those who afflict you,"}],[{"type":"prose","content":"and  relief to you who are afflicted,  with us, when the Lord Jesus will be revealed from heaven with His mighty angels"}],[{"type":"prose","content":"in flaming fire, dealing out retribution to those who do not know God, and to those who do not obey the gospel of our Lord Jesus."}],[{"type":"prose","content":"These people will pay the penalty of eternal destruction, away from the presence of the Lord and from the glory of His power,"}],[{"type":"prose","content":"when He comes to be glorified among His saints on that day, and to be marveled at among all who have believed—because our testimony to you was believed."}],[{"type":"prose","content":"To this end also we pray for you always, that our God will consider you worthy of your calling, and fulfill every desire for goodness and the work of faith with power,"}],[{"type":"prose","content":"so that the name of our Lord Jesus will be glorified in you, and you in Him, in accordance with the grace of our God and  Lord Jesus Christ."}]]