[{"header":"A Prayer of Thanks"},{"num":1,"verse":"From Paul, a servant of Christ Jesus. God called me to be an apostle and chose me to tell the Good News."},{"num":2,"verse":"God promised this Good News long ago through his prophets. That promise is written in the Holy Scriptures. "},{"num":3,"verse":"The Good News is about God’s Son, Jesus Christ our Lord. As a man, he was born from the family of David. But through the Spirit of holiness he was declared to be God’s Son with great power by rising from death. "},{"num":5,"verse":"Through Christ, God gave me the special work of an apostle. This was to lead people of all nations to believe and obey. I do this work for Christ. "},{"num":6,"verse":"And you who are in Rome are also called to belong to Jesus Christ."},{"num":7,"verse":"This letter is to all of you in Rome whom God loves and has called to be his holy people."},{"num":8,"verse":"First I want to say that I thank my God through Jesus Christ for all of you. I thank God because people everywhere in the world are talking about your great faith. "},{"num":9,"verse":"God knows that every time I pray I always mention you. God is the One I serve with my whole heart by telling the Good News about his Son. I pray that I will be allowed to come to you, and this will happen if God wants it. "},{"num":11,"verse":"I want very much to see you, to give you some spiritual gift to make you strong. "},{"num":12,"verse":"I mean that I want us to help each other with the faith that we have. Your faith will help me, and my faith will help you. "},{"num":13,"verse":"Brothers, I want you to know that I planned many times to come to you. But this has not been possible. I wanted to come so that I could help you grow spiritually. I wanted to help you as I have helped the other non-Jewish people."},{"num":14,"verse":"I must serve all people—Greeks and non-Greeks, the wise and the foolish. "},{"num":15,"verse":"That is why I want so much to preach the Good News to you in Rome."},{"num":16,"verse":"I am not ashamed of the Good News. It is the power God uses to save everyone who believes—to save the Jews first, and then to save the non-Jews. "},{"num":17,"verse":"The Good News shows how God makes people right with himself. God’s way of making people right with him begins and ends with faith. As the Scripture says, “The person who is made right with God by faith will live forever.”"},{"header":"All People Have Done Wrong"},{"num":18,"verse":"God’s anger is shown from heaven against all the evil and wrong things that people do. By their own evil lives they hide the truth. "},{"num":19,"verse":"God shows his anger because everything that may be known about God has been made clear. Yes, God has clearly shown them everything that may be known about him. "},{"num":20,"verse":"There are things about God that people cannot see—his eternal power and all the things that make him God. But since the beginning of the world those things have been easy to understand. They are made clear by what God has made. So people have no excuse for the bad things they do. "},{"num":21,"verse":"They knew God. But they did not give glory to God, and they did not thank him. Their thinking became useless. Their foolish minds were filled with darkness. "},{"num":22,"verse":"They said they were wise, but they became fools. "},{"num":23,"verse":"They gave up the glory of God who lives forever. They traded that glory for the worship of idols made to look like earthly people. They traded God’s glory for things that look like birds, animals, and snakes."},{"num":24,"verse":"People were full of sin, wanting only to do evil. So God left them to follow their evil desires, and they made one another’s bodies impure by what they did. "},{"num":25,"verse":"They traded the truth of God for a lie and worshiped and served things that were made by man. But they did not worship and serve the God who made those things. God should be praised forever. Amen."},{"num":26,"verse":"Because people did those things, God left them and let them do the shameful things they wanted to do. Women stopped having natural physical relations with men for what is unnatural. "},{"num":27,"verse":"In the same way, men stopped having natural physical relations with women and began wanting each other. Men did shameful things with other men. And in their bodies they received the punishment for those wrongs."},{"num":28,"verse":"People did not think it was important to have a true knowledge of God. So God left them and allowed them to have their own worthless thinking. And so those people do the things that they should not do. "},{"num":29,"verse":"They are filled with every kind of sin, evil, selfishness, and hatred. They are full of jealousy, murder, fighting, lying, and thinking the worst about each other. They gossip "},{"num":30,"verse":"and say evil things about each other. They hate God. They are rude and conceited and brag about themselves. They invent ways of doing evil. They do not obey their parents. "},{"num":31,"verse":"They are foolish, they do not keep their promises, and they show no kindness or mercy to other people. "},{"num":32,"verse":"They know God’s law says that those who live like this should die. But they continue to do these evil things. And they also feel that those who do these things are doing right."}]