[{"num":61,"verse":"1 He prophesieth that Christ shall be anointed, and sent to preach. 10 The joy of the faithful."},{"num":1,"verse":"The Spirit of the Lord God is upon me, therefore hath the Lord anointed me: he hath sent me to preach good tidings unto the poor, to bind up the broken hearted, to preach liberty to the captives, and to them that are bound, the opening of the prison,"},{"num":2,"verse":"To preach the acceptable year of the Lord, and the day of vengeance of our God, to comfort all that mourn,"},{"num":3,"verse":"To appoint unto them that mourn in Zion, and to give unto them beauty for ashes, the oil of joy for mourning, the garment of gladness for the spirit of heaviness, that they might be called trees of righteousness, the planting of the Lord, that he might be glorified."},{"num":4,"verse":"And they shall build the old waste places, and raise up the former desolations, and they shall repair the cities that were desolate and waste through many generations."},{"num":5,"verse":"And the strangers shall stand and feed your sheep, and the sons of the strangers shall be your plowmen, and dressers of your vines."},{"num":6,"verse":"But ye shall be named the Priests of the Lord, and men shall say unto you, The ministers of our God: Ye shall eat the riches of the Gentiles, and shall be exalted with their glory."},{"num":7,"verse":"For your shame you shall receive double, and for confusion, they shall rejoice in their portion: for in their land they shall possess the double: everlasting joy shall be unto them."},{"num":8,"verse":"For I the Lord love judgment, and hate robbery for burnt offering, and I will direct their work in truth, and I will make an everlasting covenant with them."},{"num":9,"verse":"And their seed shall be known among the Gentiles, and their buds among the people. All that see them, shall know them, that they are the seed which the Lord hath blessed."},{"num":10,"verse":"I will greatly rejoice in the Lord, and my soul shall be joyful in my God: for he hath clothed me with the garments of salvation, and covered me with the robe of righteousness: he hath decked me like a bridegroom, and as a bride attireth herself with her jewels."},{"num":11,"verse":"For as the earth bringeth forth her bud, and as the garden causeth to grow that which is sown in it: so the Lord God will cause righteousness to grow, and praise before all the heathen."}]