[{"header":"Zechariah Sees Four War-Wagons"},{"num":6,"verse":"I looked up again and saw four war-wagons coming out from between the two mountains. The mountains were made of brass. "},{"num":2,"verse":"The first war-wagon had red horses. The second war-wagon had black horses. "},{"num":3,"verse":"The third war-wagon had white horses, and the fourth war-wagon had strong horses with spots. "},{"num":4,"verse":"Then I said to the angel who was speaking with me, “What are these, my lord?” "},{"num":5,"verse":"The angel said to me, “These are the four spirits of heaven, going away from standing before the Lord of All the earth. "},{"num":6,"verse":"The war-wagon with the black horses is going toward the north country. The white ones follow them. And the horses with spots go toward the south country. "},{"num":7,"verse":"When the strong horses went out, they were in a hurry to look over all the earth.” And he said, “Go, look over all the earth.” So they went over the whole earth. "},{"num":8,"verse":"Then he called to me, “See, those who are going to the land of the north have given My Spirit rest in the north country.”"},{"header":"The Crown on Joshua"},{"num":9,"verse":"The Word of the Lord came to me saying, "},{"num":10,"verse":"“Take the gifts from Heldai, Tobijah, and Jedaiah, who have returned from Babylon. And go the same day to the house of Josiah the son of Zephaniah. "},{"num":11,"verse":"Take the silver and gold and make a crown, and set it on the head of Joshua the son of Jehozadak, the head religious leader. "},{"num":12,"verse":"Then tell him, ‘The Lord of All says, “See, the man whose name is the Branch, for He will branch out from where He is. And He will build the house of the Lord. "},{"num":13,"verse":"Yes, He is the One Who will build the house of the Lord. He will be honored as King, and sit and rule on His throne. And He will be a religious leader on His throne, and there will be peace between the two.”’ "},{"num":14,"verse":"The crown will be in the Lord’s house, that people may remember Helem, Tobijah, Jedaiah, and Hen the son of Zephaniah. "},{"num":15,"verse":"Those who are far away will come to build the house of the Lord. Then you will know that the Lord of All has sent me to you. This will happen if you are careful to obey the Lord your God.”"}]