[[],[{"type":"prose","content":"And I turn back, and lift up mine eyes, and look, and lo, four chariots are coming forth from between two of the mountains, and the mountains [are] mountains of brass."}],[{"type":"prose","content":"In the first chariot [are] red horses, and in the second chariot brown horses,"}],[{"type":"prose","content":"and in the third chariot white horses, and in the fourth chariot strong grisled horses."}],[{"type":"prose","content":"And I answer and say unto the messenger who is speaking with me, `What [are] these, my lord?'"}],[{"type":"prose","content":"And the messenger answereth and saith unto me, `These [are] four spirits of the heavens coming forth from presenting themselves before the Lord of the whole earth."}],[{"type":"prose","content":"The brown horses that [are] therein, are coming forth unto the land of the north; and the white have come forth unto their hinder part; and the grisled have come forth unto the land of the south;"}],[{"type":"prose","content":"and the strong ones have come forth, and they seek to go to walk up and down in the earth;' and he saith, `Go, walk up and down in the earth;' and they walk up and down in the earth."}],[{"type":"prose","content":"And he calleth me, and speaketh unto me, saying, `See, those coming forth unto the land of the north have caused My Spirit to rest in the land of the north.'"}],[{"type":"prose","content":"And there is a word of Jehovah unto me, saying,"}],[{"type":"prose","content":"to take of the captivity (who came from Babylon) from Heldai, from Tobijah, and from Jedaiah, `and thou hast come in -- thou, in that day, yea, thou hast come into the house of Josiah son of Zephaniah,"}],[{"type":"prose","content":"and thou hast taken silver and gold, and hast made a crown, and hast placed on the head of Joshua son of Josedech, the high priest,"}],[{"type":"prose","content":"and hast spoken unto him, saying: Thus spake Jehovah of Hosts, saying: Lo, a man! A Shoot -- [is] his name, And from his place he doth shoot up, And he hath built the temple of Jehovah."}],[{"type":"prose","content":"Yea, he doth build the temple of Jehovah, And he doth bear away honour, And he hath sat and ruled on His throne, And hath been a priest on His throne, And a counsel of peace is between both."}],[{"type":"prose","content":"And the crown is to Helem, and to Tobijah, and to Jedaiah, and to Hen son of Zephaniah, for a memorial in the temple of Jehovah."}],[{"type":"prose","content":"And the far-off come in, and they have built in the temple of Jehovah, and ye have known that Jehovah of Hosts hath sent me unto you, yea, it hath come to pass, if ye do certainly hearken to the voice of Jehovah your God.'"}]]