[{"header":"The Priests’ Rooms"},{"num":42,"verse":"Then the man led me north out into the outer courtyard and to the rooms across from the private area and the building. "},{"num":2,"verse":"These rooms on the north side were one hundred seventy-five feet long and eighty-seven and one-half feet wide. "},{"num":3,"verse":"There was thirty-five feet of the inner courtyard between them and the Temple. On the other side, they faced the stone pavement of the outer courtyard. The rooms were built in three stories like steps and had balconies. "},{"num":4,"verse":"There was a path on the north side of the rooms, which was seventeen and one-half feet wide and one hundred seventy-five feet long. Doors led into the rooms from this path. "},{"num":5,"verse":"The top rooms were narrower, because the balconies took more space from them. The rooms on the first and second stories of the building were wider. "},{"num":6,"verse":"The rooms were on three stories. They did not have pillars like the pillars of the courtyards. So the top rooms were farther back than those on the first and second stories. "},{"num":7,"verse":"There was a wall outside parallel to the rooms and to the outer courtyard. It ran in front of the rooms for eighty-seven and one-half feet. "},{"num":8,"verse":"The row of rooms along the outer courtyard was eighty-seven and one-half feet long, and the rooms that faced the Temple were about one hundred seventy-five feet long. "},{"num":9,"verse":"The lower rooms had an entrance on the east side so a person could enter them from the outer courtyard, "},{"num":10,"verse":"at the start of the wall beside the courtyard."},{"num":11,"verse":"These rooms had a path in front of them. They were like the rooms on the north with the same length and width and the same doors. "},{"num":12,"verse":"The doors of the south rooms were like the doors of the north rooms. There was an entrance at the open end of a path beside the wall, so a person could enter at the east end."},{"num":13,"verse":"The man said to me, “The north and south rooms across from the private area are holy rooms. There the priests who go near the Lord will eat the most holy offerings. There they will put the most holy offerings: the grain offerings, sin offerings, and the penalty offerings, because the place is holy. "},{"num":14,"verse":"The priests who enter the Holy Place must leave their serving clothes there before they go into the outer courtyard, because these clothes are holy. After they put on other clothes, they may go to the part of the Temple area which is for the people.”"},{"header":"Outside the Temple Area"},{"num":15,"verse":"When the man finished measuring inside the Temple area, he brought me out through the east gateway. He measured the area all around. "},{"num":16,"verse":"The man measured the east side with the measuring stick; it was eight hundred seventy-five feet by the measuring stick. "},{"num":17,"verse":"He measured the north side; it was eight hundred seventy-five feet by the measuring stick. "},{"num":18,"verse":"He measured the south side; it was eight hundred seventy-five feet by the measuring stick. "},{"num":19,"verse":"He went around to the west side; it measured eight hundred seventy-five feet by the measuring stick. "},{"num":20,"verse":"So he measured the Temple area on all four sides. The Temple area had a wall all around it that was eight hundred seventy-five feet long and eight hundred seventy-five feet wide. It separated what was holy from that which was not holy."}]