[{"header":"Ezra Prays About Intermarriage"},{"num":9,"verse":"Now when these things were done, the leaders contacted me, saying, “The people of Israel, the priests, and the Levites have not separated themselves from the people of the lands. They practice the abominations of the Canaanites, the Hittites, the Perizzites, the Jebusites, the Ammonites, the Moabites, the Egyptians, and the Amorites. "},{"num":2,"verse":"Specifically, they have taken some of their daughters as wives for themselves, as well as for their sons, so that the holy seed has been mingled with the people of the lands. In fact, the involvement of the leaders and rulers has been foremost in this vile behavior.”"},{"num":3,"verse":"When I heard this, I tore my clothes and my robe, plucked out the hair of my head and from my beard, and sat down astonished. "},{"num":4,"verse":"Because of the vile behavior of those who had been in exile, every one that trembled at the words of the God of Israel gathered to me, but I sat astonished until the evening sacrifice."},{"num":5,"verse":"At the evening sacrifice I rose up from my heaviness and, despite having my clothes and my robe torn, I knelt on my knees and stretched out my hands in prayer to the Lord my God "},{"num":6,"verse":"and said:"},{"num":7,"verse":"Since the days of our fathers until this day, we have been in a great guilt. It is because of our iniquities that we, our kings, and our priests have been delivered—by the sword, by captivity, by spoil, and by being shamed—into the hand of the kings of the lands. This day is like that, too."},{"num":8,"verse":"“Yet now for a little while, there has been a favorable response from the Lord our God—leaving us a remnant to escape, giving us a tent peg from His holy place, having our eyes enlightened by our God, and giving us a little reviving in our bondage. "},{"num":9,"verse":"For though we were slaves, our God has not forsaken us in our bondage but has extended mercy to us in the sight of the kings of Persia, granting us a reviving for the rebuilding of the house of our God, for the repairing of its ruins, and for giving us a wall in Judah and in Jerusalem."},{"num":10,"verse":"“Now, O our God, what shall we say after this? For we have forsaken Your commandments, "},{"num":11,"verse":"which You commanded by Your servants the prophets, saying, ‘The land you are going to possess, it is an unclean land with the filthiness of the people of the lands. By their abominations, it is has been filled from one end to another with their uncleanness. "},{"num":12,"verse":"Now, therefore, cease giving your daughters as wives to their sons, do not take their daughters to your sons, and never seek their peace or prosperity, that you might grow strong and eat the good of the land and leave it as an eternal inheritance to your children.’"},{"num":13,"verse":"“After all that has come upon us because of our evil deeds and our great guilt, seeing that You our God have punished us less than our iniquities deserve and have given us such deliverance as this, "},{"num":14,"verse":"should we again break Your commandments and intermarry with the people of these abominations? Would You not become so completely angry with us that there would be no remnant nor any who escape? "},{"num":15,"verse":"O Lord God of Israel, You are righteous, for we who escaped exile yet remain to this very day. Here we stand before You in our guiltiness even though we should not stand before You because of this.”"}]