[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(26) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the goats are the price of the field—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "you can purchase a field from the profit of your goats.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:15,16. The contentions of a neighbour may be like a sharp shower, troublesome for a time; the contentions of a wife are like constant rain. 17. We are cautioned to take heed whom we converse with. And directed to have in view, in conversation, to make one another wiser and better. 18. Though a calling be laborious and despised, yet those who keep to it, will find there is something to be got by it. God is a Master who has engaged to honour those who serve him faithfully. 19. One corrupt heart is like another; so are sanctified hearts: the former bear the same image of the earthly, the latter the same image of the heavenly. Let us carefully watch our own hearts, comparing them with the word of God. 20. Two things are here said to be never satisfied, death and sin. The appetites of the carnal mind for profit or pleasure are always desiring more. Those whose eyes are ever toward the Lord, are satisfied in him, and shall for ever be so. 21. Silver and gold are tried by putting them into the furnace and fining-pot; so is a man tried by praising him. 22. Some are so bad, that even severe methods do not answer the end; what remains but that they should be rejected? The new-creating power of God's grace alone is able to make a change. 23-27. We ought to have some business to do in this world, and not to live in idleness, and not to meddle with what we do not understand. We must be diligent and take pains. Let us do what we can, still the world cannot be secured to us, therefore we must choose a more lasting portion; but by the blessing of God upon our honest labours, we may expect to enjoy as much of earthly blessings as is good for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Appeareth - Better, When the grass disappeareth, the \"tender grass showeth itself.\" Stress is laid on the regular succession of the products of the earth. The \"grass\" (\"hay\") of the first clause is (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 90:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 19:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the proverbial type of what is perishable and fleeting. The verse gives a picture of the pleasantness of the farmer's calling; compared with this what can wealth or rank offer? With this there mingles (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 27:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the thought that each stage of that life in its season requires care and watchfulness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25-27. The fact that providential arrangements furnish the means of competence to those who properly use them is another motive to diligence (compare Ps 65:9-13).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The hay appeareth—literally, \"Grass appeareth\" (Job 40:15; Ps 104:14).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The lambs are for thy clothing; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by their wool and skins, either used to clothe thyself with or sold to purchase all manner of clothing for thyself and family. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The goats are the price of the field; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the sale whereof thou mayst either pay the rent of the field which thou hirest, or purchase fields or lands for thyself. Either ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goats",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are put for all cattle, or he mentions ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goats",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because these might better be spared and sold than sheep, which brought a more certain and constant profit to the owner. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The lambs are for thy clothing,.... This is another argument, exciting to diligence in the pastoral calling, taken from the profit arising from it: the wool of the lambs, or rather \"sheep\", as many versions render it; of it cloth is made, and of that garments to be worn, to keep decent, warm, and comfortable; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the goats are the price of thy field: these, being brought up and sold, furnish the husbandman with money to purchase more fields to feed his cattle on. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the goats are for negotiation;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with the price of them a man may purchase any of the necessaries of life for himself and family; these are negotiated, Ezekiel 27:21; the Syriac version is, \"the goats are for thy food\"; and so, between both the sheep and goats, man has both food and raiment; though his food is particularly mentioned in Proverbs 27:27. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "with the price of them a man may purchase any of the necessaries of life for himself and family; these are negotiated, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 27:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the Syriac version is, \"the goats are for thy food\"; and so, between both the sheep and goats, man has both food and raiment; though his food is particularly mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The {k} lambs are for thy clothing, and the goats are the price of the field.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " lambs ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for thy clothing, and the goats ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the price of the field.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) This declares the great goodness of God towards man, and the diligence that he requires from him for the preservation of his gifts.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 26.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Iambs are for thy clothing.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Thy sheep will provide thee with clothing by their skin and wool, and by the money which thou wilt obtain by the sale of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The goats are the price of the field;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the sale of thy goats and their produce will pay for thy field if thou wish to buy it (see on Proverbs 30:31). Septuagint, \"That thou mayest have sheep for clothing; honour thy land that thou mayest have lambs.\" Proverbs 27:26",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "An exhortation to rural industry, and particularly to the careful tending of cattle for breeding, forms the conclusion of the foregoing series of proverbs, in which we cannot always discern an intentional grouping. It is one of the Mashal-odes spoken of vol. i. p. 12. It consists of 11  equals  4 + 7 lines.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23 Give heed to the look of thy small cattle,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     Be considerate about the herds.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24 For prosperity continues not for ever;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And does the diadem continue from generation to generation?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "25 (But) the hay is gone, and the after-growth appears,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And the grass of the mountains is gathered:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "26 Lambs serve to clothe thee,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And goats are the price of a field.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "27 And there is plenty of goats' milk for thy nourishment,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And for the nourishment of thy house,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And subsistence for thy maidens.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The beginning directs to the fut., as is not common in these proverbs, vid., Proverbs 26:26. With ידע, to take knowledge, which is strengthened by the inf. intensivus, is interchanged שׁית לב, which means at Proverbs 24:32 to consider well, but here, to be careful regarding anything. צאן is the small or little cattle, thus sheep and goats. Whether לעדרים (here and at Isaiah 17:2) contains the article is questionable (Gesen. 35. 2 A), and, since the herds are called העדרים, is not probable; thus: direct thy attention to the herds, that is, to this, that thou hast herds. פּני is the external side in general; here, the appearance which the sheep present; thus their condition as seen externally. In Proverbs 27:24 I formerly regarded נזר as a synonym of גּז, to be understood of the produce of wool, or, with Hitzig, of the shearing of the meadow, and thus the produce of the meadow. But this interpretation of the word is untenable, and Proverbs 27:25 provides for Proverbs 27:24, thus understood, no natural continuation of thought. That חסן signifies a store, fulness of possessions, property, and abundance, has already been shown under Proverbs 15:6; but נזר is always the mark of royal, and generally of princely dignity, and here denotes, per meton. signi pro re signata, that dignity itself. With the negative expression in 24a the interrogative in 24b is interchanged as at Job 40:9, with the implied negative answer; ואם, of an oath (\"and truly not,\" as at Isaiah 62:8), presents the same thought, but with a passionate colouring here unnecessary. Rightly Fleischer: \"ready money, moveable property, and on the other hand the highest positions of honour, are far more easily torn away from a man, and secure to him far less of quiet prosperity, than husbandry, viewed particularly with respect to the rearing of cattle.\" In other words: the possession of treasures and of a lofty place of power and of honour has not in itself the security of everlasting duration; but rural economy, and particularly the rearing of cattle, gives security for food and clothing. The Chethı̂b לדור דור is found, e.g., at Exodus 3:15; the Kerı̂ לדּור ודור substitutes the more usual form. If Proverbs 27:25 was an independent whole (Hitzig: grass vanishes and fresh green appears, etc.), then the meaning here and onward would be that in the sphere of husbandry it is otherwise than is said in Proverbs 27:24 : there that which is consumed renews itself, and there is an enlarging circulation. But this contrast to Proverbs 27:24 must be expressed and formed unambiguously. The connection is rather this, that Proverbs 27:23 commends the rearing of cattle, Proverbs 27:24 confirms it, and 25ff. discuss what real advantages, not dependent on the accidents of public and social life, it brings.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The beginning directs to the fut., as is not common in these proverbs, vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 26:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". With ידע, to take knowledge, which is strengthened by the inf. intensivus, is interchanged שׁית לב, which means at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 24:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to consider well, but here, to be careful regarding anything. צאן is the small or little cattle, thus sheep and goats. Whether לעדרים (here and at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 17:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") contains the article is questionable (Gesen. 35. 2 A), and, since the herds are called העדרים, is not probable; thus: direct thy attention to the herds, that is, to this, that thou hast herds. פּני is the external side in general; here, the appearance which the sheep present; thus their condition as seen externally. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I formerly regarded נזר as a synonym of גּז, to be understood of the produce of wool, or, with Hitzig, of the shearing of the meadow, and thus the produce of the meadow. But this interpretation of the word is untenable, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " provides for ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", thus understood, no natural continuation of thought. That חסן signifies a store, fulness of possessions, property, and abundance, has already been shown under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 15:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but נזר is always the mark of royal, and generally of princely dignity, and here denotes, per meton. signi pro re signata, that dignity itself. With the negative expression in 24a the interrogative in 24b is interchanged as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with the implied negative answer; ואם, of an oath (\"and truly not,\" as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), presents the same thought, but with a passionate colouring here unnecessary. Rightly Fleischer: \"ready money, moveable property, and on the other hand the highest positions of honour, are far more easily torn away from a man, and secure to him far less of quiet prosperity, than husbandry, viewed particularly with respect to the rearing of cattle.\" In other words: the possession of treasures and of a lofty place of power and of honour has not in itself the security of everlasting duration; but rural economy, and particularly the rearing of cattle, gives security for food and clothing. The Chethı̂b לדור דור is found, e.g., at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the Kerı̂ לדּור ודור substitutes the more usual form. If ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " was an independent whole (Hitzig: grass vanishes and fresh green appears, etc.), then the meaning here and onward would be that in the sphere of husbandry it is otherwise than is said in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : there that which is consumed renews itself, and there is an enlarging circulation. But this contrast to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " must be expressed and formed unambiguously. The connection is rather this, that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " commends the rearing of cattle, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " confirms it, and 25ff. discuss what real advantages, not dependent on the accidents of public and social life, it brings.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "I rejoice to agree with Fleischer in the opinion that the perfects of Proverbs 27:25 form a complex hypothetical antecedent to Proverbs 27:26 : Quum evanuerit gramen (sc. vetus) et apparuerint herbae recentes et collecta fuerint pabula montium, agni vestitui tuo (inservient) et pretium agri (sc. a te emendi) erunt hirci, i.e., then wilt thou nourish thy herds of sheep and goats with the grass on thy fields, and with the dried gathered hay; and these will yield for thee, partly immediately and partly by the money derived therefrom (viz., from the valuable goats not needed for the flocks), all that is needful for thy life. He also remarks, under גּלה, that it means to make a place void, empty (viz., to quit the place, vacuer la forteresse); hence to leave one's fatherland or home, to wander abroad; thus, rhetorically and poetically of things and possessions: to disappear. חציר (from חצר, to be green) is hay, and דּשׁא the after-growing second crop (after-grass); thus a meadow capable of being mowed a second time is though of. עשּׂבות הרים (with Dag. dirimens, as e.g., ענּבי Deuteronomy 32:32) are the herbage of the mountains. The time when one proceeds to sheep-shearing, Proverbs 27:25 cannot intend to designate; it sets before us an interesting rural harvest scene, where, after a plentiful ingathering of hay, one sees the meadows again overspread with new grass (Ewald); but with us the shearing of sheep takes place in the month of May, when the warm season of the year is just at hand. The poet means in general to say, that when the hay is mown and now the herbage is grown up, and also the fodder from the mountains (Psalm 106:20) has been gathered home, when thus the barns are filled with plenty, the husbandman is guaranteed against the future on all sides by his stock of cattle. חלב (from חלב, Arab. halyb, with halab) is the usual metaplastic connecting form of חלב, milk. דּי (from דּי, like חי from חי), generally connected with the genitive of the person or thing, for which anything is sufficient (e.g., Proverbs 25:16, דּיּך, to which Fleischer compares Arab. hasbuha, tassuha kifayuha), has here the genitive of the thing of which, or in which, one has enough. The complex subject-conception is limited by Rebia, and the governing דּי has the subordinated disjunctive Legarmeh. עזּים is a word of two genders (epicoenum), Gesen. 107, 1d. In וחיּים the influence of the ל still continues; one does not need to supply it meanwhile, since all that maintains and nourishes life can be called חיים (vita  equals  victus), e.g., Proverbs 3:22. The lxx translates בּיתך by σῶν θεραπόντων, and omits (as also the Syr., but not the Syro-Hexap.) the last line as now superfluous; but that the maids attending to the cattle - by whom we particularly think of milkers - are especially mentioned, intentionally presents the figure of a well-ordered household, full of varied life and activity (Job 40:29). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I rejoice to agree with Fleischer in the opinion that the perfects of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " form a complex hypothetical antecedent to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : Quum evanuerit gramen (sc. vetus) et apparuerint herbae recentes et collecta fuerint pabula montium, agni vestitui tuo (inservient) et pretium agri (sc. a te emendi) erunt hirci, i.e., then wilt thou nourish thy herds of sheep and goats with the grass on thy fields, and with the dried gathered hay; and these will yield for thee, partly immediately and partly by the money derived therefrom (viz., from the valuable goats not needed for the flocks), all that is needful for thy life. He also remarks, under גּלה, that it means to make a place void, empty (viz., to quit the place, vacuer la forteresse); hence to leave one's fatherland or home, to wander abroad; thus, rhetorically and poetically of things and possessions: to disappear. חציר (from חצר, to be green) is hay, and דּשׁא the after-growing second crop (after-grass); thus a meadow capable of being mowed a second time is though of. עשּׂבות הרים (with Dag. dirimens, as e.g., ענּבי ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") are the herbage of the mountains. The time when one proceeds to sheep-shearing, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cannot intend to designate; it sets before us an interesting rural harvest scene, where, after a plentiful ingathering of hay, one sees the meadows again overspread with new grass (Ewald); but with us the shearing of sheep takes place in the month of May, when the warm season of the year is just at hand. The poet means in general to say, that when the hay is mown and now the herbage is grown up, and also the fodder from the mountains (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 106:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") has been gathered home, when thus the barns are filled with plenty, the husbandman is guaranteed against the future on all sides by his stock of cattle. חלב (from חלב, Arab. halyb, with halab) is the usual metaplastic connecting form of חלב, milk. דּי (from דּי, like חי from חי), generally connected with the genitive of the person or thing, for which anything is sufficient (e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 25:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", דּיּך, to which Fleischer compares Arab. hasbuha, tassuha kifayuha), has here the genitive of the thing of which, or in which, one has enough. The complex subject-conception is limited by Rebia, and the governing דּי has the subordinated disjunctive Legarmeh. עזּים is a word of two genders (epicoenum), Gesen. 107, 1d. In וחיּים the influence of the ל still continues; one does not need to supply it meanwhile, since all that maintains and nourishes life can be called חיים (vita  equals  victus), e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 3:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The lxx translates בּיתך by σῶν θεραπόντων, and omits (as also the Syr., but not the Syro-Hexap.) the last line as now superfluous; but that the maids attending to the cattle - by whom we particularly think of milkers - are especially mentioned, intentionally presents the figure of a well-ordered household, full of varied life and activity (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]