[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But a fool’s wrath is heavier than them both",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "harder to bear. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiasticus 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The “fool” here (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "evil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is the headstrong, self-willed person. who has never learned to control himself, but bursts out into the maddest rage when crossed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Proverbs",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE WEIGHT OF SANDProverbs 27:3",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE WEIGHT OF SAND",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This Book of Proverbs has a very wholesome horror of the character which it calls ‘a fool’; meaning thereby, not so much intellectual feebleness as moral and religious obliquity, which are the stupidest things that a man can be guilty of. My text comes from a very picturesque and vivid description, by way of comparison, of the fatal effects of such a man’s passion. The proverb-maker compares two heavy things, stones and sand, and says that they are feathers in comparison with the immense lead-like weight of such a man’s wrath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now I have nothing more to do with the immediate application of my text. I want to make a parable out of it. What is lighter than a grain of sand? What is heavier than a bagful of it? As the grains fall one by one, how easily they can be blown away! Let them gather, and they bury temples, and crush the solid masonry of pyramids. ‘Sand is weighty.’ The accumulation of light things is overwhelmingly ponderous. Are there any such things in our lives? If there are, what ought we to do? So you get the point of view from which I want to look at the words of our text.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The first suggestion that I make is that they remind us of the supreme importance of trifles. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The first suggestion that I make is that they remind us of the supreme importance of trifles.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If trivial acts are unimportant, what signifies the life of man? For ninety-nine and a half per cent. of every man’s life is made up of these light nothings; and unless there is potential greatness in them, and they are of importance, then life is all ‘a tale told by an idiot, full of sound and fury, signifying nothing.’ Small things make life; and if are small, then ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is so too.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But remember, too, that the supreme importance of so-called trivial actions is seen in this, that there may be every bit as much of the noblest things that belong to humanity condensed in, and brought to bear upon, the veriest trifle that a man can do, as on the greatest things that he can perform. We are very poor judges of what is great and what is little. We have a very vulgar estimate that noise and notoriety and the securing of, not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but ‘big,’ results of a material kind make the deeds by which they are secured, great ones. And we think that it is the quiet things, those that do not tell outside at all, that are the small ones.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Well! here is a picture for you. Half-a-dozen shabby, travel-stained Jews, sitting by a river-side upon the grass, talking to a handful of women outside the gates of a great city. Years before that, there had been what the world calls a great event, almost on the same ground-a sanguinary fight, that had settled the emperorship of the then civilised world, for a time. I want to know whether the first preaching of the Gospel in Europe by the Apostle Paul, or the battle of Philippi, was the great event, and which of the two was the little one. I vote for the Jews on the grass, and let all the noise of the fight, though it reverberated through the world for a bit, die away, as ‘a little dust that rises up, and is lightly laid again.’ Not the noisy events are the great ones; and as much true greatness may be manifested in a poor woman stitching in her garret as in some of the things that have rung through the world and excited all manner of vulgar applause. Trifles may be, and often are, the great things in life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then remember, too, how the most trivial actions have a strange knack of all at once leading on to large results, beyond what could have been expected. A man shifts his seat in a railway carriage, from some passing whim, and five minutes afterwards there comes a collision, and the bench where he had been sitting is splintered up, and the place where he is sitting is untouched, and the accidental move has saved his life. According to the old story a boy, failing in applying for a situation, stoops down in the courtyard and picks up a pin, and the millionaire sees him through the window, and it makes his fortune. We cannot tell what may come of anything; and since we do not know the far end of our deeds, let us be quite sure that we have got the near end of them right. Whatever may be the issue, let us look after the motive, and then all will be right. Small seeds grow to be great trees, and in this strange and inexplicable network of things which men call circumstances, and Christians call Providence, the only thing certain is that ‘great’ and ‘small’ all but cease to be a tenable, and certainly altogether cease to be an important distinction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then another thing which I would have you remember is, that it is these trivial actions which, in their accumulated force, make character. Men are not made by crises. The crises reveal what we have made ourselves by the trifles. The way in which we do the little things forms the character according to which we shall act when the great things come. If the crew of a man-of-war were not exercised at boat and fire drill during many a calm day, when all was safe, what would become of them when tempests were raging, or flames breaking through the bulk-heads? It is no time to learn drill then. And we must make our characters by the way in which, day out and day in, we do little things, and find in them fields for the great virtues which will enable us to front the crises of our fate unblenching, and to master whatsoever difficulties come in our path. Geologists nowadays distrust, for the most part, theories which have to invoke great forces in order to mould the face of a country. They tell us that the valley, with its deep sides and wide opening to the sky, may have been made by the slow operation of a tiny brooklet that trickles now down at its base, and by erosion of the atmosphere. So we shape ourselves-and that is a great thing-by the way we do small things.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Therefore, I say to you, dear friends! think solemnly and reverently of this awful life of ours. Clear your minds of the notion that anything is small which offers to you the alternative of being done in a right way or in a wrong; and recognise this as a fact-’sand is weighty,’ trifles are of supreme importance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now, secondly, let me ask you to take this saying as suggesting the overwhelming weight of small sins. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now, secondly, let me ask you to take this saying as suggesting the overwhelming weight of small sins.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That is only an application in one direction of the general principle that I have been trying to lay down; but it is one of such great importance that I wish to deal with it separately. And my point is this, that the accumulated pressure upon a man of a multitude of perfectly trivial faults and transgressions makes up a tremendous aggregate that weighs upon him with awful ponderousness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me remind you, to begin with, that, properly speaking, the words ‘great’ and ‘small’ should not be applied in reference to things about which ‘right’ or ‘wrong’ are the proper words to employ. Or, to put it into plainer language, it is as absurd to talk about the ‘size’ of a sin, as it is to take the superficial area of a picture as a test of its greatness. The magnitude of a transgression does not depend on the greatness of the act which transgresses-according to human standards-but on the intensity with which the sinful element is working in it. For acts make crimes, but motives make sins. If you take a bit of prussic acid, and bruise it down, every little microscopic fragment will have the poisonous principle in it; and it is very irrelevant to ask whether it is as big as a mountain or small as a grain of dust, it is poison all the same. So to talk about magnitude in regard to sins, is rather to introduce a foreign consideration. But still, recognising that there is a reality in the distinction that people make between great sins and small ones, though it is a superficial distinction, and does not go down to the bottom of things, let us deal with it now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I say, then, that small sins, by reason of their numerousness, have a terrible accumulative power. They are like the green flies on our rose-bushes, or the microbes that our medical friends talk so much about nowadays. Like them, their power of mischief does not in the least degree depend on their magnitude, and like them, they have a tremendous capacity of reproduction. It would be easier to find a man that had not done any one sin than to find out a man that had only done it once. And it would be easier to find a man that had done no evil than a man who had not been obliged to make the second edition of his sin an enlarged one. For this is the present Nemesis of all evil, that it requires repetition, partly to still conscience, partly to satisfy excited tastes and desires; so that animal indulgence in drink and the like is a type of what goes on in the inner life of every man, in so far as the second dose has to be stronger than the first in order to produce an equivalent effect; and so on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad infinitum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then remember that all our evil doings, however insignificant they may be, have a strange affinity with one another, so that you will find that to go wrong in one direction almost inevitably leads to a whole series of consequential transgressions of one sort or another. You remember the old story about the soldier that was smuggled into a fortress concealed in a hay cart, and opened the gates of a virgin citadel to his allies outside. Every evil thing, great or small, that we admit into our lives, still more into our hearts, is charged with the same errand as he had:-’ Set wide the door when you are inside, and let us all come in after you.’ ‘He taketh with him seven other spirits worse than himself, and they dwell there.’ ‘None of them,’ says one of the prophets, describing the doleful creatures that haunt the ruins of a deserted city, ‘shall by any means want its mate,’ and the satyrs of the islands and of the woods join together! and hold high carnival in the city. And so, brethren! our little transgressions open the door for great ones, and every sin makes us more accessible to the assaults of every other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So let me remind you how here, in these little unnumbered acts of trivial transgression which scarcely produce any effect on conscience or on memory, but make up so large a portion of so many of our lives, lies one of the most powerful instruments for making us what we are. If we indulge in slight acts of transgression be sure of this, that we shall pass from them to far greater ones. For one man that leaps or falls all at once into sin which the world calls gross, there are a thousand that slide into it. The storm only blows down the trees whose hearts have been eaten out and their roots loosened. And when you see a man having a reputation for wisdom and honour all at once coming crash down and disclosing his baseness, be sure that he began with small deflections from the path of right. The evil works underground; and if we yield to little temptations, when great ones come we shall fall their victims.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me remind you, too, that there is another sense in which ‘sand is weighty.’ You may as well be crushed under a sandhill as under a mountain of marble. It matters not which. The accumulated weight of the one is as great as that of the other. And I wish to lay upon the consciences of all that are listening to me now this thought, that an overwhelming weight of guilt results from the accumulation of little sins. Dear friends! I do not desire to preach a gospel of fear, but I cannot help feeling that, very largely, in this day, the ministration of the Christian Church is defective in that it does not give sufficient, though sad and sympathetic, prominence to the plain teaching of Christ and of the New Testament as to future retribution for present sin. We shall ‘every one of us give account of himself to God’; and if the account is long enough it will foot up to an enormous sum, though each item may be only halfpence. The weight of a lifetime of little sins will be enough to crush a man down with guilt and responsibility when he stands before that Judge. That is all true, and you know it, and I beseech you, take it to your hearts, ‘Sand is weighty.’ Little sins have to be accounted for, and may crush.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now, lastly, let me ask you to consider one or two of the plain, practical issues of such thoughts as these. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now, lastly, let me ask you to consider one or two of the plain, practical issues of such thoughts as these.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And, first, I would say that these considerations set in a very clear light the absolute necessity for all-round and ever-wakeful watchfulness over ourselves. A man in the tropics does not say, ‘Mosquitoes are so small that it does not matter if two or three of them get inside my bed-curtains.’ He takes care that not one is there before he lays himself down to sleep. There seems to be nothing more sad than the complacent, easy-going way in which men allow themselves to keep their higher moral principles and their more rigid self-examination for the ‘great’ things, as they suppose, and let the little things often take care of themselves. What would you think of the captain of a steamer who in calm weather sailed by rule of thumb, only getting out his sextant when storms began to blow? And what about a man that lets the myriad trivialities that make up a day pass in and out of his heart as they will, and never arrests any of them at the gate with a ‘How camest thou in hither?’ ‘Look after the pence, and the pounds will look after themselves.’ Look after your trivial acts, and, take my word for it, the great ones will be as they ought to be.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Again, may not this thought somehow take down our easy-going and self-complacent estimate of ourselves? I have no doubt that there are a number of people in my audience just now who have been more or less consciously saying to themselves whilst I have been going on, ‘What have ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to do with all this talk about sin, sin, sin? I am a decent kind of a man. I do all the duties of my daily life, and nobody can say that the white of my eyes is black. I have done no great transgressions. What is it all about? It has nothing to do with me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Well, my friend! it has this to do with you-that in your life there are a whole host of things which only a very superficial estimate hinders you from recognising to be what they are-small deeds, but great sins. Is it a small thing to go, as some of you do go on from year to year, with your conduct and your thoughts and your loves and your desires utterly unaffected by the fact that there is a God in heaven, and that Jesus Christ died for you? Is that a small thing? It manifests itself in a great many insignificant actions. That I grant you; and you are a most respectable man, and you keep the commandments as well as you can. But ‘the God in whose hand thy breath is, and whose are all thy ways, hast thou not glorified.’ I say that that is not a small sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, dear brethren! I beseech you judge yourselves by this standard. I charge none of you with gross iniquities. I know nothing about that. But I do appeal to you all, as I do to myself, whether we must not recognise the fact that an accumulated multitude of transgressions which are only superficially small, in their aggregate weigh upon us with ‘a weight heavy as frost, and deep almost as life.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Last of all, this being the case, should we not all turn ourselves with lowly hearts, with recognition of our transgressions, acknowledging that whether it be five hundred or fifty pence that we owe, we have nothing to pay, and betake ourselves to Him who alone can deliver us from the habit and power of these small accumulated faults, and who alone can lift the burden of guilt and responsibility from off our shoulders? If you irrigate the sand it becomes fruitful soil. Christ brings to us the river of the water of life; the inspiring, the quickening, the fructifying power of the new life that He bestows, and the sand may become soil, and the wilderness blossom as the rose. A heavy burden lies on our shoulders. Ah! yes! but ‘Behold the Lamb of God that beareth away the sins of the world!’ What was it that crushed Him down beneath the olives of Gethsemane? What was it that made Him cry, ‘My God! Why hast Thou forsaken me?’ I know no answer but one, for which the world’s gratitude is all too small. ‘The Lord hath laid on Him the iniquity of us all.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Sand is weighty,’ but Christ has borne the burden, ‘Cast thy burden upon the Lord,’ and it will drop from your emancipated shoulders, and they will henceforth bear only the light burden of His love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 27:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A stone is heavy, &c., but a fool’s wrath is heavier — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "More grievous and intolerable, as being without cause, without measure, and without end. “Fools and unskilful people,” says Melancthon, “are more apt to be angry than others, because they consider not the infirmity of mankind, and that there are many errors of others which ought to be borne withal, and cured after a gentle manner. For, as goodness is most eminent in God, who himself bears with many evils in us, and commands us to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forgive and it shall be forgiven us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "so wise men bend their minds to goodness and lenity; remembering the common infirmities of all men, their own as well as others. Nor can there be a more lively picture of the implacable spirit of a fool, than that which our Saviour himself hath drawn in the gospel: of a cruel servant, who, when he had been forgiven ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sixty tons ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of gold by his master, would not forgive his fellow-servant a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hundred pence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Matthew 18.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:1 We know not what a day may bring forth. This does not forbid preparing for to-morrow, but presuming upon to-morrow. We must not put off the great work of conversion, that one thing needful. 2. There may be occasion for us to justify ourselves, but not to praise ourselves. 3,4. Those who have no command of their passions, sink under the load. 5,6. Plain and faithful rebukes are better, not only than secret hatred, but than love which compliments in sin, to the hurt of the soul. 7. The poor have a better relish of their enjoyments, and are often more thankful for them, than the rich. In like manner the proud and self-sufficient disdain the gospel; but those who hunger and thirst after righteousness, find comfort from the meanest book or sermon that testifies of Christ Jesus. 8. Every man has his proper place in society, where he may be safe and comfortable.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Compare Ecclus. 22:15; a like comparison between the heaviest material burdens and the more intolerable load of unreasoning passion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. heavy—The literal sense of \"heavy,\" applied to material subjects, illustrates its figurative, \"grievous,\" applied to moral.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a fool's wrath—is unreasonable and excessive.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Heavier; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " more grievous and intolerable, as being without cause, without measure, and without end. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A stone is heavy, and the sand weighty,.... As was the stone which was at the well's mouth, where Laban's flocks were watered, which could not be rolled away till all the shepherds were gathered together, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and like the burdensome stone Jerusalem is compared to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and as that at the sepulchre of Christ, rolled away by the angel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And sand is a very ponderous thing; difficult to be carried, as the Septuagint render it, as a bag of it is; and to which heavy afflictions are sometimes compared, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but a fool's wrath is heavier than them both; it cannot be removed, it rests in his bosom; it is sometimes intolerable to himself; he sinks and dies under the weight of it, as Nabal did: \"wrath killeth the foolish man\", Job 5:2; and it is still more intolerable to others, as Nebuchadnezzar's wrath and his fiery furnace were. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but a fool's wrath is heavier than them both; it cannot be removed, it rests in his bosom; it is sometimes intolerable to himself; he sinks and dies under the weight of it, as Nabal did: \"wrath killeth the foolish man\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and it is still more intolerable to others, as Nebuchadnezzar's wrath and his fiery furnace were. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "A stone is heavy, and the sand weighty; but a fool's wrath is heavier than them both.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Sir 22:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A stone is heavy, and the sand weighty;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "heaviness of a stone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "weight of the sand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The substantives are more forcible than the corresponding adjectives would be: the versions rather weaken the form of the expression by rendering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Grave est saxum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The quality in the things mentioned is weight, heaviness, ponderosity; that is what we are bidden regard. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A fool's wrath is heavier than them both.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The ill temper and anger of a headstrong fool, which he vents on those about him, are harder to endure than any material weight is to carry. Ecclus. 22:15, \"Sand and salt and a mass of iron are easier to bear than a man without understanding.\" The previous verse asks, \"What is heavier than lead? and what is the name thereof  [",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". of the heavier thing], but a fool?\" Job speaks of his grief being heavier than the sand of the sea (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Proverbs 27:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The second pair of proverbs designates two kinds of violent passion as unbearable:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 The heaviness of a stone, the weight of sand - ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   A fool's wrath is heavier than both.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We do not translate: Gravis est petra et onerosa arena, so that the substantives stand for strengthening the idea, instead of the corresponding adjective (Fleischer, as the lxx, Jerome, Syr., Targum); the two pairs of words stand, as 4a, in genit. relation (cf. on the contrary, Proverbs 31:30), and it is as if the poet said: represent to thyself the heaviness of a stone and the weight of sand, and thou shalt find that the wrath of a fool compared thereto is still heavier, viz., for him who has to bear it; thus heavier, not for the fool himself (Hitzig, Zckler, Dchsel), but for others against whom his anger goes forth. A Jewish proverb (vid., Tendlau, No. 901) says, that one knows a man by his wine-glass (כוס), his purse (כיס), and his anger (כעס), viz., how he deports himself in the tumult; and another says that one reads what is in a man ביום כעסו, when he is in an ill-humour. Thus also כעס is to be here understood: the fool in a state of angry, wrathful excitement is so far not master of himself that the worst is to be feared; he sulks and shows hatred, and rages without being appeased; no one can calculate what he may attempt, his behaviour is unendurable. Sand, חול,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We do not translate: Gravis est petra et onerosa arena, so that the substantives stand for strengthening the idea, instead of the corresponding adjective (Fleischer, as the lxx, Jerome, Syr., Targum); the two pairs of words stand, as 4a, in genit. relation (cf. on the contrary, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 31:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and it is as if the poet said: represent to thyself the heaviness of a stone and the weight of sand, and thou shalt find that the wrath of a fool compared thereto is still heavier, viz., for him who has to bear it; thus heavier, not for the fool himself (Hitzig, Zckler, Dchsel), but for others against whom his anger goes forth. A Jewish proverb (vid., Tendlau, No. 901) says, that one knows a man by his wine-glass (כוס), his purse (כיס), and his anger (כעס), viz., how he deports himself in the tumult; and another says that one reads what is in a man ביום כעסו, when he is in an ill-humour. Thus also כעס is to be here understood: the fool in a state of angry, wrathful excitement is so far not master of himself that the worst is to be feared; he sulks and shows hatred, and rages without being appeased; no one can calculate what he may attempt, his behaviour is unendurable. Sand, חול,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Sand is called by the name חוּל (חיל), to change, whirl, particularly to form sand-wreaths, whence (Arab.) al-Habil, the region of moving sand; vid., Wetzstein's Nord-arabien, p. 56.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as it appears, as to the number of its grains innumerable, so as to its mass (in weight) immeasurable, Job 6:3; Sir. 22:13. נטל the Venet. translates, with strict regard to the etymology, by ἅρμα. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "as it appears, as to the number of its grains innumerable, so as to its mass (in weight) immeasurable, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Sir. 22:13. נטל the Venet. translates, with strict regard to the etymology, by ἅρμα. ",
            "children": []
          }
        ]
      }
    ]
  }
]