[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The full soul loatheth an honeycomb.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So the moderate use of the good things of this life increases our enjoyment of them. But in spiritual things, the less we content ourselves with, the less hunger we feel, and less enjoyment do we derive from them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 27:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A full soul — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A man whose appetite, or desire, is fully satisfied; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "loatheth a honey-comb — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The most delicious meats; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but to the hungry every bitter thing is sweet — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hunger makes a man relish the most distasteful food, while full stomachs loathe the most delightful. The design of this proverb is to show the inconvenience that oftentimes attends upon plenty, and the advantage of poverty, that the rich may learn moderation, and the poor content. “Poverty,” says Bishop Patrick, “hath this advantage over plenty, that it disposes men to be thankful for the smallest blessings, though mixed with care and trouble; when the richer sort, if they be not very careful, are apt to be unsatisfied with, nay to nauseate, their most delicious enjoyments, upon which they have long surfeited.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:1 We know not what a day may bring forth. This does not forbid preparing for to-morrow, but presuming upon to-morrow. We must not put off the great work of conversion, that one thing needful. 2. There may be occasion for us to justify ourselves, but not to praise ourselves. 3,4. Those who have no command of their passions, sink under the load. 5,6. Plain and faithful rebukes are better, not only than secret hatred, but than love which compliments in sin, to the hurt of the soul. 7. The poor have a better relish of their enjoyments, and are often more thankful for them, than the rich. In like manner the proud and self-sufficient disdain the gospel; but those who hunger and thirst after righteousness, find comfort from the meanest book or sermon that testifies of Christ Jesus. 8. Every man has his proper place in society, where he may be safe and comfortable.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The special instance covers the general law, that indulgence in pleasure of any kind brings on satiety and weariness, but self-restraint multiplies the sources of enjoyment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. The luxury of wealth confers less happiness than the healthy appetite of labor.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The full soul, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a man whose appetite or desire (which is oft expressed in Scripture by the name of soul) is fully satisfied, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "loatheth an honey-comb, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the most delicious meats. The design of this proverb is to show the inconvenience that ofttimes attends upon plenty, and the advantage of poverty, that the rich might learn moderation, and the poor content. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The full soul loatheth an honeycomb,.... Or \"tramples upon\" it (a), as the word signifies, and most versions render it, expressive of contempt and abhorrence; and suits will the situation of the honeycomb, which was usually in trees and rocks in Palestine: and so might drop from thence, and be trampled upon by passengers; and especially such as are here described, whose appetites have been sated with dainties, and their stomachs heave at the most delicious food. Jarchi interprets this of one that has no desire after the doctrines of the law; and so the senses of it are not esteemed by him; whereas he that has a desire for it, even the things which come to him with bitterness and labour are sweet to him. But it may be better applied to a self-sufficient man, that is full of himself: of his own wisdom and knowledge in divine things; of his strength, and the power of his free will; of his purity, holiness, goodness, and righteousness; who loathes the Gospel, comparable to the honeycomb for its sweetness; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 16:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; it being disagreeable to his taste, and as insipid as the white of an egg to him; and as being against him, which makes him out an arrant fool, blows a blast on all his goodness and goodliness, strips the creature of his righteousness, and excludes boasting; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but to the hungry soul every bitter thing is sweet; that is in want of provision, has an appetite for it; anything, though ever so mean and disrelishing to others, is sweet to such an one; as was barley bread to Artaxerxes king of Persia, and country bread made of bran to Ptolemy Lagus king of Egypt, when in great distress for food (b): Seneca says (c), hunger will make bad bread fine food. And so is the Gospel, and every doctrine of it, to a sensible sinner; that is in want, and knows its wants, and has desires after spiritual things created in it; hungers and thirsts after the word and ordinances; after Christ, the bread of life; after the blessings of grace in him; particularly after the pardon of sin, and justifying righteousness and salvation by him; and after more knowledge of him, and communion with him. Now, though, here is nothing bitter in the Gospel, properly speaking, as in the law; yet, that which is bitter to others, and had been bitter to the above persons, is now sweet, and which are disagreeable to the flesh; as the denial of sinful, civil, and righteous self, which the Gospel teaches; and even that which is the most contemptible to men; as the preaching of the cross, or the doctrine of salvation by a crucified Christ; the doctrines of electing grace, imputed righteousness, the satisfaction of Christ, &c. How sweet are these to the taste of a hungry soul! and even though they are attended with bitter afflictions, the reproaches, revilings, and persecutions of men; as the paschal lamb, a type of Christ, was eaten with bitter herbs. This may also be applied to the hearing of the word; where and when there is plenty of means, men grow weary of the word, sick of it, and surfeit upon it and loath it; or, however, are very curious and nice, and cannot take up with plain preaching, but must have something suited to their palate, dressed up in a very elegant manner: but when the word of the Lord is precious or rare, and where there are few opportunities of hearing it, sensible souls, that have spiritual appetites, are glad of it; and it is sweet unto them, though not so nicely dressed and though brought to them in a homely manner. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) \"calcabit\", Pagninus, Montanus; \"caleat\", Vatablus, Junius & Tremellius, Piscator, Mercerus, Gejerus; \"conculcat\", Cocceius; \"proculcat\", Michaelis, Schultens. (b) \"Jejunus stomachus raro vulgaria temnit\", Horat. Sermon. l. 2. Sat. 2.((c) Epist. 123. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) \"calcabit\", Pagninus, Montanus; \"caleat\", Vatablus, Junius & Tremellius, Piscator, Mercerus, Gejerus; \"conculcat\", Cocceius; \"proculcat\", Michaelis, Schultens. (b) \"Jejunus stomachus raro vulgaria temnit\", Horat. Sermon. l. 2. Sat. 2.((c) Epist. 123. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The full soul loatheth an honeycomb; but to the hungry soul every bitter thing is sweet.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "loatheth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "treads under foot; calcabit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vulg. The second clause of the verse has been compared with Horace’s",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Jejunus stomachus raro vulgaria temnit.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ii. 2. 38.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The full soul loatheth an honeycomb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For \"loathes\" the Hebrew is literally \"treads upon,\" \"tramples underfoot,\" which is the expression of the greatest disgust and contempt; or it may mean that the well-fed man will not stoop to pick up the comb which may have dropped in his path from some tree or rock. But whichever way we take it, the same truth is told - Self-restraint increases enjoyment; over-iudulgence produces satiety, fatigue, and indolence. Horace, 'Sat.,' 2:2, 38 - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "foreign",
        "text": "\"Jejunus raro stomachus vulgaria temnit.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " But to the hungry soul every bitter thing is sweet. So the prodigal in the parable would fain fill himself with the husks which the swine did eat. So we say, \"Hunger is the best sauce;\" the Germans, \"Hunger makes raw beans sweet;\" and the Portuguese. \"Brackish water is sweet in a dry land.\" Proverbs 27:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 27:7-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there is also visible a weaving of the external with the internal. First, there are two proverbs, in each of which there is repeated a word terminating with נ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 A satisfied soul treadeth honeycomb under foot;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   And a hungry soul - everything bitter is (to it) sweet.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is unnecessary to read תּבוּז (Hitzig); תּבוּס is stronger; \"to tread with the feet\" is the extreme degree of scornful despite. That satiety and hunger are applicable to the soul, vid., under Proverbs 10:3. In 7b, the adverb להּ, relative to the nomin. absol., like Proverbs 28:7, but not Proverbs 13:18. \"Hunger is the best cook,\" according to a German proverb; the Hebrew proverb is so formed that it is easily transferred to the sphere of the soul. Let the man whom God has richly satisfied with good things guard himself against ingratitude towards the Giver, and against an undervaluing of the gifts received; and if they are spiritual blessings, let him guard himself against self-satisfaction and self-contentment, which is, in truth, the worst poverty, Revelation 3:17; for life without God is a constant hunger and thirst. There is in worldly things, even the most pleasing, a dissatisfaction felt, and a dissatisfaction awakening disgust; and in spiritual life, a satiety which supposes itself to be full of life, but which is nothing else than the decay of life, than the changing of life into death. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is unnecessary to read תּבוּז (Hitzig); תּבוּס is stronger; \"to tread with the feet\" is the extreme degree of scornful despite. That satiety and hunger are applicable to the soul, vid., under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 10:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In 7b, the adverb להּ, relative to the nomin. absol., like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 28:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but not ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 13:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Hunger is the best cook,\" according to a German proverb; the Hebrew proverb is so formed that it is easily transferred to the sphere of the soul. Let the man whom God has richly satisfied with good things guard himself against ingratitude towards the Giver, and against an undervaluing of the gifts received; and if they are spiritual blessings, let him guard himself against self-satisfaction and self-contentment, which is, in truth, the worst poverty, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for life without God is a constant hunger and thirst. There is in worldly things, even the most pleasing, a dissatisfaction felt, and a dissatisfaction awakening disgust; and in spiritual life, a satiety which supposes itself to be full of life, but which is nothing else than the decay of life, than the changing of life into death. ",
            "children": []
          }
        ]
      }
    ]
  }
]