[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A man that wandereth from his place.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That wandereth forth as an exile that has lost his home. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and, on the contrary, Job’s hope that he would “die in his nest” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 29:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For the spiritual sense comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", s",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "qq.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 27:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 27:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As a bird that wandereth from her nest ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That flies very much abroad from place to place, whereby she is exposed to all the arts of fowlers, and to birds of prey; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so is a man that wandereth from his place — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That, through vanity or lightness, changes the place of his abode or his calling; the ill effects whereof have been frequently observed. The LXX. read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Like as a bird is taken when it leaves its nest, so is a man reduced to servitude when he quits his habitation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:1 We know not what a day may bring forth. This does not forbid preparing for to-morrow, but presuming upon to-morrow. We must not put off the great work of conversion, that one thing needful. 2. There may be occasion for us to justify ourselves, but not to praise ourselves. 3,4. Those who have no command of their passions, sink under the load. 5,6. Plain and faithful rebukes are better, not only than secret hatred, but than love which compliments in sin, to the hurt of the soul. 7. The poor have a better relish of their enjoyments, and are often more thankful for them, than the rich. In like manner the proud and self-sufficient disdain the gospel; but those who hunger and thirst after righteousness, find comfort from the meanest book or sermon that testifies of Christ Jesus. 8. Every man has his proper place in society, where he may be safe and comfortable.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Change of place is thought of as in itself an evil. It is not easy for the man to find another home or the bird another nest. The maxim is characteristic of the earlier stages of Hebrew history, before exile and travel had made change of country a more familiar thing. Compare the feeling which made the thought of being \"a fugitive and a vagabond\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the most terrible of all punishments. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. Such are not only out of place, but out of duty and in danger.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That wandereth from her nest; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that flies very much abroad from place to place, whereby she is exposed to all the arts of fowlers, and to birds of prey, from which she is safe whilst she keeps her nest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That wandereth from his place; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that through vanity or lightness changeth the place of his abode, or his calling and course of life, the ill effects whereof have been frequently observed and noted, even in vulgar proverbs, as when we say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A rolling stone gathers no moss",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As a bird that wandereth from her nest,.... To seek for food for herself and her young; or that leaves it without returning to it, and so her eggs or her young are exposed, and she herself liable to fall into the hands of birds of prey, or of the fowler, when she would be safe in her nest; as there was a law in Israel in her favour, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or as one that is forced out and obliged to wander from place to place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so is a man that wandereth from his place; who, in time of famine and distress, goes into other parts for bread, as Jacob's sons went down into Egypt; and such are they in a spiritual sense who leave all, and follow Christ for food for their souls; or who are forced to flee from place to place, and wander about in deserts and mountains, in dens and caves of the earth, because of the persecution of their enemies; or rather it is to be taken in an ill sense and applied to such who abide not in the calling whereunto they are called; dislike, and are unsatisfied with, their present business of life, and seek new employments, which oftentimes is to the hurt and detriment of themselves and families; and also to such who wander from the way of spiritual understanding, from the place of divine worship, from the word, ordinances, and commandments of the Lord; see Proverbs 21:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so is a man that wandereth from his place; who, in time of famine and distress, goes into other parts for bread, as Jacob's sons went down into Egypt; and such are they in a spiritual sense who leave all, and follow Christ for food for their souls; or who are forced to flee from place to place, and wander about in deserts and mountains, in dens and caves of the earth, because of the persecution of their enemies; or rather it is to be taken in an ill sense and applied to such who abide not in the calling whereunto they are called; dislike, and are unsatisfied with, their present business of life, and seek new employments, which oftentimes is to the hurt and detriment of themselves and families; and also to such who wander from the way of spiritual understanding, from the place of divine worship, from the word, ordinances, and commandments of the Lord; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 21:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "As a bird that wandereth from her nest, so is a man that wandereth from his place.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “The true bird-life is the life of the woods, of the toilsomely-woven nest, of the mate and the brood and the fledglings.… True human life is the life of our fellows, of the diligent laborious housebuilding, of the home, of the young, of the rising nestlings which are to form the next link in the long chain of the generations.” Horton.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As a bird that wandereth from her nest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jerome's ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "avis transmigrans",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " conveys to us a notion of a migratory bird taking its annual journey. But the idea here is of a bird which leaves its own nest either wantonly or from some external reason, and thereby exposes itself to d so comfort and danger (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So is a man that wandereth from his place",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". his own home (comp. Ecclus. 29:21, etc., and 36:28 in Vet. Lat., \"Quis credit ei qui non habet nidum, et deflectens  ubicumque obscuraverit, quasi succinctus latro exsil ins de civitate in civitatem?\"). The proverb indirectly inculcates love of one's home and one's native land. To be \"a fugitive and a vagabond\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") was a terrible punishment, as the Jews have learned by the experience of many centuries. Language and religion placed a barrier against residence in any country but their own (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".); and though at the time when this book was probably written they knew little of foreign travel, yet they regarded sojourn in a strange land as an evil, and centred all their ideas of happiness and comfort in a home life surrounded by friends and countrymen. The word \"wander\" may have the notion of going into exile. Septuagint, \"As when a bird flies down from its own nest, so is a man brought into bondage when he is banished (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀποξενωθῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from his own place.\" Some have reasoned from this expression that the idea of exile had become familiar to the writer, and hence that this portion of the Proverbs is of very late origin (Cheyne) - surely a very uncertain foundation for such a conclusion. The love of Orientals for their native soil is a passion which no sordid and miserable surroundings can extinguish, and a man would consider even a change of home an unmixed evil, though such change was not the result of exile. Our view of the fortunes of one who is always shitting his abode is expressed in the adage, \"A rolling stone gathers no moss.\" Proverbs 27:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8 As a bird that wandereth from her nest,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   So is a man that wandereth from his home.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is not a flying out that is meant, from which at any moment a return is possible, but an unwilling taking to flight (lxx 8b: ὅταν ἀποξενωθῇ; Venet.: πλανούμενον ... πλανούμενος); for עוף נודד, Isaiah 16:2, cf. Jeremiah 4:25, birds that have been frightened; and נדד, Proverbs 21:15., designates the fugitive; cf. נע ונד, Genesis 4:14, and above, Proverbs 26:2, where נוּד designates aimless roving about. Otherwise Fleischer: \"warning against unnecessary roaming about, in journeyings and wanderings far from home: as a bird far from its nest is easily wounded, caught, or killed, so, on such excursions, one easily comes to injury and want. One may think of a journey in the East. The Arabs say, in one of their proverbs: âlsafar ḳaṭ'at man âlklyym ( equals  journeying is a part of the pains of hell).\" But נדד here is not to be understood in the sense of a libere vagari. Rightly C. B. Michaelis: qui vagatur extorris et exul a loco suo sc. natali vel habitationis ordinariae. This proverb mediately recommends the love of one's fatherland, i.e., \"love to the land in which our father has his home; on which our paternal mansion stands; in which we have spent the years of our childhood, so significant a part of one's whole life; from which we have derived our bodily and intellectual nourishment; and in which home we recognise bone of our bone and flesh of our flesh.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is not a flying out that is meant, from which at any moment a return is possible, but an unwilling taking to flight (lxx 8b: ὅταν ἀποξενωθῇ; Venet.: πλανούμενον ... πλανούμενος); for עוף נודד, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 4:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", birds that have been frightened; and נדד, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 21:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., designates the fugitive; cf. נע ונד, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and above, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 26:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where נוּד designates aimless roving about. Otherwise Fleischer: \"warning against unnecessary roaming about, in journeyings and wanderings far from home: as a bird far from its nest is easily wounded, caught, or killed, so, on such excursions, one easily comes to injury and want. One may think of a journey in the East. The Arabs say, in one of their proverbs: âlsafar ḳaṭ'at man âlklyym ( equals  journeying is a part of the pains of hell).\" But נדד here is not to be understood in the sense of a libere vagari. Rightly C. B. Michaelis: qui vagatur extorris et exul a loco suo sc. natali vel habitationis ordinariae. This proverb mediately recommends the love of one's fatherland, i.e., \"love to the land in which our father has his home; on which our paternal mansion stands; in which we have spent the years of our childhood, so significant a part of one's whole life; from which we have derived our bodily and intellectual nourishment; and in which home we recognise bone of our bone and flesh of our flesh.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Gustave Baur's article \"Vaterlandsliebe,\" in Schmid's Pdagogischer Encyklopdie.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But next it says, that to be in a strange land must be an unhappiness, because a man never feels better than at home, as the bird in its nest. We say: Heimat [home] - this beautiful word becomes the German language, which has also coined the expressive idea of Heimweh [longing for home]; the Heb. uses, to express the idea of home, the word מקומי; and of fatherland, the word ארצי or אדמתי. The Heb. שׁבוּת corresponds",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The translators transfer to this place a note from vol. ii. p. 191f. of the author's larger Comm. . den Psalter, to which Delitzsch refers the reader: - \"The modern High German adj. elend, middle High German ellende, old High German alilandi, elilendi, or elilenti, is composed of ali and land. The adj. ali occurs only in old High German in composition. In the Gothic it is found as an independent adj., in the sense of alius and ἄλλυς (vid., Ulfilas, Galatians 5:10). The primary meaning of elilenti is consequently: of another country, foreign. In glosses and translations it is rendered by the Lat. words peregrinus, exul, advena, also captivus. In these meanings it occurs very frequently. In the old High German translation of Ammonius, Diatessaron, sive Harmoniae in quatuor Evangelica, the word proselytism, occurring in Matthew 23:15, is rendered by elilantan. To the adj. the old High German subst. corresponds. This has the meaning exilium, transmigratio, captivitas. The connection in elilenti or elilentes, used adverbially, is rendered by the Lat. peregre. In the middle High German, however, the proper signification of both words greatly predominates. But as, in the old High German, the idea of miser is often at the same time comprehended in the proper signification: he who is miserable through banishment, imprisonment, or through sojourning in a strange land; thus, in several places of the middle High German, this derived idea begins to separate itself from the fundamental conception, so that ellende comes in general to be called miser. In the new High German this derived conception is almost alone maintained. Yet here also, in certain connections, there are found traces of the original idea, e.g., in's Elend schicken, for to banish. Very early also the word came to be used, in a spiritual sense, to denote our present abode, in contrast to paradise or the heavenly kingdom.... Thus, e.g., in one of Luther's hymns, when we pray to the Holy Ghost:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The translators transfer to this place a note from vol. ii. p. 191f. of the author's larger Comm. . den Psalter, to which Delitzsch refers the reader: - \"The modern High German adj. elend, middle High German ellende, old High German alilandi, elilendi, or elilenti, is composed of ali and land. The adj. ali occurs only in old High German in composition. In the Gothic it is found as an independent adj., in the sense of alius and ἄλλυς (vid., Ulfilas, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The primary meaning of elilenti is consequently: of another country, foreign. In glosses and translations it is rendered by the Lat. words peregrinus, exul, advena, also captivus. In these meanings it occurs very frequently. In the old High German translation of Ammonius, Diatessaron, sive Harmoniae in quatuor Evangelica, the word proselytism, occurring in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 23:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is rendered by elilantan. To the adj. the old High German subst. corresponds. This has the meaning exilium, transmigratio, captivitas. The connection in elilenti or elilentes, used adverbially, is rendered by the Lat. peregre. In the middle High German, however, the proper signification of both words greatly predominates. But as, in the old High German, the idea of miser is often at the same time comprehended in the proper signification: he who is miserable through banishment, imprisonment, or through sojourning in a strange land; thus, in several places of the middle High German, this derived idea begins to separate itself from the fundamental conception, so that ellende comes in general to be called miser. In the new High German this derived conception is almost alone maintained. Yet here also, in certain connections, there are found traces of the original idea, e.g., in's Elend schicken, for to banish. Very early also the word came to be used, in a spiritual sense, to denote our present abode, in contrast to paradise or the heavenly kingdom.... Thus, e.g., in one of Luther's hymns, when we pray to the Holy Ghost:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Das er vns behte, an vnserm ende,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Wenn wir heim farn aus diesem elende.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "[That He guard us to our end",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When we go home from this world.]",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - Rud. von Raumer)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to the German Elend, but  equals  Ellend, elilenti, of another land, strange. ",
        "children": []
      }
    ]
  }
]