[{"num":1,"verse":"In the eighth month in the second year of Darius, came the word of the Lord unto Zechariah the son of Berechiah, the son of Iddo the prophet, saying,"},{"num":2,"verse":"“The Lord hath been sorely displeased with your fathers."},{"num":3,"verse":"Therefore say thou unto them: Thus saith the Lord of hosts: ‘Turn ye unto Me,’ saith the Lord of hosts, ‘and I will turn unto you,’ saith the Lord of hosts."},{"num":4,"verse":"Be ye not as your fathers, unto whom the former prophets have cried, saying: Thus saith the Lord of hosts: ‘Turn ye now from your evil ways and from your evil doings.’ But they did not hear, nor hearken unto Me, saith the Lord."},{"num":5,"verse":"Your fathers, where are they? And the prophets, do they live for ever?"},{"num":6,"verse":"But My words and My statutes, which I commanded My servants the prophets, did they not overtake your fathers? And they returned and said,‘As the Lord of hosts thought to do unto us, according to our ways and according to our doings, so hath He dealt with us.’”"},{"num":7,"verse":"Upon the four and twentieth day of the eleventh month, which is the month of Shebat, in the second year of Darius, came the word of the Lord unto Zechariah the son of Berechiah, the son of Iddo the prophet, saying:"},{"num":8,"verse":"I saw by night, and behold, a man riding upon a red horse, and he stood among the myrtle trees that were in the bottom; and behind him were there red horses, speckled, and white."},{"num":9,"verse":"Then said I, “O my lord, what are these?” And the angel that talked with me said unto me, “I will show thee what these be.”"},{"num":10,"verse":"And the man that stood among the myrtle trees answered and said, “These are they whom the Lord hath sent to walk to and fro throughout the earth.”"},{"num":11,"verse":"And they answered the angel of the Lord who stood among the myrtle trees, and said, “We have walked to and fro throughout the earth, and behold, all the earth sitteth still and is at rest.”"},{"num":12,"verse":"Then the angel of the Lord answered and said, “O Lord of hosts, how long wilt Thou not have mercy on Jerusalem and on the cities of Judah, against which Thou hast had indignation these threescore and ten years?”"},{"num":13,"verse":"And the Lord answered the angel who talked with me, with good words and comforting words."},{"num":14,"verse":"So the angel who communed with me said unto me, “Cry thou, saying, Thus saith the Lord of hosts: ‘I am jealous for Jerusalem and for Zion with a great jealousy."},{"num":15,"verse":"And I am very sorely displeased with the heathen who are at ease; for I was but a little displeased, and they helped forward the affliction.’"},{"num":16,"verse":"Therefore thus saith the Lord: ‘I have returned to Jerusalem with mercies. My house shall be built in it,’ saith the Lord of hosts, ‘and a line shall be stretched forth upon Jerusalem.’"},{"num":17,"verse":"Cry yet, saying, Thus saith the Lord of hosts: ‘My cities through prosperity shall yet be spread abroad; and the Lord shall yet comfort Zion, and shall yet choose Jerusalem.’”"},{"num":18,"verse":"Then I lifted up mine eyes and saw, and behold, four horns."},{"num":19,"verse":"And I said unto the angel who talked with me, “What are these?” And he answered me, “These are the horns which have scattered Judah, Israel, and Jerusalem.”"},{"num":20,"verse":"And the Lord showed me four carpenters."},{"num":21,"verse":"Then said I, “What come these to do?” And he spoke, saying, “These are the horns which have scattered Judah, so that no man lifted up his head; but these have come to frighten them, to cast out the horns of the Gentiles who lifted up their horn over the land of Judah to scatter it.”"}]