[{"header":"The Lord Calls His People to Turn from Sin"},{"num":1,"verse":"In the eighth month of the second year of Darius, the Word of the Lord came to Zechariah the man of God, the son of Berechiah, the son of Iddo, saying, "},{"num":2,"verse":"“The Lord was very angry with your fathers. "},{"num":3,"verse":"So tell them, ‘The Lord of All says, “Return to Me, that I may return to you. "},{"num":4,"verse":"Do not be like your fathers. The men who spoke for Me in the past told them, ‘The Lord of All says, “Return from your sinful ways and from your sinful works.”’ But they did not listen to Me,” says the Lord. "},{"num":5,"verse":"“Where are your fathers now? And the men who spoke for Me, do they live forever? "},{"num":6,"verse":"I gave My Words and My Laws to your fathers through My servants who spoke for Me. But they would not listen and so they were punished. Then they were sorry for their sins and said, ‘The Lord of All has punished us for our ways and our works, as He said He would.’”’”"},{"header":"Zechariah Sees Horses during the Night"},{"num":7,"verse":"On the twenty-fourth day of the eleventh month, the month of Shebat, in the second year of Darius, the Word of the Lord came to Zechariah the man of God, the son of Berechiah, the son of Iddo. "},{"num":8,"verse":"During the night while I was sleeping I saw a man traveling on a red horse. He was standing among the myrtle trees in the narrow valley, with red, brown, and white horses behind him. "},{"num":9,"verse":"I asked, “My lord, what are these?” And the angel who was speaking with me said, “I will show you what these are.” "},{"num":10,"verse":"So the man who was standing among the myrtle trees said, “These are the ones whom the Lord has sent to travel all over the earth to keep watch.” "},{"num":11,"verse":"And they said to the angel of the Lord who was standing among the myrtle trees, “We have looked over all the earth, and saw that the whole earth is at rest and in peace.”"},{"header":"The Lord Comforts Jerusalem"},{"num":12,"verse":"Then the angel of the Lord said, “O Lord of All, how long will You have no loving-pity for Jerusalem and the cities of Judah? You have been angry with them for seventy years now.” "},{"num":13,"verse":"And the Lord spoke kind and comforting words to the angel who was speaking with me. "},{"num":14,"verse":"So the angel who was speaking with me said to me, “Make this known: ‘The Lord of All says, “I am very jealous for Jerusalem and Zion. "},{"num":15,"verse":"But I am very angry with the nations who take it easy. When I was only a little angry, they added to the trouble.” "},{"num":16,"verse":"So the Lord says, “I will return to Jerusalem with loving-pity. My house will be built in it and all Jerusalem will be built again,” says the Lord of All. "},{"num":17,"verse":"Also make this known: ‘The Lord of All says, “My cities will again be filled with riches. The Lord will again comfort Zion and again choose Jerusalem.”’”"},{"header":"Zechariah Sees Horns"},{"num":18,"verse":"Then I looked up and saw four horns. "},{"num":19,"verse":"So I said to the angel who was speaking with me, “What are these?” And he said, “These are the horns which have divided the people of Judah, Israel, and Jerusalem.” "},{"num":20,"verse":"Then the Lord showed me four workmen. "},{"num":21,"verse":"I said, “What are these coming to do?” And he said, “These are the horns which have sent the people of Judah everywhere, so that no man raised his head. But these workmen have come to make them afraid and to throw down the horns of the nations who have lifted up their horns against the land of Judah so the people would be sent everywhere.”"}]