[{"header":"The Seventh Seal"},{"num":8,"verse":"The Lamb opened the seventh seal. Then there was silence in heaven for about half an hour."},{"num":2,"verse":"And I saw the seven angels who stand before God. They were given seven trumpets."},{"num":3,"verse":"Another angel came and stood at the altar. This angel had a golden holder for incense. The angel was given much incense to offer with the prayers of all God’s holy people. The angel put this offering on the golden altar before the throne."},{"num":4,"verse":"The smoke from the incense went up from the angel’s hand to God. The smoke went up with the prayers of God’s people."},{"num":5,"verse":"Then the angel filled the incense holder with fire from the altar and threw it down on the earth. Then there were flashes of lightning, thunder and other noises, and an earthquake."},{"header":"The First of Seven Trumpet Blasts"},{"num":6,"verse":"Then the seven angels with the seven trumpets prepared to blow their trumpets."},{"num":7,"verse":"The first angel blew his trumpet. Then hail and fire mixed with blood was poured down on the earth. And a third of the earth and all the green grass and a third of the trees were burned up."},{"num":8,"verse":"The second angel blew his trumpet. Then something that looked like a big mountain burning with fire was thrown into the sea. And a third of the sea became blood."},{"num":9,"verse":"And a third of the created beings in the sea died, and a third of the ships were destroyed."},{"num":10,"verse":"The third angel blew his trumpet. Then a large star, burning like a torch, fell from the sky. It fell on a third of the rivers and on the springs of water."},{"num":11,"verse":"The name of the star was Bitterness. And a third of all the water became bitter. Many people died from drinking this bitter water."},{"num":12,"verse":"The fourth angel blew his trumpet. Then a third of the sun and a third of the moon and a third of the stars were struck. So a third of them became dark. A third of the day and night was without light."},{"num":13,"verse":"While I watched, I heard an eagle that was flying high in the air. The eagle said in a loud voice, “Terrible! Terrible! How terrible for those who live on the earth! The terrible trouble will begin after the sounds of the trumpets that the other three angels will blow.”"}]