[[],[{"type":"prose","content":"When the Lamb ripped off the seventh seal, Heaven fell quiet—complete silence for about half an hour."},{"type":"header","content":"Blowing the Trumpets"}],[{"type":"prose","content":"I saw the Seven Angels who are always in readiness before God handed seven trumpets. Then another Angel, carrying a gold censer, came and stood at the Altar. He was given a great quantity of incense so that he could offer up the prayers of all the holy people of God on the Golden Altar before the Throne. Smoke billowed up from the incense-laced prayers of the holy ones, rose before God from the hand of the Angel."}],[{"type":"prose","content":"Then the Angel filled the censer with fire from the Altar and heaved it to earth. It set off thunders, voices, lightnings, and an earthquake."}],[{"type":"prose","content":"The Seven Angels with the trumpets got ready to blow them. At the first trumpet blast, hail and fire mixed with blood were dumped on earth. A third of the earth was scorched, a third of the trees, and every blade of green grass—burned to a crisp."}],[{"type":"prose","content":"The second Angel trumpeted. Something like a huge mountain blazing with fire was flung into the sea. A third of the sea turned to blood, a third of the living sea creatures died, and a third of the ships sank."}],[{"type":"prose","content":"The third Angel trumpeted. A huge Star, blazing like a torch, fell from Heaven, wiping out a third of the rivers and a third of the springs. The Star’s name was Wormwood. A third of the water turned bitter, and many people died from the poisoned water."}],[{"type":"prose","content":"The fourth Angel trumpeted. A third of the sun, a third of the moon, and a third of the stars were hit, blacked out by a third, both day and night in one-third blackout."}],[{"type":"prose","content":"I looked hard; I heard a lone eagle, flying through Middle-Heaven, crying out ominously, “Doom! Doom! Doom to everyone left on earth! There are three more Angels about to blow their trumpets. Doom is on its way!”* * *"}]]