[{"header":"Chapter 8"},{"num":1,"verse":"The Seventh Seal. When the Lamb broke open the seventh seal, there was silence in heaven for about half an hour."},{"num":2,"verse":"And I saw that seven trumpets were given to the seven angels who stand in the presence of God."},{"num":3,"verse":"Another angel came forward with a gold censer and stood at the altar. He was given a large quantity of incense to offer, with the prayers of all the saints, on the gold altar that stood before the throne."},{"num":4,"verse":"The smoke of the incense together with the prayers of the saints rose before God from the hand of the angel."},{"num":5,"verse":"Then the angel took the censer, filled it with fire from the altar, and emptied it upon the earth. Immediately, there came peals of thunder, rumblings, flashes of lightning, and an earthquake."},{"num":6,"verse":"The seven angels who held the seven trumpets now made ready to blow them."},{"num":7,"verse":"The First Four Trumpets. When the first angel blew his trumpet, there was a storm of hail and fire, mixed with blood, and it fell upon the earth. A third of the earth was burned up, as well as a third of the trees and all the green grass."},{"num":8,"verse":"When the second angel blew his trumpet, something that looked like a huge mountain ablaze with fire was hurled into the sea. A third of the sea turned into blood,"},{"num":9,"verse":"a third of the creatures living in the sea died, and a third of the ships were destroyed."},{"num":10,"verse":"When the third angel blew his trumpet, a great star fell from the sky, burning like a torch. It came down on a third of the rivers and on the springs of water."},{"num":11,"verse":"This star was called “Wormwood,” and a third of the waters turned to wormwood. Great numbers of people died from the waters that had become bitter."},{"num":12,"verse":"When the fourth angel blew his trumpet, a third of the sun was struck, a third of the moon, and a third of the stars. As a result, a third of their light was darkened, and the day lost its illumination for a third of the time, and so did the night."},{"num":13,"verse":"The Cry of the Eagle. In my vision, I heard an eagle cry out in a loud voice as it flew high overhead, “Woe! Woe! Woe to the inhabitants of the earth because of the other trumpet blasts that the three angels have not yet blown!”"}]