[{"header":"The Two Witnesses"},{"num":11,"verse":"I was given a measuring stick like a rod, and I was told, “Go and measure the temple of God and the altar, and count the people worshiping there. "},{"num":2,"verse":"But do not measure the yard outside the temple. Leave it alone, because it has been given to those who are not God’s people. And they will trample on the holy city for forty-two months. "},{"num":3,"verse":"And I will give power to my two witnesses to prophesy for one thousand two hundred sixty days, and they will be dressed in rough cloth to show their sadness.”"},{"num":4,"verse":"These two witnesses are the two olive trees and the two lampstands that stand before the Lord of the earth. "},{"num":5,"verse":"And if anyone tries to hurt them, fire comes from their mouths and kills their enemies. And if anyone tries to hurt them in whatever way, in that same way that person will die. "},{"num":6,"verse":"These witnesses have the power to stop the sky from raining during the time they are prophesying. And they have power to make the waters become blood, and they have power to send every kind of trouble to the earth as many times as they want."},{"num":7,"verse":"When the two witnesses have finished telling their message, the beast that comes up from the bottomless pit will fight a war against them. He will defeat them and kill them. "},{"num":8,"verse":"The bodies of the two witnesses will lie in the street of the great city where the Lord was killed. This city is named Sodom and Egypt, which has a spiritual meaning. "},{"num":9,"verse":"Those from every race of people, tribe, language, and nation will look at the bodies of the two witnesses for three and one-half days, and they will refuse to bury them. "},{"num":10,"verse":"People who live on the earth will rejoice and be happy because these two are dead. They will send each other gifts, because these two prophets brought much suffering to those who live on the earth."},{"num":11,"verse":"But after three and one-half days, God put the breath of life into the two prophets again. They stood on their feet, and everyone who saw them became very afraid. "},{"num":12,"verse":"Then the two prophets heard a loud voice from heaven saying, “Come up here!” And they went up into heaven in a cloud as their enemies watched."},{"num":13,"verse":"In the same hour there was a great earthquake, and a tenth of the city was destroyed. Seven thousand people were killed in the earthquake, and those who did not die were very afraid and gave glory to the God of heaven."},{"num":14,"verse":"The second trouble is finished. Pay attention: The third trouble is coming soon."},{"header":"The Seventh Trumpet"},{"num":15,"verse":"Then the seventh angel blew his trumpet. And there were loud voices in heaven, saying:"},{"num":16,"verse":"Then the twenty-four elders, who sit on their thrones before God, bowed down on their faces and worshiped God. "},{"num":17,"verse":"They said:"},{"num":19,"verse":"Then God’s temple in heaven was opened. The Ark that holds the agreement God gave to his people could be seen in his temple. Then there were flashes of lightning, noises, thunder, an earthquake, and a great hailstorm."}]