[{"num":15,"verse":"And now let me remind you [since it seems to have escaped you], brethren, of the Gospel (the glad tidings of salvation) which I proclaimed to you, which you welcomed and accepted and upon which your faith rests,"},{"num":2,"verse":"And by which you are saved, if you hold fast and keep firmly what I preached to you, unless you believed at first without effect and all for nothing."},{"num":3,"verse":"For I passed on to you first of all what I also had received, that Christ (the Messiah, the Anointed One) died for our sins in accordance with [what] the Scriptures [foretold],"},{"num":4,"verse":"That He was buried, that He arose on the third day as the Scriptures foretold,"},{"num":5,"verse":"And [also] that He appeared to Cephas (Peter), then to the Twelve."},{"num":6,"verse":"Then later He showed Himself to more than five hundred brethren at one time, the majority of whom are still alive, but some have fallen asleep [in death]."},{"num":7,"verse":"Afterward He was seen by James, then by all the apostles (the special messengers),"},{"num":8,"verse":"And last of all He appeared to me also, as to one prematurely and born dead [no better than an unperfected fetus among living men]."},{"num":9,"verse":"For I am the least [worthy] of the apostles, who am not fit or deserving to be called an apostle, because I once wronged and pursued and molested the church of God [oppressing it with cruelty and violence]."},{"num":10,"verse":"But by the grace (the unmerited favor and blessing) of God I am what I am, and His grace toward me was not [found to be] for nothing (fruitless and without effect). In fact, I worked harder than all of them [the apostles], though it was not really I, but the grace (the unmerited favor and blessing) of God which was with me."},{"num":11,"verse":"So, whether then it was I or they, this is what we preach and this is what you believed [what you adhered to, trusted in, and relied on]."},{"num":12,"verse":"But now if Christ (the Messiah) is preached as raised from the dead, how is it that some of you say that there is no resurrection of the dead?"},{"num":13,"verse":"But if there is no resurrection of the dead, then Christ has not risen;"},{"num":14,"verse":"And if Christ has not risen, then our preaching is in vain [it amounts to nothing] and your faith is devoid of truth and is fruitless (without effect, empty, imaginary, and unfounded)."},{"num":15,"verse":"We are even discovered to be misrepresenting God, for we testified of Him that He raised Christ, Whom He did not raise in case it is true that the dead are not raised."},{"num":16,"verse":"For if the dead are not raised, then Christ has not been raised;"},{"num":17,"verse":"And if Christ has not been raised, your faith is mere delusion [futile, fruitless], and you are still in your sins [under the control and penalty of sin];"},{"num":18,"verse":"And further, those who have died in [spiritual fellowship and union with] Christ have perished (are lost)!"},{"num":19,"verse":"If we who are [abiding] in Christ have hope only in this life and that is all, then we are of all people most miserable and to be pitied."},{"num":20,"verse":"But the fact is that Christ (the Messiah) has been raised from the dead, and He became the firstfruits of those who have fallen asleep [in death]."},{"num":21,"verse":"For since [it was] through a man that death [came into the world, it is] also through a Man that the resurrection of the dead [has come]."},{"num":22,"verse":"For just as [because of their union of nature] in Adam all people die, so also [by virtue of their union of nature] shall all in Christ be made alive."},{"num":23,"verse":"But each in his own rank and turn: Christ (the Messiah) [is] the firstfruits, then those who are Christ’s [own will be resurrected] at His coming."},{"num":24,"verse":"After that comes the end (the completion), when He delivers over the kingdom to God the Father after rendering inoperative and abolishing every [other] rule and every authority and power."},{"num":25,"verse":"For [Christ] must be King and reign until He has put all [His] enemies under His feet."},{"num":26,"verse":"The last enemy to be subdued and abolished is death."},{"num":27,"verse":"For He [the Father] has put all things in subjection under His [Christ’s] feet. But when it says, All things are put in subjection [under Him], it is evident that He [Himself] is excepted Who does the subjecting of all things to Him."},{"num":28,"verse":"However, when everything is subjected to Him, then the Son Himself will also subject Himself to [the Father] Who put all things under Him, so that God may be all in all [be everything to everyone, supreme, the indwelling and controlling factor of life]."},{"num":29,"verse":"Otherwise, what do people mean by being [themselves] baptized in behalf of the dead? If the dead are not raised at all, why are people baptized for them?"},{"num":30,"verse":"[For that matter], why do I live [dangerously as I do, running such risks that I am] in peril every hour?"},{"num":31,"verse":"[I assure you] by the pride which I have in you in [your fellowship and union with] Christ Jesus our Lord, that I die daily [I face death every day and die to self]."},{"num":32,"verse":"What do I gain if, merely from the human point of view, I fought with [wild] beasts at Ephesus? If the dead are not raised [at all], let us eat and drink, for tomorrow we will be dead."},{"num":33,"verse":"Do not be so deceived and misled! Evil companionships (communion, associations) corrupt and deprave good manners and morals and character."},{"num":34,"verse":"Awake [from your drunken stupor and return] to sober sense and your right minds, and sin no more. For some of you have not the knowledge of God [you are utterly and willfully and disgracefully ignorant, and continue to be so, lacking the sense of God’s presence and all true knowledge of Him]. I say this to your shame."},{"num":35,"verse":"But someone will say, How can the dead be raised? With what [kind of] body will they come forth?"},{"num":36,"verse":"You foolish man! Every time you plant seed, you sow something that does not come to life [germinating, springing up, and growing] unless it dies first."},{"num":37,"verse":"Nor is the seed you sow then the body which it is going to have [later], but it is a naked kernel, perhaps of wheat or some of the rest of the grains."},{"num":38,"verse":"But God gives to it the body that He plans and sees fit, and to each kind of seed a body of its own."},{"num":39,"verse":"For all flesh is not the same, but there is one kind for humans, another for beasts, another for birds, and another for fish."},{"num":40,"verse":"There are heavenly bodies (sun, moon, and stars) and there are earthly bodies (men, animals, and plants), but the beauty and glory of the heavenly bodies is of one kind, while the beauty and glory of earthly bodies is a different kind."},{"num":41,"verse":"The sun is glorious in one way, the moon is glorious in another way, and the stars are glorious in their own [distinctive] way; for one star differs from and surpasses another in its beauty and brilliance."},{"num":42,"verse":"So it is with the resurrection of the dead. [The body] that is sown is perishable and decays, but [the body] that is resurrected is imperishable (immune to decay, immortal)."},{"num":43,"verse":"It is sown in dishonor and humiliation; it is raised in honor and glory. It is sown in infirmity and weakness; it is resurrected in strength and endued with power."},{"num":44,"verse":"It is sown a natural (physical) body; it is raised a supernatural (a spiritual) body. [As surely as] there is a physical body, there is also a spiritual body."},{"num":45,"verse":"Thus it is written, The first man Adam became a living being (an individual personality); the last Adam (Christ) became a life-giving Spirit [restoring the dead to life]."},{"num":46,"verse":"But it is not the spiritual life which came first, but the physical and then the spiritual."},{"num":47,"verse":"The first man [was] from out of earth, made of dust (earthly-minded); the second Man [is] the Lord from out of heaven."},{"num":48,"verse":"Now those who are made of the dust are like him who was first made of the dust (earthly-minded); and as is [the Man] from heaven, so also [are those] who are of heaven (heavenly-minded)."},{"num":49,"verse":"And just as we have borne the image [of the man] of dust, so shall we and so let us also bear the image [of the Man] of heaven."},{"num":50,"verse":"But I tell you this, brethren, flesh and blood cannot [become partakers of eternal salvation and] inherit or share in the kingdom of God; nor does the perishable (that which is decaying) inherit or share in the imperishable (the immortal)."},{"num":51,"verse":"Take notice! I tell you a mystery (a secret truth, an event decreed by the hidden purpose or counsel of God). We shall not all fall asleep [in death], but we shall all be changed (transformed)"},{"num":52,"verse":"In a moment, in the twinkling of an eye, at the [sound of the] last trumpet call. For a trumpet will sound, and the dead [in Christ] will be raised imperishable (free and immune from decay), and we shall be changed (transformed)."},{"num":53,"verse":"For this perishable [part of us] must put on the imperishable [nature], and this mortal [part of us, this nature that is capable of dying] must put on immortality (freedom from death)."},{"num":54,"verse":"And when this perishable puts on the imperishable and this that was capable of dying puts on freedom from death, then shall be fulfilled the Scripture that says, Death is swallowed up (utterly vanquished forever) in and unto victory."},{"num":55,"verse":"O death, where is your victory? O death, where is your sting?"},{"num":56,"verse":"Now sin is the sting of death, and sin exercises its power [upon the soul] through [the abuse of] the Law."},{"num":57,"verse":"But thanks be to God, Who gives us the victory [making us conquerors] through our Lord Jesus Christ."},{"num":58,"verse":"Therefore, my beloved brethren, be firm (steadfast), immovable, always abounding in the work of the Lord [always being superior, excelling, doing more than enough in the service of the Lord], knowing and being continually aware that your labor in the Lord is not futile [it is never wasted or to no purpose]."}]