[{"num":15,"verse":"Now, brothers, I must remind you of the Good News which I proclaimed to you, and which you received, and on which you have taken your stand, "},{"num":2,"verse":"and by which you are being saved — provided you keep holding fast to the message I proclaimed to you. For if you don’t, your trust will have been in vain. "},{"num":3,"verse":"For among the first things I passed on to you was what I also received, namely this: the Messiah died for our sins, in accordance with what the Tanakh says; "},{"num":4,"verse":"and he was buried; and he was raised on the third day, in accordance with what the Tanakh says; "},{"num":5,"verse":"and he was seen by Kefa, then by the Twelve; "},{"num":6,"verse":"and afterwards he was seen by more than five hundred brothers at one time, the majority of whom are still alive, though some have died. "},{"num":7,"verse":"Later he was seen by Ya‘akov, then by all the emissaries; "},{"num":8,"verse":"and last of all he was seen by me, even though I was born at the wrong time. "},{"num":9,"verse":"For I am the least of all the emissaries, unfit to be called an emissary, because I persecuted the Messianic Community of God. "},{"num":10,"verse":"But by God’s grace I am what I am, and his grace towards me was not in vain; on the contrary, I have worked harder than all of them, although it was not I but the grace of God with me. "},{"num":11,"verse":"Anyhow, whether I or they, this is what we proclaim, and this is what you believed."},{"num":12,"verse":"But if it has been proclaimed that the Messiah has been raised from the dead, how is it that some of you are saying there is no such thing as a resurrection of the dead? "},{"num":13,"verse":"If there is no resurrection of the dead, then the Messiah has not been raised; "},{"num":14,"verse":"and if the Messiah has not been raised, then what we have proclaimed is in vain; also your trust is in vain; "},{"num":15,"verse":"furthermore, we are shown up as false witnesses for God in having testified that God raised up the Messiah, whom he did not raise if it is true that the dead are not raised. "},{"num":16,"verse":"For if the dead are not raised, then the Messiah has not been raised either; "},{"num":17,"verse":"and if the Messiah has not been raised, your trust is useless, and you are still in your sins. "},{"num":18,"verse":"Also, if this is the case, those who died in union with the Messiah are lost. "},{"num":19,"verse":"If it is only for this life that we have put our hope in the Messiah, we are more pitiable than anyone."},{"num":20,"verse":"But the fact is that the Messiah has been raised from the dead, the firstfruits of those who have died. "},{"num":21,"verse":"For since death came through a man, also the resurrection of the dead has come through a man. "},{"num":22,"verse":"For just as in connection with Adam all die, so in connection with the Messiah all will be made alive. "},{"num":23,"verse":"But each in his own order: the Messiah is the firstfruits; then those who belong to the Messiah, at the time of his coming; "},{"num":24,"verse":"then the culmination, when he hands over the Kingdom to God the Father, after having put an end to every rulership, yes, to every authority and power. "},{"num":25,"verse":"For he has to rule until he puts all his enemies under his feet. "},{"num":26,"verse":"The last enemy to be done away with will be death, "},{"num":27,"verse":"for “He put everything in subjection under his feet.” But when it says that “everything” has been subjected, obviously the word does not include God, who is himself the one subjecting everything to the Messiah. "},{"num":28,"verse":"Now when everything has been subjected to the Son, then he will subject himself to God, who subjected everything to him; so that God may be everything in everyone."},{"num":29,"verse":"Were it otherwise, what would the people accomplish who are immersed on behalf of the dead? If the dead are not actually raised, why are people immersed for them? "},{"num":30,"verse":"For that matter, we ourselves — why do we keep facing danger hour by hour? "},{"num":31,"verse":"Brothers, by the right to be proud which the Messiah Yeshua our Lord gives me, I solemnly tell you that I die every day. "},{"num":32,"verse":"If my fighting with “wild beasts” in Ephesus was done merely on a human basis, what do I gain by it? If dead people are not raised, we might as well live by the saying, “Let’s eat and drink, for tomorrow we die!” "},{"num":33,"verse":"Don’t be fooled. “Bad company ruins good character.” "},{"num":34,"verse":"Come to your senses! Live righteously and stop sinning! There are some people who lack knowledge of God — I say this to your shame."},{"num":35,"verse":"But someone will ask, “In what manner are the dead raised? What sort of body do they have?” "},{"num":36,"verse":"Stupid! When you sow a seed, it doesn’t come alive unless it first dies. "},{"num":37,"verse":"Also, what you sow is not the body that will be, but a bare seed of, say, wheat or something else; "},{"num":38,"verse":"but God gives it the body he intended for it; and to each kind of seed he gives its own body. "},{"num":39,"verse":"Not all living matter is the same living matter; on the contrary, there is one kind for human beings, another kind of living matter for animals, another for birds and another for fish. "},{"num":40,"verse":"Further, there are heavenly bodies and earthly bodies; but the beauty of heavenly bodies is one thing, while the beauty of earthly bodies is something else. "},{"num":41,"verse":"The sun has one kind of beauty, the moon another, the stars yet another; indeed, each star has its own individual kind of beauty."},{"num":42,"verse":"So it is with the resurrection of the dead. When the body is “sown,” it decays; when it is raised, it cannot decay. "},{"num":43,"verse":"When sown, it is without dignity; when raised, it will be beautiful. When sown, it is weak; when raised, it will be strong. "},{"num":44,"verse":"When sown, it is an ordinary human body; when raised, it will be a body controlled by the Spirit. If there is an ordinary human body, there is also a body controlled by the Spirit. "},{"num":45,"verse":"In fact, the Tanakh says so: Adam, the first man, became a living human being; but the last “Adam” has become a life-giving Spirit. "},{"num":46,"verse":"Note, however, that the body from the Spirit did not come first, but the ordinary human one; the one from the Spirit comes afterwards. "},{"num":47,"verse":"The first man is from the earth, made of dust; the second man is from heaven. "},{"num":48,"verse":"People born of dust are like the man of dust, and people born from heaven are like the man from heaven; "},{"num":49,"verse":"and just as we have borne the image of the man of dust, so also we will bear the image of the man from heaven."},{"num":50,"verse":"Let me say this, brothers: flesh and blood cannot share in the Kingdom of God, nor can something that decays share in what does not decay. "},{"num":51,"verse":"Look, I will tell you a secret — not all of us will die! But we will all be changed! "},{"num":52,"verse":"It will take but a moment, the blink of an eye, at the final shofar. For the shofar will sound, and the dead will be raised to live forever, and we too will be changed. "},{"num":53,"verse":"For this material which can decay must be clothed with imperishability, this which is mortal must be clothed with immortality. "},{"num":54,"verse":"When what decays puts on imperishability and what is mortal puts on immortality, then this passage in the Tanakh will be fulfilled:"},{"num":56,"verse":"The sting of death is sin; and sin draws its power from the Torah; "},{"num":57,"verse":"but thanks be to God, who gives us the victory through our Lord Yeshua the Messiah!"},{"num":58,"verse":"So, my dear brothers, stand firm and immovable, always doing the Lord’s work as vigorously as you can, knowing that united with the Lord your efforts are not in vain."}]