[{"num":15,"verse":"Now, my brothers, I want to bring the good news to your minds again. I told it to you and you received it. You now believe it."},{"num":2,"verse":"You are saved by it, if you hold on to what I told you. If you do not, then you have believed for nothing."},{"num":3,"verse":"I told you first what was told to me. I told you that Christ died for the wrong things we did, as the holy writings said."},{"num":4,"verse":"He was buried. He was raised on the third day, as the holy writings said."},{"num":5,"verse":"Peter saw him, and then all the twelve disciples saw him."},{"num":6,"verse":"After that, more than five hundred Christian brothers saw him at one time. Most of them are still living, but some have died."},{"num":7,"verse":"After that, James saw him. Then all the apostles saw him."},{"num":8,"verse":"Last of all, I saw him too. I was like one who was born at the wrong time."},{"num":9,"verse":"The other apostles are all greater than I am. I should not be called an apostle because I troubled the people of God's church."},{"num":10,"verse":"But God has been kind to me. He has made me what I am today. And he did not bless me for nothing. I did more work than any of them. Yet it was not I, but the loving kindness of God was working with me."},{"num":11,"verse":"So it does not matter who gave the message, they or I. This is the message we gave, and this is the message you believed."},{"num":12,"verse":"You have been told that Christ was raised from death. How can some of you say that dead people do not rise again?"},{"num":13,"verse":"If dead people do not rise, Christ did not rise."},{"num":14,"verse":"And if Christ did not rise, then what we told you was not true, and what you believe is not true."},{"num":15,"verse":"If this were so, we would have been telling lies about God, because we said that God raised up Christ. He did not raise up Christ if dead people are not raised up."},{"num":16,"verse":"If dead people are not raised, then Christ was not raised either."},{"num":17,"verse":"If Christ was not raised, then what you believe is no good. Your wrong ways have not been forgiven."},{"num":18,"verse":"If that were true, then the people who believed in Christ who have now died, are lost."},{"num":19,"verse":"And if we have hope in Christ for our life in this world only, then we are the most unhappy of all people."},{"num":20,"verse":"But Christ really has been raised from death. He was the first one to rise of all who have died."},{"num":21,"verse":"It was a man who first brought death. So it was also a man who was first raised from death."},{"num":22,"verse":"All people who are of Adam die. And so also, all people who belong to Christ will live."},{"num":23,"verse":"But each one has his turn. Christ rose first. Then those who belong to Christ will rise when he comes again."},{"num":24,"verse":"After that the end will come. Christ will hand over the ruling power to God the Father. Christ will stop all other rulers, and everyone who has any rights and power."},{"num":25,"verse":"Christ must rule until God has all power over all his enemies."},{"num":26,"verse":"Death is the last enemy to be destroyed."},{"num":27,"verse":"The holy writings say, `God has put all things under Christ.' But it does not mean that God is under Christ. God is the one who put all things under him."},{"num":28,"verse":"One day the Son will be over all things. And God will be over the Son. So in the end God will be over all things."},{"num":29,"verse":"Another thing, what good is it for people to be baptized for dead people? If dead people are not raised, why are some people baptized for them?"},{"num":30,"verse":"And why are we in trouble all the time?"},{"num":31,"verse":"I face death every day! That is true. Just the way it is true that I am proud of you, my brothers. I am proud that you belong to Christ Jesus."},{"num":32,"verse":"I fought against wild animals at Ephesus. If I was thinking only of life on earth, why did I do this? If dead people do not rise, then we might just as well say, `Let us eat and drink because we will die tomorrow.'"},{"num":33,"verse":"Do not be fooled. `If good people keep company with bad people, the good people will become bad too.'"},{"num":34,"verse":"Wake up! Do what is right. Stop doing wrong things. Some of you do not know God at all. I say these things to you to make you ashamed."},{"num":35,"verse":"But someone will ask, `How can dead people be raised? What kind of body will they have when they come back from death?'"},{"num":36,"verse":"What foolish questions! The seed you put in the ground must die before it can come to life."},{"num":37,"verse":"You do not put a grown-up plant in the ground. You put in a seed, such as corn, wheat, rice, or something like that."},{"num":38,"verse":"God gives the seed the body he wants it to have. He gives a different kind of body to every kind of seed."},{"num":39,"verse":"Not all living bodies are alike. People have one kind of body. Animals have another kind of body. Fish another kind of body. Birds have another kind."},{"num":40,"verse":"So too, there are bodies for the sky and bodies for the earth. The bodies for the sky are fine in one way, and the bodies for the earth are fine in another way. They are not alike."},{"num":41,"verse":"The sun is fine in one way. The moon is fine in another way. The stars are fine in still another way. And one star is fine in a different way from another star."},{"num":42,"verse":"So it is with the body that is raised from death. When it is put in the ground it is a body that dies. When it rises from death, it will never die again."},{"num":43,"verse":"When it is put in the ground, it is not fine. When it rises, it is very fine. When it is put in the ground it has no strength. When it rises it is strong."},{"num":44,"verse":"When it is put in the ground it is only a body for this world. When it rises it is a body for the spirit. If there is a body for this world, then there is also a body for the spirit."},{"num":45,"verse":"The holy writings say, `The first man, Adam, was of this world! The last Adam [Christ] is a Spirit who gives life.'"},{"num":46,"verse":"The body for the spirit does not come first. The body for this world comes first. Then comes the body for the spirit."},{"num":47,"verse":"The first man came from earth. He was made from the dust of the earth. The second Adam is the Lord from heaven."},{"num":48,"verse":"Those who are made of earth are like the man made of dust. Those who are for heaven are like the man from heaven."},{"num":49,"verse":"We were made like the man of dust but we shall look like the man from heaven."},{"num":50,"verse":"Now I tell you, my brothers, our bodies of flesh and blood can have no place in the kingdom where God rules. A body which will die can have no room in the kingdom of God where people will never die. 51,"},{"num":51,"verse":"Listen! I tell you a secret. We will not all die, but we will all be changed. It will happen very quickly, as fast as one can shut his eyes. It will be when the trumpet or horn is blown the last time. Someone will blow the trumpet, dead people will rise, and they will never die again. We ourselves will be changed."},{"num":52,"verse":"This body which dies must become a body which will never die."},{"num":53,"verse":"When this body which dies becomes one which will never die, what the holy writings say comes true. It says, `Death is overcome by victory."},{"num":54,"verse":"Death, you have lost the battle. Death, your power to hurt us is gone.'"},{"num":55,"verse":"Death hurts us because we are bad people. And our wrong ways are so strong because of the law."},{"num":56,"verse":"But I thank God that he gives us power to stop being wrong through our Lord Jesus Christ."},{"num":57,"verse":"So, my dear brothers, stand strong. Do not be moved from what you believe. Work hard for the Lord. You know that your work for the Lord will not be for nothing."}]