[{"header":"Duties of the People Toward God"},{"num":19,"verse":"The Lord spoke to Moses, "},{"num":2,"verse":"“Tell the whole congregation of Israel: Be holy because I, the Lord your God, am holy."},{"num":3,"verse":"“Respect your mother and father. Observe my days of rest as holy days. I am the Lord your God."},{"num":4,"verse":"“Don’t turn to worthless gods or cast metal idols. Never make any gods for yourselves. I am the Lord your God."},{"num":5,"verse":"“When you bring a fellowship offering to the Lord, sacrifice it ⌞properly⌟ so that you will be accepted. "},{"num":6,"verse":"Eat your sacrifice on the day you bring it and on the next day. On the third day burn whatever is left over. "},{"num":7,"verse":"If you eat any of it on the third day, it is repulsive and will not be accepted. "},{"num":8,"verse":"Those who eat it will be punished because they have dishonored what is holy to the Lord. They must be excluded from the people."},{"header":"Duties of the People Toward Each Other"},{"num":9,"verse":"“When you harvest the grain in your land, don’t harvest the grain in the corners of your fields or gather what is left after you’re finished. "},{"num":10,"verse":"Don’t harvest your vineyard a second time or pick up fallen grapes. Leave them for poor people and foreigners. I am the Lord your God."},{"num":11,"verse":"“Never steal, lie, or deceive your neighbor."},{"num":12,"verse":"“Never swear by my name in order to deceive anyone. This dishonors the name of your God. I am the Lord."},{"num":13,"verse":"“Never oppress or rob your neighbor. Never keep the pay you owe a hired worker overnight. "},{"num":14,"verse":"Never curse deaf people or put anything in the way of blind people to make them stumble. Instead, fear your God. I am the Lord."},{"num":15,"verse":"“Don’t be corrupt when administering justice. Never give special favors to poor people, and never show preference to important people. Judge your neighbor fairly. "},{"num":16,"verse":"Never gossip. Never endanger your neighbor’s life. I am the Lord."},{"num":17,"verse":"“Never hate another Israelite. Be sure to correct your neighbor so that you will not be guilty of sinning along with him. "},{"num":18,"verse":"Never get revenge. Never hold a grudge against any of your people. Instead, love your neighbor as you love yourself. I am the Lord."},{"header":"Other Duties"},{"num":19,"verse":"“Obey my laws. Never crossbreed different kinds of animals. Never plant two kinds of crops in your field. Never wear clothes made from two kinds of material."},{"num":20,"verse":"“If a man has sexual intercourse with a female slave who is engaged to another man and if her freedom was never bought or given to her, they should not be put to death. He will only pay a fine because she is a slave. "},{"num":21,"verse":"He must bring a ram for his guilt offering to the Lord at the entrance to the tent of meeting. "},{"num":22,"verse":"In the Lord’s presence the priest will use them to make peace with the Lord for this sin. The man will be forgiven for this sin."},{"num":23,"verse":"“When you come into the land and plant all kinds of fruit trees, you must not eat the fruit for ⌞the first⌟ three years. "},{"num":24,"verse":"In the fourth year all the fruit will be a holy offering of praise to the Lord. "},{"num":25,"verse":"In the fifth year you may eat the fruit. Do this to make the trees produce more for you. I am the Lord your God."},{"num":26,"verse":"“Never eat any meat with blood still in it."},{"num":27,"verse":"“Never shave the hair on your foreheads, and never cut the edges of your beard. "},{"num":28,"verse":"Never slash your body to mourn the dead, and never get a tattoo. I am the Lord."},{"num":29,"verse":"“Never dishonor your daughter by making her a prostitute, or the country will turn to prostitution and be filled with people who are perverted."},{"num":30,"verse":"“Observe my days of rest as holy days and respect my holy tent. I am the Lord."},{"num":31,"verse":"“Don’t turn to psychics or mediums to get help. That will make you unclean. I am the Lord your God."},{"num":32,"verse":"“Show respect to the elderly, and honor older people. In this way you show respect for your God. I am the Lord."},{"num":33,"verse":"“Never mistreat a foreigner living in your land. "},{"num":34,"verse":"Foreigners living among you will be like your own people. Love them as you love yourself, because you were foreigners living in Egypt. I am the Lord your God."},{"num":35,"verse":"“Don’t be corrupt when administering justice concerning length, weight, or measuring liquid. "},{"num":36,"verse":"Use honest scales, honest weights, and honest measures. I am the Lord your God who brought you out of Egypt."},{"num":37,"verse":"“Obey all my laws and all my rules, and live by them. I am the Lord.”"}]