[[],[{"type":"header","content":"Idolatry Forbidden"},{"type":"prose","content":"Then the  spoke to Moses, saying:"}],[{"type":"prose","content":"“Speak to all the congregation of the sons of Israel and say to them, ‘You shall be holy, for I the  your God am holy."}],[{"type":"prose","content":"Every one of you shall revere his mother and his father, and you shall keep My Sabbaths; I am the  your God."}],[{"type":"prose","content":"Do not turn to idols or make for yourselves cast metal gods; I am the  your God."}],[{"type":"prose","content":"‘Now when you offer a sacrifice of peace offerings to the , you shall offer it so that you may be accepted."}],[{"type":"prose","content":"It shall be eaten on the same day you offer , and on the next day; but what remains until the third day shall be burned with fire."}],[{"type":"prose","content":"So if it is eaten at all on the third day, it is unclean; it will not be accepted."}],[{"type":"prose","content":"And everyone who eats it will bear  his guilt, because he has profaned the holy thing of the ; and that person shall be cut off from his people."},{"type":"header","content":"Various Laws"}],[{"type":"prose","content":"‘Now when you reap the harvest of your land, you shall not reap to the very edges of your field, nor shall you gather the gleanings of your harvest."}],[{"type":"prose","content":"And you shall not glean your vineyard, nor shall you gather the fallen grapes of your vineyard; you shall leave them for the needy and for the stranger. I am the  your God."}],[{"type":"prose","content":"‘You shall not steal, nor deal falsely, nor lie to one another."}],[{"type":"prose","content":"And you shall not swear falsely by My name, so as to profane the name of your God; I am the ."}],[{"type":"prose","content":"‘You shall not oppress your neighbor, nor rob . The wages of a hired worker are not to remain with you all night until morning."}],[{"type":"prose","content":"You shall not curse a person who is deaf, nor put a stumbling block before a person who is blind, but you shall revere your God; I am the ."}],[{"type":"prose","content":"‘You shall not do injustice in judgment; you shall not show partiality to the poor nor give preference to the great, but you are to judge your neighbor fairly."}],[{"type":"prose","content":"You shall not go about as a slanderer among your people;  you are not to jeopardize the life of your neighbor. I am the ."}],[{"type":"prose","content":"‘You shall not hate your fellow countryman in your heart; you may certainly rebuke your neighbor, but you are not to incur sin because of him."}],[{"type":"prose","content":"You shall not take vengeance, nor hold any grudge against the sons of your people, but you shall love your neighbor as yourself; I am the ."}],[{"type":"prose","content":"‘You are to keep My statutes. You shall not cross-breed two kinds of your cattle; you shall not sow your field with two kinds of seed, nor wear a garment of two kinds of material mixed together."}],[{"type":"prose","content":"‘Now if a man has sexual relations with a woman who is a slave acquired for  man, but who has in no way been redeemed nor given her freedom, there shall be punishment; they shall not, , be put to death, because she was not free."}],[{"type":"prose","content":"He shall bring his guilt offering to the  to the doorway of the tent of meeting, a ram as a guilt offering."}],[{"type":"prose","content":"The priest shall also make atonement for him with the ram of the guilt offering before the  for his sin which he has committed, and the sin which he has committed will be forgiven him."}],[{"type":"prose","content":"‘Now when you enter the land and plant all kinds of trees for food, then you shall count their fruit as forbidden. For three years it shall be forbidden to you;  shall not be eaten."}],[{"type":"prose","content":"And in the fourth year all its fruit shall be holy, an offering of praise to the ."}],[{"type":"prose","content":"But in the fifth year you shall eat its fruit, so that its yield may increase for you; I am the  your God."}],[{"type":"prose","content":"‘You shall not eat  with the blood. You shall not practice divination nor soothsaying."}],[{"type":"prose","content":"You shall not round off the hairline of your heads, nor trim the edges of your beard."}],[{"type":"prose","content":"You shall not make any cuts in your body for the dead, nor make any tattoo marks on yourselves: I am the ."}],[{"type":"prose","content":"‘Do not profane your daughter by making her a prostitute, so that the land does not fall into prostitution, and the land  become full of outrageous sin."}],[{"type":"prose","content":"You shall keep My Sabbaths and revere My sanctuary; I am the ."}],[{"type":"prose","content":"‘Do not turn to mediums or spiritists; do not seek them out to be defiled by them. I am the  your God."}],[{"type":"prose","content":"‘You shall stand up in the presence of the grayheaded and honor elders, and you shall fear your God; I am the ."}],[{"type":"prose","content":"‘When a stranger resides with you in your land, you shall not do him wrong."}],[{"type":"prose","content":"The stranger who resides with you shall be to you as the native among you, and you shall love him as yourself, for you were strangers in the land of Egypt; I am the  your God."}],[{"type":"prose","content":"‘You shall do no wrong in judgment, in measurement of weight, or volume."}],[{"type":"prose","content":"You shall have accurate balances, accurate weights, an accurate ephah, and an accurate hin; I am the  your God, who brought you out from the land of Egypt."}],[{"type":"prose","content":"So you shall keep all My statutes and all My ordinances, and do them; I am the .’”"}]]