[{"header":"Chapter 19"},{"num":1,"verse":"The Lord spoke to Moses, saying,"},{"num":2,"verse":"“Speak to all the assembly of the children of Israel and say: Be holy, for I am holy. I am the Lord, your God."},{"num":3,"verse":"Every man shall honor his father and his mother, and keep my Sabbaths. I am the Lord, your God."},{"num":4,"verse":"“Do not worship idols, nor make molten gods for yourselves. I am the Lord, your God."},{"num":5,"verse":"When you sacrifice a peace offering to the Lord, you shall do it so that it will be acceptable."},{"num":6,"verse":"You shall eat it either on the same day or on the next day. Whatever is left over until the third day should be burned in fire."},{"num":7,"verse":"If you were to eat it on the third day, it would be an abomination. It would not be accepted."},{"num":8,"verse":"Therefore, everyone who eats it shall bear his iniquity, because he shall have profaned something holy to the Lord. That person shall be cut off from among his people."},{"num":9,"verse":"“When you gather the harvest of your land, do not reap the corners of your field nor gather the gleanings of your harvest."},{"num":10,"verse":"You shall not glean your vineyard, nor shall you gather all the grapes of your vineyard. You shall leave them for the poor and the alien. I am the Lord, your God."},{"num":11,"verse":"“You are not to steal, nor should you deceive nor lie to one another."},{"num":12,"verse":"Nor shall you swear a false oath by my name, nor shall you profane my name. I am your God, the Lord."},{"num":13,"verse":"“You shall not defraud your neighbor, nor shall you rob him. You shall not keep the wages of the person you have hired all night, until the morning."},{"num":14,"verse":"You shall not curse the deaf, nor shall you put a stumbling block before the blind, for you shall fear your God. I am the Lord."},{"num":15,"verse":"“You shall not commit any injustice in judging the poor, nor shall you show partiality to the mighty. You shall judge your neighbor with righteousness."},{"num":16,"verse":"You are not to spread slander among your people, nor shall you act against the life of your neighbor. I am the Lord."},{"num":17,"verse":"“You shall not hate your brother in your heart, nor shall you rebuke your brother in any way, lest you bear sin because of him."},{"num":18,"verse":"You shall not seek vengeance nor bear a grudge against the children of your people. You shall love your neighbor as yourself. I am the Lord."},{"num":19,"verse":"“Obey my ordinances. Do not keep one type of cattle with another. Do not sow a field with seed that is mixed. Do not wear clothes made both of wool and linen."},{"num":20,"verse":"“If a man has sex with a slave girl who is betrothed and belongs to another man, and she has not been redeemed nor has she been given her freedom, she shall be scourged, but they shall not be put to death for she was not free."},{"num":21,"verse":"He shall bring his guilt offering to the Lord, to the entrance of the tent of meeting, a ram as a guilt offering."},{"num":22,"verse":"The priest shall make atonement for him before the Lord, for the sin he has committed, with the ram of the guilt offering. He shall be forgiven for the sin that he has committed."},{"num":23,"verse":"“When you come into the land and have planted all kinds of trees, you shall leave its fruit unharvested for three years. It is not to be eaten."},{"num":24,"verse":"But the fourth year all of its fruit will be holy, a praise offering to the Lord."},{"num":25,"verse":"In the fifth year you can eat its fruit. Thus, it will yield more richly for you. I am the Lord, your God."},{"num":26,"verse":"“You must not eat anything with blood in it. You must not practice magic or cast spells."},{"num":27,"verse":"You must not trim the hair on the side of your head, nor must you clip the edges of your beard."},{"num":28,"verse":"You shall not slash your skin to mourn the dead, nor shall you have any tattoos. I am the Lord."},{"num":29,"verse":"“Do not prostitute your daughter, forcing her to commit fornication, lest the land become adulterous and the land be full of lewdness."},{"num":30,"verse":"You will observe my Sabbaths and respect my sanctuary. I am the Lord."},{"num":31,"verse":"“Do not consult mediums or seek after wizards, to be defiled by them. I am the Lord, your God."},{"num":32,"verse":"“You will stand up in the presence of those with gray hair, and honor the presence of those who are old, and you will fear your God. I am the Lord."},{"num":33,"verse":"“If an alien dwells in your land, you will not harass him."},{"num":34,"verse":"You will treat the alien who dwells among you just as you would the person who was born among you. You shall love him as yourself, for you were once aliens in the land of Egypt. I am the Lord, your God."},{"num":35,"verse":"“You shall not cheat in measuring lengths or weights or volumes."},{"num":36,"verse":"You will use honest scales, honest weights, an honest ephah, and an honest hin. I am the Lord, your God, who brought you out of the land of Egypt."},{"num":37,"verse":"Therefore, you will observe all of my statutes and my decrees, and follow them. I am the Lord.”"}]