[{"num":13,"verse":"It used to be when Israel spoke, the nations shook with fear, for he was a mighty prince; but he worshiped Baal and sealed his doom."},{"num":2,"verse":"And now the people disobey more and more. They melt their silver to mold into idols, formed with skill by the hands of men. “Sacrifice to these!” they say—men kissing calves! "},{"num":3,"verse":"They shall disappear like morning mist, like dew that quickly dries away, like chaff blown by the wind, like a cloud of smoke."},{"num":4,"verse":"“I alone am God, your Lord, and have been ever since I brought you out from Egypt. You have no God but me, for there is no other Savior. "},{"num":5,"verse":"I took care of you in the wilderness, in that dry and thirsty land. "},{"num":6,"verse":"But when you had eaten and were satisfied, then you became proud and forgot me. "},{"num":7,"verse":"So I will come upon you like a lion, or a leopard lurking along the road. "},{"num":8,"verse":"I will rip you to pieces like a bear whose cubs have been taken away, and like a lion I will devour you."},{"num":9,"verse":"“O Israel, if I destroy you, who can save you? "},{"num":10,"verse":"Where is your king? Why don’t you call on him for help? Where are all the leaders of the land? You asked for them, now let them save you! "},{"num":11,"verse":"I gave you kings in my anger, and I took them away in my wrath. "},{"num":12,"verse":"Ephraim’s sins are harvested and stored away for punishment."},{"num":13,"verse":"“New birth is offered him, but he is like a child resisting in the womb—how stubborn! how foolish! "},{"num":14,"verse":"Shall I ransom him from hell? Shall I redeem him from Death? O Death, bring forth your terrors for his tasting! O Grave, demonstrate your plagues! For I will not relent!"},{"num":15,"verse":"“He was called the most fruitful of all his brothers, but the east wind—a wind of the Lord from the desert—will blow hard upon him and dry up his land. All his flowing springs and green oases will dry away, and he will die of thirst. "},{"num":16,"verse":"Samaria must bear her guilt, for she rebelled against her God. Her people will be killed by the invading army, her babies dashed to death against the ground, her pregnant women ripped open with a sword.”"}]