[{"header":"Towns Are Given to the Levites"},{"num":21,"verse":"The leaders of the Levite family groups approached Eleazar the priest and Joshua, the son of Nun. They also approached the leaders of the family groups of Israel’s other tribes. "},{"num":2,"verse":"They went to all of them at Shiloh in Canaan. They said to them, “Give us towns to live in. Also give us grasslands for our livestock. That’s what the Lord commanded through Moses.”"},{"num":3,"verse":"So the Israelites gave the Levites towns and grasslands out of their own shares of land. They did what the Lord had commanded. Here are the towns the Levites were given."},{"num":8,"verse":"So the Israelites gave those towns and their grasslands to the Levites. They did what the Lord had commanded through Moses."},{"num":19,"verse":"So the total number of towns and their grasslands given to the priests in Aaron’s family line came to 13."},{"num":26,"verse":"So all these ten towns and their grasslands were given to the other family groups of Kohath."},{"num":33,"verse":"So the total number of towns and their grasslands given to the family groups of Gershon came to 13."},{"num":40,"verse":"So the total number of towns given to the family groups of Merari came to 12. That concludes the list of towns the rest of the Levites received."},{"num":41,"verse":"The total number of Levite towns and their grasslands in the territory given to Israel came to 48. "},{"num":42,"verse":"Each of those towns had grasslands around it. That was true of all of them."},{"num":43,"verse":"So the Lord gave Israel all the land he had promised to give to Abraham, Isaac and Jacob. And Israel took it over. Then they made their homes there. "},{"num":44,"verse":"The Lord gave them peace and rest on every side. He had promised their people of long ago that he would do that. Not one of Israel’s enemies was able to fight against them and win. The Lord handed all their enemies over to them. "},{"num":45,"verse":"The Lord kept all the good promises he had made to the Israelites. Every one of them came true."}]