[{"header":"Cities Allotted to the Levites"},{"num":21,"verse":"Then the heads of the fathers’ houses of the Levites came to Elea′zar the priest and to Joshua the son of Nun and to the heads of the fathers’ houses of the tribes of the people of Israel; "},{"num":2,"verse":"and they said to them at Shiloh in the land of Canaan, “The Lord commanded through Moses that we be given cities to dwell in, along with their pasture lands for our cattle.” "},{"num":3,"verse":"So by command of the Lord the people of Israel gave to the Levites the following cities and pasture lands out of their inheritance."},{"num":4,"verse":"The lot came out for the families of the Ko′hathites. So those Levites who were descendants of Aaron the priest received by lot from the tribes of Judah, Simeon, and Benjamin, thirteen cities."},{"num":5,"verse":"And the rest of the Ko′hathites received by lot from the families of the tribe of E′phraim, from the tribe of Dan and the half-tribe of Manas′seh, ten cities."},{"num":6,"verse":"The Gershonites received by lot from the families of the tribe of Is′sachar, from the tribe of Asher, from the tribe of Naph′tali, and from the half-tribe of Manas′seh in Bashan, thirteen cities."},{"num":7,"verse":"The Merar′ites according to their families received from the tribe of Reuben, the tribe of Gad, and the tribe of Zeb′ulun, twelve cities."},{"num":8,"verse":"These cities and their pasture lands the people of Israel gave by lot to the Levites, as the Lord had commanded through Moses."},{"num":9,"verse":"Out of the tribe of Judah and the tribe of Simeon they gave the following cities mentioned by name, "},{"num":10,"verse":"which went to the descendants of Aaron, one of the families of the Ko′hathites who belonged to the Levites; since the lot fell to them first. "},{"num":11,"verse":"They gave them Kir′iath-ar′ba (Arba being the father of Anak), that is Hebron, in the hill country of Judah, along with the pasture lands round about it. "},{"num":12,"verse":"But the fields of the city and its villages had been given to Caleb the son of Jephun′neh as his possession."},{"num":13,"verse":"And to the descendants of Aaron the priest they gave Hebron, the city of refuge for the slayer, with its pasture lands, Libnah with its pasture lands, "},{"num":14,"verse":"Jattir with its pasture lands, Eshtemo′a with its pasture lands, "},{"num":15,"verse":"Holon with its pasture lands, Debir with its pasture lands, "},{"num":16,"verse":"A′in with its pasture lands, Juttah with its pasture lands, Beth-she′mesh with its pasture lands—nine cities out of these two tribes; "},{"num":17,"verse":"then out of the tribe of Benjamin, Gibeon with its pasture lands, Geba with its pasture lands, "},{"num":18,"verse":"An′athoth with its pasture lands, and Almon with its pasture lands—four cities. "},{"num":19,"verse":"The cities of the descendants of Aaron, the priests, were in all thirteen cities with their pasture lands."},{"num":20,"verse":"As to the rest of the Ko′hathites belonging to the Ko′hathite families of the Levites, the cities allotted to them were out of the tribe of E′phraim. "},{"num":21,"verse":"To them were given Shechem, the city of refuge for the slayer, with its pasture lands in the hill country of E′phraim, Gezer with its pasture lands, "},{"num":22,"verse":"Kib′za-im with its pasture lands, Beth-hor′on with its pasture lands—four cities; "},{"num":23,"verse":"and out of the tribe of Dan, El′teke with its pasture lands, Gib′bethon with its pasture lands, "},{"num":24,"verse":"Ai′jalon with its pasture lands, Gath-rim′mon with its pasture lands—four cities; "},{"num":25,"verse":"and out of the half-tribe of Manas′seh, Ta′anach with its pasture lands, and Gath-rim′mon with its pasture lands—two cities. "},{"num":26,"verse":"The cities of the families of the rest of the Ko′hathites were ten in all with their pasture lands."},{"num":27,"verse":"And to the Gershonites, one of the families of the Levites, were given out of the half-tribe of Manas′seh, Golan in Bashan with its pasture lands, the city of refuge for the slayer, and Be-esh′terah with its pasture lands—two cities; "},{"num":28,"verse":"and out of the tribe of Is′sachar, Kish′ion with its pasture lands, Dab′erath with its pasture lands, "},{"num":29,"verse":"Jarmuth with its pasture lands, En-gan′nim with its pasture lands—four cities; "},{"num":30,"verse":"and out of the tribe of Asher, Mishal with its pasture lands, Abdon with its pasture lands, "},{"num":31,"verse":"Helkath with its pasture lands, and Rehob with its pasture lands—four cities; "},{"num":32,"verse":"and out of the tribe of Naph′tali, Kedesh in Galilee with its pasture lands, the city of refuge for the slayer, Ham′moth-dor with its pasture lands, and Kartan with its pasture lands—three cities. "},{"num":33,"verse":"The cities of the several families of the Gershonites were in all thirteen cities with their pasture lands."},{"num":34,"verse":"And to the rest of the Levites, the Merar′ite families, were given out of the tribe of Zeb′ulun, Jok′ne-am with its pasture lands, Kartah with its pasture lands, "},{"num":35,"verse":"Dimnah with its pasture lands, Na′halal with its pasture lands—four cities; "},{"num":36,"verse":"and out of the tribe of Reuben, Bezer with its pasture lands, Jahaz with its pasture lands, "},{"num":37,"verse":"Ked′emoth with its pasture lands, and Meph′a-ath with its pasture lands—four cities; "},{"num":38,"verse":"and out of the tribe of Gad, Ramoth in Gilead with its pasture lands, the city of refuge for the slayer, Mahana′im with its pasture lands, "},{"num":39,"verse":"Heshbon with its pasture lands, Jazer with its pasture lands—four cities in all. "},{"num":40,"verse":"As for the cities of the several Merar′ite families, that is, the remainder of the families of the Levites, those allotted to them were in all twelve cities."},{"num":41,"verse":"The cities of the Levites in the midst of the possession of the people of Israel were in all forty-eight cities with their pasture lands. "},{"num":42,"verse":"These cities had each its pasture lands round about it; so it was with all these cities."},{"num":43,"verse":"Thus the Lord gave to Israel all the land which he swore to give to their fathers; and having taken possession of it, they settled there. "},{"num":44,"verse":"And the Lord gave them rest on every side just as he had sworn to their fathers; not one of all their enemies had withstood them, for the Lord had given all their enemies into their hands. "},{"num":45,"verse":"Not one of all the good promises which the Lord had made to the house of Israel had failed; all came to pass."}]