[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-7 The apostle saw another representation. The person communicating this discovery probably was our Lord and Saviour Jesus Christ, or it was to show his glory. He veils his glory, which is too great for mortal eyes to behold; and throws a veil upon his dispensations. A rainbow was upon his head; our Lord is always mindful of his covenant. His awful voice was echoed by seven thunders; solemn and terrible ways of discovering the mind of God. We know not the subjects of the seven thunders, nor the reasons for suppressing them. There are great events in history, perhaps relating to the Christian church, which are not noticed in open prophecy. The final salvation of the righteous, and the final success of true religion on earth, are engaged for by the unfailing word of the Lord. Though the time may not be yet, it cannot be far distant. Very soon, as to us, time will be no more; but if we are believers, a happy eternity will follow: we shall from heaven behold and rejoice in the triumphs of Christ, and his cause on earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And sware by him that liveth forever and ever - By the ever-living God: a form of an oath in extensive use now. The essential idea in such an oath is an appeal to God; a solemn reference to Him as a witness; an utterance in the presence of Him who is acquainted with the truth or falsehood of what is said, and who will punish him who appeals to him falsely. It is usual, in such an oath, in order to give to it greater solemnity, to refer to some attribute of God, or something in the divine character on which the mind would rest at the time, as tending to make it more impressive. Thus, in the passage before us, the reference is to God as \"ever-living\"; that is, he is now a witness, and he ever will be; he has now the power to detect and punish, and he ever will have the same power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who created heaven, and the things that therein are, ... - Who is the Maker of all things in heaven, on the earth, and in the sea; that is, throughout the universe. The design of referring to these things here is what is just specified to give increased solemnity to the oath by a particular reference to someone of the attributes of God. With this view nothing could be more appropriate than to refer to him as the Creator of the universe - denoting his infinite power, his right to rule and control all things.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That there should be time no longer - This is a very important expression, as it is the substance of what the angel affirmed in so solemn a manner; and as the interpretation of the whole passage depends on it. It seems now to be generally agreed among critics that our translation does not give the true sense, inasmuch:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) as that was not the close of human affairs, and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) as he proceeds to state what would occur after that.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Accordingly, different versions of the passage have been proposed. Prof. Stuart renders it, \"that delay shall be no longer.\" Mr. Elliott, \"that the time shall not yet be; but in the days of the voice of the seventh angel, whensoever he may be about to sound, then the mystery of God shall be finished.\" Mr. Lord, \"that the time shall not be yet, but in the days of the voice of the seventh angel,\" etc. Andrew Fuller (Works, vol. vi. p. 113), \"there should be no delay.\" So Dr. Gill. Mr. Daubuz, \"the time shall not be yet.\" Vitringa (p. 432), tempus non fore amplius, \"time shall be no more.\" He explains it (p. 433) as meaning, \"not that this is to be taken absolutely, as if at the sounding of the seventh trumpet all things were then to terminate, and the glorious epiphany - ἐπίφανεια  epiphaneia (or manifestation of Jesus Christ) - was then to occur, who would put an end to all the afflictions of his church; but in a limited sense - restricte - as meaning that there would be no delay between the sounding of the seventh trumpet and the fulfillment of the prophecies.\" The sense of this passage is to be determined by the meaning of the words and the connection:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The word \"time\" - χρόνος  chronos - is the common Greek word to denote time, and may be applied to time in general, or to any specified time or period. See Robinson, Lexicon sub voce, (a, b). In the word itself there is nothing to determine its particular signification here. It might refer either to time in general, or to the time under consideration, and which was the subject of the prophecy. Which of these is the true idea is to be ascertained by the other circumstances referred to. It should be added, however, that the word does not of itself denote delay, and is never used to denote that directly. It can only denote that because delay occupies or consumes time, but this sense of the noun is not found in the New Testament. It is found, however, in the verb χρονίζω  chronizō, to linger, to delay, to be long in coming, Matthew 25:5; Luke 1:21.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) The word \"time\" - χρόνος  chronos - is the common Greek word to denote time, and may be applied to time in general, or to any specified time or period. See Robinson, Lexicon sub voce, (a, b). In the word itself there is nothing to determine its particular signification here. It might refer either to time in general, or to the time under consideration, and which was the subject of the prophecy. Which of these is the true idea is to be ascertained by the other circumstances referred to. It should be added, however, that the word does not of itself denote delay, and is never used to denote that directly. It can only denote that because delay occupies or consumes time, but this sense of the noun is not found in the New Testament. It is found, however, in the verb χρονίζω  chronizō, to linger, to delay, to be long in coming, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) The absence of the article - \"time,\" not \"the time\" - would naturally give it a general signification, unless there was something in the connection to limit it to some well-known period under consideration. See the notes on Revelation 8:2; Revelation 10:3. In this latter view, if the time referred to would be sufficiently definite without the article, the article need not be inserted. This is such a case, and comes under the rule for the omission of the article as laid down by Dr. Middleton, part i. ch. 3: The principle is, that when the copula, or verb connecting the subject and predicate, is the verb substantive, then the article is omitted. \"To affirm the existence,\" says he, \"of that of which the existence is already assumed, would be superfluous; to deny it, would be contradictory and absurd.\" As applicable to the case before us, the meaning of this rule would be, that the nature of the time here referred to is implied in the use of the substantive verb (ἔσται  estai), and that consequently it is not necessary to specify it. All that needs to be said on this point is, that, on the supposition that John referred to a specified time, instead of time in general, it would not be necessary, under this rule, to insert the article. The reference would be understood without it, and the insertion would be unnecessary. This is substantially the reasoning of Mr. Elliott (vol. ii. p. 123), and it is submitted for what it is worth. My own knowledge of the usages of the Greek article is too limited to justify me in pronouncing an opinion on the subject, but the authorities are such as to authorize the assertion that, on the supposition that a particular well-known period were here referred to, the insertion of the article would not be necessary.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) The absence of the article - \"time,\" not \"the time\" - would naturally give it a general signification, unless there was something in the connection to limit it to some well-known period under consideration. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this latter view, if the time referred to would be sufficiently definite without the article, the article need not be inserted. This is such a case, and comes under the rule for the omission of the article as laid down by Dr. Middleton, part i. ch. 3: The principle is, that when the copula, or verb connecting the subject and predicate, is the verb substantive, then the article is omitted. \"To affirm the existence,\" says he, \"of that of which the existence is already assumed, would be superfluous; to deny it, would be contradictory and absurd.\" As applicable to the case before us, the meaning of this rule would be, that the nature of the time here referred to is implied in the use of the substantive verb (ἔσται  estai), and that consequently it is not necessary to specify it. All that needs to be said on this point is, that, on the supposition that John referred to a specified time, instead of time in general, it would not be necessary, under this rule, to insert the article. The reference would be understood without it, and the insertion would be unnecessary. This is substantially the reasoning of Mr. Elliott (vol. ii. p. 123), and it is submitted for what it is worth. My own knowledge of the usages of the Greek article is too limited to justify me in pronouncing an opinion on the subject, but the authorities are such as to authorize the assertion that, on the supposition that a particular well-known period were here referred to, the insertion of the article would not be necessary.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The particle rendered \"longer\" - έτι  eti - \"time shall be no longer\" - means properly, according to Robinson (Lexicon), \"yet, still\"; implying:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) duration - as spoken of the present time; of the present in allusion to the past, and, with a negative, no more, no longer;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) implying accession, addition, yet, more, further, besides. According to Buttmann, Grammatical section 149, vol. i. p. 430, it means, when alone, \"yet still, yet further; and with a negative, no more, no further.\" The particle occurs often in the New Testament, as may be seen in the Concordance. It is more frequently rendered \"yet\" than by any other word (compare Matthew 12:46; Matthew 17:5; Matthew 19:20; Matthew 26:47; Matthew 27:63; Mark 5:35; Mark 8:17; Mark 12:6; Mark 14:43 - and so in the other Gospels, the Acts , and the Epistles); in all, 50 times. In the Book of Revelation it is only once rendered \"yet,\" Revelation 6:11, but is rendered \"more\" in Revelation 3:12; Revelation 7:16; Revelation 9:12; Revelation 12:8; Revelation 18:21-22 (three times), Revelation 18:23 (twice); Revelation 20:3; Revelation 21:1, Revelation 21:4 (twice); \"longer\" in Revelation 10:6; \"still\" in Revelation 22:11 (four times). The usage, therefore, will justify the rendering of the word by \"yet,\" and in connection with the negative, \"not yet\" - meaning that the thing referred to would not occur immediately, but would be hereafter. In regard to the general meaning, then, of this passage in its connection, we may remark:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) implying accession, addition, yet, more, further, besides. According to Buttmann, Grammatical section 149, vol. i. p. 430, it means, when alone, \"yet still, yet further; and with a negative, no more, no further.\" The particle occurs often in the New Testament, as may be seen in the Concordance. It is more frequently rendered \"yet\" than by any other word (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:46",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 17:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 19:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 27:63",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 5:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 8:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - and so in the other Gospels, the Acts , and the Epistles); in all, 50 times. In the Book of Revelation it is only once rendered \"yet,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but is rendered \"more\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 9:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:21-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (three times), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (twice); ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (twice); \"longer\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"still\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (four times). The usage, therefore, will justify the rendering of the word by \"yet,\" and in connection with the negative, \"not yet\" - meaning that the thing referred to would not occur immediately, but would be hereafter. In regard to the general meaning, then, of this passage in its connection, we may remark:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) That it cannot mean, literally, that there would be time no longer, or that the world would then come to an end absolutely, for the speaker proceeds to disclose events that would occur after that, extending far into tim future Revelation 10:11, and the detail that follows Revelation 11 before the sounding of the seventh trumpet is such as to occupy a considerable period, and the seventh trumpet is also yet to sound. No fair construction of the language, therefore, would require us to understand this as meaning that the affairs of the world were then to terminate.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) That it cannot mean, literally, that there would be time no longer, or that the world would then come to an end absolutely, for the speaker proceeds to disclose events that would occur after that, extending far into tim future ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the detail that follows ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " before the sounding of the seventh trumpet is such as to occupy a considerable period, and the seventh trumpet is also yet to sound. No fair construction of the language, therefore, would require us to understand this as meaning that the affairs of the world were then to terminate.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) The connection, then, apart from the question of grammatical usage, will require some such construction as that above suggested - \"that the time,\" to wit, some certain, known, or designated time, \"would not be yet,\" but would be in some future period; that is, as specified, Revelation 10:7, \"in the days of the voice of the seventh angel, when he shall begin to sound.\" Then \"the mystery of God would be finished,\" and the affairs of the world would be put on their permanent footing.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) The connection, then, apart from the question of grammatical usage, will require some such construction as that above suggested - \"that the time,\" to wit, some certain, known, or designated time, \"would not be yet,\" but would be in some future period; that is, as specified, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"in the days of the voice of the seventh angel, when he shall begin to sound.\" Then \"the mystery of God would be finished,\" and the affairs of the world would be put on their permanent footing.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) This would imply that, at the time when the angel appeared, or in the time to which he refers, there would be some expectation or general belief that the \"mystery was then to be finished, and that the affairs of the world were to come to an end. The proper interpretation would lead us to suppose that there would be so general an expectation of this, as to make the solemn affirmation of the angel proper to correct a prevailing opinion, and to show that the right interpretation was not put on what seemed to be the tendency of things.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. liveth for ever and ever—Greek, \"liveth unto the ages of the ages\" (compare Da 12:7).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "created heaven … earth … sea, &c.—This detailed designation of God as the Creator, is appropriate to the subject of the angel's oath, namely, the consummating of the mystery of God (Re 10:7), which can surely be brought to pass by the same Almighty power that created all things, and by none else.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that there should be time no longer—Greek, \"that time (that is, an interval of time) no longer shall be.\" The martyrs shall have no longer a time to wait for the accomplishment of their prayers for the purgation of the earth by the judgments which shall remove their and God's foes from it (Re 6:11). The appointed season or time of delay is at an end (the same Greek is here as in Re 6:11, chronus). Not as English Version implies, Time shall end and eternity begin.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And sware by him that liveth, &c.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, by God; for this description can agree to no other, neither is it lawful to swear by any other: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 12:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That there should be time no longer; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there shall be an end of the world, so some; but this John knew well enough. It is rather to be understood of the time of the fourth monarchy, the Roman empire should come to an end; or, the time of the afflictions of the church, whether by pagan or antichristian enemies, should be no more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And sware by him that liveth for ever and ever,.... That is, by the living God, who is the true God: and is so described to distinguish him from idol gods, who have no life nor breath in them; and to assert the excellency and perfection of his nature, who has life in himself originally, and independently, is the fountain of life to all creatures living, and who are supported in their life and being by him; and so he always was, is, and ever will be; this is the same as swearing by Ancuialus (p): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who created heaven, and the things that therein are; the airy, starry, and third heavens, and the inhabitants of them, the fowls of the air, the sun, moon, and stars, and the angels of heaven, as well as the souls of departed saints, and the bodies of as many as are there: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the earth, and the things that therein are; men, beasts, and creeping things, trees, herbs, minerals, &c. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the sea, and the things which are therein: the several sorts of fishes in it: this is also said to distinguish the great God from all false gods, who made not the heavens and the earth, who alone is, and ought to be the object of an oath, or by whom an oath is to be made, and not any creature whatsoever; and since the Angel that here swears is the Lord Jesus Christ, this may be understood of him either as man, swearing by God the Father, in which respect the Father is greater than he; or as a divine person, and so swears by himself, Hebrews 6:13; for to himself do these characters belong of living for ever and ever, and of having made the heaven, earth, and sea, and all in them: the thing he swears to is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the sea, and the things which are therein: the several sorts of fishes in it: this is also said to distinguish the great God from all false gods, who made not the heavens and the earth, who alone is, and ought to be the object of an oath, or by whom an oath is to be made, and not any creature whatsoever; and since the Angel that here swears is the Lord Jesus Christ, this may be understood of him either as man, swearing by God the Father, in which respect the Father is greater than he; or as a divine person, and so swears by himself, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for to himself do these characters belong of living for ever and ever, and of having made the heaven, earth, and sea, and all in them: the thing he swears to is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "that there should be time no longer which is not to be understood of the cessation of time, and the swallowing of it up in eternity, at the end of all things, when it will be no more measured out by the revolutions of the sun and moon, which will then be no more; for this did not take place upon the angel's oath, or at the time this vision refers to; for after this, there is to be time for the seventh angel to sound his trumpet in, though perhaps that is excepted in the next verse; and after the sounding of that, there will be the space of a thousand years, in which Christ will reign with his people on earth; and after that there will be some space of time for the Gog and Magog army to attack the beloved city; all which will be before the end of all things, or before eternity, properly speaking, takes place; and besides, such an illustrious appearing of Christ as before described, and so solemn an oath as is here made, do not seem necessary to ascertain a truth which nobody doubts of; and everyone knows that after this world, and all things in it are at an end, time will be no more. The true key to this passage is Daniel 12:7; where the man clothed in linen swears, that to the end of wonders should be a time, times, and a half, and here the angel swears that time should be no longer; that is, that these time, and times, and half a time, should be no longer; that these dates would be up, and the events affixed to them be accomplished, when the seventh angel should begin to sound his trumpet: the same divisions of time are made in Revelation 12:14; and are the same exactly with the 1260 days, or years, and the forty two months of years, so often mentioned in this book: for a time is a prophetic year, that is, 360 years; and times are two prophetic years, or 70 years; and half a time is half a prophetic year, or 180 years, in all 1260 years: now add the several events to be accomplished in this period of time, and it will give the full sense of this passage thus; the angel swears that the thee of antichrist's reign, his tyranny over the saints, his persecution of them, which was to last forty two months, Revelation 13:5, should be no longer; nor of the holy city being trodden under foot by the Gentiles, the Papists, which bears the same date, Revelation 11:2, and is called the times of the Gentiles, Luke 21:24; nor of the witnesses prophesying in sackcloth, which has just the same measure of duration, Revelation 11:3; nor of the church's retirement, and being hid in the wilderness, Revelation 12:14; in short, the time of the four monarchies, and of the last of them, the Roman, and of the last branch of that, the Papal, should be no more than till the sounding of the seventh trumpet, when the kingdoms of this world shall become the kingdoms of our Lord, and of his Christ; Revelation 11:15; the words will bear to be rendered, as some have observed, \"that there should be delay no longer\"; that is, of the coming and kingdom of Christ; though the bridegroom has tarried, he will come, and will not tarry beyond the time the angel swears to; every seal of the sealed book is a delay of, and a stop upon, the open appearance of Christ's kingdom; and the opening of every seal is an advance to it; and when the sixth seal was opened, and Paganism destroyed, and Christianity spread throughout the empire, the kingdom of Christ might have been expected to have appeared; but there was a seventh seal to be opened, which was a stop upon it, and which when opened brought ruin and destruction upon the Christian empire, both western and eastern, under the first six trumpets; and till the seventh sounds there will be a delay of Christ's kingdom, but when that sounds there will be no more a delay. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that there should be time no longer which is not to be understood of the cessation of time, and the swallowing of it up in eternity, at the end of all things, when it will be no more measured out by the revolutions of the sun and moon, which will then be no more; for this did not take place upon the angel's oath, or at the time this vision refers to; for after this, there is to be time for the seventh angel to sound his trumpet in, though perhaps that is excepted in the next verse; and after the sounding of that, there will be the space of a thousand years, in which Christ will reign with his people on earth; and after that there will be some space of time for the Gog and Magog army to attack the beloved city; all which will be before the end of all things, or before eternity, properly speaking, takes place; and besides, such an illustrious appearing of Christ as before described, and so solemn an oath as is here made, do not seem necessary to ascertain a truth which nobody doubts of; and everyone knows that after this world, and all things in it are at an end, time will be no more. The true key to this passage is ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; where the man clothed in linen swears, that to the end of wonders should be a time, times, and a half, and here the angel swears that time should be no longer; that is, that these time, and times, and half a time, should be no longer; that these dates would be up, and the events affixed to them be accomplished, when the seventh angel should begin to sound his trumpet: the same divisions of time are made in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and are the same exactly with the 1260 days, or years, and the forty two months of years, so often mentioned in this book: for a time is a prophetic year, that is, 360 years; and times are two prophetic years, or 70 years; and half a time is half a prophetic year, or 180 years, in all 1260 years: now add the several events to be accomplished in this period of time, and it will give the full sense of this passage thus; the angel swears that the thee of antichrist's reign, his tyranny over the saints, his persecution of them, which was to last forty two months, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", should be no longer; nor of the holy city being trodden under foot by the Gentiles, the Papists, which bears the same date, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and is called the times of the Gentiles, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 21:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; nor of the witnesses prophesying in sackcloth, which has just the same measure of duration, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; nor of the church's retirement, and being hid in the wilderness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; in short, the time of the four monarchies, and of the last of them, the Roman, and of the last branch of that, the Papal, should be no more than till the sounding of the seventh trumpet, when the kingdoms of this world shall become the kingdoms of our Lord, and of his Christ; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the words will bear to be rendered, as some have observed, \"that there should be delay no longer\"; that is, of the coming and kingdom of Christ; though the bridegroom has tarried, he will come, and will not tarry beyond the time the angel swears to; every seal of the sealed book is a delay of, and a stop upon, the open appearance of Christ's kingdom; and the opening of every seal is an advance to it; and when the sixth seal was opened, and Paganism destroyed, and Christianity spread throughout the empire, the kingdom of Christ might have been expected to have appeared; but there was a seventh seal to be opened, which was a stop upon it, and which when opened brought ruin and destruction upon the Christian empire, both western and eastern, under the first six trumpets; and till the seventh sounds there will be a delay of Christ's kingdom, but when that sounds there will be no more a delay. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Martial Epigr. l. 11. Ephesians 60. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) Martial Epigr. l. 11. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 60",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And sware by him that liveth for ever and ever, who created heaven, and the things that therein are, and the earth, and the things that therein are, and the sea, and the things which are therein, {5} that there should be {c} time no longer:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And sware by him that liveth for ever and ever, who created heaven, and the things that therein are, and the earth, and the things that therein are, and the sea, and the things which are therein, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{5}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that there should be ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " time no longer:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) Neither time itself, nor the things that are in time: but that the world to come is at hand, which is altogether of eternity, and beyond all times.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) There shall never be any more time.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sware by him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This angel therefore is in no sense a divine Person.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "6, 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that there shall be time no longer: but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. as we say, “there shall be no more time ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lost",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but” …: “there shall be delay no longer.” It is not in harmony with the usual language of Scripture to suppose that finite “time” is meant to be opposed to eternity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὅτι χρόνος οὐκέτι ἔσται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That a chronus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [whole period] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be no longer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Many pass by this most weighty utterance with a slight comment. Henr. Efferhen, in his 6th and 13th Homily respecting Gog and Magog, thus interprets it: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the space of a year shall not pass",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", namely, between Gog and the end of all things. He perceived that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chronus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here ought to be taken in a specific sense: but Gog is much later than the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Non-chronus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which would be more in accordance with the Latin idiom to call ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ne-chronus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and this period is much longer than ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a year",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". I should rather say, it is longer than 1000 years; and shorter than chronus, that is, than 1111 1/9 years. It will end A. 1836. From thence reckoning backward, it is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chronus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the former part of the year 725: and the beginning of the Non-chronus immediately succeeded the beginning of the Chronus. At the beginning of Non-chronus, the Saracens were not only in possession of Jerusalem, but even appeared to threaten destruction to the whole of the Christian Church, as the second woe came to its height. But yet the angel affirms that these and the following evils shall be overcome within a chronus. Eudes conquered the Saracens, A. 726; and Charles Martel destroyed a great multitude of them, A. 731, in the battle of Tours. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Vitringa",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Charlemagne, the grandson of Martel, A. 800, commenced a new line of emperors in the West, or, in other words, of “many kings,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And this Non-chronus comprises, beside other things, a small portion of the third woe, the 3½ times of the woman in the wilderness, and the duration of the beast variously divided. There is indeed great doubt respecting these periods, and many say that nothing can be known before the end; by which very assertion the martyrs and witnesses of the truth, at the Reformation, and before and after it, who relied on the Apocalypse, and especially on ch. 13 and 17, are deserted, and the principal advantage of prophecy, which forewarns and forearms us against the evils which threaten, is made void. The truth is, that for the opening of prophecy, either the whole event is necessary, or a considerable part is sufficient. If the whole event is necessary, the Apocalypse will never be understood before the end of the world; for the event extends itself up to that goal, nay, even to eternity itself. If a considerable part is sufficient, why do we not make use of that part, so as to measure future things by the past, and not to run into events without preparation? The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rash",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " man is he who sleeps in danger, not he who foresees it. We ought not to be so confident in determining future things, but that the things, which the text has not defined, or at any rate the interpreter does not as yet distinctly see, should be determined by the result. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Die Erkl. Offenb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". pp. 725, 874, 1064, etc., has many examples. But they who avoid all particulars, do not even know what they ought to look for in the event. Docility in spiritual things, and sobriety, are in entire consonance with each other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And sware by him that liveth forever and ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Triune God (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 45:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Who created heaven, and the things that therein are, and the earth, and the things that therein are, and the sea, and the things which are therein. Though the balance of authority is in favour of the last clause, yet it is omitted by ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אָ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A, and some cursives (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). These two characteristics of God - his eternity and his omnipotence - are referred to in order to demonstrate the certainty of the fulfilment of the prophecy which follows. That there should be time no longer (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὅτι χρόνος οὐκέτι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἔσται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that time no longer shall be.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This may be rendered: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Time (a finite terminable period, as opposed to eternity) shall no longer exist, but eternity shall be entered upon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There shall be no more time, in the sense of \"there shall be no longer any delay\" in the infliction of the last judgment, set forth under the seventh trumpet. The solution seems to be that both meanings are implied. There seems to be a reference to the words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἔτι χρόνον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μικρόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", during which the saints were to rest and await the infliction of God's wrath upon the ungodly. The visions of the first six trumpets have shown how, in the period of the world's existence, the ungodly do not escape judicial retribution. But that is not all; the force of the six judgments not having served to reduce the worldly to repentance, there can be no more delay, the last final judgment follows. But the last judgment, which follows quickly upon the other six (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is for eternity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The advent of this woe is, therefore, simultaneous with the end of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "χρόνος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"time,\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by which we signify that definite period, cut out of eternity, as it were, which is coeval with the existence of the world, and ceases with its destruction. The expression, therefore, implies, \"The measure of God's punishments, viewed as opportunities for repentance, is exhausted; there is a limit to his endurance; the allotted time having been run, and his mercy to a large extent having been spurned, there is no more delay;\" then falls the last final blow, which is at the end of \"time,\" and at the beginning (for many) of eternity. Ebrard renders, \"A space of time in which to repent\" - a meaning compatible with the explanation given above. Others render, \"The time of the fulfilment shall not be yet, but it shall be when the seventh trumpet sounds;\" but this interpretation makes ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "χρόνος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " equal ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καιρός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Others, again, have made ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "χρόνος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a chronus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", equal a definite number of years, and have endeavoured to compute the exact equivalent of the period (see Bengel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in loc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Revelation 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Swear by (ὤμοσεν ἐν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., \"swear in,\" a Hebrew idiom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Should be time no longer (χρόνος οὐκ ἔσται ἔπι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Rev., correctly, shall be, etc. The meaning is not, as popularly understood, that time shall cease to exist, but that there shall be no more delay (so Rev., in margin) before the fulfillment of the divine purposes respecting the Church on earth. Possibly with allusion to the cry how long (Revelation 6:10). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Rev., correctly, shall be, etc. The meaning is not, as popularly understood, that time shall cease to exist, but that there shall be no more delay (so Rev., in margin) before the fulfillment of the divine purposes respecting the Church on earth. Possibly with allusion to the cry how long (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]