[{"num":27,"verse":"When it was morning, all the chief priests and the elders of the people held a consultation against Jesus to put Him to death;"},{"num":2,"verse":"And they bound Him and led Him away and handed Him over to Pilate the governor."},{"num":3,"verse":"When Judas, His betrayer, saw that [Jesus] was condemned, [Judas was afflicted in mind and troubled for his former folly; and] with remorse [with little more than a selfish dread of the consequences] he brought back the thirty pieces of silver to the chief priests and the elders,"},{"num":4,"verse":"Saying, I have sinned in betraying innocent blood. They replied, What is that to us? See to that yourself."},{"num":5,"verse":"And casting the pieces of silver [forward] into the [Holy Place of the sanctuary of the] temple, he departed; and he went off and hanged himself."},{"num":6,"verse":"But the chief priests, picking up the pieces of silver, said, It is not legal to put these in the [consecrated] treasury, for it is the price of blood."},{"num":7,"verse":"So after consultation they bought with them [the pieces of silver] the potter’s field [as a place] in which to bury strangers."},{"num":8,"verse":"Therefore that piece of ground has been called the Field of Blood to the present day."},{"num":9,"verse":"Then were fulfilled the words spoken by Jeremiah the prophet when he said, And they took the thirty pieces of silver, the price of Him on Whom a price had been set by some of the sons of Israel,"},{"num":10,"verse":"And they gave them for the potter’s field, as the Lord directed me."},{"num":11,"verse":"Now Jesus stood before the governor [Pilate], and the governor asked Him, Are you the King of the Jews? Jesus said to him, You have stated [the fact]."},{"num":12,"verse":"But when the charges were made against Him by the chief priests and elders, He made no answer."},{"num":13,"verse":"Then Pilate said to Him, Do You not hear how many and how serious are the things they are testifying against You?"},{"num":14,"verse":"But He made no reply to him, not even to a single accusation, so that the governor marveled greatly."},{"num":15,"verse":"Now at the Feast [of the Passover] the governor was in the habit of setting free for the people any one prisoner whom they chose."},{"num":16,"verse":"And at that time they had a notorious prisoner whose name was Barabbas."},{"num":17,"verse":"So when they had assembled for this purpose, Pilate said to them, Whom do you want me to set free for you, Barabbas, or Jesus Who is called Christ?"},{"num":18,"verse":"For he knew that it was because of envy that they had handed Him over to him."},{"num":19,"verse":"Also, while he was seated on the judgment bench, his wife sent him a message, saying, Have nothing to do with that just and upright Man, for I have had a painful experience today in a dream because of Him."},{"num":20,"verse":"But the chief priests and the elders prevailed on the people to ask for Barabbas, and put Jesus to death."},{"num":21,"verse":"Again the governor said to them, Which of the two do you wish me to release for you? And they said, Barabbas!"},{"num":22,"verse":"Pilate said to them, Then what shall I do with Jesus Who is called Christ?"},{"num":23,"verse":"They all replied, Let Him be crucified! And he said, Why? What has He done that is evil? But they shouted all the louder, Let Him be crucified!"},{"num":24,"verse":"So when Pilate saw that he was getting nowhere, but rather that a riot was about to break out, he took water and washed his hands in the presence of the crowd, saying, I am not guilty of nor responsible for this righteous Man’s blood; see to it yourselves."},{"num":25,"verse":"And all the people answered, Let His blood be on us and on our children!"},{"num":26,"verse":"So he set free for them Barabbas; and he [had] Jesus whipped, and delivered Him up to be crucified."},{"num":27,"verse":"Then the governor’s soldiers took Jesus into the palace, and they gathered the whole battalion about Him."},{"num":28,"verse":"And they stripped off His clothes and put a scarlet robe (garment of dignity and office worn by Roman officers of rank) upon Him,"},{"num":29,"verse":"And, weaving a crown of thorns, they put it on His head and put a reed (staff) in His right hand. And kneeling before Him, they made sport of Him, saying, Hail (greetings, good health to You, long life to You), King of the Jews!"},{"num":30,"verse":"And they spat on Him, and took the reed (staff) and struck Him on the head."},{"num":31,"verse":"And when they finished making sport of Him, they stripped Him of the robe and put His own garments on Him and led Him away to be crucified."},{"num":32,"verse":"As they were marching forth, they came upon a man of Cyrene named Simon; this man they forced to carry the cross of Jesus."},{"num":33,"verse":"And when they came to a place called Golgotha [Latin: Calvary], which means The Place of a Skull,"},{"num":34,"verse":"They offered Him wine mingled with gall to drink; but when He tasted it, He refused to drink it."},{"num":35,"verse":"And when they had crucified Him, they divided and distributed His garments [among them] by casting lots so that the prophet’s saying was fulfilled, They parted My garments among them and over My apparel they cast lots."},{"num":36,"verse":"Then they sat down there and kept watch over Him."},{"num":37,"verse":"And over His head they put the accusation against Him (the cause of His death), which read, This is Jesus, the King of the Jews."},{"num":38,"verse":"At the same time two robbers were crucified with Him, one on the right hand and one on the left."},{"num":39,"verse":"And those who passed by spoke reproachfully and abusively and jeered at Him, wagging their heads,"},{"num":40,"verse":"And they said, You Who would tear down the sanctuary of the temple and rebuild it in three days, rescue Yourself from death. If You are the Son of God, come down from the cross."},{"num":41,"verse":"In the same way the chief priests, with the scribes and elders, made sport of Him, saying,"},{"num":42,"verse":"He rescued others from death; Himself He cannot rescue from death. He is the King of Israel? Let Him come down from the cross now, and we will believe in and acknowledge and cleave to Him."},{"num":43,"verse":"He trusts in God; let God deliver Him now if He cares for Him and will have Him, for He said, I am the Son of God."},{"num":44,"verse":"And the robbers who were crucified with Him also abused and reproached and made sport of Him in the same way."},{"num":45,"verse":"Now from the sixth hour (noon) there was darkness over all the land until the ninth hour (three o’clock)."},{"num":46,"verse":"And about the ninth hour (three o’clock) Jesus cried with a loud voice, Eli, Eli, lama sabachthani?—that is, My God, My God, why have You abandoned Me [leaving Me helpless, forsaking and failing Me in My need]?"},{"num":47,"verse":"And some of the bystanders, when they heard it, said, This Man is calling for Elijah!"},{"num":48,"verse":"And one of them immediately ran and took a sponge, soaked it with vinegar (a sour wine), and put it on a reed (staff), and was about to give it to Him to drink."},{"num":49,"verse":"But the others said, Wait! Let us see whether Elijah will come to save Him from death."},{"num":50,"verse":"And Jesus cried again with a loud voice and gave up His spirit."},{"num":51,"verse":"And at once the curtain of the sanctuary of the temple was torn in two from top to bottom; the earth shook and the rocks were split."},{"num":52,"verse":"The tombs were opened and many bodies of the saints who had fallen asleep in death were raised [to life];"},{"num":53,"verse":"And coming out of the tombs after His resurrection, they went into the holy city and appeared to many people."},{"num":54,"verse":"When the centurion and those who were with him keeping watch over Jesus observed the earthquake and all that was happening, they were terribly frightened and filled with awe, and said, Truly this was God’s Son!"},{"num":55,"verse":"There were also numerous women there, looking on from a distance, who were of those who had accompanied Jesus from Galilee, ministering to Him."},{"num":56,"verse":"Among them were Mary of Magdala, and Mary the mother of James and Joseph, and the mother of Zebedee’s sons."},{"num":57,"verse":"When it was evening, there came a rich man from Arimathea, named Joseph, who also was a disciple of Jesus."},{"num":58,"verse":"He went to Pilate and asked for the body of Jesus, and Pilate ordered that it be given to him."},{"num":59,"verse":"And Joseph took the body and rolled it up in a clean linen cloth used for swathing dead bodies"},{"num":60,"verse":"And laid it in his own fresh (undefiled) tomb, which he had hewn in the rock; and he rolled a big boulder over the door of the tomb and went away."},{"num":61,"verse":"And Mary of Magdala and the other Mary kept sitting there opposite the tomb."},{"num":62,"verse":"The next day, that is, the day after the day of Preparation [for the Sabbath], the chief priests and the Pharisees assembled before Pilate"},{"num":63,"verse":"And said, Sir, we have just remembered how that vagabond Imposter said while He was still alive, After three days I will rise again."},{"num":64,"verse":"Therefore give an order to have the tomb made secure and safeguarded until the third day, for fear that His disciples will come and steal Him away and tell the people that He has risen from the dead, and the last deception and fraud will be worse than the first."},{"num":65,"verse":"Pilate said to them, You have a guard [of soldiers; take them and] go, make it as secure as you can."},{"num":66,"verse":"So they went off and made the tomb secure by sealing the boulder, a guard of soldiers being with them and remaining to watch."}]