[{"header":"Jesus Appears to Saul on the Road to Damascus"},{"num":9,"verse":"Meanwhile, Saul was still breathing out murderous threats against the disciples of the Lord. He went to the high priest "},{"num":2,"verse":"and asked him for letters to the synagogues of Damascus, so that if he found any men or women belonging to the Way, he might bring them to Jerusalem as prisoners."},{"num":3,"verse":"As he went on his way and was approaching Damascus, suddenly a light from heaven flashed around him. "},{"num":4,"verse":"He fell to the ground and heard a voice saying to him, “Saul, Saul, why are you persecuting me?”"},{"num":5,"verse":"He asked, “Who are you, Lord?”"},{"num":6,"verse":"But get up and go into the city, and you will be told what you need to do.”"},{"num":7,"verse":"The men traveling with him stood there speechless. They heard the voice but did not see anyone."},{"num":8,"verse":"They raised Saul up from the ground, but when he opened his eyes, he could not see anything. They took him by the hand and led him into Damascus. "},{"num":9,"verse":"For three days he could not see, and he did not eat or drink."},{"header":"Ananias Is Sent to Saul"},{"num":10,"verse":"There was a disciple in Damascus named Ananias. The Lord said to him in a vision, “Ananias!”"},{"num":11,"verse":"The Lord told him, “Get up and go to the street called Straight, and at the house of Judas ask for a man from Tarsus named Saul. In fact, at this very moment he is praying. "},{"num":12,"verse":"In a vision he has seen a man named Ananias come in and lay his hands on him so that he can regain his sight.”"},{"num":13,"verse":"Ananias answered, “Lord, I have heard from many people about this man and how much harm he did to your saints in Jerusalem. "},{"num":14,"verse":"And he has authority here from the chief priests to arrest all who call on your name.”"},{"num":15,"verse":"The Lord said to him, “Go! This man is my chosen instrument to carry my name before the Gentiles and kings and the people of Israel. "},{"num":16,"verse":"Indeed, I will show him how much he must suffer for my name.”"},{"num":17,"verse":"Ananias left and entered the house. Laying his hands on Saul, he said, “Brother Saul, the Lord Jesus, whom you saw on your way here, has sent me so that you may see again and be filled with the Holy Spirit.”"},{"num":18,"verse":"Immediately something like scales fell from his eyes, and he could see again. He got up and was baptized. "},{"num":19,"verse":"And after taking some food, he regained his strength."},{"header":"Saul (Paul) Proclaims Jesus"},{"num":20,"verse":"Immediately he began to proclaim Jesus in the synagogues, saying, “He is the Son of God.”"},{"num":21,"verse":"All who heard him were amazed and said, “Isn’t this the one who raised havoc in Jerusalem among those who call on this name? Didn’t he come here for this very purpose: to bring them as prisoners to the chief priests?” "},{"num":22,"verse":"But Saul continued to get stronger and kept confounding the Jews who lived in Damascus by proving that Jesus is the Christ."},{"num":23,"verse":"After many days had passed, the Jews conspired to kill him, "},{"num":24,"verse":"but Saul was informed of their plot. They were watching the gates both day and night in order to kill him. "},{"num":25,"verse":"But his disciples took him at night and let him down through an opening in the wall by lowering him in a basket."},{"num":26,"verse":"When Saul came to Jerusalem, he tried to join the disciples, but they were all afraid of him because they did not believe that he was a disciple. "},{"num":27,"verse":"But Barnabas took him and brought him to the apostles. He described to them how Saul had seen the Lord on the road and that the Lord had spoken to him, and how in Damascus he had preached fearlessly in the name of Jesus."},{"num":28,"verse":"Saul stayed with them, coming and going freely in Jerusalem and speaking boldly in the name of the Lord. "},{"num":29,"verse":"He kept on talking and debating with the Greek-speaking Jews, but they were looking for a way to kill him. "},{"num":30,"verse":"When the brothers learned about this, they brought him down to Caesarea and sent him off to Tarsus."},{"num":31,"verse":"Then the church throughout Judea, Galilee, and Samaria enjoyed peace as it was strengthened. It grew in numbers as it lived in the fear of the Lord and in the comfort of the Holy Spirit."},{"header":"Peter Heals Aeneas and Raises Tabitha From the Dead"},{"num":32,"verse":"As Peter went around from place to place, he also went down to the saints who lived in Lydda. "},{"num":33,"verse":"There he found a paralyzed man named Aeneas, who had been lying on a mat for eight years. "},{"num":34,"verse":"Peter said to him, “Aeneas, Jesus Christ heals you. Get up and take care of your mat!” Immediately, he got up. "},{"num":35,"verse":"All those who lived at Lydda and Sharon saw him, and they turned to the Lord."},{"num":36,"verse":"In Joppa there was a disciple named Tabitha, which in Greek is Dorcas. She was always doing good deeds and acts of charity. "},{"num":37,"verse":"At that time she became sick and died. After they had washed her, they laid her in an upstairs room. "},{"num":38,"verse":"Since Lydda is near Joppa, when the disciples heard that Peter was there, they sent two men to him, who urged him, “Come to us without delay!”"},{"num":39,"verse":"Peter got up and went with them. When he arrived, they led him to the room upstairs. All the widows stood beside him, weeping and showing him the robes and clothing that Dorcas made while she was still with them."},{"num":40,"verse":"After Peter sent them all outside, he got down on his knees and prayed. Then he turned toward the body and said, “Tabitha, get up!” She opened her eyes, and when she saw Peter, she sat up. "},{"num":41,"verse":"He gave her his hand and helped her stand up. After he called the saints and the widows, he presented her to them alive."},{"num":42,"verse":"This became known all over Joppa, and many believed in the Lord. "},{"num":43,"verse":"Peter stayed in Joppa for many days with a man named Simon the tanner."}]