[{"header":"Cornelius Has a Vision"},{"num":10,"verse":"A man named Cornelius lived in the city of Caesarea. He was a Roman army officer in the Italian Regiment. "},{"num":2,"verse":"He and everyone in his home were devout and respected God. Cornelius gave many gifts to poor Jewish people and always prayed to God."},{"num":3,"verse":"One day, about three in the afternoon, he had a vision. He clearly saw an angel from God come to him and say, “Cornelius!”"},{"num":4,"verse":"He stared at the angel and was terrified. Cornelius asked the angel, “What do you want, sir?”"},{"num":5,"verse":"Send messengers now to the city of Joppa, and summon a man whose name is Simon Peter. "},{"num":6,"verse":"He is a guest of Simon, a leatherworker, whose house is by the sea.”"},{"num":7,"verse":"After saying this, the angel left. Cornelius called two of his household servants and a devout soldier, one of those who served him regularly. "},{"num":8,"verse":"Cornelius explained everything to them and sent them to Joppa."},{"header":"Peter Has a Vision"},{"num":9,"verse":"Around noon the next day, while Cornelius’ men were on their way and coming close to Joppa, Peter went on the roof to pray. "},{"num":10,"verse":"He became hungry and wanted to eat. While the food was being prepared, he fell into a trance. "},{"num":11,"verse":"He saw the sky open and something like a large linen sheet being lowered by its four corners to the ground. "},{"num":12,"verse":"In the sheet were all kinds of four-footed animals, reptiles, and birds."},{"num":13,"verse":"A voice told him, “Get up, Peter! Kill these animals, and eat them.”"},{"num":14,"verse":"Peter answered, “I can’t do that, Lord! I’ve never eaten anything that is impure or unclean.”"},{"num":15,"verse":"A voice spoke to him a second time, “Don’t say that the things which God has made clean are impure.”"},{"num":16,"verse":"This happened three times. Then the sheet was quickly taken into the sky."},{"num":17,"verse":"While Peter was puzzled by the meaning of the vision, the men sent by Cornelius found Simon’s house and went to the gate. "},{"num":18,"verse":"They asked if Simon Peter was staying there. "},{"num":19,"verse":"Peter was still thinking about the vision when the Spirit said to him, “Three men are looking for you. "},{"num":20,"verse":"Get up, and go downstairs. Don’t hesitate to go with these men. I have sent them.”"},{"num":21,"verse":"So Peter went to the men. He said, “I’m the man you’re looking for. Why are you here?”"},{"num":22,"verse":"The men replied, “Cornelius, a Roman army officer, sent us. He’s a man who has God’s approval and who respects God. Also, the Jewish people respect him. A holy angel told him to summon you to his home to hear what you have to say.”"},{"num":23,"verse":"Peter asked the men to come into the house and had them stay overnight."},{"header":"Peter Speaks with Cornelius"},{"num":24,"verse":"The following day they arrived in Caesarea. Cornelius was expecting them and had called his relatives and close friends together."},{"num":25,"verse":"When Peter was about to enter Cornelius’ house, Cornelius met him, bowed down, and worshiped Peter. "},{"num":26,"verse":"But Peter made him get up. He told him, “Stand up! I’m only a man.”"},{"num":27,"verse":"As Peter talked, he entered Cornelius’ house and found that many people had gathered. "},{"num":28,"verse":"He said to them, “You understand how wrong it is for a Jewish man to associate or visit with anyone of another race. But God has shown me that I should no longer call anyone impure or unclean. "},{"num":29,"verse":"That is why I didn’t object to coming here when you sent for me. I want to know why you sent for me.”"},{"num":30,"verse":"Cornelius answered, “Four days ago I was praying at home. It was at this same time, three o’clock in the afternoon. Suddenly, a man dressed in radiant clothes stood in front of me. "},{"num":31,"verse":"He said to me, ‘Cornelius, God has heard your prayer and has remembered your gifts to the poor. "},{"num":32,"verse":"So send messengers to Joppa, and summon a man whose name is Simon Peter. He’s a guest in the home of Simon, a leatherworker who lives by the sea.’ "},{"num":33,"verse":"So I sent for you immediately. Thank you for coming. All of us are here now in the presence of God to listen to everything the Lord has ordered you to say.”"},{"num":34,"verse":"Then Peter said, “Now I understand that God doesn’t play favorites. "},{"num":35,"verse":"Rather, whoever respects God and does what is right is acceptable to him in any nation. "},{"num":36,"verse":"God sent his word to the people of Israel and brought them the Good News of peace through Yeshua Christ. This Yeshua Christ is everyone’s Lord. "},{"num":37,"verse":"You know what happened throughout Judea. Everything began in Galilee after John spread the news about baptism. "},{"num":38,"verse":"You know that God anointed Yeshua from Nazareth with the Holy Spirit and with power. Yeshua went everywhere and did good things, such as healing everyone who was under the devil’s power. Yeshua did these things because God was with him. "},{"num":39,"verse":"We can testify to everything Yeshua did in the land of the Jews and in Jerusalem. People hung him on a cross and killed him, "},{"num":40,"verse":"but God brought him back to life on the third day. God didn’t show him "},{"num":41,"verse":"to all the people. He showed Yeshua to witnesses, apostles he had already chosen. We apostles are those men who ate and drank with Yeshua after he came back to life. "},{"num":42,"verse":"He ordered us to warn the people, ‘God has appointed Yeshua to judge the living and the dead.’ "},{"num":43,"verse":"In addition, all the prophets testify that people who believe in the one named Yeshua receive forgiveness for their sins through him.”"},{"num":44,"verse":"While Peter was still speaking, the Holy Spirit came to everyone who heard his message. "},{"num":45,"verse":"All the believers who were circumcised and who had come with Peter were amazed that the gift of the Holy Spirit had been poured on people who were not Jewish. "},{"num":46,"verse":"They heard these non-Jewish people speaking in other languages and praising God."},{"num":47,"verse":"“No one can refuse to baptize these people with water. They have received the Holy Spirit in the same way that we did.” "},{"num":48,"verse":"So Peter ordered that they should be baptized in the name of Yeshua Christ."}]