[{"header":"Population of the City Increased"},{"num":11,"verse":"Now the leaders of the people lived in Jerusalem; and the rest of the people cast lots to bring one out of ten to live in the holy city Jerusalem, while nine-tenths remained in the other towns. "},{"num":2,"verse":"And the people blessed all those who willingly offered to live in Jerusalem."},{"num":3,"verse":"These are the leaders of the province who lived in Jerusalem; but in the towns of Judah all lived on their property in their towns: Israel, the priests, the Levites, the temple servants, and the descendants of Solomon’s servants. "},{"num":4,"verse":"And in Jerusalem lived some of the Judahites and of the Benjaminites. Of the Judahites: Athaiah son of Uzziah son of Zechariah son of Amariah son of Shephatiah son of Mahalalel, of the descendants of Perez; "},{"num":5,"verse":"and Maaseiah son of Baruch son of Col-hozeh son of Hazaiah son of Adaiah son of Joiarib son of Zechariah son of the Shilonite. "},{"num":6,"verse":"All the descendants of Perez who lived in Jerusalem were four hundred and sixty-eight valiant warriors."},{"num":7,"verse":"And these are the Benjaminites: Sallu son of Meshullam son of Joed son of Pedaiah son of Kolaiah son of Maaseiah son of Ithiel son of Jeshaiah. "},{"num":8,"verse":"And his brothers Gabbai, Sallai: nine hundred and twenty-eight. "},{"num":9,"verse":"Joel son of Zichri was their overseer; and Judah son of Hassenuah was second in charge of the city."},{"num":10,"verse":"Of the priests: Jedaiah son of Joiarib, Jachin, "},{"num":11,"verse":"Seraiah son of Hilkiah son of Meshullam son of Zadok son of Meraioth son of Ahitub, officer of the house of God, "},{"num":12,"verse":"and their associates who did the work of the house, eight hundred and twenty-two; and Adaiah son of Jeroham son of Pelaliah son of Amzi son of Zechariah son of Pashhur son of Malchijah, "},{"num":13,"verse":"and his associates, heads of ancestral houses, two hundred and forty-two; and Amashsai son of Azarel son of Ahzai son of Meshillemoth son of Immer, "},{"num":14,"verse":"and their associates, valiant warriors, one hundred and twenty-eight; their overseer was Zabdiel son of Haggedolim."},{"num":15,"verse":"And of the Levites: Shemaiah son of Hasshub son of Azrikam son of Hashabiah son of Bunni; "},{"num":16,"verse":"and Shabbethai and Jozabad, of the leaders of the Levites, who were over the outside work of the house of God; "},{"num":17,"verse":"and Mattaniah son of Mica son of Zabdi son of Asaph, who was the leader to begin the thanksgiving in prayer, and Bakbukiah, the second among his associates; and Abda son of Shammua son of Galal son of Jeduthun. "},{"num":18,"verse":"All the Levites in the holy city were two hundred and eighty-four."},{"num":19,"verse":"The gatekeepers, Akkub, Talmon and their associates, who kept watch at the gates, were one hundred and seventy-two. "},{"num":20,"verse":"And the rest of Israel, and of the priests and the Levites, were in all the towns of Judah, all of them in their inheritance. "},{"num":21,"verse":"But the temple servants lived on Ophel; and Ziha and Gishpa were over the temple servants."},{"num":22,"verse":"The overseer of the Levites in Jerusalem was Uzzi son of Bani son of Hashabiah son of Mattaniah son of Mica, of the descendants of Asaph, the singers, in charge of the work of the house of God. "},{"num":23,"verse":"For there was a command from the king concerning them, and a settled provision for the singers, as was required every day. "},{"num":24,"verse":"And Pethahiah son of Meshezabel, of the descendants of Zerah son of Judah, was at the king’s hand in all matters concerning the people."},{"header":"Villages outside Jerusalem"},{"num":25,"verse":"And as for the villages, with their fields, some of the people of Judah lived in Kiriath-arba and its villages, and in Dibon and its villages, and in Jekabzeel and its villages, "},{"num":26,"verse":"and in Jeshua and in Moladah and Beth-pelet, "},{"num":27,"verse":"in Hazar-shual, in Beer-sheba and its villages, "},{"num":28,"verse":"in Ziklag, in Meconah and its villages, "},{"num":29,"verse":"in En-rimmon, in Zorah, in Jarmuth, "},{"num":30,"verse":"Zanoah, Adullam, and their villages, Lachish and its fields, and Azekah and its villages. So they camped from Beer-sheba to the valley of Hinnom. "},{"num":31,"verse":"The people of Benjamin also lived from Geba onwards, at Michmash, Aija, Bethel and its villages, "},{"num":32,"verse":"Anathoth, Nob, Ananiah, "},{"num":33,"verse":"Hazor, Ramah, Gittaim, "},{"num":34,"verse":"Hadid, Zeboim, Neballat, "},{"num":35,"verse":"Lod, and Ono, the valley of artisans. "},{"num":36,"verse":"And certain divisions of the Levites in Judah were joined to Benjamin."}]