[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 1:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hast thou not made a hedge about him? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Protected him with a thorny and inaccessible defence, or secured him, by thy special care and providence, from all harm and inconveniences? which is sufficient to oblige and win persons of the worst tempers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and about his house — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His children and servants; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "about all that he hath on every side — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His whole property, which is all under thy protection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou hast blessed the work of his hands",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Hast caused whatever he does to prosper. Observe, reader, without the divine blessing, be the hands ever so strong, ever so skilful, their work will not prosper. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And his substance is increased in the land — The ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "original word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "מקנהו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mickneehu, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "chiefly means his cattle; and the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "פרצ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "parets, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "increased, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is a metaphor taken from waters which have burst their bounds, and spread themselves on all sides round; so Job’s substance had largely increased, and spread itself like a flowing torrent over the adjacent land. — Schultens.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:6-12 Job's afflictions began from the malice of Satan, by the Lord's permission, for wise and holy purposes. There is an evil spirit, the enemy of God, and of all righteousness, who is continually seeking to distress, to lead astray, and, if possible, to destroy those who love God. How far his influence may extend, we cannot say; but probably much unsteadiness and unhappiness in Christians may be ascribed to him. While we are on this earth we are within his reach. Hence it concerns us to be sober and vigilant, 1Pe 5:8. See how Satan censures Job. This is the common way of slanderers, to suggest that which they have no reason to think is true. But as there is nothing we should dread more than really being hypocrites, so there is nothing we need dread less than being called and counted so without cause. It is not wrong to look at the eternal recompence in our obedience; but it is wrong to aim at worldly advantages in our religion. God's people are taken under his special protection; they, and all that belong to them. The blessing of the Lord makes rich; Satan himself owns it. God suffered Job to be tried, as he suffered Peter to be sifted. It is our comfort that God has the devil in a chain, Re 20:1. He has no power to lead men to sin, but what they give him themselves; nor any power to afflict men, but what is given him from above. All this is here described to us after the manner of men. The Scripture speaks thus to teach us that God directs the affairs of the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hast thou not made an hedge about him? - Dr. Good remarks, that to give the original word here its full force, it should be derived from the science of engineering, and be rendered, \"Hast thou not raised a \"palisado\" about him?\" The Hebrew word used here (שׂוּך  śûk) properly means \"to hedge\"; to hedge in or about; and hence, to protect, as one is defended whose house or farm is hedged in either with a fence of thorns, or with an enclosure of stakes or palisades. The word in its various forms is used to denote, as a noun, \"pricks in the eyes\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 33:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that is, that which would be like thorns; \"barbed irons\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 41:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that is, the barbed iron used as a spear to take fish; and a hedge, and thorn hedge, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The idea here is, that of making an enclosure around Job and his possessions to guard them from danger. The Septuagint renders it περιέφραξας  periephracas, to make a defense around,\" to \"circumvallate\" or inclose, as a camp is in war. In the Syriac and Arabic it is rendered, \"Hast thou not protected him with thy hand? The Chaldee, \"Hast thou protected him with thy word? The Septuagint renders the whole passage, \"Hast thou not encircled the things which are without him\" (τὰ ἔξω αὐτοῦ  ta exō autou) that is, the things abroad which belong to him, \"and the things within his house.\" The sense of the whole passage is, that he was eminently under the divine protection, and that God had kept himself, his family, and property from plunderers, and that therefore he served and feared him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou hast blessed the work of his hands - Thou hast greatly prospered him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his substance is increased in the land - His property, Job 1:3. Margin, \"cattle.\" The word \"increased\" here by no means expresses the force of the original. The word פרץ  pârats means properly to break, to rend, then to break or burst forth as waters do that have been pent up; 2 Samuel 5:20, compare Proverbs 3:10, \"So shall thy barns be filled with plenty, and thy presses \"shall burst out\" פרץ  pârats with new wine;\" that is, thy wine-fats shall be so full that they shall overflow, or \"burst\" the barriers, and the wine shall flow out in abundance. The Arabians, according to Schultens, employ this word still to denote the mouth or \"embouchure\" - the most; rapid part of a stream. So Golius, in proof of this, quotes from the Arabic writer Gjanhari, a couplet where the word is used to denote the mouth of the Euphrates:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And his substance is increased in the land - His property, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Margin, \"cattle.\" The word \"increased\" here by no means expresses the force of the original. The word פרץ  pârats means properly to break, to rend, then to break or burst forth as waters do that have been pent up; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 5:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"So shall thy barns be filled with plenty, and thy presses \"shall burst out\" פרץ  pârats with new wine;\" that is, thy wine-fats shall be so full that they shall overflow, or \"burst\" the barriers, and the wine shall flow out in abundance. The Arabians, according to Schultens, employ this word still to denote the mouth or \"embouchure\" - the most; rapid part of a stream. So Golius, in proof of this, quotes from the Arabic writer Gjanhari, a couplet where the word is used to denote the mouth of the Euphrates:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"His rushing wealth o'er flowed him with its heaps;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So at its mouth the mad Euphrates sweeps.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "According to Sehultens, the word denotes a place where a river bursts forth, and makes a new way by rending the hills and rocks asunder. In like manner the flocks and herds of Job had burst, as it were, every barrier, and had spread like an inundation over the land; compare Genesis 30:43; 2 Chronicles 31:5; Exodus 1:7; Job 16:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "According to Sehultens, the word denotes a place where a river bursts forth, and makes a new way by rending the hills and rocks asunder. In like manner the flocks and herds of Job had burst, as it were, every barrier, and had spread like an inundation over the land; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 30:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 31:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. his substance is increased—literally, \"spread out like a flood\"; Job's herds covered the face of the country.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Made a hedge about him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. defended him by thy special care and providence from all harms and inconveniencies; which is able to oblige and win persons of the worst tempers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His house; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his children and servants. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hast not thou made an hedge about him,.... A fence, a wall of protection all around him? he had; he encompassed him about with his love as with a shield, a hedge which could not be broken down by men or devils; he surrounded him with his almighty power, that none could hurt him; he guarded him by his providence, he caused his angels to encamp about him; yea, he himself was a wall of fire around him; the Targum interprets it the word of God: so thick was the hedge, so strong the fence, that Satan could not find the least gap to get in at, to do him any injury to his body or mind, without the divine permission; which he envied and was vexed at, and maliciously suggests that this was the motive of Job's fear of the Lord; and indeed it was an obligation upon him to fear him, but not the sole cause of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and about his house; not the house in which he dwelt; though Satan could have gladly pulled down that about his ears, as well as that in which his children were; but it designs his family, who were also by Providence protected in their persons and estates, and preserved from the temptations of Satan, at least from being overcome by them, and even at the times of their feasting before mentioned; this fence was about his servants also, so that Satan could not come at and hurt any one that belonged to him, which was a great grief and vexation of mind to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and about all that he hath on every side? his sheep, his camels, his oxen, and his asses; for otherwise these would not have escaped the malice and fury of this evil spirit they afterwards felt; but as these were the gifts of the providence of God to Job, they were guarded by his power, that Satan could not hurt them without leave: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou hast blessed the work of his hands; not only what he himself personally wrought with his own hands, but was done by his servants through his direction, and by his order; the culture of his fields, the feeding and keeping of his flocks and herds; all succeeded well; whatever he did, or was concerned in, prospered: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and his substance is increased in the land; or \"broke out\" (t); like a breach of waters; see 2 Samuel 5:20; exceeded all bounds; his riches broke forth on the right hand and on the left, and flowed in, so that there were scarce any limits to be set to them; he abounded in them; his sheep brought forth thousands; his oxen, camels, and asses, stood well, and were strong to labour; and his wealth poured in upon him in great plenty; all which was an eyesore to Satan, and therefore would insinuate that this was the sole spring and source of Job's religion, devotion, and obedience. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and his substance is increased in the land; or \"broke out\" (t); like a breach of waters; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 5:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; exceeded all bounds; his riches broke forth on the right hand and on the left, and flowed in, so that there were scarce any limits to be set to them; he abounded in them; his sheep brought forth thousands; his oxen, camels, and asses, stood well, and were strong to labour; and his wealth poured in upon him in great plenty; all which was an eyesore to Satan, and therefore would insinuate that this was the sole spring and source of Job's religion, devotion, and obedience. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) \"erupit\", Montanus, Piscator; \"eruperit\", Junius & Tremellius; \"prorupit\", Schultens, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) \"erupit\", Montanus, Piscator; \"eruperit\", Junius & Tremellius; \"prorupit\", Schultens, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Hast not thou made {q} an hedge about him, and about his house, and about all that he hath on every side? thou hast blessed the work of his hands, and his substance is increased in the land.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hast not thou made ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an hedge about him, and about his house, and about all that he hath on every side? thou hast blessed the work of his hands, and his substance is increased in the land.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) Meaning, the grace of God, which served Job as a rampart against all temptations.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hast not thou made an hedge about him?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"hedged him around, protected him, made a sort of invisible fence about him, through which no evil could creep.\" This was undoubtedly true. God had so protected him. But the question was not as to this fact, but as to Job's motive. Was it mere prudence? - the desire to secure a continuance of this protection? ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And about his house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"his family\" - his sons and daughters - the members of his household. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And about all that he hath on every side",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His possessions - land, houses, cattle, live stock of all kinds, furniture, goods and chattels. Thou hast blessed the work of his hands (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is said of the righteous man. that \"whatsoever he doeth, it shall prosper\"). So it was with Job. God's blessing was upon him, and success crowned all his enterprises. \"The work of his hands\" will include everything that he attempted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And his substance is increased in the land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the former clause we have the cause, God's blessing; in the latter the effect, a great increase in Job's \"substance,\" or \"cattle\" (marginal reading). (On the final number of his cattle, see ver. 3.) Job 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9-11  Then Satan answered Jehovah, and said, Doth Job fear God for nought? Hast Thou not made a hedge about him, and about his house, and about all that he hath on every side? Hast Thou not blessed the work of his hands, and his substance is increased in the land? But put forth Thine hand now, and touch all that he hath: truly he will renounce Thee to Thy face.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Satan is, according to the Revelation 12:10, the κατήγωρ who accuses the servants of God day and night before God. It is a fact respecting the invisible world, though expressed in the language and imagery of this world. So long as he is not finally vanquished and condemned, he has access to God, and thinks to justify himself by denying the truth of the existence and the possibility of the continuance of all piety. God permits it; for since everything happening to the creature is placed under the law of free development, evil in the world of spirits is also free to maintain and expand itself, until a spiritual power comes forward against it, by which the hitherto wavering conflict between the principles of good and evil is decided. This is the truth contained in the poetic description of the heavenly scene, sadly mistaken by Umbreit in his Essay on Sin, 1853, in which he explains Satan, according to Psalm 109:6, as a creation of our author's fancy. The paucity of the declarations respecting Satan in the Old Testament has misled him. And indeed the historical advance from the Old Testament to the New, though in itself well authorized, has in many ways of late induced to the levelling of the heights and depths of the New Testament. Formerly Umbreit was of the opinion, as many are still, that the idea of Satan is derived from Persia; but between Ahriman (Angramainyus) and Satan there is no striking resemblance;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Satan is, according to the ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 12:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the κατήγωρ who accuses the servants of God day and night before God. It is a fact respecting the invisible world, though expressed in the language and imagery of this world. So long as he is not finally vanquished and condemned, he has access to God, and thinks to justify himself by denying the truth of the existence and the possibility of the continuance of all piety. God permits it; for since everything happening to the creature is placed under the law of free development, evil in the world of spirits is also free to maintain and expand itself, until a spiritual power comes forward against it, by which the hitherto wavering conflict between the principles of good and evil is decided. This is the truth contained in the poetic description of the heavenly scene, sadly mistaken by Umbreit in his Essay on Sin, 1853, in which he explains Satan, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 109:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as a creation of our author's fancy. The paucity of the declarations respecting Satan in the Old Testament has misled him. And indeed the historical advance from the Old Testament to the New, though in itself well authorized, has in many ways of late induced to the levelling of the heights and depths of the New Testament. Formerly Umbreit was of the opinion, as many are still, that the idea of Satan is derived from Persia; but between Ahriman (Angramainyus) and Satan there is no striking resemblance;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Moreover, it is still questionable whether the form of the ancient doctrine of fire-worship among the Persians did not result from Jewish influences. Vid., Stuhr, Religionssysteme der herdn. Vlker des Orients, S. 373-75.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whereas Diestel, in his Abh. ber Set-Typhon, Asasel und Satan, Stud. u. Krit., 1860, 2, cannot indeed recognise any connection between עזאזל and the Satan of the book of Job, but maintains a more complete harmony in all substantial marks between the latter and the Egyptian Typhon, and infers that \"to Satan is therefore to be denied a purely Israelitish originality, the natural outgrowth of the Hebrew mind. It is indeed no special honour for Israel to be able to call him their own. He never has taken firm hold on the Hebrew consciousness.\" But how should it be no honour for Israel, the people to whom the revelation of redemption was made, and in whose history the plan of redemption was developed, to have traced the poisonous stream of evil up to the fountain of its first free beginning in the spiritual world, and to have more than superficially understood the history of the fall of mankind by sin, which points to a disguised superhuman power, opposed to the divine will? This perception undoubtedly only begins gradually to dawn in the Old Testament; but in the New Testament, the abyss of evil is fully disclosed, and Satan has so far a hold on the consciousness of Jesus, that He regards His life's vocation as a conflict with Satan. And the Protevangelium is deciphered in facts, when the promised seed of the woman crushed the serpent's head, but at the same time suffered the bruising of its own heel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The view (e.g., Lutz in his Biblishce Dogmatik) that Satan as he is represented in the book of Job is not the later evil spirit, is to be rejected: he appears here only first, say Herder and Eichhorn, as impartial executor of judgment, and overseer of morality, commissioned by God. But he denies what God affirms, acknowledges no love towards God in the world which is not rooted in self-love, and is determined to destroy this love as a mere semblance. Where piety is dulled, he rejoices in its obscurity; where it is not, he dims its lustre by reflecting his own egotistical nature therein. Thus it is in Zechariah 3:1-10, and so here. Genuine love loves God חנּם (adverb from חן, like gratis from gratia): it loves Him for His own sake; it is a relation of person to person, without any actual stipulations and claim. But Job does not thus fear God; ירא is here praet., whereas in Job 1:1 and Job 1:8 it is the adjective. God has indeed hitherto screened him from all evil; שׂכתּ from שׂוּך, sepire, and בּעד (בּעד) composed of בּ and עד, in the primary signification circum, since עד expresses that the one joins itself to the other, and בּ that it covers it, or covers itself with it. By the addition of מסּביב, the idea of the triple בּעד is still strengthened. מעשׂה, lxx, Vulg., have translated by the plural, which is not false according to the thought; for ידים מעשׂה is, especially in Deuteronomy, a favourite collective expression for human enterprise. פּרץ, a word, with the Sanskrito-Sem. frangere, related to פּרק, signifying to break through the bounds, multiply and increase one's self unboundedly (Genesis 30:30, and freq.). The particle אוּלם, proper only to the oldest and classic period, and very commonly used in the first four books of the Pentateuch, and in our book, generally ואוּלם, is an emphatic \"nevertheless;\" Lat. (suited to this passage at least) verum enim vero. אם־לא is either, as frequently, a shortened formula of asseveration: May such and such happen to me if he do not, etc.,  equals  forsooth he will (lxx ἦ μήν); or it is half a question: Attempt only this and this, whether he will not deny thee,  equals  annon, as Job 17:2; Job 22:20. The first perhaps suits the character of Satan better: he affirms that God is mistaken. בּרך signifies here also, valedicere: he will say farewell to thee, and indeed על־פּניך (as Isaiah 65:3), meeting thee arrogantly and shamelessly: it signifies, properly, upon thy countenance, i.e., say it to thee, to the very face, that he will have nothing more to do with thee (comp. on Job 2:5). In order now that the truth of His testimony to Job's piety, and this piety itself, may be tried, Jehovah surrenders all Job's possessions, all that is his, except himself, to Satan. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The view (e.g., Lutz in his Biblishce Dogmatik) that Satan as he is represented in the book of Job is not the later evil spirit, is to be rejected: he appears here only first, say Herder and Eichhorn, as impartial executor of judgment, and overseer of morality, commissioned by God. But he denies what God affirms, acknowledges no love towards God in the world which is not rooted in self-love, and is determined to destroy this love as a mere semblance. Where piety is dulled, he rejoices in its obscurity; where it is not, he dims its lustre by reflecting his own egotistical nature therein. Thus it is in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 3:1-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and so here. Genuine love loves God חנּם (adverb from חן, like gratis from gratia): it loves Him for His own sake; it is a relation of person to person, without any actual stipulations and claim. But Job does not thus fear God; ירא is here praet., whereas in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is the adjective. God has indeed hitherto screened him from all evil; שׂכתּ from שׂוּך, sepire, and בּעד (בּעד) composed of בּ and עד, in the primary signification circum, since עד expresses that the one joins itself to the other, and בּ that it covers it, or covers itself with it. By the addition of מסּביב, the idea of the triple בּעד is still strengthened. מעשׂה, lxx, Vulg., have translated by the plural, which is not false according to the thought; for ידים מעשׂה is, especially in Deuteronomy, a favourite collective expression for human enterprise. פּרץ, a word, with the Sanskrito-Sem. frangere, related to פּרק, signifying to break through the bounds, multiply and increase one's self unboundedly (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 30:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and freq.). The particle אוּלם, proper only to the oldest and classic period, and very commonly used in the first four books of the Pentateuch, and in our book, generally ואוּלם, is an emphatic \"nevertheless;\" Lat. (suited to this passage at least) verum enim vero. אם־לא is either, as frequently, a shortened formula of asseveration: May such and such happen to me if he do not, etc.,  equals  forsooth he will (lxx ἦ μήν); or it is half a question: Attempt only this and this, whether he will not deny thee,  equals  annon, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 17:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The first perhaps suits the character of Satan better: he affirms that God is mistaken. בּרך signifies here also, valedicere: he will say farewell to thee, and indeed על־פּניך (as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 65:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), meeting thee arrogantly and shamelessly: it signifies, properly, upon thy countenance, i.e., say it to thee, to the very face, that he will have nothing more to do with thee (comp. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In order now that the truth of His testimony to Job's piety, and this piety itself, may be tried, Jehovah surrenders all Job's possessions, all that is his, except himself, to Satan. ",
            "children": []
          }
        ]
      }
    ]
  }
]