[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Seven sons and three daughters.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The like number was restored to him after his probation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-5 Job was prosperous, and yet pious. Though it is hard and rare, it is not impossible for a rich man to enter into the kingdom of heaven. By God's grace the temptations of worldly wealth may be overcome. The account of Job's piety and prosperity comes before the history of his great afflictions, showing that neither will secure from troubles. While Job beheld the harmony and comforts of his sons with satisfaction, his knowledge of the human heart made him fearful for them. He sent and sanctified them, reminding them to examine themselves, to confess their sins, to seek forgiveness; and as one who hoped for acceptance with God through the promised Saviour, he offered a burnt-offering for each. We perceive his care for their souls, his knowledge of the sinful state of man, his entire dependence on God's mercy in the way he had appointed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And there were born unto him seven sons and three daughters - The same number was given to him again after these were lost, and his severe trials had been endured; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of his second family the names of the daughters are mentioned, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of his first, it is remarkable that neither the names of his wife, his sons nor his daughters are recorded. The Chaldee, however, on what authority is unknown, says that the name of his wife was דינה  dı̂ynâh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "THE BOOK OF JOB Commentary by A. R. Faussett   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "INTRODUCTION",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Job a Real Person.—It has been supposed by some that the book of Job is an allegory, not a real narrative, on account of the artificial character of many of its statements. Thus the sacred numbers, three and seven, often occur. He had seven thousand sheep, seven sons, both before and after his trials; his three friends sit down with him seven days and seven nights; both before and after his trials he had three daughters. So also the number and form of the speeches of the several speakers seem to be artificial. The name of Job, too, is derived from an Arabic word signifying repentance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But Eze 14:14 (compare Eze 14:16, 20) speaks of \"Job\" in conjunction with \"Noah and Daniel,\" real persons. St. James (Jas 5:11) also refers to Job as an example of \"patience,\" which he would not have been likely to do had Job been only a fictitious person. Also the names of persons and places are specified with a particularity not to be looked for in an allegory. As to the exact doubling of his possessions after his restoration, no doubt the round number is given for the exact number, as the latter approached near the former; this is often done in undoubtedly historical books. As to the studied number and form of the speeches, it seems likely that the arguments were substantially those which appear in the book, but that the studied and poetic form was given by Job himself, guided by the Holy Spirit. He lived one hundred and forty years after his trials, and nothing would be more natural than that he should, at his leisure, mould into a perfect form the arguments used in the momentous debate, for the instruction of the Church in all ages. Probably, too, the debate itself occupied several sittings; and the number of speeches assigned to each was arranged by preconcerted agreement, and each was allowed the interval of a day or more to prepare carefully his speech and replies; this will account for the speakers bringing forward their arguments in regular series, no one speaking out of his turn. As to the name Job—repentance (supposing the derivation correct)—it was common in old times to give a name from circumstances which occurred at an advanced period of life, and this is no argument against the reality of the person.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Where Job Lived.—\"Uz,\" according to Gesenius, means a light, sandy soil, and was in the north of Arabia-Deserta, between Palestine and the Euphrates, called by Ptolemy (Geography, 19) Ausitai or Aisitai. In Ge 10:23; 22:21; 36:28; and 1Ch 1:17, 42, it is the name of a man. In Jer 25:20; La 4:21; and Job 1:1, it is a country. Uz, in Ge 22:21, is said to be the son of Nahor, brother of Abraham—a different person from the one mentioned (Ge 10:23), a grandson of Shem. The probability is that the country took its name from the latter of the two; for this one was the son of Aram, from whom the Arameans take their name, and these dwelt in Mesopotamia, between the rivers Euphrates and Tigris. Compare as to the dwelling of the sons of Shem in Ge 10:30, \"a mount of the East,\" answering to \"men of the East\" (Job 1:3). Rawlinson, in his deciphering of the Assyrian inscriptions, states that \"Uz is the prevailing name of the country at the mouth of the Euphrates.\" It is probable that Eliphaz the Temanite and the Sabeans dwelt in that quarter; and we know that the Chaldeans resided there, and not near Idumea, which some identify with Uz. The tornado from \"the wilderness\" (Job 1:19) agrees with the view of it being Arabia-Deserta. Job (Job 1:3) is called \"the greatest of the men of the East\"; but Idumea was not east, but south of Palestine: therefore in Scripture language, the phrase cannot apply to that country, but probably refers to the north of Arabia-Deserta, between Palestine, Idumea, and the Euphrates. So the Arabs still show in the Houran a place called Uz as the residence of Job.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Age When Job Lived.—Eusebius fixes it two ages before Moses, that is, about the time of Isaac: eighteen hundred years before Christ, and six hundred after the Deluge. Agreeing with this are the following considerations: 1. Job's length of life is patriarchal, two hundred years. 2. He alludes only to the earliest form of idolatry, namely, the worship of the sun, moon, and heavenly hosts (called Saba, whence arises the title \"Lord of Sabaoth,\" as opposed to Sabeanism) (Job 31:26-28). 3. The number of oxen and rams sacrificed, seven, as in the case of Balaam. God would not have sanctioned this after the giving of the Mosaic law, though He might graciously accommodate Himself to existing customs before the law. 4. The language of Job is Hebrew, interspersed occasionally with Syriac and Arabic expressions, implying a time when all the Shemitic tribes spoke one common tongue and had not branched into different dialects, Hebrew, Syriac, and Arabic. 5. He speaks of the most ancient kind of writing, namely, sculpture. Riches also are reckoned by cattle. The Hebrew word, translated \"a piece of money,\" ought rather be rendered \"a lamb.\" 6. There is no allusion to the exodus from Egypt and to the miracles that accompanied it; nor to the destruction of Sodom and Gomorrah (Patrick, however, thinks there is); though there is to the Flood (Job 22:17); and these events, happening in Job's vicinity, would have been striking illustrations of the argument for God's interposition in destroying the wicked and vindicating the righteous, had Job and his friends known of them. Nor is there any undoubted reference to the Jewish law, ritual, and priesthood. 7. The religion of Job is that which prevailed among the patriarchs previous to the law; sacrifices performed by the head of the family; no officiating priesthood, temple, or consecrated altar.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Writer.—All the foregoing facts accord with Job himself having been the author. The style of thought, imagery, and manners, are such as we should look for in the work of an Arabian emir. There is precisely that degree of knowledge of primitive tradition (see Job 31:33, as to Adam) which was universally spread abroad in the days of Noah and Abraham, and which was subsequently embodied in the early chapters of Genesis. Job, in his speeches, shows that he was much more competent to compose the work than Elihu, to whom Lightfoot attributes it. The style forbids its being attributed to Moses, to whom its composition is by some attributed, \"whilst he was among the Midianites, about 1520 B.C.\" But the fact, that it, though not a Jewish book, appears among the Hebrew sacred writings, makes it likely that it came to the knowledge of Moses during the forty years which he passed in parts of Arabia, chiefly near Horeb; and that he, by divine guidance, introduced it as a sacred writing to the Israelites, to whom, in their affliction, the patience and restoration of Job were calculated to be a lesson of especial utility. That it is inspired appears from the fact that Paul (1Co 3:19) quotes it (Job 5:13) with the formula, \"It is written.\" Our Savior, too Mt 24:28), plainly refers to Job 29:30. Compare also Jas 4:10 and 1Pe 5:6 with Job 22:29; Ro 11:34, 35 with Job 15:8. It is probably the oldest book in the world. It stands among the Hagiographa in the threefold division of Scripture into the Law, the Prophets, and the Hagiographa (\"Psalms,\" Lu 24:44).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Design of the Book.—It is a public debate in poetic form on an important question concerning the divine government; moreover the prologue and epilogue, which are in prose, shed the interest of a living history over the debate, which would otherwise be but a contest of abstract reasonings. To each speaker of the three friends three speeches are assigned. Job having no one to stand by him is allowed to reply to each speech of each of the three. Eliphaz, as the oldest, leads the way. Zophar, at his third turn, failed to speak, thus virtually owning himself overcome (Job 27:1-23). Therefore Job continued his reply, which forms three speeches (Job 26:1-14; 27:1-23; 28:1-28; 29:1-31:40). Elihu (Job 32:1-37:24) is allowed four speeches. Jehovah makes three addresses (Job 38:1-41:34). Thus, throughout there is a tripartite division. The whole is divided into three parts—the prologue, poem proper, and epilogue. The poem, into three—(1) The dispute of Job and his three friends; (2) The address of Elihu; (3) The address of God. There are three series in the controversy, and in the same order. The epilogue (Job 42:1-17) also is threefold; Job's justification, reconciliation with his friends, restoration. The speakers also in their successive speeches regularly advance from less to greater vehemence. With all this artificial composition, everything seems easy and natural.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The question to be solved, as exemplified in the case of Job, is, Why are the righteous afflicted consistently with God's justice? The doctrine of retribution after death, no doubt, is the great solution of the difficulty. And to it Job plainly refers in Job 14:14, and Job 19:25. The objection to this, that the explicitness of the language on the resurrection in Job is inconsistent with the obscurity on the subject in the early books of the Old Testament, is answered by the fact that Job enjoyed the divine vision (Job 38:1; 42:5), and therefore, by inspiration, foretold these truths. Next, the revelations made outside of Israel being few needed to be the more explicit; thus Balaam's prophecy (Nu 24:17) was clear enough to lead the wise men of the East by the star (Mt 2:2); and in the age before the written law, it was the more needful for God not to leave Himself without witness of the truth. Still Job evidently did not fully realize the significance designed by the Spirit in his own words (compare 1Pe 1:11, 12). The doctrine, though existing, was not plainly revealed or at least understood. Hence he does not mainly refer to this solution. Yes, and even now, we need something in addition to this solution. David, who firmly believed in a future retribution (Ps 16:10; 17:15), still felt the difficulty not entirely solved thereby (Ps 83:1-18). The solution is not in Job's or in his three friends' speeches. It must, therefore, be in Elihu's. God will hold a final judgment, no doubt, to clear up all that seems dark in His present dealings; but He also now providentially and morally governs the world and all the events of human life. Even the comparatively righteous are not without sin which needs to be corrected. The justice and love of God administer the altogether deserved and merciful correction. Affliction to the godly is thus mercy and justice in disguise. The afflicted believer on repentance sees this. \"Via crucis, via salutis\" [\"The way of the cross, the way of deliverance\"]. Though afflicted, the godly are happier even now than the ungodly, and when affliction has attained its end, it is removed by the Lord. In the Old Testament the consolations are more temporal and outward; in the New Testament, more spiritual; but in neither to the entire exclusion of the other. \"Prosperity,\" says Bacon, \"is the blessing of the Old Testament; adversity that of the New Testament, which is the mark of God's more especial favor. Yet even in the Old Testament, if you listen to David's harp, you shall hear as many hearse-like airs as carols; and the pencil of the Holy Ghost has labored more in describing the afflictions of Job than the felicities of Solomon. Prosperity is not without many fears and distastes; and adversity is not without comforts and hopes.\" This solution of Elihu is seconded by the addresses of God, in which it is shown God must be just (because He is God), as Elihu had shown how God can be just, and yet the righteous be afflicted. It is also acquiesced in by Job, who makes no reply. God reprimands the \"three\" friends, but not Elihu. Job's general course is approved; he is directed to intercede for his friends, and is restored to double his former prosperity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Poetry.—In all countries poetry is the earliest form of composition as being best retained in the memory. In the East especially it was customary for sentiments to be preserved in a terse, proverbial, and poetic form (called maschal). Hebrew poetry is not constituted by the rhythm or meter, but in a form peculiar to itself: 1. In an alphabetical arrangement somewhat like our acrostic. For instance, La 1:1-22. 2. The same verse repeated at intervals; as in Ps 42:1-11; 107:1-43. 3. Rhythm of gradation. Psalms of degrees, Ps 120:1-134:3, in which the expression of the previous verse is resumed and carried forward in the next (Ps 121:1-8). 4. The chief characteristic of Hebrew poetry is parallelism, or the correspondence of the same ideas in the parallel clauses. The earliest instance is Enoch's prophecy (Jude 14), and Lamech's parody of it (Ge 4:23). Three kinds occur: (1) The synonymous parallelism, in which the second is a repetition of the first, with or without increase of force (Ps 22:27; Isa 15:1); sometimes with double parallelism (Isa 1:15). (2) The antithetic, in which the idea of the second clause is the converse of that in the first (Pr 10:1). (3) The synthetic, where there is a correspondence between different propositions, noun answering to noun, verb to verb, member to member, the sentiment, moreover, being not merely echoed, or put in contrast, but enforced by accessory ideas (Job 3:3-9). Also alternate (Isa 51:19). \"Desolation and destruction, famine and sword,\" that is, desolation by famine, and destruction by the sword. Introverted; where the fourth answers to the first, and the third to the second (Mt 7:6). Parallelism thus often affords a key to the interpretation. For fuller information, see Lowth (Introduction to Isaiah, and Lecture on Hebrew Poetry) and Herder (Spirit of Hebrew Poetry, translated by Marsh). The simpler and less artificial forms of parallelism prevail in Job—a mark of its early age.   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "CHAPTER 1",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "PART I—PROLOGUE OR HISTORICAL INTRODUCTION IN PROSE—(Job 1:1-2:13)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Job 1:1-5. The Holiness of Job, His Wealth, &c.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Uz—north of Arabia-Deserta, lying towards the Euphrates. It was in this neighborhood, and not in that of Idumea, that the Chaldeans and Sabeans who plundered him dwell. The Arabs divide their country into the north, called Sham, or \"the left\"; and the south, called Yemen, or \"the right\"; for they faced east; and so the west was on their left, and the south on their right. Arabia-Deserta was on the east, Arabia-Petræa on the west, and Arabia-Felix on the south.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Job—The name comes from an Arabic word meaning \"to return,\" namely, to God, \"to repent,\" referring to his end [Eichorn]; or rather from a Hebrew word signifying one to whom enmity was shown, \"greatly tried\" [Gesenius]. Significant names were often given among the Hebrews, from some event of later life (compare Ge 4:2, Abel—a \"feeder\" of sheep). So the emir of Uz was by general consent called Job, on account of his \"trials.\" The only other person so called was a son of Issachar (Ge 46:13).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "perfect—not absolute or faultless perfection (compare Job 9:20; Ec 7:20), but integrity, sincerity, and consistency on the whole, in all relations of life (Ge 6:9; 17:1; Pr 10:9; Mt 5:48). It was the fear of God that kept Job from evil (Pr 8:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And there were born unto him,.... By his wife, in lawful wedlock, who was now living, and after mentioned: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "seven sons and three daughters; next to his religious character, his graces, and spiritual blessings, and as the chief of his outward mercies and enjoyments, his children are mentioned; and which are indeed blessings from the Lord, and such as good men, and those that fear the Lord, are sometimes blessed with, see Psalm 127:3 and to have a numerous offspring was always esteemed a very great favour and blessing, and as such was reckoned by Job; who, having so many sons, might hope to have his name perpetuated by them, as well as his substance shared among them; and having so many daughters, he might please himself with the thought of marrying them into families, which would strengthen his friendship and alliance with them; just the same number of sons and daughters had Bacchaeus, the third king of Corinth (y). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "seven sons and three daughters; next to his religious character, his graces, and spiritual blessings, and as the chief of his outward mercies and enjoyments, his children are mentioned; and which are indeed blessings from the Lord, and such as good men, and those that fear the Lord, are sometimes blessed with, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 127:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and to have a numerous offspring was always esteemed a very great favour and blessing, and as such was reckoned by Job; who, having so many sons, might hope to have his name perpetuated by them, as well as his substance shared among them; and having so many daughters, he might please himself with the thought of marrying them into families, which would strengthen his friendship and alliance with them; just the same number of sons and daughters had Bacchaeus, the third king of Corinth (y). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) Heraclides de Politiis ad calcem Aelian. Var. Hist. p. 439. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) Heraclides de Politiis ad calcem Aelian. Var. Hist. p. 439. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And there were born unto him seven sons and three daughters.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2, 3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Job’s family and wealth. A first principle in the Oriental Wisdom, which corresponds in part to our Ethics, was, that it is well with the righteous and ill with the wicked, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This principle is set at the head of the Psalter in Psalms 1, and is reiterated in many shapes as an unalterable law in the Book of Proverbs. According to this principle Job and all acquainted with him would see his piety reflected in his worldly prosperity, and regard this as God’s blessing upon him on account of it. It is not the intention of the writer of the Book to break with this principle absolutely. On the contrary when he lets Job at the end of his trials be restored to a prosperity double that which he enjoyed before, he gives in his adhesion to the principle in general. If he had not done so his position would have been more false than that of Job’s friends, who asserted that the principle prevailed in the world without exceptions. The Author’s design goes no further than to teach that the principle is subject to great modifications, and that sufferings may arise from causes more general than any connected with the sufferer’s own life. His object, however, in teaching this doctrine cannot have been the limited one of correcting a false theory of Providence, he must have had before him the wider purpose of sustaining individuals or most probably his nation under severe and inexplicable trials and encouraging them with brilliant hopes of the future.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The round Numbers 7, 3, 5, by which Job’s children and his flocks are described, express, according to the ideas connected with such numbers in the East, their perfection and complete sufficiency. They teach at the same time that what we have before us here is not actual history, but history idealized by the Poet and Teacher, that he may convey by it more vividly the moral lessons which he desires to inculcate. Job’s sons were seven and his daughters three, for sons were more esteemed in the East than daughters, partly for reasons connected with the state of society, one of which is alluded to in the Psalm: “They shall not be ashamed, they shall speak with the enemies in the gate,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 127:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Mohammed expresses the feelings of the Arabs when he says: For when any one of them is informed of the birth of a daughter a black shadow falls upon his face and he is wroth, and with-draweth himself from men because of the evil tidings, uncertain whether he shall keep it with disgrace or bury it (alive) in the dust, Kor. 16:60; and even the modern Jew in his prayers gives thanks in this way: Blessed art thou, O king of the universe, who hast not made me a woman.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As a great Eastern Emeer, Job was rich in camels. These were used for riding when the journey was long, and for transporting produce and merchandise to the distant cities. They were also eaten by the Arabs. She-asses, the price of one of which is said to be three times that of a male, were esteemed not on account of their milk, but for the sake of their foals. In a country where wheeled carriages are unknown, they were used not only for riding, but for all purposes of home and agricultural carriage. Oxen were used for labouring the fields, for which the horse is not employed in the East. The amount of arable land was measured by the number of yoke, that is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pairs",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of oxen required to cultivate it. Job’s rich and extensive fields were plowed by a thousand oxen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 1:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Such wide possessions implied a very great “household,” that is, body of servants. And the writer finishes his picture of Job by saying that he “was the greatest of all the men (lit. children) of the East.” His “greatness” did not lie in his wealth alone, but in the respect in which he was held and in his influence. See the pathetic picture which he draws of his own former estate, ch. 29. On the general phrase “children of the East” see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 25:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 25:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And there were born unto him seven sons and three daughters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The numbers three and seven, and their product, ten, are certainly sacred numbers, regarded as expressive of ideal perfection. But this does not prevent their being also historical. As Canon Cook observes, \"Striking coincidences between outward facts and ideal numbers are not uncommon in the purely historical portions of Scripture\" ('Speaker's Commentary,' vol. 4. p. 20). There are ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "twelve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " apostles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seventy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (7 × 10) disciples sent out by our Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " deacons, three synoptic Gospels, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "twelve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " minor prophets, seven princes of Persia and Media, ten sons of Haman, three of Noah, Gomer, Terah, Levi, and Zeruiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Japhet, Mizraim, Seir the Horite, Gad, and Jesse (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 2:13-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "twelve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Ishmael, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "twelve",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Jacob, etc. Our Lord is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thirty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (3 x 10) years old when he begins to teach, and his ministry lasts ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "three",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " years; he heals ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " lepers, casts out of Mary Magdalene ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " devils, speaks upon the cross ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"words,\" bids Peter forgive his brother \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seventy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " times seven,\" etc. It is thus not only in vision or in prophecy, or in symbolical language, that these \"ideal numbers\" come to the front far more frequently than ethers, but also in the most matter-of-fact histories. Job 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2, 3  And there were born unto him seven sons and three daughters. His substance also was seven thousand sheep, and three thousand camels, and five hundred yoke of oxen, and five hundred she-asses, and servants in great number; so that this man was the greatest of all the men of the east.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is a large, princely household. The numbers are large, but must not on that account be considered an invention. The four animals named include both kinds. With the doubled אלפי corresponds the also constructive מאות, the Tsere of which is never shortened, though in the singular one says מאת, from מאה. The aorists, especially of the verb היה (הוה), which, according to its root, signifies not so much esse as fieri, existere, are intended to place us at once in the midst of his prosperity. Ex iis, says Leo Africanus in reference to flocks, Arabes suas divitias ac possessiones aestimant. In fine, Job was without his equal among the קרם בני. So the tribes are called which extend from Arabia Deserta, lying to the east of Palestine, northwards to the countries on the Euphrates, and south over Arabia Petraea and Felix. The wisdom of these tribes, treasured up in proverbs, songs, and traditions, is mentioned in 1 Kings 5:10, side by side with the wisdom of the Egyptians. The writer now takes a very characteristic feature from the life of Job, to show that, even in the height of prosperity, he preserved and manifested the piety affirmed of him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is a large, princely household. The numbers are large, but must not on that account be considered an invention. The four animals named include both kinds. With the doubled אלפי corresponds the also constructive מאות, the Tsere of which is never shortened, though in the singular one says מאת, from מאה. The aorists, especially of the verb היה (הוה), which, according to its root, signifies not so much esse as fieri, existere, are intended to place us at once in the midst of his prosperity. Ex iis, says Leo Africanus in reference to flocks, Arabes suas divitias ac possessiones aestimant. In fine, Job was without his equal among the קרם בני. So the tribes are called which extend from Arabia Deserta, lying to the east of Palestine, northwards to the countries on the Euphrates, and south over Arabia Petraea and Felix. The wisdom of these tribes, treasured up in proverbs, songs, and traditions, is mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", side by side with the wisdom of the Egyptians. The writer now takes a very characteristic feature from the life of Job, to show that, even in the height of prosperity, he preserved and manifested the piety affirmed of him. ",
            "children": []
          }
        ]
      }
    ]
  }
]