[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 1:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hast thou considered my servant Job? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hast thou taken notice of him, and of his spirit and conduct? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That there is none like him in ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "all ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the earth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Targum saith, “None like him in the land of the Gentiles;” intimating, probably, that notwithstanding he was of the Gentiles, he was yet so distinguished an example of virtue and goodness, that his equal was not to be found among them. Dr. Lightfoot speaks of Job as being, without the least doubt, a heathen, observing, “In these times, when it went thus sadly with Israel in Egypt, there shone forth the glorious piety of Job in the land of Uz,” vol. 1. p. 23; and again, p. 1026, “About (the time of) Israel’s being in Egypt, Job lives in Arabia, a heathen man, and yet so good.” And thus St. Gregory: “His country is purposely named, that the goodness of the man may be the more illustrated.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:6-12 Job's afflictions began from the malice of Satan, by the Lord's permission, for wise and holy purposes. There is an evil spirit, the enemy of God, and of all righteousness, who is continually seeking to distress, to lead astray, and, if possible, to destroy those who love God. How far his influence may extend, we cannot say; but probably much unsteadiness and unhappiness in Christians may be ascribed to him. While we are on this earth we are within his reach. Hence it concerns us to be sober and vigilant, 1Pe 5:8. See how Satan censures Job. This is the common way of slanderers, to suggest that which they have no reason to think is true. But as there is nothing we should dread more than really being hypocrites, so there is nothing we need dread less than being called and counted so without cause. It is not wrong to look at the eternal recompence in our obedience; but it is wrong to aim at worldly advantages in our religion. God's people are taken under his special protection; they, and all that belong to them. The blessing of the Lord makes rich; Satan himself owns it. God suffered Job to be tried, as he suffered Peter to be sifted. It is our comfort that God has the devil in a chain, Re 20:1. He has no power to lead men to sin, but what they give him themselves; nor any power to afflict men, but what is given him from above. All this is here described to us after the manner of men. The Scripture speaks thus to teach us that God directs the affairs of the world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hast thou considered my servant Job? - Margin, \"Set thine heart on.\" The margin is a literal translation of the Hebrew. Schultens remarks on this, that it means more than merely to observe or to look at - since it is abundantly manifest from the following verses that Satan \"had\" attentively considered Job, and had been desirous of injuring him. It means, according to him, to set himself against Job, to fix the heart on him with an intention to injure him, and yahweh means to ask whether Satan had done this. But it seems more probable that the phrase means to consider \"attentively,\" and that God means to ask him whether he had carefully observed him. Satan is represented as having no confidence in human virtue, and as maintaining that there was none which would resist temptation, if presented in a form sufficiently alluring. God here appeals to the case of Job as a full refutation of this opinion. The trial which follows is designed to test the question whether the piety of Job was of this order.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That there is none like him in the earth - That he is the very highest example of virtue and piety on earth. Or might not the word כי  kı̂y here be rendered \"for?\" \"For there is none like him in the earth.\" Then the idea would be, not that he had considered \"that\" there was none like him, but God directs his attention to him \"because\" he was the most eminent among mortals.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A perfect and an upright man - See the Notes at Job 1:1. The Septuagint translates this verse as they do Job 1:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A perfect and an upright man - See the Notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Septuagint translates this verse as they do ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. considered—Margin, \"set thine heart on\"; that is, considered attentively. No true servant of God escapes the eye of the adversary of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Hast thou taken notice of him, and his spirit and carriage? and what hast thou to say against him? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord said unto Satan, hast thou considered my servant Job,.... Or, \"hast thou put thine heart on my servant\" (p); not in a way of love and affection to him, to do him any good or service, there being an original and implacable enmity in this old serpent to the seed of the woman; but rather his heart was set upon him in a way of desire to have him in his hands, to do him all the mischief he could, as the desire of his heart was toward Peter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 22:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but the sense of the question is, since thou sayest thou hast been walking up and down in the earth, hast thou not taken notice of Job, and cast an eye upon him, and wished in thine heart to have him in thine hands to do him hurt? I know that thou hast; hast thou not contrived in thine heart how to attack him, tempt him, and draw him from my service, and into sins and snares, in order to reproach and accuse him? thou hast, but all in vain; and so it is a sarcasm upon Satan, as well as an expression of indignation at him for such an attempt upon him, and as anticipating his accusation of Job; for it is as if he should further say, I know he is in thine eye, and upon thine heart, now thou art come with a full intent to accuse and charge him; so Jarchi, \"lest thou set thine heart\", &c. so as \"to have a good will to accuse him\" he had, but the Lord prevents him, by giving a high character of him, in these and the following words: here he calls him \"my servant\"; not a servant of men, living according to the lusts and will of men, and their customs and forays of worship, superstition, and idolatry; nor a servant of sin and the lusts of the flesh; nor of Satan, who boasted of the whole earth being his; but the Lord's servant, not only by creation, but by special choice, by redemption, by efficacious grace, and the voluntary surrender of himself to the Lord under the influence of it; and by his cheerful and constant obedience he answered this character; and the Lord here claims his property in him, acknowledges him as his servant, calls him by name, and gives an high and honourable account of him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that there is none like him in the earth; or \"in the land\"; in the land of Uz, so Obadiah Sephorno; whatever there were in other countries, there were none in this, being in general idolaters; or in the land of the people of the Heathen nations, as the Targum; or rather in the whole earth, where Satan had been walking: and, very probably, Abraham, Isaac, and Jacob, were now dead; Job being, as it should seem, between them and the times of Moses; and though there might be many godly persons then living, who were like to him in quality, being partakers of the same divine nature, having the same image of God upon them, and the same graces in them, and a similar experience of divine things, yet not upon an equality with him; he exceeded them all in grace and holiness; and particularly, none came up to him for his patience in suffering affliction, though this was often tried; as Moses excelled others in meekness, and Solomon in wisdom; Job was an eminent saint and servant of the Lord, a father in his family, a pillar in his house, like Saul among the people, taller in grace and the exercise of it; and this is a reason why he could not but be taken notice of by Satan, who has his eye more especially on the most eminent saints, and envies them, and strikes at them; and so the words are by some rendered, \"for there is none like him\" (q); or rather they may be rendered, \"but there is none like him\" (r): and so are opposed to the accusations and charges Satan was come with against him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a perfect and an upright man, one that feareth God, and escheweth evil? See Gill on Job 1:1. Here the character there given is confirmed by the Lord in the express words of it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "a perfect and an upright man, one that feareth God, and escheweth evil? See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here the character there given is confirmed by the Lord in the express words of it. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p)    \"nunquid posuisti cor tuum super servum meum\", Pagninus, Montanus, Bolducius, Schmidt. (q) \"nam\", Piscator. (r) \"Atqui\", Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p)    \"nunquid posuisti cor tuum super servum meum\", Pagninus, Montanus, Bolducius, Schmidt. (q) \"nam\", Piscator. (r) \"Atqui\", Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD said unto Satan, Hast thou considered my servant Job, that there is none like him in the earth, a perfect and an upright man, one that feareth God, and escheweth evil?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The integrity and godliness attributed to Job by the author of the Poem are confirmed by God Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the Lord said unto Satan, Hast thou considered?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " literally. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Hast thou set thine heart on?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " equivalent to \"Hast thou given thine attention to?\" (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 1:5, 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "My servant Job",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"my ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "true",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " servant, faithful in all that he does\" (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is a high honour to any man for God to acknowledge him as his servant (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That there is none like him in the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for there is none like him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the Revised Version). This is given as a reason why Satan should have paid special attention to his case, and is a sort of challenge: \"Thou that art always spying out some defect or other in a righteous man, hast thou noted my servant Job, and discovered any fault in him?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A perfect and an upright man, one that feareth God, and escheweth evil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the comment on ver. 1). Job 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8  Then said Jehovah to Satan, Hast thou considered my servant Job? for there is none like him in the earth, a perfect and an upright man, one that feareth God and escheweth evil.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "By כּי Jehovah gives the reason of His inquiry. Had Satan been observant of Job, even he must have confessed that there was on the earth real genuine piety. לב שׂים, animum advertere (for לב is animus, נפשׁ anima), is construed with על, of the object on which the attention falls, and on which it fixes itself, or אל, of the object towards which it is directed (Job 2:3). The repetition of the four predicates used of Job (Job 1:1) in the mouth of Jehovah (though without the waw combining both pairs there) is a skilful touch of the poet. Further on, the narrative is also interwoven with poetic repetitions (as e.g., Job 34 and Genesis 1), to give it architectural symmetry, and to strengthen the meaning and impression of what is said. Jehovah triumphantly displays His servant, the incomparable one, in opposition to Satan; but this does not disconcert him: he knows how, as on all occasions, so here also, to deny what Jehovah affirms. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "By כּי Jehovah gives the reason of His inquiry. Had Satan been observant of Job, even he must have confessed that there was on the earth real genuine piety. לב שׂים, animum advertere (for לב is animus, נפשׁ anima), is construed with על, of the object on which the attention falls, and on which it fixes itself, or אל, of the object towards which it is directed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The repetition of the four predicates used of Job (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in the mouth of Jehovah (though without the waw combining both pairs there) is a skilful touch of the poet. Further on, the narrative is also interwoven with poetic repetitions (as e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), to give it architectural symmetry, and to strengthen the meaning and impression of what is said. Jehovah triumphantly displays His servant, the incomparable one, in opposition to Satan; but this does not disconcert him: he knows how, as on all occasions, so here also, to deny what Jehovah affirms. ",
            "children": []
          }
        ]
      }
    ]
  }
]