[{"header":"Esther Goes before the King"},{"num":5,"verse":"On the third day, Esther put on her royal attire and stood in the inner courtyard of the palace in front of the king’s quarters. The king was sitting on his royal throne in the throne room, opposite the entrance to the building. "},{"num":2,"verse":"When the king saw Queen Esther standing in the courtyard, she won his favor, and the king extended to Esther the gold scepter that he was holding. Esther approached and touched the top of the scepter. "},{"num":3,"verse":"The king asked her, “What do you want, Queen Esther? What is your request? Even if it’s half of the kingdom, it will be given to you.”"},{"num":4,"verse":"Esther replied, “If it pleases the king, let the king and Haman come today to the banquet I’ve prepared for him.”"},{"num":5,"verse":"The king responded, “Bring Haman quickly so we may do what Esther has requested.” So the king and Haman went to the banquet that Esther had prepared."},{"num":6,"verse":"While they were drinking wine, the king asked Esther, “What’s your petition? It will be given to you. What’s your request? Up to half of the kingdom, and it will be done.”"},{"num":7,"verse":"Esther answered, “This is my petition and my request: "},{"num":8,"verse":"If I’ve found favor with the king and if it pleases the king to grant my petition and to honor my request, let the king and Haman come to the banquet that I’ll prepare for them tomorrow, and then I’ll do what the king has said.”"},{"header":"Haman’s Plan to Kill Mordecai"},{"num":9,"verse":"Haman went out that day pleased and happy, but when Haman saw Mordecai in the king’s gate, and that he did not stand up and tremble in his presence, Haman was furious with Mordecai. "},{"num":10,"verse":"Haman restrained himself, went to his house, and sent for his friends and his wife Zeresh. "},{"num":11,"verse":"Then Haman told them about his splendid wealth, the number of his sons, all the ways the king had honored him, and that he had promoted him above all the other officials and ministers of the king."},{"num":12,"verse":"Then Haman said, “Even Queen Esther brought no one except me with the king to the banquet that she held. Furthermore, I (along with the king) have also been invited by her tomorrow. "},{"num":13,"verse":"But all this does not satisfy me every time I see Mordecai the Jew sitting at the king’s gate.”"},{"num":14,"verse":"Then Zeresh his wife and all his friends said, “Have a pole made 50 cubits high, and then in the morning speak to the king and have Mordecai hanged on it. Then go with the king to the banquet happy.” This advice pleased Haman, and he had the pole made."}]