[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore are they before the throne . . . ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "On this account are they before the throne of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because they so washed their robes, and made them white in the blood of the Lamb. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where a well-supported reading is, “Blessed are they that wash their robes, that they may have right to the tree of life,” &c.) They are before the throne: they are like Him, for they see Him as He is (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1John 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "serve Him day and night in His temple, and He that sitteth upon the throne shall tabernacle over them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The life is not simply one of joy or safety, it is one also of service. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Those who were made priests to God here carry on their service in His temple; yet it is to be remembered that this can only be figurative language, for in the heavenly city there is no temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It serves to teach us that the servant will find his fitting work of service there as well as here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He that sitteth upon the throne shall tabernacle over them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is worth noticing how persistently St. John keeps up the phrase, “He that sitteth upon the throne” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or dwell as in a tent: The rendering “shall dwell” among them does not do justice to this word, and at the same time obscures the allusion which the seer has in his mind. The allusion is to the Shechinah, the symbol of the Divine Presence, which rested over the mercy seat. “The idea that the Shechinah, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σκηνή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "skéné",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the glory which betokened the Divine Presence in the Holy of Holies, and which was wanting to the sacred temple, would be restored once more in Messiah’s days was a cherished hope of the Jewish doctors during and after the Apostolic ages.” The expected and wished-for glory would be seen among God’s saints. God’s tabernacle shall be with them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and with them so as to stretch over them: He will tabernacle over (or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " them. With this we may compare St. Paul’s expression in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Corinthians 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“that the power of Christ may tabernacle” —“rest” in the English version—“upon me”), where Professor Lightfoot (whose words have just been quoted) thinks that there is a similar reference to the symbol of the Divine Presence in the Holy of Holies. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 4:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) There seems also to be a carrying on of the imagery derived from the Feast of Tabernacles: as there were the palm branches of the harvest joy, so there will be the booth, or tabernacle, of God’s presence among them. He shall be their pavilion, their shelter. “There shall be a tabernacle for a shadow in the day-time from the heat, and for a place of refuge and for a covert from storm and from rain.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "‘THREE TABERNACLES’John 1:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘THREE TABERNACLES’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The word rendered ‘dwelt’ in these three passages, is a peculiar one. It is only found in the New Testament-in this Gospel and in the Book of Revelation. That fact constitutes one of the many subtle threads of connection between these two books, which at first sight seem so extremely unlike each other; and it is a morsel of evidence in favour of the common authorship of the Gospel and of the Apocalypse, which has often, and very vehemently in these latter days of criticism, been denied.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The force of the word, however, is the matter to which I desire especially to draw attention. It literally means ‘to dwell in a tent,’ or, if we may use such a word, ‘to tabernacle,’ and there is no doubt a reference to the Tabernacle in which the divine Presence abode in the wilderness and in the land of Israel before the erection. In all three passages, then, we may see allusion to that early symbolical dwelling of God with man. ‘The Word tabernacled among us’; so is the truth for earth and time. ‘He that sitteth upon the throne shall spread His tabernacle upon’ the multitude which no man can number, who have made their robes white in the blood of the Lamb; that is the truth for the spirits of just men made perfect, the waiting Church, which expects the redemption of the body. ‘God shall tabernacle with them’; that is the truth for the highest condition of humanity, when the Tabernacle of God shall be with redeemed men in the new earth. ‘Let us build three tabernacles,’ one for the Incarnate Christ, one for the interspace between earth and heaven, and one for the culmination of all things. And it is to these three aspects of the one thought, set forth in rude symbol by the movable tent in the wilderness, that I ask you to turn now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, we have to think of that Tabernacle for earth. ‘The Word was made flesh, and dwelt, as in a tent, amongst us.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, then, we have to think of that Tabernacle for earth. ‘The Word was made flesh, and dwelt, as in a tent, amongst us.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The human nature, the visible, material body of Jesus Christ, in which there enshrined itself the everlasting Word, which from the beginning was the Agent of all divine revelation, that is the true Temple of God. When we begin to speak about the special presence of Omnipresence in any one place, we soon lose ourselves, and get into deep waters of glory, where there is no standing. And I do not care to deal here with theological definitions or thorny questions, but simply to set forth, as the language of my text sets before us, that one transcendent, wonderful, all-blessed thought that this poor human nature is capable of, and has really once in the history of the world received into itself, the real, actual presence of the whole fulness of the Divinity. What must be the kindred and likeness between Godhood and manhood when into the frail vehicle of our humanity that wondrous treasure can be poured; when the fire of God can burn in the bush of our human nature, and that nature not be consumed? So it has been. ‘In Him dwelleth all the fulness of the Godhead bodily.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And when we come with our questions, How? In what manner? How can the lesser contain the greater? we have to be content with the recognition that the manner is beyond our fathoming, and to accept the fact, pressed upon our faith, that our hearts may grasp it and be at peace. God hath dwelt in humanity. The everlasting Word, who is the forthcoming of all the fulness of Deity into the realm of finite creatures, was made flesh and dwelt among us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the Tabernacle was not only the dwelling-place of God, it was also and, therefore, the place of Revelation of God. So in our text there follows, ‘we beheld His glory.’ As in the tent in the wilderness there hovered between the outstretched wings of the silent cherubim, above the Mercy-seat, the brightness of the symbolical cloud which was expressly named ‘the glory of God,’ and was the visible manifestation of His real presence; so John would have us think that in that lowly humanity, with its curtains and its coverings of flesh, there lay shrined in the inmost place the brightness of the light of the manifest glory of God. ‘We beheld His glory.’ The rapturous adoration of the remembrance overcomes him, and he breaks his sentence, reckless of grammatical connection, as the fulness of the blessed memory floods into his soul. ‘That glory was as of the Only Begotten of the Father.’ The manifestation of God in Christ is unique, as becomes Him who partakes of the nature of that God of whom He is the Representative and the Revealer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And how did that glory make itself known to us? By miracle? Yes! As we read in the story of the first that Christ wrought, ‘He manifested forth His glory and His disciples believed upon Him.’ By miracle? Yes! As we read His own promise at the grave of Lazarus: ‘Said I not unto thee, that, if thou wouldest believe, thou shouldest see the glory of God?’ But, blessed be His name, miracle is not the highest manifestation of Christ’s glory and of God’s. The uniqueness of the revelation of Christ’s glory in God does not depend upon the deeds which He wrought. For, as the context goes on to tell, the Word which tabernacled among us was ‘full of grace and truth,’ and therein is the glory most gloriously revealed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The lambent light of stooping love that shone forth warning and attracting in His gentle life, and the clear white beam of unmingled truth that streamed from the radiant purity of Christ’s life, revealed God to hearts that pine for love and spirits that hunger for truth, as no others of God’s self-revealing works have done. And that revelation of the glory of God in the fulness of grace and truth is the highest possible revelation. For the divinest thing in God is love, and the true ‘glory of God’ is neither some symbolical flashing light nor the pomp of mere power and majesty; nor even those inconceivable and incommunicable attributes which we christen with names like Omnipotence and Omnipresence and Infinitude, and the like. These are all at the fringes of the brightness. The true central heart and lustrous light of the glory of God lie In His love, and of that glory Christ is the unique Representative and Revealer, because He is the only Begotten Son, and ‘full of grace and truth.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus the Word tabernacled amongst us. And though the Tabernacle to outward seeming was covered by curtains and skins that hid all the glowing splendour within; yet in that lowly life that was lived in the body of His humiliation, and knew our limitations and our weaknesses, ‘the glory of the Lord was revealed; and all flesh hath seen it together’ and acknowledged the divine Presence there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Still further the Tabernacle was the place of sacrifice. So in the tabernacle of His flesh Jesus offered up the one sacrifice for sins for ever. In the offering up of His human life in continuous obedience, and in the offering up of His body and blood in the bitter Passion of the Cross, He brought men nigh unto God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Therefore, because of all these things, because the Tabernacle is the dwelling-place of God, the place of revelation, and the place of sacrifice, therefore, finally is it the meeting-place betwixt God and man. In the Old Testament it is always called by the name which our Revised Version has accurately substituted for ‘tabernacle of the congregation,’ namely ‘tent of meeting.’ The correctness of that rendering and the meaning of the name are established by several passages in the Old Testament, as for instance, ‘There I will meet with you, to speak there unto thee, and there I will meet with the children of Israel.’ So in Christ, who by His Incarnation lays His hand upon both, God touches man and man touches God. We who are afar off are made nigh, and in that ‘true tabernacle which the Lord pitched and not man’ we meet God and are glad.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘And so the word was flesh, and wroughtWith human hands the creed of creeds,In loveliness of perfect deeds.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘And so the word was flesh, and wrought",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "With human hands the creed of creeds,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In loveliness of perfect deeds.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The temple for earth is ‘the temple of His body.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We have the Tabernacle for the Heavens. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We have the Tabernacle for the Heavens.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In the context of our second passage we have a vision of the great multitude redeemed out of all nations and kindreds, ‘standing before the Throne and before the Lamb, arrayed in white robes, and palms in their hands.’ The palms in their hands give important help towards understanding the vision. As has been often remarked, there are no heathen emblems in the Book of the Apocalypse. All its metaphors move within the circle of Jewish experiences and facts. So that we are not to think of the Roman palm of victory, but of the Jewish palm which was borne at the Feast of Tabernacles. What was the Feast of Tabernacles? A festival established on purpose to recall to the minds and to the gratitude of the Jews settled in their own land the days of their wandering in the wilderness. Part of the ritual of it was that during its celebration they builded for themselves booths or tabernacles of leaves and boughs of trees, under which they dwelt, thus reminding themselves of their nomad condition.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now what beauty and power it gives to the word of my text, if we take in this allusion to the Jewish festival! The great multitude bearing the palms are keeping the feast, memorial of past wilderness wanderings; and ‘He that sitteth on the throne shall spread His tabernacle above them,’ as the word might be here rendered. That is to say, He Himself shall build and be the tent in which they dwell; He Himself shall dwell with them in it. He Himself, in closer union than can be conceived of here, shall keep them company during that feast.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What a thought of that condition-the condition as I believe represented in this vision-of the spirits of the just made perfect, ‘who wait for the adoption, to wit, the resurrection of the body,’ is given us if we take this point of view to interpret the whole lovely symbolism. It is all a time of glad, grateful remembrance of the wilderness march. It is all a time in which festal joys shall be theirs, and the memory of the trials and the weariness and the sorrow and the solitude that are past shall deepen to a more exquisite poignancy of delight, the rest and the fellowship and the felicity of that calm Presence, and God Himself shall spread His tent above them, lodge with them, and they with Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, dear brethren, rest in that assurance, that though we know so little of that state, we know this: ‘Absent from the body, present with the Lord,’ and that the happy company who bear the palms shall dwell in God, and God in them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now, lastly, look at that final vision which we have in these texts, which we may call the Tabernacle for the renewed earth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now, lastly, look at that final vision which we have in these texts, which we may call the Tabernacle for the renewed earth.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I do not pretend to interpret the scenery and the setting of these Apocalyptic visions with dogmatic confidence, but it seems to me as if the emblems of this final vision coincide with dim hints in many other portions of Scripture; to the effect that some cosmical change having passed upon this material world in which we dwell, it, in some regenerated form, shall be the final abode of a regenerated and redeemed humanity. That, I think, is the natural interpretation of a great deal of Scriptural teaching.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For that highest condition there is set forth this as the all-sufficing light upon it. ‘Behold, the Tabernacle of God is with men, and He will tabernacle with them.’ The climax and the goal of all the divine working, and the long processes of God’s love for, and discipline of, the world, are to be this, that He and men shall abide together in unity and concord. That is God’s wish from the beginning. We read in one of the profound utterances of the Book of Proverbs how from of old the ‘delights’ of the Incarnate Wisdom which foreshadowed the Incarnate Word ‘were with the sons of men.’ And, at the close of all things, when the vision of this final chapter shall be fulfilled, God will say, settling Himself in the midst of a redeemed humanity, ‘Lo! here will I dwell, for I have desired it. This is My rest for ever.’ He will tabernacle with men, and men with Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We know not, and never shall know until experience strips the bandages from our eyes, what new methods of participation of the divine nature, and new possibilities of intimacy and intercourse with Him may be ours when the veils of flesh and sense and time have all dropped away. New windows may be opened in our spirits, from which we shall perceive new aspects of the divine character. New doors may be opened in our souls, from out of which we may pass to touch parts of His nature, all impalpable and inconceivable to us now. And when all the veils of a discordant moral nature are taken away, and we are pure, then we shall see, then we shall draw nigh to God. The thing that chiefly separates man from God is man’s sin. When that is removed, the centrifugal force which kept our tiny orb apart from the great central sun being withdrawn, we shall, as it were, fall into the brightness and be one, not losing our sense of individuality, which would be to lose all the blessedness, but united with Him in a union far more intimate than earth can parallel. ‘The Tabernacle of God shall be with men, and He will tabernacle with them.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Do not let us forget that this highest and ultimate hope that is held forth here, of the union and communion, perfect and perpetual, of humanity with God, does not sweep aside Jesus Christ. For through all eternity the Everlasting Word, the Christ who bears our nature in its glorified form, or, rather, whose nature in its glorified form we shall bear, is the Medium of Revelation, and the Medium of communication between man and God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘I saw no Temple therein,’ says this final vision of the Apocalypse, but ‘God Almighty and the Lamb,’ and these are the Temples thereof. Therefore through eternity God shall tabernacle with men, as He does tabernacle with us now through Him, in whom dwelleth as in its perennial habitation, ‘all the fulness of the Godhead bodily.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So we have the three tabernacles, for earth, for heaven, for the renewed earth; and these three, if I may say so, are like the triple division of that ancient Tabernacle in the wilderness: the Outer Court; the Holy Place; the Holiest of all. Let us enter into that outer court, and abide and commune with that God who comes near to us, revealing, forgiving, in the person of His Son, and then we shall pass from court to court, ‘and go from strength to strength, until every one of us in Zion appear before God’; and enter into the Holiest of all, where ‘within the veil’ we shall receive splendours of revelation undreamed of here, and enjoy depths of communion to which the selectest moments of fellowship with God on earth are shallow and poor.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:13-17 Faithful Christians deserve our notice and respect; we should mark the upright. Those who would gain knowledge, must not be ashamed to seek instruction from any who can give it. The way to heaven is through many tribulations; but tribulation, how great soever, shall not separate us from the love of God. Tribulation makes heaven more welcome and more glorious. It is not the blood of the martyrs, but the blood of the Lamb, that can wash away sin, and make the soul pure and clean in the sight of God; other blood stains, this is the only blood that makes the robes of the saints white and clean. They are happy in their employment; heaven is a state of service, though not of suffering; it is a state of rest, but not of sloth; it isa praising, delightful rest. They have had sorrows, and shed many tears on account of sin and affliction; but God himself, with his own gracious hand, will wipe those tears away. He deals with them as a tender father. This should support the Christian under all his troubles. As all the redeemed owe their happiness wholly to sovereign mercy; so the work and worship of God their Saviour is their element; his presence and favour complete their happiness, nor can they conceive of any other joy. To Him may all his people come; from him they receive every needed grace; and to him let them offer all praise and glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore are they before the throne of God - The reason why they are there is to be traced to the fact that the Lamb shed his blood to make expiation for sin. No other reason can be given why anyone of the human race is in heaven; and that is reason enough why any of that race are there.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And serve him day and night in his temple - That is, continually or constantly. Day and night constitute the whole of time, and this expression, therefore, denotes constant and uninterrupted service. On earth, toil is suspended by the return of night, and the service of God is intermitted by the necessity of rest; in heaven, as there will be no weariness, there will be no need of intermission, and the service of God, varied doubtless to meet the state of the mind, will be continued forever. The phrase, \"to serve him in his temple,\" refers undoubtedly to heaven, regarded as the temple or holy dwelling-place of God. See the notes on Revelation 1:6.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And serve him day and night in his temple - That is, continually or constantly. Day and night constitute the whole of time, and this expression, therefore, denotes constant and uninterrupted service. On earth, toil is suspended by the return of night, and the service of God is intermitted by the necessity of rest; in heaven, as there will be no weariness, there will be no need of intermission, and the service of God, varied doubtless to meet the state of the mind, will be continued forever. The phrase, \"to serve him in his temple,\" refers undoubtedly to heaven, regarded as the temple or holy dwelling-place of God. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And he that sitteth on the throne - God. See the notes at Revelation 4:2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he that sitteth on the throne - God. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall dwell among them - σκηνώσει  skēnōsei. This word properly means, \"to tent, to pitch a tent\"; and, in the New Testament, to dwell as in tents. The meaning here is, that God would dwell among them as in a tent, or would have his abode with them. Perhaps the allusion is to the tabernacle in the wilderness. That was regarded as the special dwelling-place of God, and that always occupied a central place among the tribes of Israel. So in heaven there will be the consciousness always that God dwells there among his people, and that the redeemed are gathered around him in his own house. Prof. Stuart renders this, it seems to me, with less beauty and propriety, \"will spread his tent over them,\" as meaning that he would receive them into intimate connection and union with him, and offer them his protection. Compare Revelation 21:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall dwell among them - σκηνώσει  skēnōsei. This word properly means, \"to tent, to pitch a tent\"; and, in the New Testament, to dwell as in tents. The meaning here is, that God would dwell among them as in a tent, or would have his abode with them. Perhaps the allusion is to the tabernacle in the wilderness. That was regarded as the special dwelling-place of God, and that always occupied a central place among the tribes of Israel. So in heaven there will be the consciousness always that God dwells there among his people, and that the redeemed are gathered around him in his own house. Prof. Stuart renders this, it seems to me, with less beauty and propriety, \"will spread his tent over them,\" as meaning that he would receive them into intimate connection and union with him, and offer them his protection. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. Therefore—because they are so washed white; for without it they could never have entered God's holy heaven; Re 22:14, \"Blessed are those who wash their robes (the oldest manuscripts reading), that they may have right to the tree of life, and may enter in through the gates into the city\"; Re 21:27; Eph 5:26, 27.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "before—Greek, \"in the presence of.\" Mt 5:8; 1Co 13:12, \"face to face.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "throne … temple—These are connected because we can approach the heavenly King only through priestly mediation; therefore, Christ is at once King and Priest on His throne.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "day and night—that is, perpetually; as those approved of as priests by the Sanhedrim were clothed in white, and kept by turns a perpetual watch in the temple at Jerusalem; compare as to the singers, 1Ch 9:33, \"day and night\"; Ps 134:1. Strictly \"there is no night\" in the heavenly sanctuary (Re 22:5).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in his temple—in what is the heavenly analogue to His temple on earth, for strictly there is \"no temple therein\" (Re 21:22), \"God and the Lamb are the temple\" filling the whole, so that there is no distinction of sacred and secular places; the city is the temple, and the temple the city. Compare Re 4:8, \"the four living creatures rest not day and night, saying, Holy,\" &c.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall dwell among them—rather (Greek, \"scenosei ep' autous\"), \"shall be the tabernacle over them\" (compare Re 21:3; Le 26:11, especially Isa 4:5, 6; 8:14; 25:4; Eze 37:27). His dwelling among them is to be understood as a secondary truth, besides what is expressed, namely, His being their covert. When once He tabernacled among us as the Word made flesh, He was in great lowliness; then He shall be in great glory.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore are they before the throne of God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not that they by their sufferings have merited heaven, but because it pleaseth God of his free grace so to reward them; therefore it was said, not only that they were such as came out of tribulation, but that they had washed their garments in the blood of the Lamb, whose blood had paid the price of their salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And serve him day and night in his temple:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "temple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " some understand the church in this life, but it is foreign to the true sense of the text; for John saw only their souls before the throne, their bodies were in their graves. By the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is meant heaven, where God dwelleth, and is worshipped more gloriously and constantly than he was in the Jewish temple, or in any part of the militant church. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he that sitteth on the throne shall dwell among them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as God by his gracious presence dwelt in the Jewish temple, so God by his glorious presence shall dwell amongst his glorified saints. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore are they before the throne of God,.... See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not because of their great tribulations, but because they were brought through them, and out of them, by the grace and power of God; nor because of their robes, or conversation garments, but because those were washed and made white in the blood of the Lamb; or because of the blood of the Lamb, and their justification, pardon, and cleansing by it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and serve him day and night in his temple; not in any material temple, but in the new Jerusalem, the general assembly and church of the firstborn, the temple of the living God; for in this state there will be no material temple, or place of worship, but God and the Lamb will be the temple thereof, Revelation 21:22; nor will there be any night there, Revelation 22:5; wherefore this phrase, day and night, only denotes the constancy and uninterruption of their service, there being nothing to obstruct them in it, or break them off from it, as now; in allusion to the priests and Levites, who were, one or other of them, night or day in the service of the temple: and the service of these persons in the new Jerusalem state will not lie in attending on the word and ordinances, or in the ministration of them, as in the present state; but in praising God, singing Hallelujahs to him, adoring the perfections of his nature, and admiring his wonderful works of providence and grace, and ascribing the glory of salvation to him, and to the Lamb; and this their service will be the glorious liberty of the children of God. Hence the Ethiopic version renders it, \"and they praise him day and night\"; this will be the employment of the saints in the millennium state, and to all eternity: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and serve him day and night in his temple; not in any material temple, but in the new Jerusalem, the general assembly and church of the firstborn, the temple of the living God; for in this state there will be no material temple, or place of worship, but God and the Lamb will be the temple thereof, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; nor will there be any night there, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 22:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; wherefore this phrase, day and night, only denotes the constancy and uninterruption of their service, there being nothing to obstruct them in it, or break them off from it, as now; in allusion to the priests and Levites, who were, one or other of them, night or day in the service of the temple: and the service of these persons in the new Jerusalem state will not lie in attending on the word and ordinances, or in the ministration of them, as in the present state; but in praising God, singing Hallelujahs to him, adoring the perfections of his nature, and admiring his wonderful works of providence and grace, and ascribing the glory of salvation to him, and to the Lamb; and this their service will be the glorious liberty of the children of God. Hence the Ethiopic version renders it, \"and they praise him day and night\"; this will be the employment of the saints in the millennium state, and to all eternity: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and he that sitteth on the throne shall dwell among them; or \"tabernacle over them\"; for the tabernacle of God shall be now among men, and he will dwell among the saints; they shall enjoy his presence, and have the most intimate communion with him; it will appear most manifest that he is their covenant God, and they are his covenant people; and he will be a tabernacle, not only of inhabitation, but of protection for them; and the name of this city, this new Jerusalem, will be \"Jehovah Shammah\", the Lord is there. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he that sitteth on the throne shall dwell among them; or \"tabernacle over them\"; for the tabernacle of God shall be now among men, and he will dwell among the saints; they shall enjoy his presence, and have the most intimate communion with him; it will appear most manifest that he is their covenant God, and they are his covenant people; and he will be a tabernacle, not only of inhabitation, but of protection for them; and the name of this city, this new Jerusalem, will be \"Jehovah Shammah\", the Lord is there. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore are they before the throne of God, and serve him {d} day and night in his temple: and he that sitteth on the throne shall dwell {e} among them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Therefore are they before the throne of God, and serve him ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " day and night in his temple: and he that sitteth on the throne shall dwell ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " among them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) He alludes to the Levites, who served day and night, for there is no night in heaven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Or, upon them, referring to God's defence and protection of those who are as safe, as men in the Lord's tents.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Ritual as well as pastoral traits from the O.T. fill out the conception of this final bliss with its favoured position (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐνώπ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θρόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). Note the singular tenderness of the oxymoron—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he that sitteth on the throne",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the majestic almighty God) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall overshadow them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with a presence of brooding, intimate, care; followed by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ποιμανεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here (as opposed to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in its literal sense of tender shepherding on the part of Jesus. The messiah as shepherd was an ancient and familiar conception. This verse is partly adapted from Enoch 45:4–6. Unlike ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it reflects a Christian fulfilment of the Jewish anticipation (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Sir 24:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.) that the Shekinah would return in the era of final bliss.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before the throne",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Perhaps in a more favoured position than is given to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", even among Saints: as we have similar language about the most favoured Angels, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "serve Him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sense would be clearer if the word were rendered “worship:” it does not mean that they have active work to do for Him, but that they do what is the appropriate service of His Temple.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall dwell among them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, as R. V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shall spread his tabernacle over them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the verb is the same, but there the preposition “with” is right. The word is used in the N. T., and in Hellenistic writers generally, to express the dwelling of the Divine Presence in any of its manifestations: see esp. St John’s Gospel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Greek word for “tabernacle,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "scênê",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was the more readily used in this sense because of its assonance with the late Hebrew word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shěchînêh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for “the cloud of glory shadowing the Mercy-seat.” Here perhaps the thought is rather of that manifestation of God’s Presence than of the fuller and later Presence in the Incarnation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διὰ τοῦτο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") No one is permitted to come forth into sight, unless he is clothed with a white robe.—V. g.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Therefore are they before the throne of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That is, because they have been washed, and have their robes made white, they are before the throne (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 5:25-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Christ loved the Church, and gave himself for it; that he might sanctify and cleanse it,...  that he might present it to himself a glorious Church, not having spot, or wrinkle,\" etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And serve him day and night in his temple.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 4:8, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:8-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Temple",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ναός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the \"dwelling place, the shrine, of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " heaven. Thus are the redeemed made \"pillars\" in his temple (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he that sitteth on the throne shall dwell among them;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall spread his tabernacle over them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). The same verb that occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The allusion (not an uncommon one with St. John) is to the Shechinah which overshadowed the mercy seat. God's presence among them, co-dwelling with them, is the happiness of his people (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 17:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Father, I will that they also be with me,\" etc.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"We shall be like him; for we shall see him as he is \"). Revelation 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because of this washing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Before the throne",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare Ephesians 5:27.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 5:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Serve (λατρεύουσιν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on Luke 1:74. In scripture the verb never expresses any other service but that of the true God, or of the gods of heathenism.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:74",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In scripture the verb never expresses any other service but that of the true God, or of the gods of heathenism.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Temple (ναῷ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or sanctuary. See on Matthew 4:5.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Or sanctuary. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Dwell (σκηνώσει)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From σκηνή a tent or tabernacle. Hence better, as Rev., shall spread His tabernacle. See on John 1:14, and compare Leviticus 26:11; Isaiah 4:5, Isaiah 4:6; Ezekiel 37:27. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From σκηνή a tent or tabernacle. Hence better, as Rev., shall spread His tabernacle. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 37:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]