[{"header":"A Message about Jerusalem"},{"num":22,"verse":"This is a message about the Valley of Vision."},{"num":2,"verse":"The whole city is in an uproar, filled with noise and excitement."},{"num":3,"verse":"All your leaders ran away and were captured before they shot a single arrow. "},{"num":4,"verse":"Now leave me alone to weep bitterly over all those of my people who have died. Don't try to comfort me. "},{"num":5,"verse":"This is a time of panic, defeat, and confusion in the Valley of Vision, and the Sovereign Lord Almighty has sent it on us. The walls of our city have been battered down, and cries for help have echoed among the hills."},{"num":6,"verse":"The soldiers from the land of Elam came riding on horseback, armed with bows and arrows. Soldiers from the land of Kir had their shields ready. "},{"num":7,"verse":"The fertile valleys of Judah were filled with chariots; soldiers on horseback stood in front of Jerusalem's gates. "},{"num":8,"verse":"All of Judah's defenses crumbled."},{"num":9,"verse":"You found the places where the walls of Jerusalem needed repair. You inspected all the houses in Jerusalem and tore some of them down to get stones to repair the city walls. In order to store water, "},{"num":11,"verse":"you built a reservoir inside the city to hold the water flowing down from the old pool. But you paid no attention to God, who planned all this long ago and who caused it to happen."},{"num":12,"verse":"The Sovereign Lord Almighty was calling you then to weep and mourn, to shave your heads and wear sackcloth. "},{"num":13,"verse":"Instead, you laughed and celebrated. You killed sheep and cattle to eat, and you drank wine. You said, “We might as well eat and drink! Tomorrow we'll be dead.”"},{"num":14,"verse":"The Sovereign Lord Almighty himself spoke to me and said, “This evil will never be forgiven them as long as they live. I, the Sovereign Lord Almighty, have spoken.”"},{"header":"A Warning to Shebna"},{"num":15,"verse":"The Sovereign Lord Almighty told me to go to Shebna, the manager of the royal household, and say to him, "},{"num":16,"verse":"“Who do you think you are? What right do you have to carve a tomb for yourself out of the rocky hillside? "},{"num":17,"verse":"You may be important, but the Lord will pick you up and throw you away. "},{"num":18,"verse":"He will pick you up like a ball and throw you into a much larger country. You will die there beside the chariots you were so proud of. You are a disgrace to your master's household. "},{"num":19,"verse":"The Lord will remove you from office and bring you down from your high position.”"},{"num":20,"verse":"The Lord said to Shebna, “When that happens, I will send for my servant Eliakim son of Hilkiah. "},{"num":21,"verse":"I will put your official robe and belt on him and give him all the authority you have had. He will be like a father to the people of Jerusalem and Judah. "},{"num":22,"verse":"I will give him complete authority under the king, the descendant of David. He will have the keys of office; what he opens, no one will shut, and what he shuts, no one will open. "},{"num":23,"verse":"I will fasten him firmly in place like a peg, and he will be a source of honor to his whole family."},{"num":24,"verse":"“But all his relatives and dependents will become a burden to him. They will hang on him like pots and bowls hanging from a peg! "},{"num":25,"verse":"When that happens, the peg that was firmly fastened will pull loose and fall. And that will be the end of everything that was hanging on it.” The Lord has spoken."}]