[{"num":22,"verse":"1 He prophesieth of the destruction of Jerusalem by Nebuchadnezzar. 15 A threatening against Shebna. 20 To whose office Eliakim is preferred."},{"num":1,"verse":"The burden of the valley of vision. What aileth thee now that thou art wholly gone up unto the house tops?"},{"num":2,"verse":"Thou that art full of noise, a city full of brute, a joyous city, thy slain men shall not be slain with sword, nor die in battle."},{"num":3,"verse":"All thy princes shall flee together from the bow: they shall be bound: all that shall be found in thee, shall be bound together, which have fled from far."},{"num":4,"verse":"Therefore said I, Turn away from me, I will weep bitterly: labor not to comfort me for the destruction of the daughter of my people."},{"num":5,"verse":"For it is a day of trouble, and of ruin, and of perplexity by the Lord God of hosts in the valley of vision, breaking down the city: and a crying unto the mountains."},{"num":6,"verse":"¶ And Elam bare the quiver in a man’s chariot with horsemen, and Kir uncovered the shield."},{"num":7,"verse":"And thy chief valleys were full of chariots, and the horsemen set themselves in array against the gate."},{"num":8,"verse":"And he discovered the covering of Judah: and thou didst look in that day to the armor of the house of the forest."},{"num":9,"verse":"And ye have seen the breaches of the city of David: for they were many, and ye gathered the waters of the lower pool."},{"num":10,"verse":"And ye numbered the houses of Jerusalem, and the houses have ye broken down to fortify the wall,"},{"num":11,"verse":"And have also made a ditch between the two walls, for the waters of the old pool, and have not looked unto the maker thereof, neither had respect unto him that formed it of old."},{"num":12,"verse":"And in that day did the Lord God of hosts call unto weeping and mourning, and to baldness and girding with sackcloth."},{"num":13,"verse":"And behold, joy and gladness, slaying oxen and killing sheep, eating flesh, and drinking wine, eating and drinking, for tomorrow we shall die."},{"num":14,"verse":"And it was declared in the ears of the Lord of hosts. Surely this iniquity shall not be purged from you, till ye die, saith the Lord God of hosts."},{"num":15,"verse":"Thus saith the Lord God of hosts, Go, get thee to that treasurer, to Shebna, the steward of the house, and say,"},{"num":16,"verse":"What hast thou to do here? and whom hast thou here? that thou shouldest here hew thee out a sepulcher, as he that heweth out his sepulcher in a high place, or that graveth an habitation for himself in a rock?"},{"num":17,"verse":"Behold, the Lord will carry thee away with a great captivity, and will surely cover thee."},{"num":18,"verse":"He will surely roll and turn thee like a ball in a large country: there shalt thou die, and there the chariots of thy glory shall be the shame of thy lord’s house."},{"num":19,"verse":"And I will drive thee from thy station, and out of thy dwelling will he destroy thee."},{"num":20,"verse":"And in that day will I call my servant Eliakim the son of Hilkiah,"},{"num":21,"verse":"And with thy garments will I clothe him, and with thy girdle will I strengthen him: thy power also will I commit into his hand, and he shall be a father of the inhabitants of Jerusalem, and of the house of Judah."},{"num":22,"verse":"And the key of the house of David will I lay upon his shoulder: so he shall open, and no man shall shut: and he shall shut, and no man shall open."},{"num":23,"verse":"And I will fasten him as a nail in a sure place, and he shall be for the throne of glory to his father’s house."},{"num":24,"verse":"And they shall hang upon him all the glory of his father’s house, even of the nephews and posterity all small vessels, from the vessels of the cups, even to all the instruments of music."},{"num":25,"verse":"In that day saith the Lord of hosts, shall the nail that is fastened in the sure place, depart and shall be broken and fall, and the burden that was upon it, shall be cut off: for the Lord hath spoken it."}]