[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Told.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The same word as on a former occasion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then the tale was one of boastful pride in what he had, and no less boastful pride in what he hoped to be; now it is of bitter disappointment and bitter anticipation, not brightened by any of the thoughts which blunt the keenness of many a sorrow, as when men have nobly done their duty, though it is not God’s will that their efforts should succeed for the time, and when the hope could be cherished that a brighter time must dawn before long. Nothing of this comfort could be Hainan’s. He had’ not failed in an honest discharge of his duty, but in a cruel and unjust scheme (not that the king can be called a whit better in this matter); he knew the usages of his country far too well to suppose for a moment that, after having made such an attempt, and having failed, he would be allowed to try a second time.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If Mordecai . . . before whom thou hast begun . . .—Poor comfort does the unfortunate schemer get from his household; he knew too well already that he had begun to fall, his heart must have told him all too truly that it was but the beginning: what then could he expect from this communication to his family? Had he been the representative of a fallen cause, fallen but not discredited, despairing even of his cause, yet not ashamed of the course that had resulted thus, he might have been helped with counsel and cheering and sympathy. Contrast Zeresh’s perhaps last words to her husband with those, for example, of the wife of good John Rogers, or of Rowland Taylor, on their way. to the stake, in the days of the Marian persecution.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "If Mordecai . . . before whom thou hast begun",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": ". . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Poor comfort does the unfortunate schemer get from his household; he knew too well already that he had ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "begun",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to fall, his heart must have told him all too truly that it was but the beginning: what then could he expect from this communication to his family? Had he been the representative of a fallen cause, fallen but not discredited, despairing even of his cause, yet not ashamed of the course that had resulted thus, he might have been helped with counsel and cheering and sympathy. Contrast Zeresh’s perhaps last words to her husband with those, for example, of the wife of good John Rogers, or of Rowland Taylor, on their way. to the stake, in the days of the Marian persecution.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Esther 6:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 6:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then said his wise men — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The magicians, whom, after the Persian manner, he had called together, to consult upon this strange emergency. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If Mordecai be of the seed of the Jews — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which they were told, and it was generally supposed he was, but of which they were not infallibly sure; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before whom thou hast begun to fall — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Though but in a point of honour; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou shalt not prevail against him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They had observed, it is probable, how the Jews had been wonderfully raised from under great oppressions, since the time of Cyrus, and in how many remarkable instances God had appeared for them, and against their enemies, in this very court and kingdom, and thence concluded there was a particular providence that took care of them. Or perhaps they only formed their judgment from the omen, in Haman having been obliged to pay such honours himself to one of that nation which he had purposed, and even got the king’s edict, entirely to destroy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But shalt surely fall before him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This they concluded, either, 1st, By rules of policy, because Haman’s reputation and interest were sinking, and Mordecai, whom they understood to be a man of great wisdom and courage, had now got into the king’s favour, and therefore was likely to gain an opportunity of moving him to a dislike, if not revocation, of his own bloody decree, and consequently to a detestation of that person who had procured it. Or, 2d, By an instinct or impression from God upon their minds, who might suggest this to them, as he did other things to other wicked men, for his own great glory, and the good of his people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:12-14 Mordecai was not puffed up with his honours, he returned to his place and the duty of it. Honour is well bestowed on those that do not think themselves above their business. But Haman could not bear it. What harm had it done him? But that will break a proud man's heart, which will not break a humble man's sleep. His doom was, out of this event, read to him by his wife and his friends. They plainly confessed that the Jews, though scattered through the nations, were special objects of Divine care. Miserable comforters are they all; they did not advise Haman to repent, but foretold his fate as unavoidable. The wisdom of God is seen, in timing the means of his church's deliverance, so as to manifest his own glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It is quite consonant with Oriental notions that Mordecai, after receiving the extraordinary honors assigned him, should return to the palace and resume his former humble employment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. Then Haman took, &c.—This sudden reverse, however painful to Haman as an individual, is particularly characteristic of the Persian manners.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His wise men; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the magicians, whom after the Persian manner he had called together to consult with upon this great and strange emergency. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If Mordecai be of the seed of the Jews; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which they were told, and was generally supposed; but they were not infallibly sure of it. Thou shalt not prevail against him, but shalt surely fall before him: this they concluded, either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. By rules of policy, because Haman’s reputation and interest was hereby sinking, and Mordecai (whom they understood to be a man of great wisdom, and courage, and government of himself) was now got into the king’s favour, and thereby was likely to gain an opportunity of making his addresses to the king, who being of a mild disposition, might easily be moved to a dislike (if not revocation) of his own bloody decree, and consequently to a detestation of that person who had procured it. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. By former experience, and the observation of God’s extraordinary actions on the behalf of the Jews, and against their enemies, in this very court and kingdom. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. By instinct and inspiration to their minds, either from God, who might suggest this to them, as he did other things to other wicked men, Balaam, Caiaphas, &c., for his own greater glory, and the good of his people; or from the devil, who, by God’s permission, might know this, and reveal it to them, who sought to him in their superstitious and idolatrous methods. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Haman told Zeresh his wife, and all his friends, every thing that had befallen him,.... How he was prevented speaking to the king on this errand he went; instead of which, he had the mortification of being obliged to do the honour to Mordecai which he thought would never have been given to any but himself, and so related the whole affair as above: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then said his wise men; before called his friends; perhaps they were magicians and soothsayers he kept in his house, to advise with about the proper methods and times of advancing himself, and destroying his enemies: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Zeresh his wife unto him; who joined with the wise men in giving her opinion, and who set up for a knowing woman, and of whom Haman thought highly: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "if Mordecai be of the seed of the Jews; as it was said he was; and therefore Haman had vowed and plotted revenge on the people of the Jews for his sake: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "before whom thou hast begun to fall; as he did, by being obliged to execute the king's will in doing him so much honour: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou shall not prevail against him; to get him hanged, or his people destroyed, though he had prepared a gallows for the one, and had got an edict for the other: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but shall surely fall before him: which might be concluded from his being set above him, who would not fail of using his power and interest to crush him, who had showed himself to be such an implacable enemy to him; or they might have some knowledge of the history of the Jews, and of what wonderful things God often did for them, in defeating the designs of their enemies, and in raising them up from a low to an high estate. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but shall surely fall before him: which might be concluded from his being set above him, who would not fail of using his power and interest to crush him, who had showed himself to be such an implacable enemy to him; or they might have some knowledge of the history of the Jews, and of what wonderful things God often did for them, in defeating the designs of their enemies, and in raising them up from a low to an high estate. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Haman told Zeresh his wife and all his friends every thing that had befallen him. Then said his wise men and Zeresh his wife unto him, If Mordecai be of the seed of the Jews, before whom thou hast begun to fall, thou shalt not prevail against him, {d} but shalt surely fall before him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Haman told Zeresh his wife and all his friends every ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "thing",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that had befallen him. Then said his wise men and Zeresh his wife unto him, If Mordecai ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the seed of the Jews, before whom thou hast begun to fall, thou shalt not prevail against him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but shalt surely fall before him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Thus God sometimes puts in the mouth of the very wicked to speak that thing which he has decreed shall come to pass.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "recounted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Heb. word indicates a more detailed account than the ‘told’ of the A.V.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his wise men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". By these are probably meant the same as those who cast lots in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mordecai, before whom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] the relative pronoun refers to the individual foe, and not, as in the A.V., to the Jewish nation generally.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou shalt not prevail against him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] If we are to consider Haman as a descendant of Agag (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the writer is probably referring to the passages which indicate that Amalek’s fate is, when confronted with Israel, to be worsted in the conflict. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 24:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 1 Samuel 15; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "His wise men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Magians, perhaps, whom he was in the habit of consulting concerning the future. On the supposed prophetic powers of the Magians see Herod., 1:107, 120; 7:19; Duris, Fr. 7, etc. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If Mordecai be of the seed of the Jews",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is difficult to understand how this could any longer be regarded as doubtful. His fellow servants knew it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); Haman knew it (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ibid.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ver. 6); Ahasuerus knew it (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "supra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ver. 10). The \"wise men\" profess to regard it as uncertain, perhaps to give their words a more oracular character. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou shalt surely fall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Rather, \"thou shalt ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "utterly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " fall.\" Esther 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After this honour had been paid him, Mordochai returned to the king's gate; but Haman hasted to his house, \"sad and with his head covered,\" to relate to his wife and friends all that had befallen him. A deeper mortification he could not have experienced than that of being obliged, by the king's command, publicly to show the highest honour to the very individual whose execution he was just about to propose to him. The covering of the head is a token of deep confusion and mourning; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 15:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then his wise men, and Zeresh his wife, said to him: \"If Mordochai, before whom thou hast begun to fall, be of the seed of the Jews, thou wilt not prevail against him, but wholly fall before him.\" לו תוּכל לא, non praevalebis ei, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". תּפּול נפול with an emphatic infin. absol.: wholly fall. Instead of the חכמיו אהביו are here named, or to speak more correctly the friends of Haman are here called his wise men (magi). Even in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Haman's friends figure as those with whom he takes counsel concerning Mordochai, i.e., as his counsellors or advisers; hence it is very probable that there were magi among their number, who now \"come forward as a genus sapientum et doctorum (Cicero, divin. i. 23)\" (Berth.), and predict his overthrow in his contest with Mordochai. The ground of this prediction is stated: \"If Mordochai is of the seed of the Jews,\" i.e., of Jewish descent, then after this preliminary fall a total fall is inevitable. Previously (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") they had not hesitated to advise him to hang the insignificant Jew; but now that the insignificant Jew has become, as by a miracle, a man highly honoured by the king, the fact that the Jews are under the special protection of Providence is pressed upon them. Ex fato populorum, remarks Grotius, de singulorum fatis judicabant. Judaei gravissime oppressi a Cyri temporibus contra spem omnem resurgere caeperant. We cannot, however, regard as well founded the further remark: de Amalecitis audierant oraculum esse, eos Judaeorum manu perituros, which Grotius, with most older expositors, derives from the Amalekite origin of Haman. The revival of the Jewish people since the times of Cyrus was sufficient to induce, in the minds of heathen who were attentive to the signs of the times, the persuasion that this nation enjoyed divine protection. ",
        "children": []
      }
    ]
  }
]