[{"header":"Nazirites"},{"num":6,"verse":"The Lord said to Moses,"},{"num":2,"verse":"“Tell the Israelites this: If there are people, men or women, who want to make a vow dedicating themselves to the Lord as Nazirites for a time, this is what they must do:"},{"num":3,"verse":"They must stay away from wine or other strong drink. They must not drink vinegar that is made from wine or from other strong drink. They must not drink grape juice or eat grapes or raisins."},{"num":4,"verse":"During that special time of dedication, they must not eat anything that comes from grapes. They must not even eat the seeds or the skins from grapes."},{"num":5,"verse":"“The whole time of their Nazirite vow they must not cut their hair. They must be holy until this time of special dedication to the Lord is ended. They must let their hair grow long."},{"num":6,"verse":"“If you have taken the Nazirite vow, you must not go near someone who is dying during that special time of dedication. You have given yourself fully to the Lord,"},{"num":7,"verse":"so you must not let yourself become unclean like this—even for your own father or mother, brother or sister when they die. This is because you have the hair that you dedicated to God on your head!"},{"num":8,"verse":"It is holy because you have given yourself fully to the Lord for the full time of that dedication."},{"num":9,"verse":"So if you are with someone when they suddenly die, you will be unclean and you will have to shave the hair from your head. You must do that on the seventh day of your purification ceremony when you are made clean."},{"num":10,"verse":"Then on the eighth day, you must bring two doves or two young pigeons and give them to the priest at the entrance of the Meeting Tent."},{"num":11,"verse":"Then the priest will offer one bird as a sin offering and the other one as a burnt offering. The burnt offering will be a payment for the sin of touching a dead body during your special time of dedication. Then you must again promise to give the hair on your head as a gift to God."},{"num":12,"verse":"This means you must again give yourself to the Lord for another time of dedication. You must bring a one-year-old male lamb to offer as a guilt offering. You must start over from the beginning with a new time of dedication because you touched a dead body during your first time of dedication."},{"num":13,"verse":"“After their time of dedication is ended, Nazirites must go to the entrance of the Meeting Tent"},{"num":14,"verse":"and give their offering to the Lord. Their offering must be:"},{"num":16,"verse":"“The priest will give these things to the Lord, and then the priest will make the sin offering and the burnt offering."},{"num":17,"verse":"He will give the basket of bread without yeast to the Lord. Then he will kill the ram as a fellowship offering to the Lord. He will give it to the Lord with the grain offering and the drink offering."},{"num":18,"verse":"“The Nazirites must go to the entrance of the Meeting Tent. There they must shave off their hair that they grew as a dedication to the Lord. That hair will be put in the fire that is burning under the sacrifice of the fellowship offering."},{"num":19,"verse":"“After the Nazirites have cut off their hair, the priest will give them a boiled shoulder from the ram and a large and a small cake from the basket. Both of these cakes are made without yeast."},{"num":20,"verse":"Then the priest will lift these things up to show that they were presented before the Lord. These things are holy and belong to the priest. Also, the ram’s breast and thigh that were lifted up and presented belong to the priest. After that the Nazirites can drink wine."},{"num":21,"verse":"“These are the rules for those who decide to make the Nazirite vow. They must give all these gifts to the Lord. But they might be able to give much more. If they promise to do more, they must keep their promise. But they must give at least all the things listed in these rules for the Nazirite vow.”"},{"header":"The Priests’ Blessings"},{"num":22,"verse":"The Lord said to Moses,"},{"num":23,"verse":"“Tell Aaron and his sons that when they bless the Israelites, this is what they should say:"},{"num":27,"verse":"In this way Aaron and his sons will use my name to give a blessing to the Israelites, and I will bless them.”"}]