[{"num":6,"verse":"2 The law of the consecration of the Nazirites. 24 The manner to bless the people."},{"num":1,"verse":"And the Lord spake unto Moses, saying,"},{"num":2,"verse":"Speak unto the children of Israel, and say unto them, When a man or a woman doth separate themselves to vow a vow of a Nazirite, to separate himself unto the Lord,"},{"num":3,"verse":"He shall abstain from wine and strong drink, and shall drink no sour wine nor sour drink, nor shall drink any liquor of grapes, neither shall eat fresh grapes nor dried."},{"num":4,"verse":"As long as his abstinence endureth, shall he eat nothing that is made of the wine of the vine, neither the kernels nor the husk."},{"num":5,"verse":"While he is separated by his vow, the razor shall not come upon his head, until the days be out, in the which he separateth himself unto the Lord, he shall be holy, and shall let the locks of the hair of his head grow."},{"num":6,"verse":"During the time that he separateth himself unto the Lord, he shall come at no dead body:"},{"num":7,"verse":"He shall not make himself unclean at the death of his father or mother, brother, or sister: for the consecration of his God is upon his head."},{"num":8,"verse":"All the days of his separation he shall be holy to the Lord."},{"num":9,"verse":"And if any die suddenly by him, or he beware, then the head of his consecration shall be defiled, and he shall shave his head in the day of his cleansing: in the seventh day he shall shave it."},{"num":10,"verse":"And in the eighth day he shall bring two turtles, or two young pigeons to the Priest, at the door of the tabernacle of the Congregation."},{"num":11,"verse":"Then the Priest shall prepare the one for a sin offering, and the other for a burnt offering, and shall make an atonement for him, because he sinned by the dead: so shall he hallow his head the same day."},{"num":12,"verse":"And he shall consecrate unto the Lord the days of his separation, and shall bring a lamb of a year old for a trespass offering, and the first days shall be void: for his consecration was defiled."},{"num":13,"verse":"¶ This then is the law of the Nazirite: when the time of his consecration is out, he shall come to the door of the tabernacle of the Congregation,"},{"num":14,"verse":"And he shall bring his offering unto the Lord, an he lamb of a year old without blemish, for a burnt offering, and a she lamb of a year old without blemish, for a sin offering, and a ram without blemish, for peace offerings,"},{"num":15,"verse":"And a basket of unleavened bread, of Cakes of fine flour, mingled with oil, and wafers of unleavened bread anointed with oil, with their meat offering, and their drink offerings:"},{"num":16,"verse":"The which the Priest shall bring before the Lord, and make his sin offering and his burnt offering."},{"num":17,"verse":"He shall prepare also the ram for a peace offering unto the Lord, with the basket of unleavened bread, and the Priest shall make his meat offering, and his drink offering."},{"num":18,"verse":"And the Nazirite shall shave the head of his consecration at the door of the Tabernacle of the Congregation, and shall take the hair of the head of his consecration, and put it in the fire which is under the peace offering."},{"num":19,"verse":"Then the Priest shall take the sodden shoulder of the ram, and an unleavened cake out of the basket, and a wafer unleavened, and put them upon the hands of the Nazirite, after he hath shaven his consecration."},{"num":20,"verse":"And the Priest shall shake them to and fro before the Lord: this is an holy thing for the Priest besides the shaken breast, and besides the heave shoulder: so afterward the Nazirite may drink wine."},{"num":21,"verse":"This is the law of the Nazirite, which he hath vowed, and of his offering unto the Lord for his consecration, besides that that he is able to bring: according to the vow which he vowed, so shall he do after the law of his consecration."},{"num":22,"verse":"¶ And the Lord spake unto Moses, saying,"},{"num":23,"verse":"Speak unto Aaron and to his sons, saying, Thus shall ye bless the children of Israel, and say unto them,"},{"num":24,"verse":"The Lord bless thee, and keep thee,"},{"num":25,"verse":"The Lord make his face shine upon thee, and be merciful unto thee,"},{"num":26,"verse":"The Lord lift up his countenance upon thee, and give thee peace."},{"num":27,"verse":"So they shall put my Name upon the children of Israel, and I will bless them."}]