[{"header":"Do Not Cause Little Believers to Fall Into Sin"},{"num":17,"verse":"Jesus said to his disciples, “Temptations to sin are sure to come, but woe to the one through whom they come! "},{"num":2,"verse":"It would be better for that person if a millstone would be hung around his neck and he would be thrown into the sea than for him to cause one of these little ones to sin. "},{"num":3,"verse":"Watch yourselves."},{"num":4,"verse":"Even if he sins against you seven times in a day, and seven times returns to you and says, ‘I repent,’ forgive him.”"},{"header":"Increase Our Faith"},{"num":5,"verse":"The apostles said to the Lord, “Increase our faith.”"},{"num":6,"verse":"The Lord said, “If you had faith like a mustard seed, you could tell this mulberry tree, ‘Be uprooted and planted in the sea,’ and it would obey you. "},{"num":7,"verse":"Which one of you who has a servant plowing or taking care of sheep will say to him when he comes in from the field, ‘Come at once and recline at the table’? "},{"num":8,"verse":"Won’t the master tell him instead, ‘Prepare my supper, and after you are properly dressed, serve me while I eat and drink. After that you may eat and drink’? "},{"num":9,"verse":"He does not thank the servant because he did what he was commanded to do, does he? "},{"num":10,"verse":"So also you, when you have done all that you were commanded, say, ‘We are unworthy servants. We have only done what we were supposed to do.’”"},{"header":"Ten Lepers Healed—One Thanks God"},{"num":11,"verse":"On another occasion, as Jesus was on his way to Jerusalem, he was passing along the border between Samaria and Galilee. "},{"num":12,"verse":"When he entered a certain village, ten men with leprosy met him. Standing at a distance, "},{"num":13,"verse":"they called out loudly, “Jesus, Master, have mercy on us!”"},{"num":14,"verse":"When he saw them, he said, “Go, show yourselves to the priests.” As they went away they were cleansed."},{"num":15,"verse":"One of them, when he saw that he was healed, turned back, glorifying God with a loud voice. "},{"num":16,"verse":"He fell on his face at Jesus’ feet, thanking him. And he was a Samaritan. "},{"num":17,"verse":"Jesus responded, “Were not ten cleansed? Where are the other nine? "},{"num":18,"verse":"Was no one found to return and give glory to God except this foreigner?” "},{"num":19,"verse":"Then he said to him, “Get up and go your way. Your faith has saved you.”"},{"header":"The Kingdom of God Is Within You"},{"num":20,"verse":"The Pharisees asked Jesus when the kingdom of God would come. Jesus answered them, “The kingdom of God is not coming in a way you can observe, "},{"num":21,"verse":"nor will people say, ‘Look, here it is!’ or ‘Look, there it is!’ because the kingdom of God is within you.”"},{"header":"Jesus Will Return"},{"num":22,"verse":"He said to the disciples, “The days will come when you will long to see one of the days of the Son of Man, and you will not see it. "},{"num":23,"verse":"They will tell you, ‘Look, there he is!’ or ‘Look, here he is!’ Do not go out or chase after them, "},{"num":24,"verse":"for the Son of Man in his day will be like the lightning that flashes and lights up the sky from one side to the other side. "},{"num":25,"verse":"But first, he must suffer many things and be rejected by this generation. "},{"num":26,"verse":"Just as it was in the days of Noah, so will it also be in the days of the Son of Man. "},{"num":27,"verse":"They were eating and drinking, marrying and being given in marriage, until the day when Noah entered the ark. Then the flood came and destroyed them all. "},{"num":28,"verse":"Likewise, just as it was in the days of Lot: They were eating and drinking, buying and selling, planting and building, "},{"num":29,"verse":"but on the day when Lot went out from Sodom, fire and sulfur rained down from heaven and destroyed them all. "},{"num":30,"verse":"It will be the same on the day the Son of Man is revealed. "},{"num":31,"verse":"On that day, the person who is on the roof and has belongings in the house should not go down to get them. Likewise, the person in the field should not turn back for anything. "},{"num":32,"verse":"Remember Lot’s wife! "},{"num":33,"verse":"Whoever tries to preserve his life will lose it, but whoever loses his life will keep it. "},{"num":34,"verse":"I tell you, on that night there will be two people in one bed. One will be taken, and the other will be left. "},{"num":35,"verse":"There will be two women grinding grain at the same place. One will be taken, and the other will be left.”"},{"num":37,"verse":"“Where, Lord?” they asked him."}]