[{"header":"Sin(A)"},{"num":17,"verse":"Jesus said to his disciples, “Things that make people fall into sin are bound to happen, but how terrible for the one who makes them happen! "},{"num":2,"verse":"It would be better for him if a large millstone were tied around his neck and he were thrown into the sea than for him to cause one of these little ones to sin. "},{"num":3,"verse":"So watch what you do!"},{"num":4,"verse":"If he sins against you seven times in one day, and each time he comes to you saying, ‘I repent,’ you must forgive him.”"},{"header":"Faith"},{"num":5,"verse":"The apostles said to the Lord, “Make our faith greater.”"},{"num":6,"verse":"The Lord answered, “If you had faith as big as a mustard seed, you could say to this mulberry tree, ‘Pull yourself up by the roots and plant yourself in the sea!’ and it would obey you."},{"header":"A Servant's Duty"},{"num":7,"verse":"“Suppose one of you has a servant who is plowing or looking after the sheep. When he comes in from the field, do you tell him to hurry along and eat his meal? "},{"num":8,"verse":"Of course not! Instead, you say to him, ‘Get my supper ready, then put on your apron and wait on me while I eat and drink; after that you may have your meal.’ "},{"num":9,"verse":"The servant does not deserve thanks for obeying orders, does he? "},{"num":10,"verse":"It is the same with you; when you have done all you have been told to do, say, ‘We are ordinary servants; we have only done our duty.’”"},{"header":"Jesus Heals Ten Men"},{"num":11,"verse":"As Jesus made his way to Jerusalem, he went along the border between Samaria and Galilee. "},{"num":12,"verse":"He was going into a village when he was met by ten men suffering from a dreaded skin disease. They stood at a distance "},{"num":13,"verse":"and shouted, “Jesus! Master! Have pity on us!”"},{"num":14,"verse":"Jesus saw them and said to them, “Go and let the priests examine you.”"},{"num":15,"verse":"When one of them saw that he was healed, he came back, praising God in a loud voice. "},{"num":16,"verse":"He threw himself to the ground at Jesus' feet and thanked him. The man was a Samaritan. "},{"num":17,"verse":"Jesus spoke up, “There were ten who were healed; where are the other nine? "},{"num":18,"verse":"Why is this foreigner the only one who came back to give thanks to God?” "},{"num":19,"verse":"And Jesus said to him, “Get up and go; your faith has made you well.”"},{"header":"The Coming of the Kingdom(D)"},{"num":20,"verse":"Some Pharisees asked Jesus when the Kingdom of God would come. His answer was, “The Kingdom of God does not come in such a way as to be seen. "},{"num":21,"verse":"No one will say, ‘Look, here it is!’ or, ‘There it is!’; because the Kingdom of God is within you.”"},{"num":22,"verse":"Then he said to the disciples, “The time will come when you will wish you could see one of the days of the Son of Man, but you will not see it. "},{"num":23,"verse":"There will be those who will say to you, ‘Look, over there!’ or, ‘Look, over here!’ But don't go out looking for it. "},{"num":24,"verse":"As the lightning flashes across the sky and lights it up from one side to the other, so will the Son of Man be in his day. "},{"num":25,"verse":"But first he must suffer much and be rejected by the people of this day. "},{"num":26,"verse":"As it was in the time of Noah so shall it be in the days of the Son of Man. "},{"num":27,"verse":"Everybody kept on eating and drinking, and men and women married, up to the very day Noah went into the boat and the flood came and killed them all. "},{"num":28,"verse":"It will be as it was in the time of Lot. Everybody kept on eating and drinking, buying and selling, planting and building. "},{"num":29,"verse":"On the day Lot left Sodom, fire and sulfur rained down from heaven and killed them all. "},{"num":30,"verse":"That is how it will be on the day the Son of Man is revealed."},{"num":31,"verse":"“On that day someone who is on the roof of a house must not go down into the house to get any belongings; in the same way anyone who is out in the field must not go back to the house. "},{"num":32,"verse":"Remember Lot's wife! "},{"num":33,"verse":"Those who try to save their own life will lose it; those who lose their life will save it. "},{"num":34,"verse":"On that night, I tell you, there will be two people sleeping in the same bed: one will be taken away, the other will be left behind. "},{"num":35,"verse":"Two women will be grinding meal together: one will be taken away, the other will be left behind.”"},{"num":36,"verse":""},{"num":37,"verse":"The disciples asked him, “Where, Lord?”"}]