[{"header":"Sin, Faith and Duty"},{"num":17,"verse":"Jesus spoke to his disciples. “Things that make people sin are sure to come,” he said. “But how terrible it will be for anyone who causes those things to come! "},{"num":2,"verse":"Suppose people lead one of these little ones to sin. It would be better for those people to be thrown into the sea with a millstone tied around their neck. "},{"num":3,"verse":"So watch what you do."},{"num":4,"verse":"Suppose they sin against you seven times in one day. And suppose they come back to you each time and say, ‘I’m sorry.’ You must forgive them.”"},{"num":5,"verse":"The apostles said to the Lord, “Give us more faith!”"},{"num":6,"verse":"He replied, “Suppose you have faith as small as a mustard seed. Then you can say to this mulberry tree, ‘Be pulled up. Be planted in the sea.’ And it will obey you."},{"num":7,"verse":"“Suppose one of you has a servant plowing or looking after the sheep. And suppose the servant came in from the field. Will you say to him, ‘Come along now and sit down to eat’? "},{"num":8,"verse":"No. Instead, you will say, ‘Prepare my supper. Get yourself ready. Wait on me while I eat and drink. Then after that you can eat and drink.’ "},{"num":9,"verse":"Will you thank the servant because he did what he was told to do? "},{"num":10,"verse":"It’s the same with you. Suppose you have done everything you were told to do. Then you should say, ‘We are not worthy to serve you. We have only done our duty.’ ”"},{"header":"Jesus Heals Ten Men Who Have a Skin Disease"},{"num":11,"verse":"Jesus was on his way to Jerusalem. He traveled along the border between Samaria and Galilee. "},{"num":12,"verse":"As he was going into a village, ten men met him. They had a skin disease. They were standing close by. "},{"num":13,"verse":"And they called out in a loud voice, “Jesus! Master! Have pity on us!”"},{"num":14,"verse":"Jesus saw them and said, “Go. Show yourselves to the priests.” While they were on the way, they were healed."},{"num":15,"verse":"When one of them saw that he was healed, he came back. He praised God in a loud voice. "},{"num":16,"verse":"He threw himself at Jesus’ feet and thanked him. The man was a Samaritan."},{"num":17,"verse":"Jesus asked, “Weren’t all ten healed? Where are the other nine? "},{"num":18,"verse":"Didn’t anyone else return and give praise to God except this outsider?” "},{"num":19,"verse":"Then Jesus said to him, “Get up and go. Your faith has healed you.”"},{"header":"The Coming of God’s Kingdom"},{"num":20,"verse":"Once the Pharisees asked Jesus when God’s kingdom would come. He replied, “The coming of God’s kingdom is not something you can see. "},{"num":21,"verse":"People will not say, ‘Here it is.’ Or, ‘There it is.’ That’s because God’s kingdom is among you.”"},{"num":22,"verse":"Then Jesus spoke to his disciples. “The time is coming,” he said, “when you will long to see one of the days of the Son of Man. But you won’t see it. "},{"num":23,"verse":"People will tell you, ‘There he is!’ Or, ‘Here he is!’ Don’t go running off after them. "},{"num":24,"verse":"When the Son of Man comes, he will be like the lightning. It flashes and lights up the sky from one end to the other. "},{"num":25,"verse":"But first the Son of Man must suffer many things. He will not be accepted by the people of today."},{"num":26,"verse":"“Remember how it was in the days of Noah. It will be the same when the Son of Man comes. "},{"num":27,"verse":"People were eating and drinking. They were getting married. They were giving their daughters to be married. They did all those things right up to the day Noah entered the ark. Then the flood came and destroyed them all."},{"num":28,"verse":"“It was the same in the days of Lot. People were eating and drinking. They were buying and selling. They were planting and building. "},{"num":29,"verse":"But on the day Lot left Sodom, fire and sulfur rained down from heaven. And all the people were destroyed."},{"num":30,"verse":"“It will be just like that on the day the Son of Man is shown to the world. "},{"num":31,"verse":"Suppose someone is on the housetop on that day. And suppose what they own is inside the house. They should not go down to get what they own. No one in the field should go back for anything either. "},{"num":32,"verse":"Remember Lot’s wife! "},{"num":33,"verse":"Whoever tries to keep their life will lose it. Whoever loses their life will keep it. "},{"num":34,"verse":"I tell you, on that night two people will be in one bed. One person will be taken and the other left. "},{"num":35,"verse":"Two women will be grinding grain together. One will be taken and the other left.”"},{"num":37,"verse":"“Where, Lord?” his disciples asked."}]