[{"header":"Causing Others to Lose Faith(A)"},{"num":17,"verse":"Yeshua told his disciples, “Situations that cause people to lose their faith are certain to arise. But how horrible it will be for the person who causes someone to lose his faith! "},{"num":2,"verse":"It would be best for that person to be thrown into the sea with a large stone hung around his neck than for him to cause one of these little ones to lose his faith. "},{"num":3,"verse":"So watch yourselves!"},{"num":4,"verse":"Even if he wrongs you seven times in one day and comes back to you seven times and says that he is sorry, forgive him.”"},{"header":"The Apostles Ask for More Faith"},{"num":5,"verse":"Then the apostles said to the Lord, “Give us more faith.”"},{"num":6,"verse":"The Lord said, “If you have faith the size of a mustard seed, you could say to this mulberry tree, ‘Pull yourself up by the roots, and plant yourself in the sea!’ and it would obey you."},{"num":7,"verse":"“Suppose someone has a servant who is plowing fields or watching sheep. Does he tell his servant when he comes from the field, ‘Have something to eat’? "},{"num":8,"verse":"No. Instead, he tells his servant, ‘Get dinner ready for me! After you serve me my dinner, you can eat yours.’ "},{"num":9,"verse":"He doesn’t thank the servant for following orders. "},{"num":10,"verse":"That’s the way it is with you. When you’ve done everything you’re ordered to do, say, ‘We’re worthless servants. We’ve only done our duty.’”"},{"header":"Ten Men with a Skin Disease Are Healed"},{"num":11,"verse":"Yeshua traveled along the border between Samaria and Galilee on his way to Jerusalem. "},{"num":12,"verse":"As he went into a village, ten men with a skin disease met him. They stood at a distance "},{"num":13,"verse":"and shouted, “Yeshua, Teacher, have mercy on us!”"},{"num":14,"verse":"When he saw them, he told them, “Show yourselves to the priests.” As they went, they were made clean. "},{"num":15,"verse":"When one of them saw that he was healed, he turned back and praised God in a loud voice. "},{"num":16,"verse":"He quickly bowed at Yeshua’s feet and thanked him. (The man was a Samaritan.)"},{"num":17,"verse":"Yeshua asked, “Weren’t ten men made clean? Where are the other nine? "},{"num":18,"verse":"Only this foreigner came back to praise God.”"},{"num":19,"verse":"Yeshua told the man, “Get up, and go home! Your faith has made you well.”"},{"header":"The Pharisees Ask about the Kingdom of God"},{"num":20,"verse":"The Pharisees asked Yeshua when the kingdom of God would come."},{"num":21,"verse":"They can’t say, ‘Here it is!’ or ‘There it is!’ You see, the kingdom of God is within you.”"},{"header":"Jesus Teaches about the Time When He Will Come Again"},{"num":22,"verse":"Yeshua said to his disciples, “The time will come when you will long to see one of the days of the Son of Man, but you will not see it. "},{"num":23,"verse":"People will say, ‘There he is!’ or ‘Here he is!’ Don’t run after those people. "},{"num":24,"verse":"The day of the Son of Man will be like lightning that flashes from one end of the sky to the other. "},{"num":25,"verse":"But first he must suffer a lot and be rejected by the people of his day."},{"num":26,"verse":"“When the Son of Man comes again, the situation will be like the time of Noah. "},{"num":27,"verse":"People were eating, drinking, and getting married until the day that Noah went into the ship. Then the flood destroyed all of them."},{"num":28,"verse":"“The situation will also be like the time of Lot. People were eating, drinking, buying and selling, planting and building. "},{"num":29,"verse":"But on the day that Lot left Sodom, fire and sulfur rained from the sky and destroyed all of them. "},{"num":30,"verse":"The day when the Son of Man is revealed will be like that."},{"num":31,"verse":"“On that day those who are on the roof shouldn’t come down to get their belongings out of their houses. Those who are in the field shouldn’t turn back. "},{"num":32,"verse":"Remember Lot’s wife! "},{"num":33,"verse":"Those who try to save their lives will lose them, and those who lose their lives will save them."},{"num":34,"verse":"“I can guarantee that on that night if two people are in one bed, one will be taken and the other one will be left. "},{"num":35,"verse":"Two women will be grinding grain together. One will be taken, and the other one will be left.”"},{"num":37,"verse":"They asked him, “Where, Lord?”"}]