[{"num":26,"verse":"A song of the faithful, wherein is declared, in what consisteth the salvation of the Church, and wherein they ought to trust."},{"num":1,"verse":"In that day shall this song be sung in the land of Judah, We have a strong city: salvation shall God set for walls and bulwarks."},{"num":2,"verse":"Open ye the gates that the righteous nation, which keepeth the truth, may enter in."},{"num":3,"verse":"By an assured purpose wilt thou preserve perfect peace, because they trusted in thee."},{"num":4,"verse":"Trust in the Lord forever: for in the Lord God is strength forevermore."},{"num":5,"verse":"For he will bring down them that dwell on high: the high city he will abase: even unto the ground will he cast it down, and bring it unto dust."},{"num":6,"verse":"The foot shall tread it down, even the feet of the poor, and the steps of the needy."},{"num":7,"verse":"The way of the just is righteousness: thou wilt make equal the righteous path of the just."},{"num":8,"verse":"Also we, O Lord, have waited for thee in the way of thy judgments: the desire of our soul is to thy Name, and to the remembrance of thee."},{"num":9,"verse":"With my soul have I desired thee in the night, and with my spirit within me will I seek thee in the morning: for seeing thy judgments are in the earth, the inhabitants of the world shall learn righteousness."},{"num":10,"verse":"Let mercy be showed to the wicked, yet he will not learn righteousness: in the land of uprightness will he do wickedly, and will not behold the majesty of the Lord."},{"num":11,"verse":"O Lord, they will not behold thine high hand: but they shall see it, and be confounded with the zeal of the people, and the fire of thine enemies shall devour them."},{"num":12,"verse":"Lord unto us thou wilt ordain peace: for thou also hast wrought all our works for us."},{"num":13,"verse":"O Lord our God, other lords beside thee, have ruled us, but we will remember thee only, and thy Name."},{"num":14,"verse":"The dead shall not live, neither shall the dead arise, because thou hast visited and scattered them, and destroyed all their memory."},{"num":15,"verse":"Thou hast increased the nation, O Lord: thou hast increased the nation: thou art made glorious, thou hast enlarged all the coasts of the earth."},{"num":16,"verse":"Lord, in trouble have they visited thee: they poured out a prayer when thy chastening was upon them."},{"num":17,"verse":"Like as a woman with child, that draweth near to the travail, is in sorrow, and crieth in her pains, so have we been in thy sight, O Lord."},{"num":18,"verse":"We have conceived, we have born in pain, as though we should have brought forth wind: there was no help in the earth, neither did the inhabitants of the world fall."},{"num":19,"verse":"¶ Thy dead men shall live: even with my body shall they rise. Awake and sing, ye that dwell in dust: for thy dew is as the dew of herbs, and the earth shall cast out the dead."},{"num":20,"verse":"Come, my people: enter thou into thy chambers, and shut thy doors after thee: hide thyself for a very little while, until the indignation pass over."},{"num":21,"verse":"For lo, the Lord cometh out of his place, to visit the iniquity of the inhabitants of the earth upon them: and the earth shall disclose her blood, and shall no more hide her slain."}]