[{"num":9,"verse":"When Solomon finished the building of the Lord’s house and the king’s house, and all he desired and was pleased to do,"},{"num":2,"verse":"The Lord appeared to Solomon the second time, as He had appeared to him at Gibeon."},{"num":3,"verse":"The Lord told him, I have heard your prayer and supplication which you have made before Me; I have hallowed this house which you have built, and I have put My Name [and My Presence] there forever. My eyes and My heart shall be there perpetually."},{"num":4,"verse":"And if you will walk before Me, as David your father walked, in integrity of heart and uprightness, doing according to all that I have commanded you, keeping My statutes and My precepts,"},{"num":5,"verse":"Then I will establish your royal throne over Israel forever, as I promised David your father, saying, There shall not fail you [to have] a man upon the throne of Israel."},{"num":6,"verse":"But if you turn away from following Me, you or your children, and will not keep My commandments and My statutes which I have set before you but go and serve other gods and worship them,"},{"num":7,"verse":"Then I will cut off Israel from the land I have given them, and this house I have hallowed for My Name (renown) I will cast from My sight. And Israel shall be a proverb and a byword among all the peoples."},{"num":8,"verse":"This house shall become a heap of ruins; every passerby shall be astonished and shall hiss [with surprise] and say, Why has the Lord done thus to this land and to this house?"},{"num":9,"verse":"Then they will answer, Because they forsook the Lord their God, Who brought their fathers out of the land of Egypt, and have laid hold of other gods and have worshiped and served them; therefore the Lord has brought on them all this evil."},{"num":10,"verse":"At the end of twenty years, in which Solomon had built the two houses, the Lord’s house and the king’s house,"},{"num":11,"verse":"For which Hiram king of Tyre had furnished Solomon with as much cedar and cypress timber and gold as he desired, King Solomon gave Hiram twenty cities in the land of Galilee."},{"num":12,"verse":"And Hiram came from Tyre to see the cities which Solomon had given him, and they did not please him."},{"num":13,"verse":"He said, What are these cities worth which you have given me, my brother? So they are called the Cabul [unproductive] Land to this day."},{"num":14,"verse":"And Hiram sent to the king 120 talents of gold."},{"num":15,"verse":"This is the account of the levy [of forced labor] which King Solomon raised to build the house of the Lord, his own house, the Millo, the wall of Jerusalem, Hazor, Megiddo, and Gezer."},{"num":16,"verse":"For Pharaoh king of Egypt had gone up and taken Gezer, burned it with fire, slew the Canaanites who dwelt in the city, and had given it as dowry to his daughter, Solomon’s wife."},{"num":17,"verse":"So Solomon rebuilt Gezer and Lower Beth-horon,"},{"num":18,"verse":"Baalath and Tamar (Tadmor) in the wilderness, in the land of Judah,"},{"num":19,"verse":"And all the store cities which Solomon had and cities for his chariots and cities for his horsemen, and whatever Solomon desired to build for his pleasure in Jerusalem, in Lebanon, and in all the land of his dominion."},{"num":20,"verse":"As for all the people who were left of the Amorites, Hittites, Perizzites, Hivites, and Jebusites, who were not Israelites,"},{"num":21,"verse":"Their children who were left after them in the land, whom the Israelites were not able utterly to destroy, of them Solomon made a forced levy of slaves to this day."},{"num":22,"verse":"But Solomon made no slaves of the Israelites; they were the soldiers, his officials, attendants, commanders, captains, chariot officers, and horsemen."},{"num":23,"verse":"These were the chief officers over Solomon’s work, 550 who had charge of the people who did the work."},{"num":24,"verse":"But Pharaoh’s daughter came up out of the City of David to her house which Solomon had built for her; then he built the Millo."},{"num":25,"verse":"Three times a year Solomon offered burnt offerings and peace offerings on the altar he built to the Lord, and he burned incense with them before the Lord. So he finished the house."},{"num":26,"verse":"And King Solomon made a fleet of ships in Ezion-geber, which is beside Eloth, on the shore of the Red Sea, in Edom."},{"num":27,"verse":"And Hiram sent with the fleet his servants, shipmen who had knowledge of the sea, with the servants of Solomon."},{"num":28,"verse":"They came to Ophir and got 420 talents of gold and brought it to King Solomon."}]