[{"num":9,"verse":"After Shlomo had finished building the house of Adonai, the royal palace and everything else he wanted to build for himself, "},{"num":2,"verse":"Adonai appeared to Shlomo a second time, as he had appeared to him in Giv‘on. "},{"num":3,"verse":"Adonai said to him, “I have heard your prayer and your plea that you made before me: I am consecrating this house which you built and placing my name there forever; my eyes and heart will always be there. "},{"num":4,"verse":"As for you, if you will live in my presence, as did David your father, in pureness of heart and uprightness, doing everything I have ordered you to do, and observing my laws and rulings; "},{"num":5,"verse":"then I will establish the throne of your rulership over Isra’el forever, just as I promised David your father when I said, ‘You will never lack a man on the throne of Isra’el.’ "},{"num":6,"verse":"But if you turn away from following me, you or your children, and do not observe my mitzvot and regulations which I have set before you, and go and serve other gods, worshipping them; "},{"num":7,"verse":"then I will cut off Isra’el from the land I have given them. This house, which I consecrated for my name, I will eject from my sight; and Isra’el will become an example to avoid and an object of scorn among all peoples. "},{"num":8,"verse":"This house, now so exalted — everyone passing by will gasp in shock at the sight of it and will ask, ‘Why has Adonai done this to this land and to this house?’ "},{"num":9,"verse":"But the answer will be, ‘It’s because they abandoned Adonai their God, who brought their ancestors out of the land of Egypt, and took hold of other gods, worshipping and serving them; this is why Adonai brought all these calamities on them.’”"},{"num":10,"verse":"At the end of twenty years, during which time Shlomo had built the two buildings, the house of Adonai and the royal palace, "},{"num":11,"verse":"King Shlomo gave Hiram twenty cities in the land of the Galil (recall that Hiram the king of Tzor had supplied Shlomo with cedar and cypress logs and with all the gold Shlomo wanted). "},{"num":12,"verse":"Hiram came over from Tzor to see the cities Shlomo had given him, but he was not satisfied with them. "},{"num":13,"verse":"He said, “What kind of cities are these which you have given me, my brother?” So they have been called the land of Kabul [good for nothing] till this day. "},{"num":14,"verse":"(Hiram had sent the king four tons of gold.)"},{"num":15,"verse":"Following is the account of the forced labor levied by King Shlomo for building the house of Adonai, his own palace, the Millo, the wall of Yerushalayim, and the cities of Hatzor, Megiddo and Gezer. "},{"num":16,"verse":"Pharaoh king of Egypt had gone up, taken Gezer, burned it to the ground and killed the Kena‘ani living in the city; then he had given it as a dowry for his daughter, Shlomo’s wife. "},{"num":17,"verse":"So Shlomo rebuilt Gezer; he also built Lower Beit-Horon, "},{"num":18,"verse":"Ba‘alat, Tadmor in the desert, in the land, "},{"num":19,"verse":"as well as all the cities that Shlomo had for storing supplies, the cities for his chariots, the cities for his horsemen, and the other buildings Shlomo wanted to build for himself in Yerushalayim, in the L’vanon and throughout the land he ruled. "},{"num":20,"verse":"All the people still left from the Emori, Hitti, P’rizi, Hivi, and Y’vusi, who were not part of the people of Isra’el, "},{"num":21,"verse":"that is, their descendants remaining after them in the land, whom the people of Isra’el were not able to destroy completely — from them Shlomo levied his forced laborers; as it is to this day. "},{"num":22,"verse":"But Shlomo did not raise any of his forced labor from the people of Isra’el; rather, they were the soldiers, his servants, administrators and commanders, and the officials in charge of his chariots and horsemen. "},{"num":23,"verse":"There were 550 chief officers over Shlomo’s work, in charge of the workers."},{"num":24,"verse":"Pharaoh’s daughter came up from the City of David to her house, which Shlomo had built for her. After that he built the Millo."},{"num":25,"verse":"Three times a year Shlomo offered burnt offerings and peace offerings on the altar which he had built for Adonai, offering incense with them on the altar before Adonai. So he finished the house."},{"num":26,"verse":"King Shlomo built a fleet of ships in ‘Etzyon-Gever, by Elot on the shore of the Sea of Suf in the land of Edom. "},{"num":27,"verse":"Hiram sent some of his own servants, experienced sailors who understood the sea, to serve with Shlomo’s servants. "},{"num":28,"verse":"They went to Ofir and took from there gold, fourteen tons of it, which they brought back to King Shlomo."}]