[{"header":"Yahweh’s Challenge to Solomon"},{"num":9,"verse":"It happened that as Solomon finished the building of the house of Yahweh, the king’s house, and all the things Solomon desired to do, "},{"num":2,"verse":"Yahweh appeared to Solomon a second time, as he had appeared to him in Gibeon. "},{"num":3,"verse":"Yahweh said to him, “I have heard your prayer and your plea which you have made before me. I have consecrated this house which you have built, by putting my name there forever. My eyes and my heart will always be there. "},{"num":4,"verse":"As for you, if you walk before me as David your father walked, with integrity of heart and with uprightness, to do according to all that I have commanded you, and if you keep my ordinances and my judgments, "},{"num":5,"verse":"then I will establish the throne of your kingdom over Israel forever, as I promised David your father, saying, ‘A man will not be cut off for you from upon the throne of Israel.’"},{"num":6,"verse":"“If ever you or any of your descendants turn from following me and do not keep my commandments and my ordinances that I have set before you and you go and serve other gods and bow down to them, "},{"num":7,"verse":"then I will cut Israel off from the face of the land that I have given to them, even the house which I have consecrated for my name I will cast away from my face; and Israel shall become a proverb and an object of taunting among all the peoples. "},{"num":8,"verse":"This house shall become a heap of ruins; all those passing by will be appalled by it and hiss, and they will say, ‘On what account did Yahweh do this to this land and to this house?’ "},{"num":9,"verse":"And they will say, ‘Because they have forsaken Yahweh their God who brought their ancestors out from the land of Egypt and they embraced other gods and bowed down to them and served them. Therefore, Yahweh brought on them all of this disaster.’”"},{"header":"Solomon and Hiram Complete Their Agreement"},{"num":10,"verse":"It happened at the end of twenty years in which Solomon had built the two houses, the house of Yahweh and the house of the king, "},{"num":11,"verse":"since Hiram king of Tyre had supplied Solomon with wood of cedar and with wood of cypresses and with the gold according to all his desire, then King Solomon gave twenty cities in the land of the Galilee to Hiram. "},{"num":12,"verse":"So Hiram went out from Tyre to see the cities that Solomon had given him, but they were not right in his eyes. "},{"num":13,"verse":"So he said, “What are these cities that you have given to me, my brother?” So they are called the land of Cabul until this day. "},{"num":14,"verse":"Then Hiram sent to the king a hundred and twenty talents of gold."},{"header":"Solomon’s Accomplishments"},{"num":15,"verse":"This is the account of the forced labor that King Solomon conscripted to build the house of Yahweh and his house, the Millo, the walls of Jerusalem, Hazor, Megiddo, and Gezer. "},{"num":16,"verse":"Pharaoh, the king of Egypt, had gone up and captured Gezer and burnt it with fire. He had also killed the Canaanites who were living in the city and had given it as a dowry to his daughter, the wife of Solomon. "},{"num":17,"verse":"Solomon rebuilt Gezer and Lower Beth-Horon, "},{"num":18,"verse":"as well as Baalath and Tamar in the wilderness in the land; "},{"num":19,"verse":"and he also built all of the storage cities which were Solomon’s, the cities for the chariots, the cities for the cavalry, and all of Solomon’s desire that he wanted to build in Jerusalem and in Lebanon and in all the land of his dominion."},{"num":20,"verse":"All of the people who were remaining from the Amorites, the Hittites, the Perizzites, the Hivites, and the Jebusites who were not of the Israelites, "},{"num":21,"verse":"their children who remained after them in the land, whom the Israelites were not able to completely destroy, Solomon conscripted them for forced labor, until this very day. "},{"num":22,"verse":"But from the Israelites Solomon did not make a slave, but they were the men of war, his officers, his commanders, his captains, and the commanders of his chariots and his cavalry. "},{"num":23,"verse":"These were the commanders of the overseers who were over the work for Solomon, five hundred and fifty, ruling over the people doing the work."},{"num":24,"verse":"As soon as the daughter of Pharaoh went up from the city of David to her house which he built for her, then he built the Millo."},{"num":25,"verse":"Solomon sacrificed three times a year: burnt offerings and fellowship offerings on the altar that he had built to Yahweh, and he offered incense with it before Yahweh; and so he completed the house."},{"num":26,"verse":"King Solomon also built a fleet of ships at Ezion-Geber which is near Elath on the shore of the Red Sea in the land of Edom. "},{"num":27,"verse":"Hiram sent his servants with the fleet of ships, sailors who knew the sea, with the servants of Solomon. "},{"num":28,"verse":"They went to Ophir and imported from there four hundred and twenty talents of gold, and they brought it to King Solomon."}]