[{"num":3,"verse":"My son, forget not my law, and let thy heart keep my commandments."},{"num":2,"verse":"For they shall add to thee length of days, and years of life and peace."},{"num":3,"verse":"Let not mercy and truth leave thee, put them about thy neck, and write them in the tables of thy heart:"},{"num":4,"verse":"And thou shalt find grace and good understanding before God and men."},{"num":5,"verse":"Have confidence in the Lord with all thy heart, and lean not upon thy own prudence."},{"num":6,"verse":"In all thy ways think on him, and he will direct thy steps."},{"num":7,"verse":"Be not wise in thy own conceit: fear God, and depart from evil:"},{"num":8,"verse":"For it shall be health to thy navel, and moistening to thy bones."},{"num":9,"verse":"Honour the Lord with thy substance, and give him of the first of all thy fruits:"},{"num":10,"verse":"And thy barns shall be filled with abundance, and thy presses shall run over with wine."},{"num":11,"verse":"My son, reject not the correction of the Lord: and do not faint when thou art chastised by him:"},{"num":12,"verse":"For whom the Lord loveth, he chastiseth: and as a father in the son he pleaseth himself."},{"num":13,"verse":"Blessed is the man that findeth wisdom and is rich in prudence:"},{"num":14,"verse":"The purchasing thereof is better than the merchandise of silver, and her fruit than the chiefest and purest gold:"},{"num":15,"verse":"She is more precious than all riches: and all the things that are desired, are not to be compared with her."},{"num":16,"verse":"Length of days is in her right hand, and in her left hand riches and glory."},{"num":17,"verse":"Her ways are beautiful ways, and all her paths are peaceable."},{"num":18,"verse":"She is a tree of life to them that lay hold on her: and he that shall retain her is blessed."},{"num":19,"verse":"The Lord by wisdom hath founded the earth, hath established the heavens by prudence."},{"num":20,"verse":"By his wisdom the depths have broken out, and the clouds grow thick with dew."},{"num":21,"verse":"My son, let not these things depart from thy eyes: keep the law and counsel:"},{"num":22,"verse":"And there shall be life to thy soul, and grace to thy mouth."},{"num":23,"verse":"Then shalt thou walk confidently in thy way, and thy foot shall not stumble:"},{"num":24,"verse":"If thou sleep, thou shalt not fear: thou shalt rest, and thy sleep shall be sweet."},{"num":25,"verse":"Be not afraid of sudden fear, nor of the power of the wicked falling upon thee."},{"num":26,"verse":"For the Lord will be at thy side, and will keep thy foot that thou be not taken."},{"num":27,"verse":"Do not withhold him from doing good, who is able: if thou art able, do good thyself also."},{"num":28,"verse":"Say not to thy friend: Go, and come again: and to morrow I will give to thee: when thou canst give at present."},{"num":29,"verse":"Practise not evil against thy friend, when he hath confidence in thee."},{"num":30,"verse":"Strive not against a man without cause, when he hath done thee no evil."},{"num":31,"verse":"Envy not the unjust man, and do not follow his ways:"},{"num":32,"verse":"For every mocker is an abomination to the Lord, and his communication is with the simple."},{"num":33,"verse":"Want is from the Lord in the house of the wicked: but the habitations of the just shall be blessed."},{"num":34,"verse":"He shall scorn the scorners, and to the meek he will give grace."},{"num":35,"verse":"The wise shall possess glory: the promotion of fools is disgrace."}]