[{"num":3,"verse":"My son, forget thou not my law; and thine heart keep my commandments."},{"num":2,"verse":"For they shall set to thee the length of days, and the years of life, and peace."},{"num":3,"verse":"Mercy and truth forsake thee not; bind thou those to thy throat, and write them in the tables of thine heart. (Let not mercy and truth desert thee; bind thou them about thy neck, and write them on the tablets of thy heart.)"},{"num":4,"verse":"And thou shalt find grace (And thou shalt receive favour), and good teaching before God and men."},{"num":5,"verse":"Have thou trust in the Lord, of all thine heart; and lean thou not to thy prudence. (Have thou trust in the Lord, with all thy heart, and lean thou not unto thy own understanding.)"},{"num":6,"verse":"In all thy ways think on him, and he shall (ad)dress thy goings. (In all thy ways, or in all thy deeds, think of him, and he shall direct thy steps.)"},{"num":7,"verse":"Be thou not wise with thyself; dread thou God, and go away from evil. (Do not think thyself wise; but fear God/but revere God, and go thou away from evil.)"},{"num":8,"verse":"For why health shall be in thy navel, and moisting of thy bones. (For that shall be health for thy body, or thy entrails, and moistening for thy bones.)"},{"num":9,"verse":"Honour thou the Lord of thy chattel, and of the best of all thy fruits give thou to poor men; (Honour thou the Lord with thy possessions, and with the best of all thy fruits, or of all thy earnings;)"},{"num":10,"verse":"and (then) thy barns shall be filled with abundance, and thy pressers shall flow with wine (and thy winepresses shall flow with wine)."},{"num":11,"verse":"My son, cast thou not away the teaching of the Lord; and fail thou not, when thou art chastised of him (and faint thou not/and spurn thou him not, when thou art disciplined by him)."},{"num":12,"verse":"For the Lord chastiseth him, whom he loveth; and as a father in the son he pleaseth him (yea, like a father to his son who pleaseth him)."},{"num":13,"verse":"Blessed is the man that findeth wisdom, and that floweth with prudence. (Blessed is the person who findeth wisdom, and who floweth with understanding.)"},{"num":14,"verse":"The getting thereof is better than the merchandise of gold and of silver; the fruits thereof be the first and the cleanest."},{"num":15,"verse":"It is more precious than all riches; and all things that be desired, may not be comparisoned to this (and nothing that is desired, can be compared to it)."},{"num":16,"verse":"Length of days is in the right half thereof, and riches and glory be in the left half thereof. (Length of days is in its right hand, and riches and glory be in its left hand.)"},{"num":17,"verse":"The ways thereof be fair ways, and all the paths thereof be peaceable. (Its way be fair ways, and all its paths be peaceful.)"},{"num":18,"verse":"It is a tree of life to them that take (hold of) it; and he that holdeth (onto) it, is blessed."},{"num":19,"verse":"The Lord founded the earth by (his) wisdom; he stablished (the) heavens by (his) prudence."},{"num":20,"verse":"The depths of waters brake out by his wisdom; and (the) clouds waxed (al)together with dew."},{"num":21,"verse":"My son, these things float not away from thine eyes; keep thou my law, and my counsel; (My son, let not these things float away from thine eyes; keep thou my instructions, and my advice, near to thee;)"},{"num":22,"verse":"and life shall be to thy soul, and grace to thy cheeks. (and thou shalt have life, and gain favour.)"},{"num":23,"verse":"Then thou shalt go trustily in thy way (Then thou shalt go with trust on thy way); and thy foot shall not stumble."},{"num":24,"verse":"If thou shalt sleep, thou shalt not dread; thou shalt rest, and thy sleep shall be soft [and sweet shall be thy sleep]. (When thou shalt sleep, thou shalt not fear; thou shalt rest, and thy sleep shall be sweet.)"},{"num":25,"verse":"Dread thou not of sudden fear, and the powers of wicked men falling in on thee. (Fear thou not sudden disaster, and the power, or the might, of the wicked falling in upon thee.)"},{"num":26,"verse":"For the Lord shall be at thy side; and he shall keep thy foot (safe), that thou be not taken."},{"num":27,"verse":"Do not thou forbid to do well him that may; if thou mayest, also do thou well. (Do not thou forbid anyone to do good who can; and if thou be able, thou do good as well.)"},{"num":28,"verse":"Say thou not to thy friend, Go, and turn again, and tomorrow I shall give to thee; when thou mayest give anon. (Say thou not to thy friend, Go away, and return tomorrow, and then I shall give you what you need; when thou can give it to him at once.)"},{"num":29,"verse":"Imagine thou not evil to thy friend (Imagine thou not evil against thy friend), when he hath trust in thee."},{"num":30,"verse":"Strive thou not against a man without cause, when he doeth none evil to thee. (Do not thou argue with someone for no reason, when he hath done nothing wrong to thee.)"},{"num":31,"verse":"Follow thou not an unjust man (Do not thou follow a law-breaker), follow thou not his ways."},{"num":32,"verse":"For each deceiver is (an) abomination to the Lord; and his speaking is with simple men (and the Lord speaketh to those who be honest, or have integrity)."},{"num":33,"verse":"Neediness is sent of the Lord in(to) the house of a wicked man; but the dwelling places of just men shall be blessed. (Neediness is sent by the Lord into the houses of the wicked; but the dwelling places of the righteous shall be blessed.)"},{"num":34,"verse":"He shall scorn [the] scorners; and he shall give grace to mild men. (He shall mock the mockers; but he shall give favour to the humble, or to the meek.)"},{"num":35,"verse":"Wise men shall have glory; [the] enhancing of fools is shame. (The wise shall receive honour; but fools shall only increase their shame.)"}]