[{"header":"Preaching the Good News"},{"num":4,"verse":"God, with his mercy, gave us this work to do. So we don’t give up. "},{"num":2,"verse":"But we have turned away from secret and shameful ways. We use no trickery, and we do not change the teaching of God. We teach the truth plainly. This is how we show everyone who we are. And this is how they can know in their hearts what kind of people we are before God. "},{"num":3,"verse":"The Good News that we preach may be hidden. But it is hidden only to those who are lost. "},{"num":4,"verse":"The devil who rules this world has blinded the minds of those who do not believe. They cannot see the light of the Good News—the Good News about the glory of Christ, who is exactly like God. "},{"num":5,"verse":"We do not preach about ourselves. But we preach that Jesus Christ is Lord; and we preach that we are your servants for Jesus. "},{"num":6,"verse":"God once said, “Let the light shine out of the darkness!” And this is the same God who made his light shine in our hearts. He gave us light by letting us know the glory of God that is in the face of Christ."},{"header":"Spiritual Treasure in Clay Jars"},{"num":7,"verse":"We have this treasure from God. But we are only like clay jars that hold the treasure. This shows that this great power is from God, not from us. "},{"num":8,"verse":"We have troubles all around us, but we are not defeated. We do not know what to do, but we do not give up. "},{"num":9,"verse":"We are persecuted, but God does not leave us. We are hurt sometimes, but we are not destroyed. "},{"num":10,"verse":"We carry the death of Jesus in our own bodies, so that the life of Jesus can also be seen in our bodies. "},{"num":11,"verse":"We are alive, but for Jesus we are always in danger of death. This is so that the life of Jesus can be seen in our bodies that die. "},{"num":12,"verse":"So death is working in us, but life is working in you."},{"num":13,"verse":"It is written in the Scriptures, “I believed, so I spoke.” Our faith is like this, too. We believe, and so we speak. "},{"num":14,"verse":"God raised the Lord Jesus from death. And we know that God will also raise us with Jesus. God will bring us together with you, and we will stand before him. "},{"num":15,"verse":"All these things are for you. And so the grace of God is being given to more and more people. This will bring more and more thanks to God for his glory."},{"header":"Living by Faith"},{"num":16,"verse":"So we do not give up. Our physical body is becoming older and weaker, but our spirit inside us is made new every day. "},{"num":17,"verse":"We have small troubles for a while now, but they are helping us gain an eternal glory. That glory is much greater than the troubles. "},{"num":18,"verse":"So we set our eyes not on what we see but on what we cannot see. What we see will last only a short time. But what we cannot see will last forever."}]