[{"header":"A Treasure in Clay Jars"},{"num":4,"verse":"So because of God’s mercy, we have work to do. He has given it to us. And we don’t give up. "},{"num":2,"verse":"Instead, we have given up doing secret and shameful things. We don’t twist God’s word. In fact, we do just the opposite. We present the truth plainly. In the sight of God, we make our appeal to everyone’s sense of what is right and wrong. "},{"num":3,"verse":"Suppose our good news is covered with a veil. Then it is veiled to those who are dying. "},{"num":4,"verse":"The god of this world has blinded the minds of those who don’t believe. They can’t see the light of the good news that makes Christ’s glory clear. Christ is the likeness of God. "},{"num":5,"verse":"The message we preach is not about ourselves. Our message is about Jesus Christ. We say that he is Lord. And we say that we serve you because of Jesus. "},{"num":6,"verse":"God said, “Let light shine out of darkness.” (Genesis 1:3) He made his light shine in our hearts. His light gives us the light to know God’s glory. His glory is shown in the face of Christ."},{"num":7,"verse":"Treasure is kept in clay jars. In the same way, we have the treasure of the good news in these earthly bodies of ours. That shows that the mighty power of the good news comes from God. It doesn’t come from us. "},{"num":8,"verse":"We are pushed hard from all sides. But we are not beaten down. We are bewildered. But that doesn’t make us lose hope. "},{"num":9,"verse":"Others make us suffer. But God does not desert us. We are knocked down. But we are not knocked out. "},{"num":10,"verse":"We always carry around the death of Jesus in our bodies. In that way, the life of Jesus can be shown in our bodies. "},{"num":11,"verse":"We who are alive are always in danger of death because we are serving Jesus. This happens so that his life can also be shown in our earthly bodies. "},{"num":12,"verse":"Death is at work in us. But life is at work in you."},{"num":13,"verse":"It is written, “I believed, and so I have spoken.” (Psalm 116:10) We have that same spirit of faith. So we also believe and speak. "},{"num":14,"verse":"We know that God raised the Lord Jesus from the dead. And he will also raise us up with Jesus. And he will present both you and us to himself. "},{"num":15,"verse":"All this is for your benefit. God’s grace is reaching more and more people. So they will become more and more thankful. They will give glory to God."},{"num":16,"verse":"We don’t give up. Our bodies are becoming weaker and weaker. But our spirits are being renewed day by day. "},{"num":17,"verse":"Our troubles are small. They last only for a short time. But they are earning for us a glory that will last forever. It is greater than all our troubles. "},{"num":18,"verse":"So we don’t spend all our time looking at what we can see. Instead, we look at what we can’t see. That’s because what can be seen lasts only a short time. But what can’t be seen will last forever."}]