[{"num":4,"verse":"It is God himself, in his mercy, who has given us this wonderful work of telling his Good News to others, and so we never give up. "},{"num":2,"verse":"We do not try to trick people into believing—we are not interested in fooling anyone. We never try to get anyone to believe that the Bible teaches what it doesn’t. All such shameful methods we forego. We stand in the presence of God as we speak and so we tell the truth, as all who know us will agree."},{"num":3,"verse":"If the Good News we preach is hidden to anyone, it is hidden from the one who is on the road to eternal death. "},{"num":4,"verse":"Satan, who is the god of this evil world, has made him blind, unable to see the glorious light of the Gospel that is shining upon him or to understand the amazing message we preach about the glory of Christ, who is God. "},{"num":5,"verse":"We don’t go around preaching about ourselves but about Christ Jesus as Lord. All we say of ourselves is that we are your slaves because of what Jesus has done for us. "},{"num":6,"verse":"For God, who said, “Let there be light in the darkness,” has made us understand that it is the brightness of his glory that is seen in the face of Jesus Christ."},{"num":7,"verse":"But this precious treasure—this light and power that now shine within us—is held in a perishable container, that is, in our weak bodies. Everyone can see that the glorious power within must be from God and is not our own."},{"num":8,"verse":"We are pressed on every side by troubles, but not crushed and broken. We are perplexed because we don’t know why things happen as they do, but we don’t give up and quit. "},{"num":9,"verse":"We are hunted down, but God never abandons us. We get knocked down, but we get up again and keep going. "},{"num":10,"verse":"These bodies of ours are constantly facing death just as Jesus did; so it is clear to all that it is only the living Christ within who keeps us safe."},{"num":11,"verse":"Yes, we live under constant danger to our lives because we serve the Lord, but this gives us constant opportunities to show forth the power of Jesus Christ within our dying bodies. "},{"num":12,"verse":"Because of our preaching we face death, but it has resulted in eternal life for you."},{"num":13,"verse":"We boldly say what we believe, trusting God to care for us, just as the psalm writer did when he said, “I believe and therefore I speak.” "},{"num":14,"verse":"We know that the same God who brought the Lord Jesus back from death will also bring us back to life again with Jesus and present us to him along with you. "},{"num":15,"verse":"These sufferings of ours are for your benefit. And the more of you who are won to Christ, the more there are to thank him for his great kindness, and the more the Lord is glorified."},{"num":16,"verse":"That is why we never give up. Though our bodies are dying, our inner strength in the Lord is growing every day. "},{"num":17,"verse":"These troubles and sufferings of ours are, after all, quite small and won’t last very long. Yet this short time of distress will result in God’s richest blessing upon us forever and ever! "},{"num":18,"verse":"So we do not look at what we can see right now, the troubles all around us, but we look forward to the joys in heaven which we have not yet seen. The troubles will soon be over, but the joys to come will last forever."}]