[{"header":"Words against the King of Tyre"},{"num":28,"verse":"The Word of the Lord came to me saying, "},{"num":2,"verse":"“Son of man, tell the leader of Tyre, ‘The Lord God says, “Because your heart is proud, you have said, ‘I am a god. I sit in the seat of gods, with the seas around me.’ Yet you are a man and not God, even if you think you are as wise as God. "},{"num":3,"verse":"You are wiser than Daniel. There is no secret that is hidden from you. "},{"num":4,"verse":"By your wisdom and understanding you have gathered riches for yourself. You have gathered gold and silver for your store-houses. "},{"num":5,"verse":"By all your wisdom in trade you have added to your riches, and your heart has become proud because of them. "},{"num":6,"verse":"So the Lord God says, ‘Because you think you are as wise as God, "},{"num":7,"verse":"I will bring strangers against you, those who have the hardest hearts of all the nations. With their swords they will destroy the beauty of your wisdom and your greatness. "},{"num":8,"verse":"They will bring you down to the grave. You will die the death of those who are killed on the sea. "},{"num":9,"verse":"Will you still say, “I am a god,” in front of those who kill you? You will be only a man and not a god in the hands of those who kill you. "},{"num":10,"verse":"You will be killed by strangers, and will die the death of one who has not gone through the religious act of My people. For I have spoken,’ says the Lord God.”’”"},{"header":"Song of Sorrow for the King of Tyre"},{"num":11,"verse":"The Word of the Lord came to me saying, "},{"num":12,"verse":"“Son of man, sing a song of sorrow for the king of Tyre, and tell him, ‘The Lord God says, “You were once the mark of what is perfect, full of wisdom and perfect in beauty. "},{"num":13,"verse":"You were in Eden, the garden of God. Every stone of great worth covered you: ruby, topaz, diamond, beryl, onyx, jasper, chrysolite, turquoise, and emerald. And you had beautiful objects of gold. They were made for you when you were made. "},{"num":14,"verse":"You were the cherub who kept watch, and I placed you there. You were on the holy mountain of God. You walked among the stones of fire. "},{"num":15,"verse":"You were without blame in your ways from the day you were made until sin was found in you. "},{"num":16,"verse":"Through all your trading you were filled with bad ways, and you sinned. So I have sent you away in shame from the mountain of God and I have destroyed you and driven you out from the stones of fire, O cherub who kept watch. "},{"num":17,"verse":"Your heart was proud because of your beauty. You made your wisdom sinful because of your beauty. So I threw you to the ground. I laid you in front of kings for them to see you. "},{"num":18,"verse":"By all your wrong-doing and sinful trading you made your holy places sinful. So I made a fire come out from you, and it has destroyed you. I have turned you to ashes on the earth in the eyes of all who see you. "},{"num":19,"verse":"All the nations who know you are filled with wonder and fear because of you. You have come to a bad end, and you will be no more forever.”’”"},{"header":"Words against Sidon"},{"num":20,"verse":"The Word of the Lord came to me saying, "},{"num":21,"verse":"“Son of man, look toward Sidon and speak against her. "},{"num":22,"verse":"Tell her, ‘The Lord God says, “I am against you, O Sidon, and My greatness will be honored among you. They will know that I am the Lord when I punish Sidon. I will show Myself holy within her. "},{"num":23,"verse":"For I will send disease upon her, and blood into her streets. People will be killed by the sword from every side. Then they will know that I am the Lord. "},{"num":24,"verse":"No longer will the people of Israel have neighbors like a sharp thistle or thorn who hate them. Then they will know that I am the Lord God."},{"num":25,"verse":"“The Lord God says, ‘I will gather the people of Israel from the different nations where they have been sent. And I will show Myself holy among them in the eyes of the nations. Then they will live in their own land which I gave to My servant Jacob. "},{"num":26,"verse":"They will live there and be safe. They will build houses, plant grape-fields, and be safe, when I punish all those around them who speak against them. Then they will know that I am the Lord their God.”’”"}]