[[],[{"type":"header","content":"Aaron Offers Sacrifices"},{"type":"prose","content":"And it happened on the eighth day that Moses called Aaron and his sons and the elders of Israel; "}],[{"type":"prose","content":"and he said to Aaron, “Take a bull calf as a sin offering and a ram as a burnt offering, [each] without blemish, and offer  before the . "}],[{"type":"prose","content":"Then say to the Israelites, ‘Take a male goat as a sin offering, and a calf and a lamb, both one year old, without blemish, as a burnt offering, "}],[{"type":"prose","content":"and a bull and a ram as peace offerings to sacrifice before the , and a grain offering mixed with [olive] oil, for today the  will appear to you.’” "}],[{"type":"prose","content":"So they took what Moses had commanded to the front of the Tent of Meeting, and all the congregation approached and stood before the . "}],[{"type":"prose","content":"Moses said, “This is the thing which the  has commanded you to do, so that the glory of the  may appear to you.” "}],[{"type":"prose","content":"Moses said to Aaron, “Approach the altar and present your sin offering and your burnt offering and make atonement for yourself and for the people; and present the offering of the people and make atonement for them, just as the  has commanded.”"}],[{"type":"prose","content":"So Aaron approached the altar and killed the calf as the sin offering, which was  for himself. "}],[{"type":"prose","content":"The sons of Aaron presented the blood to him; he dipped his finger in the blood and put  on the horns of the altar, and poured out the  blood at the altar’s base; "}],[{"type":"prose","content":"but the fat, the kidneys, and the lobe of the liver from the sin offering he offered up in smoke on the altar, just as the  had commanded Moses. "}],[{"type":"prose","content":"And Aaron burned the meat and the hide in the fire outside the camp."}],[{"type":"prose","content":"Then he killed the burnt offering; and Aaron’s sons handed the blood to him and he sprinkled it around on the altar. "}],[{"type":"prose","content":"They brought the burnt offering to him piece by piece, with the head, and Aaron offered them up in smoke on the altar. "}],[{"type":"prose","content":"He also washed the entrails and the legs, and offered them up in smoke with the burnt offering on the altar."}],[{"type":"prose","content":"Then Aaron presented the people’s offering. He took the goat for the sin offering of the people, and killed it and offered it for sin, as  the first. "}],[{"type":"prose","content":"He also presented the burnt offering and offered it according to the ordinance. "}],[{"type":"prose","content":"Next Aaron presented the grain offering and took a handful of it and offered it up in smoke on the altar in addition to the burnt offering of the morning."}],[{"type":"prose","content":"He also killed the bull and the ram, the sacrifice of peace offerings which was for the people; and Aaron’s sons handed the blood to him and he sprinkled it around on the altar, "}],[{"type":"prose","content":"As for the portions of fat from the bull and from the ram—the fat tail, and the fat covering the internal organs, and the kidneys, and the lobe of the liver— "}],[{"type":"prose","content":"they now put the portions of fat on the breasts; and Aaron offered the fat up in smoke on the altar. "}],[{"type":"prose","content":"But the breasts and the right thigh Aaron presented as a wave offering before the , just as Moses had commanded."}],[{"type":"prose","content":"Then Aaron lifted his hands toward the people and blessed them, and came down [from the altar of burnt offering] after presenting the sin offering, the burnt offering, and the peace offerings. "}],[{"type":"prose","content":"Moses and Aaron went into the Tent of Meeting, and when they came out they blessed the people, and the glory  brilliance of the  [the Shekinah cloud] appeared to all the people [as promised]. "}],[{"type":"prose","content":"Then fire came out from before the  and consumed the burnt offering and the portions of fat on the altar; and when all the people saw it, they shouted and fell face downward [in awe and worship].Cross references\n\n\n\n\n\n\n\n"}]]