[{"num":9,"verse":"On the eighth day Moses called Aaron and his sons and the elders of Israel;"},{"num":2,"verse":"And he said to Aaron, Take a young calf for a sin offering and a ram for a burnt offering, [each] without blemish, and offer them before the Lord."},{"num":3,"verse":"And say to the Israelites, Take a male goat for a sin offering, and a calf and a lamb, both a year old, without blemish, for a burnt offering,"},{"num":4,"verse":"Also a bull and a ram for peace offerings to sacrifice before the Lord, and a cereal offering mixed with oil, for today the Lord will appear to you."},{"num":5,"verse":"They brought before the Tent of Meeting what Moses [had] commanded; all the congregation drew near and stood before the Lord."},{"num":6,"verse":"And Moses said, This is the thing which the Lord commanded you to do, and the glory of the Lord will appear to you."},{"num":7,"verse":"And Moses said to Aaron, Draw near to the altar and offer your sin offering and your burnt offering and make atonement for yourself and for the people; and offer the offering of the people and make atonement for them, as the Lord commanded."},{"num":8,"verse":"So Aaron drew near to the altar and killed the calf of the sin offering, which was designated for himself."},{"num":9,"verse":"The sons of Aaron presented the blood to him; he dipped his finger in the blood and put it on the horns of the altar and poured out the blood at the altar’s base;"},{"num":10,"verse":"But the fat, the kidneys, and the lobe of the liver from the sin offering he burned on the altar, as the Lord had commanded Moses."},{"num":11,"verse":"And the flesh and the hide Aaron burned with fire outside the camp."},{"num":12,"verse":"He killed the burnt offering, and Aaron’s sons delivered to him the blood, which he dashed round about upon the altar."},{"num":13,"verse":"And they brought the burnt offering to him piece by piece, and the head, and Aaron burned them upon the altar."},{"num":14,"verse":"And he washed the entrails and the legs and burned them with the burnt offering on the altar."},{"num":15,"verse":"Then Aaron presented the people’s offering, and took the goat of the sin offering which was for the people and killed it and offered it for sin as he did the first sin offering."},{"num":16,"verse":"And he presented the burnt offering and offered it according to the ordinance."},{"num":17,"verse":"And Aaron presented the cereal offering and took a handful of it and burned it on the altar in addition to the burnt offering of the morning."},{"num":18,"verse":"He also killed the bull and the ram, the sacrifice of peace offerings, for the people; and Aaron’s sons presented to him the blood, which he dashed upon the altar round about,"},{"num":19,"verse":"And the fat of the bull and of the ram, the fat tail and that which covers the entrails, and the kidneys, and the lobe of the liver."},{"num":20,"verse":"And they put the fat upon the breasts, and Aaron burned the fat upon the altar;"},{"num":21,"verse":"But the breasts and the right thigh Aaron waved for a wave offering before the Lord, as Moses commanded."},{"num":22,"verse":"Then Aaron lifted his hands toward the people and blessed them, and came down [from the altar] after offering the sin offering, the burnt offering, and the peace offerings."},{"num":23,"verse":"Moses and Aaron went into the Tent of Meeting, and when they came out they blessed the people, and the glory of the Lord [the Shekinah cloud] appeared to all the people [as promised]."},{"num":24,"verse":"Then there came a fire out from before the Lord and consumed the burnt offering and the fat on the altar; and when all the people saw it, they shouted and fell on their faces."}]