[{"header":"The Inauguration of the Sacrifices"},{"num":9,"verse":"On the eighth day Moses summoned Aaron and his sons and the elders of Israel. "},{"num":2,"verse":"He said to Aaron, “Take a bull calf from the herd for a sin offering and a ram for a whole burnt offering, both without blemish, and present them before the Lord. "},{"num":3,"verse":"Then speak to the Israelites and say, ‘Take a male goat for a sin offering. Also take a calf and a lamb, both a year old and without blemish, for a burnt offering. "},{"num":4,"verse":"As a fellowship offering take one of the cattle and a ram to be sacrificed before the Lord, and take a grain offering mixed with oil, for today the Lord will appear to you.’”"},{"num":5,"verse":"They took what Moses had commanded to the entrance of the Tent of Meeting. Then the whole congregation approached and stood before the Lord. "},{"num":6,"verse":"Moses said, “This is what the Lord has commanded you to do, so that the Glory of the Lord may appear to you.” "},{"num":7,"verse":"Then Moses said to Aaron, “Approach the altar and present your sin offering and your burnt offering. Make atonement for yourself and for the people. Then present the offering for the people. Make atonement for them, just as the Lord has commanded.”"},{"num":8,"verse":"Aaron approached the altar and slaughtered the calf as a sin offering for himself. "},{"num":9,"verse":"Then Aaron’s sons presented the blood to him. After he had dipped his finger in the blood, he put it on the horns of the altar, and he poured out the rest of the blood at the base of the altar. "},{"num":10,"verse":"Then he turned the fat, the kidneys, and the protruding lobe of the liver from the sin offering into smoke upon the altar, just as the Lord had commanded Moses. "},{"num":11,"verse":"But the meat and the hide were burned with fire outside the camp."},{"num":12,"verse":"After he slaughtered the burnt offering, Aaron’s sons brought the blood to him, and he splashed it against all sides of the altar. "},{"num":13,"verse":"They brought the whole burnt offering to him, piece by piece, including the head, and he turned them into smoke on the altar. "},{"num":14,"verse":"He washed the inner organs and the legs and turned them into smoke on top of the whole burnt offering that was on the altar."},{"num":15,"verse":"Then he presented the offering for the people. He took the male goat for the sin offering for the people, slaughtered it, and made a sin offering with it as he had done with the first one for himself. "},{"num":16,"verse":"He then presented the whole burnt offering and carried out the offering according to the regulations. "},{"num":17,"verse":"Next he presented the grain offering. Taking a handful of it, he sent it up in smoke on the altar, in addition to the morning burnt offering. "},{"num":18,"verse":"When he had slaughtered the offering of one of the cattle and of the ram as the people’s sacrifice for fellowship offerings, Aaron’s sons brought the blood to him, which he splashed against all sides of the altar, "},{"num":19,"verse":"and the fat pieces from the offering of the ox and the ram—the broad tail, the layer of fat, the kidneys, and the protruding lobe of the liver. "},{"num":20,"verse":"They laid the fat pieces on the breasts, and he turned the fat pieces into smoke on the altar."},{"num":21,"verse":"Aaron waved the breasts and the right thigh as a wave offering before the Lord, just as Moses had commanded. "},{"num":22,"verse":"Then Aaron lifted up his hands toward the people and blessed them. After he had presented the sin offering, the whole burnt offering, and the fellowship offerings, he came down from the altar. "},{"num":23,"verse":"Then Moses and Aaron entered the Tent of Meeting. When they came out, they blessed the people, and the Glory of the Lord appeared to all the people. "},{"num":24,"verse":"Fire came out from the presence of the Lord and consumed the burnt offering and the fat pieces on the altar. When all the people saw it, they shouted for joy and fell on their faces."}]