[{"header":"God Accepts the Priests"},{"num":9,"verse":"On the eighth day, Moses called for Aaron and his sons and the elders of Israel."},{"num":2,"verse":"He said to Aaron, “Take a bull and a ram. There must be nothing wrong with them. The bull will be a sin offering, and the ram will be a burnt offering. Offer these animals to the Lord."},{"num":3,"verse":"Tell the Israelites, ‘Take a male goat for a sin offering, and take a calf and a lamb for a burnt offering. The calf and the lamb must each be one year old. There must be nothing wrong with them."},{"num":4,"verse":"Take a bull and a ram for fellowship offerings. Take these animals and a grain offering mixed with oil for an offering to the Lord. Do this because the Lord will appear to you today.’”"},{"num":5,"verse":"So all the people came to the Meeting Tent. They all brought the things that Moses had commanded. All the people stood before the Lord."},{"num":6,"verse":"Moses said, “You must do what the Lord commanded. Then the Glory of the Lord will appear to you.”"},{"num":7,"verse":"Then Moses told Aaron: “Go do what the Lord commanded. Go to the altar and offer sin offerings and burnt offerings. Do what will make you and the people pure. Take the people’s sacrifices and make them pure.”"},{"num":8,"verse":"So Aaron went to the altar. He killed the bull for the sin offering. This sin offering was for himself."},{"num":9,"verse":"Then the sons of Aaron brought the blood to Aaron. Aaron put his finger in the blood and put it on the corners of the altar. Then he poured out the blood at the base of the altar."},{"num":10,"verse":"He took the fat, the kidneys, and the fat part of the liver from the sin offering. He burned them on the altar just as the Lord had commanded Moses."},{"num":11,"verse":"Then Aaron burned the meat and skin on a fire outside the camp."},{"num":12,"verse":"Next, Aaron killed the animal for the burnt offering. His sons brought the blood to him, and he sprinkled the blood around on the altar."},{"num":13,"verse":"Aaron’s sons gave the pieces and head of the burnt offering to Aaron, and he burned them on the altar."},{"num":14,"verse":"He also washed the inner parts and the legs of the burnt offering and burned them on the altar."},{"num":15,"verse":"Then Aaron brought the people’s offering. He killed the goat of the sin offering that was for the people. He offered the goat for sin, like the earlier sin offering."},{"num":16,"verse":"He brought the burnt offering and offered it, just as the Lord had commanded."},{"num":17,"verse":"He brought the grain offering to the altar. He took a handful of the grain and put it on the altar beside that morning’s daily sacrifice."},{"num":18,"verse":"Aaron also killed the bull and the ram that were the fellowship offerings from the people. His sons brought the blood to him, and he sprinkled this blood around on the altar."},{"num":19,"verse":"Aaron’s sons also brought him the fat of the bull and the ram. They brought the fat tail, the fat covering the inner parts, the kidneys, and the fat part of the liver."},{"num":20,"verse":"Aaron’s sons put these fat parts on the breasts of the bull and the ram. Aaron burned them on the altar."},{"num":21,"verse":"He lifted the breasts and the gift of the right thigh to show he was offering them before the Lord, just as Moses had commanded."},{"num":22,"verse":"Then Aaron lifted up his hands toward the people and blessed them. After he finished offering the sin offering, the burnt offering, and the fellowship offerings, he came down from the altar."},{"num":23,"verse":"Moses and Aaron went into the Meeting Tent. They came out and blessed the people. Then the Glory of the Lord appeared to all the people."},{"num":24,"verse":"Fire came out from the Lord and burned the burnt offering and fat on the altar. When all the people saw this, they shouted with joy and then bowed to the ground to show their respect."}]