[{"header":"Kohanim Begin Their Ministry"},{"num":9,"verse":"Now it happened on the eighth day that Moses called Aaron, his sons, and the elders of Israel. "},{"num":2,"verse":"Then he said to Aaron, “Take a calf from the herd for a sin offering, and a ram for a burnt offering, both without blemish, and offer them before Adonai. "},{"num":3,"verse":"You are to speak to Bnei-Yisrael, saying: Take a male goat for a sin offering, along with a calf and a lamb, both yearlings without blemish, for a burnt offering, "},{"num":4,"verse":"plus a bull and a ram for fellowship offerings, to sacrifice before Adonai, along with a grain offering mixed with oil. For today Adonai appears to you.”"},{"num":5,"verse":"So they brought what Moses commanded before the Tent of Meeting, and the entire congregation drew near and stood before Adonai. "},{"num":6,"verse":"Moses said, “This is what Adonai commanded that you shall do, so that the glory of Adonai may appear to you.” "},{"num":7,"verse":"Moses said to Aaron, “Draw near to the altar, and bring your sin offering, and your burnt offering, and make atonement for yourself and for the people. Then present the offering for the people, and make atonement for them, as Adonai commanded.”"},{"num":8,"verse":"So Aaron drew near to the altar, and slaughtered the calf of the sin offering, which was for himself. "},{"num":9,"verse":"The sons of Aaron presented the blood to him. Then he dipped his finger in the blood, dabbed it onto the horns of the altar, and poured out the blood at the base of the altar. "},{"num":10,"verse":"But the fat, the kidneys and the cover from the liver of the sin offering he burned up as smoke on the altar, as Adonai had commanded Moses. "},{"num":11,"verse":"The flesh and the hide he burned in a fire outside the camp. "},{"num":12,"verse":"Aaron slaughtered the burnt offering, then his sons presented the blood to him and he splashed it around on the altar. "},{"num":13,"verse":"They handed the burnt offering to him piece by piece, along with the head, and he burned them up as smoke on the altar. "},{"num":14,"verse":"He washed the innards and the legs and he offered them in smoke upon the burnt offering on the altar. "},{"num":15,"verse":"Then he presented the people’s gift, took the goat of the sin offering which was for the people, slaughtered it, and offered it for sin, just like the first one. "},{"num":16,"verse":"He presented the burnt offering and offered it according to the decree."},{"num":17,"verse":"Then Aaron presented the grain offering, filling his hand with some of it and burning it up as smoke on the altar, alongside the burnt offering of the morning. "},{"num":18,"verse":"He also slaughtered the bull and the ram as the sacrifice of fellowship offerings for the people. Then his sons brought him the blood, which he splashed around on the altar, "},{"num":19,"verse":"as well as the fat from the bull and the ram, the fat tail, and the layer over the innards along with the kidneys and the covering of the liver. "},{"num":20,"verse":"They put the fat upon the breasts, and he burned it on the altar. "},{"num":21,"verse":"But the breasts and the right thigh Aaron waved for a wave offering before Adonai, as Moses had commanded. "},{"num":22,"verse":"Then Aaron lifted up his hands toward the people and blessed them. Then he stepped down from presenting the sin offering, the burnt offering and the fellowship offerings."},{"num":23,"verse":"Moses and Aaron then went into the Tent of Meeting. When they came back out and blessed the people, the glory of Adonai appeared to all the people. "},{"num":24,"verse":"Fire came out from the presence of Adonai, and devoured the burnt offering and the fat on the altar. When all the people saw it, they shouted and fell on their faces."}]