[{"header":"The Valley of Dry Bones"},{"num":37,"verse":"I felt the powerful presence of the Lord, and his spirit took me and set me down in a valley where the ground was covered with bones. "},{"num":2,"verse":"He led me all around the valley, and I could see that there were very many bones and that they were very dry. "},{"num":3,"verse":"He said to me, “Mortal man, can these bones come back to life?”"},{"num":4,"verse":"He said, “Prophesy to the bones. Tell these dry bones to listen to the word of the Lord. "},{"num":5,"verse":"Tell them that I, the Sovereign Lord, am saying to them: I am going to put breath into you and bring you back to life. "},{"num":6,"verse":"I will give you sinews and muscles, and cover you with skin. I will put breath into you and bring you back to life. Then you will know that I am the Lord.”"},{"num":7,"verse":"So I prophesied as I had been told. While I was speaking, I heard a rattling noise, and the bones began to join together. "},{"num":8,"verse":"While I watched, the bones were covered with sinews and muscles, and then with skin. But there was no breath in the bodies."},{"num":9,"verse":"God said to me, “Mortal man, prophesy to the wind. Tell the wind that the Sovereign Lord commands it to come from every direction, to breathe into these dead bodies, and to bring them back to life.”"},{"num":10,"verse":"So I prophesied as I had been told. Breath entered the bodies, and they came to life and stood up. There were enough of them to form an army."},{"num":11,"verse":"God said to me, “Mortal man, the people of Israel are like these bones. They say that they are dried up, without any hope and with no future. "},{"num":12,"verse":"So prophesy to my people Israel and tell them that I, the Sovereign Lord, am going to open their graves. I am going to take them out and bring them back to the land of Israel. "},{"num":13,"verse":"When I open the graves where my people are buried and bring them out, they will know that I am the Lord. "},{"num":14,"verse":"I will put my breath in them, bring them back to life, and let them live in their own land. Then they will know that I am the Lord. I have promised that I would do this—and I will. I, the Lord, have spoken.”"},{"header":"Judah and Israel in One Kingdom"},{"num":15,"verse":"The Lord spoke to me again. "},{"num":16,"verse":"“Mortal man,” he said, “take a wooden stick and write on it the words, ‘The kingdom of Judah.’ Then take another stick and write on it the words, ‘The kingdom of Israel.’ "},{"num":17,"verse":"Then hold the two sticks end to end in your hand so that they look like one stick. "},{"num":18,"verse":"When your people ask you to tell them what this means, "},{"num":19,"verse":"tell them that I, the Sovereign Lord, am going to take the stick representing Israel and put it with the one that represents Judah. Out of the two I will make one stick and hold it in my hand."},{"num":20,"verse":"“Hold in your hand the two sticks and let the people see them. "},{"num":21,"verse":"Then tell them that I, the Sovereign Lord, am going to take all my people out of the nations where they have gone, gather them together, and bring them back to their own land. "},{"num":22,"verse":"I will unite them into one nation in the land, on the mountains of Israel. They will have one king to rule over them, and they will no longer be divided into two nations or split into two kingdoms. "},{"num":23,"verse":"They will not defile themselves with disgusting idols any more or corrupt themselves with sin. I will free them from all the ways in which they sin and betray me. I will purify them; they will be my people, and I will be their God. "},{"num":24,"verse":"A king like my servant David will be their king. They will all be united under one ruler and will obey my laws faithfully. "},{"num":25,"verse":"They will live on the land I gave to my servant Jacob, the land where their ancestors lived. They will live there forever, and so will their children and all their descendants. A king like my servant David will rule them forever. "},{"num":26,"verse":"I will make a covenant with them that guarantees their security forever. I will establish them and increase their population, and will see to it that my Temple stands forever in their land. "},{"num":27,"verse":"I will live there with them; I will be their God, and they will be my people. "},{"num":28,"verse":"When I place my Temple there to be among them forever, then the nations will know that I, the Lord, have chosen Israel to be my own people.”"}]