[{"num":48,"verse":"The lots of the tribes. 9 The parts of the possession of the Priests, of the Temple, of the Levites, of the city, and of the Prince are rehearsed."},{"num":1,"verse":"Now these are the names of the tribes. From the North side, to the coast toward Hethlon as one goeth to Hamath, Hazar, Enan, and the border of Damascus Northward the coast of Hamath, even from the East side to the West shall be a portion for Dan."},{"num":2,"verse":"And by the border of Dan from the East side unto the West side, a portion for Asher."},{"num":3,"verse":"And by the border of Asher from the East part even unto the West part, a portion for Naphtali."},{"num":4,"verse":"And by the border of Naphtali from the East quarter unto the West side, a portion for Manasseh."},{"num":5,"verse":"And by the border of Manasseh, from the East side unto the West side, a portion for Ephraim."},{"num":6,"verse":"And by the border of Ephraim, from the East part even unto the West part, a portion for Reuben."},{"num":7,"verse":"And by the border of Reuben, from the East quarter unto the West quarter, a portion for Judah."},{"num":8,"verse":"And by the border of Judah from the East part unto the West part shall be the offering which they shall offer of five and twenty thousand reeds broad, and of length as one of the other parts, from the East side unto the West side, and the Sanctuary shall be in the midst of it."},{"num":9,"verse":"The oblation that ye shall offer unto the Lord, shall be of five and twenty thousand long, and of ten thousand the breadth."},{"num":10,"verse":"And for them, even for the Priests shall be this holy oblation, toward the North five and twenty thousand long, and toward the West, ten thousand broad, and toward the East ten thousand broad, and toward the South five and twenty thousand long, and the Sanctuary of the Lord shall be in the midst thereof."},{"num":11,"verse":"It shall be for the Priests that are sanctified of the sons of Zadok, which have kept my charge, which went not astray, when the children of Israel went astray, as the Levites went astray."},{"num":12,"verse":"Therefore this oblation of the land that is offered shall be theirs, as a thing most holy by the border of the Levites."},{"num":13,"verse":"And over against the border of the Priests the Levites shall have five and twenty thousand long, and [ten] thousand broad: all the length shall be five and twenty thousand, and the breadth ten thousand."},{"num":14,"verse":"And they shall not sell of it, neither change it, nor alienate the firstfruits of the land: for it is holy unto the Lord."},{"num":15,"verse":"And the five thousand that are left in the breadth over against the five and twenty thousand, shall be a profane place for the city, for housing, and for suburbs, and the city shall be in the midst thereof."},{"num":16,"verse":"And these shall be the measures thereof, the North part five hundred and four thousand, and the South part five hundred and four thousand, and the East part five hundred and four thousand, and the West part five hundred and four thousand."},{"num":17,"verse":"And the suburbs of the city shall be toward the North two hundred and fifty, and toward the South two hundred and fifty, and toward the East two hundred and fifty, and toward the West two hundred and fifty."},{"num":18,"verse":"And the residue in length over against the oblation of the holy portion shall be ten thousand Eastward, and ten thousand Westward: and it shall be over against the oblation of the holy portion, and the increase thereof shall be for food unto them that serve in the city."},{"num":19,"verse":"And they that serve in the city, shall be of all the tribes of Israel that shall serve therein."},{"num":20,"verse":"All the oblation shall be five and twenty thousand with five and twenty thousand: you shall offer this oblation foursquare for the Sanctuary, and for the possession of the city."},{"num":21,"verse":"And the residue shall be for the prince on the one side and on the other of the oblation of the Sanctuary, and of the possession of the city, over against the five and twenty thousand of the oblation toward the East border, and Westward over against the five and twenty thousand toward the West border, over against shall be for the portion of the prince: this shall be the holy oblation, and the house of the Sanctuary shall be in the midst thereof."},{"num":22,"verse":"Moreover, from the possession of the Levites, and from the possession of the city, that which is in the midst shall be the prince’s: between the border of Judah, and between the border of Benjamin shall be the Princes."},{"num":23,"verse":"And the rest of the tribes shall be thus: from the East part unto the West part, Benjamin shall be a portion."},{"num":24,"verse":"And by the border of Benjamin, from the East side unto the West side, Simeon a portion."},{"num":25,"verse":"And by the border of Simeon from the East part unto the West part, Issachar a portion."},{"num":26,"verse":"And by the border of Issachar, from the East side unto the West, Zebulun a portion."},{"num":27,"verse":"And by the border of Zebulun, from the East part unto the West part, Gad a portion."},{"num":28,"verse":"And by the border of Gad at the South side, toward Temath, the border shall be even from Tamar, unto the waters of Meribah in Kadesh, and to the river, that runneth into the main sea."},{"num":29,"verse":"This is the land, which ye shall distribute unto the tribes of Israel for inheritance, and these are their portions, saith the Lord God."},{"num":30,"verse":"And these are the bounds of the city, on the North side five hundred, and four thousand measures."},{"num":31,"verse":"And the gates of the city shall be after the names of the tribes of Israel, the gates Northward, one gate of Reuben, one gate of Judah, and one gate of Levi."},{"num":32,"verse":"And at the East side five hundred and four thousand, and three gates, and one gate of Joseph, one gate of Benjamin, and one gate of Dan."},{"num":33,"verse":"And at the South side, five hundred and four thousand measures, and three ports, one gate of Simeon, one gate of Issachar, and one gate of Zebulun."},{"num":34,"verse":"At the West side, five hundred and four thousand, with their three gates, one gate of Gad, one gate of Asher, and one gate of Naphtali."},{"num":35,"verse":"It was round about eighteen thousand measures, and the name of the city from that day shall be, The Lord is there."}]