[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As thou hast believed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words were, of course, sent as a message. Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As thou didst believe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—referring to his one great act of faith.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:5-13 This centurion was a heathen, a Roman soldier. Though he was a soldier, yet he was a godly man. No man's calling or place will be an excuse for unbelief and sin. See how he states his servant's case. We should concern ourselves for the souls of our children and servants, who are spiritually sick, who feel not spiritual evils, who know not that which is spiritually good; and we should bring them to Christ by faith and prayers. Observe his self-abasement. Humble souls are made more humble by Christ's gracious dealings with them. Observe his great faith. The more diffident we are of ourselves, the stronger will be our confidence in Christ. Herein the centurion owns him to have Divine power, and a full command of all the creatures and powers of nature, as a master over his servants. Such servants we all should be to God; we must go and come, according to the directions of his word and the disposals of his providence. But when the Son of man comes he finds little faith, therefore he finds little fruit. An outward profession may cause us to be called children of the kingdom; but if we rest in that, and have nothing else to show, we shall be cast out. The servant got a cure of his disease, and the master got the approval of his faith. What was said to him, is said to all, Believe, and ye shall receive; only believe. See the power of Christ, and the power of faith. The healing of our souls is at once the effect and evidence of our interest in the blood of Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He was healed in that self-same hour - This showed decisively the goodness and power of Jesus. No miracle could be more complete. There could be no imposition or deception.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This account, or one similar to this, is found in Luke 7:1-10. There has been a difference of opinion whether the account in Luke refers to the same case as that recorded in Matthew, or whether a second centurion, encouraged by the success of the first, applied to our Saviour in a similar case and manner, and obtained the same success. In support of the supposition that they are different narratives, it is said that they disagree so far that it is impossible to reconcile them, and that it is not improbable that a similar occurrence might take place, and be attended with similar results.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This account, or one similar to this, is found in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:1-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There has been a difference of opinion whether the account in Luke refers to the same case as that recorded in Matthew, or whether a second centurion, encouraged by the success of the first, applied to our Saviour in a similar case and manner, and obtained the same success. In support of the supposition that they are different narratives, it is said that they disagree so far that it is impossible to reconcile them, and that it is not improbable that a similar occurrence might take place, and be attended with similar results.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To a plain reader, however, the narratives appear to be the same. They agree in the character of the person, the place, and apparently the time; in the same substantial structure of the account; in the expression of similar feelings, the same answers, and the same result. It is very difficult to believe that all these circumstances would coincide in two different stories.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They differ, however. Matthew says that the centurion \"came himself.\" Luke says that he at first sent elders of the Jews, and then his particular friends. He also adds that he was friendly to the Jews, and had built them a synagogue. An infidel will ask whether there is not here a palpable contradiction. In explanation of this, let it be remarked:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That the fact that the centurion came himself, supposing that to have been the fact, is no evidence that others did not come also. It was \"in\" the city. The centurion was a great favorite, and had conferred on the Jews many favors, and they would be anxious that the favor which he desired of Jesus should be granted. At his suggestion, or of their own accord, his Jewish friends might apply to Jesus, and press the subject upon him, and be anxious to represent the case as favorably as possible. All this was probably done, as it would be in any other city, in considerable haste and apparent confusion; and one observer might fix his attention strongly on one circumstance, and another on another. It is not at all improbable that the same representation and request might have been made both by the centurion and his friends. Matthew might have fixed his eye very strongly on the fact that the centurion came himself, and been particularly struck with his deportment; and Luke on the remarkable zeal shown by the friends of a pagan, the interest they took in his welfare, and the circumstance that he had done much for them. Full of these interesting circumstances, he might comparatively have overlooked the centurion himself. But,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. It was a maxim among the Jews, as it is now in law, \"that what a man does by another, he does himself.\" So, in Mark 10:35, James and John are represented as coming to the Saviour with a request: in Matthew 20:20, it appears that they presented their request through their mother. In John 4:1, Jesus is said to baptize, when, in fact, he did not do it himself, but by his disciples. In John 19:1, Pilate is said to have scourged Jesus; but he certainly did not do it with his own hands. In the case of the centurion, Matthew narrates what occurred very briefly; Luke goes more into detail, and states more of the circumstances. Matthew was intent on the great leading facts of the cure. He was studious of brevity. He did not choose to explain the particular circumstances. He says that the centurion \"made the application\" and received the answer. He does not say whether by himself or by \"an agent.\" Luke explains particularly \"how\" it was done. There is no more contradiction, therefore, than there would be if it should be said of a man in a court of law that he came and made application for a new trial, when the application was really made by his lawyer. Two men, narrating the fact, might exhibit the same variety that Matthew and Luke have done, and both be true. It should never be forgotten that \"the sacred narrative of an event is what it is stated to be by all the sacred writers; as the testimony in a court in which a case is decided is what is stated by all the credible witnesses, though one may have stated one circumstance and another another.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "2. It was a maxim among the Jews, as it is now in law, \"that what a man does by another, he does himself.\" So, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 10:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", James and John are represented as coming to the Saviour with a request: in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it appears that they presented their request through their mother. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Jesus is said to baptize, when, in fact, he did not do it himself, but by his disciples. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 19:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Pilate is said to have scourged Jesus; but he certainly did not do it with his own hands. In the case of the centurion, Matthew narrates what occurred very briefly; Luke goes more into detail, and states more of the circumstances. Matthew was intent on the great leading facts of the cure. He was studious of brevity. He did not choose to explain the particular circumstances. He says that the centurion \"made the application\" and received the answer. He does not say whether by himself or by \"an agent.\" Luke explains particularly \"how\" it was done. There is no more contradiction, therefore, than there would be if it should be said of a man in a court of law that he came and made application for a new trial, when the application was really made by his lawyer. Two men, narrating the fact, might exhibit the same variety that Matthew and Luke have done, and both be true. It should never be forgotten that \"the sacred narrative of an event is what it is stated to be by all the sacred writers; as the testimony in a court in which a case is decided is what is stated by all the credible witnesses, though one may have stated one circumstance and another another.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "One thing is most clearly shown by this narrative: that this account was not invented by the evangelists for the sake of imposition. If it had been, they would have \"agreed in all the circumstances.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "One thing is most clearly shown by this narrative: that this account was not invented by the evangelists for the sake of imposition. If it had been, they would have \"agreed in all the circumstances.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mt 8:5-13. Healing of the Centurion's Servant. ( = Lu 7:1-10).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This incident belongs to a later stage. For the exposition, see on [1234]Lu 7:1-10.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Luke saith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And they that were sent, returning to the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "house, found the servant whole that had been sick, Luke 7:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "house, found the servant whole that had been sick, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; so as it seemeth that what Christ said unto the centurion, must be interpreted, to those whom the centurion sent in his name. Go your way, your business is done, the centurion’s faith hath obtained, it shall be done to him as he hath ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "believed; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where believing must signify, a certain persuasion of the power of Christ, with a relying on this mercy and goodness. The proximate object of faith is some word of God. How far this centurion was acquainted with the oracles of the Old Testament (though he lived amongst the Jews, and, as appears by his building a synagogue for them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 7:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", had a kindness for their religion) I cannot tell. It is most probable that he had some immediate revelation of God concerning Christ, which he is here said to have believed, and to have had a full persuasion of and trusted in. All revelations of God are the object of faith, though the Scriptures, being now written, are to us that have them the tests and touchstones to try such impressions by. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As thou believest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not because thou believest. Our faith is not meritorious of the least mercies, built is an exercise of grace which gives glory to God, and receiveth the reward not of debt but of grace. The miracle appeared in that the disease was of an incurable nature, and the cure was wrought without application of means, and in such a moment of time as means, though used, could not have wrought it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jesus said unto the centurion,.... Christ having finished the digression, returns an answer to the centurion, agreeably to his desire, saying to him, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "go thy way; not as displeased with him, but as granting his request: for it follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and as thou hast believed, so be it done unto thee. As he had faith to believe, that Christ could cure his servant by a word speaking, it was done accordingly. Christ by his almighty \"fiat\" said, let him be healed, and he was healed: just as God in the creation said, \"let there be light, and there was light\". He does not say according to thy prayer, or according to thy righteousness, and goodness, but according to thy faith: and it is further to be observed, that this cure was wrought, not so much for the sake of the servant, as his master; and therefore Christ says, \"be it done unto thee\"; let him be healed for thy sake, and restored unto thee, to thy use, profit, and advantage. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his servant was healed in the selfsame hour, at the very exact time, even in that moment. Some copies add, \"and when the centurion returned to his house, in the selfsame hour he found his servant healed\"; which the Ethiopic version has, and it agrees with Luke 7:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And his servant was healed in the selfsame hour, at the very exact time, even in that moment. Some copies add, \"and when the centurion returned to his house, in the selfsame hour he found his servant healed\"; which the Ethiopic version has, and it agrees with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jesus said unto the centurion, Go thy way; and as thou hast believed, so be it done unto thee. And his servant was healed in the selfsame hour.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐν τῇ ὥρᾳ ἐκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὥρᾳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is emphatic. In the very ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in which Jesus was uttering these words, the slave became whole, and that through the divine power of Jesus operating upon him from a distance, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. The narrative is to be explained neither by a desire to present an enlarging view of the miraculous power of Jesus (Strauss), nor as a parable (Weisse), nor as a historical picture of the way in which God’s word acts at a distance upon the Gentiles (Volkmar), nor as being the story of the woman of Canaan metamorphosed (Bruno Bauer); nor are we to construe the proceeding as the providential fulfilment of a general but sure ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "promise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " given by Jesus (Ammon), or, in that case, to have recourse to the supposition that the healing was effected through sending an ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "intermediate agent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Paulus). But if, as is alleged, Jesus in His reply only used an affirmation which was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "halfway",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " between a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "benediction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " depending on God and the faith of the house, and a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "positive act",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Keim), it is impossible to reconcile with such vagueness of meaning the simple imperative and the no less impartial statement of the result. Moreover, there exists as little a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "psychical contact",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " between the sick man and Jesus, as at the healing of the daughter of the woman of Canaan, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 15:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "slave",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was cured in consideration of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "centurion’s",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὕπαγε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.: compressed impassioned utterance, spoken under emotion = Go, as thou hast believed be it to thee; cure as thorough as thy faith. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " before ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in T. R. is the addition of prosaic scribes. Men speaking under emotion discard expletives.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Weizsäcker (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Untersuchungen über die Evang. Gesch.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 50) remarks on the felicitous juxtaposition of these two narratives relatively to one another and to the Sermon on Mount. “In the first Jesus has to do with a Jew, and demands of him observance of the law. In this respect the second serves as a companion piece, the subject of healing being a heathen, giving occasion for a word as to the position of heathens. The two combined are happily appended to a discourse in which Jesus states His attitude to the law, forming as complements of each other a commentary on the statement.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὡς ἐπίστευσας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as thou hast believed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A bountiful concession.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Matthew only. The parallel passage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", gives the result found by the messengers on their return. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Jesus said unto the centurion, Go thy way; and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (omitted by the Revised Version) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "as thou hast believed, so be it done unto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "As.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Not strictly proportionate, but in the same way as (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 18:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") thou hast now believed, be it done unto thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And his servant was healed in the selfsame",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") hour. Matthew 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Was healed (ἰάθη)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Note that the stronger word of the centurion (Matthew 8:8) is used here. Where Christ tends, he heals. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Note that the stronger word of the centurion (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is used here. Where Christ tends, he heals. ",
            "children": []
          }
        ]
      }
    ]
  }
]