[{"header":"On Defilement"},{"num":5,"verse":"Then the Lord spoke to Moses, saying,"},{"num":2,"verse":"“Command the sons of Israel that they send away from the camp everyone with leprosy, everyone having a discharge, and everyone who is unclean because of contact with a dead person."},{"num":3,"verse":"You shall send away both male and female; you shall send them outside the camp so that they do not defile their camp where I dwell in their midst.”"},{"num":4,"verse":"And the sons of Israel did so and sent them outside the camp; just as the Lord had spoken to Moses, that is what the sons of Israel did."},{"num":5,"verse":"Then the Lord spoke to Moses, saying,"},{"num":6,"verse":"“Speak to the sons of Israel: ‘When a man or woman commits any of the sins of mankind, acting unfaithfully against the Lord, and that person is guilty,"},{"num":7,"verse":"then he shall confess his sin which he has committed, and he shall make restitution in full for his wrong and add to it a fifth of it, and give it to him whom he has wronged."},{"num":8,"verse":"But if the person has no redeemer to whom restitution may be made for the wrong, the restitution which is made for the wrong must go to the Lord for the priest, besides the ram of atonement, by which atonement is made for him."},{"num":9,"verse":"Also every contribution pertaining to all the holy gifts of the sons of Israel, which they offer to the priest, shall be his."},{"num":10,"verse":"So every person’s holy gifts shall be his; whatever anyone gives to the priest, it becomes his.’”"},{"header":"The Adultery Test"},{"num":11,"verse":"Then the Lord spoke to Moses, saying,"},{"num":12,"verse":"“Speak to the sons of Israel and say to them, ‘If any man’s wife goes astray and is unfaithful to him,"},{"num":13,"verse":"and a man has sexual relations with her and it is hidden from the eyes of her husband and she remains undiscovered, although she has defiled herself, and there is no witness against her and she has not been caught in the act,"},{"num":14,"verse":"if an attitude of jealousy comes over him and he is jealous of his wife when she has defiled herself, or if an attitude of jealousy comes over him and he is jealous of his wife when she has not defiled herself,"},{"num":15,"verse":"the man shall then bring his wife to the priest, and shall bring as an offering for her a tenth of an ephah of barley meal; he shall not pour oil on it nor put frankincense on it, because it is a grain offering of jealousy, a grain offering of reminder, a reminder of wrongdoing."},{"num":16,"verse":"‘Then the priest shall bring her forward and have her stand before the Lord,"},{"num":17,"verse":"and the priest shall take holy water in an earthenware container; and he shall take some of the dust that is on the floor of the tabernacle and put it in the water."},{"num":18,"verse":"The priest shall then have the woman stand before the Lord and let down the hair of the woman’s head, and place the grain offering of reminder in her hands, that is, the grain offering of jealousy; and in the hand of the priest is to be the water of bitterness that brings a curse."},{"num":19,"verse":"And the priest shall have her take an oath and shall say to the woman, “If no man has had sexual relations with you and if you have not gone astray into uncleanness, as you are under the authority of your husband, be immune to this water of bitterness that brings a curse;"},{"num":20,"verse":"if, however, you have gone astray, though under the authority of your husband, and if you have defiled yourself and a man other than your husband has had sexual intercourse with you”"},{"num":21,"verse":"(then the priest shall have the woman swear with the oath of the curse, and the priest shall say to the woman), “may the Lord make you a curse and an oath among your people by the Lord’s making your thigh shriveled and your belly swollen;"},{"num":22,"verse":"and this water that brings a curse shall go into your stomach, to make your belly swell up and your thigh shrivel.” And the woman shall say, “Amen, Amen.”"},{"num":23,"verse":"‘The priest shall then write these curses on a scroll, and he shall wash them off into the water of bitterness."},{"num":24,"verse":"Then he shall make the woman drink the water of bitterness that brings a curse, so that the water which brings a curse will go into her and cause bitterness."},{"num":25,"verse":"And the priest shall take the grain offering of jealousy from the woman’s hand, and he shall wave the grain offering before the Lord and bring it to the altar;"},{"num":26,"verse":"and the priest shall take a handful of the grain offering as its reminder offering and offer it up in smoke on the altar, and afterward he shall make the woman drink the water."},{"num":27,"verse":"When he has made her drink the water, then it will come about, if she has defiled herself and has been unfaithful to her husband, that the water which brings a curse will go into her and cause bitterness, and her belly will swell up and her thigh will shrivel, and the woman will become a curse among her people."},{"num":28,"verse":"But if the woman has not defiled herself and is clean, she will be immune and conceive children."},{"num":29,"verse":"‘This is the law of jealousy: when a wife, who is under the authority of her husband, goes astray and defiles herself,"},{"num":30,"verse":"or when an attitude of jealousy comes over a man and he is jealous of his wife, he shall then have the woman stand before the Lord, and the priest shall apply all of this law to her."},{"num":31,"verse":"The man, moreover, will be free of guilt, but that woman shall bear the consequences of her guilt.’”"}]