[[],[{"type":"header","content":"Jethro, Moses’ Father-in-law"},{"type":"prose","content":"Now Jethro (Reuel), the priest of Midian, Moses’ father-in-law, heard of all that God had done for Moses and for Israel His people, and that the LORD had brought Israel out of Egypt. "}],[{"type":"prose","content":"Then Jethro, Moses’ father-in-law, took Moses’ wife Zipporah, after he had sent her away [from Egypt], "}],[{"type":"prose","content":"along with her two sons, of whom one was named Gershom (stranger), for Moses said, “I have been a stranger in a foreign land.” "}],[{"type":"prose","content":"The other [son] was named Eliezer (my God is help), for , “The God of my father was my help, and He rescued me from the sword of Pharaoh.”"}],[{"type":"prose","content":"Then Jethro, his father-in-law, came with Moses’ sons and his wife to [join] Moses in the wilderness where he was camped, at the mountain of God [that is, Mt. Sinai in Horeb]. "}],[{"type":"prose","content":"He sent a message to Moses, “I, your father-in-law Jethro, am coming to you with your wife and her two sons [who are] with her.” "}],[{"type":"prose","content":"So Moses went out to meet his father-in-law, and he bowed down [in respect] and kissed him. They asked each other about their well-being and went into the tent. "}],[{"type":"prose","content":"Moses told his father-in-law about all that the LORD had done to Pharaoh and the Egyptians for Israel’s sake, and about all the hardship that had happened during the journey, and how the LORD had rescued them. "}],[{"type":"prose","content":"Jethro rejoiced over all the good things the LORD had done to Israel, in that He had rescued them from the hand of the Egyptians. "}],[{"type":"prose","content":"Jethro said, “Blessed be the LORD, who has rescued you from the hand of the Egyptians and from the hand of Pharaoh, and who has rescued the people from under the hand of the Egyptians. "}],[{"type":"prose","content":"Now I know that the LORD is greater than all gods; indeed, it was proven when they acted insolently toward Israel [and the LORD showed Himself infinitely superior to all their gods].” "}],[{"type":"prose","content":"Then Jethro, Moses’ father-in-law, took a burnt offering and [other] sacrifices [to offer] to God, and Aaron came with all the elders of Israel to eat a meal with Moses’ father-in-law before God."}],[{"type":"prose","content":"Now the next day Moses sat to judge [the disputes] the people [had with one another], and the people stood around Moses from dawn to dusk. "}],[{"type":"prose","content":"When Moses’ father-in-law saw everything that he was doing for the people, he said, “What is this that you are doing for the people? Why are you sitting alone [as a judge] with all the people standing around you from dawn to dusk?” "}],[{"type":"prose","content":"Moses said to his father-in-law, “Because the people come to me to ask [about the will] of God. "}],[{"type":"prose","content":"When they have a dispute they come to me, and I judge between a man and his neighbor and I make known the statutes of God and His laws.”"}],[{"type":"header","content":"Jethro Counsels Moses"},{"type":"prose","content":"Moses’ father-in-law said to him, “The thing that you are doing is not good. "}],[{"type":"prose","content":"You will certainly wear out both yourself and these people who are with you, because the task is too heavy for you [to bear]; you cannot do it alone. "}],[{"type":"prose","content":"Now listen to me; I will advise you, and may God be with you [to confirm my advice]. You shall represent the people before God. You shall bring their disputes  causes to Him. "}],[{"type":"prose","content":"You shall teach them the decrees and laws. You shall show them the way they are to live and the work they are to do. "}],[{"type":"prose","content":"Furthermore, you shall select from all the people competent men who [reverently] fear God, men of truth, those who hate dishonest gain; you shall place these over the people as leaders of thousands, of hundreds, of fifties and of tens. "}],[{"type":"prose","content":"They shall judge the people at all times; have them bring every major dispute to you, but let them judge every minor dispute themselves. So it will be easier for you, and they will bear  with you. "}],[{"type":"prose","content":"If you will do this thing and God so commands you, then you will be able to endure [the responsibility], and all these people will also go [back] to their tents in peace.”"}],[{"type":"prose","content":"So Moses listened to his father-in-law and did everything that he had said. "}],[{"type":"prose","content":"Moses chose able men from all Israel and made them heads over the people, leaders of thousands, of hundreds, of fifties and of tens [from the highest to the lowest judicial levels]. "}],[{"type":"prose","content":"And they judged the people at all times; they would bring the difficult cases to Moses, but every minor dispute they judged  decided themselves. "}],[{"type":"prose","content":"Then Moses said goodbye to his father-in-law, and Jethro went back to his own land (Midian)."}]]