[{"header":"Sharing the burden of leadership"},{"num":18,"verse":"Jethro, Midian’s priest and Moses’ father-in-law, heard about everything that God had done for Moses and for God’s people Israel, how the Lord had brought Israel out of Egypt."},{"num":2,"verse":"Moses’ father-in-law Jethro took with him Zipporah, Moses’ wife whom he had sent away,"},{"num":3,"verse":"along with her two sons. One was named Gershom because he said, “I have been an immigrant living in a foreign land.”"},{"num":4,"verse":"The other was named Eliezer because he said, “The God of my ancestors was my helper who rescued me from Pharaoh’s sword.”"},{"num":5,"verse":"Jethro, Moses’ father-in-law, brought Moses’ sons and wife back to him in the desert where he had set up camp at God’s mountain."},{"num":6,"verse":"He sent word to Moses: “I, your father-in-law Jethro, am coming to you along with your wife and her two sons.”"},{"num":7,"verse":"Moses went out to meet his father-in-law, and he bowed down and kissed him. They asked each other how they were doing, and then they went into the tent."},{"num":8,"verse":"Moses then told his father-in-law everything that the Lord had done to Pharaoh and to the Egyptians on Israel’s behalf, all the difficulty they had on their journey, and how the Lord had rescued them."},{"num":9,"verse":"Jethro was glad about all the good things that the Lord had done for Israel in saving them from the Egyptians’ power."},{"num":10,"verse":"Jethro said, “Bless the Lord who rescued you from the Egyptians’ power and from Pharaoh’s power, who rescued the people from Egypt’s oppressive power."},{"num":11,"verse":"Now I know that the Lord is greater than all the gods, because of what happened when the Egyptians plotted against them.”"},{"num":12,"verse":"Then Jethro, Moses’ father-in-law, brought an entirely burned offering and sacrifices to God. Aaron came with all of Israel’s elders to eat a meal with Moses’ father-in-law in God’s presence."},{"num":13,"verse":"The next day Moses sat as a judge for the people, while the people stood around Moses from morning until evening."},{"num":14,"verse":"When Moses’ father-in-law saw all that he was doing for the people, he said, “What’s this that you are doing for the people? Why do you sit alone, while all the people are standing around you from morning until evening?”"},{"num":15,"verse":"Moses said to his father-in-law, “Because the people come to me to inquire of God."},{"num":16,"verse":"When a conflict arises between them, they come to me and I judge between the two of them. I also teach them God’s regulations and instructions.”"},{"num":17,"verse":"Moses’ father-in-law said to him, “What you are doing isn’t good."},{"num":18,"verse":"You will end up totally wearing yourself out, both you and these people who are with you. The work is too difficult for you. You can’t do it alone."},{"num":19,"verse":"Now listen to me and let me give you some advice. And may God be with you! Your role should be to represent the people before God. You should bring their disputes before God yourself."},{"num":20,"verse":"Explain the regulations and instructions to them. Let them know the way they are supposed to go and the things they are supposed to do."},{"num":21,"verse":"But you should also look among all the people for capable persons who respect God. They should be trustworthy and not corrupt. Set these persons over the people as officers of groups of thousands, hundreds, fifties, and tens."},{"num":22,"verse":"Let them sit as judges for the people at all times. They should bring every major dispute to you, but they should decide all of the minor cases themselves. This will be much easier for you, and they will share your load."},{"num":23,"verse":"If you do this and God directs you, then you will be able to endure. And all these people will be able to go back to their homes much happier.”"},{"num":24,"verse":"Moses listened to his father-in-law’s suggestions and did everything that he had said."},{"num":25,"verse":"Moses chose capable persons from all Israel and set them as leaders over the people, as officers over groups of thousands, hundreds, fifties, and tens."},{"num":26,"verse":"They acted as judges for the people at all times. They would refer the hard cases to Moses, but all of the minor cases they decided themselves."},{"num":27,"verse":"Then Moses said good-bye to his father-in-law, and Jethro went back to his own country."}]