[{"header":"Jethro Counsels Moses"},{"num":18,"verse":"Jethro, the priest of Midian, Moses’ father-in-law, heard of all that God had done for Moses, and for Israel His people, and that the Lord had brought Israel out of Egypt."},{"num":2,"verse":"Then Jethro, Moses’ father-in-law, took Zipporah, Moses’ wife, after he had sent her back, "},{"num":3,"verse":"and her two sons, one of whom was named Gershom; for he said, “I have been a sojourner in a foreign land.” "},{"num":4,"verse":"And the name of the other was Eliezer, for he said, “The God of my father was my help, and He delivered me from the sword of Pharaoh.”"},{"num":5,"verse":"Then Jethro, Moses’ father-in-law, came with his sons and his wife to Moses in the wilderness, where he camped at the mountain of God. "},{"num":6,"verse":"And he said to Moses, “I, your father-in-law, Jethro, am coming to you, and your wife, and her two sons with her.”"},{"num":7,"verse":"Then Moses went out to meet his father-in-law, and bowed down and kissed him; and they asked each other of the other’s welfare, and then they went into the tent. "},{"num":8,"verse":"Moses told his father-in-law all that the Lord had done to Pharaoh and to the Egyptians for Israel’s sake, and all the hardships that had come on them along the way, and how the Lord delivered them."},{"num":9,"verse":"Jethro rejoiced because of all the goodness which the Lord had done for Israel, whom He had delivered out of the hand of the Egyptians. "},{"num":10,"verse":"Jethro said, “The Lord be blessed, who has delivered you out of the hand of the Egyptians, and out of the hand of Pharaoh, who has delivered the people from under the hand of the Egyptians. "},{"num":11,"verse":"Now I know that the Lord is greater than all gods, for in the matter in which they treated the people insolently, He was above them.” "},{"num":12,"verse":"Then Jethro, Moses’ father-in-law, took a burnt offering and sacrifices for God, and Aaron and all the elders of Israel came to eat bread with Moses’ father-in-law before God."},{"num":13,"verse":"On the next day, Moses sat to judge the people, and the people stood around Moses from the morning until the evening. "},{"num":14,"verse":"When Moses’ father-in-law saw all that he was doing for the people, he said, “What is this thing that you are doing for the people? Why are you sitting by yourself while all the people stand around you from morning until evening?”"},{"num":15,"verse":"Then Moses said to his father-in-law, “Because the people come to me to inquire of God. "},{"num":16,"verse":"When they have a dispute, it comes to me, and I judge between a man and his neighbor, and I make known the statutes of God and His laws.”"},{"num":17,"verse":"Moses’ father-in-law said to him, “What you are doing is not good. "},{"num":18,"verse":"You will surely wear yourself out, both you, and these people who are with you, for this thing is too heavy for you. You are not able to do it by yourself. "},{"num":19,"verse":"Now listen to me, I will advise you, and may God be with you: You be a representative for the people to God so that you may bring their disputes to God. "},{"num":20,"verse":"And you shall teach them the statutes and laws and shall show them the way in which they must walk and the work that they must do. "},{"num":21,"verse":"Moreover, you shall choose out of all the people capable men who fear God, men of truth, hating dishonest gain, and place these men over them, to be rulers of thousands, rulers of hundreds, rulers of fifties, and rulers of tens. "},{"num":22,"verse":"Let them judge the people at all times, and let it be that every difficult matter they shall bring to you, but every small matter they shall judge, so that it will be easier for you, and they will bear the burden with you. "},{"num":23,"verse":"If you shall do this thing and God commands you so, then you will be able to endure, and all these people also will go to their place in peace.”"},{"num":24,"verse":"So Moses listened to his father-in-law and did everything that he had said. "},{"num":25,"verse":"Moses chose capable men out of all Israel and made them heads over the people, rulers of thousands, rulers of hundreds, rulers of fifties, and rulers of tens. "},{"num":26,"verse":"They judged the people at all times. They brought the difficult cases to Moses, but they judged every small matter themselves."},{"num":27,"verse":"Moses sent out his father-in-law, and he went his way to his own land."}]