[[],[{"type":"header","content":"Jethro’s Visit to Moses"},{"type":"prose","content":"Moses’ father-in-law, Jethro, the priest of Midian, heard about everything God had done for Moses and his people, the Israelites. He heard especially about how the  had rescued them from Egypt."}],[{"type":"prose","content":"Earlier, Moses had sent his wife, Zipporah, and his two sons back to Jethro, who had taken them in."}],[{"type":"prose","content":"(Moses’ first son was named Gershom, for Moses had said when the boy was born, “I have been a foreigner in a foreign land.”"}],[{"type":"prose","content":"His second son was named Eliezer, for Moses had said, “The God of my ancestors was my helper; he rescued me from the sword of Pharaoh.”)"}],[{"type":"prose","content":"Jethro, Moses’ father-in-law, now came to visit Moses in the wilderness. He brought Moses’ wife and two sons with him, and they arrived while Moses and the people were camped near the mountain of God."}],[{"type":"prose","content":"Jethro had sent a message to Moses, saying, “I, Jethro, your father-in-law, am coming to see you with your wife and your two sons.”"}],[{"type":"prose","content":"So Moses went out to meet his father-in-law. He bowed low and kissed him. They asked about each other’s welfare and then went into Moses’ tent."}],[{"type":"prose","content":"Moses told his father-in-law everything the  had done to Pharaoh and Egypt on behalf of Israel. He also told about all the hardships they had experienced along the way and how the  had rescued his people from all their troubles."}],[{"type":"prose","content":"Jethro was delighted when he heard about all the good things the  had done for Israel as he rescued them from the hand of the Egyptians."}],[{"type":"prose","content":"“Praise the ,” Jethro said, “for he has rescued you from the Egyptians and from Pharaoh. Yes, he has rescued Israel from the powerful hand of Egypt!"}],[{"type":"prose","content":"I know now that the  is greater than all other gods, because he rescued his people from the oppression of the proud Egyptians.”"}],[{"type":"prose","content":"Then Jethro, Moses’ father-in-law, brought a burnt offering and sacrifices to God. Aaron and all the elders of Israel came out and joined him in a sacrificial meal in God’s presence."},{"type":"header","content":"Jethro’s Wise Advice"}],[{"type":"prose","content":"The next day, Moses took his seat to hear the people’s disputes against each other. They waited before him from morning till evening."}],[{"type":"prose","content":"When Moses’ father-in-law saw all that Moses was doing for the people, he asked, “What are you really accomplishing here? Why are you trying to do all this alone while everyone stands around you from morning till evening?”"}],[{"type":"prose","content":"Moses replied, “Because the people come to me to get a ruling from God."}],[{"type":"prose","content":"When a dispute arises, they come to me, and I am the one who settles the case between the quarreling parties. I inform the people of God’s decrees and give them his instructions.”"}],[{"type":"prose","content":"“This is not good!” Moses’ father-in-law exclaimed."}],[{"type":"prose","content":"“You’re going to wear yourself out—and the people, too. This job is too heavy a burden for you to handle all by yourself."}],[{"type":"prose","content":"Now listen to me, and let me give you a word of advice, and may God be with you. You should continue to be the people’s representative before God, bringing their disputes to him."}],[{"type":"prose","content":"Teach them God’s decrees, and give them his instructions. Show them how to conduct their lives."}],[{"type":"prose","content":"But select from all the people some capable, honest men who fear God and hate bribes. Appoint them as leaders over groups of one thousand, one hundred, fifty, and ten."}],[{"type":"prose","content":"They should always be available to solve the people’s common disputes, but have them bring the major cases to you. Let the leaders decide the smaller matters themselves. They will help you carry the load, making the task easier for you."}],[{"type":"prose","content":"If you follow this advice, and if God commands you to do so, then you will be able to endure the pressures, and all these people will go home in peace.”"}],[{"type":"prose","content":"Moses listened to his father-in-law’s advice and followed his suggestions."}],[{"type":"prose","content":"He chose capable men from all over Israel and appointed them as leaders over the people. He put them in charge of groups of one thousand, one hundred, fifty, and ten."}],[{"type":"prose","content":"These men were always available to solve the people’s common disputes. They brought the major cases to Moses, but they took care of the smaller matters themselves."}],[{"type":"prose","content":"Soon after this, Moses said good-bye to his father-in-law, who returned to his own land."}]]