[{"header":"Jethro Helps Moses"},{"num":18,"verse":"Moses’ father-in-law, Jethro, the religious leader of Midian, heard about all that God had done for Moses and for Israel His people. He heard about how the Lord had brought Israel out of Egypt. "},{"num":2,"verse":"Moses’ father-in-law, Jethro, had taken Moses’ wife, Zipporah, after Moses had sent her away. "},{"num":3,"verse":"And he had taken her two sons. One was given the name Gershom, for he said, “I have been a stranger in a strange land.” "},{"num":4,"verse":"The other was given the name Eliezer, for he said, “The God of my father was my help. And He saved me from the sword of Pharaoh.”"},{"num":5,"verse":"Then Moses’ father-in-law, Jethro, came to Moses with his sons and his wife to the desert by the mountain of God where he was staying. "},{"num":6,"verse":"He sent the news to Moses, “I, your father-in-law, Jethro, am coming to you with your wife and her two sons with her.” "},{"num":7,"verse":"Then Moses went to meet his father-in-law. He bowed down and kissed him. They asked each other if all was well, and went into the tent. "},{"num":8,"verse":"Moses told his father-in-law all the Lord had done to Pharaoh and the Egyptians because of Israel. He told him about how they had suffered on the way, and how the Lord had saved them. "},{"num":9,"verse":"Jethro was glad because of all the good things the Lord had done for Israel in saving them from the hand of the Egyptians. "},{"num":10,"verse":"So Jethro said, “Honor and thanks be to the Lord, Who saved you from the hand of the Egyptians and from the hand of Pharaoh, and Who made you free from the power of Egypt. "},{"num":11,"verse":"Now I know that the Lord is greater than all the gods. It was proven when they acted in their pride against the people.” "},{"num":12,"verse":"Then Moses’ father-in-law, Jethro, gave a burnt gift in worship to God. And Aaron came with all the leaders of Israel to eat bread with Moses’ father-in-law before God."},{"header":"Men Who Judge"},{"num":13,"verse":"The next day Moses sat to judge the people. And the people stood around Moses from morning until evening."},{"num":14,"verse":"When Moses’ father-in-law saw all he was doing for the people, he said, “What is this that you do for the people? Why do you sit alone and judge and all the people stand around you from morning until evening?” "},{"num":15,"verse":"Moses said to his father-in-law, “Because the people come to me to learn God’s will. "},{"num":16,"verse":"When they argue, they come to me. And I judge between a man and his neighbor. I teach them the Laws of God.” "},{"num":17,"verse":"Moses’ father-in-law said to him, “What you are doing is not good. "},{"num":18,"verse":"You and the people with you will become tired and weak. For the work is too much for you. You cannot do it alone. "},{"num":19,"verse":"Now listen to me. I will tell you what you should do, and God be with you. You speak for the people before God. Bring the troubles to God. "},{"num":20,"verse":"Then teach them the Laws. Make them know the way they must walk and the work they must do. "},{"num":21,"verse":"Also, you should choose from the people able men who fear God, men of truth who hate to get things by doing wrong. Have these men rule over the people, as leaders of thousands, of hundreds, of fifties and of tens. "},{"num":22,"verse":"Let them judge the people at all times. Have all the big troubles brought to you. But have them judge the small troubles. So it will be easier for you. They will share the work with you. "},{"num":23,"verse":"If you do this and God tells you to do it, then you will be able to keep your strength. And all these people will go to their place in peace.”"},{"num":24,"verse":"Moses listened to his father-in-law, and did all that he had said. "},{"num":25,"verse":"Moses chose able men out of all Israel. And he made them leaders over the people, leaders of thousands, of hundreds, of fifties and of tens. "},{"num":26,"verse":"They judged the people at all times. They would bring the big troubles to Moses. But they would judge every small trouble themselves."},{"num":27,"verse":"Then Moses let his father-in-law return to his own land."}]