[[],[{"type":"header","content":"The Sin of Peor"},{"type":"prose","content":"Israel settled  remained in Shittim, and the people began to play the prostitute with the women of Moab [by being unfaithful to God]. "}],[{"type":"prose","content":"For they invited the Israelites to the sacrifices of their gods, and the Israelites ate [food offered to idols] and bowed down to Moab’s gods. "}],[{"type":"prose","content":"So Israel joined themselves to Baal of Peor [in worship]. And the anger of the LORD was kindled against Israel. "}],[{"type":"prose","content":"The LORD said to Moses, “Take all the leaders of the people [who have committed sin with the Moabites], and execute them in broad daylight before the LORD, so that the fierce anger of the LORD may turn away from Israel.” "}],[{"type":"prose","content":"So Moses said to the judges of Israel, “Each one of you must kill his men who have joined themselves to Baal of Peor [in worship].”"}],[{"type":"prose","content":"Then one of the Israelites came and presented to his relatives a Midianite woman, in the sight of Moses and the whole congregation of the Israelites, while they were weeping [over God’s judgment] at the doorway of the Tent of Meeting (tabernacle). "}],[{"type":"prose","content":"When Phinehas the son of Eleazar, the son of Aaron the priest, saw this, he left the congregation and took a spear in his hand, "}],[{"type":"prose","content":"and he went after the man of Israel into the tent, and pierced both of them through the body, the man of Israel and the woman. Then the plague on the Israelites stopped. "}],[{"type":"prose","content":"Nevertheless, those [Israelites] who died in the plague numbered 24,000."}],[{"type":"header","content":"The Zeal of Phinehas"},{"type":"prose","content":"Then the LORD spoke to Moses, saying, "}],[{"type":"prose","content":"“Phinehas the son of Eleazar, the son of Aaron the priest, has turned my wrath away from the Israelites because he was jealous with My jealousy among them, so that I did not destroy the Israelites in My jealousy. "}],[{"type":"prose","content":"Therefore say, ‘Behold, I give to Phinehas My covenant of peace. "}],[{"type":"prose","content":"And it shall be for him and his descendants after him, a covenant of an everlasting priesthood, because he was jealous (impassioned) for [the unique honor and respect owed to] his God and made atonement for the sons of Israel.’”"}],[{"type":"prose","content":"Now the name of the man of Israel who was killed with the Midianite woman was Zimri the son of Salu, a leader of a father’s household among the Simeonites. "}],[{"type":"prose","content":"The name of the Midianite woman who was killed was Cozbi the daughter of Zur, who was the tribal head of a father’s household in Midian."}],[{"type":"prose","content":"Then the LORD spoke to Moses, saying, "}],[{"type":"prose","content":"“Provoke hostilities with the Midianites and attack them, "}],[{"type":"prose","content":"for they harass you with their tricks, the tricks with which they have deceived you in the matter [of the Baal] of Peor, and in the matter of Cozbi, the daughter of the leader of Midian, their sister, who was killed on the day of the plague because [of the Baal] of Peor.”"}]]