[{"header":"Moab Leads Israel Astray"},{"num":25,"verse":"Israel was staying in Shittim. The men of Israel began to commit sexual sins with the women of Moab. "},{"num":2,"verse":"The women invited the men to feasts and sacrifices to honor their gods. The people ate the sacrifices and bowed down in front of the statues of those gods. "},{"num":3,"verse":"So Israel joined in worshiping the god named Baal that was worshiped at Peor. The Lord became very angry with Israel."},{"num":4,"verse":"The Lord said to Moses, “Take all the leaders of these people. Kill them. Put their dead bodies out in the open. I want to see you do it in the middle of the day. Then I will not be angry with Israel.”"},{"num":5,"verse":"So Moses spoke to Israel’s judges. He said, “Some of your people have joined in worshiping the god named Baal that is worshiped at Peor. Each of you must kill the people in your tribe who have done that.”"},{"num":6,"verse":"Then an Israelite man brought into the camp a Midianite woman. He did it right in front of the eyes of Moses and the whole community of Israel. They were weeping at the entrance to the tent of meeting. "},{"num":7,"verse":"Phinehas was a priest. He was the son of Eleazar, the son of Aaron. When Phinehas saw what had happened, he left the people. He took a spear in his hand. "},{"num":8,"verse":"He followed the man into the tent. Phinehas stuck the spear through the man and into the woman’s stomach. Then the Lord stopped the plague against the Israelites. "},{"num":9,"verse":"But the plague had already killed 24,000 of them."},{"num":10,"verse":"The Lord said to Moses, "},{"num":11,"verse":"“Phinehas is a priest. He is the son of Eleazar, the son of Aaron. Phinehas has turned my anger away from the Israelites. I am committed to making sure I am honored among them. And he is as committed as I am. So even though I was angry with them, I did not put an end to them. "},{"num":12,"verse":"So tell Phinehas I am making my covenant with him. It is my promise to give him peace. "},{"num":13,"verse":"He and his sons after him will have a covenant to be priests forever. That is because he was committed to making sure that I, his God, was honored. In that way he paid for the sin of the Israelites.”"},{"num":14,"verse":"The name of the Israelite man who was killed was Zimri. He was the son of Salu. Zimri was killed along with the Midianite woman. Salu was a family leader in the tribe of Simeon. "},{"num":15,"verse":"The name of the Midianite woman who was killed was Kozbi. She was the daughter of Zur. He was the chief of a Midianite family."},{"num":16,"verse":"The Lord spoke to Moses. He said, "},{"num":17,"verse":"“Treat the Midianites just as you would treat enemies. Kill them. "},{"num":18,"verse":"After all, they treated you like enemies. They tricked you into worshiping the god named Baal that is worshiped at Peor. They also tricked you because of what Kozbi did. She was the woman killed when the plague came that was connected with Peor. Kozbi was the daughter of a Midianite leader.”"}]