[[],[{"type":"header","content":"Worship of Baal of Peor"},{"type":"prose","content":"While Israel was staying at Shittim, the people began to have sexual relations with the women of Moab. "}],[{"type":"prose","content":"These invited the people to the sacrifices of their gods, and the people ate and bowed down to their gods. "}],[{"type":"prose","content":"Thus Israel yoked itself to the Baal of Peor, and the LORD’s anger was kindled against Israel. "}],[{"type":"prose","content":"The LORD said to Moses, “Take all the chiefs of the people, and impale them in the sun before the LORD, in order that the fierce anger of the LORD may turn away from Israel.” "}],[{"type":"prose","content":"And Moses said to the judges of Israel, “Each of you shall kill any of your people who have yoked themselves to the Baal of Peor.”"}],[{"type":"prose","content":"Just then one of the Israelites came and brought a Midianite woman into his family, in the sight of Moses and in the sight of the whole congregation of the Israelites, while they were weeping at the entrance of the tent of meeting. "}],[{"type":"prose","content":"When Phinehas son of Eleazar, son of Aaron the priest, saw it, he got up and left the congregation. Taking a spear in his hand, "}],[{"type":"prose","content":"he went after the Israelite man into the tent, and pierced the two of them, the Israelite and the woman, through the belly. So the plague was stopped among the people of Israel. "}],[{"type":"prose","content":"Nevertheless those that died by the plague were twenty-four thousand."}],[{"type":"prose","content":"The LORD spoke to Moses, saying: "}],[{"type":"prose","content":"“Phinehas son of Eleazar, son of Aaron the priest, has turned back my wrath from the Israelites by manifesting such zeal among them on my behalf that in my jealousy I did not consume the Israelites. "}],[{"type":"prose","content":"Therefore say, ‘I hereby grant him my covenant of peace. "}],[{"type":"prose","content":"It shall be for him and for his descendants after him a covenant of perpetual priesthood, because he was zealous for his God, and made atonement for the Israelites.’”"}],[{"type":"prose","content":"The name of the slain Israelite man, who was killed with the Midianite woman, was Zimri son of Salu, head of an ancestral house belonging to the Simeonites. "}],[{"type":"prose","content":"The name of the Midianite woman who was killed was Cozbi daughter of Zur, who was the head of a clan, an ancestral house in Midian."}],[{"type":"prose","content":"The LORD said to Moses, "}],[{"type":"prose","content":"“Harass the Midianites, and defeat them; "}],[{"type":"prose","content":"for they have harassed you by the trickery with which they deceived you in the affair of Peor, and in the affair of Cozbi, the daughter of a leader of Midian, their sister; she was killed on the day of the plague that resulted from Peor.”"}]]