[{"header":"Moses sets up the dwelling"},{"num":40,"verse":"The Lord spoke to Moses:"},{"num":2,"verse":"Set up the meeting tent dwelling on the first day of the first month."},{"num":3,"verse":"Place the chest containing the covenant inside the dwelling. Hide the chest from view with the veil."},{"num":4,"verse":"Bring in the table and arrange its items. Bring in the lampstand and set up its lamps."},{"num":5,"verse":"Place the gold altar for burning incense in front of the chest containing the covenant. Set up the screen at the dwelling’s entrance."},{"num":6,"verse":"Put the altar for entirely burned offerings in front of the entrance to the meeting tent dwelling."},{"num":7,"verse":"Put the washbasin between the meeting tent and the altar and put water in it."},{"num":8,"verse":"Set up the courtyard all around. Hang up the screen at the courtyard gate."},{"num":9,"verse":"Then take the anointing oil and anoint the dwelling and everything in it. Make holy the dwelling and all its equipment, and it will be holy."},{"num":10,"verse":"Anoint the altar for entirely burned offerings and all its equipment. Make the altar holy, and the altar will be most holy."},{"num":11,"verse":"Anoint the washbasin with its stand and make it holy."},{"num":12,"verse":"Then bring Aaron and his sons to the meeting tent’s entrance and wash them with water."},{"num":13,"verse":"Dress Aaron in the holy clothes. Anoint him and make him holy so that he may serve me as priest."},{"num":14,"verse":"Then bring his sons and dress them in tunics."},{"num":15,"verse":"Anoint them like you anointed their father so that they may serve me as priests. Their anointing is to the priesthood for all time in every generation."},{"num":16,"verse":"Moses did everything exactly as the Lord had commanded him."},{"num":17,"verse":"In the first month in the second year, on the first day of the month, the dwelling was set up."},{"num":18,"verse":"Moses set up the dwelling. He laid out its bases. He set up its boards, inserted its bars, and raised up its posts."},{"num":19,"verse":"He spread the tent out over the dwelling, and he put the covering of the tent over it, just as the Lord had commanded Moses."},{"num":20,"verse":"He took the covenant document and placed it inside the chest. He put the poles on the chest, and he set the cover on top of the chest."},{"num":21,"verse":"He brought the chest into the dwelling. He set up the veil as a screen to hide from view the chest containing the covenant, just as the Lord had commanded Moses."},{"num":22,"verse":"He placed the table in the meeting tent, on the north side of the dwelling, outside the veil."},{"num":23,"verse":"He set the bread in its proper place on the table in the Lord’s presence, just as the Lord had commanded Moses."},{"num":24,"verse":"He put the lampstand in the meeting tent, opposite the table on the south side of the dwelling."},{"num":25,"verse":"He set up the lamps in the Lord’s presence, just as the Lord had commanded Moses."},{"num":26,"verse":"He put the gold altar in the meeting tent in front of the veil."},{"num":27,"verse":"He burned sweet-smelling incense on it, just as the Lord had commanded Moses."},{"num":28,"verse":"He also set up the screen at the entrance to the dwelling."},{"num":29,"verse":"He placed the altar for entirely burned offerings at the entrance to the meeting tent dwelling. He offered the entirely burned offering and the grain offering on it, just as the Lord had commanded Moses."},{"num":30,"verse":"He put the washbasin between the meeting tent and the altar, and put water in it for washing."},{"num":31,"verse":"Moses, Aaron, and his sons used it to wash their hands and their feet."},{"num":32,"verse":"Whenever they went into the meeting tent and whenever they approached the altar, they washed themselves, just as the Lord had commanded Moses."},{"num":33,"verse":"He set up the courtyard around the dwelling and the altar, and he hung up the screen at the courtyard’s gate."},{"header":"God’s presence fills the dwelling!"},{"num":34,"verse":"the cloud covered the meeting tent and the Lord’s glorious presence filled the dwelling."},{"num":35,"verse":"Moses couldn’t enter the meeting tent because the cloud had settled on it, and the Lord’s glorious presence filled the dwelling."},{"num":36,"verse":"Whenever the cloud rose from the dwelling, the Israelites would set out on their journeys."},{"num":37,"verse":"But if the cloud didn’t rise, then they didn’t set out until the day it rose."},{"num":38,"verse":"The Lord’s cloud stayed over the dwelling during the day, with lightning in it at night, clearly visible to the whole household of Israel at every stage of their journey."}]