[{"header":"Setting Up the Holy Tent"},{"num":40,"verse":"Then the Lord said this to Moses: "},{"num":2,"verse":"“On the first day of the first month, set up the Holy Tent, which is the Meeting Tent. "},{"num":3,"verse":"Put the Ark of the Covenant in the Meeting Tent. Hang the curtain in front of the Ark of the Covenant. "},{"num":4,"verse":"Then bring in the table. Arrange everything on the table that should be there. Then bring in the lampstand and set up its lamps. "},{"num":5,"verse":"Put the gold altar for burning incense in front of the Ark of the Covenant. Then put the curtain at the entrance to the Holy Tent."},{"num":6,"verse":"“Put the altar of burnt offerings in front of the entrance of the Holy Tent, the Meeting Tent. "},{"num":7,"verse":"Put the bowl between the Meeting Tent and the altar. Put water in the bowl. "},{"num":8,"verse":"Set up the courtyard around the Holy Tent. Then put the curtain at the entry to the courtyard."},{"num":9,"verse":"“Use the special olive oil and pour it on the Holy Tent and everything in it. Give the Tent and all that is in it for service to the Lord. They will be holy. "},{"num":10,"verse":"Pour the special oil on the altar for burning offerings. Pour it on all its tools. Give the altar for service to God. It will be very holy. "},{"num":11,"verse":"Then pour the special olive oil on the bowl and the base under it. When you do this, they will be given for service to God."},{"num":12,"verse":"“Bring Aaron and his sons to the entrance of the Meeting Tent. Wash them with water. "},{"num":13,"verse":"Then put the holy clothes on Aaron. Pour the special oil on him, and give him for service to God. Then he may serve me as a priest. "},{"num":14,"verse":"Bring Aaron’s sons and put the inner robes on them. "},{"num":15,"verse":"Pour the special oil on them to make them priests. Do this the same way that you appointed their father as priest. Then they may also serve me as priests. Pouring oil on them will make them a family of priests. They and their descendants will be priests from now on.” "},{"num":16,"verse":"Moses did everything that the Lord commanded him."},{"num":17,"verse":"So the Holy Tent was set up. It was the first day of the first month during the second year after they left Egypt. "},{"num":18,"verse":"When Moses set up the Holy Tent, he put the bases in place. Then he put the frames on the bases. Next he put the crossbars through the rings of the frames and set up the posts. "},{"num":19,"verse":"After that, Moses spread the cloth over the Holy Tent. Then he put the covering over the Tent. He did these things just as the Lord commanded."},{"num":20,"verse":"Moses put the flat stones into the Ark of the Covenant. These had God’s law written on them. Moses put the poles through the rings of the Ark of the Covenant. Then he put the lid on it. "},{"num":21,"verse":"Next Moses brought the Ark of the Covenant into the Tent. He hung the curtain to cover the Ark of the Covenant. Moses did these things just as the Lord commanded him."},{"num":22,"verse":"Moses put the table in the Meeting Tent. He put it on the north side of the Holy Tent in front of the curtain. "},{"num":23,"verse":"Then he put the bread on the table before the Lord. He did this just as the Lord commanded him. "},{"num":24,"verse":"Moses put the lampstand in the Meeting Tent. He put it on the south side of the Holy Tent across from the table. "},{"num":25,"verse":"Then he put the lamps on the lampstand before the Lord. He did this just as the Lord commanded him."},{"num":26,"verse":"Moses put the gold altar for burning incense in the Meeting Tent. He put it in front of the curtain. "},{"num":27,"verse":"Then he burned sweet-smelling incense on it, just as the Lord commanded him. "},{"num":28,"verse":"Then he hung the curtain at the entrance to the Holy Tent."},{"num":29,"verse":"He put the altar for burning sacrifices at the entrance to the Holy Tent, the Meeting Tent. Then Moses offered a whole burnt offering and grain offerings on that altar. He did these things just as the Lord commanded him. "},{"num":30,"verse":"Moses put the bowl between the Meeting Tent and the altar for burning sacrifices. Moses put water in the bowl for washing. "},{"num":31,"verse":"Moses, Aaron and Aaron’s sons used this water to wash their hands and feet. "},{"num":32,"verse":"They washed themselves every time they entered the Meeting Tent. They also washed themselves every time they went near the altar for burning sacrifices. They did these things just as the Lord commanded Moses."},{"num":33,"verse":"Then Moses set up the courtyard around the Holy Tent. He put the altar for burning sacrifices in the courtyard. Then he put up the curtain at the entry to the courtyard. So Moses finished the work."},{"header":"The Cloud over the Holy Tent"},{"num":34,"verse":"Then the cloud covered the Meeting Tent. The greatness of the Lord filled the Holy Tent. "},{"num":35,"verse":"Moses could not enter the Meeting Tent. This was because the cloud had settled on it. And this was because the greatness of the Lord filled the Holy Tent."},{"num":36,"verse":"When the cloud rose from the Holy Tent, the Israelites would begin to travel. "},{"num":37,"verse":"But as long as the cloud stayed on the Holy Tent, the people did not travel. They stayed in that place until the cloud rose. "},{"num":38,"verse":"So the cloud of the Lord was over the Holy Tent during the day. And there was a fire in the cloud at night. So all the Israelites could see the cloud while they traveled."}]