[{"header":"Zaccheus Converted"},{"num":19,"verse":"Jesus entered Jericho and was passing through. "},{"num":2,"verse":"And there was a man called Zaccheus; he was a chief tax collector [a superintendent to whom others reported], and he was rich. "},{"num":3,"verse":"Zaccheus was trying to see who Jesus was, but he could not see because of the crowd, for he was short in stature. "},{"num":4,"verse":"So he ran on ahead [of the crowd] and climbed up in a sycamore tree in order to see Him, for He was about to pass through that way. "},{"num":5,"verse":"When Jesus reached the place, He looked up and said to him, “Zaccheus, hurry and come down, for today I must stay at your house.” "},{"num":6,"verse":"So Zaccheus hurried and came down, and welcomed Jesus with joy. "},{"num":7,"verse":"When the people saw it, they all began muttering [in discontent], “He has gone to be the guest of a man who is a [notorious] sinner.” "},{"num":8,"verse":"Zaccheus stopped and said to the Lord, “See, Lord, I am [now] giving half of my possessions to the poor, and if I have cheated anyone out of anything, I will give back four times as much.” "},{"num":9,"verse":"Jesus said to him, “Today salvation has come to this household, because he, too, is a [spiritual] son of Abraham; "},{"header":"Parable of Money Usage"},{"num":11,"verse":"While they were listening to these things, Jesus went on to tell a parable, because He was near Jerusalem, and they assumed that the kingdom of God was going to appear immediately [as soon as He reached the city]. "},{"num":12,"verse":"So He said, “A nobleman went to a distant country to obtain for himself a kingdom, and [then] to return. "},{"num":26,"verse":"[Jesus explained,] ‘I tell you that to everyone who has [because he valued his gifts from God and has used them wisely], more will be given; but from the one who does not have [because he disregarded his gifts from God], even what he has will be taken away.’ "},{"num":27,"verse":"[The king ended by saying,] ‘But as for these enemies of mine who did not want me to be king over them, bring them here and kill them in my presence.’”"},{"header":"The Triumphal Entry"},{"num":28,"verse":"After saying these things, Jesus went on ahead [of them], going up to Jerusalem."},{"num":29,"verse":"When He approached Bethphage and Bethany, at the mount that is called Olivet, He sent two of the disciples, "},{"num":30,"verse":"saying, “Go into the village ahead of you; there, as you enter, you will find a [donkey’s] colt tied, on which no one has ever sat. Untie it and bring it here. "},{"num":32,"verse":"So those who were sent left and found the colt just as He had told them. "},{"num":33,"verse":"As they were untying the colt, its owners asked them, “Why are you untying the colt?” "},{"num":34,"verse":"They said, “The Lord needs it.” "},{"num":35,"verse":"They brought it to Jesus, and they threw their robes over the colt and put Jesus on it. "},{"num":36,"verse":"As He rode along, people were spreading their coats on the road [as an act of homage before a king]. "},{"num":37,"verse":"As soon as He was approaching [Jerusalem], near the descent of the Mount of Olives, the entire multitude of the disciples [all those who were or claimed to be His followers] began praising God [adoring Him enthusiastically and] joyfully with loud voices for all the miracles and works of power that they had seen, "},{"num":38,"verse":"shouting,"},{"num":39,"verse":"Some of the Pharisees from the crowd said to Him, “Teacher, rebuke Your disciples [for shouting these Messianic praises].” "},{"num":40,"verse":"Jesus replied, “I tell you, if these [people] keep silent, the stones will cry out [in praise]!”"},{"num":41,"verse":"As He approached Jerusalem, He saw the city and wept over it [and the spiritual ignorance of its people], "},{"num":42,"verse":"saying, “If [only] you had known on this day [of salvation], even you, the things which make for peace [and on which peace depends]! But now they have been hidden from your eyes. "},{"header":"Traders Driven from the Temple"},{"num":45,"verse":"Jesus went into the temple [enclosure] and began driving out those who were selling, "},{"num":46,"verse":"saying to them, “It is written, ‘My house shall be a house of prayer’; but you have made it a robbers’ den.”"},{"num":47,"verse":"He was teaching day after day in the temple [porches and courts]; but the chief priests and scribes and the leading men among the people were seeking [a way] to put Him to death, "},{"num":48,"verse":"and they could not find anything that they could do, for all the people [stayed close to Him and] were hanging on to every word He said."}]