[{"num":19,"verse":"Yeshua entered Yericho and was passing through, "},{"num":2,"verse":"when a man named Zakkai appeared who was a chief tax-collector and a wealthy man. "},{"num":3,"verse":"He was trying to see who Yeshua was; but, being short, he couldn’t, because of the crowd. "},{"num":4,"verse":"So he ran on ahead and climbed a fig tree in order to see him, for Yeshua was about to pass that way. "},{"num":5,"verse":"When he came to the place, he looked up and said to him, “Zakkai! Hurry! Come down, because I have to stay at your house today!” "},{"num":6,"verse":"He climbed down as fast as he could and welcomed Yeshua joyfully. "},{"num":7,"verse":"Everyone who saw it began muttering, “He has gone to be the house-guest of a sinner.” "},{"num":8,"verse":"But Zakkai stood there and said to the Lord, “Here, Lord, I am giving half of all I own to the poor; and if I have cheated anyone, I will pay him back four times as much.” "},{"num":9,"verse":"Yeshua said to him, “Today salvation has come to this house, inasmuch as this man too is a son of Avraham. "},{"num":10,"verse":"For the Son of Man came to seek and save what was lost.”"},{"num":11,"verse":"While they were listening to this, Yeshua went on to tell a parable, because he was near Yerushalayim, and the people supposed that the Kingdom of God was about to appear at any moment. "},{"num":12,"verse":"Therefore he said, “A nobleman went to a country far away to have himself crowned king and then return. "},{"num":13,"verse":"Calling ten of his servants, he gave them ten manim [a maneh is about three months’ wages] and said to them, ‘Do business with this while I’m away.’ "},{"num":14,"verse":"But his countrymen hated him, and they sent a delegation after him to say, ‘We don’t want this man to rule over us.’"},{"num":15,"verse":"“However, he returned, having been made king, and sent for the servants to whom he had given the money, to find out what each one had earned in his business dealings. "},{"num":16,"verse":"The first one came in and said, ‘Sir, your maneh has earned ten more manim.’ "},{"num":17,"verse":"‘Excellent!’ he said to him. ‘You are a good servant. Because you have been trustworthy in a small matter, I am putting you in charge of ten towns.’ "},{"num":18,"verse":"The second one came and said, ‘Sir, your maneh has earned five more manim; "},{"num":19,"verse":"and to this one he said, ‘You be in charge of five towns.’"},{"num":20,"verse":"“Then another one came and said, ‘Sir, here is your maneh. I kept it hidden in a piece of cloth, "},{"num":21,"verse":"because I was afraid of you — you take out what you didn’t put in, and you harvest what you didn’t plant.’ "},{"num":22,"verse":"To him the master said, ‘You wicked servant! I will judge you by your own words! So you knew, did you, that I was a severe man, taking out what I didn’t put in and harvesting what I didn’t plant? "},{"num":23,"verse":"Then why didn’t you put my money in the bank? Then, when I returned, I would have gotten it back with interest!’ "},{"num":24,"verse":"To those standing by, he said, ‘Take the maneh from him and give it to the one with ten manim.’ "},{"num":25,"verse":"They said to him, ‘Sir, he already has ten manim!’ "},{"num":26,"verse":"But the master answered, ‘I tell you, everyone who has something will be given more; but from anyone who has nothing, even what he does have will be taken away. "},{"num":27,"verse":"However, as for these enemies of mine who did not want me to be their king, bring them here and execute them in my presence!’”"},{"num":28,"verse":"After saying this, Yeshua went on and began the ascent to Yerushalayim. "},{"num":29,"verse":"As he approached Beit-Pagei and Beit-Anyah, by the Mount of Olives, he sent two talmidim, "},{"num":30,"verse":"instructing them, “Go into the village ahead; on entering it, you will find a colt tied up that has never been ridden. Untie it and bring it here. "},{"num":31,"verse":"If anyone asks why you are untying it, tell him, ‘The Lord needs it.’” "},{"num":32,"verse":"Those who were sent went off and found it just as he had told them. "},{"num":33,"verse":"As they were untying the colt, its owners said to them, “Why are you untying the colt?” "},{"num":34,"verse":"and they said, “Because the Lord needs it.” "},{"num":35,"verse":"They brought it to Yeshua; and, throwing their robes on the colt, they put Yeshua on it. "},{"num":36,"verse":"As he went along, people carpeted the road with their clothing; "},{"num":37,"verse":"and as he came near Yerushalayim, where the road descends from the Mount of Olives, the entire band of talmidim began to sing and praise God at the top of their voices for all the powerful works they had seen:"},{"num":39,"verse":"Some of the P’rushim in the crowd said to him, “Rabbi! Reprimand your talmidim!” "},{"num":40,"verse":"But he answered them, “I tell you that if they keep quiet, the stones will shout!”"},{"num":41,"verse":"When Yeshua had come closer and could see the city, he wept over it, "},{"num":42,"verse":"saying, “If you only knew today what is needed for shalom! But for now it is hidden from your sight. "},{"num":43,"verse":"For the days are coming upon you when your enemies will set up a barricade around you, encircle you, hem you in on every side, "},{"num":44,"verse":"and dash you to the ground, you and your children within your walls, leaving not one stone standing on another — and all because you did not recognize your opportunity when God offered it!”"},{"num":45,"verse":"Then Yeshua entered the Temple grounds and began driving out those doing business there, "},{"num":46,"verse":"saying to them, “The Tanakh says, ‘My House is to be a house of prayer,’ but you have made it into a den of robbers!”"},{"num":47,"verse":"Every day he taught at the Temple. The head cohanim, the Torah-teachers and the leaders of the people tried to find a way of putting an end to him; "},{"num":48,"verse":"but they couldn’t find any way of doing it, because all the people were hanging onto his every word."}]