[{"header":"Jesus Visits Zacchaeus"},{"num":19,"verse":"He entered Jericho and was passing through. "},{"num":2,"verse":"There was a man named Zacchaeus who was a chief tax collector, and he was rich. "},{"num":3,"verse":"He was trying to see who Jesus was, but he was not able because of the crowd, since he was a short man. "},{"num":4,"verse":"So running ahead, he climbed up a sycamore tree to see Jesus, since he was about to pass that way. "},{"num":5,"verse":"When Jesus came to the place, he looked up and said to him, “Zacchaeus, hurry and come down because today it is necessary for me to stay at your house.”"},{"num":6,"verse":"So he quickly came down and welcomed him joyfully. "},{"num":7,"verse":"All who saw it began to complain, “He’s gone to stay with a sinful man.”"},{"num":8,"verse":"But Zacchaeus stood there and said to the Lord, “Look, I’ll give half of my possessions to the poor, Lord. And if I have extorted anything from anyone, I’ll pay back four times as much.”"},{"num":9,"verse":"“Today salvation has come to this house,” Jesus told him, “because he too is a son of Abraham. "},{"num":10,"verse":"For the Son of Man has come to seek and to save the lost.”"},{"header":"The Parable of the Ten Minas"},{"num":11,"verse":"As they were listening to this, he went on to tell a parable because he was near Jerusalem, and they thought the kingdom of God was going to appear right away."},{"num":12,"verse":"Therefore he said, “A nobleman traveled to a far country to receive for himself authority to be king and then to return. "},{"num":13,"verse":"He called ten of his servants, gave them ten minas, and told them, ‘Engage in business until I come back.’"},{"num":14,"verse":"“But his subjects hated him and sent a delegation after him, saying, ‘We don’t want this man to rule over us.’"},{"num":15,"verse":"“At his return, having received the authority to be king, he summoned those servants he had given the money to, so that he could find out how much they had made in business. "},{"num":16,"verse":"The first came forward and said, ‘Master, your mina has earned ten more minas.’"},{"num":17,"verse":"“‘Well done, good servant!’ he told him. ‘Because you have been faithful in a very small matter, have authority over ten towns.’"},{"num":18,"verse":"“The second came and said, ‘Master, your mina has made five minas.’"},{"num":19,"verse":"“So he said to him, ‘You will be over five towns.’"},{"num":20,"verse":"“And another came and said, ‘Master, here is your mina. I have kept it safe in a cloth "},{"num":21,"verse":"because I was afraid of you since you’re a harsh man: you collect what you didn’t deposit and reap what you didn’t sow.’"},{"num":22,"verse":"“He told him, ‘I will condemn you by what you have said, you evil servant! If you knew I was a harsh man, collecting what I didn’t deposit and reaping what I didn’t sow, "},{"num":23,"verse":"why, then, didn’t you put my money in the bank? And when I returned, I would have collected it with interest.’ "},{"num":24,"verse":"So he said to those standing there, ‘Take the mina away from him and give it to the one who has ten minas.’"},{"num":25,"verse":"“But they said to him, ‘Master, he has ten minas.’"},{"num":26,"verse":"“‘I tell you, that to everyone who has, more will be given; and from the one who does not have, even what he does have will be taken away. "},{"num":27,"verse":"But bring here these enemies of mine, who did not want me to rule over them, and slaughter them in my presence.’”"},{"header":"The Triumphal Entry"},{"num":28,"verse":"When he had said these things, he went on ahead, going up to Jerusalem. "},{"num":29,"verse":"As he approached Bethphage and Bethany, at the place called the Mount of Olives, he sent two of the disciples "},{"num":30,"verse":"and said, “Go into the village ahead of you. As you enter it, you will find a colt tied there, on which no one has ever sat. Untie it and bring it. "},{"num":31,"verse":"If anyone asks you, ‘Why are you untying it?’ say this: ‘The Lord needs it.’”"},{"num":32,"verse":"So those who were sent left and found it just as he had told them. "},{"num":33,"verse":"As they were untying the colt, its owners said to them, “Why are you untying the colt?”"},{"num":34,"verse":"“The Lord needs it,” they said. "},{"num":35,"verse":"Then they brought it to Jesus, and after throwing their clothes on the colt, they helped Jesus get on it. "},{"num":36,"verse":"As he was going along, they were spreading their clothes on the road. "},{"num":37,"verse":"Now he came near the path down the Mount of Olives, and the whole crowd of the disciples began to praise God joyfully with a loud voice for all the miracles they had seen:"},{"num":39,"verse":"Some of the Pharisees from the crowd told him, “Teacher, rebuke your disciples.”"},{"num":40,"verse":"He answered, “I tell you, if they were to keep silent, the stones would cry out.”"},{"header":"Jesus’s Love for Jerusalem"},{"num":41,"verse":"As he approached and saw the city, he wept for it, "},{"num":42,"verse":"saying, “If you knew this day what would bring peace—but now it is hidden from your eyes. "},{"num":43,"verse":"For the days will come on you when your enemies will build a barricade around you, surround you, and hem you in on every side. "},{"num":44,"verse":"They will crush you and your children among you to the ground, and they will not leave one stone on another in your midst, because you did not recognize the time when God visited you.”"},{"header":"Cleansing the Temple"},{"num":45,"verse":"He went into the temple and began to throw out those who were selling, "},{"num":46,"verse":"and he said, “It is written, my house will be a house of prayer, but you have made it a den of thieves!”"},{"num":47,"verse":"Every day he was teaching in the temple. The chief priests, the scribes, and the leaders of the people were looking for a way to kill him, "},{"num":48,"verse":"but they could not find a way to do it, because all the people were captivated by what they heard."}]