[{"header":"Jesus and Zacchaeus"},{"num":19,"verse":"Jesus entered and passed through Jericho. "},{"num":2,"verse":"A man was there named Zacchaeus who was a chief tax collector, and he was rich. "},{"num":3,"verse":"He tried to see who Jesus was, but was not able from the crowd, because he was little in stature. "},{"num":4,"verse":"So he ran ahead and climbed up into a sycamore tree to see Him, for He was to pass that way."},{"num":5,"verse":"When Jesus came to the vicinity, He looked up and saw him, and said to him, “Zacchaeus, hurry and come down, for today I must remain at your house.” "},{"num":6,"verse":"So he hurried and came down, and received Him joyfully."},{"num":7,"verse":"When they saw it, they all murmured, saying, “He has gone to be the guest of a man who is a sinner.”"},{"num":8,"verse":"But Zacchaeus stood and said to the Lord, “Look, Lord, I give half of my possessions to the poor. And if I have taken anything from anyone by false accusation, I will repay him four times as much.”"},{"num":9,"verse":"Jesus said to him, “Today salvation has come to this house, because he also is a son of Abraham. "},{"num":10,"verse":"For the Son of Man has come to seek and to save that which was lost.”"},{"header":"The Parable of the Ten Pounds(A)"},{"num":11,"verse":"As they heard these things, He continued and told them a parable, because He was near Jerusalem and because they thought the kingdom of God would immediately appear. "},{"num":12,"verse":"Therefore He said, “A nobleman went to a distant country to receive a kingdom and to return. "},{"num":13,"verse":"So he called his ten servants and entrusted to them ten pounds and said to them, ‘Trade until I come.’"},{"num":14,"verse":"“But his citizens hated him and sent a delegation after him, saying, ‘We do not want this man to reign over us.’"},{"num":15,"verse":"“When he returned, having received the kingdom, he summoned these servants, to whom he had entrusted the money, that he might know what everyone gained by trading."},{"num":16,"verse":"“The first came, saying, ‘Master, your pound has made ten pounds more.’"},{"num":17,"verse":"“He said to him, ‘Well done, good servant! Because you have been faithful in very little, take authority over ten cities.’"},{"num":18,"verse":"“The second came, saying, ‘Master, your pound has made five pounds more.’"},{"num":19,"verse":"“He said in like manner to him, ‘You, take authority over five cities.’"},{"num":20,"verse":"“Then another came, saying, ‘Master, look, here is your pound, which I have kept put away in a napkin. "},{"num":21,"verse":"For I feared you, because you are an exacting man. You collect what you did not deposit, and reap what you did not sow.’"},{"num":22,"verse":"“He said to him, ‘Out of your own mouth will I judge you, you wicked servant. You knew that I was an exacting man, collecting what I did not deposit and reaping what I did not sow. "},{"num":23,"verse":"Why then did you not deposit my money in the bank, so that at my coming I might have collected it with interest?’"},{"num":24,"verse":"“Then he said to those who stood by, ‘Take the pound from him and give it to him who has ten pounds.’"},{"num":25,"verse":"“They said to him, ‘Master, he has ten pounds.’"},{"num":26,"verse":"“ ‘I tell you that to everyone who has will be given. But from him who has not, even what he has will be taken away from him. "},{"num":27,"verse":"But as for those enemies of mine, who would not let me reign over them, bring them here and slay them before me.’ ”"},{"header":"The Triumphant Entry in Jerusalem(B)"},{"num":28,"verse":"When He had said this, He went before them, ascending up to Jerusalem. "},{"num":29,"verse":"When He came near to Bethphage and Bethany, at the mountain called the Mount of Olives, He sent two of His disciples, "},{"num":30,"verse":"saying, “Go over into the village opposite you, where, as you enter, you will find a colt tied, on which no one has ever yet sat. Untie it and bring it here. "},{"num":31,"verse":"If anyone asks you, ‘Why are you untying it?’ you shall say to him, ‘Because the Lord has need of it.’ ”"},{"num":32,"verse":"Those who were sent went and found it just as He had told them. "},{"num":33,"verse":"As they were untying the colt, its owners said to them, “Why are you untying the colt?”"},{"num":34,"verse":"They said, “The Lord has need of it.”"},{"num":35,"verse":"They brought it to Jesus. And they threw their garments on the colt, and they set Jesus on it. "},{"num":36,"verse":"As He went, they spread their clothes in the street."},{"num":37,"verse":"When He was coming near the descent of the Mount of Olives, the whole crowd of the disciples began to rejoice and praise God with loud voices for all the mighty works that they had seen, "},{"num":38,"verse":"saying:"},{"num":39,"verse":"Some of the Pharisees from the crowd said to Him, “Teacher, rebuke Your disciples.”"},{"num":40,"verse":"He answered them, “I tell you, if these should be silent, the stones would immediately cry out.”"},{"num":41,"verse":"When He came near, He beheld the city and wept over it, "},{"num":42,"verse":"saying, “If you, even you, had known even today what things would bring you peace! But now they are hidden from your eyes. "},{"num":43,"verse":"For the days will come upon you when your enemies will build an embankment around you and surround you, and press you in on every side. "},{"num":44,"verse":"They will dash you, and your children within you, to the ground. They will not leave one stone upon another within you, because you did not know the time of your visitation.”"},{"header":"The Cleansing of the Temple(C)"},{"num":45,"verse":"Then He entered the temple and began to drive out those who sold and bought in it, "},{"num":46,"verse":"saying to them, “It is written, ‘My house will be a house of prayer,’ but you have made it ‘a den of thieves.’”"},{"num":47,"verse":"He taught daily in the temple. But the chief priests, the scribes, and the leaders of the people tried to kill Him. "},{"num":48,"verse":"Yet they could not find a way to do it, for all the people were very attentive to hear Him."}]