[{"header":"Zacchaeus the Tax Collector"},{"num":19,"verse":"Jesus entered Jericho and was passing through. "},{"num":2,"verse":"A man named Zacchaeus lived there. He was a chief tax collector and was very rich. "},{"num":3,"verse":"Zacchaeus wanted to see who Jesus was. But he was a short man. He could not see Jesus because of the crowd. "},{"num":4,"verse":"So he ran ahead and climbed a sycamore-fig tree. He wanted to see Jesus, who was coming that way."},{"num":5,"verse":"Jesus reached the spot where Zacchaeus was. He looked up and said, “Zacchaeus, come down at once. I must stay at your house today.” "},{"num":6,"verse":"So Zacchaeus came down at once and welcomed him gladly."},{"num":7,"verse":"All the people saw this. They began to whisper among themselves. They said, “Jesus has gone to be the guest of a sinner. ”"},{"num":8,"verse":"But Zacchaeus stood up. He said, “Look, Lord! Here and now I give half of what I own to those who are poor. And if I have cheated anybody out of anything, I will pay it back. I will pay back four times the amount I took.”"},{"num":9,"verse":"Jesus said to Zacchaeus, “Today salvation has come to your house. You are a member of Abraham’s family line. "},{"num":10,"verse":"The Son of Man came to look for the lost and save them.”"},{"header":"The Story of Three Slaves"},{"num":11,"verse":"While the people were listening to these things, Jesus told them a story. He was near Jerusalem. The people thought that God’s kingdom was going to appear right away. "},{"num":12,"verse":"Jesus said, “A man from an important family went to a country far away. He went there to be made king and then return home. "},{"num":13,"verse":"So he sent for ten of his slaves. He gave them each about three months’ pay. ‘Put this money to work until I come back,’ he said."},{"num":14,"verse":"“But those he ruled over hated him. They sent some messengers after him. They were sent to say, ‘We don’t want this man to be our king.’"},{"num":15,"verse":"“But he was made king and returned home. Then he sent for the slaves he had given the money to. He wanted to find out what they had earned with it."},{"num":16,"verse":"“The first one came to him. He said, ‘Sir, your money has earned ten times as much.’"},{"num":17,"verse":"“ ‘You have done well, my good slave!’ his master replied. ‘You have been faithful in a very small matter. So I will put you in charge of ten towns.’"},{"num":18,"verse":"“The second slave came to his master. He said, ‘Sir, your money has earned five times as much.’"},{"num":19,"verse":"“His master answered, ‘I will put you in charge of five towns.’"},{"num":20,"verse":"“Then another slave came. He said, ‘Sir, here is your money. I have kept it hidden in a piece of cloth. "},{"num":21,"verse":"I was afraid of you. You are a hard man. You take out what you did not put in. You harvest what you did not plant.’"},{"num":22,"verse":"“His master replied, ‘I will judge you by your own words, you evil slave! So you knew that I am a hard man? You knew that I take out what I did not put in? You knew that I harvest what I did not plant? "},{"num":23,"verse":"Then why didn’t you put my money in the bank? When I came back, I could have collected it with interest.’"},{"num":24,"verse":"“Then he said to those standing by, ‘Take his money away from him. Give it to the one who has ten times as much.’"},{"num":25,"verse":"“ ‘Sir,’ they said, ‘he already has ten times as much!’"},{"num":26,"verse":"“He replied, ‘I tell you that everyone who has will be given more. But here is what will happen to anyone who has nothing. Even what they have will be taken away from them. "},{"num":27,"verse":"And what about my enemies who did not want me to be king over them? Bring them here! Kill them in front of me!’ ”"},{"header":"Jesus Comes to Jerusalem as King"},{"num":28,"verse":"After Jesus had said this, he went on ahead. He was going up to Jerusalem. "},{"num":29,"verse":"He approached Bethphage and Bethany. The hill there was called the Mount of Olives. Jesus sent out two of his disciples. He said to them, "},{"num":30,"verse":"“Go to the village ahead of you. As soon as you get there, you will find a donkey’s colt tied up. No one has ever ridden it. Untie it and bring it here. "},{"num":31,"verse":"Someone may ask you, ‘Why are you untying it?’ If so, say, ‘The Lord needs it.’ ”"},{"num":32,"verse":"Those who were sent ahead went and found the young donkey. It was there just as Jesus had told them. "},{"num":33,"verse":"They were untying the colt when its owners came. The owners asked them, “Why are you untying the colt?”"},{"num":34,"verse":"They replied, “The Lord needs it.”"},{"num":35,"verse":"Then the disciples brought the colt to Jesus. They threw their coats on the young donkey and put Jesus on it. "},{"num":36,"verse":"As he went along, people spread their coats on the road."},{"num":37,"verse":"Jesus came near the place where the road goes down the Mount of Olives. There the whole crowd of disciples began to praise God with joy. In loud voices they praised him for all the miracles they had seen. They shouted,"},{"num":39,"verse":"Some of the Pharisees in the crowd spoke to Jesus. “Teacher,” they said, “tell your disciples to stop!”"},{"num":40,"verse":"“I tell you,” he replied, “if they keep quiet, the stones will cry out.”"},{"num":41,"verse":"He approached Jerusalem. When he saw the city, he began to weep. "},{"num":42,"verse":"He said, “I wish you had known today what would bring you peace! But now it is hidden from your eyes. "},{"num":43,"verse":"The days will come when your enemies will arrive. They will build a wall of dirt up against your city. They will surround you and close you in on every side. "},{"num":44,"verse":"You didn’t recognize the time when God came to you. So your enemies will smash you to the ground. They will destroy you and all the people inside your walls. They will not leave one stone on top of another.”"},{"header":"Jesus Clears Out the Temple"},{"num":45,"verse":"Then Jesus entered the temple courtyard. He began to drive out those who were selling there. "},{"num":46,"verse":"He told them, “It is written that the Lord said, ‘My house will be a house where people can pray.’ (Isaiah 56:7) But you have made it a ‘den for robbers.’ ” (Jeremiah 7:11)"},{"num":47,"verse":"Every day Jesus was teaching at the temple. But the chief priests and the teachers of the law were trying to kill him. So were the leaders among the people. "},{"num":48,"verse":"But they couldn’t find any way to do it. All the people were paying close attention to his words."}]