[[],[{"type":"prose","content":"And having entered, he was passing through Jericho,"}],[{"type":"prose","content":"and lo, a man, by name called Zaccheus, and he was a chief tax-gatherer, and he was rich,"}],[{"type":"prose","content":"and he was seeking to see Jesus, who he is, and was not able for the multitude, because in stature he was small,"}],[{"type":"prose","content":"and having run forward before, he went up on a sycamore, that he may see him, because through that [way] he was about to pass by."}],[{"type":"prose","content":"And as Jesus came up to the place, having looked up, he saw him, and said unto him, `Zaccheus, having hastened, come down, for to-day in thy house it behoveth me to remain;'"}],[{"type":"prose","content":"and he having hastened did come down, and did receive him rejoicing;"}],[{"type":"prose","content":"and having seen [it], they were all murmuring, saying -- `With a sinful man he went in to lodge!'"}],[{"type":"prose","content":"And Zaccheus having stood, said unto the Lord, `Lo, the half of my goods, sir, I give to the poor, and if of any one anything I did take by false accusation, I give back fourfold.'"}],[{"type":"prose","content":"And Jesus said unto him -- `To-day salvation did come to this house, inasmuch as he also is a son of Abraham;"}],[{"type":"prose","content":"for the Son of Man came to seek and to save the lost.'"}],[{"type":"prose","content":"And while they are hearing these things, having added he spake a simile, because of his being nigh to Jerusalem, and of their thinking that the reign of God is about presently to be made manifest."}],[{"type":"prose","content":"He said therefore, `A certain man of birth went on to a far country, to take to himself a kingdom, and to return,"}],[{"type":"prose","content":"and having called ten servants of his own, he gave to them ten pounds, and said unto them, Do business -- till I come;"}],[{"type":"prose","content":"and his citizens were hating him, and did send an embassy after him, saying, We do not wish this one to reign over us."}],[{"type":"prose","content":"`And it came to pass, on his coming back, having taken the kingdom, that he commanded these servants to be called to him, to whom he gave the money, that he might know what any one had done in business."}],[{"type":"prose","content":"`And the first came near, saying, Sir, thy pound did gain ten pounds;"}],[{"type":"prose","content":"and he said to him, Well done, good servant, because in a very little thou didst become faithful, be having authority over ten cities."}],[{"type":"prose","content":"`And the second came, saying, Sir, thy pound made five pounds;"}],[{"type":"prose","content":"and he said also to this one, And thou, become thou over five cities."}],[{"type":"prose","content":"`And another came, saying, Sir, lo, thy pound, that I had lying away in a napkin;"}],[{"type":"prose","content":"for I was afraid of thee, because thou art an austere man; thou takest up what thou didst not lay down, and reapest what thou didst not sow."}],[{"type":"prose","content":"`And he saith to him, Out of thy mouth I will judge thee, evil servant: thou knewest that I am an austere man, taking up what I did not lay down, and reaping what I did not sow!"}],[{"type":"prose","content":"and wherefore didst thou not give my money to the bank, and I, having come, with interest might have received it?"}],[{"type":"prose","content":"`And to those standing by he said, Take from him the pound, and give to him having the ten pounds --"}],[{"type":"prose","content":"(and they said to him, Sir, he hath ten pounds) --"}],[{"type":"prose","content":"for I say to you, that to every one having shall be given, and from him not having, also what he hath shall be taken from him,"}],[{"type":"prose","content":"but those my enemies, who did not wish me to reign over them, bring hither and slay before me.'"}],[{"type":"prose","content":"And having said these things, he went on before, going up to Jerusalem."}],[{"type":"prose","content":"And it came to pass, as he came nigh to Bethphage and Bethany, unto the mount called of the Olives, he sent two of his disciples,"}],[{"type":"prose","content":"having said, Go away to the village over-against, in which, entering into, ye shall find a colt bound, on which no one of men did ever sit, having loosed it, bring [it];"}],[{"type":"prose","content":"and if any one doth question you, Wherefore do ye loose [it]? thus ye shall say to him -- The Lord hath need of it.'"}],[{"type":"prose","content":"And those sent, having gone away, found according as he said to them,"}],[{"type":"prose","content":"and while they are loosing the colt, its owners said unto them, `Why loose ye the colt?'"}],[{"type":"prose","content":"and they said, `The Lord hath need of it;'"}],[{"type":"prose","content":"and they brought it unto Jesus, and having cast their garments upon the colt, they did set Jesus upon it."}],[{"type":"prose","content":"And as he is going, they were spreading their garments in the way,"}],[{"type":"prose","content":"and as he is coming nigh now, at the descent of the mount of the Olives, the whole multitude of the disciples began rejoicing to praise God with a great voice for all the mighty works they had seen,"}],[{"type":"prose","content":"saying, `blessed [is] he who is coming, a king in the name of the Lord; peace in heaven, and glory in the highest.'"}],[{"type":"prose","content":"And certain of the Pharisees from the multitude said unto him, `Teacher, rebuke thy disciples;'"}],[{"type":"prose","content":"and he answering said to them, `I say to you, that, if these shall be silent, the stones will cry out!'"}],[{"type":"prose","content":"And when he came nigh, having seen the city, he wept over it,"}],[{"type":"prose","content":"saying -- `If thou didst know, even thou, at least in this thy day, the things for thy peace; but now they were hid from thine eyes."}],[{"type":"prose","content":"`Because days shall come upon thee, and thine enemies shall cast around thee a rampart, and compass thee round, and press thee on every side,"}],[{"type":"prose","content":"and lay thee low, and thy children within thee, and they shall not leave in thee a stone upon a stone, because thou didst not know the time of thy inspection.'"}],[{"type":"prose","content":"And having entered into the temple, he began to cast forth those selling in it, and those buying,"}],[{"type":"prose","content":"saying to them, `It hath been written, My house is a house of prayer -- but ye made it a den of robbers.'"}],[{"type":"prose","content":"And he was teaching daily in the temple, but the chief priests and the scribes were seeking to destroy him -- also the chiefs of the people --"}],[{"type":"prose","content":"and they were not finding what they shall do, for all the people were hanging on him, hearing him."}]]