[{"header":"It Is Bad for Wrong-Doers"},{"num":2,"verse":"It is bad for those who make plans to do wrong, who lie on their beds thinking of something sinful to do! When morning comes, they do it, because it is in their power. "},{"num":2,"verse":"They want fields that belong to someone else, and take them. They want houses, and take them. They rob a man and his house, a man and what has been given to him. "},{"num":3,"verse":"So the Lord says, “I am planning trouble against this family, from which you cannot save yourselves. You will no longer walk in pride, for it will be a time of much trouble. "},{"num":4,"verse":"On that day they will make fun of you and sing a bitter song of sorrow, saying, ‘We are destroyed and everything is gone! My people’s land is divided. He takes it from me! He gives our fields to those who turned against us.’” "},{"num":5,"verse":"So you will have no one among the Lord’s people to divide the land in a right way for you."},{"header":"Men Who Lie"},{"num":6,"verse":"“The people say to me, ‘Do not speak about these things, because we will not be put to shame.’ "},{"num":7,"verse":"Should it be said, O people of Jacob: “Is the Spirit of the Lord angry? Would He do such things? Do not My Words do good to the one whose way is right and good? "},{"num":8,"verse":"My people have begun to hate those who are at peace with them. You pull the coat off from a brother Israelite, from those who pass by in peace like men returning from war. "},{"num":9,"verse":"You drive the women of My people away from their beautiful houses. You take My greatness away from their children forever. "},{"num":10,"verse":"Get up and go away, for this is no place of rest, because it is made unclean. It is destroyed with much suffering. "},{"num":11,"verse":"If a man comes speaking lies and says, ‘I will speak to you about wine and strong drink,’ he would be the one for these people!"},{"header":"Israel Is Gathered Together"},{"num":12,"verse":"“I will gather all of you together, Jacob. I will gather all those left of Israel. I will put them together like sheep within a fence, like a flock in its field. The land will be filled with the noise of many people. "},{"num":13,"verse":"The One Who breaks open the way will go out before them. They will break through the gate and go out. Their king will pass through before them, and the Lord will lead them.”"}]