[{"header":"The Southern Campaign"},{"num":10,"verse":"When Adoni-Zedek king of Jerusalem heard that Joshua had captured Ai and devoted it to destruction, and that Joshua had done to Ai and its king exactly what he had done to Jericho and its king, and that the inhabitants of Gibeon had made peace with Israel and were allied with them, "},{"num":2,"verse":"then he and those with him were very afraid because Gibeon was a large city, like one of the royal capital cities. It was larger than Ai, and all its men were warriors. "},{"num":3,"verse":"So Adoni-Zedek king of Jerusalem sent word to Hoham king of Hebron, to Piram king of Jarmuth, to Japhia king of Lachish, and to Debir king of Eglon. He said, "},{"num":4,"verse":"“Come up, join me, and help me. We must attack Gibeon, because it made peace with Joshua and with the Israelites.”"},{"num":5,"verse":"So the five kings of the Amorites—namely, the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon—gathered together and went up with all their divisions. They set up camp around Gibeon and waged war against it."},{"num":6,"verse":"The men of Gibeon sent word to Joshua in the camp at Gilgal, saying, “Do not withdraw your hand from your servants. Come up to us quickly! Save us! Help us, because all the kings of the Amorites living in the hill country have united themselves against us.”"},{"num":7,"verse":"So Joshua went up from Gilgal—he and all the military forces with him, including all the strong warriors."},{"num":8,"verse":"Then the Lord said to Joshua, “Do not be afraid of them, because I have given them into your hand. Not a man among them will be able to stand in your presence.”"},{"num":9,"verse":"So Joshua came upon them unexpectedly by marching up from Gilgal all night. "},{"num":10,"verse":"The Lord threw them into a panic before Israel, and he struck a powerful blow against them at Gibeon. Then he chased them on the road that goes up to Beth Horon, and he struck them as far as Azekah and Makkedah. "},{"num":11,"verse":"While they were fleeing from Israel on the descent from Beth Horon, the Lord hurled large stones from the heavens on them all the way to Azekah. So they died. Those who died from the hailstones were many more than those whom the Israelites killed by the sword."},{"num":12,"verse":"Then Joshua spoke to the Lord on the day that the Lord gave the Amorites into the power of Israel ⎣when he struck them down at Gibeon, and they were struck down before the people of Israel⎦. He said in the sight of Israel:"},{"num":14,"verse":"There has never been a day like that day either before it or after it, a day when the Lord listened to the voice of a man, for the Lord was fighting for Israel."},{"num":15,"verse":"Then Joshua and all Israel with him returned to the camp at Gilgal."},{"num":16,"verse":"Those five kings fled and hid in the cave at Makkedah. "},{"num":17,"verse":"It was reported to Joshua: “The five kings have been found hiding in the cave at Makkedah.”"},{"num":18,"verse":"So Joshua said, “Roll large stones against the mouth of the cave, and station men over it to guard them. "},{"num":19,"verse":"But you—do not stand still. Chase your enemies and attack them from the rear. Do not give them a chance to get to their cities, because the Lord your God has given them into your hand.”"},{"num":20,"verse":"When Joshua and the people of Israel had inflicted a devastating blow upon them, to the point that they were almost wiped out (though a small group of survivors escaped into the fortified cities), "},{"num":21,"verse":"then all the people returned safely to the camp of Joshua at Makkedah. No one dared to speak a word against the people of Israel—against any one of them!"},{"num":22,"verse":"Then Joshua said, “Open the mouth of the cave, and bring those five kings out to me from the cave.” "},{"num":23,"verse":"They did so and brought those five kings out to him from the cave: the king of Jerusalem, the king of Hebron, the king of Jarmuth, the king of Lachish, and the king of Eglon. "},{"num":24,"verse":"When they had brought those kings out to Joshua, he summoned every man of Israel and said to the commanders of the fighting men who had gone with him, “Come, put your feet on the necks of these kings.” So they came and put their feet on their necks."},{"num":25,"verse":"Then Joshua said to them, “Do not be afraid. Do not be overwhelmed. Be strong and courageous because the Lord will do these same things to all your enemies against whom you are waging war.” "},{"num":26,"verse":"Joshua struck them down after that, and after he had killed them, he hung them on five trees. They were hung on the trees until evening."},{"num":27,"verse":"At sunset Joshua gave the command, and they took them down from the trees and threw them into the cave where they had hidden themselves. They placed large stones over the mouth of the cave, which remain there to this very day."},{"num":28,"verse":"Joshua captured Makkedah on that day and struck it and its king with the edge of the sword. He devoted it to destruction, together with every living thing that was in it. He did not leave a survivor. So he did to the king of Makkedah just as he had done to the king of Jericho."},{"num":29,"verse":"Then Joshua and all Israel with him moved on from Makkedah to Libnah and waged war against Libnah. "},{"num":30,"verse":"The Lord gave it into the hand of Israel, together with its king. He struck Libnah with the edge of the sword, together with every living thing that was in it. He did not leave a survivor in it. So he did to its king just as he had done to the king of Jericho."},{"num":31,"verse":"Next Joshua and all Israel with him moved on from Libnah to Lachish. He set up camp against it and waged war against it. "},{"num":32,"verse":"The Lord gave Lachish into the hand of Israel. He captured it on the second day, and he struck it with the edge of the sword, together with every living thing that was in it, exactly as he had done to Libnah."},{"num":33,"verse":"Then Horam king of Gezer came up to help Lachish, but Joshua struck him and his people until he did not leave one survivor for him."},{"num":34,"verse":"Then Joshua and all Israel with him moved from Lachish to Eglon. They set up camp against it and waged war against it. "},{"num":35,"verse":"They captured it on that day and struck it with the edge of the sword, together with every living thing that was in it. On that day he devoted it to destruction, exactly as he had done to Lachish."},{"num":36,"verse":"Then Joshua and all Israel with him went up from Eglon to Hebron, and they waged war against it. "},{"num":37,"verse":"They captured it and struck it with the edge of the sword together with its king and all its settlements and every living thing that was in it. He did not leave a survivor, exactly as he had done to Eglon. He devoted it to destruction, along with every living thing in it."},{"num":38,"verse":"Next Joshua and all Israel with him turned back to Debir and waged war against it. "},{"num":39,"verse":"He captured it, together with its king and all its settlements. They struck them with the edge of the sword and devoted to destruction every living thing that was in it. He did not leave a survivor. Just as he had done to Hebron, so he did to Debir and its king, just as he had done to Libnah and its king."},{"num":40,"verse":"In this way Joshua struck the whole land: the hill country, the Negev, the Shephelah, and the slopes, together with all their kings. He did not leave a survivor. Every breathing thing he devoted to destruction, just as the Lord, the God of Israel, had commanded him. "},{"num":41,"verse":"Joshua struck them from Kadesh Barnea all the way to Gaza and from the whole land of Goshen all the way to Gibeon. "},{"num":42,"verse":"All of these kings and their land Joshua captured at one time because the Lord, the God of Israel, was fighting for Israel. "},{"num":43,"verse":"Then Joshua and all Israel with him returned to the camp at Gilgal."}]