[{"num":10,"verse":"When Adoni-zedek, the king of Jerusalem, heard how Joshua had captured and destroyed Ai and had killed its king, the same as he had done at Jericho, and how the people of Gibeon had made peace with Israel and were now their allies, "},{"num":2,"verse":"he was very frightened. For Gibeon was a great city—as great as the royal cities and much larger than Ai—and its men were known as hard fighters. "},{"num":3,"verse":"So King Adoni-zedek of Jerusalem sent messengers to several other kings: King Hoham of Hebron, King Piram of Jarmuth, King Japhia of Lachish, King Debir of Eglon."},{"num":4,"verse":"“Come and help me destroy Gibeon,” he urged them, “for they have made peace with Joshua and the people of Israel.”"},{"num":5,"verse":"So these five Amorite kings combined their armies for a united attack on Gibeon. "},{"num":6,"verse":"The men of Gibeon hurriedly sent messengers to Joshua at Gilgal."},{"num":7,"verse":"So Joshua and the Israeli army left Gilgal and went to rescue Gibeon."},{"num":8,"verse":"“Don’t be afraid of them,” the Lord said to Joshua, “for they are already defeated! I have given them to you to destroy. Not a single one of them will be able to stand up to you.”"},{"num":9,"verse":"Joshua traveled all night from Gilgal and took the enemy armies by surprise. "},{"num":10,"verse":"Then the Lord threw them into a panic so that the army of Israel slaughtered great numbers of them at Gibeon and chased the others all the way to Beth-horon and Azekah and Makkedah, killing them along the way. "},{"num":11,"verse":"And as the enemy was racing down the hill to Beth-horon, the Lord destroyed them with a great hailstorm that continued all the way to Azekah; in fact, more men died from the hail than by the swords of the Israelis."},{"num":12,"verse":"As the men of Israel were pursuing and harassing the foe, Joshua prayed aloud, “Let the sun stand still over Gibeon, and let the moon stand in its place over the valley of Aijalon!”"},{"num":13,"verse":"And the sun and the moon didn’t move until the Israeli army had finished the destruction of its enemies! This is described in greater detail in The Book of Jashar. So the sun stopped in the heavens and stayed there for almost twenty-four hours! "},{"num":14,"verse":"There had never been such a day before, and there has never been another since, when the Lord stopped the sun and moon—all because of the prayer of one man. But the Lord was fighting for Israel. "},{"num":15,"verse":"(Afterwards Joshua and the Israeli army returned to Gilgal.)"},{"num":16,"verse":"During the battle the five kings escaped and hid in a cave at Makkedah. "},{"num":17,"verse":"When the news was brought to Joshua that they had been found, "},{"num":18,"verse":"he issued a command that a great stone be rolled against the mouth of the cave and that guards be placed there to keep the kings inside."},{"num":19,"verse":"Then Joshua commanded the rest of the army, “Go on chasing the enemy and cut them down from the rear. Don’t let them get back to their cities, for the Lord will help you to completely destroy them.”"},{"num":20,"verse":"So Joshua and the Israeli army continued the slaughter and wiped out the five armies except for a tiny remnant that managed to reach their fortified cities. "},{"num":21,"verse":"Then the Israelis returned to their camp at Makkedah without having lost a single man! And after that no one dared to attack Israel."},{"num":22,"verse":"Joshua now instructed his men to remove the stone from the mouth of the cave and to bring out the five kings—of Jerusalem, Hebron, Jarmuth, Lachish, and Eglon. "},{"num":24,"verse":"Joshua told the captains of his army to put their feet on the kings’ necks."},{"num":25,"verse":"“Don’t ever be afraid or discouraged,” Joshua said to his men. “Be strong and courageous, for the Lord is going to do this to all of your enemies.”"},{"num":26,"verse":"With that, Joshua plunged his sword into each of the five kings, killing them. He then hanged them on five trees until evening."},{"num":27,"verse":"As the sun was going down, Joshua instructed that their bodies be taken down and thrown into the cave where they had been hiding; and a great pile of stones was placed at the mouth of the cave. (The pile is still there today.)"},{"num":28,"verse":"On that same day Joshua destroyed the city of Makkedah and killed its king and everyone in it. Not one person in the entire city was left alive. "},{"num":29,"verse":"Then the Israelis went to Libnah. "},{"num":30,"verse":"There, too, the Lord gave them the city and its king. Every last person was slaughtered, just as at Jericho."},{"num":31,"verse":"From Libnah they went to Lachish and attacked it. "},{"num":32,"verse":"And the Lord gave it to them on the second day; here, too, the entire population was slaughtered, just as at Libnah."},{"num":33,"verse":"During the attack on Lachish, King Horam of Gezer arrived with his army to try to help defend the city, but Joshua’s men killed him and destroyed his entire army."},{"num":34,"verse":"The Israeli army then captured Eglon on the first day and, as at Lachish, they killed everyone in the city. "},{"num":36,"verse":"After leaving Eglon they went to Hebron "},{"num":37,"verse":"and captured it and all of its surrounding villages, slaughtering the entire population. Not one person was left alive. "},{"num":38,"verse":"Then they turned back to Debir, "},{"num":39,"verse":"which they quickly captured with all of its outlying villages. And they killed everyone just as they had at Libnah."},{"num":40,"verse":"So Joshua and his army conquered the whole country—the nations and kings of the hill country, the Negeb, the lowlands, and the mountain slopes. They destroyed everyone in the land, just as the Lord God of Israel had commanded, "},{"num":41,"verse":"slaughtering them from Kadesh-barnea to Gaza, and from Goshen to Gibeon. "},{"num":42,"verse":"This was all accomplished in one campaign, for the Lord God of Israel was fighting for his people. "},{"num":43,"verse":"Then Joshua and his army returned to their camp at Gilgal."}]