[{"num":1,"verse":"The preparations of the heart are in man: but the answer of the tongue is of the Lord."},{"num":2,"verse":"All the ways of a man are clean in his own eyes: but the Lord pondereth the spirits."},{"num":3,"verse":"Commit thy works unto the Lord, and thy thoughts shall be directed."},{"num":4,"verse":"The Lord hath made all things for his own sake: yea, even the wicked for the day of evil."},{"num":5,"verse":"All that are proud in heart, are an abomination to the Lord: though hand join in hand, he shall not be unpunished."},{"num":6,"verse":"By mercy and truth iniquity shall be forgiven, and by the fear of the Lord they depart from evil."},{"num":7,"verse":"When the ways of a man please the Lord, he will make also his enemies at peace with him."},{"num":8,"verse":"Better is a little with righteousness, than great revenues without equity."},{"num":9,"verse":"The heart of man purposeth his way: but the Lord doth direct his steps."},{"num":10,"verse":"A divine sentence shall be in the lips of the king: his mouth shall not transgress in judgment."},{"num":11,"verse":"A true weight and balance are of the Lord: and the weights of the bag are his work."},{"num":12,"verse":"It is an abomination to kings to commit wickedness: for the throne is stablished by justice."},{"num":13,"verse":"Righteous lips are the delight of kings, and the king loveth him that speaketh right things."},{"num":14,"verse":"The wrath of a king is as messengers of death: but a wise man will pacify it."},{"num":15,"verse":"In the light of the king’s countenance is life: and his favor is as a cloud of the latter rain."},{"num":16,"verse":"How much better is it to get wisdom than gold? and to get understanding, is more to be desired than silver."},{"num":17,"verse":"The path of the righteous is to decline from evil, and he keepeth his soul that keepeth his way."},{"num":18,"verse":"Pride goeth before destruction, and an high mind before the fall."},{"num":19,"verse":"Better it is to be of humble mind with the lowly, than to divide the spoils with the proud."},{"num":20,"verse":"He that is wise in his business, shall find good: and he that trusteth in the Lord, he is blessed."},{"num":21,"verse":"The wise in heart shall be called prudent and the sweetness of the lips shall increase doctrine."},{"num":22,"verse":"Understanding is a wellspring of life unto them that have it: and the instruction of fools is folly."},{"num":23,"verse":"The heart of the wise guideth his mouth wisely, and addeth doctrine to his lips."},{"num":24,"verse":"Fair words are as an honey comb, sweetness to the soul, and health to the bones."},{"num":25,"verse":"There is a way that seemeth right unto man, but the issue thereof are the ways of death."},{"num":26,"verse":"The person that travaileth, travaileth for himself: for his mouth craveth it of him."},{"num":27,"verse":"A wicked man diggeth up evil, and in his lips is like burning fire."},{"num":28,"verse":"A froward person soweth strife: and a taleteller maketh division among princes."},{"num":29,"verse":"A wicked man deceiveth his neighbor, and leadeth him into the way that is not good."},{"num":30,"verse":"He shutteth his eyes to devise wickedness: he moveth his lips, and bringeth evil to pass."},{"num":31,"verse":"Age is a crown of glory, when it is found in the way of righteousness."},{"num":32,"verse":"He that is slow unto anger, is better than the mighty man: and he that ruleth his own mind, is better than he that winneth a city."},{"num":33,"verse":"The lot is cast into the lap: but the whole disposition thereof is of the Lord."}]