[{"num":16,"verse":"The plans of the heart belong to man, but the answer of the tongue is from the Lord."},{"num":2,"verse":"All the ways of a man are pure in his own eyes, but the Lord weighs the thoughts of the heart."},{"num":3,"verse":"Trust your work to the Lord, and your plans will work out well."},{"num":4,"verse":"The Lord has made all things for His own plans, even the sinful for the day of trouble."},{"num":5,"verse":"Everyone who is proud in heart is a shame to the Lord. For sure, that one will be punished."},{"num":6,"verse":"Sin has been paid for by loving-kindness and truth. The fear of the Lord keeps one away from sin."},{"num":7,"verse":"When the ways of a man are pleasing to the Lord, He makes even those who hate him to be at peace with him."},{"num":8,"verse":"A little earned in a right way is better than much earned in a wrong way."},{"num":9,"verse":"The mind of a man plans his way, but the Lord shows him what to do."},{"num":10,"verse":"The lips of the king should decide as God would. His mouth should not sin in deciding what is right or wrong."},{"num":11,"verse":"What is fair in telling the weight of something belongs to the Lord. He cares about all the weights of the bag."},{"num":12,"verse":"It is a hated thing for kings to do what is wrong. For a throne is built on what is right."},{"num":13,"verse":"Lips that speak what is right and good are the joy of kings, and he who speaks the truth is loved."},{"num":14,"verse":"The anger of a king carries death, but a wise man will quiet it."},{"num":15,"verse":"Life is in the light of a king’s face, and his favor is like a cloud bringing the spring rain."},{"num":16,"verse":"To get wisdom is much better than getting gold. To get understanding should be chosen instead of silver."},{"num":17,"verse":"The road of the faithful turns away from sin. He who watches his way keeps his life."},{"num":18,"verse":"Pride comes before being destroyed and a proud spirit comes before a fall."},{"num":19,"verse":"It is better to be poor in spirit among poor people, than to divide the riches that were taken with the proud."},{"num":20,"verse":"He who listens to the Word will find good, and happy is he who trusts in the Lord."},{"num":21,"verse":"The wise in heart will be called understanding. And to speak in a pleasing way helps people know what you say is right."},{"num":22,"verse":"Understanding is a well of life to him who has it, but to speak strong words to fools is of no use."},{"num":23,"verse":"The heart of the wise has power over his mouth and adds learning to his lips."},{"num":24,"verse":"Pleasing words are like honey. They are sweet to the soul and healing to the bones."},{"num":25,"verse":"There is a way that looks right to a man, but its end is the way of death."},{"num":26,"verse":"A workman’s hunger works for him. The need of his mouth pushes him on."},{"num":27,"verse":"A man of no worth looks for wrong-doing. His words are like burning fire."},{"num":28,"verse":"A bad man spreads trouble. One who hurts people with bad talk separates good friends."},{"num":29,"verse":"A man who hurts people tempts his neighbor to do the same, and leads him in a way that is not good."},{"num":30,"verse":"He who winks his eyes plans to do bad things. He who closes his lips allows sinful things to happen."},{"num":31,"verse":"Hair that is turning white is like a crown of honor. It is found in the way of being right with God."},{"num":32,"verse":"He who is slow to anger is better than the powerful. And he who rules his spirit is better than he who takes a city."},{"num":33,"verse":"Man decides by throwing an object into the lap, but it is the Lord only who decides."}]