[{"header":"Pharaoh: a Lion or a Dragon?"},{"num":32,"verse":"On the first day of the twelfth month in the twelfth year of exile, the word of the Lord came to me. He said,"},{"num":2,"verse":"“Son of man, sing this sad song about Pharaoh, king of Egypt. Say to him:"},{"num":3,"verse":"This is what the Lord God says:"},{"num":9,"verse":"“I will make many people sad and upset when I bring an enemy to destroy you. Nations you don’t even know will be upset."},{"num":10,"verse":"I will make many people shocked about you. Their kings will be terrified of you, when I swing my sword before them. They will shake with fear on the day you fall. Each king will be afraid for his own life.”"},{"num":11,"verse":"That will happen because of what the Lord God said: “The sword of the king of Babylon will come to fight against you."},{"num":12,"verse":"I will use those soldiers to kill your people in battle. They come from the most terrible of the nations. They will destroy the things Egypt is proud of. The people of Egypt will be destroyed."},{"num":13,"verse":"There are many animals by the rivers in Egypt. I will also destroy all those animals. People will not make the waters muddy with their feet anymore. The hoofs of cattle will not make the water muddy anymore."},{"num":14,"verse":"So I will make the water in Egypt calm. I will cause their rivers to run slowly—they will be slick like oil.” This is what the Lord God said."},{"num":15,"verse":"“I will make the land of Egypt empty. That land will lose everything. I will punish all the people living in Egypt. Then they will know that I am the Lord!"},{"num":16,"verse":"“This is a sad song that people will sing for Egypt. The daughters in other nations will sing this sad song. They will sing it as a sad song about Egypt and all its people.” This is what the Lord God said."},{"header":"Egypt to Be Destroyed"},{"num":17,"verse":"On the fifteenth day of that month in the twelfth year of exile, the word of the Lord came to me. He said,"},{"num":18,"verse":"“Son of man, cry for the people of Egypt. Lead Egypt and the daughters from powerful nations to the grave. Lead them to the world below where they will be with the other people who went down into that deep hole."},{"num":19,"verse":"“Egypt, you are no better than anyone else! Go down to the place of death. Go lie down with those foreigners."},{"num":20,"verse":"“Egypt will go to be with all the other men who were killed in battle. The enemy has pulled her and all her people away."},{"num":21,"verse":"“Strong and powerful men were killed in battle. Those foreigners went down to the place of death. And from that place, those who were killed will speak to Egypt and his helpers."},{"num":22,"verse":"“Assyria and all its army are there in the place of death. Their graves are deep down in that deep hole. All the Assyrian soldiers were killed in battle, and their graves are all around his grave. When they were alive, they made people afraid, but they were all killed in battle."},{"num":24,"verse":"“Elam is there and all its army is around her grave. All of them were killed in battle. Those foreigners went deep down into the ground. When they were alive, they made people afraid. But they carried their shame with them down to that deep hole."},{"num":25,"verse":"They have made a bed for Elam and all its soldiers who were killed in battle. Elam’s army is all around its grave. All those foreigners were killed in battle. When they were alive, they scared people. But they carried their shame with them down into that deep hole. They were put with all the other people who were killed."},{"num":26,"verse":"“Meshech, Tubal, and all their armies are there. Their graves are around it. All those foreigners were killed in battle. When they were alive, they made people afraid."},{"num":27,"verse":"But now they are lying down by the powerful men who died long, long ago! They were buried with their weapons of war. Their swords will be laid under their heads. But their sins are on their bones, because when they were alive, they scared people."},{"num":28,"verse":"“Egypt, you also will be destroyed, and you will lie down by those foreigners. You will lie with the other soldiers who were killed in battle."},{"num":29,"verse":"“Edom is there also. His kings and other leaders are there with him. They were powerful soldiers, but now they lie with the other men who were killed in battle. They are lying there with those foreigners. They are there with the other people who went down into that deep hole."},{"num":30,"verse":"“The rulers from the north are there, all of them, and there are all the soldiers from Sidon. Their strength scared people, but they are embarrassed. Those foreigners lie there with the other men who were killed in battle. They carried their shame with them down into that deep hole."},{"num":31,"verse":"“Yes, Pharaoh and all his army will be killed in battle. Pharaoh will be comforted when he sees his many men and all the others who went down into the place of death.” This is what the Lord God said."},{"num":32,"verse":"“People were afraid of Pharaoh when he was alive, but he will lie down next to those foreigners. Pharaoh and his army will lie down with all the other soldiers who were killed in battle.” This is what the Lord God said."}]