[{"num":32,"verse":"And it came to pass in the twelfth year, in the twelfth month, in the first day of the month, that the Devar Hashem came unto me, saying,"},{"num":2,"verse":"Ben adam, take up a kinah (lamentation) for Pharaoh Melech Mitzrayim, and say unto him, Thou art like a lion of the Goyim, and thou art as a sea monster in the yamim (seas); and thou thrash about in thy rivers, and troubledst the mayim with thy feet, and fouledst their rivers."},{"num":3,"verse":"Thus saith Adonoi Hashem: I will therefore spread out My net over thee with a kahal of amim rabbim; and they shall draw thee up in My net."},{"num":4,"verse":"Then will I throw thee upon ha’aretz, I will cast thee forth upon the open sadeh, and will cause all the oph HaShomayim to settle upon thee, and I will fill the beasts of kol ha’aretz (the whole earth) with thee."},{"num":5,"verse":"And I will lay thy basar upon the harim, and fill the ge’ayot (valleys) with thy height."},{"num":6,"verse":"I will also water with thy flowing dahm eretz even up to the harim; and the ravines shall be full of thee."},{"num":7,"verse":"And when I shall put out thy light, I will cover the Shomayim, and make the kokhavim thereof dark; I will cover the shemesh with an anan (cloud), and the yarei’ach (moon) shall not give her light."},{"num":8,"verse":"All the bright lights of Shomayim will I make dark over thee, and set choshech upon thy land, saith Adonoi Hashem."},{"num":9,"verse":"I will also trouble the hearts of amim rabbim (many peoples), when I shall bring thy destruction among the Goyim, into the countries which thou hast not known."},{"num":10,"verse":"Indeed, I will make amim rabbim (many peoples) appalled at thee, and their melachim shall be horribly afraid because of thee when I brandish My cherev before them; and they shall tremble at every moment, every ish for his own nefesh, in the day of thy downfall."},{"num":11,"verse":"For thus saith Adonoi Hashem: Cherev of Melech Bavel shall come upon thee."},{"num":12,"verse":"By the charavot (swords) of the gibborim (mighty) will I cause thy multitude to fall, the most terrible of the Goyim, all of them; and they shall plunder the ga’on (pomp) of Mitzrayim, and all the multitude thereof shall be made shmad."},{"num":13,"verse":"I will destroy also all the behemah thereof from beside the mayim rabbim; neither shall the regel adam muddy them any more, nor the hooves of beasts muddy them."},{"num":14,"verse":"Then will I make their mayim clear, and cause their rivers to run like shemen, saith Adonoi Hashem."},{"num":15,"verse":"When I shall make Eretz Mitzrayim desolate, and the country shall be destitute of that whereof it was full, when I shall strike all them that dwell therein, then shall they know that I am Hashem."},{"num":16,"verse":"This is the kinah (lamentation) wherewith they shall lament her; the banot of the Goyim shall lament her; they shall lament for her, even for Mitzrayim, and for all her multitude, saith Adonoi Hashem."},{"num":17,"verse":"It came to pass also in the twelfth year, in the fifteenth day of the month, that the Devar Hashem came unto me, saying,"},{"num":18,"verse":"Ben adam, wail for the multitude of Mitzrayim, and send them down, even her, and the banot of the mighty Goyim, unto the depths of ha’aretz, with them that go down into the bor (pit)."},{"num":19,"verse":"Whom dost thou surpass in beauty? Go down, and be thou laid with the arelim (uncircumcised)."},{"num":20,"verse":"They shall fall in the midst of them that are slain by the cherev; she is delivered to the cherev; drag her off and all her multitudes."},{"num":21,"verse":"The mightiest among the gibborim shall speak to him out of the midst of Sheol with them [that as allies] help him; they are gone down, they lie with the arelim (uncircumcised), slain by the cherev."},{"num":22,"verse":"Ashur (Assyria) is there and all her kahal; his kevarim are about him; all of them slain, fallen by the cherev;"},{"num":23,"verse":"Whose kevarim are set in the recesses of the bor (pit), and her kahal (company) is all around her kevurah; all of them slain, fallen by the cherev, which caused terror in Eretz Chayyim."},{"num":24,"verse":"There is Elam and all her multitude around her kevurah, all of them slain, fallen by the cherev, which are gone down arelim (uncircumcised) into the lower parts of ha’aretz, which caused their terror in Eretz Chayyim; yet have they borne their shame with them that go down to the bor (pit)."},{"num":25,"verse":"They have set her a mishkav (bed) in the midst of the slain with all her multitude; her kevarim are all around him; all of them arelim (uncircumcised), slain by the cherev; for they spread terror in Eretz Chayyim, yet have they borne their shame with them that go down to the bor (pit); he is put in the midst of them that are slain."},{"num":26,"verse":"There is Meshech, Tuval, and all her multitude; her kevarim are all around him; all of them arelim (uncircumcised), slain by the cherev, though they caused their terror in Eretz Chayyim."},{"num":27,"verse":"And they shall not lie with the gibborim that are fallen of the arelim (uncircumcised), which are gone down to Sheol with their weapons of milchamah; and they have laid their charavot (swords) under their heads, but their avonot shall be upon their atzmot, though they were the terror of the gibborim in Eretz Chayyim."},{"num":28,"verse":"Indeed, thou shalt be broken in the midst of the arelim (uncircumcised), and shalt lie with them that are slain with the cherev."},{"num":29,"verse":"There is Edom, her melachim, and all her nasi’im, which despite their gevurah (might) are laid beside them that were slain by the cherev; they shall lie with the arelim (uncircumcised), and with them that go down to the bor."},{"num":30,"verse":"There are the princes of the north, all of them, and all those of Tzidon, which are gone down with the slain; in shame at the terror which they caused by their gevurah (might); and they lie as arelim (uncircumcised) with them that be slain by the cherev, and bear their shame with them that go down to the bor."},{"num":31,"verse":"Pharaoh shall see them, and shall be consoled over all his multitude, even Pharaoh and all his army slain by the cherev, saith Adonoi Hashem."},{"num":32,"verse":"For I have caused My terror in Eretz Chayyim; and he shall be laid in the midst of the arelim (uncircumcised) with them that are slain with the cherev, even Pharaoh and all his multitude, saith Adonoi Hashem."}]