[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A river . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nāhar, i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "a perennial stream, as distinguished from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nāchal, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "a torrent bed dry except in the rainy season. Plainly, then, the “Cedron” is not here alluded to. But many commentators think “Siloam” is intended. (See Stanley, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sinai and Palestine, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "p. 180, and comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 47:1-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There may not, however, be any such local allusion. The river, flowing calmly and smoothly along, may be only a symbol of the peace and blessing of the Divine presence, as the tumult and tempest of the sea in the last verse are of the world’s noisy troubles. Indeed, the LXX. (comp. Prayer Book version) seems to connect the river of this verse with the waters of the preceding.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Streams.—See Note on Psalm 1:3, where the same word occurs.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Streams.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—See Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the same word occurs.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE CITY AND RIVER OF GODPsalm 46:4 - Psalm 46:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE CITY AND RIVER OF GOD",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are two remarkable events in the history of Israel, one or other of which most probably supplied the historical basis upon which this psalm rests. One is that wonderful deliverance of the armies of Jehoshaphat from the attacking forces of the bordering nations, which is recorded in the twentieth chapter of the Book of Chronicles. There you will find that, by a singular arrangement, the sons of Korah, members of the priestly order, were not only in the van of the battle, but celebrated the victory by hymns of gladness. It is possible that this may be one of those hymns; but I think rather that the more ordinary reference is the correct one, which sees in this psalm and in the two succeeding ones, echoes of that supernatural deliverance of Israel in the time of Hezekiah, when",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘The Assyrian came down like a wolf on the fold,’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "and Sennacherib and all his army were, by the blast of the breath of His nostrils, swept into swift destruction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The reasons for that historical reference may be briefly stated. We find, for instance, a number of remarkable correspondences between these three psalms and portions of the Book of the prophet Isaiah, who, as we know, lived in the period of that deliverance. The comparison, for example, which is here drawn with such lofty, poetic force between the quiet river which ‘makes glad the city of God,’ and the tumultuous billows of the troubled sea, which shakes the mountain and moves the earth, is drawn by Isaiah in regard to the Assyrian invasion, when he speaks of Israel refusing ‘the waters of Shiloah, which go softly,’ and, therefore, having brought upon them the waters of the river-the power of Assyria-’which shall fill the breadth of Thy land, O Immanuel!’ Notice, too, that the very same consolation which was given to Isaiah, by the revelation of that significant appellation, ‘Immanuel, God with us,’ appears in this psalm as a kind of refrain, and is the foundation of all its confident gladness, ‘The Lord of Hosts is with us.’ Besides these obvious parallelisms, there are others to which I need not refer, which, taken together, seem to render it at least probable that we have in this psalm the devotional echo of the great deliverance of Israel from Assyria in the time of Hezekiah.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, these verses are the cardinal central portion of the song. We may call them The Hymn of the Defence and Deliverance of the City of God. We cannot expect to find in poetry the same kind of logical accuracy in the process of thought which we require in treatises; but the lofty emotion of devout song obeys laws of its own: and it is well to surrender ourselves to the flow, and to try to see with the Psalmist’s eyes for a moment his sources of consolation and strength.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I take the four points which seem to be the main turning-points of these verses-first, the gladdening river; second, the indwelling Helper; third, the conquering voice; and fourth, the alliance of ourselves by faith with the safe dwellers in the city of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, we have the gladdening river-an emblem of many great and joyous truths. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, we have the gladdening river-an emblem of many great and joyous truths.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The figure is occasioned by, or at all events derives much of its significance from, a geographical peculiarity of Jerusalem. Alone among the great cities and historical centres of the world, it stood upon no broad river. One little perennial stream, or rather rill of living water, was all which it had; but Siloam was mightier and more blessed for the dwellers in the rocky fortress of the Jebusites than the Euphrates, Nile, or Tiber for the historical cities which stood upon their banks. One can see the Psalmist looking over the plain eastward, and beholding in vision the mighty forces which came against them, symbolised and expressed by the breadth and depth and swiftness of the great river upon which Nineveh sat as a queen, and then thinking upon the little tiny thread of living water that flowed past the base of the rock upon which the temple was perched. It seems small and unconspicuous-nothing compared to the dash of the waves and the rise of the floods of those mighty secular empires, still, ‘There is a river the streams whereof shall make glad the city of God.’ Its waters shall never fail, and thirst shall flee whithersoever this river comes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is also to be remembered that the psalm is running in the track of a certain constant symbolism that pervades all Scripture. From the first book of Genesis down to the last chapter of Revelation, you can hear the dashing of the waters of the river. ‘It went out from the garden and parted into four heads.’ ‘Thou makest them drink of the river of Thy pleasures.’ ‘Behold, waters issued out from under the threshold of the house eastward,’ and ‘everything shall live whithersoever the river cometh.’ ‘He that believeth on me, out of His belly shall flow rivers of living water.’ ‘And he shewed me a pure river of water of life, clear as crystal, proceeding out of the throne of God and of the Lamb.’ Isaiah, who has already afforded some remarkable parallels to the words of our psalm, gives another very striking one to the image now under consideration, when he says, ‘The glorious Lord will be unto us a place of broad rivers and streams, wherein shall go no galley with oars.’ The picture in that metaphor is of a stream lying round Jerusalem, like the moated rivers which girdle some of the cities in the plains of Italy, and are the defence of those who dwell enclosed in their flashing links.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Guided, then, by the physical peculiarity of situation which I have referred to, and by the constant meaning of Scriptural symbolism, I think we must conclude that this river, ‘the streams whereof make glad the city of God,’ is God Himself in the outflow and self-communication of His own grace to the soul. The stream is the fountain in flow. The gift of God, which is living water, is God Himself, considered as the ever-imparting Source of all refreshment, of all strength, of all blessedness. ‘This spake He of the Spirit, which they that believe should receive.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We must dwell for a moment or two still further upon these words, and mark how this metaphor, in a most simple and natural way, sets forth very grand and blessed spiritual truths with regard to this communication of God’s grace to them that love Him and trust Him. First, I think we may see here a very beautiful suggestion of the manner, and then of the variety, and then of the effects of that communication of the divine love and grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We have only to read the previous verses to see what I mean. ‘God is our refuge and strength, a very present help in trouble. Therefore will not we fear, though the earth be removed, and though the mountains be carried into the midst of the sea; though the waters thereof roar and be troubled, though the mountains shake with the swelling thereof.’ There you can hear the wild waves dashing round the base of the firm hills, sapping their strength, and toppling their crests down in the bubbling, yeasty foam. Remember how, not only in Scripture but in all poetry, the sea has been the emblem of endless unrest. Its waters, those barren, wandering fields of foam, going moaning round the world with unprofitable labour, how they have been the emblem of unbridled power, of tumult and strife, and anarchy and rebellion! Then mark how our text brings into sharpest contrast with all that hurly-burly of the tempest, and the dash and roar of the troubled waters, the gentle, quiet flow of the river, ‘the streams whereof make glad the city of God’; the translucent little ripples purling along beds of golden pebbles, and the enamelled meadows drinking the pure stream as it steals by them. Thus, says our psalm, not with noise, not with tumult, not with conspicuous and destructive energy, but in silent, secret underground communication, God’s grace, God’s love, His peace, His power, His almighty and gentle Self flow into men’s souls. Quietness and confidence on our sides correspond to the quietness and serenity with which He glides into the heart. Instead of all the noise of the sea you have within the quiet impartations of the voice that is still and small, wherein God dwells. The extremest power is silent. The mightiest force in all the universe is the force which has neither speech nor language. The parent of all physical force, as astronomers seem to be more and more teaching us, is the great central sun which moveth all things, which operates all physical changes, whose beams are all but omnipotent, and yet fall so quietly that they do not disturb the motes that dance in their path. Thunder and lightning are child’s play compared with the energy that goes to make the falling dews and quiet rains. The power of the sunshine is the root power of all force which works in material things. And so we turn, with the symbol in our hands, to the throne of God, and when He says, ‘Not by might, nor by power, but by My Spirit,’ we are aware of an energy, the signature of whose might is its quietness, which is omnipotent because it is gentle and silent. The seas may roar and be troubled, the tiny thread of the river is mightier than them all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then, still further, in this first part of our text there is also set forth very distinctly the number and the variety of the gifts of God. ‘The streams whereof,’ literally, ‘the divisions whereof,’-that is to say, going back to Eastern ideas, the broad river is broken up into canals that are led off into every man’s little bit of garden ground; coming down to modern ideas, the water is carried by pipes into every man’s household and chamber. The stream has its divisions; listen to words that are a commentary upon the meaning of this verse, ‘All these worketh that one and the selfsame Spirit, dividing unto every man severally as He will’-an infinite variety, an endless diversity, according to all the petty wants of each that is supplied thereby. As you can divide water all but infinitely, and it will take the shape of every containing vessel, so into every soul according to its capacities, according to its shape, according to its needs, this great gift, this blessed presence of the God of our strength, will come. The varieties of His gifts are as much the mark of His omnipotence as the gentleness and stillness of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then I need only touch upon the last thought, the effects of this communicated God. ‘The streams make glad’-with the gladness which comes from refreshment, with the gladness which comes from the satisfying of all thirsty desires, with the gladness which comes from the contact of the spirit with absolute completeness; of the will, with perfect authority; of the heart, with changeless love; of the understanding, with pure incarnate truth; of the conscience, with infinite peace; of the child, with the Father; of my emptiness, with His fulness; of my changeableness, with His immutability; of my incompleteness, with His perfectness. They to whom this stream passes shall know no thirst; they who possess it from them it shall come. Out of him ‘shall flow rivers of living water.’ That all-sufficient Spirit not only becomes to its possessor the source of individual refreshment, and slakes his own thirst, but flows out from him for the gladdening of others.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘The least flower with a brimming cup may stand,And share its dew-drop with another near.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘The least flower with a brimming cup may stand,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And share its dew-drop with another near.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The city thus supplied may laugh at besieging hosts. With the deep reservoir in its central fortress, the foe may do as they list to all surface streams, its water shall be sure, and no raging thirst shall ever drive it to surrender. The river breaks from the threshold of the Temple, within its walls, and when all beyond that safe enclosure is cracked and parched in the fierce heat, and no green thing can be seen in the dry and thirsty land, that stream shall ‘make glad the city of our God,’ and ‘everything shall live whithersoever the river cometh.’ ‘Thou shalt be as a well-watered garden, and as a river whose streams fail not.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Then notice, secondly, substantially the same general thought, but modified and put in plain words-the indwelling Helper. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Then notice, secondly, substantially the same general thought, but modified and put in plain words-the indwelling Helper.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘God is in the midst of her, she shall not be moved: God shall help her, and that right early,’ or, as the latter clause had better be translated, as it is given in the margin of some of our Bibles, ‘God shall help her at the appearance of the morning.’ There are two promises here: first of all, the constant presence; and second, help at the right time. Whether there be actual help or no, there is always with us the potential help of God, and it flashes into energy at the moment that He knows to be the right one. The ‘appearing of the morning’ He determines; not you or I. Therefore, we may be confident that we have God ever by our sides. Not that that Presence is meant to avert outward or inward trouble and trial, and painfulness and weariness; but in the midst of these, and while they last, here is the assurance, ‘She shall not be moved’; and that it will not always last, here is the ground of the confidence, ‘God shall help her when the morning dawns.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I need not point out to you the contrast here between the tranquillity of the city which has for its central Inhabitant and Governor the omnipotent God, and the tumult of all that turbulent earth. The waves of the troubled waters break everywhere,-they run over the flat plains and sweep over the mountains of secular strength and outward might, and worldly kingdoms, and human polities and earthly institutions, acting on them all either by slow corrosive action at the base, or by the tossing floods swirling against them, until they shall be lost in the ocean of time. For ‘the history of the world is the judgment of the world.’ When He wills the plains are covered and mountains disappear, but one rock stands fast-’The mountain of the Lord’s house is exalted above the top of the mountains’; and when everything is rocking and swaying in the tempests, here is fixity and tranquillity. ‘She shall not be moved.’ Why? Because of her citizens? No. Because of her guards and gates? No! Because of her polity? No! Because of her orthodoxy? No! But because God is in her, and she is safe, and where He dwells no evil can come. ‘Thou carriest Caesar and his fortunes.’ The ship of Christ carries the Lord and His fortunes; and, therefore, whatsoever becomes of the other little ships in the wild dash of the tempest, this with the Lord on board arrives at its desired haven-’God is in the midst of her, she shall not be moved.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, still further, that Presence which is always the pledge of stability, and unmoved calm, even while causes of agitation are storming around, will, as I said, flash into energy, and be a Helper and a Deliverer at the right moment. And when will that right moment be? At the appearing of the morning. ‘And when they arose early in the morning, they were all dead corpses’; in the hour of greatest extremity, but ere the foe has executed his purposes; not too soon for fear and faith, not too late for hope and help; when the morning dawns, when the appointed hour of deliverance, which He alone determines, has struck. ‘It is not for you to know the times and seasons’; but this we may know, that He who is the Lord of time will ever save at the best possible moment. He will not come so quickly as to prevent us from feeling our need; He will not tarry so long as to make us sick with hope deferred, or so long as to let the enemy fulfil his purposes of destruction. ‘Lord, behold! he whom Thou lovest is sick. Now Jesus loved Martha, and her sister, and Lazarus. When He had heard therefore that he was sick, He abode two days still in the same place where He was. . . . Lord, if Thou hadst been here, my brother had not died. Jesus saith unto her, Thy brother shall rise again. . . . And he that was dead came forth.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Lord may seem to sleep on His hard wooden pillow in the stern of the little fishing boat, and even while the frail craft begins to fill may show no sign of help. But ere the waves have rolled over her, the cry of fear that yet trusts, and of trust that yet fears, wakes Him who knew the need, even while He seemed to slumber, and one mighty word, as of a master to some petulant slave, ‘Peace! be still,’ hushes the confusion, and rebukes the fear, and rewards the faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘The Lord is in the midst of her’-that is the perennial fact. ‘The Lord shall help her, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " right early’-that is the ‘grace for seasonable help.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The psalm having set forth these broad grounds of confidence, goes on to tell the story of actual deliverance which confirms them, and of which they are indeed but the generalised expression. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The psalm having set forth these broad grounds of confidence, goes on to tell the story of actual deliverance which confirms them, and of which they are indeed but the generalised expression.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The condensed narrative moves to its end by a series of short crashing sentences like the ring of the destructive axe at the roots of trees. We see the whole sequence of events as by lightning flashes, which give brief glimpses and are quenched. The grand graphic words seem to pant with haste, as they record Israel’s deliverance. That deliverance comes from the Conquering Voice. ‘The heathen raged’ {the same word, we may note, as is found a verse or two back, ‘Though the waters thereof ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "roar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’}, ‘the kingdoms were moved; He uttered His voice, the earth melted.’ With what vigour these hurried sentences describe, first, the wild wrath and formidable movements of the foe, and then the One Sovereign Word which quells them all, as well as the instantaneous weakness that dissolves the seeming solid substance when the breath of His lips smites it!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And where will you find a grander or loftier thought than this, that the simple word-the utterance of the pure will of God conquers all opposition, and tells at once in the sphere of material things? He speaks, and it is done. At the sound of that thunder-voice, hushed stillness and a pause of dread fall upon all the wide earth, deeper and more awe-struck than the silence of the woods with their huddling leaves, when the feebler peals roll through the sky. ‘The depths are congealed in the heart of the sea’-as if you were to lay hold of Niagara in its wildest plunge, and were with a word to freeze all its descending waters and stiffen them into immovableness in fetters of eternal ice. So He utters His voice, and all meaner noises are hushed. ‘The lion hath roared, who shall not fear?’ He speaks-no weapon, no material vehicle is needed. The point of contact between the pure divine will and the material creatures which obey its behests is ever wrapped in darkness, whether these be the settled ordinances which men call nature, or the less common which the Bible calls miracle. In all alike there is, to every believer in a God at all, an incomprehensible action of the spiritual upon the material, which allows of no explanations to bridge over the gulf recognised in the broken utterances of our psalm, ‘He uttered His voice: the earth melted.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How grandly, too, these last words give the impression of immediate and utter dissolution of all opposition! All the Titanic brute forces are, at His voice, disintegrated, and lose their organisation and solidity. ‘The hills melted like wax’; ‘The mountains flowed down at Thy presence.’ The hardness and obstinacy is all liquefied and enfeebled, and parts with its consistency and is lost in a fluid mass. As two carbon points when the electric stream is poured upon them are gnawed to nothingness by the fierce heat, and you can see them wasting before your eyes, so the concentrated ardour of His breath falls upon the hostile evil, and lo! it is not.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Psalmist is generalising the historical fact of the sudden and utter destruction of Sennacherib’s host into a universal law. And it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a universal law-true for us as for Hezekiah and the sons of Korah, true for all generations. Martin Luther might well make this psalm the battle cry of the Reformation, and we may well make our own the rugged music and dauntless hope of his rendering of these words:-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘And let the Prince of IllLook grim as e’er he will,He harms us not a whit.For why? His doom is writ.A word shall quickly slay him.’",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘And let the Prince of Ill",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Look grim as e’er he will,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "He harms us not a whit.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "For why? His doom is writ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "A word shall quickly slay him.’",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. Then note, finally, how the psalm shows us the act by which we enter the City of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. Then note, finally, how the psalm shows us the act by which we enter the City of God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘The Lord of Hosts is with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the God of Jacob is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refuge.’ It is not enough to lay down general truths, however true and however blessed, about the safe and sacred city of God-not enough to be theoretically convinced of the truth of the supreme governance and ever-present aid of God. We must take a further step that will lead us far beyond the regions of barren intellectual apprehension of the great truths of God’s love and care. These truths are nothing to us, brethren! unless, like the Psalmist here, we make them our own, and losing the burden of self in the very act of grasping them by faith, unite ourselves with the great multitude who are joined together in Him, and say, ‘He is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God: He is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " refuge.’ That living act of ‘appropriating faith’ presupposes, indeed, the presence of these truths in our understandings, but in the very act they are changed into powers in our lives. They pass into the affections and the will. They are no more empty generalities. Bread nourishes, not when it is looked at, but when it is eaten. ‘He that eateth Me, even he shall live by Me.’ We feed on Christ when we make Him ours by faith, and each of us is sustained and blessed by Him when we can say, ‘My Lord and my God!’ Mark, too, how there is here set forth the twofold ground for our calmest confidence in these two mighty names of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘The Lord of Hosts is with us.’ That majestic name includes all the deepest and most blessed thoughts of God which the earlier revelation imparted. That name of ‘Jehovah’ proclaims at once His Eternal Being and His covenant relation-manifesting Him by its mysterious meaning as He who dwells above time, the tideless sea of absolute unchanging existence, from whom all the stream of creatural life flows forth many-coloured and transient, to whom it all returns, who, Himself unchanging, changeth all things, and declaring Him, by the historical associations connected with it, as having unveiled His purposes in firm words, to which men may trust, and as having entered into that solemn league with Israel which underlay their whole national life. He is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Eternal,-the covenant name.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He is the Lord of Hosts, the ‘Imperator,’ absolute Master and Commander, Captain and King of all the combined forces of the universe, whether they be personal or impersonal, spiritual or material, who, in serried ranks, wait on Him, and move harmonious, obedient to His will. And this Eternal Master of the legions of the universe is with us, weak and poor, and troubled and sinful as we are. Therefore, we will not fear: what can man do unto us?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Again, when we say, ‘The God of Jacob is our refuge,’ we reach back into the past, and lay hold of the mercies promised to, and received by, the long vanished generations who trusted in Him and were lightened. As, by the one name, we appeal to His own Being and uttered pledge, so, by the other, we appeal to His ancient deeds-past as we call them, but present with Him, who lives and loves in the undivided eternity above the low fences of time. All that He has been, He is; all that He has done, He is doing. We on whom the ends of the earth are come have the same Helper, the same Friend that ‘the world’s grey fathers’ had. They that go before do not prevent them that come after. The river is full still. The van of the pilgrim host did, indeed, long, long ago drink and were satisfied, but the bright waters are still as pellucid, still as near, still as refreshing, still as abundant as they ever were. Nay, rather, they are fuller and more accessible to us than to patriarch and Psalmist, ‘God having provided some better thing for us, that they without us should not be made perfect.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For we, brethren! have a fuller revelation of that mighty name, and a more wondrous and closer divine presence by our sides. The psalm rejoices in that ‘The Lord of Hosts is with us’; and the choral answer of the Gospel swells into loftier music, as it tells of the fulfilment of psalmists’ hopes and prophets’ visions in Him who is called ‘Immanuel,’ which is, being interpreted, ‘God with us.’ The psalm is confident in that God dwelt in Zion, and our confidence has the more wondrous fact to lay hold of, that even now the Word who dwelt among us makes His abode in every believing heart, and gathers them all together at last in that great city, round whose flashing foundations no tumult of ocean beats, whose gates of pearl need not be closed against any foes, with whose happy citizens ‘God will dwell, and they shall be His people, and God Himself shall be with them, and be their God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 46:4-5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:4-5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There is a river, the streams whereof make glad the city — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The church, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which cheer, refresh, and comfort her, and that at a time when the waters of the sea roar, and foam, and threaten her. He alludes to the brook Kidron, and its two streams, or rivulets, flowing from it, Gihon and Siloah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 32:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whose waters went softly by Jerusalem, and, being small and contemptible, or still and gentle, are not unfitly opposed to the vast and unruly waters of the sea. He insinuates the weak condition of God’s church, as to outward appearance, in that they had not one sea to oppose to another, but only a small river; which, however, though in itself apparently despicable, yet was sufficient to refresh and defend them in spite of their enemies. Now, as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sea ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "waters ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "thereof are to be understood metaphorically, so also are this river and its streams. The covenant of grace is the river, and its promises are the streams; or, the Spirit of grace is the river, and its influences, operations, and graces, are the streams. God’s word and ordinances are rivers and streams, with which he makes his saints glad in cloudy and dark days. God himself is to his church ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a place of broad rivers and streams, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Mark, reader, the streams that make glad the city of God, are not rapid, but gentle, like those of Siloam. And observe, also, the spiritual comforts which are conveyed to the saints by soft and silent whispers, and which come not with observation, or rather, with outward noise and show, are sufficient to balance the most loud and boisterous threatenings of an angry and malicious world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The city of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Zion or Jerusalem, a figure of God’s church; and here, as frequently, put for it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the holy place of the tabernacles — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The place where God’s holy tabernacle is settled, the plural number being put for the singular, because the tabernacle included two apartments, the holy place, and the most holy, besides the different courts adjoining to it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is in the midst of her —",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Not only by those symbols of his presence, the ark, the mercy-seat, and cherubim of glory, but by his own special residence, according to his promise. He is peculiarly present with and in his church, in all ages. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "She shall not be moved — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That Isaiah , 1 st, Not destroyed or removed as the earth may be, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 46:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) God having undertaken her protection, and his honour being embarked in her. The church shall survive the world, and be in bliss when the world is in ruins. 2d, Not disturbed; not much moved with fears of the issue. If God be with us we need not be moved at the most violent attempts made against us. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God shall help her — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Who then can hurt her? He shall help her ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "under her troubles; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that she shall not sink; nay, that the more she is afflicted, the more she shall multiply. God shall help her ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of her troubles; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "right early, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "לפנות בקר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "liphnoth boker, before the morning, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when the morning appeareth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, very speedily, for he is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "present help, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 46:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and very seasonably; then when things are brought to the last extremity, and when the relief will be most welcome. This may be applied by particular believers to themselves: if God be in the midst of us, in our hearts, by his word and Spirit, we shall be established, we shall be helped in time of need; let us therefore trust and not be afraid: all is well and will end well.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "46:1-5 This psalm encourages to hope and trust in God; in his power and providence, and his gracious presence with his church in the worst of times. We may apply it to spiritual enemies, and the encouragement we have that, through Christ, we shall be conquerors over them. He is a Help, a present Help, a Help found, one whom we have found to be so; a Help at hand, one that is always near; we cannot desire a better, nor shall we ever find the like in any creature. Let those be troubled at the troubling of the waters, who build their confidence on a floating foundation; but let not those be alarmed who are led to the Rock, and there find firm footing. Here is joy to the church, even in sorrowful times. The river alludes to the graces and consolations of the Holy Spirit, which flow through every part of the church, and through God's sacred ordinances, gladdening the heart of every believer. It is promised that the church shall not be moved. If God be in our hearts, by his word dwelling richly in us, we shall be established, we shall be helped; let us trust and not be afraid.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There is a river - There is no allusion here to any particular stream or river, but the image is designed to represent a state of peace and calm security in contrast with the rough and troubled ocean. While the ocean rages, and foams, and dashes against the mountains as if it would overturn them, the state of Jerusalem, the city of God, was well represented by a calm and gently-flowing river; a river of full banks, diffusing joy and fertility and beauty wherever it flowed. This image, to represent happiness, abundance, peace, joy, is one that is often employed in the Scriptures. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The \"idea\" here is simply that Jerusalem would be calm and serene amidst all the external agitations in the world - calm as a gently-flowing stream. The streams - the canals - the water-courses of such a river flowing around each dwelling and along each garden, would diffuse happiness and beauty everywhere.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The streams whereof - The allusion here is undoubtedly to the canals, watercourses, or rivulets that were led off from the main stream for the purpose of supplying fountains and watering gardens. Thus the city of Damascus is watered by streams or canals cut from the river Barrady, that flows down from the regions of Anti-Libanus. The greenness - the beauty - the fertility - of Damascus is owing wholly to the waters of the river thus conducted to every house and garden in the city. Compare introduction to Isaiah 17:1-14. So here, the flowing river of divine mercy and goodness is conveyed, as in smaller canals or streams, to each home and heart, producing peace, calmness, joy - while the world around is full of commotion and trouble.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The streams whereof - The allusion here is undoubtedly to the canals, watercourses, or rivulets that were led off from the main stream for the purpose of supplying fountains and watering gardens. Thus the city of Damascus is watered by streams or canals cut from the river Barrady, that flows down from the regions of Anti-Libanus. The greenness - the beauty - the fertility - of Damascus is owing wholly to the waters of the river thus conducted to every house and garden in the city. Compare introduction to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 17:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". So here, the flowing river of divine mercy and goodness is conveyed, as in smaller canals or streams, to each home and heart, producing peace, calmness, joy - while the world around is full of commotion and trouble.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall make glad the city of God - Jerusalem, considered as the place where God was worshipped, and where he was supposed especially to dwell: Psalm 48:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall make glad the city of God - Jerusalem, considered as the place where God was worshipped, and where he was supposed especially to dwell: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The holy place of the tabernacles of the Most High - Of the \"tent\" where the Most High is supposed to abide. The word is applicable to any habitation or dwelling-place; but in the Scriptures it is applied especially to the sacred tent erected by Moses in the wilderness, and ultimately removed to Mount Zion by David, as the divine abode on earth. It is sometimes, also, applied to the temple; and if this psalm was written, as I have supposed, in the time of Hezekiah, it would be applicable to that. Compare Psalm 84:2; Psalm 132:5. The tabernacle and the temple were alike divided into two parts - the holy and the most holy place - and hence the \"plural\" term is sometimes applied to them. Compare the notes at Hebrews 9:2-3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The holy place of the tabernacles of the Most High - Of the \"tent\" where the Most High is supposed to abide. The word is applicable to any habitation or dwelling-place; but in the Scriptures it is applied especially to the sacred tent erected by Moses in the wilderness, and ultimately removed to Mount Zion by David, as the divine abode on earth. It is sometimes, also, applied to the temple; and if this psalm was written, as I have supposed, in the time of Hezekiah, it would be applicable to that. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The tabernacle and the temple were alike divided into two parts - the holy and the most holy place - and hence the \"plural\" term is sometimes applied to them. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. God's favor is denoted by a river (compare Ps 36:8; Zec 14:8; Re 22:1).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "city of God, the holy place—His earthly residence, Jerusalem and the temple (compare Ps 2:6; 3:4; 20:2; 48:2, &c.). God's favor, like a river whose waters are conducted in channels, is distributed to all parts of His Church.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "most High—denoting His supremacy (Ps 17:2).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "most High—denoting His supremacy (Ps 17:2).",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4 There is a river, the streams whereof shall make glad the city of God, the holy place of the tabernacles of the Most High.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 God is in the midst of her; she shall not be moved: God shall help her, and that right early.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 The heathen raged, the kingdoms were moved: he uttered his voice, the earth melted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 The Lord of hosts is with us; the God of Jacob is our refuge. Selah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 46:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:4",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"There is a river.\" Divine grace like a smoothly flowing, fertilising, full, and never-failing river, yields refreshment and consolation to believers. This is the river of the water of life, of which the church above as well as the church below partakes evermore. It is no boisterous ocean, but a placid stream, it is not stayed in its course by earthquakes or crumbling mountains, it follows its serene course without disturbance. Happy are they who know from their own experience that there is such a river of God. \"The streams whereof\" in their various influences, for they are many, \"shall make glad the city of God,\" by assuring the citizens that Zion's Lord will unfailingly supply all their needs. The streams are not transient like Cherith, nor muddy like the Nile, nor furious like Kishon, nor treacherous like Job's deceitful brooks, neither are their waters \"naught\" like those of Jericho, they are clear, cool, fresh, abundant, and gladdening. The great fear of an Eastern city in time of war was lest the water supply should be cut off during a siege; if that were secured the city could hold out against attacks for an indefinite period. In this verse, Jerusalem, which represents the church of God, is described as well supplied with water, to set forth the fact, that in seasons of trial all-sufficient grace will be given to enable us to endure unto the end. The church is like a well-ordered city, surrounded with mighty walls of truth and justice, garrisoned by omnipotence, fairly built and adorned by infinite wisdom: its burgesses the saints enjoy high privileges; they trade with far-off lands, they live in the smile of the King; and as a great river is the very making and mainstay of a town, so is the broad river of everlasting love and grace their joy and bliss. The church is peculiarly the \"City of God,\" of his designing, building, election, purchasing and indwelling. It is dedicated to his praise, and glorified by his presence. \"The holy place of the tabernacles of the Most High.\" This was the peculiar glory of Jerusalem, that the Lord within her walls had a place where he peculiarly revealed himself, and this is the choice privilege of the saints, concerning which we may cry with wonder, \"Lord, how is it that thou wilt manifest thyself unto us, and not unto the world?\" To be a temple for the Holy Ghost is the delightful portion of each saint, to be the living temple for the Lord our God is also the high honour of the church in her corporate capacity. Our God is here called by a worthy title, indicating his power, majesty, sublimity, and excellency; and it is worthy of note that under this character he dwells in the church. We have not a great God in nature, and a little God in grace; no, the church contains as clear and convincing a revelation of God as the works of nature, and even more amazing is the excellent glory which shines between the cherubim overshadowing that mercy-seat which is the centre and gathering place of the people of the living God. To have the Most High dwelling within her members, is to make the church on earth like the church in heaven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 46:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:5",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"God is in the midst of her.\" His help is therefore sure and near. Is she besieged, then he is himself besieged within her, and we may be certain that he will break forth upon his adversaries. How near is the Lord to the distresses of his saints, since he sojourns in their midst! Let us take heed that we do not grieve him; let us have such respect to him as Moses had when he felt the sand of Horeb's desert to be holy, and put off his shoes from off his feet when the Lord spake from the burning bush. \"She shall not be moved.\" How can she be moved unless her enemies move her Lord also? His presence renders all hope of capturing and demolishing the city utterly ridiculous. The Lord is in the vessel, and she cannot, therefore, be wrecked. \"God shall help her.\" Within her he will furnish rich supplies, and outside her walls he will lay her foes in heaps like the armies of Sennacherib, when the angel went forth and smote them. \"And that right early.\" As soon as the first ray of light proclaims the coming day, at the turning of the morning God's right arm shall be outstretched for his people. The Lord is up betimes. We are slow to meet him, but he is never tardy in helping us. Impatience complains of divine delays, but in very deed the Lord is not slack concerning his promise. Man's haste is often folly, but God's apparent delays are ever wise; and, when rightly viewed, are no delays at all. Today the bands of evil may environ the church of God, and threaten her with destruction; but ere long they shall pass away like the foam on the waters, and the noise of their tumult shall be silent in the grave. The darkest hour of the night is just before the turning of the morning; and then, even then, shall the Lord appear as the great ally of his church.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 46:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:6",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The heathen raged.\" The nations were in a furious uproar, they gathered against the city of the Lord like wolves ravenous for their prey; they foamed, and roared, and swelled like a tempestuous sea. \"The kingdoms were moved.\" A general confusion seized upon society; the fierce invaders convulsed their own dominions by draining the population to urge on the war, and they desolated other territories by their devastating march to Jerusalem. Crowns fell from royal heads, ancient thrones rocked like trees driven of the tempest, powerful empires fell like pine uprooted by the blast: everything was in disorder, and dismay seized on all who knew not the Lord. \"He uttered his voice, the earth melted.\" With no other instrumentality than a word the Lord ruled the storm. He gave forth a voice and stout hearts were dissolved, proud armies were annihilated, conquering powers were enfeebled. At first the confusion appeared to be worse confounded, when the element of divine power came into view; the very earth seemed turned to wax, the most solid and substantial of human things melted like the fat of rams upon the altar; but anon peace followed, the rage of man subsided, hearts capable of repentance relented, and the implacable were silenced. How mighty is a word from God! How mighty the Incarnate Word. O that such a word would come from the excellent glory even now to melt all hearts in love to Jesus, and to end for ever all the persecutions, wars, and rebellions of men!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 46:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:7",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The Lord of hosts is with us.\" This is the reason for all Zion's security, and for the overthrow of her foes. The Lord rules the angels, the stars, the elements, and all the hosts of heaven; and the heaven of heavens are under his sway. The armies of men though they know it not are made to subserve his will. This Generalissimo of the forces of the land, and the Lord High Admiral of the seas, is on our side - our august ally; woe unto those who fight against him, for they shall fly like smoke before the wind when he gives the word to scatter them. \"The God of Jacob is our refuge.\" Immanuel is Jehovah of Hosts, and Jacob's God is our high place of defence. When this glad verse is sung to music worthy of such a jubilate, well may the singers pause and the players wait awhile to retune their instruments; here, therefore, fitly stands that solemn, stately, peaceful note of rest, Selah. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He either speaks of, or at least alludes to, the river of Kidron, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Samuel 15:23 John 18:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 18:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and its two streams or rivulets flowing from it, Gihon and Shiloah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Chronicles 32:30 Isaiah 8:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 32:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which being small and contemptible, or still or gentle waters, are not unfitly opposed to the vast and unruly waters of the sea. He insinuates the weak condition of God’s church as to outward advantages, that they had not one sea to oppose to another, but only a small river; which though in itself despicable, yet was sufficient to refresh and defend them in spite of all their enemies. And as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sea and waters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thereof, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 46:2,3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", are to be understood metaphorically, as all agree, so also in all probability are this river and streams; which therefore may design the gracious presence, and assistance, and blessing of be Lord, (which is very frequently described under the name of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "waters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 11:9 12:3 Zechariah 14:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 12:3 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.,) or the Lord himself, who is expressly said to be unto the city of Zion, for its defence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a place of broad rivers and streams",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 33:20,21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which probably alludes to this text, or at least explains it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall make glad, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. shall not barely defend it from utter ruin, but preserve it from danger, and give great occasion for rejoicing and thanksgiving. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The city of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. Zion or Jerusalem, so called also ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "@Psalm 48:1 Isaiah 60:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "@",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 48:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of the tabernacles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. of the tabernacle, the plural number for the singular, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 43:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 43:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; the place where God’s holy tabernacle is settled. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There is a river,.... The allusion is either to the river Kidron, which ran by Jerusalem; or to the waters of Shiloah, which by different courses and branches, ran through the city of Jerusalem, and supplied the several parts of it with water, to the joy and comfort of its inhabitants: but the words are to be understood in a figurative sense, as applicable to Gospel times; and this river either designs the Gospel, the streams of which are its doctrines, which are living waters that went out from Jerusalem, and which publish glad tidings of great joy to all sensible sinners; or the Spirit and his graces, which are compared to a well, and rivers of living water, in the exercise of which the saints have much joy and peace; or else the Lord himself, who is a place of broad rivers and streams to his people, and is both their refreshment and protection; or rather his everlasting love to them is here intended; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; The head of this river is the heart of God, his sovereign goodwill and pleasure; the channel through which it runs is Christ Jesus; the rise of it was in eternity, when, like a river that runs underground, it flowed secretly, as it does before the effectual calling; when it breaks up, and appears in large streams, and flows, and so it proceeds running on to all eternity. It is a river that is unfathomable, and cannot be passed over; it has heights and depths, and lengths and breadths, which cannot be fully comprehended: as for the quality of it, it is a pure river, clear as crystal; free of all dissimulation in the heart of God, and clear of all motives and conditions in the creature. Its water is living water; which quickens dead sinners, revives drooping saints, secures from the second death, and gives eternal life; it makes all fruitful about it, or that are planted by it; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the streams whereof shall make glad the city of God; the \"streams\" of this river are eternal election; the covenant of grace its blessings and promises; the provision and mission of Christ as a Saviour, and redemption by him; justification, pardon, adoption, regeneration, perseverance in grace, and eternal life; called \"streams\", because they flow from the fountain of divine love; and because of the rapidity, force, and power of the grace of God, in the application of them in conversion, which carries all before it; and because of the abundance, continuance, and freeness of them, and the gratefulness and acceptableness of them to those who see the worth of them, and their interest in them; see Sol 4:15; and these, when made known and applied, \"make glad\" the hearts of God's people under a sense of sin and guilt, under divine desertions, the temptations of Satan, and the various afflictions they meet with; for these are intended by \"the city of God\", as the church is often called, because of his building, and where he dwells, and where the saints are fellow citizens. And the same are signified by ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the holy place; being an holy temple to God, consisting of holy persons, such who are sanctified by the Spirit of God, and live holy lives and conversations: and ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of the tabernacles of the most High; being the dwelling places of God, Father, Son, and Spirit. All which is a reason why the saints should not fear in the worst of times. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "of the tabernacles of the most High; being the dwelling places of God, Father, Son, and Spirit. All which is a reason why the saints should not fear in the worst of times. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "There is a {e} river, the streams whereof shall make glad the city of God, the holy place of the tabernacles of the most High.",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "There is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " river, the streams whereof shall make glad the city of God, the holy ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "place",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the tabernacles of the most High.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) The river of Shiloh, which passed through Jerusalem: meaning, though the defence seems small, yet if God has appointed it, it is sufficient.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In contrast to the tumultuous sea threatening to engulf the solid mountain, is the river, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the streams whereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " make glad ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the city of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The gently flowing river, fertilising all the land over which it is distributed in channels and rivulets, is an emblem of Jehovah’s Presence, blessing and gladdening His city. Abundant irrigation is indispensable in Palestine. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The figure reminds us of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where “the waters of Shiloah that go softly” are the emblem of the Divine government, and “the waters of the River great and many” are the emblem of the power of Assyria; and again of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Jehovah is compared to a mighty river encircling and protecting His city.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the city of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 48:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 48:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 87:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 101:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the holy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " place &c.] Better, the holy dwelling place of the Most High. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. The title ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Most High",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is significant. By His deliverance of His own city He has proved Himself the supreme Ruler of the world, refuting the self-deifying pretensions of Sennacherib (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 36:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., Isa 34:23, 35; cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and for the usage of this title see Appendix, Note ii.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "4–7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Presence of God the joy and security of His people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "There is a river, the streams",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "whereof shall make glad the city of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In contrast with the scene of tumult and disturbance in the world at large, which the writer has presented to us in vers. 2, 3, he now shows us, resting in perfect peace and tranquillity, \"the city of God,\" threatened, indeed, by the nations, but undismayed by them, and calmly trusting in the protection of the God who is \"in the midst of her.\" To this city he assigns a \"river, the streams whereof make her glad;\" imagery in which we may recognize the perennial fountain of God's grace - that \"pure river of water of life,\" which, welling forth from the throne of God and of the Lamb, continually refreshes and gladdens the Church of Christ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whether her dwell-tug-place be the earthly or the heavenly Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The holy place of the tabernacles of the Most High",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The direct application is, of course, to the earthly Jerusalem, which the armies of Sennacherib were threatening. Psalm 46:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 46:5-8) Just as, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a stream issued from Eden, to water the whole garden, so a stream makes Jerusalem as it were into another paradise: a river - whose streams make glad the city of Elohim (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 87:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 48:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 101:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); פּלגיו (used of the windings and branches of the main-stream) is a second permutative subject (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). What is intended is the river of grace, which is also likened to a river of paradise in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When the city of God is threatened and encompassed by foes, still she shall not hunger and thirst, nor fear and despair; for the river of grace and of her ordinances and promises flows with its rippling waves through the holy place, where the dwelling-place or tabernacle of the Most High is pitched. קדשׁ, Sanctum (cf. el-Ḳuds as a name of Jerusalem), as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 65:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; גּדל, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". משׁכּני, dwellings, like משׁכּנות, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", equivalent to \"a glorious dwelling.\" In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 46:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the place of the river we find Him from whom the river issues forth. Elohim helps her לפנותבּקר - there is only a night of trouble, the return of the morning is also the sunrise of speedy help. The preterites in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 46:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are hypothetical: if peoples and kingdoms become enraged with enmity and totter, so that the church is in danger of being involved in this overthrow - all that God need to is to make a rumbling with His almighty voice of thunder (נתן בּקולו, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. הרים בּמּטּה, to make a lifting with the rod, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and forthwith the earth melts (muwg, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Niph. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently), i.e., their titanic defiance becomes cowardice, the bonds of their confederation slacken, and the strength they have put forth is destroyed - it is manifest that Jahve Tsebaoth is with His people. This name of God is, so to speak, indigenous to the Korahitic Psalms, for it is the proper name of God belonging to the time of the kings (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 24:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 59:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), on the very verge of which it occurs first of all in the mouth of Hannah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the Korahitic Psalms have a royal impress upon them. In the God, at whose summons all created powers are obliged to marshal themselves like the hosts of war, Israel has a steep stronghold, משׂגּב, which cannot be scaled by any foe - the army of the confederate peoples and kingdoms, ere it has reached Jerusalem, is become a field of the dead. ",
        "children": []
      }
    ]
  }
]