[{"header":"Provision for Priests and Levites"},{"num":18,"verse":"The Levitical priests and all the tribe of Levi will not have any portion or inheritance with Israel. They must eat the offerings of the Lord made by fire and His portion. "},{"num":2,"verse":"They will have no inheritance among their brothers. The Lord is their inheritance, just as He has said to them."},{"num":3,"verse":"This shall be the priest’s due from the people, from them that offer a sacrifice, whether it be an ox or sheep: they shall give to the priest the shoulder, the two cheeks, and the stomach. "},{"num":4,"verse":"You must give him the first fruit of your grain, of your wine, and of your oil, and the first of the fleece of your sheep also. "},{"num":5,"verse":"For the Lord your God has chosen him out of all your tribes to stand to minister in the name of the Lord, him and his sons forever."},{"num":6,"verse":"If a Levite comes from any of your gates out of all Israel, where he lives, and comes with all the desire of his mind to the place where the Lord shall choose, "},{"num":7,"verse":"then he shall minister in the name of the Lord his God, as all his brothers the Levites do, who stand there before the Lord. "},{"num":8,"verse":"They must have the same portions to eat, besides any profits he may receive from the sale of his father’s inheritance."},{"header":"A Call to Holiness"},{"num":9,"verse":"When you enter into the land which the Lord your God gives you, you must not learn to practice the abominations of those nations. "},{"num":10,"verse":"There must not be found among you anyone who makes his son or his daughter pass through the fire, or who uses divination, or uses witchcraft, or an interpreter of omens, or a sorcerer, "},{"num":11,"verse":"or one who casts spells, or a spiritualist, or an occultist, or a necromancer. "},{"num":12,"verse":"For all that do these things are an abomination to the Lord, and because of these abominations the Lord your God will drive them out from before you. "},{"num":13,"verse":"You must be blameless before the Lord your God."},{"header":"The Prophet"},{"num":14,"verse":"For these nations, which you shall possess, listened to soothsayers and to diviners, but as for you, the Lord your God has not permitted you to do so. "},{"num":15,"verse":"The Lord your God will raise up for you a prophet from the midst of you, of your brothers, like me. You must listen to him. "},{"num":16,"verse":"This is according to all that you desired of the Lord your God in Horeb on the day of the assembly, saying, “Let me not hear again the voice of the Lord my God, nor let me see this great fire anymore, so that I do not die.”"},{"num":17,"verse":"The Lord said to me, “They have done well in what they have said. "},{"num":18,"verse":"I will raise up a prophet from among their brothers, like you, and will put My words in his mouth, and he will speak to them all that I command him. "},{"num":19,"verse":"It will be that whoever will not listen to My words which he will speak in My name, I will require it of him. "},{"num":20,"verse":"But the prophet, who presumes to speak a word in my name, which I have not commanded him to speak, or who shall speak in the name of other gods—that prophet shall die.”"},{"num":21,"verse":"And you may say in your heart, “How can we know the word which the Lord has not spoken?” "},{"num":22,"verse":"When a prophet speaks in the name of the Lord, if the thing does not occur or come to pass, that is the thing which the Lord has not spoken; the prophet has spoken it presumptuously. You shall not be afraid of him."}]