[[],[{"type":"header","content":"The Marriage of Ruth"},{"type":"prose","content":"Then Boaz went up to the city gate [where business and legal matters were settled] and sat down, and then the close relative (redeemer) of whom Boaz had spoken came by. He said to him, “Come over here, friend, and sit down.” So he came and sat down. "}],[{"type":"prose","content":"Then Boaz took ten men from the elders of the city and said, “Sit down here.” And they sat down. "}],[{"type":"prose","content":"He said to the closest relative (redeemer), “Naomi, who has returned from the country of Moab, must sell the plot of land which belonged to our brother Elimelech. "}],[{"type":"prose","content":"So I thought to let you hear of it, saying, ‘Buy it in the presence of those sitting here, and before the elders of my people. If you will redeem it, redeem it; but if not, then tell me, so that I may know; for there is no one besides you to redeem it, and I am [next of kin] after you.’” And he said, “I will redeem it.” "}],[{"type":"prose","content":"Then Boaz said, “The day that you buy the field from Naomi, you must also acquire Ruth the Moabitess, the widow of the deceased, to restore the name of the deceased to his inheritance.” "}],[{"type":"prose","content":"The closest relative (redeemer) said, “I cannot redeem it for myself, because [by marrying a Moabitess] I would jeopardize my own inheritance. Take my right of redemption (purchase) yourself, because I cannot redeem it.”"}],[{"type":"prose","content":"Now formerly in Israel this was the custom concerning redeeming and exchanging . To confirm a transaction, a man pulled off his sandal and gave it to the other. This was the  confirming  attesting in Israel. "}],[{"type":"prose","content":"So, when the closest relative (redeemer) said to Boaz, “Buy it for yourself,” he pulled off his sandal [and gave it to Boaz to confirm the agreement]. "}],[{"type":"prose","content":"Then Boaz said to the elders and to all the people, “You are witnesses this day that I have bought everything that was Elimelech’s and everything that was Chilion’s and Mahlon’s from the hand of Naomi. "}],[{"type":"prose","content":"I have also acquired Ruth the Moabitess, the widow of Mahlon, to be my wife to restore the name of the deceased to his inheritance, so that the name of the deceased will not be cut off from his brothers or from the gate of his birthplace. You are witnesses today.” "}],[{"type":"prose","content":"All the people at the gate and the elders said, “We are witnesses. May the LORD make the woman who is coming into your house like Rachel and Leah, the two who built the household of Israel. May you achieve wealth  power in Ephrathah and become famous in Bethlehem. "}],[{"type":"prose","content":"Further, may your house be like the house of Perez whom Tamar bore to Judah, because of the offspring which the LORD will give you by this young woman.”"}],[{"type":"prose","content":"So Boaz took Ruth, and she became his wife. And he went in to her, and the LORD enabled her to conceive, and she gave birth to a son. "}],[{"type":"prose","content":"Then the women said to Naomi, “Blessed is the LORD who has not left you without a redeemer (grandson, as heir) today, and may his name become famous in Israel. "}],[{"type":"prose","content":"May he also be to you one who restores life and sustains your old age; for your daughter-in-law, who loves you and is better to you than seven sons, has given birth to him.”"}],[{"type":"header","content":"The Line of David Began Here"},{"type":"prose","content":"Then Naomi took the child and placed him in her lap, and she became his nurse. "}],[{"type":"prose","content":"The neighbor women gave him a name, saying, “A son (grandson) has been born to Naomi.” They named him Obed (worshiper). He is the father of Jesse, the father of David [the ancestor of Jesus Christ]."}],[{"type":"prose","content":"Now these are the descendants of Perez: Perez was the father of Hezron, "}],[{"type":"prose","content":"Hezron was the father of Ram, Ram the father of Amminadab, "}],[{"type":"prose","content":"Amminadab the father of Nahshon, Nahshon the father of Salmon, "}],[{"type":"prose","content":"Salmon the father of Boaz, Boaz the father of Obed, "}],[{"type":"prose","content":"Obed the father of Jesse, and Jesse the father of David [the king of Israel and the ancestor of Jesus Christ]."}]]