[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hearken.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The address now turns to the bride.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE PORTRAIT OF THE BRIDEPsalm 45:10 - Psalm 45:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE PORTRAIT OF THE BRIDE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The relation between God and Israel is constantly represented in the Old Testament under the emblem of a marriage. The tenderest promises of protection and the sharpest rebukes of unfaithfulness are based upon this foundation. ‘Thy Maker is thy Husband’; or, ‘I am married unto thee, saith the Lord.’ The emblem is transferred in the New Testament to Christ and His Church. Beginning with John the Baptist’s designation of Him as the Bridegroom, it reappears in many of our Lord’s sayings and parables, is frequent in the writings of the Apostle Paul, and reaches its height of poetic splendour and terror in that magnificent description in Revelation of ‘the Bride, the Lamb’s wife,’ and ‘the marriage supper of the Lamb.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Seeing, then, the continual occurrence of this metaphor, it is unnatural and almost impossible to deny its presence in this psalm. In a former sermon I have directed attention to the earlier portion of it, which presents us, in its portraiture of the King, a shadowy and prophetic outline of Jesus Christ. I desire, in a similar fashion, to deal now with the latter portion, which, in its portrait of the bride, presents us with truths having their real fulfilment in the Church collectively and in the individual soul.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Of course, inasmuch as the consort of a Jewish monarch was not an incarnate prophecy as her husband was, the transference of the historical features of this wedding-song to a spiritual purpose is not so satisfactory, or easy, in the latter part as in the former. There is a thicker rind of prose fact, as it were, to cut through, and certain of the features cannot be applied to the relation between Christ and His Church without undue violence. But, whilst we admit that, it is also clear that the main, broad outlines of this picture do require as well as permit its higher application. Therefore I turn to them to try to bring out what they teach us so eloquently and vividly of Christ’s gifts to, and requirements from, the souls that are wedded to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Now the first point is this-the all-surrendering Love that must mark the Bride. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Now the first point is this-the all-surrendering Love that must mark the Bride.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The language of the tenth verse is the voice of prophecy or inspiration; speaking words of fatherly counsel to the princess-’Forget also thine own people and thy father’s house.’ Historically I suppose it points to the foreign birth of the queen, who is called upon to abandon all old ties, and to give herself with wholehearted consecration to her new duties and relations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In all real wedded life, as those who have tasted it know, there comes, by sweet necessity, the subordination, in the presence of a purer and more absorbing love, brought close by a will itself ablaze with the sacred glow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Therefore, while giving all due honour to other forms of Christian opposition to the prevailing unbelief, I urge the cultivation of a quickened spiritual life as by far the most potent. Does not history bear me out in that view? What, for instance, was it that finished the infidelity of the eighteenth century? Whether had Butler’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Analogy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or Charles Wesley’s hymns, Paley’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Evidences",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or Whitefield’s sermons, most to do with it? A languid Church breeds unbelief as surely as a decaying oak does fungus. In a condition of depressed vitality, the seeds of disease, which a full vigour would shake off, are fatal. Raise the temperature, and you kill the insect germs. A warmer tone of spiritual life would change the atmosphere which unbelief needs for its growth. It belongs to the fauna of the glacial epoch, and when the rigours of that wintry time begin to melt, and warmer days to set in, the creatures of the ice have to retreat to arctic wildernesses, and leave a land no longer suited for their life. A diffused unbelief, such as we see around us to-day, does not really arise from the logical basis on which it seems to repose. It comes from something much deeper,-a certain habit and set of mind which gives these arguments their force. For want of a better name, we call it the spirit of the age. It is the result of very subtle and complicated forces, which I do not pretend to analyse. It spreads through society, and forms the congenial soil in which these seeds of evil, as we believe them to be, take root. Does anybody suppose that the growth of popular unbelief is owing to the logical force of certain arguments? It is in the air; a wave of it is passing over us. We are in a condition in which it becomes shall drop the toys of earth as easily and naturally as a child will some trinket or plaything, when it stretches out its little hand to get a better gift from its loving mother. Love will sweep the heart clean of its antagonists; and there is no real union between Jesus Christ and us except in the measure in which we joyfully, and not as a reluctant giving up of things that we would much rather keep if we durst, ‘count all things but loss for the excellency of the knowledge of Christ Jesus our Lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Have the terms of wedded life changed since my psalm was written? Is there less need now than there used to be that, if we are to possess a heart, we should give a whole heart? And have the terms of Christian living altered since the old days, when He said, ‘Whosoever he be of you that forsaketh not all that he hath, he cannot be My disciple’? Ah! I fear me that it is no uncharitable judgment to say that the bulk of so-called Christians are playing at being Christians, and have never penetrated into the depths either of the sweet all-sufficiency of the love which they say that they possess, or the constraining necessity that is in it for the surrender of all besides. Many happy husbands and wives, if they would only treat Jesus Christ as they treat one another, would find out a power and a blessedness in the Christian life that they know nothing about at present. ‘Daughter! forget thine own people and thy father’s house!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Again, the second point here is that which directly follows-the King’s love and the Bride’s reverence. ‘So shall the King greatly desire thy beauty: for He is thy Lord; and worship thou Him.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Again, the second point here is that which directly follows-the King’s love and the Bride’s reverence. ‘So shall the King greatly desire thy beauty: for He is thy Lord; and worship thou Him.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The King is drawn, in the outgoings of His affection, by the sweet trust and perfect love which has surrendered everything for him and happily followed him from the far-off land. And then, in accordance with Oriental ideas, and with His royal rank, the bride is exhorted, in the midst of the utter trust and equality born of love, to remember, ‘He is thy Lord, and reverence thou Him.’ So, then, here are two thoughts that go, as I take it, very deep into the realities of the Christian life. The first is that, in simple literal fact, Jesus Christ is affected, in His relation to us, by the completeness of our dependence upon Him, and surrender of all else for Him. We do not believe that half vividly enough. We have surrounded Jesus Christ with a halo of mystery and of remoteness which neither lets us think of Him as being really man or really God. And I press on you this as a plain fact, no piece of pulpit rhetoric, that His relation to us as Christians hinges upon our surrender to Him. Of course, there is a love with which He pours Himself out over the unworthy and the sinful-blessed be His name!-and the more sinful and the more unworthy, the deeper the tenderness and the more yearning the pity and pathos of invitation which He lavishes upon us. But that is a different thing from this other, which is that He is pleased or displeased, actually drawn to or repelled from us, in the measure of the completeness and gladness of our surrender of ourselves to Him. That is what Paul means when he says that he labours that ‘whether present or absent he may be pleasing to Christ.’ And this is the highest and strongest motive that I know for all holy and noble living, that we shall bring a smile into our Master’s face and draw Him nearer to ourselves thereby. ‘So ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the King greatly desire thy beauty.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Again, in the measure in which we live out our Christianity, in whole-hearted and thorough surrender, in that measure shall we be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "conscious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of His nearness and feel His love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are many Christian people that have only religion enough to make them uncomfortable, only enough to make religion to them a system of regulations, negative and positive, the reasonableness and sweetness of which they but partially apprehend. They must not do ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because it is forbidden; they ought to do ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because it is commanded. They would much rather do the forbidden thing, and they have no wish to do the commanded thing, and so they live in twilight, and when they come beside a man who really has been walking in the light of Christ’s face, the language of his experience, though it be but a transcript of facts, sounds to them all unreal and fanatical. They miss the blessing that is waiting for them, just because they have not really given up themselves. If by resolute and continual opening of our hearts to Christ’s real love and presence, and by consequent casting off of our false and foolish self-dependence, we were to blow away the clouds that come between us and Him, we should feel the sunshine. But as it is, a miserable multitude of professing Christians ‘walk in the darkness, and have no light,’ or, at the most, but some wintry sunshine that struggles through the thick mist, and does little more than reveal the barrenness that lies around. Brethren! if you want to be happy Christians, be out-and-out ones; and if you would have your hands and your hearts filled with Christ, empty them of the trash that they grip so closely now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, on the other side, there is the reminder and exhortation: ‘He is thy Lord, worship thou Him.’ The beggar-maid that, in the old ballad, married the king, in all her love was filled with reverence; and the ragged, filthy souls, whom Jesus Christ stoops to love, and wash, and make His own, are never to forget, in the highest rapture of their joy, their lowly adoration, nor in the glad familiarity of their loving approach to Him, cease to remember that the test of love is, ‘Keep My commandments.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are types of emotional and sentimental religion that have a great deal more to say about love than about obedience; that are full of half wholesome apostrophes to a ‘dear Lord,’ and almost forget the ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ in the emphasis which they put on the ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ And I want you to remember this, as by no means an unnecessary caution, and of especial value in some quarters to-day, that the test of the reality of Christian love is its lowliness, and that all that which indulges in heated emotion, and forgets practical service, is rotten and spurious. Though the King desire her beauty, still, when He stretches out the golden sceptre, Esther must come to Him with lowly guise and a reverent heart. ‘He is thy Lord, worship thou Him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The next point in this portraiture is the reflected honour and influence of the bride. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The next point in this portraiture is the reflected honour and influence of the bride.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There are difficulties about the translation of the 12th verse of our psalm with which I do not need to trouble you. We may take it for our purpose as it stands before us. ‘The daughter of Tyre’ {representing the wealthy, outside nations} ‘shall be there with a gift; even the rich among the people shall entreat thy favour.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The bride being thus beloved by the King, thus standing by His side, those around recognise her dignity and honour, and draw near to secure her intercession. Translate that out of the emblem into plain words, and it comes to this-if Christian people, and communities of such, are to have influence in the world, they must be thorough-going Christians. If they are, they will get hatred sometimes; but men know honest people and religious people when they see them, and such Christians will win respect and be a power in the world. If Christian men and Christian communities are despised by outsiders, they very generally earn the contempt and deserve it, both from men and from heaven. The true evangelist is Christian character. They that manifestly live with the sunshine of the Lord’s love on their faces, and whose hands are plainly clear from worldly and selfish graspings, will have the world recognising the fact and honouring them accordingly. ‘The sons of them that afflicted thee shall come bending unto thee, and all they that despised thee shall bow themselves down to the soles of thy feet.’ When the Church has cast the world out of its heart, it will conquer the world-and not till then.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. The next point in this picture is the fair adornment of the bride. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The language is in part ambiguous; and if this were the place for commenting would require a good deal of comment. But we take it as it stands in our Bible, ‘The King’s daughter is all glorious within’-not within her nature, but within the innermost recesses of the palace-’her clothing is of wrought gold. She shall be brought unto the King in raiment of needlework.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is an easy and well-worn metaphor to talk about people’s character as their dress. We speak about the ‘habits’ of a man, and we use that word to express both his customary manners and his costume. Custom and costume, again, are the same word. So here, without any departure from the well-trodden path of Scriptural emblem, we cannot but see in the glorious apparel the figure of the pure character with which the bride is clothed. The Book of the Revelation dresses her in the fine linen clean and white, which symbolises the lustrous radiance and snowy purity of righteousness. The psalm describes her dress as partly consisting in garments gleaming with gold, which suggests splendour and glory, and partly in robes of careful and many-coloured embroidery, which suggests the patience with which the slow needle has been worked through the stuff, and the variegated and manifold graces and beauties with which she is adorned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, putting all the metaphors together, the true Christian character, which will be ours if we really are the subjects of that divine love, will be lustrous and snowy as the snows on Hermon, or as was the garment whose whiteness outshone the neighbouring snows when He was ‘transfigured before them.’ Our characters will be splendid with a splendour far above the tawdry beauties and vulgar conspicuousness of the ‘heroic’ and worldly ideals, and will be endowed with a purity and harmony of colouring in richly various graces, such as no earthly looms can ever weave.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We are not told here how the garment is attained. It is no part of the purpose of the psalm to tell us that, but it is part of its purpose to insist that there is no marriage between Christ and the soul except that soul be pure, none except it be robed in the beauty of righteousness and the splendour of consecration, and the various gifts of an all-giving Spirit. The man that came into the wedding-feast, with his dirty, every-day clothes on, was turned out as a rude insulter. But what of the queen that should come foully dressed? There would be no place for her amidst its solemnities. You will never stand at the right hand of Christ, unless jour souls here are clothed in the fine linen clean and white, and over it the flashing wealth and the harmonised splendour of the gold and embroidery of Christlike graces. We know how to get the garment. Faith strips the rags and puts the best robe on us; and effort based upon faith enables us day by day to put off the old man with his deeds and to put on the new man. The bride ‘made ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "herself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ready,’ and ‘to her was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "granted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that she should be arrayed in fine linen, clean and white.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "V. Lastly, we have the picture of the homecoming of the bride. ‘She shall be brought unto the King. . . . with gladness and rejoicing shall they be brought; they shall enter into the King’s palace.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "V. Lastly, we have the picture of the homecoming of the bride. ‘She shall be brought unto the King. . . . with gladness and rejoicing shall they be brought; they shall enter into the King’s palace.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The presence of virgin companions waiting on the bride is no more difficult to understand here than it is in Christ’s parable of the Ten Virgins. It is a characteristic of all parabolical representation to be elastic, and sometimes to duplicate its emblems for the same thing; and that is the case here. But the main point to be insisted upon is this, that, according to the perspective of Scripture, the life of the Christian Church here on earth is, if I may so say, a betrothal in righteousness and loving-kindness; and that the betrothal waits for its consummation in that great future when the bride shall pass into the presence of the King. The whole collective body of sinful souls redeemed by His blood, and who know the sweetness of His partially received love, shall be drawn within the curtains of that upper house, and enter into a union with Christ Jesus ineffable, incomprehensible till experienced; and of which the closest union of loving souls on earth is but a dim shadow. ‘He that is joined to the Lord is one spirit’; and the reality of our union with Him rises above the emblem of a marriage, as high as spirit rises above flesh.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The psalm stops at the palace-gate. ‘Eye hath not seen, nor ear heard, neither have entered into the heart of man the things which God hath prepared for them that love Him.’ But there is a solemn prelude to that completed union and its deep rapture. Before it there comes the last campaign of the conquering King on the white horse, who wars in righteousness. Dear friends! you must choose now whether you will be of the company of the Bride or of the company of the enemy. ‘They that were ready went in with Him unto the marriage, and the door was shut.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Which side of the door do ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mean to be on?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 45:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hearken, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The prophet, having hitherto spoken to the bridegroom, addresses himself now to the bride or queen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O daughter — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He speaks like an elder person, and as her spiritual father and counsellor; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Consider, and incline thine ear — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He useth several words signifying the same thing, to show his serious and earnest desire of her good, and the great importance and difficulty of practising the following counsel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Forget also — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Comparatively; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thine own people, and thy father’s house ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He alludes to the law of matrimony, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to what Solomon said, or should have said, to Pharaoh’s daughter, to wean her from the idolatry and other vices of her father’s house. But this, as well as the rest of the Psalm, respects Christ, and is a seasonable and necessary advice and command to all persons that desire to be united to him, whether Jews or Gentiles, to cast off all their old errors and prejudices, all those superstitious, or idolatrous, or wicked opinions, or practices, which they had received by long, and ancient, and, as they might suppose, venerable tradition, from their fathers, and to give themselves up entirely to Christ to be instructed by him, to receive his doctrine, and obey his precepts, though they might seem new to them. Reader, art thou coming to Christ to give up thy name to him? Remember, thou art now entering into a new state; let old things, therefore, pass away; regard no more thy connections with earth; let the love, and, if possible, the very memory of thy former condition, be obliterated from thy mind; hate, comparatively, father and mother, and all that is dear to thee in the world; that is, love them less than Christ, and his honour, and thy interest in him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "45:10-17 If we desire to share these blessings, we must hearken to Christ's word. We must forget our carnal and sinful attachments and pursuits. He must be our Lord as well as our Saviour; all idols must be thrown away, that we may give him our whole heart. And here is good encouragement, thus to break off from former alliances. The beauty of holiness, both on the church and on particular believers, is, in the sight of Christ, of great price, and very amiable. The work of grace is the workmanship of the Spirit, it is the image of Christ upon the soul, a partaking of the Divine nature. It is clear of all sin, there is none in it, nor any comes from it. There is nothing glorious in the old man or corrupt nature; but in the new man, or work of grace upon the soul, every thing is glorious. The robe of Christ's righteousness, which he has wrought out for his church, the Father imputes unto her, and bestows upon her. None are brought to Christ, but those whom the Father brings. This notes the conversion of souls to him. The robe of righteousness, and garments of salvation, the change of raiment Christ has put upon her. Such as strictly cleave to Christ, loving him in singleness of heart, are companions of the bride, who partake of the very same grace, enjoy the same privileges, and share in one common salvation. These, every one, shall be brought to the King; not one lost or left behind. Instead of the Old Testament church, there shall be a New Testament church, a Gentile church. In the believing hope of our everlasting happiness in the other world, let us always keep up the remembrance of Christ, as our only way thither; and transmit the remembrance of him to succeeding generations, that his name may endure for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hearken, O daughter, and consider - This is probably to be understood as the language of the psalmist, in vision, as uttering counsel and advice which would be appropriate to the new condition of the bride. Some have understood it as the language of the father of the bride, uttering appropriate counsel to his daughter on entering upon her new relationship; exhorting her to affection and obedience in that relationship; charging her to feel that she is his, that she is to go with him, that she is to identify herself with his interests, and to \"forget,\" - that is, not improperly to long for her own people and her father's house. All this would be good advice for a father to give to his daughter in such circumstances; but the most natural interpretation is to regard the language here as that of the psalmist, or as inspired wisdom, in regard to the proper feeling in entering on such a relation. If this be the meaning, the word \"daughter\" may be used as a term of affection or kindness, as the word \"son\" often is, to denote one who is a disciple or learner. The \"thought\" suggested here is, that counsel or advice in regard to the manner in which she should demean herself to secure the continual confidence of her husband, may be very properly given to a newly-married bride. The counsel here suggested, considered with reference only to that relation, would be eminently wise.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And incline thine ear - Attend to what is now said. The address is repeated - \"Hearken;\" \"consider;\" \"incline thine ear;\" as if the matter were of great importance. On the phrase \"incline thine ear,\" see the notes at Psalm 31:2; compare Psalm 78:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And incline thine ear - Attend to what is now said. The address is repeated - \"Hearken;\" \"consider;\" \"incline thine ear;\" as if the matter were of great importance. On the phrase \"incline thine ear,\" see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Forget also thine own people - This is said on the supposition that the bride was a foreign princess. As such, it is to be supposed that she had been trained under other customs, under other forms of religion, and with reference to other interests than those which would now pertain to her. The counsel is, that she must now forget all these, and identify herself with her husband, and with his interests. The word \"forget\" cannot denote absolute forgetfulness, or that she was to cast off all affection for those who had trained her up; but the meaning is, that she was not to pine after them; that she was not to be dissatisfied with her new home and her new relations; that she was not to carry the institutions of her native country with her; that she was not to make use of her new position to promote the ends of her native country if they were adverse to, or hostile to, the interests of her husband and his country.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As applied to a bride now, the advice would mean that she is not to pine for her old home; that she is not to make complaining and unfavorable comparison between that and her new home; that she is not to divert her husband from his plans, and the proper pursuits of his life, by endeavoring to induce him to forsake his friends, and to abandon his position, in order that she may be restored to the society of her earlier friends; that she is not to introduce habits, customs, amusements, modes of living into her husband's arrangements, derived from her former habits and modes of life, which would interfere with what is the proper economy of his house, and which would inconsistent with his principles, and with his means of living. When she marries, she should make up her mind, while she cherishes a proper regard for her old friends, and a proper memory of her past life, to identify her interests with his; to go where he goes; to live as he lives; and to die, if such be the will of God, where he dies, and to be buried by his side.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As applied to the Church - the bride of the Lamb - the idea here is that which we find so often enforced in the New Testament, that they who become the followers of the Saviour must be willing to forsake all for him, and to identify themselves with him and his cause. See the notes at Matthew 10:37; notes at Luke 14:26. We are to forsake the world, and devote ourselves to him; we are to break away from all worldly attachments, and to consecrate all to him; we are to bid adieu to worldly companions as our chosen friends, and make the friends of Christ our friends: we are not to pine after the world, to seek to return to it, to pant for its pleasures; we are not to take advantage of our position in the church to promote the objects which we had pursued before we entered it; we are not to introduce the customs, the habits, the plans which we before pursued, \"into\" the church. We are in all things to become identified with him to whom we have become \"espoused\" 2 Corinthians 11:2; we are to live with him; to go with him; to die with him; to be his forever.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As applied to the Church - the bride of the Lamb - the idea here is that which we find so often enforced in the New Testament, that they who become the followers of the Saviour must be willing to forsake all for him, and to identify themselves with him and his cause. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 14:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". We are to forsake the world, and devote ourselves to him; we are to break away from all worldly attachments, and to consecrate all to him; we are to bid adieu to worldly companions as our chosen friends, and make the friends of Christ our friends: we are not to pine after the world, to seek to return to it, to pant for its pleasures; we are not to take advantage of our position in the church to promote the objects which we had pursued before we entered it; we are not to introduce the customs, the habits, the plans which we before pursued, \"into\" the church. We are in all things to become identified with him to whom we have become \"espoused\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 11:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; we are to live with him; to go with him; to die with him; to be his forever.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And thy father's house - The home of thy childhood; the house where thy father dwells. The strongest earthly ties are to be made subservient to a higher and stronger tie, if we would become true followers of the Saviour. See Luke 9:59-62. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And thy father's house - The home of thy childhood; the house where thy father dwells. The strongest earthly ties are to be made subservient to a higher and stronger tie, if we would become true followers of the Saviour. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 9:59-62",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10, 11. She is invited to the union, for forming which she must leave her father's people. She representing, by the form of the allegory, the Church, this address is illustrated by all those scriptures, from Ge 12:1 on, which speak of the people of God as a chosen, separate, and peculiar people. The relation of subjection to her spouse at once accords with the law of marriage, as given in Ge 3:16; 18:12; Eph 5:22; 1Pe 3:5, 6, and the relation of the Church to Christ (Eph 5:24). The love of the husband is intimately connected with the entire devotion to which the bride is exhorted.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10 Hearken, O daughter, and consider, and incline thine ear; forget also thine own people, and thy father's house;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11 So shall the king greatly desire thy beauty: for he is thy Lord; and worship thou him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "12 And the daughter of Tyre shall be there with a gift; even the rich among the people shall entreat thy favour.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 45:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:10",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Hearken, O daughter, and consider.\" Ever is this the great duty of the church. Faith cometh by hearing, and confirmation by consideration. No precept can be more worthy of the attention of those who are honoured to be espoused unto Christ than that which follows. \"And incline thine ear.\" Lean forward that no syllable may be unheard. The whole faculties of the mind should be bent upon receiving holy teaching. \"Forget also thine own people, and thy father's house.\" To renounce the world is not easy, but it must be done by all who are affianced to the Great King, for a divided heart he cannot endure; it would be misery to the beloved one as well as dishonour to her Lord. Evil acquaintances, and even those who are but neutral, must be forsaken, they can confer no benefit, they must inflict injury. The house of our nativity is the house of sin - we were shapen in iniquity; the carnal mind is enmity against God we must come forth of the house of fallen nature, for it is built in the City of Destruction. Not that natural ties are broken by grace, but ties of the sinful nature, bonds of graceless affinity. We have much to forget as well as to learn, and the unlearning is so difficult that only diligent hearing, and considering, and bending of the whole soul to it, can accomplish the work; and even these would be too feeble did not divine grace assist. Yet why should we remember the Egypt from which we came out? Are the leeks and the garlic, and the onions anything, when the iron bondage, and the slavish tasks, and the death-dealing Pharaoh of hell are remembered? We part with folly for wisdom; with bubbles for eternal joys; with deceit for truth; with misery for bliss; with idols for the living God. O that Christians were more mindful of the divine precept here recorded; but, alas! wordliness abounds; the church is defiled; and the glory of the Great King is veiled. Only when the whole church leads the separated life will the full splendour and power of Christianity shine forth upon the world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 45:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:11",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"So shall the king greatly desire thy beauty.\" Whole-hearted love is the duty and bliss of the marriage state in every case, but especially so in this lofty, mystic marriage. The church must forsake all others and cleave to Jesus only, or she will not please him nor enjoy the full manifestation of his love. What less can he ask, what less may she dare propose than to be wholly his? Jesus sees a beauty in his church, a beauty which he delights in most when it is not marred by worldliness. He has always been most near and precious to his saints when they have cheerfully taken up his cross and followed him without the camp. His Spirit is grieved when they mingle themselves among the people and learn their ways. No great and lasting revival of religion can be granted us till the professed lovers of Jesus prove their affection by coming out from an ungodly world, being separated, and touching not the unclean thing. \"For he is thy Lord; and worship thou him.\" He has royal rights still; his condescending grace does not lessen but rather enforce his authority. Our Saviour is also our Ruler. The husband is the head of the wife; the love he bears her does not lessen but strengthen her obligation to obey. The church must reverence Jesus, and bow before him in prostrate adoration; his tender union with her gives her liberty, but not license; it frees her from all other burdens, but places his easy yoke upon her neck. Who would wish it to be otherwise? The service of God is heaven in heaven, and perfectly carried out it is heaven upon earth. Jesus, thou art he whom thy church praises in her unceasing songs, and adores in her perpetual service. Teach us to be wholly thine. Bear with us, and work by thy Spirit in us till thy will is done by us on earth as it is in heaven.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 45:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:12",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"And the daughter of Tyre shall be there with a gift.\" When the church abounds in holiness, she shall know no lack of homage from the surrounding people. Her glory shall then impress and attract the heathen around, till they also unite in doing honour to the Lord. The power of missions abroad lies at home: a holy church will be a powerful church. Nor shall there be lack of treasure in her coffers when grace is in her heart; the free gifts of a willing people shall enable the workers for God to carry on their sacred enterprises without stint. Commerce shall send in its revenue to endow, not with forced levies and imperial taxes, but with willing gifts the church of the Great King. \"Even the rich among the people shall intreat thy favour.\" Not by pandering to their follies, but by testifying against their sins, shall the wealthy be won to the faith of Jesus. They shall come not to favour the church but to beg for her favour. She shall not be the hireling of the great, but as a queen shall she dispense her favours to the suppliant throng of the rich among the people. We go about to beg for Christ like beggars for alms, and many who should know better will make compromises and become reticent of unpopular truth to please the great ones of the earth; not so will the true bride of Christ degrade herself, when her sanctification is more deep and more visible; then will the hearts of men grow liberal, and offerings from afar, abundant and continual, shall be presented at the throne of the Pacific Prince. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hearken:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these words are spoken, either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. In the person of the attendants upon the bride or bridegroom. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Of the bridegroom. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. By the prophet himself; who having hitherto spoken to the bridegroom, or king, now addresseth his speech to the bride, or queen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "O daughter:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so he calls her, partly in token of his respect and affection to her, and partly because she is supposed to be young and beautiful; and therefore the prophet speaks like an eider and graver person, and as her spiritual father and counsellor. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Consider, and incline thine ear:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he useth several words, signifying the same thing, to show his serious and vehement desire of her good, and the great importance and difficulty of practicing the following counsel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Forget also thine own people, and thy father’s house; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not simply, but comparatively, so far as they oppose or hinder the discharge of thy duty to thy husband; or so far as they are corrupted in doctrine, or worship, or practice. He alludes to the law of matrimony, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 2:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to what Solomon did say, or should have said, to Pharaoh’s daughter, to wean her from the idolatry and other vices of her father’s house. But this, as well as the rest of the Psalm, respects Christ, arid is a seasonable and necessary advice and command to all persons that desire to come to Christ, whether Jews or Gentiles, that they would cast off all their inveterate errors and prejudices, all those superstitious, or idolatrous, or wicked opinions or practices, which they had received by long and ancient, and therefore venerable, tradition from their fathers, and entirely give up themselves to Christ to be instructed by him, and to receive his doctrine, though it would seem new to them. And by these words he seems to intimate, and tacitly to foretell, that not only the superstitious inventions and traditions of men, but even the legal worship appointed by Moses, and delivered to them from their parents successively for many generations, should be relinquished by the believing Jews, and abolished by Christ’s coming. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hearken, O daughter, and consider, and incline thine ear,.... These words are either spoken by the prophet, the author of the psalm; or by the King, the bridegroom himself; or, as others think, by Jehovah the Father, whose daughter the church is; unless it should be rather thought to be an address of the honourable women, the kings' daughters, the virgins and companions of the bride, delivered by them to her under the character of the daughter of Zion, the King's daughter, as she is called, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 45:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"to hearken, incline her ear\" and listen to her Lord and King, to his Gospel, and the doctrines of it, which are his voice and words, and to all his precepts and commands; and to \"consider\", see, and behold the goodness of God unto her, the greatness, excellencies, and glories of her husband; to look to him by faith, as he is held forth in the word and ordinances, and to him only and that constantly, which is well pleasing to him; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "forget also thine own people and thy father's house; Christ is to be preferred before natural relations; converted persons are not to have fellowship with carnal men, though ever so, nearly related; former superstitions, Whether Jewish or Heathenish, are to be buried in forgetfulness; sinful self, and righteous self, are to be denied for Christ's sake; and the world, and all things in it, are to be treated with neglect and contempt by such who cleave to him. The Targum interprets this of the congregation of Israel hearing the law, beholding the wonderful works of God, and forgetting the idolatrous practices of their ancestors. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "forget also thine own people and thy father's house; Christ is to be preferred before natural relations; converted persons are not to have fellowship with carnal men, though ever so, nearly related; former superstitions, Whether Jewish or Heathenish, are to be buried in forgetfulness; sinful self, and righteous self, are to be denied for Christ's sake; and the world, and all things in it, are to be treated with neglect and contempt by such who cleave to him. The Targum interprets this of the congregation of Israel hearing the law, beholding the wonderful works of God, and forgetting the idolatrous practices of their ancestors. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{i} Hearken, O daughter, and consider, and incline thine ear; forget also thine own people, and thy father's house;",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Hearken, O daughter, and consider, and incline thine ear; forget also thine own people, and thy father's house;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Under the figure of Pharaoh's daughter, he shows that the Church must cast off all carnal affections to obey Christ only.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hearken, O daughter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Psalmist adopts the tone of an authoritative teacher and uses language resembling that of the Wise Man to his disciples in the opening chapter of Proverbs (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently). The exhortation seems strange until it is remembered that the marriage was probably a matter of state policy, and that the bride would not even have seen her future husband.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forget",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Cast no lingering looks of regret behind, but adapt thyself to the new home and new conditions. Perhaps, as the Targ. suggests, there may be a special reference to religious beliefs and customs. It has been thought that Pharaoh’s daughter embraced Judaism, as Egyptian deities are not mentioned among those for which Solomon made high places. See Lumby on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "10–12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The poet addresses the bride, counselling her to forget her old home and surrender herself with complete devotion to her husband, and describing the honours which await her.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hearken, O daughter, and consider, and incline thine ear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The psalmist, having introduced the bride to our notice in ver. 9, proceeds to address her, and to describe the glories of her person and of her ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "entourage.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " First of all, he bids her \"hearken,\" \"consider,\" and \"incline her ear,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " reflect deeply on the new relation in which she is about to be placed, the new sphere which she is entering, the new duties which she will have to discharge. She must give herself wholly to her Lord and Spouse; she must have no thought for any one but him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Forget also thine own people, and thy father's house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " She must break with all associations and bends and relationships that would separate between her and her King, forget the past in the present, cease to Judaize, and be wholly Christ's. Psalm 45:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 45:11-13) The poet next turns to address the one bride of the king, who is now honoured far above the kings' daughters. With שׁמעי he implores for himself a hearing; by ראי yb ;gni he directs her eye towards the new relationship into which she is just entering; by הטּי אזנך he bespeaks her attention to the exhortation that follows; by בּת he puts himself in a position in relation to her similar to that which the teacher and preacher occupies who addresses the bridal pair at the altar. She is to forget her people and her father's house, to sever her natural, inherited, and customary relationships of life, both as regards outward form and inward affections; and should the king desire her beauty, to which he has a right, - for he, as being her husband (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and more especially as being king, is her lord, - she is to show towards him her profoundest, reverent devotion. ויתאו is a hypothetical protasis according to Ges. 128, 2, c. The reward of this willing submission is the universal homage of the nations. It cannot be denied on the ground of syntax that וּבת־צר admits of being rendered \"and O daughter of Tyre\" (Hitzig), - a rendering which would also give additional support to our historical interpretation of the Psalm, - although, apart from the one insecure passage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 20:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Ew. 340, c), there is no instance to be found in which a vocative with ו occurs (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), when another vocative has not already preceded it. But to what purpose would be, in this particular instance, this apostrophe with the words בּת־צר, from which it looks as though she were indebted to her ancestral house, and not to the king whose own she is become, for the acts of homage which are prospectively set before her? Such, however, is not the case; \"daughter of Tyre\" is a subject-notion, which can all the more readily be followed by the predicate in the plural, since it stands first almost like a nomin. absol. The daughter, i.e., the population of Tyre - approaching with presents shall they court (lit., stroke) thy face, i.e., meeting thee bringing love, they shall seek to propitiate thy love towards themselves. (פּני) חלּה corresponds to the Latin mulcere in the sense of delenire; for חלה, Arab. ḥlâ (root חל, whence חלל, Arab. ḥll, solvit, laxavit), means properly to be soft and tender, of taste to be sweet (in another direction: to be lax, weak, sick); the Piel consequently means to soften, conciliate, to make gentle that which is austere. Tyre, however, is named only by way of example; עשׁירי עם is not an apposition, but a continuation of the subject: not only Tyre, but in general those who are the richest among each separate people or nation. Just as אביוני אדם (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are the poorest of mankind, so עשׁירי עם are the richest among the peoples of the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As regards the meaning which the congregation or church has to assign to the whole passage, the correct paraphrase of the words \"and forget thy people\" is to be found even in the Targum: \"Forget the evil deeds of the ungodly among thy people, and the house of the idols which thou hast served in the house of thy father.\" It is not indeed the hardened mass of Israel which enters into such a loving relationship to God and to His Christ, but, as prophecy from Deuteronomy 32 onward declares, a remnant thoroughly purged by desolating and sifting judgments and rescued, which, in order to belong wholly to Christ, and to become the holy seed of a better future (Isaiah 6:13), must cut asunder all bonds of connection with the stiff-neckedly unbelieving people and paternal house, and in like manner to Abram secede from them. This church of the future is fair; for she is expiated (Deuteronomy 32:43), washed (Isaiah 4:4), and adorned (Isaiah 61:3) by her God. And if she does homage to Him, without looking back, He not only remains her own, but in Him everything that is glorious belonging to the world also becomes her own. Highly honoured by the King of kings, she is the queen among the daughters of kings, to whom Tyre and the richest among peoples of every order are zealous to express their loving and joyful recognition. Very similar language to that used here of the favoured church of the Messiah is used in Psalm 72:10. of the Messiah Himself. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As regards the meaning which the congregation or church has to assign to the whole passage, the correct paraphrase of the words \"and forget thy people\" is to be found even in the Targum: \"Forget the evil deeds of the ungodly among thy people, and the house of the idols which thou hast served in the house of thy father.\" It is not indeed the hardened mass of Israel which enters into such a loving relationship to God and to His Christ, but, as prophecy from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " onward declares, a remnant thoroughly purged by desolating and sifting judgments and rescued, which, in order to belong wholly to Christ, and to become the holy seed of a better future (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), must cut asunder all bonds of connection with the stiff-neckedly unbelieving people and paternal house, and in like manner to Abram secede from them. This church of the future is fair; for she is expiated (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), washed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and adorned (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 61:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") by her God. And if she does homage to Him, without looking back, He not only remains her own, but in Him everything that is glorious belonging to the world also becomes her own. Highly honoured by the King of kings, she is the queen among the daughters of kings, to whom Tyre and the richest among peoples of every order are zealous to express their loving and joyful recognition. Very similar language to that used here of the favoured church of the Messiah is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". of the Messiah Himself. ",
            "children": []
          }
        ]
      }
    ]
  }
]