[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 45:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will make thy name to be remembered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — As he began the Psalm with the celebration of the King’s praises, so now he ends with it, and adds this important circumstance, that this nuptial song should not only serve for the present solemnity, but should be remembered and sung in all successive generations: which plainly shows that it was not composed upon such a slight and transitory occasion as that of Solomon’s marriage, which was soon forgotten, and which, indeed, the Israelites had little cause to remember with any satisfaction; but upon that great, and glorious, and everlasting marriage between Christ and his church, in which it is most properly and literally verified. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "45:10-17 If we desire to share these blessings, we must hearken to Christ's word. We must forget our carnal and sinful attachments and pursuits. He must be our Lord as well as our Saviour; all idols must be thrown away, that we may give him our whole heart. And here is good encouragement, thus to break off from former alliances. The beauty of holiness, both on the church and on particular believers, is, in the sight of Christ, of great price, and very amiable. The work of grace is the workmanship of the Spirit, it is the image of Christ upon the soul, a partaking of the Divine nature. It is clear of all sin, there is none in it, nor any comes from it. There is nothing glorious in the old man or corrupt nature; but in the new man, or work of grace upon the soul, every thing is glorious. The robe of Christ's righteousness, which he has wrought out for his church, the Father imputes unto her, and bestows upon her. None are brought to Christ, but those whom the Father brings. This notes the conversion of souls to him. The robe of righteousness, and garments of salvation, the change of raiment Christ has put upon her. Such as strictly cleave to Christ, loving him in singleness of heart, are companions of the bride, who partake of the very same grace, enjoy the same privileges, and share in one common salvation. These, every one, shall be brought to the King; not one lost or left behind. Instead of the Old Testament church, there shall be a New Testament church, a Gentile church. In the believing hope of our everlasting happiness in the other world, let us always keep up the remembrance of Christ, as our only way thither; and transmit the remembrance of him to succeeding generations, that his name may endure for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will make thy name to be remembered in all generations - The psalmist here evidently speaks as an inspired man, and the idea is that his thus singing the praises of the \"king\" - the Messiah - would be among the means of causing His name to be celebrated in all future ages. This song would go down to future times, and would serve to keep up the true knowledge of the Messiah in the far distant ages of the world. No one can doubt that this has been thus far accomplished; no one has any reason to doubt that this psalm \"will be\" among the means of keeping up the true knowledge of the Messiah, and of securing the remembrance of him upon the earth in all future periods of the world's history. This psalm has been on million of lips, in praise of the Messiah; it will be on hundreds of million more in future times, as expressive of tender love for the Redeemer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Therefore shall the people praise thee forever and ever - Thy praise will never cease to be celebrated. The time will never come on earth when that praise will die away; and in all the eternity beyond the termination of this world's history there never will arrive a period when thy name will not be honored, and when thy praises shall cease to be sung. Compare the notes at Revelation 4:10; notes at Revelation 5:9-13. Happy are they who join in that song on earth; happy they who will unite in it in the heavenly world! ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Therefore shall the people praise thee forever and ever - Thy praise will never cease to be celebrated. The time will never come on earth when that praise will die away; and in all the eternity beyond the termination of this world's history there never will arrive a period when thy name will not be honored, and when thy praises shall cease to be sung. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 4:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 5:9-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Happy are they who join in that song on earth; happy they who will unite in it in the heavenly world! ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. The glories of this empire shall be as wide as the world and lasting as eternity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "therefore—Because thus glorious, the praise shall be universal and perpetual. Some writers have taxed their ingenuity to find in the history and fortunes of Christ and His Church exact parallels for every part of this splendid allegory, not excepting its gorgeous Oriental imagery. Thus, by the dresses of the king and queen, are thought to be meant the eminent endowments and graces of Christ and His people. The attendant women, supposed (though inconsistently it might seem with the inspired character of the work) to be concubines, are thought to represent the Gentile churches, and the bride the Jewish, &c. But it is evident that we cannot pursue such a mode of interpretation. For, following the allegory, we must suspend to the distant future the results of a union whose consummation as a marriage is still distant (compare Re 21:9). In fact, the imagery here and elsewhere sets before us the Church in two aspects. As a body, it is yet incomplete, the whole is yet ungathered. As a moral institution, it is yet imperfect. In the final catastrophe it will be complete and perfect. Thus, as a bride adorned, &c., it will be united with its Lord. Thus the union of Christ and the Church triumphant is set forth. On the other hand, in regard to its component parts, the relation of Christ as head, as husband, &c., already exists, and as these parts form an institution in this world, it is by His union with it, and the gifts and graces with which He endows it, that a spiritual seed arises and spreads in the world. Hence we must fix our minds only on the one simple but grand truth, that Christ loves the Church, is head over all things for it, raises it in His exaltation to the highest moral dignity—a dignity of which every, even the meanest, sincere disciple will partake. As to the time, then, in which this allegorical prophecy is to fulfilled, it may be said that no periods of time are specially designated. The characteristics of the relation of Christ and His Church are indicated, and we may suppose that the whole process of His exaltation from the declaration of His Sonship, by His resurrection, to the grand catastrophe of the final judgment, with all the collateral blessings to the Church and the world, lay before the vision of the inspired prophet.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " As he began the Psalm with the celebration of the king’s praises, so now he endeth with it, and adds this important circumstance, that this nuptial song should not only serve for the present solemnity, as others of that kind do, but that it should be remembered and sung in all successive generations; which plainly showeth that it was not composed upon such a slight and transitory occasion as that of Solomon’s marriage with Pharaoh’s daughter, which was soon forgotten, and the Israelites had little cause to remember it with any satisfaction; but upon that great and glorious and everlasting marriage between Christ and his church, of which this is most properly and literally verified. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will make thy name to be remembered in all generations,.... These are the words of the psalmist, spoken to the King Messiah, declaring what he would do with respect to him; cause his name, that is, not any particular name or title of his, but rather his Gospel, the good matter he had endited concerning him; or he himself to be remembered, desired, loved, thought of, called upon, and praised in all succeeding generations; and which he did by penning of this psalm, which has been the occasion of the remembrance of Christ's name in all ages, to the present time; and of its being remembered by us now, and the same use it will have in time to come; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "therefore shall the people praise thee for ever and ever; because of the excellencies of his person; and particularly because of his greatness and glory as a King; as well as for all mercies, temporal and spiritual, they have from him; and this is but just, meet, and lovely, and is and will be their employment, as long as they live in this world, and to all eternity. This must be understood not of all people, but of God's chosen and covenant people; those that are given to Christ to be his people, and whom he has redeemed and purified to himself, a peculiar people; and particularly his people among the Gentiles: and so the Targum interprets it of such that are proselytes. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "therefore shall the people praise thee for ever and ever; because of the excellencies of his person; and particularly because of his greatness and glory as a King; as well as for all mercies, temporal and spiritual, they have from him; and this is but just, meet, and lovely, and is and will be their employment, as long as they live in this world, and to all eternity. This must be understood not of all people, but of God's chosen and covenant people; those that are given to Christ to be his people, and whom he has redeemed and purified to himself, a peculiar people; and particularly his people among the Gentiles: and so the Targum interprets it of such that are proselytes. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I will make thy {o} name to be remembered in all generations: therefore shall the people praise thee for ever and ever.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I will make thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " name to be remembered in all generations: therefore shall the people praise thee for ever and ever.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) This must only be referred to Christ and not to Solomon.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The poet’s song will perpetuate the memory of the king; and that not in Israel only, but among other peoples (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "therefore shall the people praise thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Therefore shall the peoples praise thee, or (R.V.) give thee thanks: a word commonly applied to God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and often), rarely to men (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Solomon’s name is remembered while the names of monarchs far more powerful from a worldly point of view have been forgotten, because God had made him His representative and the head of His visible kingdom upon earth, the type of His perfect representative who should come to establish His universal kingdom among men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will make thy name to be remembered in all generations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". I, the psalmist, with my \"pen of a ready writer,\" will so sing thy praise that thy name shall always he had in remembrance; and therefore - because of my words - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "shall the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "peoples -",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " all the nations of the earth - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "praise thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "for ever and ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There is here, mixed with the praise of Messiah, a certain amount of self-glorification; but perhaps the \"son of Korah,\" who had composed so noble a poem, may be excused for somewhat \"vaunting himself.\"  ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalm 45:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 45:17-18) All this has its first and most natural meaning in relation to contemporary history but without being at variance with the reference of the Psalm to the King Messiah, as used by the church. Just as the kings of Judah and of Israel allowed their sons to share in their dominion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 11:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 20:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so out of the loving relationship of the daughter of Zion and of the virgins of her train to the King Messiah there spring up children, to whom the regal glory of the house of David which culminates in Him is transferred, - a royal race among which He divides the dominion of the earth (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 149:1-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for He makes His own people \"kings and priests, and they shall reign on the earth\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Those children are to be understood here which, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 110:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are born to Him as the dew out of the womb of the morning's dawn - the every-youthful nation, by which He conquers and rules the world. When, therefore, the poet says that he will remember the name of the king throughout all generations, this is based upon the twofold assumption, that he regards himself as a member of an imperishable church (Sir. 37:25), and that he regards the king as a person worthy to be praised by the church of every age. Elsewhere Jahve's praise is called a praise that lives through all generations (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 102:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 135:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); here the king is the object of the everlasting praise of the church, and, beginning with the church, of the nations also. First of all Israel, whom the psalmist represents, is called upon to declare with praise the name of the Messiah from generation to generation. But it does not rest with Israel alone. The nations are thereby roused up to do the same thing. The end of the covenant history is that Israel and the nations together praise this love-worthy, heroic, and divine King: \"His name shall endure for ever; as long as the sun shall His name bud, and all nations shall be blessed in Him (and) shall praise Him\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]