[{"header":"The Pharisees Object To Plucking Grain On The Sabbath. I Am Lord of The Sabbath"},{"num":6,"verse":"And it came about on a Sabbath that He was proceeding through grainfields. And His disciples were plucking and eating the heads [of grain], rubbing them in their hands. "},{"num":2,"verse":"And some of the Pharisees said, “Why are you doing what is not lawful on the Sabbath?” "},{"num":3,"verse":"And having responded to them, Jesus said, “Did you not even read [in 1 Sam 21:1-6] this which David did when he was hungry, he and the ones being with him?— "},{"num":4,"verse":"how he entered into the house of God, and having taken the Bread of Presentation, he ate it and gave it to the ones with him, which is not lawful for anyone to eat but the priests alone? "},{"num":5,"verse":"And He was saying to them, “The Son of Man is Lord of the Sabbath”."},{"header":"Is It Lawful To Heal On The Sabbath? Jesus Heals a Man, Enraging The Pharisees"},{"num":6,"verse":"And it came about on another Sabbath that He entered into the synagogue and was teaching. And there was a man there, and his right hand was withered. "},{"num":7,"verse":"And the scribes and the Pharisees were closely-watching Him to see if He cured on the Sabbath, in order that they might find a reason to be accusing Him. "},{"num":8,"verse":"But He knew their reasonings. And He said to the man having the withered hand, “Arise, and stand into the middle”. And having stood-up, he stood there. "},{"num":9,"verse":"And Jesus said to them, “I am asking you if it is lawful on the Sabbath to do-good or to do-harm, to save a life or to destroy it?” "},{"num":10,"verse":"And having looked-around at them all, He said to him, “Stretch-out your hand”. And the one did it, and his hand was restored. "},{"num":11,"verse":"And they were filled with rage, and were talking-over with one another what they might do to Jesus."},{"header":"After Choosing The Twelve, Jesus Stands Before a Huge Crowd To Teach Them"},{"num":12,"verse":"And it came about during these days that He went out to the mountain to pray. And He was spending the night in prayer to God. "},{"num":13,"verse":"And when it became day, He called to His disciples. And having chosen twelve from them, whom He also named apostles— "},{"num":14,"verse":"Simon, whom He also named Peter, and Andrew, his brother, and James, and John, and Philip, and Bartholomew, "},{"num":15,"verse":"and Matthew, and Thomas, and James, the son of Alphaeus, and Simon, the one being called a Zealot, "},{"num":16,"verse":"and Judas, the son of James, and Judas Iscariot, who became a traitor— "},{"num":17,"verse":"and having come down with them, He stood on a level place. And there was a large crowd of His disciples, and a great multitude of the people from all Judea and Jerusalem and the coastal-region of Tyre and Sidon, "},{"num":18,"verse":"who came to hear Him and to be healed from their diseases. And the ones being troubled by unclean spirits were being cured. "},{"num":19,"verse":"And all the multitude were seeking to touch Him because power was going forth from Him and healing everyone."},{"header":"These Are The Ones God Considers Blessed And In Danger"},{"num":20,"verse":"And He, having lifted-up His eyes toward His disciples, was saying— “Blessed are the poor ones, because the kingdom of God is yours. "},{"num":21,"verse":"Blessed are the ones hungering now, because you will be filled-to-satisfaction. Blessed are the ones weeping now, because you will laugh. "},{"num":22,"verse":"You are blessed whenever people hate you, and whenever they separate you, and reproach you, and throw-out your name as evil because-of  the Son of Man. "},{"num":23,"verse":"Rejoice on that day and leap-for-joy, for behold— your reward is great in heaven. For their fathers were doing it in the same way to the prophets. "},{"num":24,"verse":"But woe to you rich ones, because you are receiving your comfort in full. "},{"num":25,"verse":"Woe to you, the ones having been filled now, because you will hunger. Woe— the ones laughing now, because you will mourn and weep. "},{"num":26,"verse":"Woe— when all people speak well of you. For their fathers were doing it in the same way to the false-prophets."},{"header":"Love Your Enemies. Be Compassionate And Do Good To All"},{"num":27,"verse":"“But I say to you, the ones hearing— Be loving your enemies. Be acting commendably to the ones hating you. "},{"num":28,"verse":"Be blessing the ones cursing you. Be praying for the ones mistreating you. "},{"num":29,"verse":"To the one striking you on the cheek, be offering also the other. And from the one taking away your cloak, also do not withhold the tunic. "},{"num":30,"verse":"To everyone asking you, be giving. And from the one taking away your things, do not be demanding them back. "},{"num":31,"verse":"And just as you want people to be doing to you, be doing to them likewise. "},{"num":32,"verse":"If indeed you are loving the ones loving you, what-kind-of credit is it to you? For even the sinners are loving the ones loving them. "},{"num":33,"verse":"For if indeed you are doing-good-to the ones doing-good-to you, what kind of credit is it to you? Even the sinners are doing the same. "},{"num":34,"verse":"And if you lend-to ones from whom you are expecting to receive, what kind of credit is it to you? Even sinners are lending to sinners to receive-back the equal amounts. "},{"num":35,"verse":"But be loving your enemies, and be doing good, and be lending, expecting-back nothing, and your reward will be great. And you will be sons of the Most-High, because He is good to the ungrateful and evil ones. "},{"num":36,"verse":"Be compassionate, just-as your Father also is compassionate."},{"header":"Do Not Judge Or Condemn Others. Pardon And Give To Them"},{"num":37,"verse":"“And do not be judging, and you will never be judged. And do not be condemning, and you will never be condemned. Be pardoning, and you will be pardoned. "},{"num":38,"verse":"Be giving, and it will be given to you. They will give a good measure— having been pressed down, having been shaken, running over— into your fold [of the garment]. For with what measure you measure, it will be measured-back to you”."},{"header":"The Blind Cannot Guide The Blind. Correct Yourself First"},{"num":39,"verse":"And He also spoke a parable to them— “A blind one is not able to guide a blind one, is he? Will they not both fall into a pit? "},{"num":40,"verse":"A disciple is not above the teacher. But everyone having been fully-trained will be like his teacher. "},{"num":41,"verse":"And why do you look-at the speck in the eye of your brother, but do not consider the log in your own eye? "},{"num":42,"verse":"How can you say to your brother, ‘Brother, permit me to take-out the speck in your eye’, while yourself not seeing the log in your eye? Hypocrite! First take out the log from your eye. And then you will see-clearly to take out the speck in the eye of your brother."},{"header":"A Tree Is Known By Its Fruit. The Mouth Speaks From The Heart"},{"num":43,"verse":"“For there is no good tree producing bad fruit; nor again, a bad tree producing good fruit. "},{"num":44,"verse":"For each tree is known by its own fruit. For they do not collect figs from thorns, nor do they gather a grape-bunch from a bramble-bush. "},{"num":45,"verse":"The good person brings forth the good thing out of the good treasure of his heart. And the evil person brings forth the evil thing out of his evil treasure. For his mouth speaks out of the abundance of the heart."},{"header":"Don’t Just Call Me Lord. Be a Doer of My Words"},{"num":46,"verse":"“And why are you calling Me ‘Lord, Lord’, and you are not doing the things which I say? "},{"num":47,"verse":"Everyone coming to Me and hearing My words and doing them— I will show you to whom he is like. "},{"num":48,"verse":"He is like a man building a house who dug, and went down deep, and laid a foundation on the bed-rock. And a flood having come about, the river broke-against that house. And it was not strong-enough to shake it, because it had been built well. "},{"num":49,"verse":"But the one having heard and not having done My words is like a man having built a house on the ground without a foundation, which the river broke-against. And immediately it collapsed, and the breakage of that house became great”."}]