[{"header":"Chapter 6"},{"num":1,"verse":"Picking Grain on the Sabbath. On one Sabbath, when Jesus was going through a field of grain, his disciples picked some heads of grain, rubbed them in their hands, and ate them."},{"num":2,"verse":"Some of the Pharisees said, “Why are you doing what is forbidden on the Sabbath?”"},{"num":3,"verse":"Jesus answered them, “Have you not read what David did when he and his companions were hungry?"},{"num":4,"verse":"He entered the house of God and took and ate the sacred bread that only the priests were permitted to eat, and he shared it with his companions.”"},{"num":5,"verse":"Then he said to them, “The Son of Man, is lord of the Sabbath.”"},{"num":6,"verse":"A Man with a Withered Hand. On another Sabbath, Jesus entered the synagogue and began to teach. A man was there whose right hand was withered."},{"num":7,"verse":"The scribes and the Pharisees watched him closely to see whether he would cure him on the Sabbath so that they would have a charge to bring against him."},{"num":8,"verse":"But Jesus was fully aware of their thoughts, and he said to the man with the withered hand, “Come here and stand before us.” The man got up and stood there."},{"num":9,"verse":"Then Jesus said to them, “I put this question to you: Is it lawful to do good or to do evil on the Sabbath, to save life or to destroy it?”"},{"num":10,"verse":"After looking around at all of them, he said to the man, “Stretch out your hand.” He did so, and his hand was restored."},{"num":11,"verse":"But they were filled with fury and discussed among themselves what they might do with Jesus."},{"num":12,"verse":"Jesus Chooses the Twelve Apostles. It was in those days that he went onto the mountain to pray, and he spent the entire night in prayer to God."},{"num":13,"verse":"Then, when it was daylight, he summoned his disciples and chose twelve of them, whom he designated as apostles:"},{"num":14,"verse":"Simon, to whom he gave the name Peter, and his brother Andrew, James, John, Philip, Bartholomew,"},{"num":15,"verse":"Matthew, Thomas, James the son of Alphaeus, Simon called the Zealot,"},{"num":16,"verse":"Judas the son of James, and Judas Iscariot, who became a traitor."},{"num":17,"verse":"The Crowds Seek Out Jesus. He then came down with them and stood on a spot of level ground, where there was a large crowd of his disciples and a great multitude of people from all sections of Judea and Jerusalem and the coastal region of Tyre and Sidon."},{"num":18,"verse":"They had come there to listen to him and to be healed of their diseases. Those who were afflicted by unclean spirits were cured."},{"num":19,"verse":"And everyone in the crowd was trying to touch him, because power came forth from him and healed them all."},{"header":"The Sermon on the Plain[e]"},{"num":20,"verse":"The Beatitudes. Then, turning to his disciples, he began to speak:"},{"num":22,"verse":"“Blessed are you when people hate you and ostracize you, when they insult you and denounce your name as evil on account of the Son of Man."},{"num":23,"verse":"Rejoice on that day and dance for joy, for your reward will be great in heaven. This was the way their ancestors treated the Prophets."},{"num":27,"verse":"Love of Enemies.“But to those of you who are listening to me, I say: Love your enemies, do good to those who hate you,"},{"num":28,"verse":"bless those who curse you, pray for those who mistreat you."},{"num":29,"verse":"If anyone strikes you on one cheek, offer him the other cheek as well, and should someone take your cloak, let him have your tunic as well."},{"num":30,"verse":"Give to everyone who begs from you, and do not demand the return of what is yours from the one who has taken it."},{"num":31,"verse":"“Deal with others as you would like them to deal with you."},{"num":32,"verse":"If you love only those who love you, what credit is that to you? Even sinners love those who love them."},{"num":33,"verse":"And if you do good to those who do good to you, what credit is that to you? Even sinners do as much."},{"num":34,"verse":"And if you lend only to those from whom you expect to be repaid, what credit is that to you? Even sinners lend to sinners, expecting to be repaid in full."},{"num":35,"verse":"“Rather, you must love your enemies and do good to them, and lend without expecting any repayment. In this way, you will receive a great reward. You will be sons of the Most High, for he himself is kind to the ungrateful and the wicked."},{"num":36,"verse":"Be merciful, just as your Father is merciful."},{"num":37,"verse":"Relations with Others.“Do not judge, and you will not be judged. Do not condemn, and you will not be condemned. Forgive, and you will be forgiven."},{"num":38,"verse":"Give, and it will be given to you. A good measure, pressed down, shaken together, and running over, will be poured into your lap. The measure that you use for others will be used to measure you.”"},{"num":39,"verse":"Parable of the Blind Leading the Blind. He also told them a parable: “Can one blind man guide another who is also blind? Will not both of them fall into a pit?"},{"num":40,"verse":"No student is greater than his teacher, but a fully trained student will be like his teacher."},{"num":41,"verse":"“Why do you take note of the splinter in your brother’s eye but do not notice the wooden plank in your own eye?"},{"num":42,"verse":"How can you say to your brother, ‘Brother, let me remove the splinter that is in your eye,’ while all the time you do not notice the wooden plank that is in your own eye? You hypocrite! First remove the wooden plank from your own eye, and then you will be able to see clearly enough to remove the splinter that is in your brother’s eye."},{"num":43,"verse":"A Tree Is Known by Its Fruit.“No healthy tree can bear rotten fruit, nor does a rotting tree bear healthy fruit."},{"num":44,"verse":"Every tree is known by its own fruit. For people do not pick figs from thornbushes or grapes from brambles."},{"num":45,"verse":"A good man produces good from the store of goodness in his heart, whereas an evil man produces evil from the store of evil within him. For the mouth speaks from the abundance of the heart."},{"num":46,"verse":"Parable of the Two Foundations.“Why do you call me, ‘Lord, Lord,’ but fail to do what I tell you?"},{"num":47,"verse":"I will show you what everyone is like who comes to me and hears my words and acts in accordance with them."},{"num":48,"verse":"He is like a man who in building a house dug deeply and laid its foundations on rock. When the flood rose, it burst against that house but could not shake it because it had been solidly constructed."},{"num":49,"verse":"In contrast, the one who hears and does not act in accordance with my words is like a man who built a house on the ground without a foundation. As soon as the river burst against it, the house collapsed and was completely destroyed.”"}]