[{"header":"Shabbat in the Grain Fields"},{"num":6,"verse":"Now during Shabbat, Yeshua was passing through grain fields; and His disciples were picking and eating heads of grain, rubbing them in their hands. "},{"num":2,"verse":"But some of the Pharisees said, “Why are you doing what is not permitted on Shabbat?”"},{"num":3,"verse":"Then answering them, Yeshua said, “Haven’t you read what David did when he was hungry, and those with him? "},{"num":4,"verse":"How he entered into the house of God, took and ate the showbread which only the kohanim are permitted to eat, and even gave it to those with him?”"},{"num":5,"verse":" He said to them, “The Son of Man is Lord of Shabbat.”"},{"header":"Shabbat Controversy at the Synagogue"},{"num":6,"verse":"On a different Shabbat, Yeshua entered the synagogue and was teaching. A man was there, whose right hand was paralyzed. "},{"num":7,"verse":"But closely watching Him were the Torah scholars and Pharisees, to see if He heals on Shabbat, so that they might find grounds to accuse Him. "},{"num":8,"verse":"But He knew their opinions and said to the man with the paralyzed hand, “Get up and stand in our midst.” And getting up, the man stood."},{"num":9,"verse":"Yeshua said to them, “I ask you, is it permitted on Shabbat to do good or to do evil, to save or to destroy a life?” "},{"num":10,"verse":"Then looking around at everyone, He said to the man, “Stretch out your hand.” The man did, and his hand was restored. "},{"num":11,"verse":"But they were filled with fury and discussed among themselves what they might do to Yeshua."},{"header":"Appointing the Twelve"},{"num":12,"verse":"And it was during these days that Yeshua went out to the mountain to pray, and He spent all night in prayer to God. "},{"num":13,"verse":"When day came, He called His disciples, choosing from among them twelve whom He also named emissaries—"},{"num":14,"verse":"Simon, whom He also named Peter, and Andrew his brother; and Jacob and John; and Philip and Bartholomew; "},{"num":15,"verse":"and Matthew and Thomas; Jacob the son of Alphaeus; Simon who was called the Zealot; "},{"num":16,"verse":"Judah the son of Jacob; and Judah from Kriot, who became a traitor."},{"header":"The Sermon on the Plain"},{"num":17,"verse":"Then Yeshua came down with them and stood on a level place. A large crowd of His disciples and a multitude of people, from all Judea, Jerusalem, and the coastal region of Tyre and Sidon, "},{"num":18,"verse":"had come to hear Him and to be healed of their diseases. Even those disturbed by defiling spirits were being healed. "},{"num":19,"verse":"Everyone in the crowd was trying to touch Him, because power flowed from Him and He was healing them all."},{"num":20,"verse":"And looking up at His disciples, He said,"},{"num":23,"verse":"Rejoice in that day and jump for joy! For behold, your reward is great in heaven! For their fathers used to treat the prophets the same way.”"},{"num":27,"verse":"“But I say to you who are listening: Love your enemies, do good to those who hate you, "},{"num":28,"verse":"bless those who curse you, pray for the ones who mistreat you. "},{"num":29,"verse":"To the one who strikes you on the cheek, offer the other also. And from the one who takes your cloak, do not hold back your shirt. "},{"num":30,"verse":"Give to every one who asks you; and whoever takes something of yours, make no demands upon him."},{"num":31,"verse":"“Do to others as you would have them do to you. "},{"num":32,"verse":"If you love those who love you, what credit is that to you? For even sinners love those who love them. "},{"num":33,"verse":"And if you do good to those who are doing good to you, what credit is that to you? Even sinners do this. "},{"num":34,"verse":"And if you lend to those from whom you expect to take, what credit is that to you? Even sinners lend to sinners in order to receive back the same."},{"num":35,"verse":"“But love your enemies, and do good, and lend, expecting nothing in return. Then your reward will be great and you will be sons of Elyon, for He is kind to the ungrateful and evil ones. "},{"num":36,"verse":"Be compassionate, just as your Father is compassionate to you.”"},{"num":37,"verse":"Do not judge, and you will not be judged. Do not condemn, and you will not be condemned. Pardon, and you will be pardoned. "},{"num":38,"verse":"Give, and it will be given to you—a good measure, pressed down, shaken together, overflowing, will be given into your lap. For whatever measure you measure out will be measured back to you.”"},{"num":39,"verse":"He also spoke this parable to them: “The blind cannot show the way to the blind, can he? Won’t they both fall into a pit? "},{"num":40,"verse":"A disciple is not above his teacher, but everyone who is fully trained will be like his teacher."},{"num":41,"verse":"“Why do you look at the speck in your brother’s eye, but do not notice the beam in your own eye? "},{"num":42,"verse":"How can you say to your brother, ‘Brother, let me take out the speck in your eye,’ when you yourself do not see the beam in your own eye? You hypocrite! First take the beam out of your own eye, and then you will see clearly the speck in your brother’s eye, to take it out.”"},{"num":43,"verse":"“For there is no good tree that produces rotten fruit, nor again does a rotten tree produce good fruit. "},{"num":44,"verse":"Each tree comes to be known by its own fruit. For figs are not gleaned out of briars; neither are bunches of grapes gathered from thorn bushes."},{"num":45,"verse":"“Out of the good treasure of his heart the good man brings forth good, and out of evil the evil man brings forth evil. For from the overflow of the heart his mouth speaks.”"},{"num":46,"verse":"“Why do you call Me ‘Master, Master’ and do not do what I say? "},{"num":47,"verse":"Everyone who comes to Me and hears My words and does them, I will show you what he is like. "},{"num":48,"verse":"He is like a man building a house, who dug deep and laid a foundation on the rock. And when a flood came, the torrent burst against that house but could not shake it, because it had been well built."},{"num":49,"verse":"“But the one who hears yet does not do is like a man who built a house upon land without a foundation. When the torrent burst against it, immediately it collapsed—and the destruction of that house was great!”"}]