[{"num":13,"verse":"Saul was thirty years old when he ·became king [began to reign/rule], and he ·was king [reigned; ruled] over Israel forty-two years. "},{"num":2,"verse":"Saul chose three thousand men from Israel. Two thousand men stayed with him at Micmash in the ·mountains [hill country] of Bethel, and one thousand men stayed with Jonathan at Gibeah in Benjamin. Saul sent the other men in the army back ·home [to their tents]."},{"num":3,"verse":"Jonathan ·attacked [struck] the Philistine ·camp [garrison] in Geba, and the other Philistines heard about it. Saul said, “Let the Hebrews hear what happened.” So he told the men to blow ·trumpets [ram’s horns] through all the land of Israel. "},{"num":4,"verse":"All the Israelites heard the news. The men said, “Saul has ·defeated [struck] the Philistine camp [garrison; Saul receives credit for Jonathan’s victory]. Now ·the Philistines will really hate us [Israel will stink among the Philistines]!” Then the Israelites were called to join Saul at Gilgal."},{"num":5,"verse":"The Philistines gathered to fight Israel with three thousand chariots and six thousand ·men to ride in them [horsemen; charioteers]. Their soldiers were as many as the grains of sand on the seashore. The Philistines went and camped at Micmash, which is east of Beth Aven. "},{"num":6,"verse":"When the Israelites saw that they were in ·trouble [a tight spot; desperate straits], they went to hide in caves and ·bushes [thickets; or holes], among the ·rocks [cliffs; crevices], and in ·pits [cellars; tombs; vaults] and ·wells [cisterns]. "},{"num":7,"verse":"Some Hebrews even went across the Jordan River to the land of Gad and Gilead."},{"num":8,"verse":"Saul waited seven days, ·because Samuel had said he would meet him then [the period/time Samuel had set; as a priest, Samuel had to offer sacrifices before battle]. But Samuel did not come to Gilgal, and the soldiers began to ·leave [scatter; slip away]."},{"num":9,"verse":"So Saul said, “Bring me the whole burnt offering and the ·fellowship [peace; communion] offerings.” Then Saul ·offered [sacrificed] the whole burnt offering. "},{"num":10,"verse":"Just as he finished, Samuel arrived, and Saul went to greet him."},{"num":11,"verse":"Samuel asked, “What have you ·done [been doing]?”"},{"num":12,"verse":"Then I thought, ‘The Philistines will come against me at Gilgal, and I haven’t asked for the Lord’s ·approval [help; favor].’ So I ·forced myself [felt compelled/it necessary] to offer the whole burnt offering.”"},{"num":13,"verse":"Samuel said, “You acted foolishly [only priests could legitimately offer sacrifices]! You haven’t ·obeyed [kept] the command of the Lord your God [frightened troops should have been allowed to leave; Deut. 20:8–9]. If you had obeyed him, the Lord would have ·made your kingdom continue [established your kingdom] ·in [over] Israel always [Saul rather than David would have had a dynasty], "},{"num":14,"verse":"but now your kingdom will not ·continue [last; endure]. The Lord has ·looked for the kind of man he wants [sought a man after his own heart; 16:6–13]. He has appointed him to ·rule [be prince over] his people, because you haven’t ·obeyed his [kept the Lord’s] command.”"},{"num":15,"verse":"Then Samuel left Gilgal and went to Gibeah in Benjamin. Saul counted the men who were still with him, and there were about six hundred."},{"header":"Hard Times for Israel"},{"num":16,"verse":"Saul and his son Jonathan and the soldiers with him stayed in Gibeah in the land of Benjamin. The Philistines made their camp at Micmash. "},{"num":17,"verse":"Three ·groups [raiding parties] went out from the Philistine camp to make raids. One ·group [company] went on the Ophrah road in the land of Shual. "},{"num":18,"verse":"The second group went on the Beth Horon road. The third group went on the border road that overlooks the Valley of Zeboim toward the ·desert [wilderness]."},{"num":19,"verse":"The whole land of Israel had no blacksmith because the Philistines had said, “The Hebrews ·might [must not] make swords and spears.” "},{"num":20,"verse":"So all the Israelites had to go down to the Philistines to have their plows, hoes, axes, and sickles sharpened. "},{"num":21,"verse":"The Philistine blacksmiths charged ·about one-fourth of an ounce of silver [two-thirds of a shekel] for sharpening plows and hoes. And they charged ·one-eighth of an ounce of silver [one-third of a shekel] for sharpening picks, axes, and the ·sticks used to guide oxen [goads]."},{"num":22,"verse":"So when the battle came, the ·soldiers [people] with Saul and Jonathan had no swords or spears [in their hands]. Only Saul and his son Jonathan had them."},{"header":"Israel Defeats the Philistines"},{"num":23,"verse":"A ·group from [unit/detachment of] the Philistine army had gone out to the pass at Micmash."}]