[{"header":"Saul’s Battles against the Philistines"},{"num":13,"verse":"Saul was 30 years old when he began to reign, and he ruled for 42 years over Israel. "},{"num":2,"verse":"Saul chose for himself 3,000 men from Israel. There were 2,000 with Saul in Michmash and the hill country of Bethel, while 1,000 were with Jonathan in Gibeah of Benjamin. He had sent the rest of the people home."},{"num":3,"verse":"Jonathan attacked the Philistine garrison in Geba, and the Philistines heard about it. Saul blew the trumpet throughout the land: “Listen, Hebrews!” "},{"num":4,"verse":"All Israel heard the report, “Saul has attacked the Philistine garrison and Israel has also become repulsive to the Philistines.” Then the people were summoned to Saul at Gilgal."},{"num":5,"verse":"The Philistines assembled to fight against Israel with 30,000 chariots, 6,000 horsemen, and people as numerous as the sand on the seashore. And they advanced and camped in Michmash, east of Beth-aven. "},{"num":6,"verse":"When the men of Israel saw that they were in distress (for the people were in difficult circumstances), the people hid themselves in caves, in thickets, in crags, in tombs, and in pits. "},{"num":7,"verse":"Hebrews went across the Jordan to the land of Gad and Gilead, but Saul remained in Gilgal, and all the people followed him, trembling."},{"num":8,"verse":"Saul waited seven days for the appointment set by Samuel. When Samuel did not arrive at Gilgal, as the people began to scatter from Saul, "},{"num":9,"verse":"Saul said, “Bring the burnt offering and the peace offering to me,” and he offered the burnt offering. "},{"num":10,"verse":"Just as he finished offering the burnt offering, Samuel arrived, and Saul went out to meet and greet him."},{"num":11,"verse":"Samuel said, “What have you done?”"},{"num":12,"verse":"I thought, ‘The Philistines will come down against me at Gilgal but I’ve not sought the favor of the Lord,’ so I forced myself to offer the burnt offering.”"},{"num":13,"verse":"Then Samuel told Saul, “You have acted foolishly. You haven’t obeyed the commandment of the Lord your God, which he commanded you. For then the Lord would have established your kingdom over Israel forever, "},{"num":14,"verse":"but now your kingdom won’t be established. The Lord has sought for himself a man after his own heart, and the Lord has appointed him as Commander-in-Chief over his people because you didn’t obey that which the Lord commanded you.”"},{"num":15,"verse":"Then Samuel got up and went from Gilgal to Gibeah of Benjamin. Saul mustered the people present with him, about 600 men. "},{"num":16,"verse":"Saul, his son Jonathan, and the people present with them remained in Geba of Benjamin, while the Philistines camped in Michmash. "},{"num":17,"verse":"Raiders went out of the Philistine camp in three companies. One company turned in the direction of Ophrah, to the land of Shual, "},{"num":18,"verse":"one company turned in the direction of Beth-horon, while the one company turned toward the border that overlooks the valley of Zeboiim toward the desert."},{"header":"The Philistine Monopoly on Metal Working"},{"num":19,"verse":"No blacksmith could be found in all the land of Israel because the Philistines thought, “This will keep the Hebrews from making swords or spears.” "},{"num":20,"verse":"Everyone in Israel would have to go to the Philistines so each person could sharpen his plow, his mattock, his axe, and his sickle. "},{"num":21,"verse":"The charge was one pin for plows, mattocks, three pronged forks, and axes, or for setting the goads. "},{"num":22,"verse":"On the day of battle, none of the people who were with Saul and Jonathan were armed with swords or spears, but Saul and his son Jonathan did have them. "},{"num":23,"verse":"Now a garrison of the Philistines had gone out to the pass of Michmash."}]