[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 9:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If I be wicked, &c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". — The Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אנכי ארשׁע",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "anochi ershang, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I shall be wicked, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "guilty, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "without any supposition. That is, Whether I be holy or wicked, if I dispute with thee I shall be found guilty; or, I shall be treated as guilty; I shall not be acquitted, or exempted from punishment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Why then labour I in vain? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Since my friends will still continue to think and treat me as wicked, and thou wilt still continue to afflict me with the calamities and miseries which gave them occasion to think so, why should I use any efforts to clear myself, and vindicate my innocence? Why should I speak in a cause that is already prejudged? Or, why should I comfort myself with vain hopes of deliverance? With men it is often labour in vain for the most innocent to go about to clear themselves: they will be adjudged guilty, though the evidence be ever so plain for them. But it is not so in our dealings with God, who is the patron of oppressed innocence, and to whom it was never in vain to commit a righteous cause.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:25-35 What little need have we of pastimes, and what great need to redeem time, when it runs on so fast towards eternity! How vain the enjoyments of time, which we may quite lose while yet time continues! The remembrance of having done our duty will be pleasing afterwards; so will not the remembrance of having got worldly wealth, when it is all lost and gone. Job's complaint of God, as one that could not be appeased and would not relent, was the language of his corruption. There is a Mediator, a Daysman, or Umpire, for us, even God's own beloved Son, who has purchased peace for us with the blood of his cross, who is able to save to the uttermost all who come unto God through him. If we trust in his name, our sins will be buried in the depths of the sea, we shall be washed from all our filthiness, and made whiter than snow, so that none can lay any thing to our charge. We shall be clothed with the robes of righteousness and salvation, adorned with the graces of the Holy Spirit, and presented faultless before the presence of his glory with exceeding joy. May we learn the difference between justifying ourselves, and being thus justified by God himself. Let the tempest-tossed soul consider Job, and notice that others have passed this dreadful gulf; and though they found it hard to believe that God would hear or deliver them, yet he rebuked the storm, and brought them to the desired haven. Resist the devil; give not place to hard thoughts of God, or desperate conclusions about thyself. Come to Him who invites the weary and heavy laden; who promises in nowise to cast them out.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If I be wicked, why then labour I in vain? - The word \"if,\" here introduced by our translators, greatly obscures the sense. The meaning evidently is, \"I am held to be guilty, and cannot answer to that charge. God regards me as such, and if I should attempt to meet him on the charge, it would be a vain attempt; and I must admit its truth. It would be labor in vain to deny it against one so mighty as he is.\" This interpretation accords with the argument in the whole chapter. Job maintains that it would be in vain to contend with God, and he gives up the argument in despair. It is quite evident, however, that he does not do it so much because he is convinced himself, as because he knows that God is great, and that it would be useless to contend with him. There is evidently implied all along the feeling that if he was able to cope with God in the argument, the result would be different. As it is, he submits - not because he is convinced, but because he is weak; not because he sees that God is right, but because he sees that he is powerful. How much submission of this kind is there in the world - submision, not to right, but to power; submission to God, not because he is seen to be wise and good, but because he is seen to be almighty, and it is vain to attempt to oppose him! It is needless to say that such feelings evince no true submission. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29. The \"if\" is better omitted; I (am treated by God as) wicked; why then labor I in vain (to disprove His charge)? Job submits, not so much because he is convinced that God is right, as because God is powerful and he weak [Barnes].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I shall be wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "guilty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, before thee. Whether I be holy or wicked, if I dispute with thee, I shall be found guilty. Or thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I shall be used like a wicked man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and punished as such. So this is opposed to his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "held innocent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 9:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. not being acquitted or exempt from punishment. Why then should I not indulge my griefs, but restrain them? Why should I comfort myself with vain hopes of deliverance, as thou advisest me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 8:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; or seek to God, as I was directed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 5:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", for that ease which I see he is resolved not to give me? Why should I trouble myself with clearing mine innocency, seeing God will still hold me guilty? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If I be wicked, why then labour I in vain? If he was that wicked person, that hypocrite, Bildad and his other friends took him to be, it was in vain for him to make his supplications to God, as they advised him; so Gersom gives the sense of the words; since God hears not sinners, such as live in sin, regard iniquity in their hearts, and practise it in their lives, at least secretly, as it was suggested Job did; if he was such an one, it must be all lost labour to pray to God to show favour to him, and deliver him out of his troubles, since he might reasonably expect he would shut his eyes and stop his ears at such a man, and regard not his cries; seeking to him must be in vain; prayer may be fitly enough expressed by labour, it is a striving and wrestling with God, and especially when it is constant, importunate, and fervent: but rather the sense is, that if he was a wicked man in the account of God, or was dealt with as one; if God would not hold him innocent, as he asserts in the latter part of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; then it was a vain thing to labour the point in the vindication of himself; since he could never think of succeeding against God, so wise and powerful, so holy, just, and pure. The word \"if\" is not in the original text, and may be left out, and the words be rendered, \"I am wicked\" (l); not in any notorious manner, as having lived a scandalous life, or been guilty of some gross enormities, as his friends insinuated, but in common with other men; he was born a sinner, had been a transgressor from the womb, and though he was renewed and sanctified by the spirit of God, yet sin dwelt in him, and through the infirmity of the flesh he was daily sinning in thought, word, or deed; nor did he expect it would be otherwise with him while in this world; yea, it was impossible for him to be without sin, as Bar Tzemach observes to be the sense of the phrase; and therefore if God would not clear him, or hold him innocent, unless he was entirely free from sin, as it was labouring in vain to attain to such perfection, so it must be to no purpose, and is what he chiefly intends, to attempt to vindicate himself before God: or \"I shall be wicked\", or \"ungodly\" (m); I shall be treated as such not only by his friends, who would reckon him a very wicked man so long as those afflictions continued on him, let him say what he would; but by the Lord himself, who he believed would never release him from them as long as he lived, which in the eye of men would be a tacit condemnation of him; so the Targum,\"I shall be condemned,''and therefore it was labour in vain, striving against the stream, to go about to vindicate himself; nor was it possible that he could make himself out so clear and pure and perfect, that such an holy Being as God was could find no fault in him, in whose sight the heavens, and the inhabitants of them, were not clean; this is further evinced in the following words. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l)  \"impius sum\", V. L. Pagninus; so Schmidt. (m) \"Ego impius ero\", Montanus, Mercerus, Bolducius; \"ego reus ero\", Codurcus; \"equidem improbus ero\", Schultens. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l)  \"impius sum\", V. L. Pagninus; so Schmidt. (m) \"Ego impius ero\", Montanus, Mercerus, Bolducius; \"ego reus ero\", Codurcus; \"equidem improbus ero\", Schultens. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "If I be wicked, why then {x} labour I in vain?",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "If",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I be wicked, why then ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{x}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " labour I in vain?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Why does God not destroy me at once? thus he speaks according to the infirmity of the flesh.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if I be wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I shall be guilty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that is, I have to be, shall be held, guilty; God has resolved so to consider me. Everywhere in these verses guilt and afflictions mean the same thing, the one being the sign of the other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 29.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If I be wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I am",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I am accounted so - I am already condemned. The extreme afflictions raider which I suffer indicate that God has passed sentence upon me, and awarded me my punishment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Why then labour I in vain?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Why argue? Why seek to justify myself, since no result is likely to follow? Nothing that I can say will alter God's foregone conclusion. Job 9:29",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29  If I am wicked, why do I exert myself in vain?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "30  If I should wash myself with snow water,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And make my hands clean with lye,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "31  Then thou wouldst plunge me into the pit,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And my clothes would abhor me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "32  For He is not a man as I, that I should answer Him,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That we should go together to judgment.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "33  There is not an arbitrator between us",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who should lay his hand upon us both.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The clause with strongly accented \"I\" affirms that in relation to God is from the first, and unchangeably, a wicked, i.e., guilty, man (Psalm 109:7) (רשׁע, to be a wicked man, means either to act as such Job 10:15, or to appear as such, be accounted as such, as here and Job 10:7; Hiph., Job 9:20, to condemn). Why, therefore, should he vainly (הבל, acc. adv., like breath, useless) exert himself by crying for help, and basing his plaint on his innocence? In Job 9:30 the Chethib is במו, the Keri במי, as the reverse in Isaiah 25:10; mo itself appears in the signification water (Egyptian muau), in the proper names Moab and Moshe (according to Jablonsky, ex aqua servatus); in במו, however, the mo may be understood according to Ges. 103, 2. This is the meaning - no cleansing, even though he should use snow and בּר (a vegetable alkali), i.e., not even the best-grounded self-justification can avail him, for God would still bring it to pass, that his clearly proved innocence should change to the most horrible impurity. Ewald, Rdiger, and others translate incorrectly: my clothes would make me disgusting. The idea is tame. The Piel תּעב signifies elsewhere in the book (Job 19:19; Job 30:10) to abhor, not to make abhorrent; and the causative meaning is indeed questionable, for מתעב (Isaiah 49:7) signifies loathing, as מכסּה (Job 23:17) covering, and Ezekiel 16:25 certainly borders on the signification \"to make detestable,\" but תעב may also be in the primary meaning, abominari, the strongest expression for that contempt of the beauty bestowed by God which manifests itself by prostitution. Translate: My clothes would abhor me; which does not mean: I should be disgusted with myself (Hirzel); Job is rather represented as naked; him, the naked one, God would - says he - so plunge into the pit that his clothes would conceive a horror of him, i.e., start back in terror at the idea of being put on and defiled by such a horrible creature (Schlottm., Oehler). For God is not his equal, standing on the same level with him: He, the Absolute Being, is accuser and judge in one person; there is between them no arbitrator who (or that he) should lay, etc. Mercier correctly explains: impositio manus est potestatis signum; the meaning therefore is: qui utrumque nostrum velut manu imposita coerceat. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The clause with strongly accented \"I\" affirms that in relation to God is from the first, and unchangeably, a wicked, i.e., guilty, man (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 109:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") (רשׁע, to be a wicked man, means either to act as such ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or to appear as such, be accounted as such, as here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Hiph., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to condemn). Why, therefore, should he vainly (הבל, acc. adv., like breath, useless) exert himself by crying for help, and basing his plaint on his innocence? In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the Chethib is במו, the Keri במי, as the reverse in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 25:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; mo itself appears in the signification water (Egyptian muau), in the proper names Moab and Moshe (according to Jablonsky, ex aqua servatus); in במו, however, the mo may be understood according to Ges. 103, 2. This is the meaning - no cleansing, even though he should use snow and בּר (a vegetable alkali), i.e., not even the best-grounded self-justification can avail him, for God would still bring it to pass, that his clearly proved innocence should change to the most horrible impurity. Ewald, Rdiger, and others translate incorrectly: my clothes would make me disgusting. The idea is tame. The Piel תּעב signifies elsewhere in the book (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") to abhor, not to make abhorrent; and the causative meaning is indeed questionable, for מתעב (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") signifies loathing, as מכסּה (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") covering, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " certainly borders on the signification \"to make detestable,\" but תעב may also be in the primary meaning, abominari, the strongest expression for that contempt of the beauty bestowed by God which manifests itself by prostitution. Translate: My clothes would abhor me; which does not mean: I should be disgusted with myself (Hirzel); Job is rather represented as naked; him, the naked one, God would - says he - so plunge into the pit that his clothes would conceive a horror of him, i.e., start back in terror at the idea of being put on and defiled by such a horrible creature (Schlottm., Oehler). For God is not his equal, standing on the same level with him: He, the Absolute Being, is accuser and judge in one person; there is between them no arbitrator who (or that he) should lay, etc. Mercier correctly explains: impositio manus est potestatis signum; the meaning therefore is: qui utrumque nostrum velut manu imposita coerceat. ",
            "children": []
          }
        ]
      }
    ]
  }
]