[{"header":"The Jobs of the Kohath Family"},{"num":4,"verse":"The Lord said to Moses and Aaron, "},{"num":2,"verse":"“Count the Kohathites among the Levites. Count them by family groups and families. "},{"num":3,"verse":"Count the men from 30 to 50 years old. They will serve in the Meeting Tent."},{"num":4,"verse":"“They are responsible for the most holy things in the Meeting Tent. "},{"num":5,"verse":"When the Israelites move, Aaron and his sons must go into the Holy Tent. They are to take down the curtain. Then they must cover the Ark of the Covenant with it. "},{"num":6,"verse":"Over this they must put a covering made from fine leather. Then they must spread the solid blue cloth over it. And they must put the poles in the rings on the Ark of the Covenant."},{"num":7,"verse":"“Then they must spread a blue cloth over the table. This is the table for the bread that shows we are in God’s presence. They must put the plates, spoons, bowls and the jars for drink offerings on the table. They must leave the bread on the table. "},{"num":8,"verse":"Then they must put a red cloth over all of these things. They must cover everything with fine leather. Then they must put the poles in place."},{"num":9,"verse":"“With a blue cloth they must cover the lampstand, its lamps, its wick trimmers and trays. They must cover all the jars for the oil used in the lamps. "},{"num":10,"verse":"Then they must wrap everything in fine leather. They must put all these things on a frame for carrying them."},{"num":11,"verse":"“They must spread a blue cloth over the gold altar. Then they must cover it with fine leather. They must put its poles in place."},{"num":12,"verse":"“They must gather everything used for serving in the Holy Place. They must wrap them in a blue cloth. Then they must cover that with fine leather. They must put these things on a frame for carrying them."},{"num":13,"verse":"“They must clean the ashes off the bronze altar. Then they must spread a purple cloth over it. "},{"num":14,"verse":"They must gather all the things used for serving at the altar. These are the pans for carrying the fire, meat forks, shovels and bowls. They must put them on the bronze altar. Then they must spread a covering of fine leather over it. They must put the carrying poles in the rings on the altar."},{"num":15,"verse":"“When the camp is ready to move, have Aaron and his sons cover all the holy things. Then the Kohathites may go in and carry away those things. This way they won’t touch the holy things and die. It is the Kohathites’ job to carry the things that are in the Meeting Tent."},{"num":16,"verse":"“Eleazar son of Aaron, the priest, will be responsible for the Holy Tent. And he is responsible for everything in it: the oil for the lamp, the sweet-smelling incense, the continual grain offering and the oil used to appoint priests and things to the Lord’s service.”"},{"num":17,"verse":"The Lord said to Moses and Aaron, "},{"num":18,"verse":"“Don’t let the Kohathites be destroyed from the Levites. "},{"num":19,"verse":"Do this for the Kohathites. Then they may go near the Most Holy Place and not die. Aaron and his sons must go in and show each Kohathite what to do. And they must show each man what to carry. "},{"num":20,"verse":"The Kohathites must not enter and look at the holy things, even for a second. If they do, they will die.”"},{"header":"The Jobs of the Gershon Family"},{"num":21,"verse":"The Lord said to Moses, "},{"num":22,"verse":"“Count the Gershonites by families and family groups. "},{"num":23,"verse":"Count the men from 30 to 50 years old. Everyone has a job to do in the Meeting Tent."},{"num":24,"verse":"“This is what the Gershonite family groups must do and what they must carry. "},{"num":25,"verse":"They must carry the pieces of cloth of the Holy Tent and Meeting Tent. They must also carry its covering and the covering made from fine leather. And they must carry the curtains for the entrance to the Meeting Tent. "},{"num":26,"verse":"They must carry the curtains of the courtyard that goes around the Holy Tent and the altar. They must carry the curtain for the entry to the courtyard and the ropes and all the things used with the curtains. They must do everything connected with these things. "},{"num":27,"verse":"Aaron and his sons are in charge of what the Gershonites do or carry. You tell them what they are responsible for carrying. "},{"num":28,"verse":"This is the work of the Gershonite family group at the Meeting Tent. Ithamar son of Aaron, the priest, will direct their work."},{"header":"The Jobs of the Merari Family"},{"num":29,"verse":"“Count the Merarite families and family groups. "},{"num":30,"verse":"Count the men from 30 to 50 years old. They will work at the Meeting Tent. "},{"num":31,"verse":"It is their job to carry the frame of the Meeting Tent, the crossbars, the posts and bases. "},{"num":32,"verse":"They must also carry the posts that go around the courtyard. They must carry the bases, tent pegs and ropes. And they must carry everything that is used with the poles around the courtyard. Tell each man exactly what to carry. "},{"num":33,"verse":"This is the work the Merarites will do for the Meeting Tent. Ithamar son of Aaron, the priest, will direct their work.”"},{"header":"The Levite Families"},{"num":34,"verse":"Moses, Aaron and the leaders of Israel counted the Kohathites by families and family groups. "},{"num":35,"verse":"The men from 30 to 50 years old were to work at the Meeting Tent. "},{"num":36,"verse":"The family group had 2,750 men. "},{"num":37,"verse":"This was the total of the Kohath family group who worked at the Meeting Tent. Moses and Aaron counted them as the Lord had commanded Moses."},{"num":38,"verse":"Also, the Gershon family group was counted by families and family groups. "},{"num":39,"verse":"The men from 30 to 50 years old were given work at the Meeting Tent. "},{"num":40,"verse":"The families and family groups had 2,630 men. "},{"num":41,"verse":"This was the total of the Gershon family group who worked at the Meeting Tent. Moses and Aaron counted them as the Lord had commanded."},{"num":42,"verse":"Also, the men in the families and family groups of the Merari family were counted. "},{"num":43,"verse":"The men from 30 to 50 years old were to work at the Meeting Tent. "},{"num":44,"verse":"The family group had 3,200 men. "},{"num":45,"verse":"This was the total of the Merari family group. Moses and Aaron counted them as the Lord had commanded Moses."},{"num":46,"verse":"So Moses, Aaron and the leaders of Israel counted all the Levites. They counted them by families and family groups. "},{"num":47,"verse":"The men from 30 to 50 were given work at the Meeting Tent. They also carried the Tent. "},{"num":48,"verse":"The total number of these men was 8,580. "},{"num":49,"verse":"Each man was counted as the Lord had commanded Moses. Each man was given his work and told what to carry. This was as the Lord had commanded Moses."}]