[{"num":4,"verse":"¶ And the LORD spoke unto Moses and unto Aaron, saying,"},{"num":2,"verse":"Take the sum of the sons of Kohath from among the sons of Levi, after their families, by the houses of their fathers,"},{"num":3,"verse":"from thirty years old and upward until fifty years old, all that enter into the host, to do work in the tabernacle of the testimony."},{"num":4,"verse":"This shall be the service of the sons of Kohath in the tabernacle of the testimony, in the holy of holies:"},{"num":5,"verse":"When the camp is to be moved, Aaron shall come, and his sons, and they shall take down the covering veil and cover the ark of testimony with it"},{"num":6,"verse":"and shall put thereon the covering of badgers’ skins and shall spread over it a cloth entirely of blue and shall put in the staves thereof."},{"num":7,"verse":"And upon the table of showbread they shall spread a cloth of blue and put thereon the dishes and the spoons and the bowls and covers to cover withal; and the continual bread shall be thereon."},{"num":8,"verse":"And they shall spread upon them a cloth of scarlet and cover the same with a covering of badgers’ skins and shall put in the staves thereof."},{"num":9,"verse":"And they shall take a cloth of blue and cover the lampstand of the light and its lamps and its tongs and its snuffdishes and all the oil vessels thereof with which they minister unto it;"},{"num":10,"verse":"and they shall put it and all the vessels thereof within a covering of badgers’ skins and shall put it upon a bar."},{"num":11,"verse":"And upon the golden altar they shall spread a cloth of blue and cover it with a covering of badgers’ skins and shall put in the staves thereof;"},{"num":12,"verse":"and they shall take all the vessels of ministry with which they minister in the sanctuary and put them in a cloth of blue and cover them with a covering of badgers’ skins and shall put them on a bar."},{"num":13,"verse":"And they shall take away the ashes with the burnt fat from the altar and spread a purple cloth thereon"},{"num":14,"verse":"and they shall put upon it all the vessels thereof with which they minister about it: the censers, the fleshhooks, the shovels, and the basins, all the vessels of the altar; and they shall spread upon it a covering of badgers’ skins and put in the staves of it."},{"num":15,"verse":"And when Aaron and his sons have made an end of covering the sanctuary and all the vessels of the sanctuary when the camp is to set forward, after that, the sons of Kohath shall come to bear it, but they shall not touch any holy thing, lest they die. These things are the burden of the sons of Kohath in the tabernacle of the testimony."},{"num":16,"verse":"But unto the care of Eleazar, the son of Aaron the priest, shall be the oil of the light and the aromatic incense and the daily present and the anointing oil and the care of all the tabernacle and of all that is therein, in the sanctuary, and in the vessels thereof."},{"num":17,"verse":"And the LORD spoke unto Moses and unto Aaron, saying,"},{"num":18,"verse":"Ye shall not cut off the tribe of the families of Kohath from among the Levites,"},{"num":19,"verse":"but thus do unto them that they may live, and not die, when they approach unto the holy of holies: Aaron and his sons shall come and place each one of them in his ministry and to his burden."},{"num":20,"verse":"They shall not go in to see when the holy things are covered, lest they die."},{"num":21,"verse":"¶ And the LORD spoke unto Moses, saying,"},{"num":22,"verse":"Take also the sum of the sons of Gershon, throughout the houses of their fathers, by their families;"},{"num":23,"verse":"from thirty years old and upward until fifty years old shalt thou number them, all that enter in to the host to do work in the tabernacle of the testimony."},{"num":24,"verse":"This shall be the service of the families of Gershon, to minister and to bear burdens:"},{"num":25,"verse":"They shall bear the curtains of the tabernacle and the tabernacle of the testimony, its covering, and the covering of badgers’ skins that is over it above and the hanging for the door of the tabernacle of the testimony"},{"num":26,"verse":"and the hangings of the court and the hanging for the door of the gate of the court, which is by the tabernacle and by the altar round about, and their cords and all the instruments of their service and all that is made for them; so shall they serve."},{"num":27,"verse":"According to the word of Aaron and his sons shall be all the ministry of the sons of the Gershonites, in all their burdens and in all their service; and ye shall appoint unto them in charge all their burdens."},{"num":28,"verse":"This is the service of the families of the sons of Gershon in the tabernacle of the testimony, and their charge shall be under the hand of Ithamar, the son of Aaron the priest."},{"num":29,"verse":"As for the sons of Merari, thou shalt number them after their families, by the houses of their fathers."},{"num":30,"verse":"From thirty years old and upward even unto fifty years old shalt thou number them, all that enters into the host, to do work in the tabernacle of the testimony."},{"num":31,"verse":"And this shall be the charge of their burden, according to all their service in the tabernacle of the testimony: the boards of the tabernacle and the bars thereof and the pillars thereof and sockets thereof,"},{"num":32,"verse":"and the pillars of the court round about and their sockets and their stakes and their cords with all their instruments and with all their service; and ye shall number by name the vessels of the charge of their burden."},{"num":33,"verse":"This shall be the service of the families of the sons of Merari for all their ministry, in the tabernacle of the testimony, under the hand of Ithamar, the son of Aaron the priest."},{"num":34,"verse":"¶ So Moses and Aaron and the princes of the congregation numbered the sons of Kohath after their families and after the houses of their fathers,"},{"num":35,"verse":"from thirty years old and upward even unto fifty years old, all that enter into the host, to minister in the tabernacle of the testimony."},{"num":36,"verse":"And those that were numbered of them by their families were two thousand seven hundred and fifty."},{"num":37,"verse":"These were the numbered of the families of Kohath, all that minister in the tabernacle of the testimony, whom Moses and Aaron numbered according to the commandment of the LORD by the hand of Moses."},{"num":38,"verse":"And those that were numbered of the sons of Gershon, throughout their families and by the houses of their fathers,"},{"num":39,"verse":"from thirty years old and upward even unto fifty years old, all that enter into the host, to minister in the tabernacle of the testimony,"},{"num":40,"verse":"those that were numbered of them, throughout their families, by the houses of their fathers, were two thousand six hundred and thirty."},{"num":41,"verse":"These were numbered of the families of the sons of Gershon, all that minister in the tabernacle of the testimony, whom Moses and Aaron numbered according to the commandment of the LORD."},{"num":42,"verse":"And those that were numbered of the families of the sons of Merari, throughout their families, by the houses of their fathers,"},{"num":43,"verse":"from thirty years old and upward even unto fifty years old, all that enter into the host, to minister in the tabernacle of the testimony,"},{"num":44,"verse":"those that were numbered of them after their families, were three thousand two hundred."},{"num":45,"verse":"These were those that were numbered of the families of the sons of Merari, whom Moses and Aaron numbered according to the word of the LORD by the hand of Moses."},{"num":46,"verse":"All those that were numbered of the Levites, whom Moses and Aaron and the princes of Israel numbered, after their families and after the houses of their fathers,"},{"num":47,"verse":"from thirty years old and upward even unto fifty years old, every one that entered in to serve in the service and to bear a burden in the tabernacle of the testimony,"},{"num":48,"verse":"those that were numbered of them, were eight thousand five hundred and eighty."},{"num":49,"verse":"As the LORD commanded by the hand of Moses, they were numbered, each one according to his ministry and according to his burden; thus were they numbered of Moses, as the LORD commanded him."}]