[[],[{"type":"header","content":"Duties of the Kohathites"},{"type":"prose","content":"Then the  spoke to Moses and to Aaron, saying,"}],[{"type":"prose","content":"“Take a census of the descendants of Kohath from among the sons of Levi, by their families, by their fathers’ households,"}],[{"type":"prose","content":"from thirty years old and upward, even to fifty years old, everyone who can enter the service  to do work in the tent of meeting."}],[{"type":"prose","content":"This is the work of the descendants of Kohath in the tent of meeting,  the most holy things."}],[{"type":"prose","content":"“When the camp sets out, Aaron and his sons shall go in and take down the veil of the curtain, and cover the ark of the testimony with it;"}],[{"type":"prose","content":"and they shall place a covering of fine leather on it, and spread over it a cloth of pure violet, and insert its carrying poles."}],[{"type":"prose","content":"Over the table of  the Presence they shall also spread a cloth of violet and put on it the dishes, the pans, the sacrificial bowls, and the jugs for the drink offering; and the continual bread shall be on it."}],[{"type":"prose","content":"And they shall spread over them a cloth of scarlet , and cover the same with a covering of fine leather, and they shall insert its carrying poles."}],[{"type":"prose","content":"Then they shall take a violet cloth and cover the lampstand for the light, along with its lamps, its tongs, its trays, and all its oil containers, by which they attend to it;"}],[{"type":"prose","content":"and they shall put it and all its utensils in a covering of fine leather, and put it on the carrying bars."}],[{"type":"prose","content":"Over the golden altar they shall spread a violet cloth, and cover it with a covering of fine leather, and they shall insert its carrying poles;"}],[{"type":"prose","content":"and they shall take all the utensils of service, with which they serve in the sanctuary, and put  in a violet cloth and cover them with a covering of fine leather, and put them on the carrying bars."}],[{"type":"prose","content":"Then they shall clean away the ashes from the altar, and spread a purple cloth over it."}],[{"type":"prose","content":"They shall also put on it all its utensils by which they serve in connection with it: the firepans, the forks, shovels, and the basins, all the utensils of the altar; and they shall spread a cover of fine leather over it and insert its carrying poles."}],[{"type":"prose","content":"When Aaron and his sons have finished covering the holy  and all the furnishings of the sanctuary, when the camp is to set out, after that the sons of Kohath shall come to carry , so that they will not touch the holy  and die. These are the things in the tent of meeting that the sons of Kohath are to carry."}],[{"type":"prose","content":"“Now the responsibility of Eleazar the son of Aaron the priest is the oil for the light, the fragrant incense, the continual grain offering, and the anointing oil—the responsibility of all the tabernacle and everything that is in it, with the sanctuary and its furnishings.”"}],[{"type":"prose","content":"Then the  spoke to Moses and to Aaron, saying,"}],[{"type":"prose","content":"“Do not let the tribe of the families of the Kohathites be eliminated from among the Levites."}],[{"type":"prose","content":"Rather, do this for them so that they will live and not die when they approach the most holy : Aaron and his sons shall go in and assign each of them to his work and to his load;"}],[{"type":"prose","content":"but they shall not come in to see the holy  even for a moment, or they will die.”"},{"type":"header","content":"Duties of the Gershonites"}],[{"type":"prose","content":"Then the  spoke to Moses, saying,"}],[{"type":"prose","content":"“Take a census of the sons of Gershon also, by their fathers’ households, by their families;"}],[{"type":"prose","content":"from thirty years old and upward to fifty years old you shall count them: all who can enter to perform service, to do the work in the tent of meeting."}],[{"type":"prose","content":"This is the service of the families of the Gershonites, in serving and in carrying:"}],[{"type":"prose","content":"they shall carry the curtains of the tabernacle and the tent of meeting  its covering and the covering of fine leather that is on top of it, and the curtain for the entrance of the tent of meeting,"}],[{"type":"prose","content":"and the curtains of the courtyard, the curtain for the entrance of the gate of the courtyard that is around the tabernacle and the altar, and their ropes and all the equipment for their service; and everything that is to be done by them, they shall perform."}],[{"type":"prose","content":"All the service of the sons of the Gershonites, that is, all their loads and all their work, shall be  at the command of Aaron and his sons; and you shall assign to them as a duty all their loads."}],[{"type":"prose","content":"This is the service of the families of the sons of the Gershonites in the tent of meeting; and their duties  under the direction of Ithamar the son of Aaron the priest."},{"type":"header","content":"Duties of the Merarites"}],[{"type":"prose","content":"“ the sons of Merari, you shall count them by their families, by their fathers’ households;"}],[{"type":"prose","content":"from thirty years old and upward, even to fifty years old, you shall count them, everyone who can enter the service to do the work of the tent of meeting."}],[{"type":"prose","content":"Now this is the duty of their loads, for all their service in the tent of meeting: the boards of the tabernacle, its bars, its pillars, and its bases,"}],[{"type":"prose","content":"and the pillars around the courtyard and their bases, their pegs, and their ropes, with all their equipment and with all their service; and you shall assign by names  the items that each is to carry."}],[{"type":"prose","content":"This is the service of the families of the sons of Merari, according to all their service in the tent of meeting, under the direction of Ithamar the son of Aaron the priest.”"}],[{"type":"prose","content":"So Moses, Aaron, and the leaders of the congregation counted the sons of the Kohathites by their families and by their fathers’ households,"}],[{"type":"prose","content":"from thirty years old and upward even to fifty years old, everyone who could enter the service for work in the tent of meeting."}],[{"type":"prose","content":"Their numbered men by their families were 2,750."}],[{"type":"prose","content":"These were the numbered men of the Kohathite families, everyone who was serving in the tent of meeting, whom Moses and Aaron counted according to the commandment of the  through Moses."}],[{"type":"prose","content":"And the numbered men of the sons of Gershon by their families and by their fathers’ households,"}],[{"type":"prose","content":"from thirty years old and upward even to fifty years old, everyone who could enter the service for work in the tent of meeting—"}],[{"type":"prose","content":"their numbered men by their families, by their fathers’ households, were 2,630."}],[{"type":"prose","content":"These were the numbered men of the families of the sons of Gershon, everyone who was serving in the tent of meeting, whom Moses and Aaron counted according to the commandment of the ."}],[{"type":"prose","content":"And the numbered men of the families of the sons of Merari by their families, by their fathers’ households,"}],[{"type":"prose","content":"from thirty years old and upward even to fifty years old, everyone who could enter the service for work in the tent of meeting—"}],[{"type":"prose","content":"their numbered men by their families were 3,200."}],[{"type":"prose","content":"These were the numbered men of the families of the sons of Merari, whom Moses and Aaron counted according to the commandment of the  through Moses."}],[{"type":"prose","content":"All the numbered men of the Levites, whom Moses, Aaron, and the leaders of Israel counted, by their families and by their fathers’ households,"}],[{"type":"prose","content":"from thirty years old and upward even to fifty years old, everyone who could enter to do the work of service and the work of carrying in the tent of meeting—"}],[{"type":"prose","content":"their numbered men were 8,580."}],[{"type":"prose","content":"According to the commandment of the  through Moses, they were counted, everyone by his serving or carrying; so  his numbered men, just as the  had commanded Moses."}]]