[[],[{"type":"header","content":"The Kohathites"},{"type":"prose","content":"The LORD spoke to Moses and Aaron, saying: "}],[{"type":"prose","content":"Take a census of the Kohathites separate from the other Levites, by their clans and their ancestral houses, "}],[{"type":"prose","content":"from thirty years old up to fifty years old, all who qualify to do work relating to the tent of meeting. "}],[{"type":"prose","content":"The service of the Kohathites relating to the tent of meeting concerns the most holy things."}],[{"type":"prose","content":"When the camp is to set out, Aaron and his sons shall go in and take down the screening curtain, and cover the ark of the covenant with it; "}],[{"type":"prose","content":"then they shall put on it a covering of fine leather, and spread over that a cloth all of blue, and shall put its poles in place. "}],[{"type":"prose","content":"Over the table of the bread of the Presence they shall spread a blue cloth, and put on it the plates, the dishes for incense, the bowls, and the flagons for the drink offering; the regular bread also shall be on it; "}],[{"type":"prose","content":"then they shall spread over them a crimson cloth, and cover it with a covering of fine leather, and shall put its poles in place. "}],[{"type":"prose","content":"They shall take a blue cloth, and cover the lampstand for the light, with its lamps, its snuffers, its trays, and all the vessels for oil with which it is supplied; "}],[{"type":"prose","content":"and they shall put it with all its utensils in a covering of fine leather, and put it on the carrying frame. "}],[{"type":"prose","content":"Over the golden altar they shall spread a blue cloth, and cover it with a covering of fine leather, and shall put its poles in place; "}],[{"type":"prose","content":"and they shall take all the utensils of the service that are used in the sanctuary, and put them in a blue cloth, and cover them with a covering of fine leather, and put them on the carrying frame. "}],[{"type":"prose","content":"They shall take away the ashes from the altar, and spread a purple cloth over it; "}],[{"type":"prose","content":"and they shall put on it all the utensils of the altar, which are used for the service there, the firepans, the forks, the shovels, and the basins, all the utensils of the altar; and they shall spread on it a covering of fine leather, and shall put its poles in place. "}],[{"type":"prose","content":"When Aaron and his sons have finished covering the sanctuary and all the furnishings of the sanctuary, as the camp sets out, after that the Kohathites shall come to carry these, but they must not touch the holy things, or they will die. These are the things of the tent of meeting that the Kohathites are to carry."}],[{"type":"prose","content":"Eleazar son of Aaron the priest shall have charge of the oil for the light, the fragrant incense, the regular grain offering, and the anointing oil, the oversight of all the tabernacle and all that is in it, in the sanctuary and in its utensils."}],[{"type":"prose","content":"Then the LORD spoke to Moses and Aaron, saying: "}],[{"type":"prose","content":"You must not let the tribe of the clans of the Kohathites be destroyed from among the Levites. "}],[{"type":"prose","content":"This is how you must deal with them in order that they may live and not die when they come near to the most holy things: Aaron and his sons shall go in and assign each to a particular task or burden. "}],[{"type":"prose","content":"But the Kohathites must not go in to look on the holy things even for a moment; otherwise they will die."}],[{"type":"header","content":"The Gershonites and Merarites"},{"type":"prose","content":"Then the LORD spoke to Moses, saying: "}],[{"type":"prose","content":"Take a census of the Gershonites also, by their ancestral houses and by their clans; "}],[{"type":"prose","content":"from thirty years old up to fifty years old you shall enroll them, all who qualify to do work in the tent of meeting. "}],[{"type":"prose","content":"This is the service of the clans of the Gershonites, in serving and bearing burdens: "}],[{"type":"prose","content":"They shall carry the curtains of the tabernacle, and the tent of meeting with its covering, and the outer covering of fine leather that is on top of it, and the screen for the entrance of the tent of meeting, "}],[{"type":"prose","content":"and the hangings of the court, and the screen for the entrance of the gate of the court that is around the tabernacle and the altar, and their cords, and all the equipment for their service; and they shall do all that needs to be done with regard to them. "}],[{"type":"prose","content":"All the service of the Gershonites shall be at the command of Aaron and his sons, in all that they are to carry, and in all that they have to do; and you shall assign to their charge all that they are to carry. "}],[{"type":"prose","content":"This is the service of the clans of the Gershonites relating to the tent of meeting, and their responsibilities are to be under the oversight of Ithamar son of Aaron the priest."}],[{"type":"prose","content":"As for the Merarites, you shall enroll them by their clans and their ancestral houses; "}],[{"type":"prose","content":"from thirty years old up to fifty years old you shall enroll them, everyone who qualifies to do the work of the tent of meeting. "}],[{"type":"prose","content":"This is what they are charged to carry, as the whole of their service in the tent of meeting: the frames of the tabernacle, with its bars, pillars, and bases, "}],[{"type":"prose","content":"and the pillars of the court all around with their bases, pegs, and cords, with all their equipment and all their related service; and you shall assign by name the objects that they are required to carry. "}],[{"type":"prose","content":"This is the service of the clans of the Merarites, the whole of their service relating to the tent of meeting, under the hand of Ithamar son of Aaron the priest."}],[{"type":"header","content":"Census of the Levites"},{"type":"prose","content":"So Moses and Aaron and the leaders of the congregation enrolled the Kohathites, by their clans and their ancestral houses, "}],[{"type":"prose","content":"from thirty years old up to fifty years old, everyone who qualified for work relating to the tent of meeting; "}],[{"type":"prose","content":"and their enrollment by clans was two thousand seven hundred fifty. "}],[{"type":"prose","content":"This was the enrollment of the clans of the Kohathites, all who served at the tent of meeting, whom Moses and Aaron enrolled according to the commandment of the LORD by Moses."}],[{"type":"prose","content":"The enrollment of the Gershonites, by their clans and their ancestral houses, "}],[{"type":"prose","content":"from thirty years old up to fifty years old, everyone who qualified for work relating to the tent of meeting— "}],[{"type":"prose","content":"their enrollment by their clans and their ancestral houses was two thousand six hundred thirty. "}],[{"type":"prose","content":"This was the enrollment of the clans of the Gershonites, all who served at the tent of meeting, whom Moses and Aaron enrolled according to the commandment of the LORD."}],[{"type":"prose","content":"The enrollment of the clans of the Merarites, by their clans and their ancestral houses, "}],[{"type":"prose","content":"from thirty years old up to fifty years old, everyone who qualified for work relating to the tent of meeting— "}],[{"type":"prose","content":"their enrollment by their clans was three thousand two hundred. "}],[{"type":"prose","content":"This is the enrollment of the clans of the Merarites, whom Moses and Aaron enrolled according to the commandment of the LORD by Moses."}],[{"type":"prose","content":"All those who were enrolled of the Levites, whom Moses and Aaron and the leaders of Israel enrolled, by their clans and their ancestral houses, "}],[{"type":"prose","content":"from thirty years old up to fifty years old, everyone who qualified to do the work of service and the work of bearing burdens relating to the tent of meeting, "}],[{"type":"prose","content":"their enrollment was eight thousand five hundred eighty. "}],[{"type":"prose","content":"According to the commandment of the LORD through Moses they were appointed to their several tasks of serving or carrying; thus they were enrolled by him, as the LORD commanded Moses."}]]