[{"header":"The Death of Samuel"},{"num":25,"verse":"Now Samuel died. All Israel gathered together and was filled with sorrow for him. They buried him at his house in Ramah."},{"num":2,"verse":"There was a man in Maon who worked in Carmel. The man was very rich. He had 3,000 sheep and 1,000 goats. He was cutting the wool from his sheep in Carmel. "},{"num":3,"verse":"The man’s name was Nabal, and his wife’s name was Abigail. The woman was of good understanding and beautiful. But the man was bad and sinful in his ways. He was a Calebite. "},{"num":4,"verse":"David heard in the desert that Nabal was cutting the wool from his sheep. "},{"num":5,"verse":"So David sent ten young men, saying to them, “Go up to Carmel. Visit Nabal and greet him for me. "},{"num":6,"verse":"Say to him, ‘Have a long life. Peace be to you. Peace be to your family. And peace be to all that you have. "},{"num":7,"verse":"I have heard that you have men who cut the wool from your sheep. Now your shepherds have been with us, and we have not done them any wrong. And they have not missed anything all the time they were in Carmel. "},{"num":8,"verse":"Ask your young men and they will tell you. So let my young men find favor in your eyes, for we have come on a special day. I ask you to give whatever you have ready to your servants and to your son David.’”"},{"num":9,"verse":"When David’s young men came, they said all this to Nabal in David’s name. Then they waited. "},{"num":10,"verse":"But Nabal answered David’s servants, “Who is David? Who is the son of Jesse? There are many servants these days who are leaving their owners. "},{"num":11,"verse":"Should I take my bread and my water and my meat that I have killed for my wool cutters, and give it to men when I do not know where they came from?” "},{"num":12,"verse":"So David’s young men turned away and returned to David and told him all this. "},{"num":13,"verse":"David said to his men, “Every man put on his sword!” So every man put on his sword, and David put on his sword also. About 400 men went up behind David, while 200 stayed with their things."},{"num":14,"verse":"But one of the young men told Nabal’s wife Abigail, “See, David sent men from the desert to greet our owner, and he spoke against them. "},{"num":15,"verse":"But David’s men were very good to us. They did not do anything wrong to us. And we did not miss anything when we were in the fields, as long as we went with them. "},{"num":16,"verse":"They were a wall to us night and day, all the time we were with them taking care of the sheep. "},{"num":17,"verse":"So know this and think about what you should do. For bad plans have been made against our owner and all his family. He is such a sinful man that no one can speak to him.”"},{"num":18,"verse":"In a hurry Abigail took 200 loaves of bread, two bottles of wine, five sheep ready to eat, five baskets of dry grain, 100 vines of dried grapes and 200 loaves of figs, and loaded them on donkeys. "},{"num":19,"verse":"She said to her young men, “Go on before me. See, I am coming after you.” But she did not tell her husband Nabal. "},{"num":20,"verse":"As she went on her donkey and came down hidden by the mountain, David and his men came down toward her, and she met them. "},{"num":21,"verse":"Now David had said, “It was for nothing that I have watched over all this man has in the desert, so that nothing was missed of all that belonged to him. He has paid me bad for good. "},{"num":22,"verse":"May God do the same to David and more, if I leave until morning as much as one male alive of all who belong to him.”"},{"num":23,"verse":"When Abigail saw David, she got off her donkey in a hurry. Then she put her face to the ground in front of David. "},{"num":24,"verse":"She fell at his feet and said, “Let the sin be on me alone, my lord. I beg you, let your woman servant speak to you. Listen to the words of your woman servant. "},{"num":25,"verse":"I beg you, do not let my lord think about this sinful man, Nabal. For he is like his name. Nabal is his name and he is foolish. But I your woman servant did not see my lord’s young men whom you sent. "},{"num":26,"verse":"So now, my lord, as the Lord lives, and as your soul lives, let the Lord keep you from being guilty of blood. Let Him keep you from punishing with your own hand. And let those who hate you and those who want to hurt my lord be like Nabal. "},{"num":27,"verse":"Now let this gift which your woman servant has brought to my lord be given to the young men who follow my lord. "},{"num":28,"verse":"I beg you, forgive the sin of your woman servant. For the Lord will be sure to make my lord a family that will last. Because my lord is fighting the Lord’s battles. Sin will not be found in you as long as you live. "},{"num":29,"verse":"If men rise up to come after you and try to kill you, then the life of my lord will be taken care of by the Lord your God. But He will throw away the lives of those who hate you, as a rock is thrown from a sling. "},{"num":30,"verse":"The Lord will do to my lord all the good that He has promised you. He will make you ruler over Israel. "},{"num":31,"verse":"Then my lord will have no reason to feel sorry or guilty because of killing without cause or punishing by my lord’s own hand. When the Lord does good things for my lord, remember your woman servant.”"},{"num":32,"verse":"Then David said to Abigail, “Thanks be to the Lord God of Israel, Who sent you this day to meet me. "},{"num":33,"verse":"May thanks be given for your wisdom, and thanks be to you. You have kept me this day from being guilty of blood, and from punishing with my own hand. "},{"num":34,"verse":"The Lord God of Israel has kept me from hurting you. And as the Lord lives, if you had not been quick to come to meet me, for sure not one male would have been left to Nabal until the morning.” "},{"num":35,"verse":"So David received what she had brought him. He said to her, “Go up to your house in peace. See, I have listened to you and have done what you asked.”"},{"num":36,"verse":"Abigail came to Nabal and saw that he was having a special supper in his house, like the special supper of a king. Nabal’s heart was full of joy, because he was very drunk. So she did not tell him anything until the morning. "},{"num":37,"verse":"But in the morning, when the wine had gone out of Nabal, his wife told him these things. And his heart died within him so that he became like a stone. "},{"num":38,"verse":"The Lord made Nabal die about ten days later."},{"num":39,"verse":"When David heard that Nabal was dead, he said, “Thanks be to the Lord, Who has punished Nabal for putting me to shame. He has kept His servant from sin. And the Lord has turned the sin of Nabal upon himself.” Then David sent word to Abigail, asking her to be his wife. "},{"num":40,"verse":"When David’s servants came to Abigail at Carmel, they said to her, “David has sent us to you, to take you as his wife.” "},{"num":41,"verse":"She stood up and then put her face to the ground, and said, “See, your woman servant will serve you by washing the feet of my lord’s servants.” "},{"num":42,"verse":"Then she got ready in a hurry and traveled on a donkey, with her five young women who followed her. She followed the men David had sent, and became his wife."},{"num":43,"verse":"David had taken Ahinoam of Jezreel also. They both became his wives."},{"num":44,"verse":"Saul had given his daughter Michal, David’s wife, to Palti the son of Laish, who was from Gallim."}]