[{"num":16,"verse":"They brought the ark of God in and put it in the tent that David had set up for it; and they offered burnt offerings and peace offerings before God. "},{"num":2,"verse":"When David had finished offering the burnt offering and peace offerings, he blessed the people in the name of Adonai. "},{"num":3,"verse":"Then he distributed to everyone in Isra’el, to everyone there, both men and women, a loaf of bread, a portion of meat and a raisin cake."},{"num":4,"verse":"He appointed certain L’vi’im to serve in front of the ark of Adonai, to celebrate, and to thank and praise Adonai the God of Isra’el: "},{"num":5,"verse":"Asaf, the leader; assisting him, Z’kharyah; then Ye‘i’el, Sh’miramot, Yechi’el, Mattityahu, Eli’av, B’nayahu, ‘Oved-Edom and Ye‘i’el playing lutes and lyres, while Asaf played cymbals. "},{"num":6,"verse":"B’nayah and Yachzi’el the cohanim blew the trumpets continually before the ark for the covenant of God. "},{"num":7,"verse":"It was on that same day that David first ordered that thanks be given to Adonai through Asaf and his kinsmen:"},{"num":37,"verse":"So, there before the ark for the covenant of Adonai, David left Asaf and his kinsmen to perform the service regularly before the ark, as each day’s work required; "},{"num":38,"verse":"also ‘Oved-Edom with their kinsmen, sixty-eight of them — ‘Oved-Edom the son of Y’dutun and Hosah were gatekeepers."},{"num":39,"verse":"He left Tzadok the cohen with his kinsmen before the tabernacle of Adonai at the high place in Giv‘on "},{"num":40,"verse":"to offer burnt offerings to Adonai every morning and evening on the altar for burnt offerings, according to everything written in the Torah of Adonai, which he gave to Isra’el. "},{"num":41,"verse":"With them were Heman and Y’dutun and the rest who were chosen and assigned by name to give thanks to Adonai, because his grace continues forever. "},{"num":42,"verse":"With them were Heman and Y’dutun to play trumpets and cymbals, also instruments for the songs about God; while the sons of Y’dutun were assigned to the gate."},{"num":43,"verse":"Then the people all left for their homes, and David returned to bless his household."}]