[{"num":16,"verse":"They took the Covenant Box to the tent which David had prepared for it and put it inside. Then they offered sacrifices and fellowship offerings to God. "},{"num":2,"verse":"After David had finished offering the sacrifices, he blessed the people in the name of the Lord "},{"num":3,"verse":"and distributed food to them all. He gave each man and woman in Israel a loaf of bread, a piece of roasted meat, and some raisins."},{"num":4,"verse":"David appointed some of the Levites to lead the worship of the Lord, the God of Israel, in front of the Covenant Box, by singing and praising him. "},{"num":5,"verse":"Asaph was appointed leader, with Zechariah as his assistant. Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed Edom, and Jeiel were to play harps. Asaph was to sound the cymbals, "},{"num":6,"verse":"and two priests, Benaiah and Jahaziel, were to blow trumpets regularly in front of the Covenant Box. "},{"num":7,"verse":"It was then that David first gave Asaph and the other Levites the responsibility for singing praises to the Lord."},{"header":"A Song of Praise(A)"},{"header":"Worship at Jerusalem and Gibeon"},{"num":37,"verse":"King David put Asaph and the other Levites in permanent charge of the worship that was held at the place where the Covenant Box was kept. They were to perform their duties there day by day. "},{"num":38,"verse":"Obed Edom son of Jeduthun and sixty-eight men of his clan were to assist them. Hosah and Obed Edom were in charge of guarding the gates."},{"num":39,"verse":"Zadok the priest and his fellow priests, however, were in charge of the worship of the Lord at the place of worship in Gibeon. "},{"num":40,"verse":"Every morning and evening they were to burn sacrifices whole on the altar in accordance with what was written in the Law which the Lord gave to Israel. "},{"num":41,"verse":"There with them were Heman and Jeduthun and the others who were specifically chosen to sing praises to the Lord for his eternal love. "},{"num":42,"verse":"Heman and Jeduthun also had charge of the trumpets and cymbals and the other instruments which were played when the songs of praise were sung. The members of Jeduthun's clan were in charge of guarding the gates."},{"num":43,"verse":"Then everyone went home, and David went home to spend some time with his family."}]