[{"num":1,"verse":"They brought the Chest of God and placed it right in the center of the tent that David had pitched for it; then they worshiped by presenting burnt offerings and peace offerings to God. When David had completed the offerings of worship, he blessed the people in the name of God. Then he passed around to every one there, men and women alike, a loaf of bread, a slice of barbecue, and a raisin cake."},{"num":4,"verse":"Then David assigned some of the Levites to the Chest of God to lead worship—to intercede, give thanks, and praise the God of Israel. Asaph was in charge; under him were Zechariah, Jeiel, Shemiramoth, Jehiel, Mattithiah, Eliab, Benaiah, Obed-Edom, and Jeiel, who played the musical instruments. Asaph was on percussion. The priests Benaiah and Jahaziel blew the trumpets before the Chest of the Covenant of God at set times through the day."},{"num":7,"verse":"That was the day that David inaugurated regular worship of praise to God, led by Asaph and his company."},{"num":37,"verse":"David left Asaph and his coworkers with the Chest of the Covenant of God and in charge of the work of worship; they were responsible for the needs of worship around the clock. He also assigned Obed-Edom and his sixty-eight relatives to help them. Obed-Edom son of Jeduthun and Hosah were in charge of the security guards. The priest Zadok and his family of priests were assigned to the Tent of God at the sacred mound at Gibeon to make sure that the services of morning and evening worship were conducted daily, complete with Whole-Burnt-Offerings offered on the Altar of Burnt Offering, as ordered in the Law of God, which was the norm for Israel. With them were Heman, Jeduthun, and others specifically named, with the job description: “Give thanks to God, for his love never quits!” Heman and Jeduthun were also well equipped with trumpets, cymbals, and other instruments for accompanying sacred songs. The sons of Jeduthun formed the security guard."},{"num":43,"verse":"Arrangements completed, the people all left for home. And David went home to bless his family."}]