[{"num":16,"verse":"So they brought the Aron HaElohim, and set it inside the Ohel that Dovid had pitched for it; and they offered olot (burnt sacrifices) and shelamim before HaElohim."},{"num":2,"verse":"And when Dovid had made an end of offering the olot and the shelamim, he blessed HaAm b’Shem Hashem."},{"num":3,"verse":"And he apportioned to kol Ish Yisroel, both ish and isha, to every one a kikar lechem, and a good piece of meat, and a raisin cake."},{"num":4,"verse":"And he appointed certain of the Levi’im as mesharetim (ministers) before the Aron Hashem, and to remember, and to thank and to praise Hashem Elohei Yisroel;"},{"num":5,"verse":"Asaph HaRosh, and mishneh to him Zecharyah, Ye’i’el, and Shemiramot, and Yechiel, and Mattityah, and Eliav, and Benayah, and Oved-Edom; and Ye’i’el with instruments of nevalim (lyres) and with kinnorot; but Asaph made a sound with cymbals;"},{"num":6,"verse":"Benayah also and Yachziel the Kohanim with chatzotzerot (trumpets) tamid (continually) before the Aron Brit HaElohim."},{"num":7,"verse":"Then on that day Dovid first committed the giving of thanks unto Hashem into the yad Asaph and his achim."},{"num":8,"verse":"Give thanks unto Hashem, call upon Shmo, make known His deeds among the nations."},{"num":9,"verse":"Sing unto Him, sing psalms unto Him, tell ye of all His nifle’ot (wondrous deeds)."},{"num":10,"verse":"Glory ye in Shem Kadesho; let the lev of them rejoice that seek Hashem."},{"num":11,"verse":"Seek Hashem and His oz, seek His face tamid."},{"num":12,"verse":"Remember His nifle’ot that He hath done, His mofetim, and the mishpatim of His mouth;"},{"num":13,"verse":"O ye zera Yisroel His eved, ye Bnei Ya’akov, His chosen ones."},{"num":14,"verse":"He is Hashem Eloheinu; His mishpatim are in kol ha’aretz."},{"num":15,"verse":"Be ye mindful l’olam of His Brit; the davar which He commanded to an elef dor;"},{"num":16,"verse":"Even of the Brit which He cut with Avraham, and of His shevu’a (oath) unto Yitzchak;"},{"num":17,"verse":"And hath confirmed the same to Ya’akov for a chok (decree), and to Yisroel for a Brit Olam,"},{"num":18,"verse":"Saying, Unto thee will I give Eretz Kena’an, the chevel (portion), the lot of your nachalah"},{"num":19,"verse":"When ye were but few, even a few, and gerim in it."},{"num":20,"verse":"And when they went from goy (nation) to goy, and from one mamlachah to an Am acher (another people),"},{"num":21,"verse":"He permitted no ish to oppress them; he reproved melachim for their sakes,"},{"num":22,"verse":"Saying, Touch not Mine anointed ones, and do My nevi’im no harm."},{"num":23,"verse":"Sing unto Hashem, kol ha’aretz; show forth from day to day His Yeshuah (salvation)."},{"num":24,"verse":"Declare His kavod among the Goyim; His nifle’ot among kol haAmim."},{"num":25,"verse":"For gadol is Hashem, and greatly to be praised; He also is to be feared above kol elohim."},{"num":26,"verse":"For kol elohei haAmim are elilim, but Hashem made Shomayim."},{"num":27,"verse":"Hod and Hadar are in His presence; oz and chedvah (joy) are in His makom (place, home, dwelling)."},{"num":28,"verse":"Ascribe unto Hashem, ye mishpechot Amim, ascribe unto Hashem Kavod and oz."},{"num":29,"verse":"Ascribe unto Hashem the kavod due unto Shmo; bring a minchah, and come before Him; worship Hashem in the hadar (splendor) of kodesh (holiness)."},{"num":30,"verse":"Fear before Him, kol ha’aretz; the tevel (world) also shall be firmly established, that it be not moved."},{"num":31,"verse":"Let HaShomayim have simcha, and let ha’aretz rejoice; and let them say among the Goyim, Hashem reigneth."},{"num":32,"verse":"Let the yam roar, and the fulness thereof; let the sadeh rejoice, and all that is therein."},{"num":33,"verse":"Then shall the trees of the ya’ar (forest, woods) sing out before Hashem, because He cometh to judge ha’aretz."},{"num":34,"verse":"O give thanks unto Hashem, for He is tov; for His chesed endureth l’olam."},{"num":35,"verse":"And say ye, Hosheini, Elohei Yisheinu (G-d of our salvation), and gather us together, and deliver us from the Goyim, that we may give thanks to Shem Kadshecha, and glory in Thy tehillah (praise)."},{"num":36,"verse":"Baruch Hashem Elohei Yisroel min HaOlam v’ad HaOlam. And kol HaAm said, Omein, and praised Hashem."},{"num":37,"verse":"So he left there before the Aron Brit Hashem Asaph and his achim, to minister before the Aron tamid (continually), accordingly yom by its yom;"},{"num":38,"verse":"And Oved-Edom with their achim, threescore and eight; Oved-Edom Ben Yeditun and Chosah as Shoarim (gatekeepers);"},{"num":39,"verse":"And Tzadok HaKohen, and his achim the Kohanim, before the Mishkan Hashem in the bamah (high place) that was at Giveon,"},{"num":40,"verse":"To offer olot (burnt offerings) unto Hashem upon the Mizbe’ach HaOlah tamid (continually) boker and erev, and to do according to all that is written in the Torat Hashem, which He commanded Yisroel;"},{"num":41,"verse":"And with them Heman and Yedutun, and the rest that were the Chosen ones, who were designated by shemot, to give thanksgiving to Hashem, ki l’olam chasdo."},{"num":42,"verse":"And with them Heman and Yedutun with Chatzotzerot (trumpets) and cymbals for those that should make a sound, and with klei Shir HaElohim (musical instruments of G-d). And the Bnei Yedutun were at the Sha’ar (gate)."},{"num":43,"verse":"And kol haAm departed every ish to his bais; and Dovid returned to bless his bais."}]