[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 39:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Knowest thou the time when the wild goats of the rock —",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Which dwell in high and steep rocks, where no man can come; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bring forth?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Which they do with great difficulty, as is implied, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 29:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and observed by naturalists, and in which they have no help save from God only. “Vain man, who wouldest so fain pry into my secrets! Didst thou ever climb the rocks to see the wild goats bring forth? Or hast thou assisted at the hard labour of the hinds, and helped to ease them of their burdens?” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Canst thou number the months that they fulfil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “Dost thou know the moment of their conception? Or keepest an account when they will be delivered?” — Patrick. The questions here, as Bochart argues, do not relate to a mere idle and speculative knowledge of the particular time when the wild goats bring forth, or the hinds calve, and the months they fulfil, (which by common observation might easily be found out,) but to the various circumstances thereof, and that divine and providential oversight and care by which God not only knows all things, but directs and governs them. For this reason, he supposes that the LXX interpreters render the clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εφυλαξας δε ωδινας ελαφων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hast thou observed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "guarded the bringing forth of the hinds? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Without the custody of God, (as he argues,) who preserves with the utmost care whatever he has once created, this kind of wild goats must quickly fail, amidst the numberless dangers to which they are exposed, both from hunters and from savage beasts; not to mention how often the dams themselves bring their young into the utmost peril. To this he subjoins St. Chrysostom’s observation, namely, how properly the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εφυλαξας ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is here applied, because the wild goat being always on the flight, in fear and agony, continually leaping and prancing about; why does it not produce mere abortions, instead of bringing any of its young to maturity? No other reason can be assigned than the wonderful providence of God, in the preservation of the dams and their young. We have also an account, in Bochart, from Aristotle, Pliny, &c., of the pregnant hinds’ receiving great assistance in parturition from the herb ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seselis, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to which they are directed by instinct, and the eating of which greatly forwards their delivery. To all which may be added what we read in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 29:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", concerning ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thunder, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the voice of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "יחולל אילות",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jecholel, aijaloth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(the very words in our text,) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "maketh the hinds to calve: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, (as the same learned writer observes,) among the many wonderful effects of thunder this is one, that those wild beasts, which with difficulty bring forth their young at other times, upon the hearing of it are immediately delivered; the terror they are thereby thrown into being so great as to have a strong effect on those parts which have need to be relaxed. See Chappelow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39:1-30 God inquires of Job concerning several animals. - In these questions the Lord continued to humble Job. In this chapter several animals are spoken of, whose nature or situation particularly show the power, wisdom, and manifold works of God. The wild ass. It is better to labour and be good for something, than to ramble and be good for nothing. From the untameableness of this and other creatures, we may see, how unfit we are to give law to Providence, who cannot give law even to a wild ass's colt. The unicorn, a strong, stately, proud creature. He is able to serve, but not willing; and God challenges Job to force him to it. It is a great mercy if, where God gives strength for service, he gives a heart; it is what we should pray for, and reason ourselves into, which the brutes cannot do. Those gifts are not always the most valuable that make the finest show. Who would not rather have the voice of the nightingale, than the tail of the peacock; the eye of the eagle and her soaring wing, and the natural affection of the stork, than the beautiful feathers of the ostrich, which can never rise above the earth, and is without natural affection? The description of the war-horse helps to explain the character of presumptuous sinners. Every one turneth to his course, as the horse rushes into the battle. When a man's heart is fully set in him to do evil, and he is carried on in a wicked way, by the violence of his appetites and passions, there is no making him fear the wrath of God, and the fatal consequences of sin. Secure sinners think themselves as safe in their sins as the eagle in her nest on high, in the clefts of the rocks; but I will bring thee down from thence, saith the Lord, #Jer 49:16\". All these beautiful references to the works of nature, should teach us a right view of the riches of the wisdom of Him who made and sustains all things. The want of right views concerning the wisdom of God, which is ever present in all things, led Job to think and speak unworthily of Providence.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Knowest thou, the time when the wild goats of the rock bring forth? - That is, the particular season when the mountain goats bring forth their young. Of domestic animals - the sheep, the tame goat, etc., the habits would be fuIly understood. But the question here relates to the animals that roamed at large on inaccessible cliffs; that were buried in deep forests; that were far from the dwellings and observation of people; and the meaning is, that there were many facts in regard to such points of Natural History which Job could not explain. God knew all their instincts and habits, and on the inaccessible cliffs, in the deep dell, in the dark forest, he was with them, and they were the objects of his care. He not only regarded the condition of the domestic animals that had been brought into the service of man, and where man perhaps might be disposed to claim that they owed much of their comfort to his care, but he regarded also the wild, wandering beast of the mountain, where no such pretence could be advanced.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The providence of God is over them; and in the periods of their lives when they seem most to need attention, when every shepherd and herdsmen is most solicitous about his flocks and herds, then God is present, and his care is seen in their preservation. The particular point in the inquiry here is, not in regard to the time when these animals produced their young or the period of their gestation, which might probably be known, but in regard to the attention and care which was needful for them when they were so far removed from the observance of man, and had no human aid. The \"wild goat of the rock\" here referred to, is, doubtless, the Ibex, or mountain goat, that has its dwellings among the rocks, or in stony places. The Hebrew term is יעל  yâ‛êl, from יעל  ya‛al, \"to ascend, to go up.\" They had their residence in the lofty rocks of mountains; Psalm 104:18. \"The high hills are a refuge for the wild goats.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The providence of God is over them; and in the periods of their lives when they seem most to need attention, when every shepherd and herdsmen is most solicitous about his flocks and herds, then God is present, and his care is seen in their preservation. The particular point in the inquiry here is, not in regard to the time when these animals produced their young or the period of their gestation, which might probably be known, but in regard to the attention and care which was needful for them when they were so far removed from the observance of man, and had no human aid. The \"wild goat of the rock\" here referred to, is, doubtless, the Ibex, or mountain goat, that has its dwellings among the rocks, or in stony places. The Hebrew term is יעל  yâ‛êl, from יעל  ya‛al, \"to ascend, to go up.\" They had their residence in the lofty rocks of mountains; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"The high hills are a refuge for the wild goats.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Hebrew \"For the goats of the rocks\" - סלעים יעלים  yâ‛êliym sela‛iym. So in 1 Samuel 24:2 (3), \"Saul went to seek David and his men upon the rocks of the wild goats;\" that is, where were the wild goats - היעלים  hayâ‛êliym. For a description of the wild goat, see Bochart, Hieroz. P. i. Lib. iii. c. xxiii. The animal here referred to is, doubtless, the same which Burckhardt saw on the summit of Mount Catharine, adjacent to Mount Sinai, and which he thus describes in his Travels in Syria, p. 571: \"As we approached the summit of the mountain (Catharine, adjacent to Mount Sinai), we saw at a distance a small flock of mountain goats feeding among the rocks. One of our Arabs left us, and by a widely circuitous route endeavored to get to the leeward of them, and near enough to fire at them. He enjoined us to remain in sight of them, and to sit down in order not to alarm them. He had nearly reached a favorable spot behind a rock, when the goats suddenly took to flight. They could not have seen the Arab, but the wind changed, and thus they smelt him. The chase of the beden, as the wild goat is called, resembles that of the chamois of the Alps, and requires as much enterprise and patience. The Arabs make long circuits to surprise them, and endeavor to come upon them early in the morning, when they feed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hebrew \"For the goats of the rocks\" - סלעים יעלים  yâ‛êliym sela‛iym. So in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 24:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (3), \"Saul went to seek David and his men upon the rocks of the wild goats;\" that is, where were the wild goats - היעלים  hayâ‛êliym. For a description of the wild goat, see Bochart, Hieroz. P. i. Lib. iii. c. xxiii. The animal here referred to is, doubtless, the same which Burckhardt saw on the summit of Mount Catharine, adjacent to Mount Sinai, and which he thus describes in his Travels in Syria, p. 571: \"As we approached the summit of the mountain (Catharine, adjacent to Mount Sinai), we saw at a distance a small flock of mountain goats feeding among the rocks. One of our Arabs left us, and by a widely circuitous route endeavored to get to the leeward of them, and near enough to fire at them. He enjoined us to remain in sight of them, and to sit down in order not to alarm them. He had nearly reached a favorable spot behind a rock, when the goats suddenly took to flight. They could not have seen the Arab, but the wind changed, and thus they smelt him. The chase of the beden, as the wild goat is called, resembles that of the chamois of the Alps, and requires as much enterprise and patience. The Arabs make long circuits to surprise them, and endeavor to come upon them early in the morning, when they feed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The goats have a leader who keeps watch, and on any suspicious smell, sound, or object, makes a noise, which is a signal to the flock to make their escape. They have much decreased of late, if we may believe the Arabs; who say that fifty years ago, if a stranger came to a tent, and the owner of it had no sheep to kill, he took his gun and went in search of a beden. They are, however, even now more common here than in the Alps, or in the mountains to the east of the Red Sea. I had three or four of them brought to me at the convent, which I bought at three-fourths of a dollar each. The flesh is excellent, and has nearly the same flavor as that of the deer. The Bedouins make water bags of their skins, and rings of their horns, which they wear on their thumbs. When the beden is met with in the plains, the dogs of the hunters easily catch him; but they cannot come up with him among the rocks, where he can make leaps of 20 feet.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or Canst thou mark when the hinds do calve? - The reference here is to the special care and protection of God manifested for them. The meaning is, that this animal seems to be always timid and apprehensive of danger, and that there is special care bestowed upon an animal so defenseless in enabling it to rear its young. The word hinds denotes the deer, the fawn, the most timid and defenseless, perhaps, of all animals. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Or Canst thou mark when the hinds do calve? - The reference here is to the special care and protection of God manifested for them. The meaning is, that this animal seems to be always timid and apprehensive of danger, and that there is special care bestowed upon an animal so defenseless in enabling it to rear its young. The word hinds denotes the deer, the fawn, the most timid and defenseless, perhaps, of all animals. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 39",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Job 39:1-30.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Even wild beasts, cut off from all care of man, are cared for by God at their seasons of greatest need. Their instinct comes direct from God and guides them to help themselves in parturition; the very time when the herdsman is most anxious for his herds.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "wild goats—ibex (Ps 104:18; 1Sa 24:2).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hinds—fawns; most timid and defenseless animals, yet cared for by God.Of the wild goats and hinds, Job 39:1-4; the wild ass, Job 39:5-8; the unicorn, Job 39:9-12; the peacock, stork, and ostrich, Job 39:13-18; the horse, Job 39:19-25; the hawk; the eagle, Job 39:26-30. These creatures, not fully known to Job, or governed by him, are sufficient to convince him that he is no fit judge of the counsels of God.  Knowest thou the time,  that thou mayst then go to them, and afford them thy help in their hard work? The wild goats of the rock;  which dwell in high and steep rocks, where no man can come. See 1 Samuel 24:2 Psalm 104:18. Bring forth;  which they do with great difficulty, as is implied, Psalm 29:9, and noted by philosophers, wherein they have no assistance from men, but only from God. When the hinds do calve;  when God by his secret instinct directs them to a certain herb called seseli, which, as naturalists report, doth hasten and help forward their birth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "hinds—fawns; most timid and defenseless animals, yet cared for by God.Of the wild goats and hinds, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 39:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the wild ass, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 39:5-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the unicorn, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 39:9-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the peacock, stork, and ostrich, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 39:13-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the horse, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 39:19-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the hawk; the eagle, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 39:26-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". These creatures, not fully known to Job, or governed by him, are sufficient to convince him that he is no fit judge of the counsels of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Knowest thou the time, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that thou mayst then go to them, and afford them thy help in their hard work? ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The wild goats of the rock; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which dwell in high and steep rocks, where no man can come. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Samuel 24:2 Psalm 104:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Bring forth; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which they do with great difficulty, as is implied, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 29:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and noted by philosophers, wherein they have no assistance from men, but only from God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "When the hinds do calve; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " when God by his secret instinct directs them to a certain herb called ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "seseli",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which, as naturalists report, doth hasten and help forward their birth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Knowest thou the time when the wild goats of the rock bring forth?.... Which creatures are so called, because they dwell among the rocks (d) and run upon them; and though their heads are loaded with a vast burden of horns upon them, yet can so poise themselves, as with the greatest swiftness, to leap from mountain to mountain, as Pliny says (e): and if they bring forth their young in the rocks, as Olympiodorus asserts, and which is not improbable, it is not to be wondered, that the time of their bringing forth should not be known by men, to whom the rocks they run upon are inaccessible; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or canst thou mark the time when the hinds do calve? that is, precisely and exactly, and so as to direct, order, and manage, and bring it about, as the Lord does: and it is wonderful that they should calve, and not cast their young before their time, when they are continually in flight and fright, through men or wild beasts, and are almost always running and leaping about; and often scared with thunder, which hastens birth, Psalm 29:9; otherwise the time of their bringing forth in general is known by men, as will be observed in Job 39:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or canst thou mark the time when the hinds do calve? that is, precisely and exactly, and so as to direct, order, and manage, and bring it about, as the Lord does: and it is wonderful that they should calve, and not cast their young before their time, when they are continually in flight and fright, through men or wild beasts, and are almost always running and leaping about; and often scared with thunder, which hastens birth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 29:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; otherwise the time of their bringing forth in general is known by men, as will be observed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) \"----Amantis saxa capellae\". Ovid. Epist. 15. v. 55. (e) Nat. Hist. l. 8. c. 53. Aelian. de Animal. l. 14. c. 16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) \"----Amantis saxa capellae\". Ovid. Epist. 15. v. 55. (e) Nat. Hist. l. 8. c. 53. Aelian. de Animal. l. 14. c. 16. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Knowest thou the time when the wild goats of the rock bring forth? or canst thou mark when the hinds do calve?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "canst thou mark",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "dost",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thou. The goats of the rock are the mountain goats, a species of chamois.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 39:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The goats of the rock and the hinds.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-30.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - This chapter completes the survey of animate nature begun at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 38:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The habits and instincts of the wild goat, the wild ass, and wild cattle are first noticed (vers. 1-12); then a transition is made to the most remarkable of birds, the ostrich (vers. 13-18). Next, the horse is described, and, as it were, depicted, in a passage of extraordinary fire and brilliancy (vers. 19-25). Finally, a return is made to remarkable birds, and the habits of the hawk and eagle obtain mention (vers. 26-30). Throughout, the object is to show the infinite wisdom of God, and the utter incompetence of man to explain the mysteries of nature. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Knowest thou the time when the wild goats of the rock bring forth?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The wild goats of Western Asia are of two kinds, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Capra segagrus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the Asiatic ibex, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Capra Sinaitica.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The latter is probably the animal here intended, which is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "yael sela",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the wild goat of the rocks,\" and was known to the Assyrians as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ya-e-li.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is an animal with large rough horns curving backwards, closely allied to the steinbock, or bouquetin, of the Swiss and Tyrolian Alps. It is very shy and wild, difficult of approach, and inhabiting only the most rocky and desolate tracts of Syria and Arabia. Representations of the animal, which was hunted by the Assyrian kings, are common upon the Ninevite monuments (see 'Ancient Monarchies,' vol. 2. p. 140. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Or canst thou mark when the hinds do calve?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"The hinds\" here are probably the females of the species of ibex intended. The clause is therefore a mere repetition, in other words, of the preceding one. Job 39:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  1  Dost thou know the bearing time of the wild goats of the rock?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Observest thou the circles of the hinds?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  2  Dost thou number the months which they fulfil,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And knowest thou the time of their bringing forth?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  3  They bow down, they let their young break through,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They cast off their pains.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  4  Their young ones gain strength, grow up in the desert,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They run away and do not return.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The strophe treats of the female chamois or steinbocks, ibices (perhaps including the certainly different kinds of chamois), and stags. The former are called יעלים, from יעל, Arab. w‛l (a secondary formation from עלה, Arab. ‛lâ), to mount, therefore: rock-climbers. חולל is inf. Pil.: τὸ ὠδίνειν, comp. the Pul. Job 15:7. שׁמר, to observe, exactly as Ecclesiastes 11:4; 1 Samuel 1:12; Zechariah 11:11. In Job 39:2 the question as to the expiration of the time of bearing is connected with that as to the time of bringing forth. תּספּור, plene, as Job 14:16; לדתּנה (littâna, like עת  equals  עדתּ) with an euphonic termination for לדתּן, as Genesis 42:36; Genesis 21:29, and also out of pause, Ruth 1:19, Ges. 91, 1, rem. 2. Instead of תּפלּחנה Olsh. wishes to read תּפלּטנה, but this (synon. תמלטנה) would be: they let slip away; the former (synon. תבקענה): they cause to divide, i.e., to break through (comp. Arab. felâh, the act of breaking through, freedom, prosperity). On כּרע, to kneel down as the posture of one in travail, vid., 1 Samuel 4:19. \"They cast off their pains\" is not meant of an easy working off of the after-pains (Hirz., Schlottm.), but חבל signifies in this phrase, as Schultens has first shown, meton. directly the foetus, as Arab. ḥabal, plur. ahbâl, and ὠδίν, even of a child already grown up, as being the fruit of earlier travail, e.g., in Aeschylus, Agam. 1417f.; even the like phrase, ῥίψαι ὠδῖνα  equals  edere foetum, is found in Euripides, Ion 45. Thus born with ease, the young animals grow rapidly to maturity (חלם, pinguescere, pubescere, whence חלום, a dream as the result of puberty, vid., Psychol. S. 282), grow in the desert (בּבּר, Targ.  equals  בּחוּץ, vid., i. 329, note), seek the plain, and return not again למו, sibi h. e. sui juris esse volentes (Schult.), although it might also signify ad eas, for the Hebr. is rather confused on the question of the distinction of gender, and even in חבליהם and בניהם the masc. is used ἐπικοίνως. We, however, prefer to interpret according to Job 6:19; Job 24:16. Moreover, Bochart is right: Non hic agitur de otiosa et mere speculativa cognitione, sed de ea cognitione, quae Deo propria est, qua res omnes non solum novit, sed et dirigit atque gubernat. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The strophe treats of the female chamois or steinbocks, ibices (perhaps including the certainly different kinds of chamois), and stags. The former are called יעלים, from יעל, Arab. w‛l (a secondary formation from עלה, Arab. ‛lâ), to mount, therefore: rock-climbers. חולל is inf. Pil.: τὸ ὠδίνειν, comp. the Pul. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". שׁמר, to observe, exactly as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the question as to the expiration of the time of bearing is connected with that as to the time of bringing forth. תּספּור, plene, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; לדתּנה (littâna, like עת  equals  עדתּ) with an euphonic termination for לדתּן, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 42:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 21:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and also out of pause, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 1:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Ges. 91, 1, rem. 2. Instead of תּפלּחנה Olsh. wishes to read תּפלּטנה, but this (synon. תמלטנה) would be: they let slip away; the former (synon. תבקענה): they cause to divide, i.e., to break through (comp. Arab. felâh, the act of breaking through, freedom, prosperity). On כּרע, to kneel down as the posture of one in travail, vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"They cast off their pains\" is not meant of an easy working off of the after-pains (Hirz., Schlottm.), but חבל signifies in this phrase, as Schultens has first shown, meton. directly the foetus, as Arab. ḥabal, plur. ahbâl, and ὠδίν, even of a child already grown up, as being the fruit of earlier travail, e.g., in Aeschylus, Agam. 1417f.; even the like phrase, ῥίψαι ὠδῖνα  equals  edere foetum, is found in Euripides, Ion 45. Thus born with ease, the young animals grow rapidly to maturity (חלם, pinguescere, pubescere, whence חלום, a dream as the result of puberty, vid., Psychol. S. 282), grow in the desert (בּבּר, Targ.  equals  בּחוּץ, vid., i. 329, note), seek the plain, and return not again למו, sibi h. e. sui juris esse volentes (Schult.), although it might also signify ad eas, for the Hebr. is rather confused on the question of the distinction of gender, and even in חבליהם and בניהם the masc. is used ἐπικοίνως. We, however, prefer to interpret according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 24:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Moreover, Bochart is right: Non hic agitur de otiosa et mere speculativa cognitione, sed de ea cognitione, quae Deo propria est, qua res omnes non solum novit, sed et dirigit atque gubernat. ",
            "children": []
          }
        ]
      }
    ]
  }
]