[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which leaveth her eggs.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The ostrich only sits upon her eggs at night, when the cold would chill and destroy them; by day the heat of the sand continues the process of hatching.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 39:14-15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:14-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Which leaveth her eggs in the earth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“The ostrich lays from thirty to fifty eggs. Ælian mentions more than eighty; but I never heard of so large a number. The first egg is deposited in the centre; the rest are placed as conveniently as possible round it. In this manner she is said to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lay, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "deposite, or trust, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "her eggs in the earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "warm them ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the sand; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and forget ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(as they are not placed, like those of some other birds, upon trees, or in the clefts of rocks, &c.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that the foot ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of the traveller ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may crush them, or that the wild beast may break them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Yet, notwithstanding the ample provision that is hereby made for a numerous offspring, scarce one quarter of these eggs are ever supposed to be hatched, and of those which are, no small share of the young ones may perish with hunger, from being left too early by their dams to shift for themselves.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39:1-30 God inquires of Job concerning several animals. - In these questions the Lord continued to humble Job. In this chapter several animals are spoken of, whose nature or situation particularly show the power, wisdom, and manifold works of God. The wild ass. It is better to labour and be good for something, than to ramble and be good for nothing. From the untameableness of this and other creatures, we may see, how unfit we are to give law to Providence, who cannot give law even to a wild ass's colt. The unicorn, a strong, stately, proud creature. He is able to serve, but not willing; and God challenges Job to force him to it. It is a great mercy if, where God gives strength for service, he gives a heart; it is what we should pray for, and reason ourselves into, which the brutes cannot do. Those gifts are not always the most valuable that make the finest show. Who would not rather have the voice of the nightingale, than the tail of the peacock; the eye of the eagle and her soaring wing, and the natural affection of the stork, than the beautiful feathers of the ostrich, which can never rise above the earth, and is without natural affection? The description of the war-horse helps to explain the character of presumptuous sinners. Every one turneth to his course, as the horse rushes into the battle. When a man's heart is fully set in him to do evil, and he is carried on in a wicked way, by the violence of his appetites and passions, there is no making him fear the wrath of God, and the fatal consequences of sin. Secure sinners think themselves as safe in their sins as the eagle in her nest on high, in the clefts of the rocks; but I will bring thee down from thence, saith the Lord, #Jer 49:16\". All these beautiful references to the works of nature, should teach us a right view of the riches of the wisdom of Him who made and sustains all things. The want of right views concerning the wisdom of God, which is ever present in all things, led Job to think and speak unworthily of Providence.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Which leaveth her eggs in the earth - That is, she does not build a nest, as most birds do, but deposits her eggs in the sand. The ostrich, Dr. Shaw remarks, lays usually from thirty to fifty eggs. The eggs are very large, some of them being above five inches in diameter, and weighing fifteen pounds - Goldsmith. \"We are not to consider,\" says Dr. Shaw, \"this large collection of eggs as if they were all intended for a brood. They are the greatest part of them reserved for food, which the dam breaks, and disposeth of according to the number and cravings of her young ones.\" The idea which seems to be conveyed in our common version is, that the ostrich deposits her eggs in the sand, and then leaves them, without further care, to be hatched by the heat of the sun. This idea is not, however, necessarily implied in the original, and is contrary to fact. The truth is, that the eggs are deposited with great care, and with so much attention to the manner in which they are placed, that a line drawn from those in the extremities would just touch the tops of the intermediate ones (see Damir, as quoted by Bochart, \"Hieroz.\" P. ii. Lib. ii. c. xvii. p. 253), and that they are hatched, as the eggs of other birds are, in a great measure by the heat imparted by the incubation of the parent bird.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is true that in the hot climates where these birds live, there is less necessity for constant incubation than in colder latitudes, and that the parent bird is more frequently absent; but she is accustomed regularly to return at night, and carefully broods over her eggs. See Le Valliant, \"Travels in the Interior of Africa,\" ii. 209, 305. It is true also that the parent bird wanders sometimes far from the place where the eggs are deposited, and forgets the place, and in this case if another nest of eggs is seen, she is not concerned whether they are her own or not, for she is not endowed with the power of distinguishing between her own eggs and those of another. This fact seems to have given rise to all the fables stated by the Arabic writers about the stupidity of the ostrich; about her leaving her eggs; and about her disposition to sit on the eggs of others. Bochart has collected many of these opinions from the Arabic writers, among which are the following: Alkazuinius says, \"They say that no bird is more foolish than the ostrich, for while it forsakes its own eggs, it sits on the eggs of others; from the proverb, \"Every animal loves its own young except the ostrich.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ottomanus says, \"Every animal loves its own progeny except the ostrich. But that pertains only to the male. For although the common proverb imputes folly to the female, yet with her folly she loves her young, and feeds them, and teaches them to fly, the same as other animals.\" Damir, an Arabic writer, says, \"When the ostrich goes forth from her nest, that she may seek food, if she finds the egg of another ostrich, she sits on that, and forgets her own. And when driven away by hunters, she never returns; whence, it is that she is described as foolish, and that the proverb in regard to her has originated.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And warmeth them in dust - The idea which was evidently in the mind of the translators in this passage was, that the ostrich left her eggs in the dust to be hatched by the heat of the sun. This is not correct, and is not necessarily implied in the Hebrew, though undoubtedly the heat of the sand is made to contribute to the process of hatching the egg, and allows the parent bird to be absent longer from her nest than birds in colder climates. This seems to be all that is implied in the passage. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And warmeth them in dust - The idea which was evidently in the mind of the translators in this passage was, that the ostrich left her eggs in the dust to be hatched by the heat of the sun. This is not correct, and is not necessarily implied in the Hebrew, though undoubtedly the heat of the sand is made to contribute to the process of hatching the egg, and allows the parent bird to be absent longer from her nest than birds in colder climates. This seems to be all that is implied in the passage. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14, 15. Yet (unlike the stork) she \"leaveth,\" &c. Hence called by the Arabs \"the impious bird.\" However, the fact is, she lays her eggs with great care and hatches them, as other birds do; but in hot countries the eggs do not need so constant incubation; she therefore often leaves them and sometimes forgets the place on her return. Moreover, the outer eggs, intended for food, she feeds to her young; these eggs, lying separate in the sand, exposed to the sun, gave rise to the idea of her altogether leaving them. God describes her as she seems to man; implying, though she may seem foolishly to neglect her young, yet really she is guided by a sure instinct from God, as much as animals of instincts widely different.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. which ostrich; whose property this is noted to be by naturalists. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for this unnatural quality is opposed to the goodliness of her wings or feathers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the earth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the place where she lays them; where she leaves them, either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. From care, lest she should crush and break them, if her vast body should sit upon them; or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. From forgetfulness, or carelessness, or unnaturalness, or folly; to which it is manifestly ascribed in the following verses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Warmeth them in the dust; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Covering them with sand, that they may be warmed and hatched by that, together with the heat of the sun. But this is judged a fabulous report; for the Arabians, amongst whom this bird is most frequent and best known, affirm that such eggs do quickly perish and putrefy. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Exposing them to the heat of the sun, which being excessive in those hot countries, doth and must needs quickly destroy or spoil them. And the ostrich is said to warm them, because her leaving them there is not only the occasion, but im some sort the cause, of the sun’s warming them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Which leaveth her eggs in the earth,.... Lays them and leaves them there. Aelianus, agreeably to this, says (w), that it builds a low nest in the ground, making a hollow in the sand with its feet; though he seems to be mistaken as to the number of its eggs, which he makes to be more than eighty; more truly Leo Africanus (x), who reckons them ten or twelve; which, he says, it lays in the sand, and each of them are of the size of a cannon ball, and weigh fifteen pounds, more or less. Hence, with the Arabs, it is called ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the mother of eggs,'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because of the large eggs it lays; and with them it is a proverb, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"meaner, or of a lesser account, than the eggs of an ostrich,'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because its eggs are neglected by it (y); ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and warmeth them in the dust; not that she leaves them to be warmed by the hot sand, or by the heat of the sun upon them, by which they are hatched, as has been commonly said, for thereby they would rather be corrupted and become rotten; but she herself warms them and hatches them, by sitting upon them in the dust and sand: and for this the above historian is express, who says (z), the female lighting on these eggs, whether her own or another's, sits on them and heats them. Concerning the ostrich hatching its eggs, Vansleb (a), from an Arabic manuscript, relates what is incredible, that they are hatched by the male and female with their eye only; that one or other of them keep continually looking at them until they are all hatched; and this I observe is asserted also by another writer (b). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) De Animal. l. 14. c. 17. (x) Ut supra. (Descriptio Africaae, l. 9. p. 766.) (y) Hottinger. Smegm. Orient. l. 1. c. 7. p. 128. (z) Descript. Africae, ut supra. (l. 9. p. 766.) Vid. Aelian. l. 4. c. 37. (a) Relation of a Voyage to Egypt, p. 64. (b) Coelius, l. 10. c. 5. apud Sanctium in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) De Animal. l. 14. c. 17. (x) Ut supra. (Descriptio Africaae, l. 9. p. 766.) (y) Hottinger. Smegm. Orient. l. 1. c. 7. p. 128. (z) Descript. Africae, ut supra. (l. 9. p. 766.) Vid. Aelian. l. 4. c. 37. (a) Relation of a Voyage to Egypt, p. 64. (b) Coelius, l. 10. c. 5. apud Sanctium in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Which leaveth her eggs in the earth, and {h} warmeth them in dust,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which leaveth her eggs in the earth, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " warmeth them in dust,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) They write that the ostrich covers her eggs in the sand, and because the country is hot and the sun still keeps them warm, they are hatched.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Which leaveth her eggs in the earth, and warmeth them in dust.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The best authorities tell us that in tropical countries ostriches, having scratched a hole in the sand, and deposited their eggs in it, cover the eggs over with a layer of sand, sometimes as much as a foot in thickness, and, leaving them during the daytime to be kept warm by the heat of the sun, only incubate at night. It is evidently this habit of the bird that is here alluded to. That in cooler countries ostriches do not do this is not to the point. The habit was known in Job's time, and was so noticeable as to characterize the bird to a large extent. Job 39:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13  The wing of the ostrich vibrates joyously,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Is she pious, wing and feather?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14  No, she leaveth her eggs in the earth",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And broodeth over the dust,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15  Forgetting that a foot may crush them,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the beast of the field trample them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  She treateth her young ones harshly as if they were not hers;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In vain is her labour, without her being distressed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17  For Eloah hath caused her to forget wisdom,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And gave her no share of understanding.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18  At the time when she lasheth herself aloft,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "She derideth the horse and horseman.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As the wild ass and the ox-like oryx cannot be tamed by man, and employed in his service like the domestic ass and ox, so the ostrich, although resembling the stork in its stilt-like structure, the colour of its feathers, and its gregarious life, still has characteristics totally different from those one ought to look for according to this similarity. רננים, a wail, prop. a tremulous shrill sound (vid., Job 39:23), is a name of the female ostrich, whose peculiar cry is called in Arabic zimâr (זמר). נעלס (from עלס, which in comparison with עלץ, עלז, rarely occurs) signifies to make gestures of joy. אם, Job 39:13, is an interrogative an; חסידה, pia, is a play upon the name of the stork, which is so called: pia instar ciconiae (on this figure of speech, comp. Mehren's Rehtorik der Araber, S. 178). כּי, Job 39:14, establishes the negation implied in the question, as e.g., Isaiah 28:28. The idea is not that the hen-ostrich abandons the hatching of her eggs to the earth (עזב ל as Psalm 16:10), and makes them \"glow over the dust\" (Schlottm.), for the maturing energy compensating for the sitting of the parent bird proceeds from the sun's heat, which ought to have been mentioned; one would also expect a Hiph. instead of the Piel תּחמּם, which can be understood only of hatching by her own warmth. The hen-ostrich also really broods herself, although from time to time she abandons the חמּם to the sun.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As the wild ass and the ox-like oryx cannot be tamed by man, and employed in his service like the domestic ass and ox, so the ostrich, although resembling the stork in its stilt-like structure, the colour of its feathers, and its gregarious life, still has characteristics totally different from those one ought to look for according to this similarity. רננים, a wail, prop. a tremulous shrill sound (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is a name of the female ostrich, whose peculiar cry is called in Arabic zimâr (זמר). נעלס (from עלס, which in comparison with עלץ, עלז, rarely occurs) signifies to make gestures of joy. אם, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is an interrogative an; חסידה, pia, is a play upon the name of the stork, which is so called: pia instar ciconiae (on this figure of speech, comp. Mehren's Rehtorik der Araber, S. 178). כּי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", establishes the negation implied in the question, as e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The idea is not that the hen-ostrich abandons the hatching of her eggs to the earth (עזב ל as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 16:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and makes them \"glow over the dust\" (Schlottm.), for the maturing energy compensating for the sitting of the parent bird proceeds from the sun's heat, which ought to have been mentioned; one would also expect a Hiph. instead of the Piel תּחמּם, which can be understood only of hatching by her own warmth. The hen-ostrich also really broods herself, although from time to time she abandons the חמּם to the sun.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: It does, however, as it appears, actually occur, that the female leaves the work of hatching to the sun by day, and to the male at night, and does not sit at all herself; vid., Funke's Naturgeschichte, revised by Taschenberg (1864), S. 243f.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]