[{"num":6,"verse":"Where is thy beloved gone, O thou fairest among nashim? Where is thy beloved turned aside, that we may seek him with thee?"},{"num":2,"verse":"Dodi (my beloved) is gone down into his gan (garden), to the beds of spices, to feed in the ganim (gardens), and to gather shoshanim (lilies)."},{"num":3,"verse":"I am my beloved’s, and my beloved is mine; he feedeth among the shoshanim."},{"num":4,"verse":"Thou art yafeh, O my love, as Tirtzah, lovely as Yerushalayim, awe-inspiring as bannered troops on the march."},{"num":5,"verse":"Turn away thine eyes from me, for they overwhelm me; thy hair is as an eder of goats that descend from Gil‘ad."},{"num":6,"verse":"Thy teeth are as an eder harechalim (flock of ewes) which go up from the washing, whereof every one is matched, and there is not one missing among them."},{"num":7,"verse":"As a half pomegranate is thy temple within thy veil."},{"num":8,"verse":"There are threescore melakhot (queens), and fourscore pilagshim (concubines), and alamot (young unmarried virgins) without number [T.N. Alamot is plural of almah, \"virgin,\" alamot, \"virgins;\" see Shir HaShirim 1:3; Yeshayah 7:14; Bereshis 24:43; Shemot 2:8; Mishlei 30:19 where the word means explicitly or implicitly \"virgin\" and where \"young woman\" is not an adequate rendering, in this case, since the King was hardly interested in only young women in his harem, but demanded \"virgins\"; the older Jewish translations like Harkavy’s so translated the word as \"virgin\" in this verse until it became politically incorrect to do so in later, more liberal Jewish translations into English]."},{"num":9,"verse":"My yonah (dove), tammati (my perfect one, my undefiled) is unique; she is the only one of her em (mother), she is the barah (choice one) of her that bore her. The banot saw her, they called her blessed; yea, the melakhot and the pilagshim [see 6:8] praise her."},{"num":10,"verse":"Who is she that looks forth like the shachar (dawn), yafeh as the levanah (moon), clear as the sun, and aweinspiring as bannered troops on the march?"},{"num":11,"verse":"I went down into the grove of nut trees to see the blossoms of the valley, and to see whether hagefen (the vine) flourished and the pomegranates bloomed."},{"num":12,"verse":"Before I was aware, my nefesh lifted me up to the merkevot of ammi (my people) of one, a royal one."},{"num":7,"verse":"Return, return, O Shulamite; return, return, that we may gaze upon thee. What will ye see in the Shulamite? As it were the mecholat Machanayim (dance of the Machanayim [see Bereshis 32:3])."}]