[{"num":21,"verse":"1 Of the destruction of Babylon by the Persians and Medes. 11 The ruin of Idumea,  13 and of Arabia."},{"num":1,"verse":"The burden of the desert sea. As the whirlwinds in the South used to pass from the wilderness, so shall it come from the horrible land."},{"num":2,"verse":"A grievous vision was showed unto me, The Transgressor against a transgressor, and the destroyer against a destroyer. Go up Elam, besiege Media: I have caused all the mourning thereof to cease."},{"num":3,"verse":"Therefore are my loins filled with sorrow: sorrows have taken me as the sorrows of a woman that travaileth: I was bowed down when I heard it, and I was amazed when I saw it."},{"num":4,"verse":"Mine heart failed: fearfulness troubled me: the night of my pleasures hath he turned into fear unto me."},{"num":5,"verse":"Prepare thou the table: watch in the watch tower: eat, drink: arise, ye princes, anoint the shield:"},{"num":6,"verse":"For thus hath the Lord said unto me, Go, set a watchman, to tell what he seeth."},{"num":7,"verse":"And he saw a chariot with two horsemen: a chariot of an ass, and a chariot of a camel: and he hearkened and took diligent heed."},{"num":8,"verse":"And he cried, A lion: my Lord, I stand continually upon the watch tower in the daytime, and I am set in my watch every night:"},{"num":9,"verse":"And behold, this man’s chariot cometh with two horsemen. And he answered and said, Babel is fallen: it is fallen, and all the images of her gods hath he broken unto the ground."},{"num":10,"verse":"O my threshing, and the corn of my floor. That which I have heard of the Lord of hosts the God of Israel, have I showed unto you."},{"num":11,"verse":"¶ The burden of Dumah, he calleth unto me out of Seir, Watchman, what was in the night? Watchman, what was in the night?"},{"num":12,"verse":"The watchman said, The morning cometh, and also the night. If ye will as he, inquire: return and come."},{"num":13,"verse":"¶ The burden against Arabia. In the forest of Arabia shall ye tarry all night, even in the ways of Dedanites."},{"num":14,"verse":"O inhabitants of the land of Tema, bring forth water to meet the thirsty, and prevent him that fleeth with his bread."},{"num":15,"verse":"For they flee from the drawn swords, even from the drawn sword, and from the bent bow, and from the grievousness of war."},{"num":16,"verse":"For thus hath the Lord said unto me, Yet a year according to the years of an hireling, and all the glory of Kedar shall fail."},{"num":17,"verse":"And the residue of the number of the strong archers of the sons of Kedar shall be few: for the Lord God of Israel hath spoken it."}]