[{"header":"Babylon to Be Destroyed"},{"num":21,"verse":"The special word about the place by the sea where no people live: As wind-storms in the Negev go rushing through, it comes from the desert, from a bad land. "},{"num":2,"verse":"A hard special dream has been shown to me. The one who hurts still goes on hurting others, and the destroyer still destroys. Go up, Elam. Gather your armies around, Media. I will bring an end to all the crying she has caused. "},{"num":3,"verse":"For this reason my body is full of suffering. Pains have taken hold of me like the pains of a woman giving birth. I am so troubled that I cannot hear. I am so afraid that I cannot see. "},{"num":4,"verse":"My mind turns. Fear has come over me. The evening I have waited so long for has been turned into a time of shaking with fear. "},{"num":5,"verse":"They set the tables. They spread out the cloth. They eat and drink. Rise up, captains, oil the battle-coverings! "},{"num":6,"verse":"For the Lord says to me, “Go, set a man to keep watch. Let him tell what he sees. "},{"num":7,"verse":"When he sees men riding on horses, two by two, and men on donkeys, and men on camels, let him be very careful to watch.” "},{"num":8,"verse":"Then the watchman called out like a lion, “O Lord, I stand watching from the watch-tower at all times during the day. And I stand there every night. "},{"num":9,"verse":"Now see, here comes an army of men riding on horses, two by two.” One answered and said, “Fallen, fallen is Babylon. All the objects of her gods are broken to pieces on the ground.” "},{"num":10,"verse":"O my people of Israel, you were beaten and crushed like grain! What I have heard from the Lord of All, the God of Israel, I make known to you."},{"header":"Word about Edom"},{"num":11,"verse":"The special word about Edom: One is calling to me from Seir, “Watchman, what is the time of night? Watchman, what is the time of night?” "},{"num":12,"verse":"The watchman says, “The morning comes, but also the night. If you have questions to ask, ask them, and come back again.”"},{"header":"Word about Arabia"},{"num":13,"verse":"The special word about Arabia: You must stay the night among the trees of Arabia, O traveling people of Dedanim. "},{"num":14,"verse":"Bring water for the thirsty. O people of the land of Tema, give bread to the one who is running from trouble. "},{"num":15,"verse":"They are running from swords, from lifted swords, from bows that are ready to shoot, and from the trouble of battle. "},{"num":16,"verse":"For the Lord said to me, “In a year, as the servant would count it, all the greatness of Kedar will come to an end. "},{"num":17,"verse":"And the rest of the men who use the bow, the strong men of the sons of Kedar, will be few. For the Lord God of Israel has spoken.”"}]